{"id":217058,"name":"machine","type":"noun","us_sound":"məˈʃiːn","us_link":"../audio/m/machine.mp3","uk_sound":"məˈʃiːn","uk_link":"../audio/m/ukmaced007.mp3","content":"machine noun [C]\n(PIECE OF EQUIPMENT)\nAdd to word list\nAdd to word list\nA2 a piece of equipment with several moving parts that uses power to do a particular type of work: The different sizes of eggs are sorted by a machine. If I'm not home when you call, leave a message on the machine (= answering machine). Don't forget to put the towels in the machine (= washing machine) before you go out. I got from a vending machine.\nMore examplesFewer examplesDoctors kept him alive on a life-support machine.There is a vending machine on the platform that dispenses snacks.The machine emits a high-pitched sound when you press the button.This sewing machine is operated by a foot pedal.I need some coins for the ticket machine in the car park.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nmachine noun [C]\n(COMPUTER)\na computer: You'll need a powerful machine for editing videos.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nmachine noun [C]\n(VEHICLE)\ninformal a vehicle, often a motorcycle: approving That's a mean (= powerful) machine you've got there, Bill.\nSMART Vocabulary: related words and phrases\nRoad vehicles in general\nairboard\nall-terrain vehicle\namphibian\nATV\nautorickshaw\ncraft\ndiesel\nHEV\nHOV\nhoverboard\nhybrid\nhybrid electric vehicle\nmotor vehicle\nmotorcade\nnon-motorized\nrover\nsnow groomer\nsnowcat\nvehicle\nvehicular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMotorbikes\nmachine noun [C]\n(GROUP OF PEOPLE)\na group of people who control and organize something: Churchill's war machine The party machine has swung into action with its preparation for the election. It's now up to the government's propaganda machine to restore the leader's image.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nto sew cloth with a sewing machine: I've almost finished making the curtains - I just have to machine the hem.\nto cut or shape metal on a machine: Tungsten carbide tools are used extensively for machining steel.\nSMART Vocabulary: related words and phrases\nKnitting & sewing\nappliqué\nappliquéd\nAran\nBargello\nbaste\nhandknit\nhandknitted\nhank\nhem\nintarsia\nreknit\nresew\nrib\nrun something up\nrunning stitch\nsampler\nseam\nseamstress\nsew\nstitch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry: metals & metalworking\nAdd to word list\nAdd to word list\na device with moving parts that uses power to do work of a particular type: a sewing/washing machine an answering machine\npolitics &amp; government A machine is also a group of people who control a political organization: He was a product of an old-line party machine.\nAdd to word list\nAdd to word list\nPRODUCTION a piece of equipment with moving parts that uses power to do a particular type of work: The machines were designed to make bottles from recycled plastic.operate/use a machine Now only a few people are required to operate the computerized machines. install/service a machine Soft drink companies began installing vending machines in schools. Is the machine working again? a machine breaks down The machine broke down and we had to call someone to come and mend it. a washing/sewing/copying machine Slowly feed the paper into the copying machine.a machine for (doing) sth He invented a machine for setting type. They use a special machine to scan the bone. by machine The votes are counted by machine. a machine operator/maker\nIT a computer: You'll need a powerful machine for editing videos. Most machines running these programs have poor network connections.\na group of people who control and organize something: political/publicity machine The publicity machine will not quit when the book tour grinds to a halt. The hard left wanted ministers to be accountable to the party machine. His business empire has grown into a well-oiled machine.\nSee also\nanswering machine\nautomated teller machine\ncancellation machine\ncash machine\ndictation machine\nfax\nfranking machine\nmailing machine\ntape machine\nticker-tape machine\nView all\nvending machine\nPRODUCTION to make or change the shape of something using a machine: Each hole has to be accurately machined. The sides are carefully machined to fit the cylinders."}