{"id":217069,"name":"machinery","type":"noun","us_sound":"məˈʃiː.nɚ.i","us_link":"../audio/m/machinery.mp3","uk_sound":"məˈʃiː.nər.i","uk_link":"../audio/m/ukmaced008.mp3","content":"machinery noun [U]\n(MACHINES)\nAdd to word list\nAdd to word list\nC1 a group of large machines or the parts of a machine that make it work: industrial/farm machinery His hand was injured when he got it caught in the machinery.\nMore examplesFewer examplesThe tunnel was dug with the aid of heavy machinery.The machinery company was a front operation for arms smuggling.The noise of the machinery made her voice inaudible.Nuts and bolts are used to hold pieces of machinery together.Do you know how to run this sort of machinery?\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\ncrankshaft\nflywheel\ngenerator\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nmachinery noun [U]\n(PROCESS/ORGANIZATION)\nthe structure and systems of an organization or process: bureaucratic/political/decision-making machinery the machinery of government\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nAdd to word list\nAdd to word list\na group of machines, or the movable parts of a machine: farm machinery Some of the older machinery breaks down frequently.\nAdd to word list\nAdd to word list\nPRODUCTION a group of large machines or large machines in general: agricultural/industrial/farm, etc. machinery They use modern farm machinery, such as combine harvesters. The workshops are fitted with modern plant machinery.drive/operate/use machinery If you feel tired, you should not drive or operate heavy machinery. What happens if the machinery breaks down?machinery goes/runs/works They keep the machinery working all night.machinery manufacturer/supplier The site is owned by a textile machinery manufacturer. Loose clothing may get caught in the machinery.\nthe structure and systems of an organization or process: The Prime Minister made major changes to the machinery of government. the bureaucratic/political/decision-making machinery See also\nheavy machinery\noffice machinery"}