{"id":217648,"name":"magazine","type":"noun","us_sound":"ˌmæɡ.əˈziːn","us_link":"../audio/m/magazine.mp3","uk_sound":"ˌmæɡ.əˈziːn","uk_link":"../audio/m/ukmade_009.mp3","content":"magazine noun [C]\n(BOOK)\nAdd to word list\nAdd to word list\nA2 (informal mag) a type of thin book with large pages and a paper cover that contains articles and photographs and is published every week or month: She has written articles for several women's magazines. a glossy magazine men's mags a magazine rack\npictafolio/E+/GettyImages\nMore examplesFewer examplesI bought a magazine to amuse myself while I was on the train.She buys all the latest fashion magazines.Many women of normal weight feel unable to identify with the super-thin models in glossy magazines.Our latest publication is a magazine for health enthusiasts.I decided to take out a subscription to a gardening magazine.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\ntabloid\nSee more results »\nmagazine noun [C]\n(GUNS)\na part of a gun in which cartridges are stored\nAlthom/iStock/Getty Images Plus/GettyImages\na building in which explosives, weapons, and supplies are kept\nSMART Vocabulary: related words and phrases\nParts of guns\nbanana clip\nbarrel\nbore\nbump stock\nbusiness end\nbutt\nclip\nflint\nhammer\nholster\nmuffler\nmuzzle\nramrod\nsafety catch\nsight\nstock\ntampion\ntrigger\nturret\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuildings for storing things\nArms & munitions in general\nAdd to word list\nAdd to word list\na type of thin book with a paper cover that is published regularly and usually contains articles and photographs: a weekly/monthly magazine\nA magazine on television is a regularly broadcast program that reports about news events or other true stories.\nAdd to word list\nAdd to word list\na thin book with large pages and a paper cover which contains articles and photographs and is published every week or month: launch/produce/run a magazine We plan to launch a new magazine next year.edit/print/publish a magazine The magazine is published fortnightly.men's/women's magazines She has written for several women's magazines. I mainly read music magazines.a business/industry/specialist magazine The event was advertised in industry magazines.a fashion/glossy/lifestyle magazine She appeared in the fashion magazine, Vogue.a weekly/bi-monthly/monthly magazine He's the editor of a leading weekly news magazine.copy/edition/issue of a magazine Her article appears in the current issue of the magazine. See also\nconsumer magazine\nin-house magazine\ntrade magazine"}