{"id":217785,"name":"magnetic","type":"adjective","us_sound":"mæɡˈnet̬.ɪk","us_link":"../audio/m/eus72868.mp3","uk_sound":"mæɡˈnet.ɪk","uk_link":"../audio/m/ukmade_024.mp3","content":"magnetic adjective\n(PHYSICS)\nAdd to word list\nAdd to word list\nC1 (of a metal object or material) able to attract objects or materials containing iron or steel: The knife sharpener is magnetic to attract the fine particles shaved off during sharpening rather than leaving them on the blade.\nable to be attracted by a magnet (= an object that is able to attract iron and steel objects): Iron, steel, nickel, and cobalt are magnetic metals. The magnetic properties of iron make it easy to separate steel products from other waste.\nusing or relating to magnetism (= the power of being able to attract iron and steel objects): Treatments that involve magnetic therapy may be helpful in the treatment of these symptoms. Inductance is the ratio of total magnetic flux to current through the device.\nMore examplesFewer examplesA magnetic coil controls the electrons in a television’s tube.Metal will mess with the magnetic needle and you won't know which direction is up.The machine scans the magnetic strip on the back of the credit card.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnetism\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nmagnetic adjective\n(ATTRACTIVE)\nC1 used to describe someone whose personality attracts a lot of people: His magnetic personality and infectious enthusiasm meant that he had many friends. There's something very magnetic about Susan.\nThesaurus: synonyms, antonyms, and examples\ndrawing your attentionattractiveHe's an attractive, intelligent man.appealingShe has an appealing sense of humour.engagingHe is a very engaging conversationalist.adorableShe has an adorable little sister.lovelyHe's such a lovely lad.sweetYour kids are so sweet.\nSee more results »\nMore examplesFewer examplesHe is very magnetic and charming.Her character is so magnetic that every day spent with her is exciting.Onscreen, he is magnetic as he melts into his characters.\nSMART Vocabulary: related words and phrases\nAttractive\nadorable\nadorably\nadorbs\naesthetic\naesthetically\ndelicate\ndisarming\ndisarmingly\ndistinguished\ndreamy\nloveliness\nlovely\nlusciously\nmagnetically\nmagnificent\nstunningly\nsuave\nsuavely\nsuit\nsuper-cute\nSee more results »\nOpposite\nnon-magneticSee also\naeromagnetic\nanti-magnetic\nelectromagnetic\nferromagnetic\ngeomagnetic\nparamagnetic\nthermomagnetic\nmagnetic field physics\nAdd to word list\nAdd to word list\nA magnetic field is the area around a magnet that is affected by the power of the magnet."}