{"id":218237,"name":"maintenance","type":"noun","us_sound":"ˈmeɪn.tən.əns","us_link":"../audio/m/maintenance.mp3","uk_sound":"ˈmeɪn.tən.əns","uk_link":"../audio/m/ukmains003.mp3","content":"maintenance noun [U]\n(WORK)\nAdd to word list\nAdd to word list\nB2 the work needed to keep a road, building, machine, etc. in good condition: Old houses need a lot of maintenance. There are thorough maintenance checks on each plane before take-off. The magazine offers tips on cutting your house maintenance costs.\nMore examplesFewer examplesThe network will be down for an hour for routine maintenance.The new ships, propelled by gas turbines, require less maintenance than older, steam-driven ones.This course is designed to give drivers a grounding in car maintenance.There is a risk that the debt-ridden airline that may be tempted to scrimp on maintenance or security.It's just a regular maintenance shutdown.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nmaintenance noun [U]\n(MONEY)\nUK money that a person must pay regularly by law in order to support their child or previous marriage partner after a divorce (= official end to a marriage): He refused to pay maintenance for his three children.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: ending & divorce\nmaintenance noun [U]\n(CONTINUED EXISTENCE)\na situation in which something continues to exist or is not allowed to become less: the maintenance of living standards\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nmaintenance noun [U]\n(CONTINUING TO HAVE)\nAdd to word list\nAdd to word list\nthe process of keeping or continuing something: The office is charged with the maintenance of customary practices and ceremonies.\nmaintenance noun [U]\n(PRESERVING)\nthe work needed to keep something in good condition: Bridges require a lot of maintenance.\nAdd to word list\nAdd to word list\nthe activity of keeping a building, vehicle, road, etc. in good condition by checking it regularly and repairing it when necessary: Refineries typically schedule yearly maintenance. Components necessary for the maintenance of our fleet of helicopters often have to be ordered from abroad. The city budget for street repair and maintenance was cut for this fiscal year. maintenance work/services/procedures maintenance contracts/costs maintenance workers/staff/crew rail/road/building maintenanceperform/provide/carry out maintenance We have a large team of IT staff who provide ongoing system and applications maintenance.bad/poor/routine maintenance A leak in the pipeline was discovered during routine maintenance and inspection work.\nthe process of making sure that something continues in the same way or at the same level: Authorities consider these measures to be necessary for the maintenance of sound health and sanitary conditions at the factory.\nFINANCE, LAW regular payments that a person must make by law in order to support their child or previous marriage partner, for example after a divorce : She continues to receive maintenance payments from her former partner. See also\nresale price maintenance\ntotal productive maintenance"}