{"id":218218,"name":"mainstream","type":"adjective","us_sound":"ˈmeɪn.striːm","us_link":"../audio/m/mainstream.mp3","uk_sound":"ˈmeɪn.striːm","uk_link":"../audio/m/ukmains001.mp3","content":"Add to word list\nAdd to word list\nC2 considered normal, and having or using ideas, beliefs, etc. that are accepted by most people: This is the director's first mainstream Hollywood film.\neducation\n&#160; specialized used to refer to education for children who can be taught in the same way as most other children, or to people, schools, etc. connected with this type of education: Many youngsters have been out of mainstream education for so long that they cannot adapt to a formal learning environment. Many estimate that up to 20% of children in mainstream classrooms may have some special needs. mainstream children/students/teachers\nMore examplesFewer examplesWorld Music is now well established and popular with mass audiences and mainstream companies.He is not known within mainstream literary circles.They cater for mainstream musical tastes.She is excluded from mainstream life.Mainstream journals did not cover the story.\nSMART Vocabulary: related words and phrases\nGeneral\nabstract\nabstraction\nabstractly\nacross-the-board\nall-purpose\nbroad\nby and large idiom\nchiefly\nessence\ngeneral\ngeneralist\ngenerally\nnon-personal\non the whole idiom\noverall\nportmanteau\nprimarily\nsense\nstuff\nwhole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of education\nTeaching in general\nthe mainstream\nthe way of life or set of beliefs accepted by most people: The new law should allow more disabled people to enter the mainstream of American life.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionalist\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nSee more results »\nto make something start to be considered normal: Political rhetoric mainstreams hostility. Mainstreaming equality means that equality should not be catered for only by specific programmes or initiatives.\neducation\n&#160; US specialized to teach children with special needs in the same class or school as children who do not have special needs: The school has been mainstreaming children with special needs successfully for almost 20 years. We didn't know if he could be mainstreamed.\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstreaming\nmake it a rule idiom\nmechanical\nninety\noften\nordinarily\nper\nprevail\npro forma\nregulation\nsurprise, surprise idiom\nterritory\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTeaching in general\nTypes of education\nAdd to word list\nAdd to word list\n(of beliefs or behavior) common and shared by most people, or representing such beliefs or behavior: The story was largely ignored by the mainstream press.\nto place children with special needs in regular classes at school: The district was ordered to mainstream more children with disabilities.\nmost of a society: New laws will allow more disabled people to enter the mainstream.\nAdd to word list\nAdd to word list\nmainstream organizations, ideas, etc. are those that are considered normal, and accepted or used by most people: mainstream media/press Mainstream media are ignoring the real problems.mainstream culture/politics/society Cell phones have been a part of mainstream culture since the 1990s.mainstream education/school It should be possible to include children with behavioural problems within mainstream education.\nthe way of life or set of beliefs practised or accepted by most people: cultural/political mainstream Our nation's political mainstream will never allow such a constitutional change. The new law should allow more disabled people to enter the mainstream of the American workforce.\nHR, SOCIAL RESPONSIBILITY to include people who have particular difficulties or needs in the same schools or places of work as everyone else: When the children of immigrants are mainstreamed, they learn the new language within months.mainstream sb into sth People with disabilities are being mainstreamed into community jobs.\nto make something become accepted as normal by most people: The recession is mainstreaming the part-time economy."}