{"id":218182,"name":"mainland","type":"adjective","us_sound":"ˈmeɪn.lænd","us_link":"../audio/m/eus72873.mp3","uk_sound":"ˈmeɪn.lænd","uk_link":"../audio/m/epd32360.mp3","content":"Add to word list\nAdd to word list\nrelating to or forming the main part of a country or continent, not including the islands around it: mainland China Hawaii's cost of living is estimated at about 20 percent to 30 percent higher than most mainland communities.\nMore examplesFewer examplesThe number of cars on mainland roads-about 20 million-is expected to increase by 2.5 million this year alone.This has been encouraged by developments in the international financial markets and by French aspirations to establish Paris as mainland Europe's prime financial centre.About 40 percent of the polar bear dens on the mainland coast of the Beaufort Sea are in the area proposed for oil exploration.\nSMART Vocabulary: related words and phrases\nGeography: small & large land masses\narchipelago\natoll\ncay\ncontinent\ncontinental\ncontinentally\ncoral reef\ndesert island\nfloating island\ninterisland\nisland\nisle\nkey\nlandform\nlandlocked\nlandmass\nPangaea\nsubcontinent\nthe main part of a country or continent, not including the islands around it: They recently built a bridge between the mainland and the closest island.\nSMART Vocabulary: related words and phrases\nGeography: small & large land masses\narchipelago\natoll\ncay\ncontinent\ncontinental\ncontinentally\ncoral reef\ndesert island\nfloating island\ninterisland\nisland\nisle\nkey\nlandform\nlandlocked\nlandmass\nPangaea\nsubcontinent\nAdd to word list\nAdd to word list\nthe main part of a country or continent, not including the islands around it: The island is accessible by ferry from the mainland.\nAdd to word list\nAdd to word list\nthe main part of a country or continent, not including the islands around it: on the mainland He does all his banking on the mainland, but he lives on the island. the Chinese/American/European, etc. mainland\nbelonging to or on the main part of a country or continent: mainland China/Europe/Greece, etc. The firm is opening new stores across the UK and mainland Europe. a mainland company/city/market"}