{"id":218175,"name":"main","type":"adjective","us_sound":"meɪn","us_link":"../audio/m/eus72872.mp3","uk_sound":"meɪn","uk_link":"../audio/m/ukmagni023.mp3","content":"Add to word list\nAdd to word list\nB1 larger, more important, or having more influence than others of the same type: The main thing is not to worry. One of the main reasons I came to England was to study the language. You'll find the main points of my proposal in the report. Our main aim/objective is to improve the company's productivity. The main problem is a lack of resources. My main concern about moving to San Fransisco is the cost of housing.\nMore examplesFewer examplesThey dropped me off at the main entrance.Press Esc to return to the main menu.You'll be examined in three main areas; speaking, listening and reading comprehension.The main crops grown for export are coffee and rice.The opportunity to travel is one of the main attractions of this job.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nIdiom\nbe someone's main squeeze\nmain noun\n(PIPE)\n[ C ] a large pipe that carries water or gas, or a wire carrying electricity, from one place to another, to which a house can be connected: a gas main The severe cold caused a water main to burst and flood the street. mains [ plural ] UK\nthe system of pipes or wires that carry water or electricity into a house, or the pipes that carry sewage away from a house: The house isn't on the mains.\nSee more the mains UK\nthe place at which outside pipes or wires carrying water, electricity, etc. connect with the system inside a house or building: Switch off the electricity at the mains before starting work.\nSee more\nSMART Vocabulary: related words and phrases\nBuilding: plumbing, pipes & sewage\nballcock\ncaulking\ncesspit\ncistern\nconduit\nhydrant\ninfluent\nisolator\nmixer tap\noutfall\nplumb\nplunger\nsewage\nsewage works\nsewer\nsiphon\nspigot\nstandpipe\nsyphon\nwaterworks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectrical components & circuitry\nmain noun\n(PART OF MEAL)\n[ C ] mainly UK the largest or most important part of a meal when the different parts of the meal are served separately: We each had different entrees and different mains. For my main, I went with the tiger prawn penne pasta. Synonym\nmain course\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\nmain noun\n(MOSTLY)\nin the main\ngenerally or mostly: Her friends are teachers in the main.\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nworth\nSee more results »\nmain adjective [not gradable]\n(MOST IMPORTANT)\nAdd to word list\nAdd to word list\nmost important or larger: The main thing is to keep calm and don’t get angry. The main social event of the summer was a dance and reception.\nmain noun [C]\n(PIPE)\na large pipe that is part of the system carrying water or gas from one place to another: A water main burst and flooded the street.\nAdd to word list\nAdd to word list\nbiggest or most important: The report identified three main areas for improvement. Please go to the reception desk at the main entrance. British Airways, the company's main rival, had also seen an improvement . the main problem/reason/objective"}