{"id":218226,"name":"maintain","type":"verb","us_sound":"meɪnˈteɪn","us_link":"../audio/m/maintain.mp3","uk_sound":"meɪnˈteɪn","uk_link":"../audio/m/ukmains002.mp3","content":"maintain verb [T]\n(CONTINUE TO HAVE)\nAdd to word list\nAdd to word list\nB2 to continue to have; to keep in existence, or not allow to become less: The army has been brought in to maintain order in the region. We have standards to maintain. Despite living in different countries, the two families have maintained close links. The film has maintained its position as the critics' favourite for another year.\nMore examplesFewer examplesWith an election approaching, the prime minister is keen to maintain his popularity.The Queen has maintained political neutrality throughout her reign.Security during the president's visit must be maintained at all costs.Several of the teachers were quite unable to maintain discipline.The United Nations has maintained a presence in the region for some time.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nmaintain verb [T]\n(KEEP IN GOOD CONDITION)\nB2 to keep a road, machine, building, etc. in good condition: A large house costs a lot to maintain. The roads in the town have been very poorly maintained.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nreclaim\nrecycle\nrecycled\nreprieve\nrescue\nrescuer\nreusable\nrewild\nsustain\nunappropriated\nunassigned\nundesignated\nupcycle\nupcycling\nSee more results »\nmaintain verb [T]\n(EXPRESS)\nC2 to express firmly your belief that something is true: Throughout his prison sentence, Dunn has always maintained his innocence. [ + that ] He maintains that he has never seen the woman before.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the newspapers, records, etc.according toAccording to reports, the ceasefire is holding.as stated by/inAs stated by medical experts, these products are totally safe when used correctly. as maintained byThere is no reason to change your diet, as maintained by some lifestyle experts.as claimed bySo-called superfoods will not make you live longer, as claimed by some advertising.\nSee more results »\nMore examplesFewer examplesHe maintains that he was nowhere near the house.They still maintain their innocence.He firmly maintains that he was there at the time.They maintain that their story is true.The management maintain they did everything they could to avoid the disaster.\nSMART Vocabulary: related words and phrases\nAssertions & asserting\naffirm\naffirmation\nairing\nassert\nassert your right\nassertion\nbeg\nemphatic\ngaslight\nhate speech\nlay something on the line idiom\nmake something/someone out\nplead\npretend\nput your foot down idiom\nself-affirmation\nsend\nsend a message idiom\nset yourself up as something\nshout/proclaim something from the rooftops idiom\nSee more results »\nmaintain verb [T]\n(PROVIDE)\nto provide someone with food and whatever is necessary for them to live on: They barely earn enough to maintain themselves and their four children.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nmaintain verb [T]\n(CONTINUE TO HAVE)\nAdd to word list\nAdd to word list\nto continue to have; to keep in existence, or not allow to become less: Despite living in different states, the two families have maintained a close friendship. You have to maintain a minimum balance in your checking account.\nmaintain verb [T]\n(PRESERVE)\nto keep something in good condition: A large house costs a lot to maintain.\nmaintain verb [T]\n(EXPRESS)\nto express strongly your belief that something is true: [ + (that) clause ] She maintains (that) she’s being criticized simply for telling the truth.\nAdd to word list\nAdd to word list\nto make something continue in the same way or at the same level: Maintaining a company's brand and reputation requires a lot of hard work. Charities need only give 5% of proceeds each year to maintain a tax exemption. We have been able to maintain prices for our customers at their current level. The college has maintained links with similar institutions in other parts of the country.\nto keep a building, machine, road, etc. in good condition by checking it regularly and repairing it if necessary: The premises are clean and well maintained. Communication is made difficult by the poorly maintained road network. The commission operates and maintains 20 river bridges.\nFINANCE to make regular payments in order to support someone financially or to keep something that you already own: More and more people are struggling to afford the cost of maintaining a home.\nto say firmly that something is true: maintain (that) Senior accountants at the firm maintained they knew nothing of the transactions."}