{"id":218361,"name":"majority","type":"noun","us_sound":"məˈdʒɔː.rə.t̬i","us_link":"../audio/m/eus72875.mp3","uk_sound":"məˈdʒɒr.ə.ti","uk_link":"../audio/m/ukmains014.mp3","content":"majority noun\n(NUMBER)\nAdd to word list\nAdd to word list\nB2 [ S ] the larger number or part of something: The majority of the employees have university degrees. A large majority of people approve of the death sentence. In Britain women are in the/a majority. Compare\nminority (SMALL PART)\n[ C ] in an election, the difference in the number of votes between the winning person or group and the one that comes second: The Democratic candidate won by a narrow/large majority.\nMore examplesFewer examplesThe majority of young professionals in the capital have moved there from provincial towns.In the past, the majority of women were consigned to a lifetime of servitude and poverty.The majority of people in the town strongly support the plans to build a by-pass.A couple of people objected to the proposal, but the vast majority approved of it.A large majority of the population is demanding the restoration of the former government.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax out\nmaximal\nmaximally\nmaximum\nmin.\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElections\nmajority noun\n(AGE)\n[ U ]\n&#160; law\n&#160; specialized the age when you legally become an adult: the age of majority She will inherit her father's estate when she reaches her majority.\nSMART Vocabulary: related words and phrases\nStages of life\nadolescence\nadult life\nadulthood\nadultification\nadultify\ncoming of age\nday\nearly years\nephebe\nhealthspan\nheyday\nin my day idiom\nin your salad days idiom\nIndian summer\nrite of passage\nsalad\nschooldays\nsomeone's declining years idiom\nthose were the days idiom\ntwilight years idiom\nSee more results »\nAdd to word list\nAdd to word list\nmore than half of a total number or amount; the larger part of something: A majority of the people voted against the bill to raise school taxes.\npolitics &amp; government A majority is also the difference in the number of votes in an election between the winning person or group and the one that has the second highest number: [ C ] The Republicans won by a small majority.\nAdd to word list\nAdd to word list\n[ S ] most of the people or things in a group: The majority of our prepayment customers are people on a low income. Improved economic conditions for the majority have led to big increases in ownership of consumer goods, cars, houses, and clothing.vast/overwhelming/great majority (of sth) The vast majority of tickets are sold through the website.be in a/the majority Men are still in the majority when it comes to senior management positions.\n[ C ] the difference between the number of votes received by a political party, group, etc. that wins an election or discussion and the parties or groups that lose: The amendment has divided Democrats and could cost the party its newly won majority. majority voting/a majority voteby a majority of sth to sth A recent poll found that voters were in favor of the resolution by a majority of 71% to 24%. clear/comfortable/large majority The chairman must continue taking votes until one nominee has a clear majority.\n[ U ]\n&#160; LAW the age at which someone is legally considered to be an adult: someone's majority She will inherit the business when she reaches her majority.\nSee also\nearly majority\nlate majority\nFINANCE, STOCK MARKET used to refer to the situation when a person or organization owns more shares in a company than any other shareholder, and enough to be in control of the company: According to government requirements, the airline must not fall into foreign majority control. The group's majority shareholder has been accused of withholding financial data. Profits have soared, thanks in part to the company's majority ownership of the country's most successful newspaper group."}