{"id":218392,"name":"maker","type":"noun","us_sound":"ˈmeɪ.kɚ","us_link":"../audio/m/maker.mp3","uk_sound":"ˈmeɪ.kər","uk_link":"../audio/m/ukmains018.mp3","content":"Add to word list\nAdd to word list\nB2 the people or company that make something: They're the biggest maker of fast-food products in the UK The makers of the film will want to see a decent return on their investment. your Maker\nGod: humorous He's gone to meet his Maker (= he has died).\nSee more\na person or machine that makes the stated thing: a filmmaker a dressmaker a watchmaker car makers policy-makers a coffee maker See also\nbookmaker\nholidaymaker UK\nhomemaker mainly US\nicemaker\nkingmaker\nmatchmaker\npacemaker (RUNNER)\npeacemaker\ntroublemaker\nsomeone who creates or invents things, either using traditional crafts or technology: There are spaces where makers can come and learn modern ways of manufacturing new products using devices like laser cutters and 3D printers. Dale Dougherty is the creator of Maker Faire, which leads a growing maker movement .\nMore examplesFewer examplesStradivarius was a famous violin maker.The programme makers reject the notion that seeing violence on television has a harmful effect on children.The makers should provide an instruction manual on how to use the product.We really ought to send this back to the maker and complain - after all, it wasn't cheap.Many of the people on the island are textile makers by trade.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nAdd to word list\nAdd to word list\na person, company, or machine that makes a particular thing: Who are the policy-makers in the department? a coffee-maker See also\ndecision-maker\nmarket-maker\nmoneymaker\norder-maker\nPRODUCTION a person or company that makes a particular type of product: Makers of the latest mobile email device have settled a lawsuit that threatened to cut off their service. The merchandise was returned to the maker. a car/computer/software, etc. maker"}