{"id":218383,"name":"make","type":"verb","us_sound":"meɪk","us_link":"../audio/m/make.mp3","uk_sound":"meɪk","uk_link":"../audio/m/ukmains015.mp3","content":"make verb\n(PRODUCE)\nAdd to word list\nAdd to word list\nA1 [ T ] to produce something, often using a particular substance or material: Do you want me to make some coffee? He made a chocolate cake. She makes all her own clothes. [ + two objects ] He made us some coffee./He made some coffee for us.is made to The pot is made to withstand high temperatures. He works for a company that makes furniture. The label on the box said \"made in China\".is made out of/from Butter is made out of/from milk.(be) made of earrings made of goldmake something of someone Her new trainer has promised to make an Olympic athlete of her.\nThesaurus: synonyms, antonyms, and examples\nto make somethingmakeCan I make you a cup of coffee?produceCalifornia produces a lot of grapes.createLeonardo da Vinci created the masterpiece we know as \"Mona Lisa\".inventAlexander Graham Bell is credited with inventing the telephone.developThey are working to develop the next generation of underwater vehicles.manufactureThe car is manufactured in Germany.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto build somethingbuildThe house was built in the 1950s.constructThe company wants to construct a 175-mile pipeline.put something upPutting up a wall will not solve the problem.erectIt's unlawful to erect a building until you get approval.assembleHe has a job assembling furniture in a warehouse.put togetherWithout the instruction sheet, I've got no idea how to put all these parts together.\nSee more results »\nA1 [ T ] To make a film or television programme is to direct, produce it, or act in it: John Huston made some great movies. The movie was made by Goldcrest Productions. So why didn't Garbo make any films after 1941?\nMore examplesFewer examplesCould you make a copy of this report for tomorrow's meeting, please?If you make the main course, I'll make a dessert.To make an omelette you must first beat the eggs.He works for a company that makes aircraft parts.Crude oil is used as the raw material for making plastics.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: production, direction & recording\nmake verb\n(CAUSE)\nB1 [ T ] to cause something: The kids made a real mess in the kitchen. The bullet made a hole right through his chest. [ + infinitive without to ] The wind is making my eyes water. What made you change your mind? Just seeing Woody Allen's face is enough to make me laugh. The photograph makes me look about 80!\nMore examplesFewer examplesExercise can make a big difference to your state of health.What makes you think that you are qualified for this job?I felt so ashamed of myself for making such a fuss.The wine made a big stain on his shirt.The loud explosion made everyone jump.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nmake verb\n(CAUSE TO BE)\n[ T ] to cause to be, to become, or to appear as: [ + noun ] It's the good weather that makes Spain such a popular tourist destination. [ + past participle ] She had to shout to make herself heard above the sound of the music. I can make myself understood in French, but I'm not fluent. They went up to the Ambassador and made themselves known (to her). [ + adj ] The company accounts have not yet been made public.made easy The book's advertised as \"navigation made easy\". The president has made Henry Paulson his Secretary of the Treasury.make that I'll have a steak - no, make that chicken.\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\nmake certain/sure\nA2 to take action so that you are certain that something happens, is true, etc.: I'll just make sure I've turned the oven off.\nSee more\nMore examplesFewer examplesDo sit down and make yourself comfortable.The empty roads make this area good cycling country.Many things make it difficult for women to reach the top in US business.Your rosy cheeks always make you look so healthy.Don't stand over me all the time - it makes me nervous.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nmake verb\n(FORCE)\nmake someone/something do something\nB1 to force someone or something to do something: You can't make him go if he doesn't want to.\nSee more be made to do something\nto be forced to do something: The prisoners are made to dig holes and fill them up again.\nSee more\nmake verb\n(PERFORM)\nA2 [ T ] to perform an action: I have to make a phone call. Somebody has made a donation of £1 million to the charity Oxfam. I need to make a doctor's appointment. On foot they could only make about 20 miles a day.make a decision We must make a decision by tomorrow.make an effort You're not making any effort.make a mistake/an error Someone has made a mistake/an error.make progress We're making good progress.make a request She has made a request for a new car.make an offer We made an offer of £450,000 for the house.make a speech She made a short speech.make a start Is it time to make a start on the work?make a suggestion Can I make a suggestion?make good time We made good time getting across town.make trouble There's a drunk at the door making trouble. make room/space/way\nC2 If you make room/space/way for something or someone, you move your body or move other things, so that there is space for it or them: I was wondering if I could make room for a grand piano somewhere in my house.\nSee more make a bed\nto pull up and tidy the covers on a bed after it has been slept in: She hurried upstairs and quickly made the beds.\nSee more\nMore examplesFewer examplesWe got as far as the school, and there we had to make a right turn.The Queen is making a two-week tour of Australia.She made a rude gesture at the other driver.She gulped down her drink and made a hasty exit.There was a deathly hush after she made the announcement.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\ntake\nwork\nwork a treat idiom\nSee more results »\nmake verb\n(TOTAL)\n[ L only + noun, T ] to produce a total when added together: 12 and 12 make 24. Today's earthquake makes five since the beginning of the year. [ + obj + noun ] I have 29 different teapots in my collection - if I buy this one that'll make it 30.\nMore examplesFewer examplesThere'll be us four there, plus grandma makes five.Three add three makes six.That makes three times you've been late now.What do five sevens make.That makes five exercise sessions this week.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nmake verb\n(CALCULATE)\n[ T + obj + noun ] UK to calculate as: How much do you make the total?make (to be) I make the answer (to be) 105.6. What do you make the time?/What time do you make it?\nMore examplesFewer examplesI make it 2,300.I made it three o'clock exactly when they set off.What do you make his temperature?I make it just gone two o'clock.I make the total £5.69.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nmake verb\n(EARN/GET)\nB2 [ T ] to earn or get: She makes $100,000 a year as a doctor.make a living How do you make a living as a painter? The company has made huge profits/losses. He's very good at making new friends.\nMore examplesFewer examplesI only made a few pounds from the sale.How much do you make in a year?He made himself a lot of enemies.We made a lot of friends through our work.I can't make a living through writing.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nmake verb\n(ARRIVE)\nB1 [ T ] informal to arrive at or reach, especially successfully: make it to She made it to the airport just in time to catch her plane. He made it to the bed and then collapsed. Could you make a meeting at 8 a.m.?/Could you make an 8 a.m. meeting?\nThesaurus: synonyms, antonyms, and examples\nto arrive at a placearriveAfter a long day's travel, we finally arrived.get What time did you get there?reachWe won't reach Miami until evening.makeWe made it to the airport just in time for our flight.get inThe train gets in at 6:40 p.m.turn upShe turned up at my house late one night.\nSee more results »\nMore examplesFewer examplesWe just about made it in time for the show.Can you make next week's meeting?I won't be able to make your party, I'm afraid.I managed to make it to the phone.We made the city by nightfall.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nmake verb\n(GET PLACE)\n[ T ] to succeed in getting a place in a team: She failed to make the Olympic squad.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nmake verb\n(APPEAR IN NEWS)\n[ T ] to appear as a story in the news: His story made the papers back home. The civil war in Mozambique made few headlines around the globe.\nSMART Vocabulary: related words and phrases\nNews reporting & the press\nambulance chaser\nbreaking news\nbury the lede idiom\ncitizen journalism\ncorrespondent\ndispatch\nhot off the press idiom\ninvestigative journalism\ninvestigative journalist\njournalism\njournalist\njournalistic\nphotojournalism\nphotojournalist\npress baron\npress conference\nscoop\nspoiler\nthe Associated Press\nthe Press Association\nSee more results »\nmake verb\n(PERFECT)\n[ T ] informal to cause to be perfect: really make Those little bows around the neck really make the dress!\nSMART Vocabulary: related words and phrases\nPerfect and faultless\nArcadia\nArcadian\nbat a thousand idiom\nblamelessly\nidyllic\nidyllically\nimmaculacy\nimmaculate\nimmaculately\nnon-utopian\non point idiom\nperfectible\nperfection\nperfective\nthe cherry on (top of) the cake idiom\nunimpeachable\nutopia\nutopian\nwhiter than white idiom\nXanadu\nSee more results »\nGrammar\nDo or make?When we use do and make with noun phrases, do focuses on the process of acting or performing something, make emphasises more the product or outcome of an action: …\nMade from, made of, made out of, made withWe often use made from when we talk about how something is manufactured: …\nMade fromWe often use made from when we talk about how something is manufactured: …\nMade ofWe use made of when we talk about the basic material or qualities of something. It has a meaning similar to ‘composed of’: …\nMade out ofWe usually use made out of when we talk about something that has been changed or transformed from one thing into another: …\nMade withWe use made with most often to talk about the ingredients of food and drink: …\nMakeThe verb make can be used in a number of ways. …\nIdioms\nbe made for someone/something\ndo you want to make something/anything of it?\nmake something up as you go along\nmake a day/night/evening/weekend of it\nmake as if to do something\nmake do\nmake it\nmake it quick/fast\nmake it up to someone\nmake it with someone\nMore idioms\nmake like\nmake much/a lot of someone\nmake much of something\nmake or break something\nbe make or break for someone/something\nmake time\nmake to do something\nwhat someone is (really) made of\nyou couldn't make it up\nPhrasal verbs\nmake for somewhere/something\nmake for something\nmake something into something\nmake something of something/someone\nmake something of something\nmake off\nmake off with something\nmake something/someone out\nmake something out\nmake out something\nMore phrasal verbs\nmake out\nmake someone/something over\nmake something over to someone\nmake towards something/someone\nmake something up\nmake someone/something up\nmake up something\nmake up\nmake up for something\nmake up to someone\nmake with something\na type of product or the name of the company that made it: What make is your laptop?\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nIdiom\nbe on the make\nmake verb\n(PRODUCE)\nAdd to word list\nAdd to word list\n[ T ] to bring something into existence, esp. using a particular substance or material; produce: Does that company make computers? Butter is made from cream. My wedding ring is made of gold. He made us some coffee.\nmake verb\n(CAUSE)\n[ T ] to cause something: The kids made a mess in the kitchen. Don’t make any noise.\nmake verb\n(CAUSE TO BE)\n[ T ] to cause something to be, become, or appear in a particular way: If you open some windows, you’ll make it cooler. He said something that made her angry. We can sit closer together and make room (= provide space) for one more. We’re making our attic into a spare bedroom.\nmake verb\n(PERFORM)\n[ T ] to perform an action: I’ve got to make a (phone) call to Ricardo. We must make a decision by tomorrow. Someone has made a mistake. Latisha is making progress in her reading. Can I make a suggestion? We might as well make use of the car, since we’ve got it for the whole weekend. make the bed\nTo make the bed is to put sheets and covers on a bed so that someone can sleep in it, or to straighten them after it has been slept in.\nmake verb\n(FORCE)\n[ T ] to force someone or something to do something: Ambition will make you get up off your sofa and go out and work for what you want.\nmake verb\n(BE OR BECOME)\n[ L ] to be or become something, esp. by having the necessary characteristics: I don’t think he will ever make a good lawyer. Hector and Wanda make a delightful couple. He worked really hard, but he didn’t make the team (= was not chosen to be a member of it).\nmake verb\n(TOTAL)\n[ L ] to add up to (a total): 6 and 6 make 12.\nmake verb\n(EARN)\n[ T ] to earn or get: She makes $70,000 a year. Can you make a living as a painter?\nmake verb\n(ARRIVE)\n[ T ] infml to arrive at or reach: We should make Whitefish Bay by nightfall. He made it to the bed and then collapsed.\nmaker noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈmeɪ·kər/\nThe makers of music videos show a fantasy world. Idioms\nmake a beeline for something\nmake a (big) difference\nmake a face (at someone/something)\nmake a fool (out) of someone\nmake a habit of something\nmake a mountain out of a molehill\nmake a point of doing something\nmake someone's acquaintance\nmake allowances for something\nmake believe\nMore idioms\nmake someone’s blood boil\nmake someone's day\nmake do (with something)\nmake ends meet\nmake fun of someone\nmake good\nmake good on something\nmake good time\n(not) make heads or tails of something\nmake headway\nmake it (big)\nmake light of something\nmake love\nmake much of something\nmake no apologies\nmake no bones about\nmake no difference\nmake or break something\nmake sense\nmake short work of someone/something\nmake sure\nmake that something\nmake the grade (as something)\nmake the most of something\nmake time\nmake up for lost time\nmake up your mind\nmake waves\nmake way for something\non the make\nPhrasal verbs\nmake for somewhere/something\nmake something of something/someone\nmake someone/yourself/something out\nmake over someone/something\nmake out something\nmake out something/someone\nmake out\nmake out\nmake something up to someone\nmake up for something\nMore phrasal verbs\nmake up something\nmake up something\nmake up something\nmake up something\nmake up something\nmake up\nmake off with something\nmake noun [C]\n(PRODUCT)\na particular product, or the name of the company that made it: What make of air conditioner do you recommend?\nAdd to word list\nAdd to word list\nto produce or prepare goods, etc.: The firm is only a small player in the industry, making around 1,000 vehicles a year. We make software that allows mobile employees to connect securely to their corporate networks.made of sth The bottles are made of opaque glass so that the contents cannot be seen.made from sth All our coffee is made from beans sourced locally.\nto earn or receive money: make money Investors are hoping that one day \"green\" companies will make serious money.make $30,000/£500/€75m, etc. The state of Alaska makes around $50 million a year on tobacco taxes. She makes around £100,000 a year as a dentist.make sth on sth They made $500,000 in total on the deal.make a living In this area it's hard to make a living as a gardener.\nto do a particular thing: make a decision/mistake/improvement No major decisions are made without the CEO's approval.make a deal/purchase/offer The deal includes a $25 million break-up fee, which could encourage other bidders to make a competing offer.\nto say something officially or formally: make a recommendation/statement/judgment The audit makes a series of recommendations.make an announcement/a comment/a speech Both parties plan to make an announcement before Christmas.\nto choose someone as something, or employ someone as something: He was made Principal Analyst within a year of joining the company.\nto cause someone or something to be in a particular state: In August this year, she was made redundant from her job at the bank after 15 years' service.make sth available/accessible/user-friendly One of the project's key goals is to make the website available in different languages.\nmake a market (in sth)\nto be ready, willing, and able to buy or sell particular bonds, shares, etc. as a dealer: Western investment banks are being allowed to make a market in Chinese domestic shares.\nmake a payment/loan/investment, etc.\nto pay, lend, invest, etc. money: Shareholders may authorize a third party, such as a bank or employer, to make investments directly to their Fund accounts.\nmake a profit/loss\nto earn or lose more money than you spend: The business made a pre-tax profit of £14.9m last year.\nmake a go of sth informal\nto make something successful: They spent nearly all their savings trying to make a go of the business. It has become increasingly difficult for independent operators to make a go of it.\nmake good informal (also make it (big))\nto become rich and successful: After years of hard work, she finally made good. Los Angeles is full of people who go there to \"make it big\" like the stars in Hollywood.\nmake good a deficit, shortfall, etc.\nto reduce the bad effect of there not being enough of something, for example money: Many employers have been called upon to make good the deficits in their pension plans. Exports of North Sea oil and gas dried up and failed to make good the shortfall in the manufacturing sector.\nmake sth good\nto pay for or repair something that has been damaged: The company is not under any liability to make good any damage to the site.\nmake good on sth\nto do something that you have promised to do, for example paying back money that you owe or paying for the cost of damage you have caused: The company did not acknowledge its future obligation to make good on the losses sustained by its offshore partnerships.\nmake or break\nto cause someone or something either to be very successful, or to cause them to fail: The first year of trading can make or break a new business. Phrasal verbs\nmake out\nmake sth out\nmake sth over\nmake up sth\nCOMMERCE the name of a product made by a particular company, rather than by other companies that make similar products: Depending on the make and model, delivery could take as little as a week. What make of car do you drive? See also\nbrand noun\nbe on the make disapproving\nto be trying very hard to get more money or power for yourself: Many people assume that politicians are just on the make."}