{"id":218641,"name":"male","type":"adjective","us_sound":"meɪl","us_link":"../audio/m/mail.mp3","uk_sound":"meɪl","uk_link":"../audio/m/ukmagni016.mp3","content":"male adjective\n(GENDER)\nAdd to word list\nAdd to word list\nbelonging or relating to men: IT is very much a male-dominated industry. What percentage of the adult male population is unemployed? He is one of the most prominent trans male athletes today. See also\nmasculine (MALE)\nMore examplesFewer examplesShe's going out with a male model.The critics picked him out as the outstanding male dancer of the decade.Industry is still a preponderantly male environment.\nmale adjective\n(SEX)\nB1 belonging or relating to the sex that fertilizes eggs, and does not produce babies or eggs itself: a male giraffe The male bird is more brightly coloured than the female of the species. This is a disease that is passed along by male parents to their offspring.\nbelonging or relating to a plant, or part of a plant, that produces pollen (= a powder that causes the female part of a flower to produce seeds): The male parts of the flower are the stamens and the anthers.\nMore examplesFewer examplesA male chicken is called a cock and a female chicken is called a hen.The male deer grows large branching horns called antlers.Edible squash blossoms are usually harvested from the male plant.Each male willow catkin is made up of many small flowers.\nSMART Vocabulary: related words and phrases\nSpecies & genders\nclade\nclass\ncliff edge\nfemale\nfemaleness\ngenera\ngenus\nhe\nholotype\nintergeneric\nmulti-species\norder\nparamecium\nphylum\nsame-gender\nshe\nspeciesism\nstrain\nsuborder\nsubspecies\nSee more results »\nmale adjective\n(CONNECTING PART)\nengineering, electronics\n&#160; specialized used to refer to a piece of equipment that has a part that sticks out and can be fitted into a hollow part in another piece of equipment: a male plug Compare\nfemale adjective (CONNECTING PART) specialized\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProtruding and sticking out\nRelated word\nmalenessGrammar\nFemale or feminine; male or masculine?We use female and male to refer to the sex of humans and animals: …\nB2 a boy, man, or male animal: The male of the species is less aggressive. Among the bodies are two unidentified British males.\nMore examplesFewer examplesThe kitten was actually a female, not a male.He's just your average 25-year-old hot-blooded male.The female bird incubates the eggs for about sixteen days while the male brings food.He says he's a red-blooded American male!The chief suspect for the robbery is a Caucasian male.\nGrammar\nFemale or feminine; male or masculine?We use female and male to refer to the sex of humans and animals: …\nAdd to word list\nAdd to word list\nof the sex that produces a natural substance that can make an egg develop into young: a male gorilla Male and female soldiers serve in the same units. male noun [ C ] us\nYour browser doesn't support HTML5 audio\n/meɪl/\nThe target audience is young males 20 to 30 years old.\nAdd to word list\nAdd to word list\nbelonging to or relating to men: Last year 7.8% of female managers handed in resignations, compared with 6.4% of male colleagues.\nused to describe a piece of equipment that has a part that sticks out and fits into a hole or space in another part: a male plug/connector Compare\nfemale adjective\na man or boy: According to the survey, the \"average manager\" is a 43-year-old male."}