{"id":218745,"name":"malicious","type":"adjective","us_sound":"məˈlɪʃ.əs","us_link":"../audio/m/malicious.mp3","uk_sound":"məˈlɪʃ.əs","uk_link":"../audio/m/ukmalad027.mp3","content":"Add to word list\nAdd to word list\nC2 intended to harm or upset other people: malicious gossip a malicious look in his eyes He complained that he'd been receiving malicious phone calls. He was charged with malicious wounding.\nThesaurus: synonyms, antonyms, and examples\nnot kind to someone or something and causing paincruelTeasing them for being overweight is cruel.callousHe had a callous disregard for the feelings of others.cold-bloodedThe budget is based on a cold-blooded analysis of the markets.ruthlessHe was a ruthless dictator.heartlessHe has been described as a heartless boss by several employees.\nSee more results »\nintended to cause damage to a computer system, or to steal private information from a computer system: protection against malicious software/code\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruel\ncruelly\ncruelty\ncutthroat\nmeanness\nmental cruelty\nmerciless\nmercilessly\nmordant\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nunchristian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDangerous and harmful\nOperating computers\nRelated word\nmaliciously\nAdd to word list\nAdd to word list\nintending to cause harm, esp. by hurting someone’s feelings or reputation: He says she threatened him and spied on him, among other malicious activities.\nAdd to word list\nAdd to word list\nmalicious behaviour is intended to harm other people: The court ruled that she had not acted with malicious intent. malicious accusations/allegations/gossip malicious damage/destruction\nINTERNET, IT malicious software or computer programs are designed to damage other people's computers and prevent them from working normally: Recent incidents have demonstrated how easily malicious hackers are able to disrupt the operations of many large companies. malicious programs/software maliciously adverb\nThe lawsuit accused the defendant of maliciously using the logo \"to cause confusion\"."}