{"id":219155,"name":"man","type":"noun","us_sound":"mæn","us_link":"../audio/m/eus72888.mp3","uk_sound":"mæn","uk_link":"../audio/m/ukmammo003.mp3","content":"man noun\n(MALE)\nAdd to word list\nAdd to word list\nA1 [ C ] an adult male human being: a young/tall man men and women the man in the green jacket For a very long time, only men could join the armed forces. Steve can solve anything - the man's a genius.\nWestend61/GettyImages\nan adult who lives and identifies as male though they may have been said to have a different sex at birth: Mark is a trans man (= a man who was said to be female when they were born). Their doctor encouraged them to live as a man for a while before undergoing surgical transition.\n[ C ] a male employee: The gas company said they would send some men to fix the leak. The man from the newspaper wrote some positive things about the movie. Our man in Washington sent us the news by fax yesterday. men\n[ plural ]\n&#160; military male members of the armed forces who are not officers: The military expedition was made up of 100 officers and men.\nSee more\n[ C ] old-fashioned a male servant: My man will show you to the door. a marketing, advertising, etc. man\na man typical of or involved in marketing, advertising, etc.: The brewery's marketing man insisted they were not making a political statement.\nSee more\n[ C ] informal a husband or male sexual partner: I hear she's got a new man. Is there a man in her life?\nmainly US informal used when talking to someone, especially a man: Hey, man, how are you doing? man and wife old-fashioned\nIf a man and a woman are man and wife, they are married to each other: No sooner had the couple been pronounced man and wife than the trouble started.\nSee more the man [ S ] US slang\na person or group that has power or authority, for example the police\nMore examplesFewer examplesHer eyes were immediately drawn to the tall blond man standing at the bar.Do you recognize that man in the grey suit?Jon has developed from an awkward teenager into a sophisticated young man.I believe women should be paid the same as men.\nSMART Vocabulary: related words and phrases\nEmployees & colleagues\nalum\nalumna\nalumnae\nalumni\nalumnus\ncompatriot\ncontractor\nemployee\ngirl\ngoonda\nhireling\nnon-management\nnon-managerial\noffice politics\noffice spouse\noppo\nwage earner\nworker\nworking man/woman/person\nworkmate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who serve other people\nMarriage: marital status\nThe police generally\nPeople in charge of or controlling other people\nman noun\n(PEOPLE)\nB2 [ U ] the human race: Man is still far more intelligent than the smartest robot. Man is rapidly destroying the earth. This is one of the most dangerous substances known to man. Try to imagine what life must have been like for Neolithic man 10,000 years ago.\n[ C ] literary or old-fashioned a person: All men are equal in the sight of the law.\nSMART Vocabulary: related words and phrases\nHumans, apes & monkeys\nanthropo-\nanthropoid\nape\nbaboon\nbonobo\ngreat ape\nhominid\nhominin\nhomo\nHomo sapiens\nlangur\nlemur\nloris\nmacaque\nmandrill\nrhesus monkey\nring-tailed lemur\nsapient\nsilverback\nsimian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in general\nman noun\n(OBJECT)\n[ C ] any of the objects that are moved or played with in games such as chess\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\ndraught\nendgame\nforfeit\ngambit\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\nGrammar\nMan, mankind or people?Traditionally, we use man to refer to all human beings, male and female, usually in contrast with other animals. However, many people consider this to be sexist, so it is better to use a different expression, such as human beings: …\nIdioms\nas one man\nit's every man for himself\nmake a man (out) of someone\nman and boy\nbe man enough to do something\nthe man in the moon\n(as) man to man\nman's best friend\nman's inhumanity to man\na man's man\nMore idioms\nman on!\nto a man\nyou the man!\nTo man something such as a machine or vehicle is to be present in order to operate it: The phones are manned 24 hours a day. Man the pumps! See also\novermanned\nundermanned\nunmannedNote: Many people find this use sexist and prefer to use other verbs such as 'operate' or 'staff'.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\ntake\nwork\nwork a treat idiom\nSee more results »\nIdiom\nman the barricadesPhrasal verb\nman up\nused to express a strong emotion: Man, we had a good time - we drank all through the night!\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nroll\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nhaving the nationality or job mentioned, or (of a group or vehicle) containing the number of people mentioned: an Irishman a policeman businessmen a five-man team a two-man helicopter\nSMART Vocabulary: related words and phrases\nMeasurements of volume: informal\n-ful\narmload\nbasin\nbasketful\nbucketful\neyeful\nfistful\nforkful\nglass\nglassful\njugful\nplate\npocketful\npot\nscoop\nspoonful\ntablespoonful\ntankful\ntbs\ntruckload\nSee more results »\nman noun\n(HUMAN MALE)\nAdd to word list\nAdd to word list\n[ C ] an adult male human being: a young man the men’s 400-meter race John can solve anything – the man’s a genius.\n[ C ] A man is also a male employee without particular rank or title, or a member of the military who has a low rank: The gas company sent a man to fix the heating system.\n[ C ] infml Man is sometimes used when addressing an adult male human being: Hey, man, got a light?\n[ C ] infml Man is sometimes used as an exclamation, esp. when the speaker is expressing a strong emotion: Man, what a storm! man and wife\nWhen an official at a wedding says a man and a woman have become man and wife, it means they are now married to each other.\nman noun\n(PERSON)\n[ C/U ] the human race, or any member or group of it: [ U ] prehistoric man [ U ] This poison is one of the most dangerous substances known to man. [ C ] All men are equal in the sight of the law. Note: Some people dislike this use of man because it does not seem to give women equal importance with men. They prefer to use other words, such as humanity, humankind, people, and person.\nman noun\n(PIECE)\n[ C ] any of the pieces that are played with in games such as chess\nmanliness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈmæn·li·nəs/\nWe no longer equate aggression with manliness. Idioms\nman’s best friend\nthe man in the street\nman verb [T]\n(OPERATE)\nto be present in order to operate something, such as equipment or a service: Man the pumps! The phones are manned 24 hours a day. Note: Some people dislike this use of man because it does not seem to give women equal importance with men. They prefer to use other words, such as operate and staff.\nAdd to word list\nAdd to word list\na man who does a particular type of work: A man's coming to fix the photocopier later. Our man in Washington has this report on the election.an advertising/a marketing/an operations man They brought in a top sales and marketing man to help with the new product launch.\nmen in suits disapproving\nmen at the top of an organization who are interested in the financial performance of a company rather than in the creative or product side of the business: a stuffy boardroom filled with men in suits\noffice workers who are considered to be doing a boring job: The place was full of men in suits from an insurance company.\nto use or operate equipment or machinery as part of your work, or to work in a particular place: Extra staff are brought in to man the phone lines during busy periods. All parts of the building, apart from toilets, are manned by security staff and covered by cameras.\nSee also\nmanning"}