{"id":219177,"name":"manager","type":"noun","us_sound":"ˈmæn.ə.dʒɚ","us_link":"../audio/m/manager.mp3","uk_sound":"ˈmæn.ɪ.dʒər","uk_link":"../audio/m/ukmammo009.mp3","content":"manager noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nA2 the person who is responsible for managing an organization: a bank manager a station manager a store manager the production manager I would like to speak to the manager.\nA2 the person whose job is to organize and sometimes train a sports team: a football manager\nA2 The manager of a singer, actor, or other performer is a person whose job is to arrange the business part of their work.\nMore examplesFewer examplesShe marched into the office and demanded to speak to the manager.Organizational ability is an essential attribute for a good manager.Obviously as sales manager he'll be very involved in the promotion and marketing of the product.There is a widening split between senior managers and the rest of the workforce.If you're dissatisfied with the service, why don't you complain to the hotel manager?\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nlayer\nline manager\nmajordomo\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nsuperintendent\nSee more results »\nmanager noun [C]\n(SYSTEM)\ncomputing\n&#160; specialized a computer program or system that helps you to control or organize a particular type of activity: You can click on a file in the file manager. A password manager is a must for anyone with multiple logons.\nMore examplesFewer examplesYou can flip back to the File Manager using Alt+Esc or Alt+Tab.There is a file manager that comes with Windows called Windows Explorer.Key Folder is a secure password manager that helps you organize and store passwords.GDDM stands for Graphical Data Display Manager.They released a new version of their database manager.I tried to go into the device manager to manually configure the IRQs.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nAdd to word list\nAdd to word list\nsomeone whose job is to control or organize someone or something, esp. a business: the manager of a supermarket He is manager of the New York City Ballet. managerial adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌmæn·əˈdʒɪr·i·əl/\nmanagerial skills\nAdd to word list\nAdd to word list\nMANAGEMENT, HR, WORKPLACE the person who is responsible for managing a company, store, etc., or a department of a company, etc.: effective/good/bad manager A sign of a good manager is knowing how to delegate. top/senior manager The project was run by a senior manager with considerable operational experience.assistant manager He had been the assistant manager of the local branch for several years and was looking for promotion. See also\naccount manager\nbank manager\nbranch manager\nbusiness manager\ncategory manager\nco-manager\ncommercial manager\nfile manager\nfirst-line manager\nfloor manager\nView all\nfund manager\ngeneral manager\nhuman resources manager\ninvestment manager\nlead manager\nline manager\nmoney manager\noffice manager\npersonal information manager\npersonnel manager\nplant manager\nportfolio manager\nproduction manager\nproduct line manager\nproduct manager\nproject manager\nproperty manager\nresearch manager\nrights manager\nsales manager\ntrading manager\nworks manager"}