{"id":219166,"name":"manage","type":"verb","us_sound":"ˈmæn.ədʒ","us_link":"../audio/m/manage.mp3","uk_sound":"ˈmæn.ɪdʒ","uk_link":"../audio/m/ukmammo006.mp3","content":"manage verb\n(SUCCEED)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to succeed in doing or dealing with something, especially something difficult: [ + to infinitive ] Did you manage to get any bread? I only just managed to finish on time. A small dog had somehow managed to survive the fire. I can't manage all this work on my own. Don't worry about us - we'll manage!mainly UK I'm afraid I can't manage the time (= to find enough time) to see you at the moment.\n[ I ] to succeed in living on a small amount of money: After she lost her job, they had to manage on his salary.\n[ T ] to be able to attend or do something at a particular time: Let's meet tomorrow - I can manage 3.UK Can you manage dinner on Saturday? Can't you manage any earlier?\nMore examplesFewer examplesThe car's quite full, but we could manage to squeeze another couple of people in.How did you manage to get such a great job?I don't know how actors manage to learn all those lines.I'm afraid I have to go out for a while - will you be able to manage on your own?How do you manage to work in this heat without air conditioning?\nSMART Vocabulary: related words and phrases\nCoping and not coping\nbalancing act\nbe left holding the baby idiom\nbear up\nbite\nbite off more than you can chew idiom\ncut\nhand\nhead\nhold\njuggling\nkeep body and soul together idiom\nkeep the wolf from the door idiom\nkeep your head above water idiom\nkeep/hold your end up idiom\nroll\nsink or swim idiom\nstretch to something\nstride\nsubsist\nsubsistence\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nBudgeting money\nPossible and probable\nmanage verb\n(CONTROL)\nB1 [ T ] to be responsible for controlling or organizing someone or something, especially a business or employees: Has she had any experience of managing large projects? He's not very good at managing people. His job involved managing large investment funds. When you have a job as well as children to look after, you have to learn how to manage your time. See also\nmismanage\nMore examplesFewer examplesI saw a harried-looking mother at the checkout trying to manage two small children and a mountain of shopping.This mousse says it's designed to make hair glossy and easier to manage.This is my first experience of managing other people, but I need to appear confident.Derek manages our Agricultural Division.There must be a better way to manage our household finances than this!\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nPhrasal verb\nmanage up\nmanage verb\n(SUCCEED)\nAdd to word list\nAdd to word list\n[ I/T ] to succeed in doing something, esp. something difficult: [ + to infinitive ] The pilot managed to land the plane safely. [ + to infinitive ] We managed to live on very little money. [ I ] Don’t worry about us – we’ll manage.\nmanage verb\n(CONTROL)\n[ T ] to control or organize someone or something, esp. a business: Does she have any experience managing large projects?\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; MANAGEMENT, HR, WORKPLACE to be in charge of and control a company, department, project, team, etc. : Managing a large corporation has become more complex and challenging. What kind of skills and qualities do people need to manage? Early biotech companies typically were founded, staffed and managed by scientists. He's not very good at managing people.\n[ I or T ] to be able to use something, for example time or money, in an effective way: Young people often need help in managing their finances. Can you give me some advice on how to manage my time better?\n[ T ]\n&#160; FINANCE, STOCK MARKET to be responsible for investing money for investors: She works for a Boston-based private-equity firm that manages about $2 billion in energy industry investments. All our funds are managed by expert investment advisors."}