{"id":219904,"name":"manual","type":"adjective","us_sound":"ˈmæn.ju.əl","us_link":"../audio/m/manual.mp3","uk_sound":"ˈmæn.ju.əl","uk_link":"../audio/m/ukmanli027.mp3","content":"Add to word list\nAdd to word list\nB2 done with the hands: the manual sorting of letters She tried to cure the pain in my knee by putting manual pressure on the joint.\nA manual machine is operated with the hands rather than by electricity or a motor: He still works on an old manual typewriter.\nB2 involving physical work rather than mental work: unskilled manual labour 750 manual workers will lose their jobs as a result of company cutbacks. Computer-controlled robots are taking over manual jobs in many industries.\nused to describe a vehicle in which the driver has to change the gears, or a feature of such a vehicle: He was driving a manual car when he only had a licence for an automatic. She has a Jeep with a 5-speed manual transmission. Only 10 percent of the vehicles sold in Canada had a manual gearbox. Compare\nautomatic\nMore examplesFewer examplesThe EU has issued guidelines on appropriate levels of pay for part-time manual workers.The heating system has a manual override.She doesn't like doing manual work.We use a manual system of records.He has very good manual dexterity.I can't drive a manual car because of my disability, but I'm fine with an automatic.\nSMART Vocabulary: related words and phrases\nThe hand\ncarpal\ncarpometacarpal\ncarpus\ncuticle\ndexterity\ndexterous\nfinger\nfingertip\nknuckle\nleft-handed\nleft-hander\nlittle finger\nmetacarpus\nminimus\nnail\nopposable\npalm\npalmar\nphalangeal\npinkie\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nTypes of employment\nmanual noun [C]\n(INSTRUCTIONS)\nB2 a book that gives you practical instructions on how to do something or how to use something, such as a machine: a DIY manual The computer comes with a 600-page instruction manual.\nSMART Vocabulary: related words and phrases\nBooks: reference books\nalmanac\nannual\natlas\nbible\ncoursebook\ndictionary\ngazetteer\ngrammar\nguide\nhandbook\nheadword\npeerage\nphrase book\nspeller\ntextbook\nthe Yellow Pages\nthesaurus\nwho\nwho's who idiom\nyearbook\nSee more results »\nmanual noun [C]\n(VEHICLE)\na vehicle in which the driver has to change the gears: Can you drive a manual? Compare\nautomatic noun\nMore examplesFewer examplesWas the hire car an automatic or a manual?\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nmanual noun [C]\n(MUSIC)\nmusic\n&#160; specialized a keyboard, especially on an organ, designed to be played with the hands rather than the feet\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\nmanual adjective [not gradable]\n(DONE BY HAND)\nAdd to word list\nAdd to word list\ndone or operated with the hands: The mail can be sorted faster by machine then by manual sorting. He has callouses on his hands from years of manual labor.\nIf a machine is manual, it does not use electricity to operate: We all used manual typewriters in those days. manually adverb us\nYour browser doesn't support HTML5 audio\n/ˈmæn·ju·ə·li/\na manually operated pump\nmanual noun [C]\n(BOOK)\na book that gives you practical instructions on how to do something or how to use something: Get the computer manufacturer’s operating manual.\nAdd to word list\nAdd to word list\ndone or operated with the hands, and not using electricity, an electronic system, etc.: The printer has a single-sheet manual feed in front.manual process/system The computerized system that we introduced to replace our old manual system has brought significant advantages.\nHR, WORKPLACE relating to physical work rather than mental work: manual job/labour/work, etc. He had no qualifications and ended up doing various types of manual work. It is men who have been hardest hit by the loss of permanent skilled and semi-skilled manual jobs. The largely female workforce continues, in the main, to be treated as part-time, unskilled manual labour.\na book that gives you practical instructions on how to do something or how to use something such as a machine: Read through the instruction manual before you start. We provide a training manual for all new staff.\non manual\nnot being operated automatically: The heating system had been left on manual. See also\noperations manual\nservice manual"}