{"id":219944,"name":"manufacture","type":"verb","us_sound":"ˌmæn.jəˈfæk.tʃɚ","us_link":"../audio/m/eus72900.mp3","uk_sound":"ˌmæn.jəˈfæk.tʃər","uk_link":"../audio/m/ukmanli029.mp3","content":"manufacture verb [T]\n(PRODUCE)\nAdd to word list\nAdd to word list\nB2 to produce goods in large numbers, usually in a factory using machines: He works for a company that manufactures car parts. The report notes a rapid decline in manufactured goods. Synonyms\nfabricate especially US\nmake (PRODUCE)Compare\nproduce verb (MAKE)\nThesaurus: synonyms, antonyms, and examples\nto make somethingmakeCan I make you a cup of coffee?produceCalifornia produces a lot of grapes.createLeonardo da Vinci created the masterpiece we know as \"Mona Lisa\".inventAlexander Graham Bell is credited with inventing the telephone.developThey are working to develop the next generation of underwater vehicles.manufactureThe car is manufactured in Germany.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto build somethingbuildThe house was built in the 1950s.constructThe company wants to construct a 175-mile pipeline.put something upPutting up a wall will not solve the problem.erectIt's unlawful to erect a building until you get approval.assembleHe has a job assembling furniture in a warehouse.put togetherWithout the instruction sheet, I've got no idea how to put all these parts together.\nSee more results »\nMore examplesFewer examplesMercedes were pioneers during the early days of car manufacture.The number of old German cars still on the road attests to the excellence of their manufacture.Organic chemicals are used in the manufacture of plastics, fibres, solvents and paints.We manufacture undergarments that tone and slenderize.The company manufactures parts for weapons.\nSMART Vocabulary: related words and phrases\nIndustry & industrial processes\nadditive manufacturing\nbiomanufacturing\ncarding\ncleantech\ncompression moulding\nindustry-wide\ninjection moulding\ninter-industry\njust-in-time\nlight industry\nnon-technical\nprebuilt\nprefabricated\nprefabrication\nquality assurance\nsunset industry\nsynthetic\nsynthetically\nvitrification\nvulcanization\nSee more results »\nmanufacture verb [T]\n(INVENT)\nto invent something, such as an excuse or story, in order to deceive someone: She insisted that every scandalous detail of the story had been manufactured. Synonyms\nfabricate\ninvent (NOT TRUE)\nmake something up (INVENT)\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsehood\nfalsification\nfeed someone a line idiom\nfib\nfiction\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\nthe process of producing goods: Oil is used in the manufacture of a number of fabrics. The amount of recycled glass used in manufacture doubled in five years. Synonym\nmanufacturing\nSMART Vocabulary: related words and phrases\nIndustry & industrial processes\nadditive manufacturing\nbiomanufacturing\ncarding\ncleantech\ncompression moulding\nindustry-wide\ninjection moulding\ninter-industry\njust-in-time\nlight industry\nnon-technical\nprebuilt\nprefabricated\nprefabrication\nquality assurance\nsunset industry\nsynthetic\nsynthetically\nvitrification\nvulcanization\nSee more results »\nmanufacture verb [T]\n(PRODUCE)\nAdd to word list\nAdd to word list\nto produce goods in large numbers, esp. in a factory using machines: He works for a company that manufactures toys.\nmanufacture verb [T]\n(INVENT)\nto invent something such as a situation, story, or event, esp. to deceive someone: The president said this is a political crisis manufactured by Republicans. manufacture noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌmæn·jəˈfæk·tʃər/\nOil is used in the manufacture of synthetic fabrics. manufacturer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˌmæn·jəˈfæk·tʃə·rər/\nThe company makes printed-circuit boards for manufacturers of electronic equipment.\nAdd to word list\nAdd to word list\nto produce goods in large numbers, especially in a factory using machines: He works for a company that manufactures car parts. The report notes a rapid decline in manufactured goods.\n[ U ] the process of producing goods in large numbers, especially in a factory: the manufacture of sth Oil is used in the manufacture of a number of fabrics. The amount of recycled glass used in manufacture doubled in five years.\nmanufactures [ plural ]\nmanufactured goods: The need to export our manufactures remains as strong as ever.\nSee also\nCAD/CAM"}