{"id":219518,"name":"many","type":"determiner","us_sound":"ˈmen.i","us_link":"../audio/m/many.mp3","uk_sound":"ˈmen.i","uk_link":"../audio/m/ukmanuf005.mp3","content":"Add to word list\nAdd to word list\nA1 used mainly in negative sentences and questions and with \"too\", \"so\", and \"as\" to mean \"a large number of\": I don't have many clothes. Not many people have heard of him. There aren't very many weekends between now and Christmas. Were there many cars on the road? How many students are there in each class? Many people would disagree with your ideas. Rachel was at the party with her many admirers. I've met him so many times and I still can't remember his name! There are too many people chasing too few jobs. If there are only five of us going to the concert, then I've booked one too many seats. If there were as many women as there are men in parliament, the situation would be very different. As many as (= the surprisingly large number of) 6,000 people may have been infected with the disease. There are already twelve bottles of wine, so if I buy as many again (= another twelve bottles) we'll have enough. A good/great many people who voted for her in the last election will not be doing so this time. She had five children in as many (= in the same number of) years and decided it was enough.\nMore examplesFewer examplesMr Black has been a client of this firm for many years.High prices are deterring many young people from buying houses.How many people does your company employ?There are too many silly quiz shows on television these days.The school has pupils from many different ethnic and cultural backgrounds.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\ninundation\nlion\nlogjam\nmotherlode\nmulti-million\npile\nstack\nthe lion's share idiom\ntsunami\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nGrammar\nManyWe use many to refer to a large number of something countable. We most commonly use it in questions and in negative sentences: …\nMuch, many, a lot of, lots of: quantifiersWe use the quantifiers much, many, a lot of, lots of to talk about quantities, amounts and degree. We can use them with a noun (as a determiner) or without a noun (as a pronoun). …\nMuch, many with a nounWe use much with singular uncountable nouns and many with plural nouns: …\nA lot of, lots of with a nounWe use a lot of and lots of in informal styles. Lots of is more informal than a lot of. A lot of and lots of can both be used with plural countable nouns and with singular uncountable nouns for affirmatives, negatives, and questions: …\nMuch, many, a lot of, lots of: negative questionsWhen we use much and many in negative questions, we are usually expecting that a large quantity of something isn’t there. When we use a lot of and lots of in negative questions, we are usually expecting a large quantity of something. …\nMuch, many, a lot, lots: without a nounWe usually leave out the noun after much, many and a lot, lots when the noun is obvious: …\nMuch with comparative adjectives and adverbs: much older, much fasterWe can use much before comparative adjectives and adverbs to make a stronger comparison: …\nToo much, too many and so much, so manyWe often use too before much and many. It means ‘more than necessary’. We can use too much before an uncountable noun and too many before a plural noun, or without a noun when the noun is obvious: …\nAs much as, as many asWhen we want to make comparisons connected with quantity, we use as much as and as many as: …\nMuch, many and a lot of, lots of: typical errorsWe use much with uncountable nouns and many with countable nouns: …\nIdioms\nin so many words\nmany a time\nmany happy returns (of the day)\nmany's the\none too many\nAdd to word list\nAdd to word list\na large number (of), or a lot (of): Many people bought tickets for the concert. Rachel has so many friends that I couldn’t invite them all. How many years have you worked here? Not everyone could get a seat, and many (of the people) were unhappy with having to stand. Note: Many is used with countable nouns."}