{"id":220018,"name":"map","type":"noun","us_sound":"mæp","us_link":"../audio/m/map.mp3","uk_sound":"mæp","uk_link":"../audio/m/ukmanuf009.mp3","content":"Add to word list\nAdd to word list\nA2 a drawing of the earth's surface, or part of that surface, showing the shape and position of different countries, political borders, natural features such as rivers and mountains, and artificial features such as roads and buildings: a map of the world a map of Paris a road map We need a large-scale map showing all the footpaths that we can walk along. I'm terrible at map reading (= understanding maps).\nHistoric Map Works LLC/Historic Map Works/GettyImages\na drawing that gives you a particular type of information about a particular area: He bought a map showing the population distribution of Scotland.\nRainer Lesniewski/iStock/Getty Images Plus/GettyImages\nsomething that shows the position of stars in the sky or the features on the surface of planets: a celestial map a map of Mars\nScience Museum/Hulton Archive/GettyImages\na very simple drawing that shows a direction of travel between one place and another: I'll draw you a quick map if you're worried about finding the hotel.\nCreativeArchetype/DigitalVision Vectors/GettyImages\nMore examplesFewer examplesTo find your nearest UK school, we have a clickable map dividing the UK into regions.I'm not quite sure how to get there - I'd better consult a map.This map has contours marked at 250-metre intervals.Let's aim for Coventry first, and then we'll have a look at the map.On this map, demarcations between regions are shown with dotted lines.\nSMART Vocabulary: related words and phrases\nMaps & map-making\natlas\ncartographer\ncartographic\ncartographically\ncompass rose\ncontour\ncontoured\ncontouring\ncoordinate\nelevation\nisobar\nisotherm\nmeridian\nos\nplot\npt\nreplot\nresurvey\nroad map\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nIdioms\nblow, bomb, wipe, etc. something off the map\nput something/someone on the map\nto represent an area of land in the form of a map: Parts of the mountainous region in the north of the country have still not been mapped.\nto represent how the parts of something are organized or arranged: The first human genome was mapped in 2003. Check that all network drives are mapped correctly and are not showing up as disconnected.\nto connect a set of values to another similar set, using a particular method or rule: The motherboard is responsible for decoding the virtual addresses and mapping them to physical addresses. The findings suggest that children learn these words and map them onto concepts already present.\nSMART Vocabulary: related words and phrases\nMaps & map-making\natlas\ncartographer\ncartographic\ncartographically\ncompass rose\ncontour\ncontoured\ncontouring\ncoordinate\nelevation\nisobar\nisotherm\nmeridian\nos\nplot\npt\nreplot\nresurvey\nroad map\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenetics\nComputer programming & software\nLinking and relating\nPhrasal verb\nmap something out\nAdd to word list\nAdd to word list\na drawing that represents a region or place by showing the various features of it, such as rivers and roads, and the distances between them, so that people can get help in finding their way from one place to another: a map of California a New York City subway map According to this road map, it’s 740 miles from Charlotte, North Carolina to Miami, Florida.\nto draw a representation of a place: Archaeologists have mapped the old Roman city using aerial photography. Phrasal verb\nmap something out\nAdd to word list\nAdd to word list\na drawing of the Earth's surface, or part of it, showing things such as the shape and position of countries, political borders, towns, rivers, etc.: on a map Many of these students could not even find their own country on a map. a map of Canada/the world/Europe\na drawing that gives you a particular type of information about a particular area: This is a map of the building showing where the fire extinguishers are located. You can use the interactive map to find our franchises nationwide. The carbon map was designed so cities could better analyse their overall carbon footprint.\na simple plan that shows a direction of travel between one place and another: I'll draw you a map if you're worried about finding the hotel.\na simple plan that represents a more complicated thing, system, or idea: This is a map of what's on our website. We now have a conceptual map of the essential qualities of leadership.\nput sth/sb on the map\nto make a person, place, or thing well known or show how important it is: The governor has managed to put this sleepy southern state in America on the map. See also\nroad map\nto represent an area of land in the form of a map: New technology is making it possible to survey, map, and analyse the state's natural resources.\nto show how something is put together or organized: After gathering data, the next step is to map the decision-making process. Phrasal verb\nmap sth out"}