{"id":220182,"name":"march","type":"noun","us_sound":"mɑːrtʃ","us_link":"../audio/m/march.mp3","uk_sound":"mɑːtʃ","uk_link":"../audio/m/ukmanuf021.mp3","content":"march noun\n(PUBLIC EVENT)\nAdd to word list\nAdd to word list\nC1 [ C ] an event in which a large number of people walk through a public place to express their support for something, or their disagreement with or disapproval of something: She's going on a march on Saturday in protest over the closure of the hospital.\nPeopleImages/E+/GettyImages\nMore examplesFewer examplesThe protest march went off peacefully with only two arrests.The march will be heavily policed by an anti-riot unit.The lecturers joined the protest march to show solidarity with their students.Demonstrators nearly came to blows with the police during the march.They are planning a large anti-racism march.\nSMART Vocabulary: related words and phrases\nActivism & pressure groups\nactivism\nactivist\nagitation\nagitator\nagitprop\ncirculator\nclicktivism\nclicktivist\ncounter-demonstrate\ncounter-demonstration\nhunger striker\nidentity politics\ninsurgency\ninsurrection\ninterest group\nslacktivist\nsocial enterprise\nsocial entrepreneur\nspecial interest group\nsuper-lobbyist\nSee more results »\nmarch noun\n(MUSIC)\n[ C ] a piece of music with a strong, regular beat, written for marching to: a funeral march Mendelssohn's Wedding March\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nmambo\nmedley\nmelody\nmulti-part\nnocturne\noctet\nreel\nserenade\nsextet\nsignature tune\nsolo\nsonata\nsong form\nSee more results »\nmarch noun\n(SOLDIERS' WALK)\n[ C or U ] a walk, especially by a group of soldiers all walking with the same movement and speed: It had been a long march and the soldiers were weary. The border was within a day's march (= distance measured in time taken to walk it).\nTamara Agramovic/EyeEm/GettyImages on the march\nIf soldiers are on the march, they have started marching to a place: Soldiers on the march were permitted to break their fast.\nIf something is on the march, it is becoming successful or spreading through an area: In America, evangelical Christianity is on the march.\nSee more\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmark\npace\nparade\nprance\nquick march! idiom\nsashay\nstamp\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe armed forces generally\nmarch noun\n(CONTINUOUS DEVELOPMENT)\n[ S ] the continuous development of a state, activity, or idea: It is impossible to stop the forward march of progress/time. The island is being destroyed by the relentless march of tourism.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nmarch verb\n(WALK)\nC2 [ I ] to walk somewhere quickly and in a determined way, often because you are angry: She marched into my office and demanded to know why I hadn't written my report.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nC1 [ I ] to walk through a public place as part of a public event to express support for something, or disagreement with or disapproval of something: Over four thousand people marched through London today to protest against the proposed new law.\nC1 [ I or T ] to walk with regular steps and keeping the body stiff, usually in a formal group of people who are all walking in the same way: The band marched through the streets. The soldiers marched 90 miles in three days.\nMore examplesFewer examplesHe started to march away, and the others fell in behind him.She marched up to him and slapped his face.The soldiers marched behind the coffin.He marched into the room and demanded money.Soldiers were marching into the city.\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmark\npace\nparade\nprance\nquick march! idiom\nsashay\nstamp\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActivism & pressure groups\nMilitary training & ceremonies\nmarch verb\n(TAKE FORCEFULLY)\n[ T + adv/prep ] to forcefully make someone go somewhere by taking hold of that person and pulling them there or going there together: Without saying a word, she took hold of my arm and marched me off to the headmaster's office. The police marched a gang of youths out of the building. See also\nfrogmarch\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nIdiom\nquick march!\nA1 the third month of the year, after February and before April: The next meeting will be in March. He left on 26 March. She is retiring next March.\nMore examplesFewer examplesMy birthday is in March.I hope to see you in March.\nSMART Vocabulary: related words and phrases\nNames of months\nApril\nAugust\nDec.\nDecember\nFebruary\nJanuary\nJuly\nJune\nmay\nNovember\nOctober\nSeptember\nmarch verb [I]\n(WALK)\nAdd to word list\nAdd to word list\nto walk with regular steps of equal length, esp. with other people who are all walking in the same way: The band marched through the downtown streets.\nIf you march, you walk quickly with purpose and determination: She marched up to the customer service desk and demanded her money back.\nmarch noun [C]\n(MUSIC)\na piece of music with a strong, regular rhythm written for marching to: The parade was led by the high school band, playing a series of marches.\nmarch noun [C]\n(PUBLIC EVENT)\nan event in which many people walk through a public place to express their support of something, often in disapproval of an official position: a protest march\nmarch noun [C]\n(WALK)\n(of a military unit) the act of walking together in formation\nthe third month of the year, after February and before April"}