{"id":220199,"name":"marching","type":"verb","us_sound":"mɑːrtʃ","us_link":"../audio/m/march.mp3","uk_sound":"mɑːtʃ","uk_link":"../audio/m/ukmanuf021.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nmarch\nmarch verb\n(WALK)\nC2 [ I ] to walk somewhere quickly and in a determined way, often because you are angry: She marched into my office and demanded to know why I hadn't written my report.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nC1 [ I ] to walk through a public place as part of a public event to express support for something, or disagreement with or disapproval of something: Over four thousand people marched through London today to protest against the proposed new law.\nC1 [ I or T ] to walk with regular steps and keeping the body stiff, usually in a formal group of people who are all walking in the same way: The band marched through the streets. The soldiers marched 90 miles in three days.\nMore examplesFewer examplesHe started to march away, and the others fell in behind him.She marched up to him and slapped his face.The soldiers marched behind the coffin.He marched into the room and demanded money.Soldiers were marching into the city.\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmark\npace\nparade\nprance\nquick march! idiom\nsashay\nstamp\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActivism & pressure groups\nMilitary training & ceremonies\nmarch verb\n(TAKE FORCEFULLY)\n[ T + adv/prep ] to forcefully make someone go somewhere by taking hold of that person and pulling them there or going there together: Without saying a word, she took hold of my arm and marched me off to the headmaster's office. The police marched a gang of youths out of the building. See also\nfrogmarch\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\ncome\nconvoy\ndirect\nguide\nlead\nmarch\nreferral\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nshow someone round (something)\nsteer\nwalk\nSee more results »\nIdiom\nquick march!"}