{"id":220292,"name":"marginal","type":"adjective","us_sound":"ˈmɑːr.dʒɪ.nəl","us_link":"../audio/m/marginal.mp3","uk_sound":"ˈmɑː.dʒɪ.nəl","uk_link":"../audio/m/ukmanuf029.mp3","content":"marginal adjective\n(SMALL)\nAdd to word list\nAdd to word list\nC2 very small in amount or effect: The report suggests that there has only been a marginal improvement in women's pay over the past few years. of marginal interest\nof interest to only a few people: articles about subjects of marginal interest\nSee more marginal gain\nthe idea that small improvements can lead to big results over time, or one of these small improvements: Marginal gain is the idea that small, incremental improvements can lead to significant overall gains. Asked whether any one of his marginal gains had been crucial, Brailsford said: \"Not really. It's an amalgamation of everything that we do.\"\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmeaningless\nmeaninglessly\nmeaninglessness\nmere\npicture\npiddling\npiddly\npiffling\nplay second fiddle idiom\nunseriousness\nvenial\nvestigial\nvestigially\nwho needs...? idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming better\nmarginal adjective\n(POLITICS)\nA marginal political area or position in parliament can be won by only a small number of votes because support for the main parties is equally divided among the people voting: marginal constituency The marginal Tory constituency was held by 2,200 votes.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\na marginal political area or position in parliament: key marginal Labour lost two of the key marginals in London. The minister's own seat is a Tory marginal.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nAdd to word list\nAdd to word list\nsmall in amount or effect: The difference between the two bids was marginal. marginally adverb us\nYour browser doesn't support HTML5 audio\n/ˈmɑr·dʒɪ·nəl·i/\nI think his guess is only marginally better than anybody else's.\nAdd to word list\nAdd to word list\nvery small in amount or effect: a marginal improvement/increase/decrease The report suggests that there has only been a marginal improvement in women's pay over the past few years. We have doubled our computing power at a marginal extra cost. The fuel-price increase will have only a marginal effect on the road fuel market.\nnot very important: Manufacturing is only a marginal sector in the UK these days. Their contribution to business strategy has been marginal.\nECONOMICS producing just enough income to cover the costs of making and selling something: Their sales volumes are marginal. For years, these marginal operators have only just managed to keep going and banks will not look at them favorably.\nPOLITICS a marginal seat (= area with one political representative) is one in which a politician has won by a small number of votes, so it is fairly likely to be won by another party when there is an election: These MPs have rural seats, many of them marginal."}