{"id":220290,"name":"margin","type":"noun","us_sound":"ˈmɑːr.dʒɪn","us_link":"../audio/m/margin.mp3","uk_sound":"ˈmɑː.dʒɪn","uk_link":"../audio/m/ukmanuf028.mp3","content":"margin noun\n(DIFFERENCE)\nAdd to word list\nAdd to word list\nC2 [ C ] the amount by which one thing is different from another: The Senate approved the use of military force by a margin of 52 votes to 47. The poll shows that the government is leading by the narrowest of margins.\nMore examplesFewer examplesThe election was won by the very narrow margin of only 185 votes.She won the presidency by a wide margin.The president won the election by a razor-thin margin.The Democrats are ahead by a very narrow margin.The vote was passed by a margin of 13 to 9.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nmargin noun\n(PROFIT)\nC2 [ C or U ] the profit made on a product or service: Our increased profits are due to improved margins and successful cost control. Using cheap labour increases profit margin.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ndeficit\nka-ching\nlose\nlose your shirt idiom\nout-of-pocket\npi\npocket\nprofit from something\nprofit warning\nprofitability\nrake-off\ntrade surplus\nwinnings\nyield\nSee more results »\nmargin noun\n(OUTER PART)\nC2 [ C ] the empty space to the side of the text on a page, sometimes separated from the rest of the page by a vertical line: If I have any comments to make, I'll write them in the margin.\nHumberto Perez/EyeEm/GettyImages\n[ C ] the outer edge of an area: The plant tends to grow in the lighter margins of woodland areas. Synonyms\nbrink\nedge (OUTER POINT)\nperiphery on the margins of something\nIf someone is on the margins of a group of people, they are part of that group, but different in important ways, and if someone is on the margins of an activity, they are only slightly involved: He spent the 1980s on the margins of British politics. We need to reach out to those on the margins of society.\nMore examplesFewer examplesEach new paragraph should be indented about two centimetres from the margin.She made some jottings in the margin of the book she was reading.She ornamented her letters with little drawings in the margin.Write your comments in the margin of the report in pencil.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nconcordance\nepigraph\nepilogue\nerrata\nerratum\nex-libris\nISBN\njacket\nlibrary\nmonograph\nomnibus\npreface\nspine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEdges & extremities of objects\nOrganizations - position & status\nmargin noun\n(POSSIBILITY)\n[ C or U ] something that makes a particular thing possible, such as an extra amount of money, time, etc. allowed that makes it possible to deal with an emergency: There is not much margin for creativity in a job like this. They allow an additional safety margin of five minutes between planes taking off.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\nmargin noun [C]\n(BORDER)\nAdd to word list\nAdd to word list\nthe border of empty space around the written or printed text on a page: She was in the habit of making notes in the margins of her textbooks.\nmargin noun [C]\n(AMOUNT/DEGREE)\nthe amount or degree of difference between a higher amount and a lower amount: He was reelected by a wide margin.\nA margin for error is the amount by which you can make a mistake without risking complete failure: There is no margin for error – it’s got to work the first time.\nA margin of error is the degree to which a calculation can be wrong without changing how accurate the final result is: The poll had a margin of error of plus or minus 4%.\nAdd to word list\nAdd to word list\nthe amount by which one thing is more or less than another: by a margin of sth The president won the election by a tiny margin.a wide/large/comfortable margin They are the largest building society by a comfortable margin. a narrow/small/slim margina 40-vote/5-point/2-to-1, etc. margin On the New York Stock Exchange, declines outpaced gainers by a 4-3 margin. Kennedy's margin of victory was only 719,000.\nACCOUNTING, COMMERCE the difference between the total cost of making and selling something and the price it is sold for: a low/poor margin Intense competition leads to lower prices and margins.a high/good margin They wanted to produce higher margin products.a margin on sth The company will make a whopping 80% margin on this sale. Our increased profits are due to improved margins.\nBANKING the difference between the amount of a loan and the value of the collateral (= property to be given to the lender if the money is not paid back): The risk of default needs to be correctly priced in the bank's loan margins.\nFINANCE, STOCK MARKET money, shares, etc. that a client gives to a broker to hold, that protect the broker from loss on a contract Compare\nmargin account\non margin\nFINANCE If you buy shares on margin, you borrow money in order to do this: Executives bought stocks on margin, putting up cash for only 10 per cent of the purchase price. See also\ngross margin\nnet interest margin\nnet margin\noperating margin\nprofit margin"}