{"id":220351,"name":"marigold","type":"noun","us_sound":"ˈmer.ɪ.ɡoʊld","us_link":"../audio/m/eus72907.mp3","uk_sound":"ˈmær.ɪ.ɡəʊld","uk_link":"../audio/m/ukmargi003.mp3","content":"Add to word list\nAdd to word list\na plant with bright yellow or orange flowers: He'd been planting marigolds in the border opposite. Another option is the slightly lurid marigold, which flowers generously once you dead-head it.\nAlexan2008/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesOne time she was given a holiday job in the palace gardens, pricking out marigolds.In the kitchen, marigolds were used as a cheap substitute for saffron.It was topped by a stone bust around which someone had placed a garland of fresh marigolds.\nSMART Vocabulary: related words and phrases\nFlowers & flowering plants\naconite\nadam-and-eve\naeonium\nAfrican daisy\nagapanthus\neglantine\nelderflower\nelephant ear\nerythronium\neuphorbia\nloosestrife\nlords-and-ladies\nlotus\nlove-in-a-mist\nlupin\nself-heal\nsenecio\nsensitive plant\nShasta daisy\nshepherd's purse\nSee more results »\na brand name for a type of, usually yellow, rubber glove used when washing dishes and for other cleaning jobs: It is hard to imagine him in a pinny with yellow Marigolds on his hands. They wore Marigold gloves and looked scary.\nMore examplesFewer examplesTheir battle dress is yellow Marigolds or gardening gloves and their only weapons are steel grapples on long ropes.He thinks that women should be in marigolds, apron and full make-up.I wasn't thinking of wearing out two pairs of Marigold gloves a week.\nSMART Vocabulary: related words and phrases\nGloves & accessories\naviator glasses\nbandeau\nbell\nboutonniere\nbrolly\nbuttonhole\neyewear\nfascinator\nfingerless\nglove\ngloved\nhandkerchief\nmuff\nparasol\npashmina\npocket handkerchief\nrosette\ntiepin\numbrella\nutility belt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEquipment used for cleaning\nAdd to word list\nAdd to word list\na plant with bright yellow or orange flowers"}