{"id":220450,"name":"market","type":"noun","us_sound":"ˈmɑːr.kɪt","us_link":"../audio/m/market.mp3","uk_sound":"ˈmɑː.kɪt","uk_link":"../audio/m/ukmargi019.mp3","content":"market noun [C]\n(BUYING AND SELLING)\nAdd to word list\nAdd to word list\nC1 the people who might want to buy something, or a part of the world where something is sold: Are you sure there's a market for the product? We estimate the potential market for the new phones to be around one million people in this country alone. The domestic market is still depressed, but demand abroad is picking up. They've increased their share of the market by ten percent over the past year.\nC2 the business or trade in a particular product, including financial products: the coffee market the economic market the commodities market the stock market the job market the housing market in the market for something\ninterested in buying something: Thanks for the offer, but I'm not in the market for another car right now.\nSee more on the market\navailable for sale: We put our house on the market as soon as house prices started to rise.\nSee more\nMore examplesFewer examplesHe's not certain whether to invest in the property market.The company plans to make a big push into the European market next spring.This is the cheapest version on the market, which is its great selling point.We're working on new strategies to improve our share of the market.Is there really a market out there for another women's magazine?\nSMART Vocabulary: related words and phrases\nPeople who buy things\nanti-consumer\nbidder\nbuyer\nconsumer\ncouponer\nend user\nfoot traffic\nimporter\nlate adopter\nmulti-client\npersonal shopper\nprosumer\npurchaser\nrag-and-bone man\nragman\nspeculator\nsubscriber\ntradesman\ntradespeople\nwholesaler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nmarket noun [C]\n(PLACE)\nA2 a place or event at which people meet in order to buy and sell things: Fruit and vegetables are much fresher from/at the market than in the supermarket. She runs a stall at the farmer's market. The flower market is a big tourist attraction. a craft market Visit the area on market day for a glimpse of the real Paris. See also\nMore examplesFewer examplesHe runs a fruit and vegetable stall in the market.The villagers grow coffee and maize to sell in the market.It's traditional that you haggle over the price of things in the market.Jonathan doesn't miss a trick! If there's a bargain to be had at the market, he'll find it.The gaily striped awnings of the little shops and market stalls made an attractive scene.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nmarket noun [C]\n(SHOP)\nUS a shop that sells mainly food See also\nhypermarket mainly UK\nsupermarket\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nusual for a particular market (= the business or trade in a particular product or service): The fee he received was below the market rate. See also\nmarket price\nmarket value\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nto make goods available to buyers in a planned way that encourages people to buy more of them, for example by advertising: Their products are very cleverly marketed.\nMore examplesFewer examplesThey use beautiful men to market their fragrances.We market our products in China.It is difficult to market TVs.The product is marketed under a different name in Germany.What is the best way to market green energy?\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nRelated word\nmarketer\nmarket noun [C]\n(AREA)\nAdd to word list\nAdd to word list\nan open area, building, or event at which people gather to buy and sell goods or food\nmarket noun [C]\n(DEMAND)\nthe demand for products or services: Are you sure there’s a market for something like this?\nA market is also an area or particular group that goods can be sold to: the teenage/adult market domestic/foreign markets\nA market is also the business or trade in a particular type of goods or services: the job/housing market Idioms\nin the market for something\non the market\nmarket verb [T]\n(ADVERTISE)\nto advertise and offer goods for sale: It’s a product that will sell if we can find the right way to market it.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; ECONOMICS, COMMERCE the business or activity of buying and selling a particular product or service: the car/coffee/telecoms, etc. market The telecoms market is evolving rapidly.the market in/for sth The battle for control of the London Stock Exchange aims to create a truly global market in shares. We need to increase our share of the market. Difficult market conditions contributed to a 9% decline in first-half profits.the US/local/world market The company claims to hold half of the US market by volume. booming/competitive/buoyant markets depressed/falling/weak markets to break into/capture/enter the market\n[ C ]\n&#160; COMMERCE a part of the world where something is or might be sold, or a particular group of people who buy or might buy something: The emerging market where we see perhaps our strongest opportunity is China.create/find/open up a market The consoles are sold at the lowest possible price to create a market for profitable games.break into/enter/penetrate a market They've wanted to break into the market in Asia for some time.develop/expand/pursue markets We give the highest importance to expanding markets for existing products.a changing/growing/expanding market Time-share companies have adapted their sales packages to a changing market. an export/international/overseas market the corporate/teenage/youth market market information/assessment\n[ C ]\n&#160; COMMERCE demand for a product or service, or the number of possible buyers for it: a market for sth Is there still a market for fax machines since the advent of email?the domestic/global/world market The domestic market is still depressed.a big/large/growing market The subsidies created a big market for wind-turbine manufacturers in Europe.\nthe market\n[ S ]\n&#160; ECONOMICS an economic system in which prices, salaries, employment, etc. are decided by how much people want and will pay for goods and services: His policy on pricing was to let the market decide.\n[ C ]\n&#160; STOCK MARKET, FINANCE\n&#160; (also financial market); (also stock market) the activity of buying and selling shares, bonds, commodities (= products that can be traded), currencies, etc., or a place where this is done: Some investors gain unfair advantage by changing orders after markets have closed. If the market rises by 20% over the year, it means that the firm's income rises automatically by the same amount. Asian markets made strong gains overnight.on a/the market On the Chicago market, a bushel of wheat fell to 262.50 cents from 271.75 cents. trading on foreign markets\n[ C ]\n&#160; COMMERCE a place or event at which people meet in order to buy and sell things: a covered/an outdoor/a street market a market stall/trader\n[ C ]\n&#160; COMMERCE\n&#160; US a store that sells mainly food: Can you stop at the market to buy some milk?\nbe first, etc. to market\nCOMMERCE to be first, etc. to have a product ready for sale: For some companies, being first to market is often more important than having the best product.\nbring, get, etc. sth to market\nCOMMERCE to arrive at the point where a product is ready to be sold: If all goes well, the company hopes to bring the product to market in about two years.\ncome/go to (the) market\nCOMMERCE to offer a new product for sale for the first time, or to be offered for sale for the first time: The big food processing company tests ingredients like cooking oil before they go to market.\nSTOCK MARKET to begin selling shares, etc. on a stock exchange, or to begin to be sold on a stock exchange: The company came to market in July, hitting a closing peak of 247p this week. We expect the company to be valued at about £80m when the shares come to market on May 22.\ncorner the market (in/on sth)\nCOMMERCE to be more successful than any other company at selling a particular type of product: They have cornered the market in cheap flights.\nget to market\nCOMMERCE if a product gets to market, it is ready to be sold: Better drugs can always get to market, ensuring patients access to the best medicine.\nin the market for sth\ninterested in buying something: Consumers in the market for a new car may turn to more fuel-efficient options.\nmake a market\nSTOCK MARKET to deal in shares, bonds, etc. (= buy and sell them for others), so that buyers do not have to find sellers directly: Most of the main dealing banks will make markets only with real investors, not traders.\non/onto the market\nCOMMERCE available to be bought: They put their house on the market, but it hasn't sold. This is the best mortgage rate available on the market at the present time. The number of properties coming onto the market also remained little changed.\nplay the market\nFINANCE, STOCK MARKET to risk money buying and selling shares, etc.: He had an instinct for finance, subscribed to the Wall Street Journal, and played the market.\nprice yourself/sb/sth out of the market\nCOMMERCE to charge so much for a product or service that nobody wants or is able to buy it: There are concerns that London is pricing itself out of the market as a European business base. Sharp rises in house prices in recent years are increasingly pricing many people out of the market. See also\nbear market\nblack market\nbond market\nbull market\nbuyer's market\ncapital market\ncash market\nclosed market\ncommodity market\ncredit market\nView all\ncurb market\ncurrency market\ndiscount market\ndomestic market\nefficient market\nequity market\nexchange market\nexport market\nfarmer's market\nflea market\nforeign exchange market\nforward market\nfree market\nfutures market\ngilt-edged market\nglobal market\ngraveyard market\nthe grey market\nhousing market\nimperfect market\ninsurance market\ninvestment-grade market\njob market\nkerb market\nlabour market\nloan market\nluxury market\nmain market\nmass market noun\nmiddle-market\nmoney market\nmortgage market\nniche market\nopen market\noptions market\nover-the-counter market\nparallel market\nperfect market\nprimary market\nthe property market\nsecondary market\nsecurities market\nseller's market\nshadow market\nsingle market\nspot market\nstock market\nswaps market\ntarget market\nterminal market\ntest market\nthird market\nto offer products for sale to buyers: The two companies have formed a partnership to jointly market the range of drugs.\nto encourage people to buy more of a particular product, for example by advertising: market sth as sth Food marketed as lower fat has been proved to lull us into a false sense of security.market sth to sb The tobacco companies say they do not market their products to children. The company has to modernize how it markets its chocolate, taking into account parent concerns about obesity and high-sugar snacks."}