{"id":220463,"name":"marketplace","type":"noun","us_sound":"ˈmɑːr.kɪt.pleɪs","us_link":"../audio/m/usmarke001.mp3","uk_sound":"ˈmɑː.kɪt.pleɪs","uk_link":"../audio/m/ukmargi025.mp3","content":"Add to word list\nAdd to word list\na set of trading conditions or the business environment: To remain competitive the company has to be able to adapt to the changing marketplace. It's essential that we maintain our position in the marketplace (= keep our share of business activity).\na website designed for people to buy and sell things: He made eBay the leading internet marketplace. Online marketplaces have provided thieves with a convenient way of selling stolen goods.\na small outside area in a town where there is a market: I'll meet you in the marketplace next to the fountain.\nMaya Karkalicheva/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nrecession\nretrench\nstagflation\nthe public purse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nInternet terminology\nShops & auctions\nTowns & regions: areas in towns & cities\nmarketplace noun\n(PLACE TO SHOP)\nAdd to word list\nAdd to word list\n[ C ] a place, usually in an open area, where things are sold; a market\nmarketplace noun\n(TRADING SYSTEM)\n[ U ] the system of buying and selling in competitive conditions: Analysts question whether the company can survive in a highly competitive marketplace.\nAdd to word list\nAdd to word list\n[ usually singular ]\n&#160; MARKETING a place where a particular product or service is bought or sold, or the conditions for buying and selling there: enter/reach the marketplace Better quality diamonds produced in laboratories have been entering the marketplace.control/dominate a marketplace The company has the ability to dominate a marketplace even while branching out from its core product.compete in/succeed in a marketplace Small employers frequently struggle to compete in the marketplace. the global/international marketplace To remain competitive the company has to be able to adapt to the changing international marketplace.the marketplace for sth She helped create the marketplace for handcrafted computer cases. It's essential that we maintain our position in the marketplace.a competitive/crowded marketplace How do we promote our music in an already crowded marketplace? the financial/insurance/technology marketplace\n(also market square) a small outside area in a town designed for holding markets: I'll meet you in the marketplace next to the fountain."}