{"id":220435,"name":"mark","type":"noun","us_sound":"mɑːrk","us_link":"../audio/m/mark.mp3","uk_sound":"mɑːk","uk_link":"../audio/m/ukmaced004.mp3","content":"mark noun\n(DIFFERENT AREA)\nAdd to word list\nAdd to word list\nB2 [ C ] a small area on the surface of something that is damaged, dirty, or different in some way: There were dirty marks on her trousers where she had wiped her hands. His fingers had left marks on the table's polished surface. She had a red mark on her arm where she'd burned herself.\nThesaurus: synonyms, antonyms, and examples\na mark on somethingmarkThe backs of the chairs have left marks on the wall.stainShe had grass stains on her white jeans.smearHe had smears of tomato ketchup on his shirt.smudgeNo matter how often I wash my hands, I leave smudges all over my phone's screen.blotchHe had blotches all over his face.speckShe looked through the old camera lens and saw specks of dust.\nSee more results »\n[ C ] a typical feature or one that allows you to recognize someone or something: Did your attacker have any distinguishing marks, such as a scar or a birthmark? You can tell which puppy is which from the marks (also markings) on their fur.\nMore examplesFewer examplesShe scrubbed at the mark on the wall for ages, but it wouldn't come off.His shoes left muddy marks on the floor.The bush looked badly diseased, with black marks on all the leaves.The blood had left an indelible mark on her shirt.Don't put anything wet on a polished surface, or it will leave a mark.\nSMART Vocabulary: related words and phrases\nDirt & untidiness\nbloodstain\nclutter\ncontaminant\ncontamination\ncrud\nfleck\ngrime\ngrunge\ngunge\ngunk\nmuck\npollutant\npolluter\nscrappiness\nscruff\nshambles\nslime\nslob\nslovenliness\nsmear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nmark noun\n(SYMBOL)\nC1 [ C ] a symbol that is used for giving information: I've put a mark on the map where I think we should go for a picnic. What do those marks in the middle of the road mean?\n[ C ] a written or printed symbol: a question mark an exclamation mark punctuation marks\nMore examplesFewer examplesI put a mark where the level of the water reached.These marks represent the number of people affected by drought.If you are taller than this mark, you cannot enter the play area.I put the phrase in quotation marks.Do these marks on the document actually mean anything?\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nmark noun\n(FOR SCHOOL WORK)\nA2 [ C ] mainly UK (US usually grade) a judgment, expressed as a number or letter, about the quality of a piece of work done at school, college, or university: What mark did you get in the biology exam? Matilda's had very good marks in/for English throughout the year.UK You scored full marks in the test - ten out of ten! Synonym\ngrade\nMore examplesFewer examplesWhat mark did he get in his exam?She did no revision, but she still got a very high mark.She got good marks for all her work.I need good marks to go on to the next part of the course.The teacher gave a me a good mark for my essay.\nSMART Vocabulary: related words and phrases\nMarks & results\n2:1\n2:2\nB, b\nC, c\nclass\ncontinuous assessment\nformatively\nGPA\ngrade boundary\ngrade-point average\nhonor student\npass\npass rate\npassing grade\npositive\npositivity\nscore\nstraight As\nstraight-A\nthird\nSee more results »\nmark noun\n(LEVEL)\n[ S ] the level intended or wanted: Sales have already passed the million mark.\nMore examplesFewer examplesDeaths have passed the thousand mark.Her earnings passed the $1 million mark.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuality and standard\nmark noun\n(REPRESENTATION)\nC2 [ C ] an action that is understood to represent or show a characteristic of a person or thing or feeling: He took off his hat as a mark of respect for her dead husband. It's the mark of a gentleman to stand up when someone enters the room. I'd like to give this bottle of wine as a mark of appreciation for all the work you've done for us.\nMore examplesFewer examplesThe flag was flying at half-mast to mark the death of the president.The recent free elections mark the next step in the country's progress towards democracy.Many diplomats attended a naval review to mark the anniversary of the end of the war.A statue was erected to mark the bicentenary of the composer's birth.The Ural mountains mark the boundary between Europe and Asia.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypifying, illustrating and exemplifying\nmark noun\n(MONEY)\n[ C ] a\nDeutschmark\nSMART Vocabulary: related words and phrases\nCurrencies\nAltcoin\nariary\nbimetallism\nbitcoin\nCDN\ndecimal currency\nECU\nescudo\nguilder\nkrone\nlira\nmulti-currency\nnon-convertible\nnon-dollar\npaisa\npieces of eight\nrouble\nrupiah\nshilling\ntraveller's cheque\nSee more results »\nIdioms\nbe off the mark\nbe quick/slow off the mark\nbe up to the mark\nleave your/its mark on someone/something\nmake a/your mark (on something)\non your marks, get set, go!\nmark verb\n(PIECE OF WORK)\nB2 [ T ] mainly UK (US usually grade) to correct mistakes in and give points for a piece of work: I was up half the night marking exam papers.UK You'll be marked down (= given a lower mark) for poor spelling and punctuation. Synonym\ngrade\nMore examplesFewer examplesI marked the level in the bottles so that nobody can take any.The place where the treasure is buried is marked with a stone cross.Our route was marked by flags in the sand.I've marked the best route to our house.Can you mark the amount of work you've done each week on this chart?\nSMART Vocabulary: related words and phrases\nMarks & results\n2:1\n2:2\nB, b\nC, c\nclass\ncontinuous assessment\nformatively\nGPA\ngrade boundary\ngrade-point average\nhonor student\npass\npass rate\npassing grade\npositive\npositivity\nscore\nstraight As\nstraight-A\nthird\nSee more results »\nmark verb\n(DAMAGE/MAKE DIRTY)\nC1 [ I or T ] to make a mark on something or someone: Make sure you don't mark the walls while you're moving the furniture around. A dark carpet won't mark as easily as a light one.\nSMART Vocabulary: related words and phrases\nMaking things dirty & untidy\nblacken\nclutter\ncontaminate\ndefile\ndirty\ndisarrange\nfoul\nmess\nmix\nmix someone/something up\nmuddle\nmuddle something up\nmuss\npollute\npolluter\nrecontaminate\nsoil\nstain\ntarnish\nthe polluter pays principle idiom\nSee more results »\nmark verb\n(REPRESENT)\n[ T ] to represent or show a characteristic of a person or thing or feeling: The band's songs have always been marked by controversial lyrics. The signing of the treaty marked a major milestone on the road to European union.\n[ T ] to show respect for or commemorate: Tomorrow's parade will mark the 50th anniversary of the battle.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ncharacterize\ninstance\ninstantiate\nmirror\nMr\nMrs\nstereotype\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymptom\nterritory\ntoken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing respect and admiration\nRemembering, reminding and reminders\nmark verb\n(INDICATE)\nB2 [ T ] to show where something is by drawing or putting something somewhere: I've marked the route around the town's one-way system on the map. I'd like everyone to mark their progress on the chart every week. X marks the spot where the treasure is buried.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nmark verb\n(SPORTS)\n[ T ] UK (US cover) to prevent a member of the opposing team from taking control of the ball by staying close to them all the time\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdioms\nbe marked out as something\n(you) mark my words!\nmark timePhrasal verbs\nmark something down\nmark someone down as something\nmark something/someone off\nmark something off\nmark something out\nmark something up\nused before a number to describe a particular version of a machine, especially one that is an improvement on the original version: The car has enjoyed modest success since its launch, but the Mark 2 version is expected to be far more popular.\nUK used before a number to show what temperature you should use for cooking something in a gas oven: Cook at Mark 5 for 20 minutes.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbrand\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nform\nhue\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements of temperature\nmark noun [C]\n(SMALL AREA)\nAdd to word list\nAdd to word list\na small area on the surface of something that is damaged, dirty, a different color, or in some other way not like the rest of the surface: You’ve got paint marks on your shirt. There were skid marks where the car had gone off the road.\nmark noun [C]\n(WRITING)\na written or printed symbol: a punctuation mark a check mark Put a mark in the box that corresponds to the correct answer.\nmark noun [C]\n(SIGN)\nan action that is understood to represent a characteristic or feeling: As a mark of respect for those who died, there will be a minute of silence.\nmark noun [C]\n(JUDGMENT)\na letter or number used as a measure of how good a student’s work is, usually given by a teacher; a grade: I got a decent mark on my final exam and wound up with a B for the course.\nfig. If you give someone high/low marks for something, you judge that person to be good or bad in a particular way: I’d certainly give him high marks for perseverance, but he doesn’t have much talent.\nmark noun [C]\n(PURPOSE)\nan intended result or an object aimed at: Mass marketing techniques very often miss their intended marks. Her arrow hit the mark.\nmark verb [T]\n(REPRESENT)\nto represent something that has happened in the past or is about to happen: A guided tour will be held to mark the opening of the new school. Today marks my tenth anniversary with this company.\nmark verb [T]\n(SMALL AREA)\nto put a line, spot, color, etc., that is different from the rest of a surface on a small area of that surface : Sale items are marked in red on the tags.\nmark verb [T]\n(JUDGMENT)\nto put a number or letter on a student’s work that shows how good it is: I have a stack of exam papers to mark. Phrasal verbs\nmark down something\nmark down something/someone\nmark off something\nmark up something\nAdd to word list\nAdd to word list\n[ C ] a small area on a surface that is damaged, dirty, a different colour, etc.: She returned the garment because it had a mark on the front.\n[ C ] a symbol or sign which is used for showing where or what something is: For every customer who comes through the door, put a mark in this column.\n[ S ] a level that is important in some way: the million dollar/10-billion/30-minute, etc. mark The Dow Jones Index broke through the 5,100 mark.pass/top/exceed the ... mark Sales have already passed the million mark.\n[ C ] a number or score saying how good something is or how well someone has done: We give them a mark out of ten for service, food quality, and value for money.\na mark of sth\nsomething that shows or proves a particular quality, feeling, etc.: With wine, an appellation is not necessarily a mark of quality. On the day of his funeral, the factory closed early as a mark of respect.\nleave your/its mark on sb/sth\nto have an effect that changes someone or something, often in a bad way: The hurricane continues to leave its mark on abandoned strip malls and empty houses.\nmake a/your mark (on sth)\nto have an important effect on something: He is beginning to make his mark on the shape and direction of the Wall Street firm. I was very ambitious, and I wanted to make a mark.\noff the mark\nnot correct: His criticisms are way off the mark. You may only be guessing, but you are not far off the mark.\nnot at the level that was expected: It is difficult to pinpoint why sales are off the mark. Why are his projections so far off the mark?\nup to the mark\ngood enough: Her latest batch of work just isn't up to the mark.\nto write, print, or put information on something: mark sth with sth Make sure everything is marked with the sale price.be marked sth She divided the papers into piles marked \"action\" and \"no action\".\nto be something or show that something exists: That figure marks a 26% increase since the same time last year. The deal marked a high point in her career. Phrasal verbs\nmark sth down\nmark sth up"}