{"id":220447,"name":"marker","type":"noun","us_sound":"ˈmɑːr.kɚ","us_link":"../audio/m/marker.mp3","uk_sound":"ˈmɑː.kər","uk_link":"../audio/m/ukmargi018.mp3","content":"marker noun [C]\n(SYMBOL)\nAdd to word list\nAdd to word list\na sign that shows where something is: I've put in some markers where I planted the seeds. She reached the 500-metre marker in record time.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nideogram\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignificative\nsignifier\nsigning\nSOS\nstatus symbol\nthe all-clear\ntotem pole\nSee more results »\nmarker noun [C]\n(CHARACTERISTIC)\nbiology\n&#160; often specialized a characteristic feature, gene, or substance that shows something is happening or likely to happen, or shows which person or animal something comes from: DNA tests involve criminalists who look for genetic markers in samples of human tissues and bodily fluids. She argues that doctors should see unexplained pain as a marker for depression. Having this role played by a woman is a clear marker of social change.\nMore examplesFewer examplesScientists realized they could use genetic markers to trace confiscated ivory back to where the host elephant was killed.The study has tremendous promise for finding the genetic markers that are linked to heart disease. Creatine kinase-MB is a marker for muscle injury.Abnormal levels of cardiac troponins are a late-stage marker for a heart attack.This giant medical database is a way to let doctors and scientists search for common markers of disease. LDL cholesterol is a marker of cardiovascular disease.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nideogram\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignificative\nsignifier\nsigning\nSOS\nstatus symbol\nthe all-clear\ntotem pole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGenetics\nmarker noun [C]\n(PEN)\n(also marker pen) a pen with a thick writing point for writing or drawing\ndlerick/E+/GettyImages\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npulp\nquill\nquire\nqwerty\nream\nrice paper\nslate\nSee more results »\nAdd to word list\nAdd to word list\na symbol or object that gives information: When the boats reached the halfway marker, the wind started to pick up.\nA marker is also a type of pen that makes a thick line: She used a yellow, felt-tip marker to highlight certain words.\nAdd to word list\nAdd to word list\n[ C ] a sign that shows what something is like or proves that something exists: a marker of sth The company sees its invitation to join the business forum as a marker of success.\n[ C, usually singular ] something that is used as a comparison to judge or decide things, especially to set a standard for the future: a marker for sth This new-style cookbook was effectively the marker for all the books that followed.\n[ C ] (also marker pen) a thick pen for writing or drawing: a black/permanent/washable marker\nput/lay/set down a/your marker (for sth)\nto show clearly what your opinion or position about something is, and how you plan to act in the future: By entering into this partnership, the company has put down a clear marker for the future. Now is the time for a clear marker to be laid down about levels of executive pay."}