{"id":220444,"name":"marked","type":"adjective","us_sound":"mɑːrkt","us_link":"../audio/m/marked.mp3","uk_sound":"mɑːkt","uk_link":"../audio/m/ukmargi016.mp3","content":"Add to word list\nAdd to word list\nA marked change or difference in behaviour or in a situation is very obvious or noticeable: There was a marked improvement in my health when I gave up smoking. Unemployment has fallen again, although the change is less marked than last month. The president spoke with passion for an hour, in marked contrast to his subdued address yesterday. Synonyms\nnoticeable\npronounced\nThesaurus: synonyms, antonyms, and examples\neasy to see, recognize, or understandobviousIt's obvious that she's upset.clearIt was clear that he was unhappy.apparentHer joy was apparent to everyone.plainHis disappointment was plain to see.evidentThe company president was impressed by her evident ambition.manifestHis manifest lack of interest has provoked severe criticism.\nSee more results »\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nobtrude\npalpable\npalpably\nparallax\npatently\nperceivable\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\nRelated word\nmarkedly\nAdd to word list\nAdd to word list\nobvious or noticeable: There was a marked improvement in my health when I started exercising. markedly adverb us\nYour browser doesn't support HTML5 audio\n/ˈmɑr·kɪd·li/\nEyewitness accounts differed markedly from police reports of the incident.\nAdd to word list\nAdd to word list\nvery obvious: more/less marked In the US, the fall has been even more marked, from 10.1 per cent in September to 6.6 per cent.a marked slowdown/increase/change There has been a marked slowdown in revenue growth.\nwritten or printed on something: Everything in the store is being offered at 20% less than the marked price. markedly adverb\nPretax profits were markedly below analysts' estimates."}