{"id":220633,"name":"marriage","type":"noun","us_sound":"ˈmer.ɪdʒ","us_link":"../audio/m/eus72916.mp3","uk_sound":"ˈmær.ɪdʒ","uk_link":"../audio/m/ukmarmo006.mp3","content":"marriage noun\n(TWO PEOPLE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a legally accepted relationship between two people in which they live together, or the official ceremony that results in this: They had a long and happy marriage. She went to live in another state after the break-up of her marriage. She has two daughters by her first marriage. the marriage ceremony The court decision legalized gay/same-sex marriage (= a marriage between two people of the same sex).\n[ C or U ] a type of relationship between people in which they live as married people but their relationship is not legally accepted : I believe that marriage is a divine institution and doesn't need legal status to be valid. He has several wives, but our country does not recognize all of his marriages. Common-law marriage (= a marriage that is not official but is accepted because the people have lived together for a very long time) is only recognized in a few states. marriage of convenience\na marriage in which the partners have married not because they love each other, but in order to get an advantage, such as the right to live in the other partner's country: Marriages of convenience carry the risk of prosecution and even deportation.\nSee more\nMore examplesFewer examplesThey got divorced after only six months of marriage.Their marriage fell apart when she found out about her husband's affair.Sex before marriage is strongly disapproved of in some cultures.In true Hollywood style , she's had four marriages and three face-lifts.Their constant arguments were putting a strain on their marriage.\nSMART Vocabulary: related words and phrases\nMarriage, cohabitation & other relationships\nadulteress\naffinal\nas husband and wife idiom\nbe an item idiom\nbe shacked up idiom\nhave an affair\nhave something going with someone idiom\nhear wedding bells idiom\nhitched\nhonest\nmatrimonially\nmatrimony\nmonogamist\nmonogamous\nménage à trois\nserial monogamy\nseven-year itch\nshack\nshack up\nsomething\nSee more results »\nmarriage noun\n(COMBINATION)\n[ C ] a combination of two or more things: His music is a marriage of jazz, blues, and pop.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nAdd to word list\nAdd to word list\na legally accepted relationship between a man and a woman in which they live as husband and wife, or the official ceremony which results in this: [ C ] a long and happy marriage"}