{"id":221035,"name":"masquerade","type":"noun","us_sound":"ˌmæs.kəˈreɪd","us_link":"../audio/m/masquerade.mp3","uk_sound":"ˌmæs.kərˈeɪd","uk_link":"../audio/m/ukmarve022.mp3","content":"masquerade noun\n(BEHAVIOUR)\nAdd to word list\nAdd to word list\n[ C or U ] behaviour that is intended to prevent the truth about something unpleasant or not wanted from becoming known: They kept up the masquerade of being happily married for over 30 years.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse\nfalse modesty\nfalsifiable\nfalsify\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nmasquerade noun\n(PARTY)\n(also masquerade ball, masquerade party) a party or dance where people wear masks (= coverings over part or all of the face) or other disguises (= clothes that hide who you are or make you look like someone else): When she agrees to accompany him to a masquerade, she does not know who exactly she is dancing with. The convention finished with a masquerade ball.\nMore examplesFewer examplesShe encountered a famous poet, dressed as a monk, at a masquerade in London.An entire gallery is devoted to photographs of the masquerade ball held in the Winter Palace in February 1903. I have accepted an invitation for us to attend a masquerade ball given by friends of Lord and Lady Matlock.They throw a big masquerade party that includes handing out animal masks to the children. According to Luis Buñuel, Dalí and Gala went to a masquerade party in Chicago dressed as the Lindbergh baby and the kidnapper.\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmela\nMother's Day\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nValentine's Day\nSee more results »\nAdd to word list\nAdd to word list\na party or dance in which people wear masks (= coverings for the face): There were dozens of masquerade balls, parades, street dances, and fancy dress parties.\nA masquerade is also a false show or appearance: I’m afraid we will not have a fair election but another masquerade.\nto pretend or appear to be: In this business, there are a lot of unqualified people masquerading as experts."}