{"id":221043,"name":"mass","type":"adjective","us_sound":"mæs","us_link":"../audio/m/mass.mp3","uk_sound":"mæs","uk_link":"../audio/m/ukmarve023.mp3","content":"Add to word list\nAdd to word list\nC1 having an effect on or involving a large number of people or forming a large amount: weapons of mass destruction a mass murderer mass starvation Opposition groups plan to stage mass demonstrations all over the country.\nMore examplesFewer examplesDuring times of mass unemployment, there's a pool of cheap labour for employers to draw from.There were mass deportations in the 1930s, when thousands of people were forced to leave the country.There have been mass desertions from the party in recent months.There has been a mass exodus of workers from the villages to the towns.The regime tried to silence dissent with a programme of mass murder.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nmass noun\n(LARGE AMOUNT)\nB2 [ S ] a large amount of something that has no particular shape or arrangement: The explosion reduced the church to a mass of rubble. The forest is a mass of colour in autumn. masses [ plural ] UK informal\nB2 a lot: [ + to infinitive ] I've got masses to do at the weekend. There were masses of people in town today. the mass of something\nmost of something: The mass of the people support the reforms.\nMore examplesFewer examplesHer daughter's hair is a mass of wonderful red corkscrew curls.She was disappointed to see her essay returned with a mass of corrections in red ink.The liquid suddenly solidifies into a gelatinous mass.Short-grain rice turns into a soft glutinous mass when cooked.A seething mass of children crowded around the tables.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaximum and minimum\nmass noun\n(SOLID LUMP)\n[ C ] a solid lump with no clear shape: The sauce was now a sticky mass at the bottom of the pan.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nmass noun\n(ORDINARY PEOPLE)\nthe masses\nthe ordinary people who form the largest group in a society: He was popular with the rich but failed to win the support of the masses.\nSMART Vocabulary: related words and phrases\nOrdinary people\nbanausic\ncommonalty\ncommunity\ndemotic\nEssex girl\ngrassroots\nJoe Public\nJohn Doe\nJohn Q. Public\nman/woman of the people idiom\nmass market\nomnibus\npopular\npopularly\nprole\npublic\nrabble\nruck\nthe common man idiom\nthe man/woman in the street idiom\nSee more results »\nmass noun\n(PHYSICS)\n[ C ]\n&#160; physics\n&#160; specialized the amount of matter in any solid object or in any volume of liquid or gas: The acceleration of a body equals the force exerted on it divided by its mass. mass number\nthe total number of protons and neutrons in an atom mass defect\nthe difference between the mass of a nucleus (= central part of an atom) and the mass of the separate pieces that make up the nucleus\nSMART Vocabulary: related words and phrases\nMass, area, weight & volume in general\nA3\nA4\nA5\narea\nballast\ndead weight\ndensity\ndisplacement\nexpansivity\nheft\nlegal\nletter\nnon-dimensional\nspecific gravity\ntare\nvolume\nvolumetric\nweight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: atoms, molecules & sub-atomic particles\nmass noun\n(RELIGIOUS CEREMONY )\n[ C or U ] (also Mass) a religious ceremony in some Christian Churches based on Jesus' last meal with his disciples, or music written for parts of this ceremony: to go to Mass See also\nCommunion\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nmambo\nmedley\nmelody\nmulti-part\nnocturne\noctet\nreel\nserenade\nsextet\nsignature tune\nsolo\nsonata\nsong form\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious ceremonies & prayers\nto come together in large numbers: Thousands of troops have massed along the border in preparation for an invasion.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmake yourself known idiom\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nmass noun [C]\n(LARGE AMOUNT)\nAdd to word list\nAdd to word list\na large amount or number: A mass of earth and granite slid down into the narrow gorge. We had to wade through masses of seaweed.\nmass noun [C]\n(MATTER)\n[ C ]\n&#160; physics the amount of matter in any solid object or in any volume of liquid or gas mass number physics\nThe mass number is the total number of protons and neutrons in an atom. mass defect physics\nThe mass defect is the difference between the mass of a nucleus (= central part of an atom) and the mass of the separate pieces that make up the nucleus.\nmass noun [C]\n(ART)\n[ U ]\n&#160; art the outside size or shape of an object, or how big it appears to be\nmass verb [I/T]\n(CREATE LARGE AMOUNT)\nto come or bring together in large numbers: [ I ] The crowd massed around the entrance to the exhibition.\nmass adjective [not gradable]\n(LARGE AMOUNT)\ninvolving or having an effect on a large number of people or things: weapons of mass destruction They hope the new movie will appeal to a mass audience.\n(esp. in the Roman Catholic Church) a religious ceremony based on Jesus’s last meal with his disciples (= the men who followed him), or music written for the parts of this ceremony\nAdd to word list\nAdd to word list\nhaving an effect on or involving a large number of people: There have been two decades of mass unemployment. mass audience/appeal A smaller company could produce a breakthrough product with mass appeal.mass consumerism/consumption The society that we live in now is so geared to spending and mass consumerism. a mass protest/rally/action See also\ncritical mass\n[ U ] the amount of matter in any solid object or volume of liquid or gas: These activities help strengthen bones and increase their mass.\na mass of sth [ S ]\na large amount of something: The media company has enjoyed a mass of hype. They were part of the large mass of consumers who acquired a credit card in the 1980s."}