{"id":221328,"name":"match","type":"noun","us_sound":"mætʃ","us_link":"../audio/m/match.mp3","uk_sound":"mætʃ","uk_link":"../audio/m/ukmassi025.mp3","content":"match noun\n(COMPETITION)\nAdd to word list\nAdd to word list\nA2 [ C ] mainly UK (US usually game) a sports competition or event in which two people or teams compete against each other: a tennis match a football/cricket match We won/lost the match. Liverpool have a match with (= against) Blackburn next week. man/woman of the match UK\nthe person who has scored the most points or played the best in a match: The goalkeeper was replaced by an impressive stand-in who went on to win woman of the match.\nSee more\nMore examplesFewer examplesThe national anthems of the teams are played at the beginning of a big international football match.We spent the afternoon at a football match.Fans packed the stadium to watch the final match.England has to win tonight's qualifying match to go through to the next round of the competition.Only one goal was scored in the entire match.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\nmatch noun\n(STICK)\nB2 [ C ] a short, thin stick made of wood or cardboard and covered with a special chemical at one end that burns when rubbed firmly against a rough surface: a box of matches You should always strike a match away from you.\nPoligrafistka/iStock/Getty Images Plus/GettyImages put a match to something UK\nto make something burn: Some of the pages were blackened, as though someone had put a match to them.\nSee more\nMore examplesFewer examplesHe was fined for dropping a match on the pavement.She lit the fire with a match.\nSMART Vocabulary: related words and phrases\nHeaters & burners\nbar\nbarbecue\nbarbecue pit\nbarbie\nBBQ\nconvector\nelectric blanket\nelectric heater\nfan heater\nfurnace\ngeyser\nmatchbox\nmatchstick\npatio heater\npotbellied stove\nretort\nroom heater\nwood burner\nwood stove\nwood-burning stove\nSee more results »\nmatch noun\n(EQUAL)\n[ S ] a person or thing that is equal to another person or thing in strength, speed, or quality be no match for something/someone\nC2 to be less powerful or effective than someone or something else: Gibson ran well but was no match for the young Italian.\nSee more\nSMART Vocabulary: related words and phrases\nDescribing people with the same qualities\na tough/tricky, etc. customer idiom\nbe cast in the same mould idiom\nbe of like mind idiom\nbe of the same mind idiom\nbe on the same wavelength idiom\nbe the (living/spitting) image of someone idiom\ncast\nchip\ncustomer\ndead ringer\ndoppelgänger\ndouble\nit takes a thief to catch a thief idiom\nkindred spirit\nmeeting\nmind\nsoulmate\nstep\ntake after someone\nthief\nSee more results »\nmatch noun\n(SUITABLE)\nC2 [ S ] something that is similar to or combines well with something else: The curtains look great - they're a perfect match for the sofa.\n[ S ] If two people who are having a relationship are a good match, they are very suitable for each other: Theirs is a match made in heaven (= a very good relationship).\nMore examplesFewer examplesThese shoes are a perfect match for my bag.If you don't buy enough wallpaper, it will be difficult to get a good match later.\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordinated\ncoordination\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch up\nmatchy-matchy\ntone\ntone in\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: finding a partner\nmatch verb\n(EQUAL)\nC1 [ T ] to be as good as someone or something else: It would be difficult to match the service this airline gives its customers.\nMore examplesFewer examplesThe government has promised to match the money raised by the charity pound for pound.The severity of the punishment should match the seriousness of the crime.The teams were evenly matched until two quick goals from Robson tipped the balance in favour of England.Do you really think our team has a chance of matching their score?I'd like to match the total amount I raised in last year's marathon, at least.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\ntrade something off\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nmatch verb\n(LOOK SIMILAR)\nB1 [ I or T ] If two colours, designs, or objects match, they are similar or look attractive together: Do you think these two colours match? Does this shirt match these trousers? a sofa with curtains to match\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordinated\ncoordination\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch up\nmatchy-matchy\ntone\ntone in\nYou can also find related words, phrases, and synonyms in the topics:\nBeing or appearing similar or the same\nmatch verb\n(CHOOSE)\nB1 [ T ] to choose someone or something that is suitable for a particular person, activity, or purpose: In the first exercise you have to match each capital city to its country.\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordinated\ncoordination\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch up\nmatchy-matchy\ntone\ntone in\nPhrasal verbs\nmatch someone against someone\nmatch up\nmatch something up\nmatch something/someone up\nmatch noun\n(COMPETITION)\nAdd to word list\nAdd to word list\n[ C ] a sports competition or event in which two people or teams compete against each other: a tennis/wrestling match fig. They got into a shouting/shoving match (= they were arguing or fighting).\nmatch noun\n(STICK)\n[ C ] a short, thin stick of wood or cardboard, covered at one end with a material that will burn when rubbed against a rough surface\nmatch verb [I/T]\n(BE SUITABLE)\nto be similar to or the same as something, or to combine well with someone or something else: [ I ] The shirt and pants match perfectly. [ T ] Her fingerprints matched the prints that were taken from the crime scene.\nmatch verb [I/T]\n(BE EQUAL)\nto be equal to another person or thing in some quality: [ T ] It would be difficult to match the service this airline gives its customers. Phrasal verb\nmatch up to something\nAdd to word list\nAdd to word list\n[ T ] to be equal to another person or thing in quality, amount, or level: Few people can match his combination of skills. Results this year may not match last year's. I'm looking for a job that matches my qualifications and ambitions.\n[ I or T ] to be the same as something else, or to be the same as each other: The program automatically finds websites and news stories that match your interests. His actions and his words did not match.\n[ T ] to find something that is the same as something else, or goes well with it: match sth against sth Bring a sample of the colour you want to our store, and we will match it against one of our paint colours.match sth/sb to sth We can help you match the person to the job.\n[ T ] to give or offer the same amount of money as has been given, collected, or offered by someone else: It's hard for small stores to match supermarket prices. The charity will receive federal money to match the first $250 of each contribution.\n[ C ] something that is the same as something else: I searched for his name in the database but got the message \"No match\".find/make a match Detectives found a match with samples taken from the crime scene. I compared the two signatures, and they were an exact match.\n[ S ] a person or thing that is equal to another person or thing in quality or power: a match for sb/sth The newspaper's new head is certainly a match for the previous editor.\nbe no match for sth/sb\nto be less powerful or effective than someone or something else: Their computer firewall was no match for the hackers."}