{"id":221388,"name":"material","type":"noun","us_sound":"məˈtɪr.i.əl","us_link":"../audio/m/material.mp3","uk_sound":"məˈtɪə.ri.əl","uk_link":"../audio/m/ukmatch006.mp3","content":"material noun\n(PHYSICAL SUBSTANCE)\nAdd to word list\nAdd to word list\nB2 [ C ] a physical substance that things can be made from: building materials, such as stone Crude oil is used as the raw (= basic) material for making plastics.\nMore examplesFewer examplesThe meteorites contained only inorganic material.Clay is a very plastic material.Uranium is a radioactive material.The regular incorporation of organic material into garden soil improves its quality enormously.Prices of goods are governed by the cost of the raw materials, as well as by the cost of production and distribution.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\npowdered\nrarefy\nreflective\nrustily\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\nmaterial noun\n(INFORMATION)\nB1 [ C or U ] information used when writing something such as a book, or information produced in various forms to help people or to advertise products: I'm in the process of collecting material for an article that I'm writing.\nMore examplesFewer examplesThese documents contain classified material.The latest promotional material is all part of a recruitment drive.All our advertising material is designed in-house.I've listed some useful reading material on the handout.His latest book is a reworking of material from his previous short stories.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nmaterial noun\n(CLOTH)\nB1 [ C or U ] cloth that can be used to make things such as clothes: How much material will you need to make the skirt?\nMore examplesFewer examplesA lot of sportswear is made of very elastic material.She dipped the material into the dye.It's a dark grey material but it's flecked with white.We could use the rest of the material to make up some curtains.I'm trying to match up this wallpaper with some suitable curtain material.\nSMART Vocabulary: related words and phrases\nTextiles: general words\nbaize\nBargello\nbias\nbrocade\ncloth\ncutpiece\nfibre\nmulti-stranded\nmultifilament\nnap\npadding\npill\nplush\nreweave\nsuiting\nswatch\nthe weft\nwebbed\nwebbing\nyarn\nSee more results »\nmaterial noun\n(EQUIPMENT)\nmaterials B1 [ plural ]\nequipment that you need for a particular activity: \"Do we need any writing materials?\" \"Only a pen and a pencil.\"\nSee more\nmaterial adjective\n(PHYSICAL)\nrelating to physical objects or money rather than emotions or the spiritual world: the material world Material wealth never interested her.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\npowdered\nrarefy\nreflective\nrustily\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\nmaterial adjective\n(IMPORTANT)\nformal important or having an important effect: If you have any information that is material to the investigation, you should state it now.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nmaterial noun\n(PHYSICAL THING)\nAdd to word list\nAdd to word list\n[ C ] a type of physical thing, such as wood, stone, or plastic, having qualities that allow it to be used to make other things: a hard/soft material The sculpture was made of various materials, including steel, copper wire, and rubber.\nmaterial noun\n(CLOTH)\n[ C/U ] cloth that can be used to make clothes, curtains, etc.: [ U ] What kind of material are you going to use for the curtains?\nmaterial noun\n(SUPPLIES)\n[ C/U ] equipment or supplies needed for a particular activity: [ C usually pl ] The money will be spent on educational materials.\nmaterial noun\n(INFORMATION)\n[ C/U ] information used when writing something such as a book, or information produced to help people or to advertise products: [ U ] He is working in the library gathering material for the article he is writing.\nAdd to word list\nAdd to word list\n[ C or U ] a physical substance that things can be made from: The cost of labour and materials has risen up to 40% in a short period.building/construction materials The buildings also use recycled building materials and consume less water.traditional/natural/recycled materials There is increasing demand for products made from recycled materials. hazardous/toxic/radioactive material\n[ U or plural ] printed documents, books, computer programs, etc. that give information, especially ones intended for a particular purpose: publicity/marketing/promotional material According to their publicity material, the new rates are the lowest in the UK.teaching/training materials The video and other training materials were created in-house.printed/published material Some people prefer to receive information face-to-face, rather than through published material.\n[ U ] information used when writing something: She gave me a lot of useful material for my presentation. The journalist had been collecting material for an article on the President.\nSee also\nbill of materials\ncollateral material\ndirect materials\nraw material\nrelating to physical objects or money: Increased material wealth is delivered by today's economic system. He cares more about job satisfaction than material things."}