{"id":221609,"name":"mattering","type":"verb","us_sound":"ˈmæt̬.ɚ","us_link":"../audio/m/eus72937.mp3","uk_sound":"ˈmæt.ər","uk_link":"../audio/m/ukmatri013.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nmatter\nB2 to be important, or to affect what happens: We were late but it didn't seem to matter. \"What did you say?\" \"Oh, it doesn't matter.\" [ + question word ] It doesn't matter what you wear - just as long as you come. [ + that ] It didn't matter that our best player was injured after ten minutes - we still won. I know Charles doesn't think this project is important, but it matters to me. Compare\ncount verb\nMore examplesFewer examplesOh just put it anywhere - it doesn't matter where.Her health is what matters - the cost of the treatment is of secondary importance.It's the sum total of what you eat over a long period that matters and not what you consume in a day.The only thing that matters is that the baby is healthy.It doesn't matter if you fail, just do your best.\nSMART Vocabulary: related words and phrases\nBeing important and having importance\nbeat\nbig deal\nbulk\nbulk large idiom\ncentrality\ncome\ncountable\ncut\nfish\nfront and centre\nhave bigger/other fish to fry idiom\nhave/take pride of place idiom\nhigh-stakes\nincludable\nloom\nmatter\nreign\nsignify\nthe beating heart of something idiom\ntreasurable\nSee more results »\nGrammar\nMatterWe can use matter as a verb or a noun. It is a very common word with a number of different uses and grammatical patterns. …\nMatter as a verbThe most common use of the verb matter is in the expression it doesn’t matter (and the less common forms it didn’t matter, it wouldn’t matter and it won’t matter). It doesn’t matter means ‘it is not important’, ‘I don’t mind’ or ‘it is not a problem’: …\nMatter as a nounWe can use what’s the matter (with …)? to ask someone about a problem or to ask for an explanation of a situation that looks problematic: …\nNo matterWe can use no matter to link two clauses as a conjunction. It is a short form of it does not matter. We can use no matter with what, when, where, which, who and how to refer to a situation that cannot be changed, even though we try: …\nMatter: typical errorsThe noun matter, meaning ‘question, problem or issue’, is countable: …"}