{"id":221724,"name":"maundering","type":"adjective","us_sound":"ˈmɑːn.dɚ.ɪŋ","us_link":"../audio/m/cdo1121usmaun2739.mp3","uk_sound":"ˈmɔːn.dər.ɪŋ","uk_link":"../audio/m/cdo1121ukmaun2415.mp3","content":"Add to word list\nAdd to word list\n(of writing or speech) confused and long or lasting for a long time: They are both utterly predictable not just in their opinions but in the maundering way they deliver them. Even an actor with twice his vitality would be hard put to infuse feeling into the maundering dialogue. Synonym\nrambling (TALK)\nMore examplesFewer examplesIt shows how quickly a dramatist can progress to crispness from a maundering start.She has avoided the maundering narcissism that can bedevil the memoir.The most unsatisfactory aspect of the book is the maundering nature of the material, which slips by without ever demanding one's attention.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\nthrow your voice idiom\ntrash\nturn of phrase\ntwittering\nwang\nwhang\nwhang on\nyammer\nSee more results »\nconfused writing or speech that is long or lasts for a long time: His homophobic maundering is starting to annoy me. He didn't see why he should have to listen to Kevin's maunderings. Synonym\nrambling (SPEECH/WRITING)\nMore examplesFewer examplesHe paused ruminatively, then started again as if pulling himself from some unwanted maundering. Anyone with an ancient Usenet account can find their early maunderings preserved online.Listening to these obscene maunderings, many Americans must wonder why a person with such hatred for our country goes on living here.\nSMART Vocabulary: related words and phrases\nTalking too much\nass\nbend\nbend someone's ear idiom\nblab\nblah\ndozen\ndrivel\nedgeways\nhave a lot to say for yourself idiom\nlong-windedly\nnineteen/ten to the dozen idiom\noverplay\noverplay your hand idiom\npadding\ntrauma dumping\nverbosely\nverbosity\nwang\nwhang\nwordy\nSee more results »"}