{"id":221855,"name":"maximum","type":"adjective","us_sound":"ˈmæk.sə.məm","us_link":"../audio/m/maximum.mp3","uk_sound":"ˈmæk.sɪ.məm","uk_link":"../audio/m/ukmauso015.mp3","content":"Add to word list\nAdd to word list\nB1 being the largest amount or number allowed or possible: maximum speed/effort/temperature The bomb was designed to cause the maximum amount of damage. Synonym\nmaximal specializedOpposite\nminimum\nMore examplesFewer examplesThe judge made an example of him and gave him the maximum possible sentence.The maximum penalty for the offence is a $1000 fine.The maximum load for this elevator is eight persons.With this insurance policy there is a maximum payout of £2500.The pillars, which are outside the building, are so placed in order to provide the maximum space inside.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmin.\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nB1 the largest amount allowed or possible: The temperature will reach a maximum of 27°C today. Opposite\nminimum\nMore examplesFewer examplesPanellists on the Arts Review Board serve for a maximum of three years.We drove at 60 miles per hour, which is the maximum allowed.We can accommodate a maximum of 20 people.You can spend a maximum of £100.I had four drinks, which was the maximum allowed.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmin.\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nAdd to word list\nAdd to word list\nbeing the largest amount or number allowed or possible: a maximum penalty/sentence The stereo was turned up to maximum volume. maximum noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈmæk·sə·məm/\nThe temperature will reach a maximum of 88 today.\nAdd to word list\nAdd to word list\nbeing the largest amount or number allowed or possible: maximum cost/fee/charge This puts the total maximum cost of the computer at £750.maximum rate/level/speed The maximum rate of interest on loans is 1% a month.maximum number/amount The maximum number of people we can accommodate is 250. the maximum fine/sentence/penalty Compare\nminimum noun\nthe largest amount allowed or possible: a maximum of $100/10%/50 people, etc. The pensioners were told their income would be cut by a maximum of 20%. There are a range of tariffs with the minimum being 5% and the maximum 70%. the maximum allowed/permitted He had given a $10,000 cash contribution - the maximum allowed by law. Your expenses will be paid up to a reasonable maximum. Compare\nminimum noun"}