{"id":218048,"name":"maybe","type":"adverb","us_sound":"ˈmeɪ.bi","us_link":"../audio/m/maybe.mp3","uk_sound":"ˈmeɪ.bi","uk_link":"../audio/m/ukmauso018.mp3","content":"Add to word list\nAdd to word list\nA2 used to show that something is possible or that something might be true: Maybe they'll come tomorrow. Maybe you were right after all.\nThesaurus: synonyms, antonyms, and examples\nused to say you are not certainmaybe\"Do you want to go to the show tonight?\" \"Maybe. Let's see how I feel after work.\"perhapsPerhaps he'll decide to join us tonight.possiblyThere are four, possibly five people who have been injured in the explosion.potentiallyThese potentially unsafe chemicals are present in our groundwater.conceivablyIt would be hard, but a burglar could conceivably shut down your electronic alarm system by hacking into it. plausiblyShe argued, rather plausibly, that her neighbour was the one who took the tools from her allotment.\nSee more results »\ninformal used to show that a number or amount is approximate: There were 200, maybe 300, refugees on the boat.\nA2 used to politely suggest or ask for something: Maybe Ted would like to go. Maybe we should start again.\nused to avoid giving a clear or certain answer to a question: \"Are you coming to Kelly's party?\" \"Maybe.\"\nused to mean that something is a possible explanation for why something else happened: \"Why were you chosen for the team and not me?\" \"Maybe it's because I've been to more practices than you.\"\nMore examplesFewer examples\"Is she old?\" \"Fairly old - late sixties maybe.\"\"Can we go to the park after school?\" \"Maybe - it depends whether I get all my work finished.\"Maybe you'll get a letter from Daddy in the post today.I think maybe I ought to go round there and apologize for what I said.\"Are you going out tonight?\" \"Maybe, maybe not - I haven't decided yet.\"\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApproximate\nSuggestions & proposals\nUncertainty\nGrammar\nMaybe or may be?We use maybe and may be to talk about possibility. They are often confused because we use them both when we think that something is possible but we are not certain. …\nMaybe as an adverbMaybe /ˈmeɪbi/ is an adverb and it means the same as perhaps. It is written as one word: …\nMay beIn the phrase may be /meɪ bi:/ may is a modal verb and be is a main or auxiliary verb. Here may and be are two separate words, whereas maybe is one word: …\nMaybe or perhaps?Maybe and perhaps are adverbs that mean the same thing. We use them when we think something is possible, but we are not certain. We use maybe mostly in front or end position whereas perhaps is used in front, mid and end position: …\nAdd to word list\nAdd to word list\nused to show that something is possible or that something might be true: Maybe I can get the yard mowed before it rains. There were maybe (= approximately) 50 people there when I left.\nMaybe can also be used to avoid giving a clear or certain answer to a question: \"Are you still going to join me for dinner?\" \"Maybe.\"\nMaybe can also be used to introduce a possible explanation: I thought maybe my phone message had scared him off."}