{"id":221957,"name":"me","type":"pronoun","us_sound":"miː","us_link":"../audio/m/me.mp3","uk_sound":"miː","uk_link":"../audio/m/ukmccar009.mp3","content":"Add to word list\nAdd to word list\nA1 used, usually as the object of a verb or preposition, to refer to the person speaking or writing: Is there one for me? She gave me some money. Could you pass me that book? It wasn't me who offered to go, it was Charlotte. See also\nI\nMore examplesFewer examplesWhy didn't you consult me about this?What time would it be convenient for me to come round?He showed me into a cosy little room.The smoke made me cough.My dad gets cross with me if I leave the kitchen in a mess.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nIdiom\nis it me, or...?\n[ S ] uk\nYour browser doesn't support HTML5 audio\n/miː/ us\nYour browser doesn't support HTML5 audio\n/miː/ the musical note\nmi\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nregister\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nME noun\n(ILLNESS)\n[ U ] UK abbreviation for myalgic encephalomyelitis: an illness, sometimes lasting for several years, in which a person's muscles and joints (= places where two bones are connected) hurt and they are generally very tired Synonym\nchronic fatigue syndrome\nSMART Vocabulary: related words and phrases\nDisorders of muscles & the nervous system\nacoustic neuroma\nageusia\nakinetic-rigid HD\nALS\nAlzheimer's\ncomatose\ncrick\ndyspraxia\ndystonia\nEA\nepileptic\nfibromyalgia\nGBS\nleprosy\nneuralgia\npost-encephalitic\nprogressive supranuclear palsy\nprosopagnosia\nquadriplegia\nretrograde\nSee more results »\nME noun\n(ADDRESS)\nwritten abbreviation for the US state of Maine: used in addresses\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMississippian\nMissouri\nMissourian\nMN\nMonmouthshire\nStaffordshire\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nSee more results »\nAdd to word list\nAdd to word list\nthe person speaking; the objective form of I: Pass me that book/Pass that book to me. \"I want to go to the store.\" \"Me, too (= I also want to go).\" \"I’d never go there alone at night.\" \"Me neither (= I also would not).\""}