{"id":221994,"name":"meal","type":"noun","us_sound":"mɪəl","us_link":"../audio/m/meal.mp3","uk_sound":"mɪəl","uk_link":"../audio/m/ukmccar013.mp3","content":"meal noun\n(FOOD)\nAdd to word list\nAdd to word list\nA1 [ C ] an occasion when food is eaten, or the food that is eaten on such an occasion: a hot meal a three-course meal a heavy (= large) meal a light (= small) meal I have my main meal at midday. How about coming over for a meal sometime?\nMore examplesFewer examplesThat was the worst meal I've ever eaten.Every so often I treat myself to a meal in an expensive restaurant.Do you fancy going out for a meal after work?You should always wash your hands before meals.If you eat three good meals a day, you're less likely to snack on biscuits and crisps.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplate meal\nploughman's lunch\npostprandial\npot luck\npower breakfast\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nmeal noun\n(POWDER)\n[ U ] a substance that has been crushed to make a rough powder, especially plant seeds crushed to make flour or for animal food: bone meal corn meal\nSMART Vocabulary: related words and phrases\nFlour & yeast\nall-purpose flour\nbaker's yeast\nbesan\nblue corn\ncassava\nfarinha\nflour\nfloury\ngluten\ngraham flour\nmother\nnooch\nnutritional yeast\noatmeal\npatent flour\nsemolina\nsourdough\nstoneground\nunbolted\nwheatmeal\nSee more results »\nIdiom\nmake a meal (out) of something\nmeal noun\n(FOOD)\nAdd to word list\nAdd to word list\n[ C ] an occasion when food is served or eaten, esp. breakfast, lunch, or dinner, or the food itself on such an occasion: I don’t enjoy preparing three meals a day every day.\nmeal noun\n(POWDER)\n[ U ] a substance that has been crushed to make a rough powder, esp. plant seeds crushed to make flour or for animal food\nAdd to word list\nAdd to word list\n[ C ] an occasion when food is eaten, or the food which is eaten on such an occasion: go out/take sb out for a meal He took the whole team out for a meal at the end of the project.have/eat a meal I have my main meal at midday. a heavy/light/hot meal a three-course meal\n[ U ] a substance which has been crushed to make a rough powder, especially plant seeds crushed to make flour or for animal food: bone meal soya meal See also\nready meal"}