{"id":222063,"name":"means","type":"noun","us_sound":"miːnz","us_link":"../audio/m/means.mp3","uk_sound":"miːnz","uk_link":"../audio/m/ukmccar030.mp3","content":"means noun\n(METHOD)\nAdd to word list\nAdd to word list\nB2 [ C ] a method or way of doing something: They had no means of communication. We need to find some other means of transportation. We need to use every means at our disposal. She tried to explain by means of sign language. There is no means of tracing the debt at all. The family had no means of support (= way of getting money).\nMore examplesFewer examplesTelevision is an increasingly important means of communication.Exams are not the only means of assessing a student's ability.Well, we'll just have to find some other means of persuading her.There must be some means by which wealth can be distributed more equitably.Another means of preventing further flooding would be to deepen the river bed.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nmeans noun\n(MONEY)\nC2 [ plural ] money, for example from an income, that allows you to buy things: [ + to infinitive ] He has the means to buy half the houses in the street if he wanted to. live beyond your means\nto spend more money than you receive as income: Over 40% of Americans admitted they were living beyond their means.\nSee more live within your means\nto spend less money than you receive as income: He promised that he wouldn't use his credit card too much - he wanted to live within his means.\nSee more a man/woman of means\na rich man/woman: You can tell from the clothes she wears that she's a woman of means.\nSee more\nSMART Vocabulary: related words and phrases\nAccounting\naccountancy\naccountant\naccounting\naccounts\nauditor\nbad debt\nbalance\nbalance sheet\nbudget\ncreative accounting\ndouble entry bookkeeping\nexpense account\nfalse accounting\nforensic accountant\nforensic accounting\nloss\ntreasurer\nunaudited\nunreconciled\nwrite something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEarning money\nAmounts of money\nIdioms\nby all means\nby no means\na means to an end\nmeans plural noun\n(METHOD)\nAdd to word list\nAdd to word list\na method or way of doing something: They had no means of letting him know that the flight was canceled. by means of\nBy means of is used to show the method used: Students are selected for scholarships by means of an open, national competition.\nmeans plural noun\n(MONEY)\nmoney or income that allows you to buy things or services: [ + to infinitive ] They simply don’t have the means to send their children to private schools. of means\nA person of means is rich. Idioms\na means to an end\nby no means\nAdd to word list\nAdd to word list\n[ C ] a method or way of doing something: We must use every means at our disposal.means of sth We need to find some other means of transportation.means of doing sth There is no means of tracing the debt at all. They saw the redundancies as a means to an end.\n[ plural ] money, for example from an income, that allows you to buy things: the means to do sth With over $160 million of cash and virtually no debt, the company has the means to expand.\nbeyond your means\nif you are living beyond your means, you are spending more money than you earn: Too many people live beyond their means.\nthe means justify the end\nused to say that it does not matter if the methods used to achieve something are wrong, dishonest, etc. as long as you get the result you want : I'm sorry, but reducing the wages of the lowest-paid in order to save money is just not acceptable - the means don't justify the end.\nby means of\nusing something: The device is attached to the patient's arm by means of straps."}