{"id":222028,"name":"mean","type":"verb","us_sound":"miːn","us_link":"../audio/m/mean.mp3","uk_sound":"miːn","uk_link":"../audio/m/ukmccar016.mp3","content":"mean verb\n(EXPRESS)\nAdd to word list\nAdd to word list\nA2 [ T ] to express or represent something such as an idea, thought, or fact: What does this word mean? [ + that ] These figures mean that almost six percent of the working population is unemployed. What do you mean by that remark? She's kind of strange though. Do you know what I mean? \"They all showed up.\" \"You mean the entire family?\"\n[ T ] used to add emphasis to what you are saying: I want you home by midnight. And I mean midnight. Give it back now! I mean it.\nMore examplesFewer examplesWhen he said three o'clock, I thought he meant in the afternoon.Charges are made on a sliding scale, which means that the amount you must pay increases with the level of your income.If you don't know what the word means, look it up in a dictionary.You should take it as a compliment when I fall asleep in your company - it means I'm relaxed.A continuous white line in the middle of the road means no overtaking.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbadge\nbe a badge of something idiom\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nmean verb\n(HAVE RESULT)\nB1 [ T ] to have a particular result: Lower costs mean lower prices. [ + that ] Advances in electronics mean that the technology is already available. [ + -ing verb ] If we want to catch the 7.30 train, that will mean leaving the house at 6.00.\nMore examplesFewer examplesHigh acidity levels in the water mean that the fish are not so large.Shortages mean that even staples like bread are difficult to find.In a way I'd prefer it if they didn't come, because it would mean extra work.Let's say that the journey takes three hours, that means you'll arrive at two o'clock.The irregularity of English spelling means that it is easy to make mistakes.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbadge\nbe a badge of something idiom\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nmean verb\n(INTEND)\nB1 [ I or T ] to intend: I'm sorry if I offended you - I didn't mean any harm. The books with large print are meant for partially sighted readers. [ + to infinitive ] I've been meaning to call you all week. Do you think she meant to say 9 a.m. instead of 9 p.m.? They didn't mean for her to read the letter. be meant to do sth\nto be intended to: These batteries are meant to last for a year. This exercise isn't meant to be difficult. We were meant to have gone away this week, but Debbie's ill so we couldn't go. You are meant to rub the medicine on the affected area, not swallow it.\nMore examplesFewer examplesI didn't mean to be rude - it just came out like that.He doesn't really mean it - he's just being contrary.He's always making flattering remarks, but he doesn't really mean them.I didn't mean to upset her - it was just a bit of fun.He didn't mean it - he said it in the heat of the moment.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nmean verb\n(HAVE IMPORTANCE)\nB1 [ T ] to have an important emotional effect on someone: It wasn't a valuable picture but it meant a lot to me. Possessions mean nothing to him.\nMore examplesFewer examplesHer children mean all the world to her.Gerald means nothing to me now.Her career means everything to her.Nothing means more to me than my children's happiness.Her approval meant a lot to me.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbadge\nbe a badge of something idiom\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nGrammar\nMeanWe use mean to explain or ask what a word or phrase refers to. We form questions with mean with the auxiliary verb do: …\nI meanWe use I mean very commonly in speaking as a discourse marker. We use it when we want to add to what we have just said, to make a point clearer or to correct what we have just said: …\nWe often use the phrase you know what I mean (or if you know what I mean or do you know what I mean?) in speaking, to check that our listener understands what we are saying or to show that we assume the listener has the same opinion about something: …\nNounsNouns are one of the four major word classes, along with verbs, adjectives and adverbs. Nouns are the largest word class. …\nBe meant toBe meant to is used to talk about what is desirable, expected or intended: …\nIdioms\nbe meant for each other\nI mean\nmean business\nmean well\n(do you) see what I mean?\nwhat do you mean?\nmean adjective\n(NOT GENEROUS)\nB2 mainly UK not willing to give or share things, especially money: He's too mean to buy her a ring. My landlord's very mean with the heating - it's only on for two hours each day.\nMore examplesFewer examplesShe's really quite unpleasant about other people and she's as mean as hell.He's a mean old scrooge!\"That was amazingly generous of you!\" \"Well, that was a two-edged comment - are you saying I'm usually mean?\"He's too mean to buy any new clothes.She only gave you 50p? That was a bit mean.\nSMART Vocabulary: related words and phrases\nMean with money\nbegrudge\ncheapskate\ncheeseparing\nchintzy\nfrugal\nfrugally\nmiser\nmiserliness\nmiserly\nmoney grabber\nmoney-grubber\nmoney-grubbing\npenuriously\npinchpenny\nscrooge\nskinflint\nstingily\ntightwad\nungenerous\nungenerously\nSee more results »\nmean adjective\n(NOT KIND)\nB2 unkind or unpleasant: Stop being so mean to me! She just said it to be mean.\nThesaurus: synonyms, antonyms, and examples\nnot kind to someone or something and causing paincruelTeasing them for being overweight is cruel.callousHe had a callous disregard for the feelings of others.cold-bloodedThe budget is based on a cold-blooded analysis of the markets.ruthlessHe was a ruthless dictator.heartlessHe has been described as a heartless boss by several employees.\nSee more results »\nMore examplesFewer examplesHe's as mean as they come.You shouldn't have been so mean to your mother - she deserves better.And she didn't invite him? That was a bit mean!Stop being so mean to your brother!It was mean of him to make her stay late.\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruel\ncruelly\ncruelty\ncutthroat\nmeanly\nmeanness\nmental cruelty\nmerciless\nmercilessly\ntrenchancy\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nSee more results »\nmean adjective\n(VIOLENT)\nmainly US frightening and likely to become violent: a mean and angry mob a mean-looking youth\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noffensively\noutrage\nproactive aggression\npugnacious\npugnaciously\nultra-violent\nuntameable\nvicious\nviciously\nviciousness\nSee more results »\nmean adjective\n(GOOD)\n[ before noun ] informal very good: She's a mean piano player. She plays a mean piano (= she plays very well).\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njim-dandy\njuicy\nknock\nknock spots off something idiom\nlike a boss idiom\nout of sight idiom\nplum\nroyally\nrule OK idiom\nsafe\nshabby\nshit hot\nsight\nsteal\nSee more results »\nmean adjective\n(BAD QUALITY)\n[ before noun ] informal poor, dirty, and of bad quality: He was born in the mean streets of Detroit in 1945.\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ncheesy\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\nsort\ntawdrily\ntawdriness\ntawdry\nthinness\ntrinket\nwretched\nSee more results »\nmean adjective\n(MATHEMATICS)\nC2 [ before noun ]\n&#160; mathematics\n&#160; specialized a mean number is an average number: a mean value Their mean weight was 76.4 kilos.\nSMART Vocabulary: related words and phrases\nStatistics\nactuarial\nasymmetric\nbackground variable\ncategorical variable\ncentral tendency\ncontextual variable\nentropic\nentropically\nentropy\nGaussian distribution\nhomoscedasticity\nidentifiability\nmedian\nquantile\nresponse variable\nstandard deviation\nstat\nstatistic\nstatistically\nstochastic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\nIdioms\nno mean something\nno mean achievement/feat\nmean noun [S]\n(MATHEMATICS)\nmathematics\n&#160; specialized (also the arithmetic mean) the result you get by adding two or more amounts together and dividing the total by the number of amounts: The mean of 5, 4, 10, and 15 is 8.5. Compare\naverage noun (AMOUNT)\nSMART Vocabulary: related words and phrases\nStatistics\nactuarial\nasymmetric\nbackground variable\ncategorical variable\ncentral tendency\ncontextual variable\nentropic\nentropically\nentropy\nGaussian distribution\nhomoscedasticity\nidentifiability\nmedian\nquantile\nresponse variable\nstandard deviation\nstat\nstatistic\nstatistically\nstochastic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\nmean noun [S]\n(METHOD)\nformal a quality or way of doing something that is in the middle of two completely different qualities or ways of doing something: We need to find a mean between test questions that are too difficult and those that are too easy.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\nmean verb\n(EXPRESS)\nAdd to word list\nAdd to word list\n[ T ] to represent or express something intended, or to refer to someone or something: \"What does ’rough’ mean?\" \"It means ’not smooth.’\" [ + that clause ] These figures mean that almost 7% of the population is unemployed. \"Do you see that girl over there?\" \"Do you mean the one with short blond hair?\"\nmean verb\n(HAVE RESULT)\n[ T ] to have as a result: Lower costs mean higher profits. [ + (that) clause ] If she doesn’t answer the phone, it means (that) she’s out in the garden.\nmean verb\n(HAVE IMPORTANCE)\n[ T ] to have the importance or value of: My grandmother’s ring wasn’t valuable, but it meant a lot to me.\nmean verb\n(INTEND)\n[ I/T ] to say or do something intentionally; intend: [ T ] I think she meant 8 o’clock, although she said 7 o’clock. [ I ] I’ve been meaning to call you but I’ve been so busy I never got around to it.\n[ I/T ] Mean can also be used to add emphasis to what you are saying: [ T ] She means what she says. Idioms\nmean business\nmean well\nmean noun [C]\n(AVERAGE)\nmathematics a number that is the result of adding a group of numbers together and then dividing the result by how many numbers were in the group\nmean adjective [-er/-est only]\n(NOT KIND)\nunkind or not caring: I felt a little mean when I said I couldn’t visit her in the hospital until Saturday.\nmean adjective [-er/-est only]\n(GOOD)\nslang very good: She plays a mean bass fiddle.\nAdd to word list\nAdd to word list\nMEASURES\n&#160; (also arithmetic mean) the result you get by adding two or more amounts together and dividing the total by the number of amounts: The mean of 5, 4, 10, and 15 is 8.5.\na quality or way of doing something that is in the middle of two completely different qualities or ways of doing something: a mean between sth and sth This description doesn't give enough information, and this one is too long – we need to find a mean between the two.\nto express or represent something such as an idea, thought, or fact: What does this word mean?mean sth by sth What do you mean by 'rightsizing the department'?\nto have a particular result: Lower costs mean lower prices.mean (that) Advances in electronics mean that the technology is already available.mean doing sth If we increased our workforce, that would mean finding larger premises.\nMEASURES a mean number is the result you get by adding two or more amounts together and dividing the total by the number of amounts: The mean weight of the crates is 76.4 kilos. The table above shows the mean price per dozen of large grade A eggs.\nunkind: be mean to sb If she's ever mean to staff, she always apologizes afterwards.\nnot generous: be mean with sth My boss is well known for being mean with money."}