{"id":222050,"name":"meaningfully","type":"adverb","us_sound":"ˈmiː.nɪŋ.fəl.i","us_link":"../audio/m/usmeand003.mp3","uk_sound":"ˈmiː.nɪŋ.fəl.i","uk_link":"../audio/m/ukmccar023.mp3","content":"meaningfully adverb\n(WITH MEANING)\nAdd to word list\nAdd to word list\nin a way that is intended to express a feeling or thought without saying it directly: She tilted her head meaningfully towards him.\nin a way that has meaning and makes sense: Some forms of dementia can render a patient unable to communicate meaningfully.\nMore examplesFewer examplesShe glanced meaningfully at her three younger sisters. You could always count on a good poem to make them cry or sigh meaningfully. The passages of historical exposition need to be spoken slowly and more meaningfully.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbe a badge of something idiom\nconnotation\ni.e.\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfulness\nmeaningless\npurport\nsense\nsignificant\nspeak\nsubtext\nuse\nwhat's with something? idiom\nSee more results »\nmeaningfully adverb\n(SERIOUSLY)\nin a useful, serious or important way: In other respects, new practices may not differ meaningfully from the old. See\nmeaningful\nMore examplesFewer examplesFor the fans, it has meant high and increasing ticket prices, and the status quo has meant teams cannot meaningfully compete.The idea is that these state employees must meaningfully engage in the training. All parties gain meaningfully in this carefully crafted settlement.Reducing our oil dependency meaningfully, requires radically improving the efficiency of our vehicles.He failed to participate meaningfully in the legislative process.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprime\nprincipally\nprior\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous"}