{"id":222092,"name":"measure","type":"verb","us_sound":"ˈmeʒ.ɚ","us_link":"../audio/m/measure.mp3","uk_sound":"ˈmeʒ.ər","uk_link":"../audio/m/ukmeant009.mp3","content":"measure verb\n(SIZE)\nAdd to word list\nAdd to word list\nB2 [ T ] to discover the exact size or amount of something: \"Will the table fit in here?\" \"I don't know - let's measure it.\" This machine measures your heart rate. He measured the flour into the bowl.\n[ L only + noun ] to be a particular size: The area, measuring/which measures five kilometres by three kilometres, has been purchased by the army. The screen measures 34 inches diagonally.\nMore examplesFewer examplesThe main bedroom measures 24 ft by 18 ft (24' x 18').Engine speed can be measured in revolutions per minute (rpm).The metre is the standard unit for measuring length in the SI system.Measure all the dry ingredients into a large mixing bowl.This stick is used for measuring the amount of oil in the engine - do you see the marks on it?\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\nsurvey\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for size and amount\nmeasure verb\n(JUDGE)\nC2 [ T ] to judge the quality, effect, importance, or value of something: There is no way of measuring the damage done to morale.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nPhrasal verbs\nmeasure someone/something against someone/something\nmeasure something out\nmeasure up\nmeasure someone/something up\nmeasure noun\n(METHOD)\nB2 [ C usually plural ] a way of achieving something, or a method for dealing with a situation: What further measures can we take to avoid terrorism? These measures were designed to improve car safety. [ + to infinitive ] Emergency measures to help the refugees are badly needed.\nThesaurus: synonyms, antonyms, and examples\nnecessary actionactionThey are considering legal action.course of actionThey have not yet decided on a particular course of action.measureMeasures are in place to prevent flooding.stepThese simple steps will ensure that infections are not spread.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take actiontake actionIt may already be too late to take action to prevent the loss of habitat these animals face.actThey need to act decisively to prevent further damage to crops.take measuresWe call on the government to take the necessary measures to bring to justice those responsible for this attack.take stepsThe authorities have taken steps to prevent any reoccurrence of the problem. do somethingIt's about time the government did something about it.\nSee more results »\nMore examplesFewer examplesThe new tax would force companies to adopt energy-saving measures.These measures are designed to reduce pollution.Teachers claim such measures could unfairly disadvantage ethnic minorities.In the past 10 years, preventive measures have radically reduced levels of tooth decay in children.New measures have been introduced to try and ease traffic congestion in the city.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nmeasure noun\n(SIZE)\n[ C or U ] a unit used for stating the size, weight, etc. of something, or a way of measuring: weights and measures The sample's density is a measure of its purity.\nC2 [ C or U ] formal amount: There was a large measure of agreement between the candidates. His success was in some measure due to his being in the right place at the right time.\nC2 [ C ] an exact amount, especially of alcohol: One unit of alcohol is equal to half a pint of beer or a standard measure of spirits.\n[ C ] US a\nbar\nMore examplesFewer examplesThe president's staff have no reliable measure of the damage done to his reputation.The pole was a measure used for land in the past.What measure do they use for diamonds?\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for size and amount\nMeasurements of volume\nAlcohol - general words\nBeats or lengths of musical notes\nmeasure noun\n(WAY OF JUDGING)\nC2 [ C ] a way of judging something: Record sales are not always a measure of a singer's popularity. We have no accurate measure of the damage. Compare\ncriterion\nstandard noun\ntouchstone\nyardstick (STANDARD)\nMore examplesFewer examplesRepeat purchases are one measure of a product's popularity.Their satisfied sighs were a good measure of the meal's success.The president's staff have no reliable measure of the damage done to his reputation.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\nsurvey\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nIdiom\nhave the measure of someone/something\nmeasure verb\n(SIZE)\nAdd to word list\nAdd to word list\nto discover the exact size, amount, etc., of something, or to be of a particular size: [ T ] \"Will the table fit in here?\" \"I don’t know – I’ll measure it.\" [ L ] The sofa measures (= is of the size of) 3 feet by 7 feet. Phrasal verb\nmeasure up\nmeasure noun\n(METHOD)\n[ C ] a way to achieve something; a method: Medicare was a measure intended to guarantee health care for everyone over the age of 65.\nmeasure noun\n(SIZE)\n[ C/U ] a way of measuring, or a way of showing how much or how great something is: [ C ] a system of weights and measures [ U ] It is a measure of his popularity that he got over 70% of the vote.\n[ C/U ] Measure can also mean amount or degree: [ U ] There was a large measure of luck in his quick promotion to company vice president.\n[ C/U ]\n&#160; music A measure is also one of the small equal parts into which a piece of music is divided, containing a fixed number of beats; a bar.\nAdd to word list\nAdd to word list\n[ I or T ] to discover the exact size or amount of something: Next, we need to measure the temperature of the mixture. This machine measures the patient's heart rate.measure sth in sth November was a record number for sales when measured in dollars. measuring devices/equipment/techniques\n[ T ] to be of a particular size: The office measures 12 metres by 6 metres.\n[ T ] to judge the quality, effect, importance, or value of something: It is difficult to measure the success of the advertising campaign at this early stage. Managers have changed the way they measure performance.\nPhrasal verbs\nmeasure sth against sth\nmeasure sth out\nmeasure up\nmeasure sth/sb up\n[ C, usually plural ] a way of achieving something, or a method for dealing with a situation: These measures were designed to improve car safety. We will introduce measures to reduce noise levels in the factory. The company will need to take further measures to cut costs.austerity/cost-cutting measures It had taken a series of cost-cutting measures, including closing one of its two plants. drastic/draconian/radical measures preventative/safety/security measures\n[ C ]\n&#160; MEASURES a unit used for giving the size, weight, etc. of something: weights and measures The standard measure of efficiency in the airline industry is 'cost per passenger mile'.\n[ C or U ] an amount or level of something: There was a large measure of agreement between the two sides in the negotiation.\n[ C ] a way of judging something: Record sales are not always a measure of a singer's popularity.get a measure of sth It is difficult to get an accurate measure of employee performance in this industry.a good/true/reliable measure Exports as a percentage of total sales are a good measure of international competitiveness.\nfor good measure\nif something is given or done for good measure, it is given or done in addition to other things: They're offering a good salary, with a company car thrown in for good measure.\nhave the measure of sb/sth\nto understand what someone or something is like and to know how to deal with them: The other team were experienced negotiators, but we had the measure of them.\nSee also\ncountermeasure\ndry measure\nmade-to-measure"}