{"id":222100,"name":"measurement","type":"noun","us_sound":"ˈmeʒ.ɚ.mənt","us_link":"../audio/m/measurement.mp3","uk_sound":"ˈmeʒ.ə.mənt","uk_link":"../audio/m/ukmeant011.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] the act or process of measuring: The test is based on the measurement of blood levels. The machine makes thousands of measurements every day.\nB2 [ C ] a value, discovered by measuring, that corresponds to the size, shape, quality, etc. of something: The measurements of both rooms were identical. What is your inside leg measurement? measurements [ plural ]\nYour measurements are the sizes of various parts of your body, especially your chest, waist, and hips, that you refer to when you want to buy clothes: She sent her measurements to the seamstress.\nSee more\nMore examplesFewer examplesWe took measurements in all the rooms.The measurement of water flow is crucial to the system.The device is used for the measurement of rainfall.You need to check his measurements.Have you got the measurements for the carpet?\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\nsurvey\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements in general\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nAdd to word list\nAdd to word list\nthe act of measuring: [ U ] The test is based on the measurement of blood sugar.\nA measurement is the length, height, width, etc., of something, which you discover by measuring it: [ C ] The measurements of several of the drawings were identical.\nAdd to word list\nAdd to word list\n[ C or U ] the act of measuring something: The measurement of performance, or effectiveness, is a constant concern in management research. accurate/precise/proper/detailed measurement It is these specific characteristics that require detailed measurement. Doing more measurements is the common strategy to improve reliability.\nmeasurements [ plural ]\nthe size, shape, quality, etc. of something, which you discover by measuring it: The measurements of the bike, when folded, are 68cm x 52cm x 26cm. Although exact measurements are not available, piracy is said to be a \"very big problem\"."}