{"id":222321,"name":"mediate","type":"verb","us_sound":"ˈmiː.di.eɪt","us_link":"../audio/m/mediate.mp3","uk_sound":"ˈmiː.di.eɪt","uk_link":"../audio/m/ukmeddl008.mp3","content":"Add to word list\nAdd to word list\nto talk to two separate people or groups involved in a disagreement to try to help them to agree or find a solution to their problems: Negotiators were called in to mediate between the two sides. The two envoys have succeeded in mediating an end to the war. Synonyms\narbitrate\nintercede formal\nSMART Vocabulary: related words and phrases\nInternational relations: diplomacy & mediation\nambassador\nambassadorial\nappease\nappeasement\nattaché\ndiplomatic\ndiplomatic bag\ndiplomatic corps\ndiplomatic immunity\ndiplomatic relations\nintercede\nintermediary\nintermediation\ninternationalist\ninterventionism\nlegation\nplenipotentiary\nshuttle diplomacy\nundiplomatic\nundiplomatically\nSee more results »\nRelated words\nmediation\nmediator\nAdd to word list\nAdd to word list\nto help solve a disagreement by talking to the separate people or groups involved, or to communicate information between people: [ T ] to mediate a dispute mediation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌmid·iˈeɪ·ʃən/\nLast-minute attempts at mediation failed, and the workers went on strike. mediator noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈmid·iˌeɪ·t̬ər/\nThe governor appointed a mediator and asked both sides to return to the bargaining table.\nAdd to word list\nAdd to word list\n[ I or T ] to help two sides in a disagreement, for example employers and employees, to talk about a solution for ending it: Senior government officials backed down on threats to halt oil production when the US offered to mediate in the dispute. The US offered to mediate in the dispute.mediate between sb/sth An independent adjudicator attempted to mediate between the two parties, but failed.mediate a dispute/conflict House Bill 377 calls for a third party to help mediate any dispute.be mediated by sb/sth Negotiations were mediated by the United Nations and the African Union.\n[ T ] to try to end a disagreement by helping the two sides to talk about and agree on a solution: mediate an end to a crisis/dispute/strike Over the past few days, efforts have continued to mediate an end to the strike.mediate a solution/settlement/compromise We are currently trying to mediate a solution to save the health-insurance program. Compare\narbitrate"}