{"id":222392,"name":"medicine","type":"noun","us_sound":"ˈmed.ɪ.sən","us_link":"../audio/m/eus72958.mp3","uk_sound":"ˈmed.ɪ.sən","uk_link":"../audio/m/ukmeddl019.mp3","content":"medicine noun\n(TREATMENT)\nAdd to word list\nAdd to word list\nB1 [ U ] treatment for illness or injury, or the study of this: paediatric/preventative medicine orthodox/Western medicine a career in medicine She is a doctor, but is unable to practise medicine (= work as a doctor) in her own country.\nMore examplesFewer examplesShe is a cancer sufferer who has rejected orthodox medicine and turned instead to acupuncture, aromatherapy and other forms of alternative medicine.Elizabeth Quan is a London-based practitioner of traditional Chinese medicine.She specializes in paediatric medicine.The number of practising doctors is falling even though more people are qualifying in medicine.Penicillin produced a revolution in medicine.\nSMART Vocabulary: related words and phrases\nMedical treatment: general words\nallopathic\nAMA\nbiosurgery\nco-administration\ndetoxify\nmedicalization\nmedicalize\nmedically\nmodality\nmuscularly\northopaedic\nphototherapy\npolypharmacy\npostoperative\nprehab\nprehabilitation\nreconstructive\nrestorative\nstretcher\ntherapeutic\nSee more results »\nmedicine noun\n(SUBSTANCE)\nA2 [ C or U ] a substance, especially in the form of a liquid or a pill, that is a treatment for illness or injury: cough medicine Take two spoonfuls of medicine at mealtimes. She knows a lot about herbal medicines.\nMore examplesFewer examplesThis medicine is for external use only and should not be taken internally.Is this medicine safe for children?The little boy was stamping his foot and refusing to take his medicine.The trucks were laden with food and medicine.This drug can be safely used in combination with other medicines.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nbooster\nCaplet\nchemotherapy\ndosage\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\nIdiom\ngive someone a dose/taste of their own medicine\nmedicine noun\n(TREATMENT)\nAdd to word list\nAdd to word list\n[ U ] the science dealing with the preserving of health and with preventing and treating disease or injury: Pediatrics is a branch of medicine. She continued to practice medicine until she was in her eighties.\nmedicine noun\n(SUBSTANCE)\n[ C/U ] a substance taken into the body in treating an illness: [ U ] Take two spoonfuls of cough medicine. [ C ] This antibiotic should not be taken with other medicines. medicinal adjective us\nYour browser doesn't support HTML5 audio\n/məˈdɪs·ə·nəl/\nThe Indians used the plant as a medicinal substance.\nAdd to word list\nAdd to word list\n[ U ] the treatment of illness or injury, or the study of how illnesses and injuries are treated: Medicine has advanced enormously over the past 100 years. alternative/complementary/preventive medicine\n[ C or U ] a drug that is used to treat illness or injury: Producing new medicines is an enormously complex and costly process. The President announced that he would send $320 million worth of food and medicine to the region. over-the-counter/prescription medicine(s)"}