{"id":222360,"name":"medical","type":"adjective","us_sound":"ˈmed.ɪ.kəl","us_link":"../audio/m/medical.mp3","uk_sound":"ˈmed.ɪ.kəl","uk_link":"../audio/m/ukmeddl013.mp3","content":"Add to word list\nAdd to word list\nB2 related to the treatment of illness and injuries: medical advice medical books a medical team medical workers\nMore examplesFewer examplesA person's medical records are confidential.Without more food and medical supplies, these people will surely not survive.The medical tests showed some variation in the baby's heart rate.Recent advances in medical science mean that this illness can now be cured.If symptoms persist seek medical attention.\nSMART Vocabulary: related words and phrases\nMedical treatment: general words\nallopathic\nAMA\nbiosurgery\nco-administration\ndetoxify\nmedicalization\nmedicalize\nmedically\nmodality\nmuscularly\northopaedic\nphototherapy\npolypharmacy\npostoperative\nprehab\nprehabilitation\nreconstructive\nrestorative\nstretcher\ntherapeutic\nSee more results »\nRelated word\nmedically adverb\nan examination of a person's body by a doctor in order to discover if that person is healthy, sometimes done before a person can be accepted for a particular job: The insurance company wanted me to have a medical. Synonyms\ncheck-up UK\nexamination\nSMART Vocabulary: related words and phrases\nMedical examination\n-scopy\nanechoic\naudiological\nbiopsic\nblood work\nCAT scan\nEKG\nendoscopy\nGillet test\nhistological\nhistologically\nhysteroscopy\nimmunohistochemical\nmammography\nradiography\nsigmoidoscopy\nsonography\nSPECT\nsperm count\nstress test\nSee more results »\nAdd to word list\nAdd to word list\nof or relating to medicine, or for the treatment of disease or injury: She is in her final year of medical school. Medical research has led to better treatment for diabetes patients. medically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈmed·ɪ·kli/\nStaying another night in the hospital was not medically necessary, so she was discharged.\nAdd to word list\nAdd to word list\nrelating to medicine or to the treatment of illness or injury: Despite concerns about security, many doctors think the benefits of having medical records in digital form outweigh the liabilities. medical treatment/care/services medical bills/expenses medical research/equipment/advice\nHR an examination done by a doctor to check someone's health: I failed a routine medical at work last year.undergo/pass/fail a medical All candidates must undergo a medical before being accepted on the scheme."}