{"id":222510,"name":"medium","type":"adjective","us_sound":"ˈmiː.di.əm","us_link":"../audio/m/medium.mp3","uk_sound":"ˈmiː.di.əm","uk_link":"../audio/m/ukmeddl028.mp3","content":"medium adjective\n(MIDDLE)\nAdd to word list\nAdd to word list\nB1 being in the middle between an upper and lower amount, size, degree, or value: a girl of medium height a medium-sized book\nMore examplesFewer examplesMy hairdryer has three settings - high, medium and low.I take a medium size in clothes.He earns a medium amount of money.Cook the sauce over a medium heat.Chop one medium carrot.\nSMART Vocabulary: related words and phrases\nMedium-sized\naverage\nM, m\nmiddle\nmidi\nmidsize\nmildness\nmoderate\nmoderately\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\nmedium adjective\n(MEAT)\n(of meat) cooked so that it is no longer red in the middle: Would you like your steak rare, medium, or well done? Compare\nrare (OF MEAT)\nwell done\nSMART Vocabulary: related words and phrases\nPreparing food using heat\nair fryer\nbain-marie\nbaking\nbaking parchment\nbarbecue\nblanch\ncooking\ndeep fat fryer\ndeep-fried\ndeep-fry\ndone\noverdone\npan-fry\nparboil\npoach\npoaching\nsear\nunderdone\nwarm (someone/something) up\nwood-fired\nSee more results »\nmedium noun [C]\n(METHOD)\nC2 plural media or mediums a method or way of expressing something: the broadcasting/print medium They told the story through the medium of dance.\nSMART Vocabulary: related words and phrases\nMedia in general\nanti-press\nconsume\neditorially\nmainstream media\nmedia\nmedia event\nMSM\nnon-broadcast\norgan\npress\nprofile\npublishing\nthe Fourth Estate\nthe mass media\nunreported\nvehicle\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things\nmedium noun [C]\n(PERSON)\nplural mediums a person who says that they can receive messages from people who are dead\nSMART Vocabulary: related words and phrases\nPeople who perform magic or have paranormal abilities\nalchemist\nclairvoyant\nconjurer\ncoven\ncrone\nescapologist\nghostbuster\nillusionist\nmage\nmagician\npsychic\nseer\nshaman\nsoothsayer\nsorcerer\nsorceress\nvisionary\nwitch doctor\nwizard\nwizardly\nSee more results »\nmedium noun [C]\n(SUBSTANCE)\na substance that something grows in, lives in, or moves through: Compost is an excellent growing medium.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\nchurn\ncrossed\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nmeld\nmethylate\nmingle\nmosaic\nmush\nsaturated solution\nscramble\nsynthesis\nSee more results »\nmedium adjective [not gradable]\n(AVERAGE)\nAdd to word list\nAdd to word list\nbeing in the middle between an upper and lower amount, size, or degree; average: He was a man of medium height. The shirt is available in small, medium, and large sizes.\nMedium also refers to a way of cooking meat or fish so that it is cooked in the middle: Would you like your steak rare, medium, or well-done?\nmedium noun [C]\n(METHOD)\nus\nYour browser doesn't support HTML5 audio\n/ˈmid·i·əm/ plural mediums or media us/ˈmid·i·ə/ a method or way of expressing something: the broadcasting/print medium\nart us\nYour browser doesn't support HTML5 audio\n/ˈmid·i·əm/ plural mediums or media us/ˈmid·i·ə/ The medium that an artist works in is the materials or method used to create things: The work of art was done in mixed media (= using different substances), and included wood shavings, pieces of metal, glue, and oil paint.\nmedium noun [C]\n(MATERIAL/SUBSTANCE)\nphysics us/ˈmid·i·əm/ the material through which a wave or other force travels\nmedium noun [C]\n(PERSON)\nus\nYour browser doesn't support HTML5 audio\n/ˈmid·i·əm/ plural mediums a person who claims to receive messages from people who are dead\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMUNICATIONS\n&#160; plural media or mediums a method of communication or entertainment, for example television, radio, or the internet: a medium of sth Interactive TV opens up the medium of television to the participation of individuals.a medium for sth The internet is a growing medium for uncensored information and discussion. Typically cinema is the chosen medium for visualizing the future.advertising/communications/marketing medium Many businesses are finding Web video an attractive marketing medium.digital/interactive/storage media The government has identified digital media as a key opportunity.\n[ C ] plural media or mediums something that is used as a way of creating or expressing something else: a medium for sth Products are the medium for communication between corporations and the market.a medium of sth Body language is often consciously used as a medium of expressing thoughts and feelings.through the medium of sth They advertise through the medium of direct mail.\n[ C, usually singular ]\n&#160; COMMERCE a size of clothes that is between small and large: Could I try on a medium, please?\nSee also\ndisplay medium\nused to describe something that is between small and large in size: Production of existing small and medium cars will continue at the plant."}