{"id":222593,"name":"meet","type":"verb","us_sound":"miːt","us_link":"../audio/m/meat.mp3","uk_sound":"miːt","uk_link":"../audio/m/ukmeant012.mp3","content":"meet verb\n(FOR THE FIRST TIME)\nAdd to word list\nAdd to word list\nA1 [ T or I ] to see and talk to someone for the first time: They met at work. I met her in Hawaii. Would you like to meet my sister? Come and meet (= be introduced to) my friend Laura.\nMore examplesFewer examplesI'd like you to meet Ann Gregory, my deputy.I'm dreading having to meet his parents.It's important to create a good impression when you meet a new client.It's not always easy to meet members of the opposite sex.We went backstage after the show to meet the actors.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nspeak\nstrike\nSee more results »\nmeet verb\n(COME TOGETHER)\nA1 [ I or T ] to come together with someone intentionally: Lorraine and I meet for lunch once a month. We agreed to meet on Tuesday to discuss the project. The children's club meets every Thursday afternoon. They're meeting with their advisers to draw up a new plan. The president met the UK prime minister in London yesterday.\nA1 [ T or I ] to come together with someone without intending to: It's always awkward when you meet someone you know but you can't remember their name. Guess who I met in town today. We met our old neighbours at an auction last Saturday.\nMore examplesFewer examplesI'll meet you at the check-in desk.She's gone to meet Blake at the station.I'm meeting a group of friends for dinner tonight.The lovers met at a secret rendezvous in the park.We met on several occasions to discuss the issue.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nmeet verb\n(SATISFY)\nC1 [ T ] to fulfil, satisfy, or achieve: The workers' demands for higher pay were not met by the management. We haven't yet been able to find a house that meets our needs/requirements. They will only agree to sign the contract if certain conditions are met. Do you think we will be able to meet our deadline/target?\n[ T ] to pay: The company has agreed to meet all our expenses.\nMore examplesFewer examplesThis type of computer is too slow and inflexible to meet many business needs.Can the sales force meet its financial objectives?They threatened to blow up the plane if their demands were not met.They agreed to raise the trade embargo if three conditions were met.His latest book met all my expectations.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nmeet verb\n(PLACE)\nB1 [ T ] to wait at a place for someone or something to arrive: Will you meet me at the airport (= be there when the aircraft arrives)?\nMore examplesFewer examplesA representative from the tour company will meet you at the check-in.You go on ahead of me, and I'll meet you there.It's very kind of you to come all the way to meet me.I'll meet you by the down escalator on the second floor.She's gone to meet Brian at the station.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nmeet verb\n(TOUCH)\n[ I or T ] to touch or join something: There's a large crack where the ceiling meets the wall. The curtains don't quite meet. The horizon is the line where the sky meets the earth.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nmeet verb\n(EXPERIENCE)\n[ T ] to experience something: I've never met that kind of problem/system before. He met his death (= he died) in the icy waters of the South Atlantic.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nIdioms\nbe more to this than meets the eye\neyes meet\nmeet someone's eye\nmeet someone halfway\nmeet your maker\nmeet your match\nmeet your WaterlooPhrasal verbs\nmeet up\nmeet with something\nmainly US a sports event in which people compete against each other, for example in swimming or running: The 800m runner was unbeaten for two years, but she lost at a meet in July. a track/swim meet the first meet of the season\n(also car meet) an occasion when people who are very interested in cars meet to look at each other's cars and talk about them: A young man was injured when a vehicle hit spectators at a car meet. According to the etiquette of car meets, you must never touch someone else's car without permission. According to the car enthusiasts' social media page, the meet was their final one of the year.\nUK an occasion when people go fox hunting: He attended a meet of Bicester Fox Hunt, in Oxfordshire. On average, I would guess, one fox is killed at each meet.\nMore examplesFewer examplesThe athlete tested positive for a banned steroid at a meet in Paris.She is preparing to vault in an International Gymnastics Federation meet.You can learn so much about cars and the car community by going to a meet.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous games & activities\nHunting & fishing\nmeet verb\n(COME TOGETHER)\nAdd to word list\nAdd to word list\n[ I/T ] to come together with another person: [ I ] We agreed to meet on Tuesday at six. [ I ] They’re meeting with their advisers to work out a new plan. [ T ] The doctor unexpectedly met one of her patients in the supermarket. [ T ] Will we meet Joyce’s plane (= be at the airport when she arrives)? [ I ] The teams met twice this season (= competed against each other twice).\nmeet verb\n(BECOME FAMILIAR WITH)\n[ I/T ] to become familiar with someone for the first time: [ I ] They met at work. [ T ] I’d like you to meet my friend Laura.\nmeet verb\n(JOIN)\n[ I/T ] (esp. of objects) to join or touch: [ I ] The curtains don’t meet in the middle of the window.\nmeet verb\n(FULFILL)\n[ T ] to fulfill, satisfy, or achieve: We haven’t found office space that meets our needs. Do you think she’ll be able to meet the deadline? Idiom\nmeet someone halfwayPhrasal verbs\nmeet up (with someone)\nmeet with something\nmeet with something\nmeet noun [C]\n(SPORTS EVENT)\na sports event at which several teams or people compete: a track meet a swimming meet\nAdd to word list\nAdd to word list\n[ I or T ] to arrange to see a person or group of people in order to speak with them about something: Team members arranged to meet at designated locations in their respective cities. Committees meet regularly with planning groups. Italy's lawmakers are meeting today to discuss the proposed new legislation.meet sb Senior government officials attended a gathering in Dubai in September to meet international oil executives.meet at sth Delegates will meet at the Imperial Hotel next Wednesday at 10.30.meet in Washington/Dubai/Shanghai, etc. European Union leaders are meeting in Nice to decide on various reforms.meet with sb Trust directors have already met with staff to review records and discuss future performance targets.\n[ T ] to achieve the result or level that had been expected: We are on track to meet earnings forecasts. Due to strong growth in the homes division, the company met its home completion target of 8,000 for the year.meet a target/expectation/goal Profits this year will not meet expectations because of a slowdown in the worldwide economic recovery.\n[ T ] to satisfy a demand or need: The mortgages they offer meet customer needs for flexibility.meet a demand/need for sth To meet the demand for its services, the university is building a new campus.meet the needs of sb/sth Many new jobs are service jobs to meet the daily needs of all the people moving to the region.\n[ T ] to do something that you must do because of a law or rule: meet a condition/requirement/obligation The Government has threatened to seize the assets of companies that do not meet their obligations to pensioners.be met by sb/sth Certain criteria must be met by applicants before they can enrol on the program.\n[ T ] to have enough money to pay for something, or to pay amounts you owe: meet costs/payments/expenses Meeting mortgage payments is becoming increasingly difficult for more and more people. be met by sb/sth\n[ T ] to have the money or resources you need in order to do something, especially something that you have not done before: meet a challenge/opportunity We need a different set of strategies to help us meet the challenges of the new marketplace.\nmeet a deadline\nto finish work at the time or by a date that has been previously agreed: Employees are under constant pressure to meet deadlines.\nmeet (sb) halfway\nto reach an agreement with another person or group by offering them some of the things they want: The bank offered to meet them halfway by splitting the difference. He wants us to work to meet the stakeholders halfway to try to accommodate everyone's wishes. Phrasal verbs\nmeet up\nmeet with sth"}