{"id":222602,"name":"meeting","type":"noun","us_sound":"ˈmiː.t̬ɪŋ","us_link":"../audio/m/eus72961.mp3","uk_sound":"ˈmiː.tɪŋ","uk_link":"../audio/m/ukmeek_004.mp3","content":"Add to word list\nAdd to word list\nA2 a planned occasion when people come together, either in person or online (= using the internet), to discuss something: We're having a meeting on Thursday to discuss the problem. I'm sorry but she's in a meeting - I'll ask her to call you back later. Companies are making more use of websites and videoconferencing where staff may log on for regular meetings. Compare\nawayday mainly UK\nconference (MEETING)\ncongress (MEETING)\nconsultation\nconvention (MEETING)\nconvocation formal\nforum (MEETING)\nseminar\nsummit (MEETING)\nsymposium formal\nan occasion when people meet each other, especially when this was not planned: A chance meeting with a publisher on an airplane had launched his career. I liked him from our first meeting.\na group of people who have met for a particular purpose: The meeting wants to look at the proposal again.\nUK a sports competition\nMore examplesFewer examplesI'd like to fix a date for our next meeting.We are getting some facts and figures together and we will then have a full board meeting.The meeting should finish around four o'clock.The hotel is an ideal venue for conferences and business meetings.After a six-hour flight and a long day of meetings, it's not surprising you're exhausted.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmake yourself known idiom\nmass\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nIdiom\na meeting of minds\nAdd to word list\nAdd to word list\nan occasion when people come together: We scheduled the meeting for Friday.\nAdd to word list\nAdd to word list\nan occasion when a group of people meet in order to discuss something: In a statement issued after the meeting, the board announced their decision to go ahead with the merger .have/hold a meeting The FSA will hold a meeting to discuss possible compensation payouts on Monday.at/in/during a meeting A framework agreement will be signed next week during a meeting of EU foreign ministers.last/next meeting There was speculation that the Fed may cut its lending rate from 5.25% before its next meeting. a meeting with sb The bank announced the expanded cost cuts in a meeting with analysts after the close of trading.a meeting between sb/sth and sb/sth No meeting has yet taken place between senior management and union representatives.be in/go to/attend a meeting Over 200 people attended the meeting at the company's headquarters in San Diego.schedule/arrange/cancel a meeting We will be holding a meeting next week with industry analysts.chair a meeting He chaired a meeting of senior Ministers last Thursday to discuss five-year plans for reforms.a meeting of leaders/delegates/shareholders Two new directors were elected to the board at the annual meeting of shareholders. a board/committee/shareholder meeting monthly/weekly meetings an informal/formal/official meeting a high-level/top-level meeting an upcoming/scheduled meeting See also\nannual general meeting\nannual meeting\nannual stockholders' meeting\ncompany meeting\ncreditors' meeting\ngeneral meeting\nextraordinary general meeting\nstatutory meeting\nstop-work meeting"}