{"id":222711,"name":"megalomaniac","type":"noun","us_sound":"ˌmeɡ.əl.əˈmeɪ.ni.æk","us_link":"../audio/m/eus72962.mp3","uk_sound":"ˌmeɡ.əl.əˈmeɪ.ni.æk","uk_link":"../audio/m/ukmeek_011.mp3","content":"Add to word list\nAdd to word list\nsomeone who has an unnaturally strong wish for power and control, or thinks that they are much more important and powerful than they really are: He has been accused of being a megalomaniac.\nMore examplesFewer examplesFor God's sake, don't let this megalomaniac become president.Some people actually called me a megalomaniac because of my ambitious ideas. The department is run by rabid militarist, right-wing megalomaniacs.It's also good for megalomaniacs who want to make the world all theirs. The head teacher is a pill-popping megalomaniac, but also strangely inspiring.\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nhysterical\nobsessive-compulsive disorder\npsychosis\nscarred\nself-alienation\nsenility\nsociopathic\nsomatization\nSee more results »\nhaving an unnaturally strong wish for power and control, or showing that you think you are much more important and powerful than you really are: megalomaniac dictators His latest megalomaniac ambition is to build the world's highest apartment block. See\nmegalomania\nMore examplesFewer examplesHe was notorious for his megalomaniac fits - throwing things, screaming obscenities, and humiliating these teenage kids in his theater company.Similar megalomaniac schemes were proposed in the 1960s, but were never carried through. propped up politicians who are venal, ineffective and more than a little megalomaniacalBeyond these few big decisions, the government's craving for ever wider powers over land-use planning is megalomaniac.\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nhysterical\nobsessive-compulsive disorder\npsychosis\nscarred\nself-alienation\nsenility\nsociopathic\nsomatization\nSee more results »"}