{"id":223381,"name":"meltdown","type":"noun","us_sound":"ˈmelt.daʊn","us_link":"../audio/m/meltdown.mp3","uk_sound":"ˈmelt.daʊn","uk_link":"../audio/m/ukmelod006.mp3","content":"meltdown noun [C or U]\n(NUCLEAR)\nAdd to word list\nAdd to word list\nan extremely dangerous situation in a nuclear power station in which the nuclear fuel becomes very hot and melts through its container and escapes into the environment\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccident\naccidental\naccidentally\naccidentally on purpose idiom\nan accident waiting to happen idiom\ncalamitously\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ndisaster\ndisaster area\ndisastrous\ndisastrously\ndumpster fire\nmisadventure\nmishap\nnatural disaster\nnon-emergency\nperfect storm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: energy, force & power\nmeltdown noun [C or U]\n(FAILURE)\na complete failure, especially in financial matters: financial/economic/market meltdown The last few months have seen the progressive meltdown of the country's political system.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not being successfulfailureFailure is not an option.breakdownThe complete breakdown of local infrastructure left residents without water or electricity.meltdownThe markets experienced a meltdown at the news of the sale. collapseThe car manufacturer's collapse left the region's economy in tatters. failHe tried to sing the anthem, but it was an epic fail.\nSee more results »\ninformal an occasion when a person becomes extremely upset and is not able to deal with a problem or situation\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nlost cause\nmess\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCoping and not coping\nAdd to word list\nAdd to word list\na dangerous accident in which the fuel melts in a nuclear reactor (= device that produces energy)\nAdd to word list\nAdd to word list\nECONOMICS, FINANCE a situation in which an industry, economy, etc. is badly affected by a lot of problems within a short period of time: Analysts were watching for signs of a meltdown following problems at three of Wall Street's major investment banks. A deadly new computer virus caused much of the internet to go into meltdown last weekend.a meltdown in sth A meltdown in the mortgage industry has made it more difficult to get a loan or to refinance.a meltdown of sth The two officials are expected to help develop a plan to prevent a meltdown of the county's finances.be in meltdown Since the credit crisis, the whole banking industry has been in meltdown. financial/economic/political meltdown a stock market/subprime/credit meltdown a global/industry/corporate meltdown"}