{"id":223402,"name":"member","type":"noun","us_sound":"ˈmem.bɚ","us_link":"../audio/m/member.mp3","uk_sound":"ˈmem.bər","uk_link":"../audio/m/ukmelod009.mp3","content":"member noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nA2 a person, animal, or thing that is part of a group: a family member a member of the older generation male and female members of the group The lion is a member of the cat family. Representatives of the member states will be meeting next week.\nA2 a person who joins a group to take part in a particular activity: a new club member The parking area is for members only. Michael is a member of the Royal Society for the Protection of Birds.\nMore examplesFewer examplesHe was the first member of his regiment to die while on active service.I've just become a member of the company's sports and social club.The members of the jury left the court with a police escort.The committee is composed of MPs, doctors, academics and members of the public.The coach insists that all team members must attend early-morning practice.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nadvocate\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnon-member\nnon-membership\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nSee more results »\nmember noun [C]\n(BODY PART)\nformal a leg or arm\nformal a penis: the male member\nSMART Vocabulary: related words and phrases\nThe legs & feet of non-human animals\nbipedal\nclawed\ncloven\nfoot\nforefoot\nhooves\nleg\nlimb\npad\npaw\nsemipalmated\nshank\ntalon\ntoe\ntrotter\nweb\nweb-footed\nwebbed\nwebby\nzygodactyl\nSee more results »\nmember noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\na person or thing that is part of a group: She’s a member of our team. The lion is a member of the cat family.\nmember noun [C]\n(BODY PART)\na part or organ of a body, such as an arm, leg, or lung\nAdd to word list\nAdd to word list\na person, company, or country that belongs to a group or organization: a member of sth She is a member of the Bank of England's Monetary Policy Committee.former/existing/new members Auditors said they had discovered \"possible illegal acts\" by former members of management. a staff/team member a board/committee/council member EU/NATO/WTO members\nFINANCE, STOCK MARKET a shareholder of a company or other organization: The company will send a brief letter to all members within the next fortnight explaining what has happened and notifying them of the vote date. See also\ncharter member\nfounder member"}