{"id":223406,"name":"membership","type":"noun","us_sound":"ˈmem.bɚ.ʃɪp","us_link":"../audio/m/membership.mp3","uk_sound":"ˈmem.bə.ʃɪp","uk_link":"../audio/m/ukmelod010.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the state of belonging to an organization: You have to apply for membership of the sports club. a membership fee/card Annual membership (= the amount you have to pay to join a particular organization for one year) is £25.\nC1 [ C, + sing/pl verb ] all the people who belong to an organization: Our membership is/are divided on the issue. The society has a very large membership (= number of members).\nMore examplesFewer examplesWe're going to give up our sports club membership after this year.They refused to admit her, not least because she hadn't got her membership card with her.They argue that the membership of the Council does not reflect the racial make-up of the city.Every year I renew my membership of the sports club.The membership fees at the golf club are pretty steep.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSupporters, members & defenders\nAdd to word list\nAdd to word list\nthe state of belonging to an organization, or an agreement by which someone joins an organization: [ U ] We applied for membership in the country club. [ C ] Some fitness clubs sell lifetime memberships.\nThe membership is all the members of an organization: [ U ] We asked the membership to vote on the issue.\nAdd to word list\nAdd to word list\n[ C or U ] the state of belonging to a group or organization: membership in sth He holds membership in a number of regional and national organizations.membership of sth She has promised to use her influence and membership of a high-level advisory group to lobby for change.apply/qualify for membership Employees need to have worked here for more than two years in order to qualify for membership of the scheme.the cost/benefit of membership One of the benefits of membership is access to free legal advice. board/union membership EU/WTO/NATO membership full/free membership\n[ C or U ] the number of people who belong to a group or organization: The EU's membership has almost doubled since 2004.have a membership of sth We currently have a membership of more than 11,000 professionals, professors, and students.declining/falling membership Pooling resources will help us cope more easily with declining membership and revenues. membership numbers/a membership basemembership declines/falls/goes down Membership in investment clubs has declined just like the stock market.membership increases/rises/climbs Party membership has risen, by 3,000, for the first time in 20 years.a decline/increase in membership We get a significant increase in membership each year, mostly because people read about us on the Internet.expand/boost/restrict membership The appointment was made in the hope of strengthening finances and boosting membership.\n[ S ] members of a group or organization considered as a group: The firm has failed to recognize and appreciate what our membership has contributed during the past four years. Since the online group was formed just over a year ago, the membership has pretty much doubled every month."}