{"id":223470,"name":"memorandum","type":"noun","us_sound":"ˌmem.əˈræn.dəm","us_link":"../audio/m/memorandum.mp3","uk_sound":"ˌmem.əˈræn.dəm","uk_link":"../audio/m/ukmelod022.mp3","content":"memorandum noun [C]\n(DOCUMENT)\nAdd to word list\nAdd to word list\nbusiness a short written report prepared specially for a person or group of people that contains information about a particular matter: Michael Davis has prepared a memorandum outlining our need for an additional warehouse.\nlaw an informal legal agreement: The three countries have signed a memorandum pledging to work together.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nmemorandum noun [C]\n(MESSAGE)\nformal a\nmemo\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nAdd to word list\nAdd to word list\na written report prepared especially for a person or group of people and containing information about a particular matter: Ann will send a memorandum to the staff outlining the new procedures.\nAdd to word list\nAdd to word list\nan official report about a particular subject that is written for a company, organization, or government to consider: An earlier memorandum, agreed with the Treasury, stated that overspends should be split between London council taxpayers and Lottery funds. In a memorandum prepared for the White House and submitted to Congress, the Solicitor General contends that Congress can only obtain White House information if it can demonstrate that the information is critical to the fulfillment of its duties. Environmental campaigners believe that state officials should release copies of the draft memorandums before the documents are signed.issue/send/draft a memorandum The head of the federal Forest Service has sent a memorandum regarding the new legislation to managers.a memorandum from sb A memorandum from the Economic Policy Institute said business owners have received regular tax cuts while minimum wage workers have been kept waiting at the back of the line.\nLAW a document that records the details of a legal agreement before it has been officially accepted: a legal/sentencing memorandumsign/file a memorandum Companies signed a memorandum which included guidelines and set out the terms of the agreement.\nformal →\nmemo noun\na leaked memorandum\na document that has been made available to the public without the permission of the organization or company who wrote it: Executives were angry that their plans had been made public through the leaked memorandum."}