{"id":223478,"name":"memorial","type":"noun","us_sound":"məˈmɔːr.i.əl","us_link":"../audio/m/memorial.mp3","uk_sound":"məˈmɔː.ri.əl","uk_link":"../audio/m/ukmelod024.mp3","content":"Add to word list\nAdd to word list\nC2 an object, often large and made of stone, that has been built to honour a famous person or event: a war memorial The statue was erected as a memorial to those who died in the war.\nAshley Cooper/Corbis Documentary/GettyImages\n(also memorial service) a ceremony to remember someone who has died, which usually takes place after they have been buried or cremated (= burned): His family is planning a public memorial, to be held in September. He did not attend a memorial commemorating the 100th anniversary of the armistice that ended World War I.\nMore examplesFewer examplesThe war memorial was erected in 1950.The war memorial was dedicated to both Jews and Gentiles.The chapel was raised as a memorial to her son.He laid the wreath reverently in front of the memorial.The memorial to those who had died in the war was unveiled in 1948 by the Queen.Thousands of people attended a memorial to victims of Monday's shooting.He will give the blessing at a memorial honouring the 100th anniversary of the war's end.\nSMART Vocabulary: related words and phrases\nGravestones and monuments\nbluestone\ncairn\ncenotaph\ncolossus\nepitaph\ngravestone\nheadstone\nmemorialize\nmonolith\nmonument\nobelisk\nrest\nrest in peace idiom\nrip\nStonehenge\nthe Eiffel Tower\nthe Statue of Liberty\ntombstone\nwar memorial\nYou can also find related words, phrases, and synonyms in the topics:\nCeremonies\ndone to remember a person or people who have died: Hundreds of people came to Professor Conner's memorial service. The memorial garden is dedicated to those who died in the accident.\nSMART Vocabulary: related words and phrases\nRemembering people who have died\nbereaved\nbereavement\nepitaph\ngrief\ngrieve\ngrieving\nin memory of someone idiom\nlamented\nmemento mori\nmemorial card\nMemorial Day\nmemory\nmourning\nremembrance\nRemembrance Day\nrest\nrest in peace idiom\nrip\nshrine\nwake\nSee more results »\nAdd to word list\nAdd to word list\nan object made in order to honor a person or event: The statue is a memorial to those who died in the war.\nA memorial service is an event held to remember a person who has died."}