{"id":223549,"name":"mend","type":"verb","us_sound":"mend","us_link":"../audio/m/mend.mp3","uk_sound":"mend","uk_link":"../audio/m/ukmenac004.mp3","content":"Add to word list\nAdd to word list\nB1 to repair something that is broken or damaged: Could you mend this hole in my shirt?UK I've left my watch at the jeweller's to be mended.UK The plumber came to mend the burst pipe. The country's president is seeking to mend relations with the United States.\nThesaurus: synonyms, antonyms, and examples\nto repair somethingrepairHe asked if she could repair the broken lamp.fixI must get my bike fixed.mendCan you mend that hole in my trousers?do upNick loves doing up old cars.serviceI'm taking the car to the garage to have it serviced this afternoon.patch upI patched up the old bike and got it working.\nSee more results »\nMore examplesFewer examplesA man's coming to mend the boiler this afternoon.I thought I could mend the radio myself, but I've had to admit defeat.Never try to mend a broken machine without disconnecting it from the electricity supply.He wants me to mend his shirt for him, but I'm not going to!He can mend anything - he's so good with his hands.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nreconstruct\nreconstruction\nrectifiable\nrectification\nrefine\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nIdioms\nmend your fences\nmend your ways\nUK a place in a piece of clothing where a repair has been made\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nreconstruct\nreconstruction\nrectifiable\nrectification\nrefine\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnitting & sewing\nIdiom\nbe on the mend\nmend verb\n(REPAIR)\nAdd to word list\nAdd to word list\n[ T ] to repair cloth that is torn or something that is damaged: Could you mend this hole in my shirt? The country is seeking to mend relations with the US.\nmend verb\n(BECOME WELL)\n[ I/T ] to become well again after an illness or injury: [ I ] The bones in my broken wrist took eight weeks to mend. mend noun us\nYour browser doesn't support HTML5 audio\n/mend/Idioms\nmend your ways\non the mend\nAdd to word list\nAdd to word list\nUK to repair something that is broken or not working: They're sending someone round to mend the photocopier.\nto find a solution to a problem: The new government pledged to mend the country's broken society.\nmend fences/bridges/relations\nto try to improve a relationship with someone you have had a disagreement with: The industry is trying to mend fences with government, environmental groups, and the public.\nmend your ways\nto begin to improve your behaviour after you have been behaving badly: The outcry over third-world child exploitation has shamed some employers into mending their ways.\nbe on the mend informal\nto be improving after a period of difficulty or failure: The economy finally seems to be on the mend."}