{"id":223854,"name":"menu","type":"noun","us_sound":"ˈmen.juː","us_link":"../audio/m/menu.mp3","uk_sound":"ˈmen.juː","uk_link":"../audio/m/ukmenac025.mp3","content":"menu noun [C]\n(FOOD)\nAdd to word list\nAdd to word list\nA2 a list of the food that you can eat in a restaurant: The waiter brought the menu and the wine list. What's on the menu today?\nDenPotisev/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThere wasn't much choice on the menu.The evening menu offers a wide choice of dishes.The waiter handed me the menu with a flourish.The menu is invariable but the food is always good.The restaurant has a long menu of about 50 items.\nSMART Vocabulary: related words and phrases\nRestaurants & cafes\nall-you-can-eat\nautomat\nbill of fare\nbistro\nblue plate\ncoffee shop\ncreperie\ndiner\ndrive-through\ndu jour\npizzeria\nplat du jour\nprix fixe\nraw bar\nrefectory\ntaqueria\ntasting menu\ntea room\nteahouse\ntransport café\nSee more results »\nmenu noun [C]\n(COMPUTING)\nA2 a list of choices that can be made to appear on a computer screen: Select the \"Edit\" menu and then choose \"Copy\".\nLawrence Manning/Corbis/GettyImages\nMore examplesFewer examplesThe menu bar with its windows is one of the features of the desktop.Escape from this window and return to the main menu.Press Esc to return to the main menu.Click on \"Tools\" and then select \"Options\" from the pull-down menu.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nAdd to word list\nAdd to word list\na list of the dishes served at a meal, esp. in a restaurant: There are several vegetarian dishes on the menu.\nA menu is also a list of items shown on a computer screen from which the user can choose an operation for the computer to perform.\nAdd to word list\nAdd to word list\nIT a list of possible available actions that appears on a computer screen and allows you to choose the instruction you want: Select the Edit menu and then click on Copy. See also\ndrop-down menu\nhelp menu"}