{"id":223957,"name":"merchant","type":"noun","us_sound":"ˈmɝː.tʃənt","us_link":"../audio/m/merchant.mp3","uk_sound":"ˈmɜː.tʃənt","uk_link":"../audio/m/ukmerce005.mp3","content":"Add to word list\nAdd to word list\na person whose job is to buy and sell products in large amounts, especially by trading with other countries: a wine/grain merchant\nThesaurus: synonyms, antonyms, and examples\na person who sells thingssellerWe'll need to talk to the seller and see if they'll accept your bid on the house.salespersonThe shop was so busy that it took me ages to get the salesperson's attention.salesmanHe was a used-car salesman.saleswomanShe was the company's top saleswoman.sales assistantUK Can you wave over a sales assistant? I have a question about this bracelet.\nSee more results »\nUK informal disapproving someone who is involved in or enjoys something that is unpleasant or annoying to others: a gossip merchant (= someone who enjoys talking about people's private lives) a speed merchant (= someone who drives too fast)\nSMART Vocabulary: related words and phrases\nTraders & entrepreneurs\nartist\nasset manager\nasset-stripper\nbaron\nbusiness person\nconcessionaire\ndaigou\nentrepreneur\nentrepreneurial\nentrepreneurialism\nmagnate\nmompreneur\nmulti-sided\nmumpreneur\npromoter\nreal estate developer\nshipper\ntrader\ntycoon\nwholesaler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who sell things\nIdiom\nmerchant of doom/gloom\nAdd to word list\nAdd to word list\na person whose business is buying and selling goods for profit\nAdd to word list\nAdd to word list\na person or business that buys and sells products in large amounts for profit, often trading with other countries: grain/cotton/wine merchants\na business that sells directly to the public either from a store or through the internet: Experienced merchants said that the fee structure for accepting cards is confusing. Local merchants experienced a revenue boost in the lead up to Thanksgiving. Most online merchants will email you an order confirmation with details of your purchase. See also\nfutures commission merchant\nmass merchant\nretail merchant\nretailer\nCOMMERCE used to describe people or businesses connected with buying or selling goods: merchant customers/families/fees\nTRANSPORT connected with the ships that carry goods by sea: merchant fleet/seaman"}