{"id":223947,"name":"merchandise","type":"noun","us_sound":"ˈmɝː.tʃən.daɪz","us_link":"../audio/m/eus72968.mp3","uk_sound":"ˈmɜː.tʃən.daɪz","uk_link":"../audio/m/ukmerce002.mp3","content":"Add to word list\nAdd to word list\ngoods that are bought and sold: Shoppers complained about poor quality merchandise and high prices. Japan exported $117 billion in merchandise to the US in 1999. Synonym\nproduct\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmarque\nmover\nmulti-product\nnon-proprietary\nnotion\noutput\noverstock\nspecialize\nSee more results »\nto encourage the sale of goods by advertising them or by making certain that they are noticed: She had to merchandise the new product line.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nAdd to word list\nAdd to word list\ngoods that are bought and sold: This store has a wide selection of merchandise for sale.\nAdd to word list\nAdd to word list\nCOMMERCE goods that are offered for sale, especially in a store: While the shop may look exclusive, the merchandise is not.discounted/general/luxury merchandise Analysts are expecting the retailer to report a 5% rise in sales of general merchandise.\nMARKETING →\nmerchandising : Shaw won the highly lucrative rights to sell Elvis merchandise in the UK and Europe in 1999.\nto increase sales of goods by making people more aware of them through advertising, special displays or events, etc.: The way in which you merchandise what you have in store in terms of display is pretty important.\nto produce and sell products connected with a popular film, event, famous person, etc.: The company's move to license and merchandise its popular TV characters has great potential for growth."}