{"id":223977,"name":"mercy","type":"noun","us_sound":"ˈmɝː.si","us_link":"../audio/m/mercy.mp3","uk_sound":"ˈmɜː.si","uk_link":"../audio/m/ukmerce012.mp3","content":"mercy noun\n(KINDNESS)\nAdd to word list\nAdd to word list\nC2 [ U ] kindness that makes you forgive someone, usually someone that you have authority over: She appealed to the judge to have mercy on her husband. The prisoners pleaded for mercy. The gunmen showed no mercy, killing innocent men and women. be at the mercy of someone/something\nC2 to be in a situation where someone or something has complete power over you: Poor people are increasingly at the mercy of predatory lenders.\nSee more\nMore examplesFewer examplesHe begged for mercy as the blows fell on him .Fishermen are always at the mercy of the forces of nature .They begged for mercy.He bowed down before the king and begged for mercy.\nSMART Vocabulary: related words and phrases\nLenient & merciful\ncharitable\ncharitably\ncharity\nclemency\nease\nease up/off\neasy\ngo easy idiom\nhave a heart! idiom\nheart\nleniency\nlenient\nmagnanimous\nmagnanimously\nmerciful\nquarter\nsquishy\nmercy noun\n(EVENT/SITUATION)\n[ S ] an event or situation that you are grateful for because it stops something unpleasant: After months of suffering, his death was a mercy. They were on a mercy mission to take food to the refugees when they were attacked.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmiracle\nmisadventure\nmischance\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure\nmercy noun [U]\n(KINDNESS)\nAdd to word list\nAdd to word list\nkindness shown toward someone whom you have the right or power to punish: He begged for mercy. The soldiers showed no mercy toward their prisoners.\nmercy noun [U]\n(LUCK)\nsomething that is considered lucky because it is not as bad as it had been or could have been: It’s a mercy that no one was hurt in the fire."}