{"id":224066,"name":"merger","type":"noun","us_sound":"ˈmɝː.dʒɚ","us_link":"../audio/m/merger.mp3","uk_sound":"ˈmɜː.dʒər","uk_link":"../audio/m/ukmerce017.mp3","content":"Add to word list\nAdd to word list\nC2 an occasion when two or more companies or organizations join together to make one larger company: She's an attorney who advises companies about mergers and takeovers. The merger of these two companies would create the world's biggest accounting firm. Synonym\namalgamation\nMore examplesFewer examplesThe merger proved to be very lucrative for both companies.The shareholders seem to think that the executive board is overstating the case for a merger.Announcement of the merger is expected to ramp up share prices over the next few days.Following the merger, he was retired with a generous pension.Shareholders will be voting on the proposed merger of the companies next week.\nSMART Vocabulary: related words and phrases\nMergers & acquisitions\nacqui-hire\nacquirable\nacquire\nacquisition\nacquisitive\nbuy someone out\nbuyout\nconglomerate\ncounterattack\ndenationalization\ndenationalize\nfire sale\nhive\nhostile\nleveraged buyout\nmonopoly\nnon-hostile\noligopoly\nparent\nparent company\nSee more results »\nAdd to word list\nAdd to word list\nthe combining of two or more companies or organizations into one\nAdd to word list\nAdd to word list\na situation when two or more companies, organizations, departments, etc. join together: The boards finally approved the merger between the two energy groups.merger of two companies, etc. The proposed merger of the two fund managers will create a new group with £200 billion of assets under management. The CEO thought a friendly merger would revitalize the company.plan/propose/seek a merger There was speculation that Glaxo was planning a merger with New York-based Pfizer.agree/approve a merger Shareholders voted to approve the merger last week.block/oppose a merger The finance minister blocked the merger in June.merger agreement/deal/plan The bank said it would press ahead with the merger plan. merger negotiations/talks The group's share price fell sharply following the collapse of merger talks. a failed/successful/unsuccessful merger See also\nconglomerate merger\ncross-border\ndefensive adjective\ndemerger\nfriendly\nhorizontal merger\nreverse merger\nstock merger\nvertical merger\ntakeover"}