{"id":224123,"name":"merit","type":"noun","us_sound":"ˈmer.ɪt","us_link":"../audio/m/merit.mp3","uk_sound":"ˈmer.ɪt","uk_link":"../audio/m/ukmerce021.mp3","content":"Add to word list\nAdd to word list\nC1 formal the quality of being good and deserving praise: an entertaining film with little artistic merit Her ideas have merit. Brierley's book has the merit of being both informative and readable. the merits of something\nthe advantages something has compared to something else: We discussed the merits of herbal tea.\nSee more on your (own) merits\naccording to the qualities you have or have shown, without considering any other information or comparing you to someone else: The committee will consider each applicant on his or her own merits.\nSee more\nSMART Vocabulary: related words and phrases\nDeserving and deserved\nbirthright\ncome\ncomeuppance\ndeserts\ndeserve\ndeserved\ndeserving\nget your just deserts idiom\nhad it coming (to you) idiom\nhard-earned\nhe/she deserves whatever/everything he/she gets idiom\njust\nserve\nundeserved\nundeservedly\nundeserving\nundeservingly\nunmerited\nwell earned\nworthy\nSee more results »\nC2 If something merits a particular treatment, it deserves or is considered important enough to be treated in that way: This plan merits careful attention. The accident merited only a small paragraph in the local paper.\nSMART Vocabulary: related words and phrases\nDeserving and deserved\nbirthright\ncome\ncomeuppance\ndeserts\ndeserve\ndeserved\ndeserving\nget your just deserts idiom\nhad it coming (to you) idiom\nhard-earned\nhe/she deserves whatever/everything he/she gets idiom\njust\nserve\nundeserved\nundeservedly\nundeserving\nundeservingly\nunmerited\nwell earned\nworthy\nSee more results »\nAdd to word list\nAdd to word list\nthe quality of being good and deserving praise, or a good quality: [ U ] Judged on artistic merit, it was a success. [ C ] Being able to work at home has its merits. Idiom\non its (own) merits\nto deserve something: These recommendations merit careful attention.\nAdd to word list\nAdd to word list\nformal the quality of being good and deserving to be praised or rewarded, or an advantage that something has: Proposals will be judged strictly on merit by an external committee. I fail to see the merit of organizing the work in that way.\nmerit award/bonus/raise, etc.\nHR, WORKPLACE extra pay given to employees who have done their job well and made noticeable improvements in the company, department, etc.: The average merit pay increase over the past five years has been in the range of 3 to 4%.\nLAW if a court decides that a complaint, case, etc. has merit, it accepts that it is true or there is evidence for it: The lawsuit was found to be completely without merit.\nto deserve to be treated or considered in a particular way: merit attention/discussion/investigation If complaints merit investigation, they should go the complaints committee."}