{"id":224740,"name":"mesozoic","type":"adjective","us_sound":"ˌmez.oʊˈzoʊ.ɪk","us_link":"../audio/m/cdo1121usmeso2768.mp3","uk_sound":"ˌmes.əˈzəʊ.ɪk","uk_link":"../audio/m/cdo1121ukmeso2437.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 250 to 65 million years ago: The Cretaceous was the last of the Mesozoic periods and had the most dramatic and varied life forms. In 1967 he described a fossil ant of the Mesozoic Age.\nMore examplesFewer examplesSome scientists are calling it a Mesozoic cow.It seems that the herds instinctively followed food sources as the seasons changed in Mesozoic America.During Mesozoic time these sediments constituted a sedimentary covering of the southern continental margin of the Iberian plate.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Mesozoic\ngeology\n&#160; specialized the period of time between about 250 to 65 million years ago: There were three periods in the Mesozoic - the Triassic, Jurassic, and Cretaceous periods. The fossil evidence seems to support the theory that mammals began to exceed reptiles during the Mesozoic.\nMore examplesFewer examplesThe Triassic was the first of the three geologic periods that made up the Mesozoic.Even the danger from predators was not constant until the very end of the Mesozoic.What pterosaurs were to the skies and dinosaurs to land in the Mesozoic, plesiosaurs were to the oceans.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}