{"id":224753,"name":"message","type":"noun","us_sound":"ˈmes.ɪdʒ","us_link":"../audio/m/message.mp3","uk_sound":"ˈmes.ɪdʒ","uk_link":"../audio/m/ukmesh_006.mp3","content":"message noun [C]\n(INFORMATION)\nAdd to word list\nAdd to word list\nA1 a short piece of information that you give to a person when you cannot speak to them directly: If I'm not there when you call, leave a message. [ + that ] I got a message that she'll be late. Synonyms\ncommunication formal\ndispatch\nepistle formal\nmissive\nbiology\n&#160; specialized a signal sent through the body by nerves and received by the brain: Motor nerves carry messages from the brain to contract different muscles used in movement. The medicine makes the nerves unable to send pain messages to your brain.\nMore examplesFewer examplesShe wasn't in so I left a message on her answerphone.Can you give Jo a message for me? Tell her I've booked a tennis court for 6.30.When I got home, I found a mysterious message sellotaped to the front door.The president has sent a message of sympathy to the relatives of the dead soldiers.The message on the card said 'Be my Valentine'.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe brain & nervous system\nmessage noun [C]\n(IDEA)\nB2 the most important idea in a book, film, or play, or an idea that you want to tell people about: The movie's message is that rich and poor are alike. We need to send a clear message that pollution will not be tolerated. get the message informal\nto understand what someone is trying to tell you, even if that person is not expressing themselves directly: I never answer his calls, so you'd think he'd get the message.\nSee more get the message across\nto make someone understand: We need to get the message across that too much sun is dangerous.\nSee more\nMore examplesFewer examplesThis is the message that we want to get across to the public.The party's electoral message may be obscured by the glitz and glamour of its presentation.The Gospel message is one of personal salvation.The government's message about the dangers of smoking seems to have struck home.The underlying message of the movie is that love transcends everything else.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nto send someone a short message using a mobile phone or computer: I messaged him yesterday but haven't had a reply.\nSMART Vocabulary: related words and phrases\nCommunications - messaging\nbeep\nbleeper\ndirect message\nDM\nfacsimile\nfax\nintercom\nMailgram\nmessaging\np.m.\npage\npager\nresend\nTelemessage\ntelex\ntext\ntext message\nthnq\ntweet\ntweetstorm\nSee more results »\nRelated word\nmessaging\nmessage noun [C]\n(INFORMATION)\nAdd to word list\nAdd to word list\na short piece of written or spoken information that is given or sent to someone: If I’m not there when you phone, leave a message. She’s not here – can I take a message?\nmessage noun [C]\n(IDEA)\nthe main idea that an artist, writer, speaker, or group is trying to communicate: The message of the movie seems to be that only the most ruthless people can get ahead in politics.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a short piece of information that you give or send to a person when you cannot speak to them directly: message from sb for sb There was a message for you from the catering company.message that I got your message that the meeting was postponed. leave a message If I'm not there when you phone, leave a message on my voicemail.take a message She's not here now; can I take a message?send sb a message He sent me several messages about the problem. I had a message in my inbox.\nIT a piece of information that appears on a computer screen: I kept getting a message saying \"Disable cookies\".\nMARKETING the main idea in an advertisement, speech, etc., or something that you want to tell people: The ad's main message should be that our products are safe to use.send a message Ridding the organization of poor performers also sends a strong message of low tolerance for poor results.\nUS an advertisement on television or radio: We'll be back right after these messages. See also\nemail message\nerror message\ninstant message\ntext message\nCOMMUNICATIONS to send someone a message using electronic equipment: Not many people use the facility of viewing streaming video of the person they are messaging. See also\ninstant message"}