{"id":225461,"name":"meter","type":"noun","us_sound":"ˈmiː.t̬ɚ","us_link":"../audio/m/eus72981.mp3","uk_sound":"ˈmiː.tər","uk_link":"../audio/m/ukmetap012.mp3","content":"meter noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\na device that measures the amount of something that is used: The electricity meter is in the basement. You'll need some change for the parking meter. A man came to read the meter (= see how much gas had been used).\nthe device in a taxi that measures the distance or the amount of time spent travelling and shows how much you have to pay: The cab driver left the meter running while I helped Mum to her front door.\ndowell/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nMeasuring, weighing, & counting devices\ndial\ndipstick\nfitness tracker\ngage\ngamma counter\ngamma meter\ngauge\ngradation\nhydrograph\nindicator\nmicrometer\nplumb line\nprobe\nsensor\nsmart meter\nstraight edge\ntracker\nvoltmeter\nwand\nweather balloon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe interior of vehicles\nmeter noun [C]\n(MEASUREMENT)\nUS spelling of\nmetre\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nto use meters to measure how much gas, electricity, or water is used: Britain's water companies are planning to meter water consumption.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nmeter noun\n(MEASUREMENT)\nAdd to word list\nAdd to word list\n[ C ] (abbreviation m) a unit of measurement of length equal to 100 centimeters or 39.37 inches\nmeter noun\n(DEVICE)\n[ C ] a device that measures the amount of gas, water, or electricity used\n[ C ] In a taxi (= car whose driver you pay to take you somewhere), a meter is the device that measures the distance or the amount of time spent traveling and records how much you have to pay.\nmeter noun\n(RHYTHM)\n[ C/U ]\n&#160; literature the rhythm of a poem, produced by the arrangement of syllables according to the number and type of beats in each line\n[ C/U ]\n&#160; music Meter is the rhythm that organizes the beats in a piece of music into a pattern.\nAdd to word list\nAdd to word list\na piece of equipment that measures the amount of something that has been used: electricity/gas/water meter parking meterread a/the meter Your meter will be read regularly in order to avoid sending you estimated bills.\nTRANSPORT the piece of equipment in a taxi that measures the distance travelled or the amount of time spent travelling, and shows how much you have to pay: If no fare is agreed at the start of the trip, the maximum fare will be that shown on the meter.\nMEASURES US for\nmetre\nSee also\npeople meter\nto use a meter to measure how much gas, electricity, etc. has been used, or how much a taxi ride costs: The water supply to most new homes is metered. You should agree on a price with the driver or ask for the trip to be metered."}