{"id":225688,"name":"metric","type":"adjective","us_sound":"ˈmet.rɪk","us_link":"../audio/m/metric.mp3","uk_sound":"ˈmet.rɪk","uk_link":"../audio/m/ukmetie003.mp3","content":"Add to word list\nAdd to word list\nusing or relating to a system of measurement that uses metres, centimetres, litres, etc.: The recipe is given in both metric and imperial measures. Most high-tech industry has been metric for decades. the metric system\nMore examplesFewer examplesImperial units have in many cases been replaced by metric ones in Britain.They used a metric system of measuring and weighing.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nkilo\nknee-length\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\na system for measuring something: The measuring stick he uses is called the \"Energy Producing Factor\",a metric that describes the amount of energy spent to create a given amount of energy. Measuring business success means determining and monitoring key performance metrics.\nMore examplesFewer examplesThe report analyzed the U.S. economy in terms of traditional business metrics, but it wouldn't make sense to run the country like a corporation.Client loyalty is a poor metric for assessing client relationships, because of the role played by inertia. We lack metrics to know if we are winning or losing the global war on terror.The campaign had \"metrics\" for every week, goals by state, county, and precinct, for identifying voters and for registrations.\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nkilo\nknee-length\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nAdd to word list\nAdd to word list\nof or using the meter or a system of measurement based on it\nAdd to word list\nAdd to word list\nMEASURES using or relating to a system of measurement that uses metres, centimetres, litres, etc.: Most high-tech industry has been metric for decades. Compare\nimperial"}