{"id":225669,"name":"metre","type":"noun","us_sound":"ˈmiː.t̬ɚ","us_link":"../audio/m/eus72981.mp3","uk_sound":"ˈmiː.tər","uk_link":"../audio/m/ukmetap012.mp3","content":"metre noun\n(MEASUREMENT)\nAdd to word list\nAdd to word list\nA2 [ C ] (written abbreviation m) a unit of measurement equal to 100 centimetres: The bomb shelter has concrete walls that are three metres thick. a 15-metre yacht She won the 100 metres (= a race run over this distance) at the Olympics. He is 1 m 75 tall. The price of water rose to 48p per cubic metre (= a unit of volume equal to 1,000 litres). The room is six metres square.\nMore examplesFewer examplesThe women's 200 metre event will be followed by the men's 100 metres.The river froze to a depth of over a metre.There's a drop of two metres from the window to the ground.We are currently flying at an altitude of 15,000 metres.The boat is ten metres in length.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nfooter\nft\nin\nkilometre\nkm\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nmetre noun\n(POETRY)\n[ C or U ]\n&#160; literature\n&#160; specialized the regular arrangement of syllables in poetry according to the number and type of beats in a line: He composes poems in a classical style and in strict metre. Many hymns have a firm, regular metre.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nsuperheroine\nswashbuckler\nsympathetically\ntanka\ntartan noir\nSee more results »\nAdd to word list\nAdd to word list\nMEASURES a unit of measurement of length in the metric system, equal to 100 centimetres or approximately 1.094 yards: The property lies within approximately 150 metres from the construction site but would not be directly affected. The price of water rose to 48p per cubic metre. See also\nkilometre"}