{"id":226981,"name":"middle","type":"noun","us_sound":"ˈmɪd.əl","us_link":"../audio/m/middle.mp3","uk_sound":"ˈmɪd.əl","uk_link":"../audio/m/ukmicro012.mp3","content":"Add to word list\nAdd to word list\nA2 [ S ] the central point, position, or part: This is my class photo - I'm the one in the middle. He was standing in the middle of the road. The noise woke us up in the middle of the night.\n[ C usually singular ] informal waist: Those trousers look a bit tight around your middle.\nMore examplesFewer examplesIs that cake cooked properly in the middle?The princess lived all alone in the middle of the forest.What do those marks in the middle of the road mean?The football player kicked the ball slap into the middle of the net.The shelf isn't straight - it sags in the middle.\nSMART Vocabulary: related words and phrases\nCentres of objects\ncentral\ncentrality\ncentrally\ncentre\ncentric\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternally\nmedian\nmid\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe human torso\nIdioms\nbe in the middle of something\ndivide/split (something) down the middle\n(in) the middle of nowhere\nB2 in a central position: In the sequence a, b, c, d, e, the middle letter is c. Jane sits at the middle desk, between Sue and Karen.\nC1 neither high nor low in importance, amount, or size: middle income families a middle-sized (= average-sized) sheepdog\nA middle child has the same number of older brothers and sisters as younger brothers and sisters: She's the middle child of three.\nused to refer to a form of a particular language that existed between its earliest known stage and its present form: 14th-century Middle English Middle French\nMore examplesFewer examplesThis course aims to prepare students for middle and senior managerial positions.The story was relegated to the middle pages of the paper.For the umpteenth time, Anthony, knives and forks go in the middle drawer!Aim carefully at the target and try to hit the middle circle.Ours is the middle house at the end - the one with the green door.\nSMART Vocabulary: related words and phrases\nCentres of objects\ncentral\ncentrality\ncentrally\ncentre\ncentric\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternally\nmedian\nmid\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\nMedium-sized\nFamily: relations in general\nForms of languages & specialist dialects\nIdiom\nfollow/steer/take the middle course/way/path\nAdd to word list\nAdd to word list\na point, position, or part that is not on one side or the other but is equally far from things on either side; the central point, position, or part: This is my class photo – I’m the one in the middle.\nThe middle of a period of time is a point between the beginning and the end of that period: The noise woke us up in the middle of the night.\ninfml Your middle is your waist. middle adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈmɪd·əl/\nIn the sequence a, b, c, d, e, the middle letter is c. Idioms\nin the middle of something\n(out) in the middle of nowhere"}