{"id":227295,"name":"might","type":"modal verb","us_sound":"maɪt","us_link":"../audio/m/might.mp3","uk_sound":"maɪt","uk_link":"../audio/m/ukmidsi015.mp3","content":"might modal verb\n(MAY)\nAdd to word list\nAdd to word list\npast simple of the verb may, used especially when reporting what someone has said, thought, asked, etc.: I brought him some sandwiches because I thought he might be hungry. Very politely the little boy asked if he might have another piece of cake (= he said \"May I have another piece of cake, please?\").\nMore examplesFewer examples\"I thought you might have helped, \" she replied peevishly.He wrote to me last week regarding a business proposition he thought might interest me.Jan hasn't got a ticket but I thought we might sneak her in.I suggested that a cup of tea might settle her stomach.I've brought with me an article from yesterday's paper that I thought might amuse you.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\nmight modal verb\n(POSSIBILITY)\nA2 used to express the possibility that something will happen or be done, or that something is true although not very likely: I might come and visit you next year, if I can save enough money. Don't go any closer - it might be dangerous/it might not be safe. Driving so fast, he might have had a nasty accident (= it could have happened but it did not). The rain might have stopped by now.\nMore examplesFewer examplesHe hesitated before ringing her, fearful of what she might say.I waited in all evening in the fond hope that he might call.I might go along to the party later.You should hang onto that painting - it might be valuable one day.Keep a lookout for small objects that a baby might swallow.\nSMART Vocabulary: related words and phrases\nAchievable\n-ible\nable\naccomplishable\nachievable\nattainable\ndoable\nfeasibility study\nfeasible\nfeasibly\nhumanly\nmanageably\nposs\npossible\npracticability\npracticable\npractical\nreach\nrunning\nviably\nvincible\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\nmight modal verb\n(PERMISSION)\nmainly UK formal US old-fashioned used as a more polite form of may when asking for permission: Might I ask a question? I wonder if I might have a quick look at your newspaper?\nMore examplesFewer examplesMight I borrow your pen?He asked if he might accompany her.Might I sit with you?\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nmight modal verb\n(SUGGESTION)\nC1 used to make a suggestion or suggest a possibility in a polite way: You might try a little more basil in the sauce next time. I thought you might want to join me for dinner.\nMore examplesFewer examplesYou might like to stay an extra night.You might prefer a stronger drink?I thought you might like to consider a holiday.\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\ncould\nmagic word\nmay I ask idiom\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon (me) idiom\nproblem\nsay\nthank you\nwelcome\nwonder\nwould\nyou're welcome idiom\nSee more results »\nmight modal verb\n(SHOULD)\nused to suggest, especially angrily, what someone should do to be pleasant, correct, polite, etc.: You might at least try to look like you're enjoying yourself! \"I asked my boss over for dinner tonight.\" \"Well, you might have asked me first!\"\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nmight modal verb\n(INTRODUCE)\n(also may) used to introduce a statement that is very different from the statement you really want to make, in order to compare the two: The amount you save might be small, but it's still worth doing.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhand\nhowever\nin the face of something idiom\nin the teeth of something idiom\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nGrammar\nMightMight comes first in the verb phrase (after the subject and before another verb): …\nMight: formsMight comes first in the verb phrase (after the subject and before another verb): …\nMight: usesWe use might most often to refer to weak possibility: …\nMight: typical errorWe don’t use might for ability; we use can or could: …\nCould, may and mightWe use could, may and might to express degrees of possibility. Many native speakers disagree on which one expresses more or less certainty. …\nIdioms\nI might have known\nmight I ask/inquire/know\npower, strength, or force: Pizarro defeated the might of the Inca Empire with only a few hundred men. She struggled with all her might to get free.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\nIdiom\nwith might and main\nmight\n(MAY)\nAdd to word list\nAdd to word list\npast simple of may\nmight modal verb\n(POSSIBILITY)\nused to express the possibility that something will happen or be done or is true, although it may not be very likely: We might come visit you in Atlanta in the spring. He’s very fast and he might even finish in the top three. The Beach Boys might well have been the most talented act to perform at the Monterey Pop Festival.\nmight modal verb\n(SUGGESTION)\nused to make a suggestion or suggest a possibility in a polite way: I thought you might like to join me for dinner.\nmight modal verb\n(SHOULD)\nused to suggest, esp. angrily, what someone should do to be pleasant or polite: You might at least try to look like you’re enjoying yourself!\nmight noun [U]\n(POWER)\npower, strength, or force: She struggled with all her might to lift the rock."}