{"id":227334,"name":"migration","type":"noun","us_sound":"maɪˈɡreɪ.ʃən","us_link":"../audio/m/migration.mp3","uk_sound":"maɪˈɡreɪ.ʃən","uk_link":"../audio/m/ukmidsi023.mp3","content":"migration noun [C or U]\n(TRAVELLING/MOVING)\nAdd to word list\nAdd to word list\nthe process of animals travelling to a different place, usually when the season changes: Christmas Island is known for its annual migration of 50 million bright red land crabs from the forest to the sea. Some old roads follow the paths of seasonal animal migrations. Scientists track bird populations and migration patterns.\nC1 the process of people travelling to a new place to live, usually in large numbers: There was a mass migration of poverty-stricken farmers into the cities. He argues that there are many economic benefits of migration. Compare\nemigration\nimmigration\nMore examplesFewer examplesPrior to migration, Ohio's peregrine falcon population is estimated to reach 110 to 130 birds.The longest migration of a tiger shark tracked before this new record was 1,984 miles.The city has incorporated moose migration paths into its land-use planning.Pressure on housing, health services and schools would occur even without migration, she argues.British migration to France, at just over 40,000 a year, outstrips French migration to Britain.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnon-migratory\nnuzzle\nscent\nskitter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nmigration noun [C or U]\n(CHANGING)\nthe process of beginning to use a new computer system, or of moving information from one type of system to another: Thanks for your patience during the migration to the new system. The processes must include accurate data migration.\nthe process of customers changing to a new service or to a new company that supplies a service: They are assessing the impact of the migration of 6,000 subscribers to DIRECTV Latin America in the third quarter.\nMore examplesFewer examplesThere was a major upgrade of the library system, which necessitated the migration of most staff machines to Windows XP Professional.The package allows data migrations to be performed while live traffic is flowing.IT staff need to get the right applications back on the right desktops after migration.These enhanced value-added elements will prevent the migration of accounts to other firms.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nAdd to word list\nAdd to word list\nmovement from one region to another and often back again, esp. according to the season of the year: [ U ] She’s interested in bat migration.\nAdd to word list\nAdd to word list\nECONOMICS the process of a person or people travelling to a new place or country, usually in order to find work and live there temporarily or permanently: Higher housing prices will probably slow the migration of workers.\nthe process of moving or being moved from one place to another: Outsourcing involves the migration of jobs to areas with low labour costs.\nIT the process of beginning, or of making someone begin, to use a new computer system: They have announced the date for the migration of customers to the new trading system.\nIT the process of moving software or hardware from one computer system to another: Our specialty is the migration of software from Windows to Linux (or vice versa)."}