{"id":227330,"name":"migrate","type":"verb","us_sound":"ˈmaɪ.ɡreɪt","us_link":"../audio/m/migrate.mp3","uk_sound":"maɪˈɡreɪt","uk_link":"../audio/m/ukmidsi022.mp3","content":"migrate verb\n(TRAVEL/MOVE)\nAdd to word list\nAdd to word list\n[ I ] When an animal migrates, it travels to a different place, usually when the season changes: These animals migrate annually in search of food. In September, these birds migrate 2,000 miles south to a warmer climate.\n[ I ] If people migrate, they travel in large numbers to a new place to live temporarily: Mexican farm workers migrate into the US each year to find work at harvest time.\n[ I ] to move from one place to another: Trade has migrated from local shops to the larger chain stores.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nDeparting\nmigrate verb\n(COMPUTING)\n[ I or T ]\n&#160; computing\n&#160; specialized to begin using a new computer system, or to move information from one type of system to another: Migrating to Windows XP shouldn't cause you any problems.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nRelated words\nmigration\nmigratory\nAdd to word list\nAdd to word list\nsocial studies to move from one country or region to another, often temporarily: Farm workers migrate at harvest time. In September these birds migrate south. migrant noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈmɑɪ·ɡrənt/\nmigrant workers\nAdd to word list\nAdd to word list\n[ I ]\n&#160; ECONOMICS to travel to a new place or country, usually in order to find work and live there temporarily or permanently: migrate to Mexican farm workers migrate to the US each year to find work at harvest time.\n[ I ] to move from one place to another: Trade is migrating from local stores to the larger out-of-town hypermarkets.\n[ I or T ]\n&#160; IT to begin, or to make someone begin, using a new computer system: Migrating to the new version of Windows shouldn't cause you any problems.\n[ T ] to move software or hardware from one computer system to another: Migrating software can be a tricky and costly undertaking."}