{"id":227429,"name":"mile","type":"noun","us_sound":"maɪl","us_link":"../audio/m/mile.mp3","uk_sound":"maɪl","uk_link":"../audio/m/ukmidsi030.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a unit of distance equal to 1,760 yards or 1.6 kilometres: a ten-mile drive The nearest town is ten miles away. The speed limit is 30 miles an/per hour. miles C1 [ plural ]\na very long way: From the top, we could see for miles in every direction. He lives miles away on the other side of town.\nMore examplesFewer examplesThe path twists and turns for over a mile.The boat was about a mile from the shore when the engine suddenly died.I've sponsored her £1 for every mile that she runs.He runs five miles every day.The length of the bay is approximately 200 miles.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nfooter\nft\nin\nkilometre\nkm\nlinear\nmicron\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nIdioms\nbe miles away\na mile a minute\na mile off\nmiles\nmiles from anywhere/nowhere\nmiles too big, small, expensive, etc.\nstand/stick out a mile\nAdd to word list\nAdd to word list\na unit of measurement of distance equal to 1760 yards or 1.6 kilometers\nMiles can mean a very long distance: They live way out in the country, miles from anywhere.\nAdd to word list\nAdd to word list\nMEASURES a unit of distance equal to 1,760 yards or 1.6 kilometres: We are just three miles from the airport. See also\nAir Miles\nthe last mile\nnautical mile\nthe Square Mile\ngo the extra mile\nto make more effort than is expected of you: To be successful, you need to be willing to go the extra mile for your customers.\nmiles an/per hour ( abbreviation mph)\nMEASURES, TRANSPORT used for saying how fast a vehicle, plane, etc. is travelling or can travel: The speed limit on UK motorways is 70 miles per hour.\nmiles per gallon ( abbreviation mpg)\nMEASURES, TRANSPORT used for saying how much fuel a vehicle uses: The car does around 40 miles per gallon in town."}