{"id":227480,"name":"military","type":"adjective","us_sound":"ˈmɪl.ə.ter.i","us_link":"../audio/m/military.mp3","uk_sound":"ˈmɪl.ɪ.tər.i","uk_link":"../audio/m/ukmilea016.mp3","content":"Add to word list\nAdd to word list\nB2 relating to or belonging to the armed forces: foreign military intervention military targets/forces military uniform\ntypical of the armed forces: military precision\nMore examplesFewer examplesThe minister argued against making cuts in military spending.The military expedition was made up of 100 officers and men.Spain was an important military power in the 16th century.The general made some bellicose statements about his country's military strength.Over 100 military vehicles paraded through the capital in a show of strength.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nRelated word\nmilitarily\nthe military\nC1 the armed forces: The military has opposed any cuts in defence spending.\nMore examplesFewer examplesThe president relied on the coercive powers of the military.Disagreements about defence cuts have opened up deep divisions within the military.They promised that individuals could live freely without fear of reprisal from the military.The military wants to allow only a sanitized report/version of the incident to become public.The president was widely regarded as the tool of the military.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nAdd to word list\nAdd to word list\nrelating to or belonging to the armed forces: military spending/intervention/forces\nA military academy is a place where soldiers are trained to become officers.\nA military academy (or school) is also a private school or college that expects obedience to rules, has uniforms, and is generally run like the armed forces.\nthe armed forces of a country: My Dad was in the military."}