{"id":227514,"name":"milk","type":"noun","us_sound":"mɪlk","us_link":"../audio/m/milk.mp3","uk_sound":"mɪlk","uk_link":"../audio/m/ukmilea020.mp3","content":"Add to word list\nAdd to word list\nA1 the white liquid produced by cows, goats, and sheep and used by humans as a drink or for making butter, cheese, etc.: a glass/carton of milk cow's/goat's milk skimmed/pasteurized milk a milk bottle\nJose A. Bernat Bacete/Moment/GettyImages\nthe white liquid produced by women and other female mammals as food for their young: Breast/Mother's milk is the best nourishment for a baby.\nthe liquid made from some plants and trees or their nuts, etc.: coconut milk plant-based alternatives to dairy such as almond or hazelnut milk\nthe liquid produced by some plants and trees: The milk of the rubber tree is known as latex. It usually takes six to seven years from the time a rubber tree is planted to when it can produce milk on a commercial basis.\nMore examplesFewer examplesDo you take milk in your tea?Don't use up all the milk, we need some for breakfast.Add two cupfuls of milk to the mixture.Don't forget to put the milk back in the fridge.Antibodies from the mother's milk line the baby's intestines and prevent infection.\nSMART Vocabulary: related words and phrases\nDairy products & eggs\nalbumen\nbeurre noisette\nbrown butter\nbutter\nbutterfat\ncurd\ndairy\nDevonshire cream\ndouble cream\ndried milk\nlacteal\nlactic\nlight cream\nmilk fat\nmylk\nsour cream\nsoya milk\nsunny side up idiom\nUHT\nultra-pasteurized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: bodily fluids & their production\nFood - general words\nParts of plants\nIdiom\nthe milk of human kindness\nmilk verb\n(GET MILK)\n[ I or T ] to get milk from an animal: Milking a cow by hand is a skilled process. Some goats seem to milk (= produce milk) better than others.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nshear\nsheep shearing\nsheepdog\nshepherd\nslaughter\nsubtherapeutic\nteaser\nSee more results »\nmilk verb\n(GET MONEY/INFORMATION)\n[ T ] disapproving to get as much money or information out of someone or something as possible, often in an unfair or dishonest way: [ + obj + adj ] The newspapers milked the story dry. The directors milked the company of several million dollars.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nAdd to word list\nAdd to word list\nthe white liquid produced esp. by cows which people drink: cookies and milk\nMilk is also the white liquid produced by female mammals as food for their young: Breast milk is the best nourishment for a baby.\nThe white liquid obtained from some plants is also called milk: coconut milk\nTo milk something or someone is to get as much from that thing or person as possible: The newspapers milked the story dry.\nAdd to word list\nAdd to word list\nto get as much money or information from someone or something as possible or as much advantage from a situation as possible: milk sb for sth The supermarket has been accused of milking suppliers for as much money as they can. If the press hear about this, they will milk the story for weeks."}