{"id":227562,"name":"mill","type":"noun","us_sound":"mɪl","us_link":"../audio/m/mill.mp3","uk_sound":"mɪl","uk_link":"../audio/m/ukmilea023.mp3","content":"Add to word list\nAdd to word list\na building where grain is crushed into flour\na small machine for crushing things into powder: a pepper/coffee mill\na factory where a particular substance is produced: a cotton/paper/steel mill\nMore examplesFewer examplesWhen the large cog wheel engages (with the smaller one), the mill stone will start to go round.A 200,000-acre forest site will be replanted with softwoods to supply the paper and pulp mill.Working conditions/practices in the mill have hardly changed over the last 20 years.\nSMART Vocabulary: related words and phrases\nFactories\nassembly line\nbrewery\ncannery\nchemical park\nconveyor belt\nindustrial park\nmiller\nmint\nmulti-plant\non the factory floor idiom\npacking house\npower station\nrolling mill\nshipyard\nslaughterhouse\nsmelter\nsmithy\nsolar plant\nsteel mill\nsweatshop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nIdioms\ngo through the mill\nput someone through the mill\nto crush grain into flour or another substance into powder: The grain is still milled locally.\nengineering\n&#160; specialized to cut or shape metal, especially coins, using a special machine\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry: metals & metalworking\nPatterns and shapes\nPhrasal verb\nmill around\nAdd to word list\nAdd to word list\na building with machinery for crushing grain into flour\nA mill is also a factory where a particular materials or substances are processed: a paper/steel mill\nA mill is also a device for crushing a solid substance into powder: a coffee/pepper mill\nAdd to word list\nAdd to word list\nPRODUCTION a factory where cloth, steel, paper, or wood is produced: Developers are converting empty mills and warehouses into expensive apartments. a textile/paper/steel/lumber mill\nPRODUCTION a building where grain is crushed into flour: Our family-run flour mill produces whole-wheat baking flour from organic grains.\ndisapproving a place that provides something in large quantities so that you can get it easily: Diploma mills cheapen the hard work and effort that students put into successfully completing their education. These puppy mills are large-scale breeding operations that have a reputation for abuse and filthy conditions.\nto cut metal or make it into a particular shape by using a special machine: mill sth into sth The steel is milled into sheets, plates, bars, wire, and tubing.\nto crush grain into flour or crush another substance into powder: The grain is still milled locally. See also\nmilling\npaper mill\nrun-of-the-mill"}