{"id":227995,"name":"mind","type":"noun","us_sound":"maɪnd","us_link":"../audio/m/mind.mp3","uk_sound":"maɪnd","uk_link":"../audio/m/ukmilli027.mp3","content":"Add to word list\nAdd to word list\nB1 the part of a person that makes it possible for him or her to think, feel emotions, and understand things: Her mind was full of what had happened the night before, and she just wasn't concentrating. Of course I'm telling the truth - you have such a suspicious mind! I just said the first thing that came into my mind. I'm not quite clear in my mind about what I'm doing.\na very intelligent person: She was one of the most brilliant minds of the last century. all in the/your mind\nIf a problem is all in the mind, it does not exist and is only imagined: His doctor tried to convince him that he wasn't really ill and that it was all in his mind. bear/keep something in mind\nB2 to remember a piece of information when you are making a decision or thinking about a matter: Bearing in mind how young she is, I thought she did really well. Of course, repair work is expensive and you have to keep that in mind.\nThesaurus: synonyms, antonyms, and examples\nto remember somethingrememberDo you remember when her birthday is?recallI don't recall arranging a time to meet.recollectI didn't recollect having seen him.remindEvery time we meet he reminds me about the money he lent me.come back toI forgot his name but it's just come back to me.reminisceWe were just reminiscing about our school days.\nSee more results »\ngo over something in your mind (also turn something over in your mind)\nto think repeatedly about an event that has happened: She kept going over the accident again and again in her mind, wishing that she could somehow have prevented it.\nMore examplesFewer examplesHe's made up his mind, and nothing you can say will change his opinion on the issue.I know she's gone forever, but I just can't put her out of my mind.Her words kept running through my mind.If you change your mind about coming tonight, just give me a call.The events of last year are still fresh in people's minds .\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIntelligent people\nTrue, real, false, and unreal\nRemembering, reminding and reminders\nThinking and contemplating\nSee also\nlike a steel trapGrammar\nMindWe use the verb mind to mean ‘take care or be careful of or about something’, or ‘pay attention to something’. In this meaning, we usually use it in the imperative: …\nMind as a verbWe use the verb mind to mean ‘take care or be careful of or about something’, or ‘pay attention to something’. In this meaning, we usually use it in the imperative: …\nMind as a nounThe noun mind refers to the part of a person that enables them to think, feel emotions and be aware of things: …\nMind: typical errorsWe don’t use to-infinitive after would you mind or do you mind: …\nIdioms\nbe bored, drunk, etc. out of your mind\nbe of sound/unsound mind\nbe of the same mind\nbring/call something to mind\nget your mind around sth\nget something out of your mind\nhave something on your mind\nhave a mind of its own\nhave half a mind/a good mind to do something\nhave something in mind\nMore idioms\nin your mind's eye\na load/weight off your mind\nmake up your mind\nyour mind is a blank/goes blank\nyour mind is on something\nmind over matter\nout of your mind\nput someone in mind of something\nput something out of your mind\nset/put someone's mind at rest/ease\nset/put your mind to something\nsomeone's state/frame of mind\ntake someone's mind off something\nto my mind\nmind verb\n(BE ANNOYED)\nA2 [ I or T ] (used in questions and negatives) to be annoyed or worried by something: Do you think he'd mind if I borrowed his book? [ + -ing verb ] I don't mind having a dog in the house so long as it's clean.informal I wouldn't mind (= I would like) something to eat, if that's OK. Would you mind turning (= please turn) your radio down a little please? Do you mind if I (= may I) put the TV on? [ + obj + -ing verb ] Do you mind me smoking? [ + question word ] I don't mind what you wear so long as it's not that awful pink shirt. I'd rather stay in tonight, if you don't mind.mainly UK \"Would you like tea or coffee?\" \"I don't mind - either.\" do you mind?\nsaid to someone when you feel annoyed with that person for what they have just done or said: Do you mind? That's my seat you're sitting on!\nMore examplesFewer examplesWould you mind filling in a questionnaire about what you watch on television?Do you mind if I have the last chocolate?Do you mind if I ask you a personal question?\"Do you mind if I smoke?\" \"Well, actually, I'd rather you didn't.\"I don't mind which colour we have - you decide.\nSMART Vocabulary: related words and phrases\nNot liking\nabhor\nabide\nabominate\nanti-American\nanti-British\ncivil\ncup\ndeplore\ndespise\ndetest\ndisdain\ndisdainful\ngo off\nmisanthropic\nmisanthropically\nnon-fan\nnot be someone's cup of tea idiom\nnot go much on something idiom\nshy\ntire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions of anger\nmind verb\n(BE CAREFUL)\nB1 [ T ] mainly UK to be careful of, or give attention to something: [ + (that) ] Mind that box - the bottom isn't very strong. Mind (that) you don't bang your head on the shelf when you stand up. Mind (= make certain that) you take enough money with you.old-fashioned Mind your language (= don't use swear words), young lady! mind (out)! mainly UK\nused to tell someone to move or be careful, or to warn someone of danger: Mind out! We're coming through with the stretcher. \"Hey, mind!\" he said when she trod on his foot. Mind out for falling rocks on this part of the trail. mind how you go mainly UK informal\nsaid when you say goodbye to someone, meaning \"take care\"\nMore examplesFewer examplesMind you don't upset her.Mind they don't get in through the back door.Mind you always lock up carefully.Mind the dogs - they are quite wild.Mind out! You nearly drove over my flower bed.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWelcoming, greeting & greetings\nmind verb\n(TAKE CARE OF)\n[ T ] UK or old-fashioned US to take care of someone or something: She asked me if I'd mind the children for an hour while she went shopping. Could you mind my bag for a moment while I go to the toilet?\nThesaurus: synonyms, antonyms, and examples\nto take care of someone or somethingcare forShe had to give up her job to care for her elderly mother.take care ofI just want to make enough money to take care of my family. look afterMy aunt looked after me after my parents died.nurseHe nursed me back to health.tendHe lived a quiet life, tending his garden and his hives.\nSee more results »\nSMART Vocabulary: related words and phrases\nMedical treatment: treating & caring for people\naggressively\nbed blocker\nbed-blocking\nbring\nbring someone around\nclinic\nhealth tourism\nkeep your/an eye on something/someone idiom\nlogroll\nlogrolling\nlook after someone/something\nnurse\npatch\nprep\nrehospitalization\nrehospitalize\nrespite care\nself-care\nset something up\ntend\nSee more results »\nmind verb\n(OBEY)\n[ I or T ] US to listen to and obey someone: Mind your grandma! This dog won't mind.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\nshalt\nviolation\nSee more results »\nGrammar\nMindWe use the verb mind to mean ‘take care or be careful of or about something’, or ‘pay attention to something’. In this meaning, we usually use it in the imperative: …\nMind as a verbWe use the verb mind to mean ‘take care or be careful of or about something’, or ‘pay attention to something’. In this meaning, we usually use it in the imperative: …\nMind as a nounThe noun mind refers to the part of a person that enables them to think, feel emotions and be aware of things: …\nMind: typical errorsWe don’t use to-infinitive after would you mind or do you mind: …\nIdioms\ndon't mind me\nI don't mind if I do\nif you don't mind me saying/asking\nmind (you)\nmind your own business\nmind your p's and q's\nmind the store"}