{"id":228016,"name":"mine","type":"pronoun","us_sound":"maɪn","us_link":"../audio/m/mine.mp3","uk_sound":"maɪn","uk_link":"../audio/m/ukmindl003.mp3","content":"Add to word list\nAdd to word list\nA2 the one(s) belonging to or connected with me: \"Whose bag is this?\" \"It's mine.\" Your son is the same age as mine. She's an old friend of mine. Mine is the silver car, the convertible.\nMore examplesFewer examplesHe's my sister's friend really, not mine.Please could you back your car up a few feet so that I can get mine out of the drive?Here, your eyes are better than mine - could you thread this needle for me?Could I borrow a pen? I've lost mine.Pat's a great friend of mine.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nmine noun [C]\n(HOLE)\nB2 a hole or system of holes in the ground where substances such as coal, metal, and salt are removed: a coal/salt/gold mine a mine shaft My grandfather used to work in (UK also down) the mines.\nborchee/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe minister maintained that the mines were uneconomic and would have to be closed.The nuclear waste is encased in concrete before being sent for storage in disused mines.He had worked in the diamond mines of South Africa.All the mines in this area were closed down in the 80's.The government was severely criticized for its decision to close the mines.\nSMART Vocabulary: related words and phrases\nEngineering - mining & quarrying\nanti-mine\nbanksman\nbeneficiation\nbiomining\ncoal\ncoal miner\ncoal mining\ncoalface\nextract\noilfield\nOPEC\npetrodollar\npit pony\npithead\nprospect\nrig\nshaft\nslag heap\nstrip mining\nunworked\nSee more results »\nmine noun [C]\n(BOMB)\na type of bomb put below the earth or in the sea that explodes when vehicles, ships, or people go over it: He was killed when his tank ran over a mine. The US forces were clearing the surrounding area of mines. See also\nlandmine\nMore examplesFewer examplesThey had laid mines across the road.Her leg was blown off when the mine exploded.We do not know if there are mines in the area.\nSMART Vocabulary: related words and phrases\nBombs & missiles\nanti-mine\nanti-missile\nanti-radar\nanti-satellite\nanti-ship\ndirty bomb\nenrich\nenrichment\nExocet\nfirebomb\nMolotov cocktail\nmortar\nmushroom cloud\nnapalm\nneutron bomb\nsubmunition\nsuicide belt\nsuicide vest\nsuperbomb\nsurface-to-air missile\nSee more results »\nIdiom\na mine of information\nmine verb\n(DIG)\n[ I or T ] to dig coal or another substance out of the ground: They're mining for salt. They mine a lot of copper around these parts.\nSMART Vocabulary: related words and phrases\nEngineering - mining & quarrying\nanti-mine\nbanksman\nbeneficiation\nbiomining\ncoal\ncoal miner\ncoal mining\ncoalface\nextract\noilfield\nOPEC\npetrodollar\npit pony\npithead\nprospect\nrig\nshaft\nslag heap\nstrip mining\nunworked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigging\nmine verb\n(BOMB)\n[ T often passive ] to place or hide mines in an area of land or sea: The desert was heavily mined.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\nloose\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nSee more results »\nmine verb\n(GET CURRENCY)\n[ T ] to use special software to try to obtain new cryptocurrency (= digital currency produced by a public network rather than by a government): Since 2009, the number of bitcoins mined has skyrocketed.\nIdiom\nmine a rich seam of something\nused in the past instead of \"my\" before nouns that begin with a vowel or h : mine eyes mine host\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nmine pronoun\n(BELONGING TO ME)\nAdd to word list\nAdd to word list\nbelonging to me, or that which belongs to me: \"Whose bag is this?\" \"It’s mine.\" Your hair is longer than mine. She’s a friend of mine.\nmine noun [C]\n(HOLE)\na deep hole in the ground made for the removal of coal and other substances by digging: a gold mine\nA mine is also where something can be found: Belinda is a mine of information about home decorating.\nmine noun [C]\n(BOMB)\na bomb put underground or in the sea that explodes when vehicles, ships, or people go over or near it\nA mine detector is a device used to discover whether there are mines in a particular area.\nmine verb\n(DIG IN HOLE)\n[ I/T ] to remove coal or other substances from a deep hole in the ground: [ T ] They mine copper in this area.\nmine verb\n(BOMB)\n[ T ] to hide mines in an area: The desert has been heavily mined.\nAdd to word list\nAdd to word list\na place in the ground where substances such as coal, metal, and salt are removed, or the area and buildings around this place: in/down the mine 2,000 people work down the mine. a coal/salt/gold mine a mine shaft\nto dig coal or another substance out of the ground: mine for sth They're mining for salt. They mine a lot of copper around these parts."}