{"id":228192,"name":"minimum","type":"noun","us_sound":"ˈmɪn.ə.məm","us_link":"../audio/m/minimum.mp3","uk_sound":"ˈmɪn.ɪ.məm","uk_link":"../audio/m/ukmindl030.mp3","content":"Add to word list\nAdd to word list\nB1 the smallest amount or number allowed or possible: Wage increases are being kept to a minimum because of the recession. Let's hope we can get the job done with a minimum of interference. We need a minimum of ten people to play this game. Opposite\nmaximum\nMore examplesFewer examplesTraffic diversions will be kept to a minimum throughout the festival.If your bank account balance falls below the minimum, you'll get a $5 service charge.She eats only the bare minimum to stay alive.You need a minimum of three players for this game.To open an account, you have to deposit a minimum of $500.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmaximum\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nB1 used to describe something that is the smallest or least allowed or possible: This certificate is the minimum qualification required to teach English in most language schools. 18 is the minimum age for entering most nightclubs. Opposite\nmaximum Compare\nminimal\nmaximal specialized\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmaximum\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nat the least: She thinks that you should do three exercise classes a week minimum.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmaximum\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nAdd to word list\nAdd to word list\nbeing the smallest amount or number allowed or possible: Her lawyer asked the judge to give her the minimum sentence.\nAdd to word list\nAdd to word list\nthe smallest amount or number allowed or possible: keep sth to a minimum Wage increases are being kept to a minimum because of the recession.with the minimum of sth They installed the new computer system with the minimum of fuss, so there was no disruption at all to our work. Staff earn a minimum of $15 an hour. He only does the bare minimum of work and shows no enthusiasm at all. Compare\nmaximum noun\nused for describing something that is the smallest allowed or possible: You will pay a lot of interest on a credit card if you only pay off the minimum amount each month. A degree is the minimum qualification for a highly-skilled worker's visa. Compare\nmaximum adjective\ninformal not less than a particular number or amount: You have to work here for six months minimum before you qualify for a bonus."}