{"id":228185,"name":"minimize","type":"verb","us_sound":"ˈmɪn.ə.maɪz","us_link":"../audio/m/minimize.mp3","uk_sound":"ˈmɪn.ɪ.maɪz","uk_link":"../audio/m/ukmindl029.mp3","content":"Add to word list\nAdd to word list\nC1 to reduce something to the least possible level or amount: We must minimize the risk of infection. Environmentalists are doing everything within their power to minimize the impact of the oil spill. Opposite\nmaximize\nto make something seem less important or smaller than it really is: She accused politicians of minimizing the suffering of thousands of people. It's important to focus on your strengths and to minimize your weaknesses. Synonyms\ndownplay\nunderstateOpposites\nemphasize\nexaggerate\nforeground\nhighlight\noverplay\noverstate\nspotlight\nto make something small on a computer screen: Minimize the window by clicking in the corner. Compare\nmaximize\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExaggerating & playing down\nOperating computers\nRelated word\nminimization\nAdd to word list\nAdd to word list\nto reduce something to the smallest possible level or amount: We do all that we can to minimize the risk of infection.\nTo minimize something is also to make it seem less important or smaller than it really is: He minimized his involvement in the scandal.\nAdd to word list\nAdd to word list\nto reduce something to the smallest possible level or amount: We rented an office in the cheap part of town to minimize costs. You should spread your investments to minimize the risk of large losses. The airline is trying to minimize the impact of the strike on the public. The safety features aim to prevent or minimize injury in the case of an accident.\nto make something seem less important or smaller than it really is: The bank was accused of minimizing the risks and exaggerating the potential gains of the investment. It's important to focus on your strengths and to minimize your weaknesses.\nIT to click on the corner of a computer window to reduce it to a small title and hide its contents: You can minimize the virus checker window and let it run in the background. See also\nmaximize"}