{"id":228283,"name":"minor","type":"adjective","us_sound":"ˈmaɪ.nɚ","us_link":"../audio/m/miner.mp3","uk_sound":"ˈmaɪ.nər","uk_link":"../audio/m/ukmindl006.mp3","content":"minor adjective\n(UNIMPORTANT)\nAdd to word list\nAdd to word list\nB2 having little importance, influence, or effect, especially when compared with other things of the same type: a minor operation It's only a minor problem. There's been an increase in minor offences, such as traffic violations and petty theft. She suffered only minor injuries. It requires a few minor adjustments. a minor poet of the 16th century Compare\nmajor adjective (IMPORTANT)\nMore examplesFewer examplesFor the sake of completeness , I should also mention two other minor developments.Treat minor ailments yourself.The fear is that these minor clashes may develop into all-out confrontation.They had minor breakthroughs but real success eluded them.Your health is generally good, but you do have a few minor problems.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\npicture\npiddling\npiddly\npiffling\nplay second fiddle idiom\nunseriousness\nvenial\nvestigial\nvestigially\nwho needs...? idiom\nSee more results »\nminor adjective\n(MUSIC)\nmusic belonging or relating to a musical scale that is generally thought to have a sad sound: The piece is written in a minor key. Mozart's Piano Concerto in D minor Compare\nmajor adjective (MUSIC)\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nnatural\nnote\nregister\nsoh\nsol\nsol-fa\nte\nti\nSee more results »\nsomeone who is too young to have the legal responsibilities of an adult: He was accused of having sex with a minor.\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nSMART Vocabulary: related words and phrases\nYoung people\nadolescence\nadolescent\nboyhood\ndelinquent\nemo\nephebe\nladdish\nladdishness\nlarrikin\nmall rat\nned\nskinhead\nteen\nteenager\nteenybopper\ntween\ntweenager\nyouth\nyouth culture\nyute\nSee more results »\nminor in something US\nto study something as your second most important subject in college: I minored in Spanish in college.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nextension\nfamiliar\nhit the books idiom\nmislearn\nmug (something) up\nnon-academic\nnon-library\nonboard\nshadow\nswot up (something)\nteachable\nthose\nuncultivated\nuncultured\nSee more results »\nminor adjective [not gradable]\n(UNIMPORTANT)\nAdd to word list\nAdd to word list\nnot great in size or importance: She suffered minor injuries in the accident. Waiting another half hour was only a minor inconvenience.\nminor adjective [not gradable]\n(MUSIC)\nmusic based on a scale (= series of musical notes) in which there is a whole step (= sound difference) between each note except between the second and third notes and between the fifth and sixth notes: a minor scale a minor chord\nminor noun [C]\n(YOUNG PERSON)\na person under the age at which he or she legally becomes an adult\nminor noun [C]\n(SPECIAL SUBJECT)\nthe second most important subject that a college student is studying: I’m taking two courses in my minor, chemistry.\nAdd to word list\nAdd to word list\nhaving little importance, influence, or effect, especially when compared with similar things: It's only a minor problem. There are minor differences between the models, but they're basically the same. The vehicle only suffered minor damage. minor adjustments/corrections/modifications See also\nmajor\nLAW someone who has not yet reached the age when they are legally an adult: It's illegal for adults to supply tobacco to minors."}