{"id":228296,"name":"minority","type":"noun","us_sound":"maɪˈnɔːr.ə.t̬i","us_link":"../audio/m/eus73024.mp3","uk_sound":"maɪˈnɒr.ə.ti","uk_link":"../audio/m/ukminim013.mp3","content":"minority noun\n(SMALL PART)\nAdd to word list\nAdd to word list\nB2 [ S ] a smaller number or part: It's only a tiny minority of people who are causing the problem. Children with single parents at my school were very much in the minority (= there were very few). This section of the bookstore caters for minority interests (= subjects that interest only a few people). Opposite\nmajority\nMore examplesFewer examplesBecause the two main parties have won almost the same number of votes, the minority group holds the key to the result.The fact that a party can be voted into power by a minority of the electorate calls into question the country's electoral system.It's a minority of these people who are causing trouble.Those who want violence are in the minority.In a minority of cases, a prison sentence is appropriate.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmass\nmax\nmax out\nmaximal\nmaximally\nmaximum\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nminority noun\n(PEOPLE)\nC1 [ C ] any small group in society that is different from the rest because of their race, religion, or political beliefs, or a person who belongs to such a group: ethnic/religious minorities The plan was designed to help women and minorities overcome discrimination in the workplace.\nMore examplesFewer examplesGovernment by majority rule can be a threat to minority rights.Human rights activists have accused the country's government of a systematic perpetration of violence against minority groups.Outraged minority groups will not be placated by promises of future improvements.They are members of a racial minority.What are the prospects for overcoming the strife between the Christian minority and Muslim majority?\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nIdiom\nbe in a minority of one\nminority noun [C/U]\n(SMALLER AMOUNT)\nAdd to word list\nAdd to word list\nless than half of a total number or amount; the smaller part of something: [ U ] Only a minority of people support military action. [ U ] Traditional families are in the minority in this neighborhood (= there are not many).\nminority noun [C]\n(PEOPLE)\nsocial studies a group of people who share some characteristic by birth that makes their group smaller than some other groups in a society and may cause others to treat them unfairly: He argued that African Americans and other minorities were not getting a fair deal in sports and elsewhere in society. Jews and Roman Catholics belonged to religious minorities.\nAdd to word list\nAdd to word list\n[ S ] a small number of the people or things in a group: Only a small/tiny minority of customers have complained about the changes.be in a/the minority I don't like the design, but I'm in the minority – most people say they love it.\n[ C ] a group of people in a country or area who are of a different race, or have a different culture or religion to that of most other people there: ethnic/racial minority We want to end discrimination against women and racial minorities. minority community/employee/group British Asians are the largest minority group among UK staff. Compare\nmajority noun\nblocking minority\nFINANCE, STOCK MARKET used to refer to the situation when a person or organization owns fewer shares in a company than other shareholders, and not enough to be in control of the company: Many minority shareholders are local people. He may be close to selling his minority stake in the company."}