{"id":228606,"name":"miracle","type":"noun","us_sound":"ˈmɪr.ə.kəl","us_link":"../audio/m/cdo0622usmira0876.mp3","uk_sound":"ˈmɪr.ə.kəl","uk_link":"../audio/m/ukminim026.mp3","content":"Add to word list\nAdd to word list\nB2 an unusual and mysterious event that is thought to have been caused by a god because it does not follow the usual laws of nature: Jesus Christ was said to have performed miracles like turning water into wine.\na very lucky event that is surprising and unexpected : [ + (that) ] Looking at the state of his car, it's a miracle (that) he wasn't killed! I can't promise a miracle cure, but I think we can improve things.\nThesaurus: synonyms, antonyms, and examples\na surprisesurpriseThe announcement that she was leaving the post was a surprise to us all.shockIt will be a terrible shock if their income is cut.kickerUS The kicker is that even after six rounds of interviews, she still wasn't a finalist for the job.a rude awakeningShe'll be in for a rude awakening when she has to pay her own bills.eye-openerHis unauthorized biography was a real eye-opener. news to meSarah is leaving? Well that's news to me.\nSee more results »\nan excellent achievement in a particular area of activity : I considered my recovery to be a miracle of modern medicine.\nMore examplesFewer examplesYou've performed a miracle on this kitchen - I've never seen it so clean!It's a miracle nobody died in the accident.Barring miracles, the company will go out of business very soon.The treatment is a miracle of modern medicine.\nSMART Vocabulary: related words and phrases\nConfusion, confusing and feeling confused\naddled\nall of a doodah idiom\nall over the place idiom\nalphabet soup\nat sea idiom\ndazedly\nDelphic\ndisarray\ndiscombobulation\ndisordered\nmuddle\nmuddle something up\nmuddle-headed\nmuddled\nmush\nturmoil\nunaccountable\nunaccountably\nunexplained\nunsearchable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural things and people\nEvents and occurrences\nGood luck and bad luck\nSuccess and achievements\nIdiom\nperform/work miracles/a miracle\nAdd to word list\nAdd to word list\nan unusual and mysterious event that is thought to have been caused by God\nA miracle is also any surprising and unexpected event: [ + (that) clause ] It’s a miracle (that) he wasn’t killed in that car crash."}