{"id":228812,"name":"mirror","type":"noun","us_sound":"ˈmɪr.ɚ","us_link":"../audio/m/mirror.mp3","uk_sound":"ˈmɪr.ər","uk_link":"../audio/m/ukmirro001.mp3","content":"mirror noun\n(GLASS)\nAdd to word list\nAdd to word list\nA2 [ C ] a piece of glass with a shiny, metal-covered back that reflects light, producing an image of whatever is in front of it: the bathroom mirror She was looking at her reflection in the mirror.\nSteve Gorton/Dorling Kindersley/GettyImages\nMore examplesFewer examplesThe image you see in the mirror seems to be reversed.A large mirror in a room can create the illusion of space.Full-length mirrors lined each wall of the bathroom.There's a mirror above the washbasin.She had a quick look in the rear mirror before she pulled out from the kerb.\nSMART Vocabulary: related words and phrases\nGlass\nblow\nblower\nblowpipe\ncut glass\nfibreglass\nfrit\nfrost\nfrosted\nglaze\nglazed\nglazier\nglazing\nlooking glass\npaste\npunty\nPyrex\nreglaze\nsafety glass\nshatterproof\nvitrify\nSee more results »\nmirror noun\n(REPRESENT)\nbe a mirror of something\nto represent or show something honestly: The movie is a mirror of daily life in wartime Britain.\nSee more\nto represent something honestly: Our newspaper aims to mirror the opinions of ordinary people.\nto be very similar to something: Her on-screen romances seem to mirror her experiences in her private life.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstance\ninstantiate\nMr\nMrs\non-brand\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing or appearing similar or the same\nmirror noun [C]\n(GLASS)\nAdd to word list\nAdd to word list\na piece of glass with a back that reflects light, producing an image of whatever is in front of it: a rear-view mirror a hand mirror\nmirror noun [C]\n(REPRESENTATION)\na copy of something; something that is similar to something else: The law is a mirror of the nation’s character.\nmirror verb [T]\n(REPRESENT)\nto be a copy of something; be similar to something"}