{"id":229327,"name":"miscount","type":"verb","us_sound":"ˌmɪsˈkaʊnt","us_link":"../audio/m/usmisan018.mp3","uk_sound":"ˌmɪsˈkaʊnt","uk_link":"../audio/m/ukmisch011.mp3","content":"Add to word list\nAdd to word list\nto reach a total that is not correct when counting: I thought we had enough plates for the party, but perhaps I miscounted. A computer glitch had miscounted thousands of absentee votes.\nMore examplesFewer examplesOfficials of that school said state officials miscounted and there are actually eight certified teachers. The crew that loaded the cargo miscounted the number of barrels. He would occasionally miscount the number of subway stops on his way home and get off at 145th Street instead of 135th Street.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmultigrid\noperator\nroot\nsum\ntriangulation\nwork something out\nSee more results »\nan occasion when someone reaches a total that is not correct when counting: The missing revenue from the miscount totals between $8,000 and $12,000. Most of the lost votes and miscounts occurred in counties with modern electronic systems.\nMore examplesFewer examplesThe district is appealing because officials think there was a miscount.Some council members questioned how the academy would safeguard against student miscounts.The prison miscount has a severe impact on elections.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmultigrid\noperator\nroot\nsum\ntriangulation\nwork something out\nSee more results »\nAdd to word list\nAdd to word list\nto count something wrongly: Someone in the warehouse must have miscounted. The HR manager miscounted the number of employees receiving benefits."}