{"id":229588,"name":"misfield","type":"noun","us_sound":"ˈmɪsˌfiːld","us_link":"../audio/m/cdo0622usmisf0917.mp3","uk_sound":"ˈmɪs.fiːld","uk_link":"../audio/m/cdo0622ukmisf0963.mp3","content":"Add to word list\nAdd to word list\na failure to correctly catch, stop, or pick up the ball in a game such as cricket or rugby (= a game played with an oval ball): A terrible misfield led to four runs. There were also mis-fields and a series of no-balls.\nMore examplesFewer examplesA misfield and one missed catch were the only lapses in their fielding.He was run out after a comical misfield.He gained a boundary from a misfield before being caught. His misfield cost them three precious runs.A misfield tempted her to run.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppishly\nwalk\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nRugby\nto fail to correctly catch, stop, or pick up the ball in a game such as cricket or rugby (= a game played with an oval ball): You don’t often see him misfield. She mis-fielded the second ball. Related word\nfield verb (BALL)\nMore examplesFewer examplesThe ball went over the boundary after he misfielded. The pressure got to him and he was continuously misfielding and dropping catches.She misfielded the first three balls.Several of the tries were the result of misfielded high kicks.After misfielding a kick deep in his own half, he redeemed himself with a fine touchdown.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppishly\nwalk\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nRugby"}