{"id":230255,"name":"misrepresent","type":"verb","us_sound":"ˌmɪs.rep.rɪˈzent","us_link":"../audio/m/misrepresent.mp3","uk_sound":"ˌmɪs.rep.rɪˈzent","uk_link":"../audio/m/ukmispr007.mp3","content":"Add to word list\nAdd to word list\nto describe falsely an idea, opinion, or situation, often in order to get an advantage: She accused her opponents of deliberately misrepresenting her as an extremist. I've grown used to my views being misrepresented in the press.\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsehood\nfalsification\nfeed someone a line idiom\nfib\nfiction\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\nAdd to word list\nAdd to word list\nto represent something or someone falsely, often in order to obtain an advantage: He misrepresented facts about his legal experience on his application.\nAdd to word list\nAdd to word list\nto give false information about something or someone, often in order to get an advantage: She believes that the defendant's lawyers misrepresented the situation.be misrepresented (by sb/in sth) The monetary policy has been misrepresented in the press.misrepresent information/data/the facts Shareholders claimed that the company concealed or misrepresented financial information.misrepresent yourself (as sth) At age 20 he misrepresented himself as an experienced businessman, making millions of dollars."}