{"id":230354,"name":"missing","type":"adjective","us_sound":"ˈmɪs.ɪŋ","us_link":"../audio/m/missing.mp3","uk_sound":"ˈmɪs.ɪŋ","uk_link":"../audio/m/ukmispr013.mp3","content":"Add to word list\nAdd to word list\nA2 Someone who is missing has disappeared: Her father has been missing since September 1992.UK The girl went missing during a family outing to Mount Snowdon.\nThesaurus: synonyms, antonyms, and examples\nto disappeardisappearThe boat disappeared in the storm.go awayIt was weeks before the bruises went away.vanishDinosaurs vanished from the Earth 65 million years ago.(go) missingHe has been missing since November of last year.fade awayAs the years passed, the memories faded away.\nSee more results »\nB1 Something that is missing cannot be found because it is not where it should be: The burglars have been arrested but the jewellery is still missing. When did you realize that the money was missing from your account?\nThesaurus: synonyms, antonyms, and examples\nto be absentabsentIf you are absent from work for more than three days, you must provide a medical certificate.AWOLDuring the First World War soldiers who left their post were regularly charged with going AWOL.go AWOLMy glasses have gone AWOL again.missingHave you seen my credit card? It seems to be missing.\nSee more results »\nMissing soldiers or military vehicles have not returned from fighting in a war but are not known completely certainly to be dead or destroyed: He was listed as missing in action.\nMore examplesFewer examplesThe police have called off the search for the missing child until dawn tomorrow.The missing letter eventually turned up inside a book.A search party was sent out to look for the missing climbers.All of the ship's crew are missing, believed dead.This jigsaw puzzle has two pieces missing.\nSMART Vocabulary: related words and phrases\nAbsent\nabsence\nabsent\nabsentee\nabsenteeism\nanywhere\nAWOL\nduring someone's absence\ngo AWOL idiom\nin absentia\nin someone's absence\nin the absence of someone/something\nmiss\nmissing person\nnegative\nno-show\nnot anywhere to be found idiom\nnowhere\nstation\nunaccounted for\nunrepresented\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSoldiers & people who fight in wars\nAdd to word list\nAdd to word list\n(of a person or possession) not found where you expect to find someone or something; lost or absent: He disappeared on his way to school and has been missing for over a year. When did you realize the money was missing?"}