{"id":230321,"name":"misshape","type":"verb","us_sound":"ˌmɪsˈʃeɪp","us_link":"../audio/m/cdo0622usmiss0944.mp3","uk_sound":"mɪsˈʃeɪp","uk_link":"../audio/m/cdo0622ukmiss0990.mp3","content":"Add to word list\nAdd to word list\nto make something become an unusual shape, or the wrong shape : Don't rub delicate garments or wring them out - you might damage the fabric or misshape the linings. He suggested using papaya leaves to tenderize the steak without mis-shaping it.\nto influence something, especially people's beliefs, ideas, or character, in a way that is not correct or good: These were the moments that shaped and misshaped him. The rumours were effective in mis-shaping local people's opinions. There were concerns that college admissions tests were misshaping secondary education. Related word\nshape verb\nMore examplesFewer examplesThe pressure is high enough to disrupt the flow of gas and misshape the jets.He grew up in a society misshaped by British colonialism.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffecting and influencing\nmainly UK something, especially a piece of food, that is the wrong shape: My dad worked at the chocolate factory and was always bringing home bags of misshapes.\nMore examplesFewer examplesYou can buy biscuit mis-shapes from the factory shop.The first few eggs a hen produces will be small and sometimes you'll get misshapes too.\nSMART Vocabulary: related words and phrases\nBiscuits\namaretto\nanimal cracker\nAnzac biscuit\nbaked goods\nbannock\ncream cracker\ncrispbread\ncrumb\ncustard cream\ndigestive\nmacaroon\nmillionaire's shortbread\noatcake\noyster cracker\npastry\nshortbread\nshortcake\nsnickerdoodle\nsoda cracker\nsponge finger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSweets"}