{"id":230280,"name":"miss","type":"verb","us_sound":"mɪs","us_link":"../audio/m/miss.mp3","uk_sound":"mɪs","uk_link":"../audio/m/ukmispr010.mp3","content":"miss verb\n(NOT DO)\nAdd to word list\nAdd to word list\nB1 [ T ] to fail to do or experience something, often something planned or expected, or to avoid doing or experiencing something: I missed the start of the class because my bus was late. Often I miss (= do not eat) breakfast and have an early lunch instead. You should leave early if you want to miss the rush hour. [ + -ing verb ] I only just missed being run over by a bus this morning.\nThesaurus: synonyms, antonyms, and examples\nto avoid doing somethingavoidAvoid swimming in areas where sharks are known to congregate.evadePlease don’t think I’m trying to evade my responsibility.dodgeHe tried to dodge his military service.run away fromI didn't often run away from difficult decisions.shrink fromI've never been one to shrink from a challenge.sidestepThis is not a responsibility you can sidestep.\nSee more results »\nA2 [ T ] to arrive too late to get on a bus, train, or aircraft: You'll miss your flight if you don't hurry up.\nA2 [ T ] to not go to something: Students who miss a lot of school can find it hard to catch up. I'm trying to find an excuse for missing the office party.\nB1 [ T ] to not see or hear something or someone: I missed the beginning of the show. Her latest movie is too good to miss (= it certainly should be seen). I was sorry I missed you at Pat's party - I must have arrived after you left.\n[ T ] to not notice someone or something: You don't miss much, do you? Nobody else noticed that mistake. My office is first on the right with a bright red door. You can't miss it (= it is very easy to find). A big neon sign has been put up where nobody can miss it. A golden eagle is so large and distinctive that no birdwatcher, however inexperienced, could possibly miss it.\nMore examplesFewer examplesHenri's latest show is simply too good to miss.In this game if you give the wrong answer you have to miss a turn.She has never missed a single episode of her favourite soap opera.He missed two practice sessions so he's out of the team.You'll have to make up the work you've missed while you were away.\nSMART Vocabulary: related words and phrases\nAvoiding action\nabrogate\nabrogation\navoid\navoid something like the plague idiom\navoidance\neschew\nevade\nevader\nevasion\nfiddle\nfiddle around\nfight shy of idiom\ninsure\nshirk\nshort circuit\nshrink from something\nshy away from something\nsit on your arse idiom\nsteer\nwelch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLate\nAbsent\nForgetting and forgetfulness\nmiss verb\n(FEEL SAD)\nA2 [ T ] to feel sad that a person or thing is not present: I really missed her when she went away. She will be sadly missed by all who knew her. I still miss my old car. What did you miss most about home when you were living in France? [ + -ing verb ] I haven't missed smoking like I expected to.\nMore examplesFewer examplesI miss my mom and dad a lot.You'll be sorely missed by everyone here, and we wish you success in your new job.She missed Spain and the languor of a siesta on a hot summer afternoon.It surprises me how much he misses his sister when she's away - after all, they do nothing but fight when they are together!I really miss seeing their happy smiling faces.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nmelancholia\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nremorseful\nrepentant\nwretchedness\nSee more results »\nmiss verb\n(NOT HIT)\nB2 [ I or T ] to fail to hit something, or to avoid hitting something: The bullet missed his heart by a couple of centimetres. I swerved to avoid the other car and only just missed a tree. He threw a book at me, but he/it missed.\nMore examplesFewer examplesThe arrow missed its target and landed on the grass.How could he have missed the goal from that distance?The car missed the tree and ran into the field.I tried to throw the paper in the bin, but I missed.Luckily the egg missed his face by inches.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrunning on empty idiom\nsclerotic\nscrew\nscrew (something) up\nsmoke\nthe rot sets in idiom\nSee more results »\nmiss verb\n(NOTICE)\n[ T ] to notice that something is lost or absent: He didn't miss his wallet until the waiter brought the bill.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nforfeit\nget to\nkiss\nlose\nloss\nlost\nmislay\nmisplace\nmisroute\nproximately\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nwave/say goodbye to something idiom\nSee more results »\nGrammar\nMissWe use miss as a verb to mean ‘not hit or reach something’: …\nIdioms\nmiss a chance/opportunity\nmiss the boat\nmiss the mark\nmiss the point\nnot miss a trick\nnot miss muchPhrasal verbs\nmiss someone/something out\nmiss out\nmiss noun\n(NOT HIT)\n[ C ] an occasion when something or someone fails to hit something or avoids hitting something: Well done! You scored eight hits and only two misses. See also\nnear miss\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nlost cause\nmess\nparody\nreversal\nslim pickings\nslush pile\ntrack record\ntrain wreck\nSee more results »\nmiss noun\n(NOT DO)\ngive something a miss C1 UK informal\nto avoid or not do something: We usually go to France in the summer, but we've decided to give it a miss this year.\nSee more\nmiss noun\n(GIRL)\n[ C ] UK old-fashioned informal a girl or young woman, especially one who behaves rudely or shows no respect: You're a cheeky little miss! Apologize at once.\nA1 a title used before the family name or full name of a single woman who has no other title: Dr White will see you now, Miss Carter. Miss Helena Lewis Compare\nMs\nMrs\n[ as form of address ] mainly US or old-fashioned UK used as a form of address for a girl or young woman: Excuse me, Miss, you dropped this.\n[ as form of address ] UK sometimes used by children to address or refer to teachers who are women: Can I go to the toilet, Miss?\na title given to a woman who wins a beauty contest, combined with the name of the place that she represents: Miss India/UK the Miss World contest\nMore examplesFewer examplesExcuse me, Miss - you dropped this.\"You can go and sit down again now, girls and boys.\" \"Yes, Miss.\"Ask Miss Taylor to come to my office when she's free, would you?Let me introduce my colleague, Miss Sohar - she's in charge of marketing.The letter was addressed to a Miss M A Kirkwood, but we didn't know anyone of that name.\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmister\nmonarch\nmonarchist\nmorganatic\nroyalist\nroyally\nRt. Hon.\nShah\nsheikh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarriage: marital status\nTeachers\nmiss verb\n(NOT HIT)\nAdd to word list\nAdd to word list\n[ I/T ] to fail to hit or to avoid hitting something: [ T ] The plane narrowly missed power lines as it landed. [ I ] He threw a snowball at me, but he missed.\nmiss verb\n(NOT DO)\n[ T ] to fail to do, see, or experience something, esp. something planned or expected when it is available: I wanted to see that movie, but I missed it. If you don’t hurry you’ll miss your plane (= fail to get on it before it leaves). You should leave early if you want to miss rush hour (= avoid it).\nmiss verb\n(REGRET)\n[ T ] to feel sad because you cannot see a person or place or do something: Luis says he misses Puerto Rico very much.\nmiss verb\n(NOT FIND)\n[ T ] to notice that something is lost or absent: He didn’t miss his wallet until the waiter brought the check. Idiom\nmiss the boatPhrasal verb\nmiss out\na failure to hit, catch, do, see, or experience something: Scurry blocked eight shots and caused misses on numerous others.\na title for a girl or a woman who has never been married, used before the family name or full name: Miss Green\nMiss is also used as a form of address to get the attention of a girl or woman: Hey, Miss, you dropped a glove!\nA woman who has won a beauty competition is often given the title \"Miss\" and the name of the place that she represents: Miss Alaska/Miss America"}