{"id":230357,"name":"mission","type":"noun","us_sound":"ˈmɪʃ.ən","us_link":"../audio/m/mission.mp3","uk_sound":"ˈmɪʃ.ən","uk_link":"../audio/m/ukmispr014.mp3","content":"mission noun\n(JOB)\nAdd to word list\nAdd to word list\nC2 [ C ] an important job, especially a military one, that someone is sent somewhere to do: Your mission is to isolate the enemy by destroying all the bridges across the river. a peace/rescue/fact-finding mission\nB2 [ C ] any work that someone believes it is their duty to do: My mission in life is to educate the rich about the suffering of the poor. She's a woman with a mission and she's absolutely determined to finish the project.\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nmission accomplished\nsomething that you say when you have finished doing something that you were told to do: Mission accomplished. I've got everything you asked for on the list.\nMore examplesFewer examplesThe pilots were thoroughly debriefed after every mission.The UN Secretary General is on a fence-mending mission.They were taken prisoner while on a reconnaissance mission behind enemy lines.They were on a mercy mission to take food to the refugees when they were attacked.She told us about his brother, Apollo, born in 1969 and named for the U.S. astronauts' mission to the moon.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe armed forces generally\nGoals and purposes\nFinished & over\nmission noun\n(PEOPLE)\n[ C, + sing/pl verb ] a group of people whose job is to increase what is known about their country, organization, or religion in another country or area, or the place where such people are based: More funds are needed to establish trade missions in eastern Europe. The Methodist mission is situated in one of the poorest parts of the city.\nSMART Vocabulary: related words and phrases\nReligions & religious groups\nAbrahamic\nAfrican Methodist Episcopal Church\nAME\nanti-Catholicism\nanti-Christianity\nevangelicalism\nfaith-based\nFree Church\nGnosticism\nmulti-religious\nneo-paganism\nnon-established\npaganism\nPentecostalism\nSufism\nSunni\nsuper-church\nTaoism\nTaoist\nthe God squad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nAdd to word list\nAdd to word list\nthe action of sending someone to a place to do a particular job, esp. one for a government or religious organization, or the job the person has been sent to do: They were sent on a secret political mission to the Middle East. fig. She’s a woman on a mission (= She is strongly determined) to teach those children to read.\nA mission is also a group of people who are sent to another place to do a particular job or to represent their country, organization, or religion, or the place where they go to do this work: A trade mission was sent to South Africa. a Methodist mission\nAdd to word list\nAdd to word list\nWORKPLACE the result that a company or an organization is trying to achieve through its plans or actions: core/main/primary mission The main mission of the Home Ownership Group is to arrange loans for first time home buyers. The team's job is to lead the corporation on its strategic mission. mission to do sth The charity's mission is to help the homeless find jobs.\nan important job that someone is given to do: Salespeople must fulfill the missions that sales managers have assigned to them.sb's mission is to do sth His mission was to turn the agency into a modern service provider.\nGOVERNMENT an important official job that a person or a group of people are sent somewhere to do: on a mission to The group is on mission to Boston to try to raise money.a trade/humanitarian/diplomatic mission State lawmakers are preparing to lead an annual energy-focused trade mission to Mexico.\nGOVERNMENT a group of people who are sent somewhere to do an official job: The United Nation's secretary general sent a mission which found that both sides were violating the agreement.\non a mission to do sth\nused, often humorously, to describe someone being very determined to achieve something: He's on a mission to make the department more environmentally aware. See also\nfact-finding mission\nmission statement"}