{"id":230478,"name":"mistake","type":"noun","us_sound":"mɪˈsteɪk","us_link":"../audio/m/mistake.mp3","uk_sound":"mɪˈsteɪk","uk_link":"../audio/m/ukmispr028.mp3","content":"Add to word list\nAdd to word list\nA2 an action, decision, or judgment that produces an unwanted or unintentional result: I'm not blaming you - we all make mistakes. [ + to infinitive ] It was a mistake for us to come here tonight. This letter's full of spelling mistakes. I've discovered a few mistakes in your calculations. Why am I under arrest? There must be some mistake.\nThesaurus: synonyms, antonyms, and examples\na mistakemistakeIt was just a silly mistake - no need to apologize.errorHe admitted that he'd made an error.blunderThe company was struggling after a series of financial blunders.slipIt was an understandable slip.mix-upThere was a mix-up with the bags at the airport.gaffeI made a real gaffe by calling her \"Emma\", which is the name of his previous girlfriend.\nSee more results »\nby mistake\nB1 by accident: I've paid this bill twice by mistake.\nSee more\nMore examplesFewer examplesShe admitted that she had made a mistake.Sooner or later she's going to realize what a mistake she's made.There seems to have been a mistake - my name isn't on the list.If you draw or write in pencil you can always rub out your mistakes with an eraser.I have an apology to make to you - I'm afraid I opened your letter by mistake.\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmalapropism\nmiscue\nmisfunction\nmisperception\nmisprint\nmisspelling\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nIdioms\nand no mistake\nmake no mistake (about it)\nto be wrong about or to fail to recognize something or someone: You can't mistake their house - it has a bright yellow front door.formal I mistook your signature and thought the letter was from someone else.\nSMART Vocabulary: related words and phrases\nMaking mistakes\nballs\nballs (something) up\nblunder\nblunderingly\nbodge\nmaking\nmisdiagnose\nmisdiagnosis\nmisdirect\nmisdirection\nmisremember\nmisrender\nmisstate\nmistranscribe\nmistranscription\nnod\nstumblingly\nto err is human (to forgive divine). idiom\ntrip (someone) up\nunforced\nSee more results »\nRelated word\nmistakableIdiom\nbe no mistaking somethingPhrasal verb\nmistake someone/something for someone/something\nAdd to word list\nAdd to word list\nan action or decision that is wrong or produces a result that is not correct or not intended: We all make mistakes. [ + to infinitive ] It was a mistake to come to this restaurant without a reservation. by mistake\nBy mistake means unintentionally: I’m sorry – I must have dialed your number by mistake.\nto be wrong about or fail to recognize something or someone: [ T always + adv/prep ] I called Karen and mistook her mother for her (= I thought I was speaking to Karen when I was speaking to her mother)."}