{"id":230902,"name":"mitigation","type":"noun","us_sound":"ˌmɪt̬.əˈɡeɪ.ʃən","us_link":"../audio/m/usmisle028.mp3","uk_sound":"ˌmɪt.ɪˈɡeɪ.ʃən","uk_link":"../audio/m/ukmiste024.mp3","content":"Add to word list\nAdd to word list\nformal the act of reducing how harmful, unpleasant, or bad something is: effective mitigation of climate change There has been no significant increase in funding for flood mitigation works.\nlaw\n&#160; specialized something that causes you to judge a crime to be less serious, or to make a punishment less severe: \"I was very young at the time,\" he said in mitigation. His defence lawyers presented their mitigation plea. See\nmitigating\nMore examplesFewer examplesOur aim is the mitigation of risk.The best disaster mitigation is still a good warning system and a ban on building homes in risky areas.We must review current and proposed systems in order to determine potential risks and mitigation strategies.Design work on mitigation measures to slow the river's flow should already be under way.Evidence may be offered in mitigation of the punishment.She has behaved appallingly and no amount of mitigation (unhappy life, underachiever) changes that.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReasons and explanations\nNot punishing & reducing punishment\nAdd to word list\nAdd to word list\na reduction in how harmful, unpleasant, or bad something is: mitigation of sth The planning process should have addressed mitigation of damage to the environment.a mitigation plan/measure/project For every possible problem, there must be a mitigation measure in the plan.mitigation funds/grants/money The victims received federal aid in the form of disaster mitigation funds. mitigation costs/fees\nin mitigation\nLAW in order to try to make a crime seem less serious: The defence lawyer also said in mitigation that her client didn't personally profit from the collapse of the finance company."}