{"id":230978,"name":"mix","type":"verb","us_sound":"mɪks","us_link":"../audio/m/mix.mp3","uk_sound":"mɪks","uk_link":"../audio/m/ukmiste029.mp3","content":"mix verb\n(COMBINE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to (cause different substances to) combine, so that the result cannot easily be separated into its parts: Oil and water don't mix. Even if you shake them together they separate into two layers. Radioactive material was mixed in/up (with) the effluent. Mix the eggs into the flour. In a large bowl, mix together the sugar and raisins. [ + two objects ] Shall I mix (= make) you a cocktail?\nB1 [ T ] to have or do two or more things, such as activities or qualities, at the same time: Some people are happy to mix business with/and pleasure, but I'm not one of them.\nMore examplesFewer examplesCrack three eggs into a bowl and mix them together.Mash the potatoes and then mix in the butter and herbs.Pour the honey into the bowl and mix it thoroughly with the other ingredients.Wet the powder thoroughly and mix to remove lumps.Mash the bananas to a pulp and then mix in the yogurt.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\nchurn\ncrossed\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nmeld\nmethylate\nmingle\nmosaic\nmush\nsaturated solution\nscramble\nsynthesis\nSee more results »\nmix verb\n(BE WITH PEOPLE)\nB2 [ I ] to be with or communicate well with other people: Do you mix with a wide variety of people in your job? She mixes very well - I guess that's why she's so popular.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nbuild\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nspeak\nstrike\nSee more results »\nmix verb\n(RECORD MUSIC)\n[ T ]\n&#160; music, media\n&#160; specialized to control the amounts of various sounds that are combined on a recording\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nremix\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nIdioms\nbe mixed up with/in something\nmix your metaphors\nmix itPhrasal verbs\nmix someone/something up\nmix someone up\nmix something up\nmix noun\n(COMBINE)\nB1 [ C usually singular ] a combination: There was an odd mix of people at Patrick's party. \"She's studying physics and philosophy.\" \"That's an interesting mix.\"\n[ C or U ] something that is sold in the form of a powder to which a liquid, such as water, can be added later: cake/cement mix\nMore examplesFewer examplesThe earth's core is a hot, molten mix of iron and nickel.The factory's workforce reflects the ethnic mix from which it draws its labour.His choreography is described as 'a hybrid mix of mime and circus tricks'.Their music was a mix of old stuff and selections from the new album.The result was to further unbalance the monetary-fiscal policy mix and to push up the pound.\nSMART Vocabulary: related words and phrases\nVariety and mixtures\nall manner of something idiom\nalphabet soup\nassorted\nassortment\nbiodiverse\nhotchpotch\nhybridize\nhybridized\nit takes all sorts (to make a world) idiom\njumble\nnon-segregated\nodds and ends\nof every stripe/of all stripes idiom\npanoply\npatchwork\nsyncretism\nthis\nthis and that idiom\nvariety is the spice of life idiom\nvariously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: the state of matter\nmix noun\n(RECORD MUSIC)\n[ C ] a version of a recorded piece of music: A new mix of their hit single is due to be released early next month.\nSMART Vocabulary: related words and phrases\nSound and image recordings\naudiobook\nautotune\nB-side\nBlu-ray\nbox set\ncompact disc\nconcept album\njewel case\nLP\nMD\nMiniDisc\nmultitrack\nreissue\nsample\nsharpness\ntagging\ntalking head\nvideo clip\nVOD\nVR\nSee more results »\nmix verb\n(COMBINE)\nAdd to word list\nAdd to word list\n[ I/T ] to combine different substances, esp. so that the result cannot easily be separated into its parts, or to cause different substances to combine in this way: [ I ] Oil and water don’t mix. [ T ] Mix two eggs into the flour. [ T ] He mixed the blue paint with white to lighten it.\n[ I/T ] To mix is also to combine or put in the same place: [ T ] The report mixed together a lot of different ideas in a confusing way.\nmix verb\n(SOCIALIZE)\n[ I ] (of a person) to be comfortable being with or talking to other people in social situations, esp. people you do not know: She is very shy and has trouble mixing at parties. Phrasal verbs\nmix up someone/something\nmix up something\nmix noun [C/U]\n(COMBINE)\na combination of different things or people: [ C usually sing ] There was an interesting mix of people at Jean’s party.\nA mix is also a food substance that you can buy and to which a liquid, such as water or milk, can be added later when preparing to cook something: [ C ] a cake mix\nAdd to word list\nAdd to word list\n[ C ] a combination of different things or people: a mix of sth The board will continue to have the right mix of skills and experience to drive the company forward. The new property developments feature a mix of retail and residential uses. The money is invested in a diversified portfolio, a mix of real estate, stocks, and bonds. We use various fuel mixes to power our generating plants.\n[ S ] a situation which consists of several different things or people: in/into the mix But even if Internet ads are creeping into the mix, television is still their most important marketing medium.\n[ C or U ] something that is sold in the form of a powder and to which a liquid, such as water, can be added later: cake/cement mix The company chops and sells the nylon fabric to other firms that turn it into new carpet, cement mix, or sewer pipes.\nSee also\nadvertising mix\nasset mix\nbusiness mix\ninvestment mix\nthe marketing mix\nmerchandise mix\nportfolio mix\nproduct mix\nsales mix\n[ I, T ] to have or do two or more qualities, styles, activities, etc at the same time: She never mixes business with pleasure.\n[ I ] to meet and talk to other people, especially in a social situation: He was never very comfortable when it came to mixing with the senior staff. Phrasal verb\nmix sth/sb up"}