{"id":230991,"name":"mixed","type":"adjective","us_sound":"mɪkst","us_link":"../audio/m/mixed.mp3","uk_sound":"mɪkst","uk_link":"../audio/m/ukmiste030.mp3","content":"Add to word list\nAdd to word list\nshowing a mixture of different feelings or opinions: There has been a mixed reaction to the changes. The results are a little more mixed than we had hoped (= some are good but some are bad).\nincluding many different types of people or things: She has a very mixed group of friends.\nincluding both sexes: Our children go to a mixed school. Some of his jokes were too rude for mixed company (= a group where both males and females are present).\nincluding people of different religions or races: a mixed marriage\nSMART Vocabulary: related words and phrases\nVariety and mixtures\nall manner of something idiom\nalphabet soup\nassorted\nassortment\nbiodiverse\nhotchpotch\nhybridize\nhybridized\nit takes all sorts (to make a world) idiom\njumble\nodds and ends\nof every stripe/of all stripes idiom\npanoply\npatchwork\nplurality\npolycentric\nthis\nthis and that idiom\nvariety is the spice of life idiom\nvariously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: general words\nAdd to word list\nAdd to word list\ncombining positive and negative features: I have mixed emotions/feelings about moving across the country – it’s exciting, but I’ll miss my old friends.\nMixed can also mean combining people of different races or religions: The island’s population is of mixed descent.\nAdd to word list\nAdd to word list\nshowing a mixture of different results, opinions, or qualities: The country's overall economic performance last year was rather mixed. The President's tax plan received a mixed reaction on Wall Street. Government statistics offer a mixed picture of the economy's recovery.\na mixed bag\na range of things that differ in type or quality: The financial results, so far, are a mixed bag. a mixed bag of investment choices\na mixed development PROPERTY\n&#160; UK\na building project consisting of different types of buildings with different purposes or uses: This is a mixed development of shared ownership and rented homes now being built in Ilford, East London.\na mixed message/mixed messages\na set of statements that seem to say first one thing and then a different or opposite thing: send/give mixed messages It's frustrating when a manager sends mixed messages about an employee's performance."}