{"id":231216,"name":"mob","type":"noun","us_sound":"mɑːb","us_link":"../audio/m/mob.mp3","uk_sound":"mɒb","uk_link":"../audio/m/ukmixed019.mp3","content":"Add to word list\nAdd to word list\n[ C ] usually disapproving a large, angry crowd, especially one that could easily become violent: The angry mob outside the jail was/were ready to riot. a lynch mob 50 people were killed in three days of mob violence.\n[ C ] informal a group of people who are friends or who are similar in some way: The usual mob was/were hanging out at the bar.\n[ S ] informal an organization of criminals: a New York mob leader See also\nmobster mainly US\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGangsters, thugs & criminal organizations\n[ T usually passive ] to come together around someone in a crowd to express admiration, interest, or anger: They were mobbed by fans when they arrived at the theatre. Let's not go to that bar tonight - it's always mobbed (= there are always a lot of people there) on Fridays.\n[ I or T ] When birds or small animals mob a bigger or more frightening bird or animal that is hunting them, they attack it together and force it to go away.\nSMART Vocabulary: related words and phrases\nForming groups (of people)\nalienated\nbe ranged against/with something/someone\nclass reunion\ncluster\ncrowd\ncrowd around (someone/something)\nfederalization\nflock\nform\ngather\nincestuousness\nrally\nrange\nregather\nregroup\nreunion\nround\nround something/someone up\nthe assembled company\nthrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal (non-human) behaviour\nAdd to word list\nAdd to word list\na large group of people gathered together who are often uncontrollable or violent: He arrived at the airport to find a mob of adoring fans waiting for him.\nThe mob is also an organization of criminals, esp. the Mafia.\nto gather in a large group around someone to express admiration, interest, or anger: She was mobbed by her fans. The stores are always mobbed (= very crowded) on Saturdays."}