{"id":231248,"name":"mobility","type":"noun","us_sound":"moʊˈbɪl.ə.t̬i","us_link":"../audio/m/eus73051.mp3","uk_sound":"məʊˈbɪl.ə.ti","uk_link":"../audio/m/ukmixed021.mp3","content":"mobility noun [U]\n(ABILITY TO MOVE)\nAdd to word list\nAdd to word list\nthe ability to move freely or be easily moved: Some neck injuries cause total loss of mobility below the point of injury. I prefer the mobility of a hand-held camera. See also\nupward mobility (upwardly mobile)\nSMART Vocabulary: related words and phrases\nMovement\nambulatory\nbe treading water idiom\nbiodynamics\ncomings\ngestural\nlocomotion\nmobile\nmotile\nmotility\nmotion\nmovable\nmovably\nmovement\npassage\npull someone up short idiom\nrooted\nrooted to the spot idiom\nslithery\nsteadiness\nstillness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for movement\nmobility noun [U]\n(OF SERVICES)\nthe ability to have particular services available on a mobile phone, small computer, etc.: Consumers are demanding mobility, so that they can have access to information wherever they go.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncaller ID\ncell phone\ndevice\ndumbphone\nextension\nplatform\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nspeed dial\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nAdd to word list\nAdd to word list\nthe ability to move easily: Because of severe arthritis, her mobility was limited.\nAdd to word list\nAdd to word list\nECONOMICS the fact that it is easy for someone to change their situation, for example by doing different work, becoming part of a different social class, or moving to a different place: Some employment systems require more flexibility and mobility than others.class/social/economic mobility The government thinks higher education means more social mobility.upward/downward mobility Widespread upward mobility has meant that mobile phones and automobiles are considered normal purchases.\nthe fact that it is easy to move or transport something from one place to another, or to use it for a different purpose: I prefer the mobility of a handheld camera. In a world of capital mobility, bilateral trade figures don't really tell you very much.\nIT, COMMUNICATIONS, E-COMMERCE the ability to have particular services available on a phone or a computer used while travelling from place to place, without being connected by wires: Consumers are demanding mobility, so that they can have access to information wherever they are.\nCompare\nimmobilitySee also\nlabour mobility"}