{"id":231235,"name":"mobile","type":"adjective","us_sound":"ˈmoʊ.bəl","us_link":"../audio/m/mobile_01_00.mp3","uk_sound":"ˈməʊ.baɪl","uk_link":"../audio/m/ukmixed020.mp3","content":"mobile adjective\n(MOVING)\nAdd to word list\nAdd to word list\n[ not usually before noun ] moving or walking around freely: You've broken your ankle but you'll be fully mobile within a couple of months. It's important to keep the joint mobile while it heals.\nable to be moved from one place to another: He uses a mobile laboratory. a mobile medical unit\nMore examplesFewer examplesIt will be months before he is mobile again.He uses a mobile laboratory.The equipment is not really mobile.We have family ties, so we're not very mobile.She works for a mobile unit of doctors.\nSMART Vocabulary: related words and phrases\nMovement\nambulatory\nbe treading water idiom\nbiodynamics\ncomings\nfloating\ngestural\nlocomotion\nmobility\nmotile\nmotility\nmotion\nmovable\nmovement\npassage\npull\npull someone up short idiom\nrooted\nrooted to the spot idiom\nslithery\nsteadiness\nSee more results »\nmobile adjective\n(TECHNOLOGY)\nused to describe a service available on a mobile phone, small computer, etc.: mobile computing\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncall box\ncell phone\ndevice\ndumbphone\nextension\nmouthpiece\nphablet\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nmobile noun [C]\n(PHONE)\nA1 mainly UK (US usually cell phone) a\nmobile phone\na\nmobile number : My mobile's 07796 10253.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncall box\ncell phone\ndevice\ndumbphone\nextension\nmouthpiece\nphablet\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - by telephone\nmobile noun [C]\n(DECORATION)\na decoration or work of art that has many parts that move freely in the air, for example hanging from threads\nDaniel Box - dbox.us/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nCrafts\nartificer\nartisan\nartisanal\narts and crafts\nartsy-craftsy\ncrafty\ncrochet\ndécoupage\nemboss\nengrave\nhandcrafted\nhandicraft\nhandiwork\ninlay\nintarsia\nscreen printing\nsilkscreen\nstraw\ntjanting tool\ntritik\nSee more results »\nAdd to word list\nAdd to word list\nable to move easily or be easily moved: The Marines are a highly mobile force and can get anywhere fast.\na decoration or work of art that has parts that move in the air, often because each one is hung by a thread: We hung a mobile over the baby’s crib, and she loves to look at it when it moves.\nAdd to word list\nAdd to word list\nECONOMICS able or free to change your situation, for example by doing different work, becoming part of a different social class, or moving to a different place: It is one of the least socially mobile countries in Europe. With traditional employment contracts, companies benefit from a cheaper, less mobile workforce.\nable to move or be transported easily from one place to another, or be used for a different purpose: Our master network center is fully mobile in case of emergency. Forty years ago, manufacturing reigned supreme and capital wasn't mobile.\nIT, COMMUNICATIONS related to a service available on a phone or computer used while travelling from place to place, without being connected by wires: Over half of the country's e-commerce is now conducted on mobile devices.mobile computing/network/telephony We are building the new system to address the increasing use of mobile computing devices.\nSee also\nupwardly mobile\na mobile phone: He left his mobile on the train. Let me give you my mobile number.on/from a mobile I think she was calling from her mobile.mobile handset/network/unit The mobile handset will be the first to use the new operating system.mobile charges/sales Your mobile charges will be higher if you call from abroad.mobile company/maker/operator Mobile operators are fighting to be the leader of the handheld computing revolution."}