{"id":231373,"name":"moderator","type":"noun","us_sound":"ˈmɑː.də.reɪ.t̬ɚ","us_link":"../audio/m/moderator.mp3","uk_sound":"ˈmɒd.ər.eɪ.tər","uk_link":"../audio/m/ukmocki017.mp3","content":"Add to word list\nAdd to word list\nsomeone who tries to help other people come to an agreement: An independent moderator should be appointed to oversee the negotiations. Compare\nmediator\nmainly US someone who makes certain that a formal discussion happens without problems and follows the rules: He challenged the president to a series of TV debates. Just the two of them, with no moderator.\neducation\n&#160; UK specialized someone who makes certain that all the people marking an examination use the same standards: The final marks awarded for coursework will depend upon the moderator.\ninternet &amp; telecoms someone who makes sure that the rules of an internet discussion are not broken, for example by removing any threatening or offensive messages\nSMART Vocabulary: related words and phrases\nInternational relations: diplomacy & mediation\nambassador\nambassadorial\nappease\nappeasement\nattaché\ndiplomatic\ndiplomatic bag\ndiplomatic corps\ndiplomatic immunity\ndiplomatic relations\nintercede\nintermediary\nintermediation\ninternationalist\ninterventionism\nlegation\nplenipotentiary\nshuttle diplomacy\nundiplomatic\nundiplomatically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who analyse and judge\nInternet terminology\nmoderator noun [C]\n(SUBSTANCE)\nAdd to word list\nAdd to word list\nphysics a substance that slows neutrons in a nuclear reactor\nmoderator noun [C]\n(MANAGER)\nthe manager of a public discussion: The moderator allowed each side two minutes to sum up at the end of the televised debate.\nAdd to word list\nAdd to word list\nsomeone who controls and leads a discussion between a group of people, but does not take any side in it: A panel of business people will ask the candidates questions, with a local journalist as moderator. Compare\nmediator\nINTERNET someone who makes sure that the rules of an internet discussion are not broken, for example by removing any threatening or offensive comments: She began posting on the message board and was later asked to be a moderator."}