{"id":231413,"name":"modestly","type":"adverb","us_sound":"ˈmɑː.dɪst.li","us_link":"../audio/m/modestly.mp3","uk_sound":"ˈmɒd.ɪst.li","uk_link":"../audio/m/ukmocki026.mp3","content":"modestly adverb\n(NOT MUCH/VERY)\nAdd to word list\nAdd to word list\nC1 in a way that is not very large in size, amount or degree, or not expensive: At just £10, the tickets are very modestly priced. Prices rose modestly in the first quarter. He had a modestly successful career as an artist.\nMore examplesFewer examplesThough tax cuts may modestly increase private saving, they will substantially reduce public saving by swelling the deficit.To his disappointment, the book sold only modestly.Starter homes and modestly priced properties are attracting a lot of young families to the area.Her parents were schoolteachers who lived modestly on their small salaries.\nSMART Vocabulary: related words and phrases\nSmall\nbaby\nbijou\nbite-sized\nclaustrophobically\ncompactly\ndwarf\nmidget\nminiaturized\nmissy\nmodest\nno/not enough room to swing a cat idiom\non the large, small, etc. side idiom\nparsimonious\nsampler\nscaled-down\nscrubby\nshoe box\nshrunken\nskimpily\nwee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSmall in number and quantity\nCosting little or no money\nmodestly adverb\n(BEHAVIOUR)\nin a way that shows you do not like to talk about or make obvious your own abilities and achievements: He modestly discourages any talk of him winning a Nobel Prize. \"I'm no better than any other player on the team,\" she says modestly.\nMore examplesFewer examples\"I just happened to get hold of the ball,\" he recalls, modestly.\"This is really good pie,\" he said. \"You like it?\" Marcia asked modestly. They led him into a huge hall which they modestly called the Small Chamber. The new look was really striking and Betty was modestly delighted with her transformation.\nSMART Vocabulary: related words and phrases\nShy and modest\naw shucks\nbackward\nbashful\nbashfully\nbashfulness\ndeprecating\nhumility\ninadequacy\ninadequate\ninhibited\ninhibition\nmousy\nself-conscious\nself-consciously\nself-consciousness\nself-deprecating\nself-deprecatingly\nunassuming\nwallflower\nwithdrawn\nSee more results »\nmodestly adverb\n(DRESS)\nin a way that avoids showing too much of the body or attracting sexual interest: She was dressed modestly.\nMore examplesFewer examplesWe remind visitors to the temple that we like people to dress modestly, which means, for example, no shorts.\"I don't think you should be allowed to fly in a swimsuit. I believe people should dress modestly in public,\" he said.She wore her skirts modestly long.Billboards show women modestly veiled.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nribbed\nribby\nruche\nruched\nruck (something) up\nvoop neck\nwaisted\nwashable\nwasp waist\nwasp-waisted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShy and modest\nmodestly adverb\n(IN A NOT LARGE MANNER)\nAdd to word list\nAdd to word list\nin a size or amount that is not large or with a value that is not great: He lives in a modestly furnished apartment.\nmodestly adverb\n(SUCCESSFULLY BUT QUIETLY)\nwith a tendency to not talk about or make obvious your own abilities and achievements: She spoke modestly about her work.\nmodestly adverb\n(CORRECTLY)\nwith behavior and clothes that are correct or socially acceptable and represent traditional values: She was modestly dressed in a full-length skirt."}