{"id":231424,"name":"modify","type":"verb","us_sound":"ˈmɑː.də.faɪ","us_link":"../audio/m/modify.mp3","uk_sound":"ˈmɒd.ɪ.faɪ","uk_link":"../audio/m/ukmodif001.mp3","content":"modify verb [T]\n(CHANGE)\nAdd to word list\nAdd to word list\nC1 to change something such as a plan, opinion, law, or way of behaviour slightly, usually to improve it or make it more acceptable: Instead of simply punishing them, the system encourages offenders to modify their behaviour. The proposals were unpopular and were only accepted in a modified form.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npliantly\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nunadapted\nunamended\nwrite someone out of something\nZelig\nSee more results »\nmodify verb [T]\n(LANGUAGE)\nlanguage\n&#160; specialized If a word or phrase modifies another word or phrase used with it, it limits or adds to its meaning: In the sentence \"She ran quickly\" the adverb \"quickly\" modifies the verb \"ran\".\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nmodify verb [T]\n(CHANGE)\nAdd to word list\nAdd to word list\nto change something slightly, esp. to improve it or make it more acceptable or less extreme: The school board decided to modify its existing employment policy.\nmodify verb [T]\n(GRAMMAR)\ngrammar to limit or add to the meaning of a word or phrase\nAdd to word list\nAdd to word list\nto slightly change something such as a plan, method, or law, usually to improve it or make it more acceptable: All files are marked with the date and time they were last modified. We modified some of the wording in the second version. Instead of sending them away without an answer, the system encourages users to modify their search.\nto make changes to something such as a vehicle, machine, or tool, so that it can be used for a different purpose or in a different way: It is possible to modify the keyboard to suit the individual user. Compare\nadapt"}