{"id":231463,"name":"modular","type":"adjective","us_sound":"ˈmɑː.dʒə.lɚ","us_link":"../audio/m/modular.mp3","uk_sound":"ˈmɒdʒ.ə.lər","uk_link":"../audio/m/ukmodif004.mp3","content":"Add to word list\nAdd to word list\nconsisting of separate parts that, when combined, form a complete whole: modular furniture Modular classrooms were built to remedy the problem of overcrowding in schools.\nconsisting of several units that together make a complete course, taught especially at a British college or university: Many colleges and universities now offer modular degree courses. See\nmodule\nMore examplesFewer examplesModular shelving can be configured for anything from a desktop computer to a whole data centre.The modular design allows for the building to eventually accommodate 600 studentsMaria recently began a modular degree course.UK The introduction in 1992 of new-style modular maths A-levels, involving regular assessment, had led to students being asked shorter, less demanding questions.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\nmulti-component\npanel\npiece\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nsubsegment\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nAdd to word list\nAdd to word list\nmade from a set of separate parts that can be joined together to form a larger object: modular homes modular classrooms\nAdd to word list\nAdd to word list\nmade of several parts that can be put together in different ways: modular furniture/software/system A modular system allows six different configurations of just two key components. modular architecture/design\nPRODUCTION used to describe a method of manufacturing in which the process is separated into parts that can be done in a different order or in different places: modular manufacturing/production He wants to integrate modular manufacturing into the entire company to produce products such as clocks for cars."}