{"id":231475,"name":"modulation","type":"noun","us_sound":"ˌmɑː.dʒəˈleɪ.ʃən","us_link":"../audio/m/usmixed029.mp3","uk_sound":"ˌmɒdʒ.əˈleɪ.ʃən","uk_link":"../audio/m/ukmodif006.mp3","content":"modulation noun\n(CHANGE)\nAdd to word list\nAdd to word list\n[ C or U ] a change in the style, loudness, etc. of something such as your voice in order to achieve an effect or express an emotion: The Minister has evidently practised the modulation of her voice. The actors sit on stools and present the script and character through intonation and other voice modulations.\n[ C or U ] a small change that happens in response to something or is intended to achieve an effect: A surreal, nightmarish atmosphere is created in the film by constant modulations of colouring of the light. His performance is exceptional in its intensity and subtle modulation.\n[ U ]\n&#160; biology\n&#160; specialized the ability to control, influence or change a particular physical process: This area of the brain is involved in the modulation of emotional behaviour. The proteinase inhibitor function has been associated with modulation of cell growth.\nMore examplesFewer examplesMethods of positive social reinforcement include positive voice modulation, facial expression, and verbal praise.She's got a keen eye for the finest little modulations of human behaviour.Where babies sleep in the same room as their mothers, sleep patterns might be different, effecting subtle modulations to physiological responses.To me, oil paint seems like a living organism: infinite modulations and transformations are possible.THC is involved with appetite and the modulation of pain. These phytochemicals are involved in many mechanisms including modulation of cholesterol synthesis and hormone metabolism.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\nfluent\nintone\nnon-verbally\northoepy\nparalanguage\nplummy\npragmatics\npronounce\nprosodic\nsingsong\ntoned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nChange and changes\nAnimal & plant biology - general words\nCells\nmodulation noun\n(MUSIC)\n[ C or U ]\n&#160; music\n&#160; specialized a change from one musical key to another: the composer's use of modulation It is best to write what sounds smooth and natural, so we should forget about modulations to far-distant keys (e. g. C to F).\nMore examplesFewer examplesPerhaps the most striking song here is Da lieg' ich unter den Bäumen, with its change from major to minor and a welcome unexpected modulation.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nmodulation noun\n(SIGNALS)\n[ C or U ]\n&#160; media, physics\n&#160; specialized the process of changing the amplitude or frequency of an electrical signal by mixing it with another signal, or a signal that has been changed like this: With traditional radar, the modulation and frequency of the signal can be fine-tuned to produce the easiest-to-read echo.\nMore examplesFewer examplesArmstrong solved the static problem in 1933 with frequency modulation - a way to increase the bandwidth of the radio signal and suppress interference from other energy currents.Kanzius designed a complex transmitter that could focus radio waves of different modulations and multiple frequencies on tumors.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nsyndicated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: energy, force & power"}