{"id":231685,"name":"molar","type":"noun","us_sound":"ˈmoʊ.lɚ","us_link":"../audio/m/molar.mp3","uk_sound":"ˈməʊ.lər","uk_link":"../audio/m/ukmodif024.mp3","content":"Add to word list\nAdd to word list\none of the large teeth at the back of the mouth in humans and some other animals used for crushing and chewing food: I was having some pain in my upper right molar. Dental sealant can be painted on the molars and premolars to prevent tooth decay. Compare\ncanine noun (TOOTH)\nincisor\ngaetan stoffel/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe molars were decayed to the gums.At this time the four adult front teeth and the adult first molars have usually erupted. Replacing missing molars with false teeth may have a cosmetic benefit but there is no health gain.\nSMART Vocabulary: related words and phrases\nThe teeth\nbaby tooth\nbuck-toothed\ncanine\ncentric\nchopper\ncoronal\ndentine\ndenture\nenamel\neruption\neyetooth\nincisor\nmilk tooth\noverbite\npearly whites\nperiodontal\npremolar\nprognathism\npulp cavity\nunderbite\nSee more results »\n(of a liquid) containing one mole of a substance dissolved in each litre of liquid: A solution with a concentration of 1 mol/L is said to be 1 molar. A 0.1 molar solution of baking soda has a pH of around 8.3.\nMore examplesFewer examplesA molar solution is defined as an aqueous solution that contains 1 mole (gram-molecular weight) of a compound dissolved in 1 litre of a solution.For a 1/6 molar solution of sodium thiosulfate, use 4.14 g of sodium thiosulfate per 100 ml of sterile water.\nSMART Vocabulary: related words and phrases\nMiscellaneous units of measurement\nacre\nacreage\ncaloric\ncurie\ndioptre\nfarad\nfathom\nfirkin\nflashpoint\nhectare\nHz\njoule\nMHz\nnewton\nradian\nrefractive index\nScoville scale\nsievert\ntorr\nwatt\nSee more results »\nmolar adjective [not gradable]\n(FOUND IN A LIQUID)\nAdd to word list\nAdd to word list\nchemistry containing one mole of a substance in each liter of a liquid\nmolar noun [C]\n(TOOTH)\nany of the large teeth at the back of the mouth, used for crushing and chewing food"}