{"id":231923,"name":"moment","type":"noun","us_sound":"ˈmoʊ.mənt","us_link":"../audio/m/moment.mp3","uk_sound":"ˈməʊ.mənt","uk_link":"../audio/m/ukmoldo020.mp3","content":"moment noun\n(SHORT TIME)\nAdd to word list\nAdd to word list\nA2 [ C ] a very short period of time: Can you wait a moment? I'll be ready in just a moment. A car drew up outside and a few moments later the doorbell rang. I'm expecting her to come at any moment (= very soon). Have you got a moment (= are you busy or do you have time to speak to me)?\nMore examplesFewer examplesThe falcon seemed to hang in the air for a moment before diving onto its prey.If you'd like to take a seat, Mr Chang will be with you in a moment.Could you mind my bag for a moment while I go to the toilet?He paused and thought for a moment.Could you check this letter for me before I post it - it will only take a moment.\nSMART Vocabulary: related words and phrases\nShort in time\nabbreviated\nat a moment's/two hours'/three weeks', etc. notice idiom\nawhile\nbe short notice idiom\nbite-sized\nblink\nbout\nbrief\nbriefly\ndose\nin abbreviated form\nin small doses idiom\nin the blink of an eye idiom\ninstant\njiffy\nshortness\nsnatched\nsplit second\ntransient\ntransiently\nSee more results »\nmoment noun\n(OCCASION)\nB1 [ C ] a particular time or occasion: When would be the best moment to tell the family? Don't leave it to/till the last moment (= the latest time possible). If you want a private conversation with her you'll have to choose your moment (= find a suitable time). The moment (that) (= as soon as) I get the money I'll send the ticket. at the moment\nA2 now: Sorry, she's not here at the moment.\nSee more for the moment\nB2 If you do something for the moment, you are doing it now, but might do something different in the future: Let's keep doing what we agreed for the moment.\nSee more at this moment in time formal\nnow: I can give no information at this precise moment in time.\nSee more\nMore examplesFewer examplesIs Michelle all right? She doesn't seem quite herself at the moment.She's on the phone to him at this very moment actually.In an indiscreet moment, the president let his genuine opinions be known.I'm sorry, you've called at rather an awkward moment.Would this be a good moment to bring up the subject of money?\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\noccasion\none\nposterior\nthe last minute idiom\ntime\nunder the wire idiom\nwire\nSee more results »\nmoment noun\n(IMPORTANCE)\nof (great) moment formal\nvery important: a decision of great moment\nSee more\nIdioms\nbe having a moment\nhave your/its moments\nthe moment of truth\na moment of weakness\nnot a moment too soon\nnot for a moment\nof the moment\nmoment noun [C]\n(SHORT TIME)\nAdd to word list\nAdd to word list\na very short period of time: Hold still for a moment while I tie your shoe. I’ll be ready in just a moment.\nmoment noun [C]\n(OCCASION)\na particular time or occasion: I’m waiting for the right moment to tell her the good news. Just at that moment, the phone rang. Are you staying with your mother at the moment (= now)?\nA moment is also a special time or opportunity: You know that when that curtain goes up, it’s going to be your big moment. momentary adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈmoʊ·mənˌter·i/\nThere was a momentary lull in the conversation."}