{"id":231944,"name":"momentum","type":"noun","us_sound":"məˈmen.t̬əm","us_link":"../audio/m/eus73063.mp3","uk_sound":"məˈmen.təm","uk_link":"../audio/m/ukmoldo026.mp3","content":"Add to word list\nAdd to word list\nC2 physics\n&#160; specialized the force that keeps an object moving: Once you push it, it keeps going under its own momentum. The spacecraft will fly around the earth to gain/gather momentum for its trip to Jupiter.\nthe quality that keeps an event developing or making progress after it has started: The play loses momentum (= becomes less interesting, energetic, etc.) by its half way stage. In an attempt to give new momentum to their plans, the committee set a date for starting detailed discussions.\nMore examplesFewer examplesWe got up the hill through sheer momentum.The campaign has been gaining momentum ever since the television appeal.Opposition to the tax has been gaining momentum.The campaign for an elected mayor seems to have lost momentum.\nSMART Vocabulary: related words and phrases\nPhysics: particular theories & concepts\naphelion\nazimuth\nconservation\ncryogenics\ndark matter\nDoppler effect\ndynamics\nelement\nkinetics\nlibration\nperihelion\nPlanck's constant\nquantum\nrefraction\nrelativistic\nrelativity\nspatio-temporal\nspring constant\ntime dilation\nwormhole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpeed of motion\nContinue & last\nAdd to word list\nAdd to word list\nphysics the force or speed of an object in motion, or the increase in the rate of development of a process: A falling object gains momentum as it falls. Technology seems to create its own momentum – if something can be done, it will be.\nAdd to word list\nAdd to word list\nthe force that keeps an object moving or keeps an event developing after it has started: gain/pick up/gather momentum Stocks gained momentum on strong quarterly reports across the tech world. There is worrying evidence that the economy is losing momentum.build/increase/add momentum We continue to build momentum in our quest to grow our businesses. Election of business oriented leaders gave momentum to new downtown redevelopment. upward/forward/downward momentum business/economic/political momentum"}