{"id":232122,"name":"money","type":"noun","us_sound":"ˈmʌn.i","us_link":"../audio/m/money.mp3","uk_sound":"ˈmʌn.i","uk_link":"../audio/m/ukmonac015.mp3","content":"Add to word list\nAdd to word list\nA1 coins or notes (= special pieces of paper) that are used to buy things, or an amount of these that a person has: \"How much money do you have on you?\" \"€100 in notes and a few coins.\" We invested the money in a high-interest bank account. I wanted to buy it but it cost too much money (= was too expensive). We spent so much money redecorating the house that we didn't have any left over for a holiday. You'll have to change some money (= buy some foreign money) at the bank. How much money do you earn? He enjoyed acting but he wasn't making (= earning) much money. Her investments haven't made (= produced as profit) much money this year. They made their money (= became rich) in the fashion business. He tried to persuade me to put money into the company (= invest in the company). The school needs to raise (= collect) money for new playground equipment. Try to save (= keep) some money for your holiday. We're saving (= not spending as much) money by using volunteers. I didn't like the job, but the money (= amount of pay) was good. Money is tight/short (= we don't have much money) at the moment. I had some very expensive dental treatment recently, but it was money well spent - it'll save me problems in the future.\nDGP&amp;C/The Image Bank/GettyImages money in something\nIf you say that there is money in something, you mean that the activity will produce a profit: There's money in sport these days.\nSee more\nMore examplesFewer examplesEveryone in the office is contributing money for his leaving present.They've already run out of money and the building isn't even half-finished .We're really struggling to find enough money to pay the rent at the moment.Many buildings in the old part of the city are falling down, and the government has no money to repair them.The organization has enlisted the support of many famous people in raising money to help homeless children.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\nfinance\ninterest\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nprincipal\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPayment methods\nIdioms\nbe in the money\nbe made of money\nfor my money\nget/have your money's worth\nhave money\nhave money to burn\nin the money\nmarry money\nmoney doesn't grow on trees\nmoney for old rope\nMore idioms\nmoney talks\nmore money than sense\n(right) on the money\nput (your) money on someone/something\nput your money where your mouth is\nAdd to word list\nAdd to word list\nthe coins or bills with their value on them that are used to buy things, or the total amount of these that someone has: I need a dollar – have you got any money on you? There’s not much money in our savings account. We spent a lot of money redecorating the house. I save money on groceries by using coupons. He makes a lot of money as a contractor. The job wasn’t exciting, but the money (= amount of pay) was good. Idioms\nmoney talks\n(right) on the money\nAdd to word list\nAdd to word list\n[ U ] the value of what a person or organization owns, keeps in a bank, has in investments, or spends: His estate is worth a lot of money. She makes more money than he does. Publishers earn money from their content.lose/spend/waste money We waste money on plants and decorations that we could be spending on salaries.borrow/lend/save money Lending money is a way to ensure that you get a say in how the borrower runs his business.pour/pump/put money into sth Pumping more money into the company isn't going to make customers want the product.donate/invest/raise money Donate money now to make a difference in your community.\n[ U ] the coins or paper currency which can be used to buy things: He used to keep his money under the mattress. Patrons threw money into the fountain.\nmonies [ plural ] (also moneys)\nLAW different amounts of money taken together: He made a mistake by mixing clients' monies with the monies from his construction company.\nat the money\nFINANCE options (= agreements to buy or sell particular shares, etc. in the future) are at the money when they could be used to buy or sell shares without making a profit or a loss: The options sold at the money.\nin the money\nFINANCE options are in the money when they could be used to buy or sell shares for a profit: In traditional stock option plans, unless options are in the money, they are not exercised.\ninformal having a lot of money: It's not just the oil companies that are in the money: high oil prices boost government revenue.\nout of the money\nFINANCE options are out of the money when they would make a loss if they were used to buy or sell shares: With the shares currently trading at $50.53, however, these calls are out of the money.\nmake money\nto earn a lot of money from a job or an investment: Making money is the only reason I work on Wall Street.\nbe/pour/throw, etc. money down the drain\nto waste money: In propping up these industries, is the government throwing taxpayers' money down the drain?\nmake/lose money hand over fist\nto make or lose a lot of money very quickly: Like many Internet companies, they lost money hand over fist at first.\nsb's money is on sb/sth\nused to say that someone strongly believes that a particular thing is likely to happen or a particular person is likely to be the one to do something: My money is on the bond markets getting it right.\nthe smart/clever money is on sb/sth\nused to say that people who know a lot about a situation strongly believe that a particular thing is likely to happen or a particular person is likely to be the one to do something: One airline has already filed for bankruptcy protection, and the smart money is on others joining them soon.\nmoney talks\nused to say that money influences people, or that people with money tend to be listened to: Money talks in politics.\nthere's money in sth\nused to say that an activity will produce a profit: There's a lot of money in electronics. If you take this car to Texas, there's money in it for you. See also\napplication money\nbroad money\ncaution money\ncheap money\nconduct money\ndanger money\ndear money\ndeposit money\neasy money\ne-money\nView all\nfresh money\nfront money\nfunny money\nhot money\nhush money\nidle money\nkey money\nnarrow money\nnear money\nnew money\nold money\none-month money\none-year money\npaper money\nseed money\nspending money"}