{"id":232299,"name":"monitor","type":"noun","us_sound":"ˈmɑː.nə.t̬ɚ","us_link":"../audio/m/eus75838.mp3","uk_sound":"ˈmɒn.ɪ.tər","uk_link":"../audio/m/ukmonac030.mp3","content":"monitor noun [C]\n(PERSON WHO WATCHES)\nAdd to word list\nAdd to word list\nB2 a person who has the job of watching or noticing particular things: United Nations monitors were not allowed to enter the area.\nMore examplesFewer examplesRosie was chosen to be monitor in class that day.They are employed as monitors to make sure that the organization works within the law.International monitors are keeping watch on the election process.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who analyse and judge\nmonitor noun [C]\n(TESTING MACHINE)\na machine that regularly tests something: a radiation monitor\namadeusamse/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nmonitor noun [C]\n(SCREEN)\nB2 a computer screen or a device with a screen on which words or pictures can be shown: a computer monitor a TV monitor Doctors watched the old man's heartbeat on a monitor.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - parts\nmonitor noun [C]\n(AT SCHOOL)\na child in school who has special jobs to do: the library monitor\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\nmonitor noun [C]\n(REPTILE)\na\nmonitor lizard\nC1 to watch and check a situation carefully for a period of time in order to discover something about it: The new findings suggest that women ought to monitor their cholesterol levels. The CIA were monitoring (= secretly listening to) his phone calls.\nMore examplesFewer examplesA 1200-strong military force will be on hand to monitor the ceasefire.We need to monitor the transaction of smaller deals.They'll use ultrasound to monitor her ovaries to see if they're responding to the treatment.The babies in this unit have various devices attached to them that monitor the vital signs.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nmonitor noun [C]\n(SCREEN)\nAdd to word list\nAdd to word list\na device with a screen on which words or pictures can be shown: a computer monitor\nmonitor noun [C]\n(WATCHER)\na person who has the job of watching or checking particular things, or a machine that regularly tests or records things: United Nations monitors were prevented from entering the area. A fetal monitor records an unborn baby’s heartbeat.\nIn school, a monitor is a student with special duties who helps the teacher: the attendance monitor\nmonitor verb [T]\n(WATCH)\nto watch and check something carefully over a period of time: They hired an accountant to help monitor cash flow. The nurse is monitoring his heart rate and respiration.\nAdd to word list\nAdd to word list\nIT a computer screen: Adjust your monitor if the colour does not appear quite right.\nLAW a person or organization whose job is to make certain that something is done properly or honestly: The process will be watched closely during the next three years by an independent monitor.\nIT a machine that regularly watches or tests and records something: The acoustical monitor will collect real-time data and filter out non-whale noises. a surveillance monitor a blood pressure/heart monitor\nto watch a situation carefully for a period of time in order to discover something about it: The government had agreed to allow the inspectors to monitor the refuelling process. Police froze his bank accounts and monitored his ATM card in case he tried to make a transaction. Comings and goings are monitored by security cameras."}