{"id":232858,"name":"monopoly","type":"noun","us_sound":"məˈnɑː.pəl.i","us_link":"../audio/m/monopoly.mp3","uk_sound":"məˈnɒp.əl.i","uk_link":"../audio/m/ukmonk_024.mp3","content":"Add to word list\nAdd to word list\nC2 (an organization or group that has) complete control of something, especially an area of business, so that others have no share: The government is determined to protect its tobacco monopoly. Is Microsoft a monopoly? The drafting of a new constitution cannot be a monopoly of the white minority regime (= other people should do it too). He does not have a/the monopoly on (= he is not the only one who has) good looks.\nMore examplesFewer examplesThe government has a monopoly on rail travel.There are laws to stop companies becoming monopolies.She doesn't have the monopoly on suffering, you know.\nSMART Vocabulary: related words and phrases\nMergers & acquisitions\nacqui-hire\nacquirable\nacquire\nacquisition\nacquisitive\nbuy someone out\nbuyout\nconglomerate\ncounterattack\ndenationalization\ndenationalize\nfire sale\nhive\nhostile\nleveraged buyout\nmonopolize\nnon-hostile\noligopoly\nparent\nparent company\nSee more results »\nRelated word\nmonopolistic\nAdd to word list\nAdd to word list\nsocial studies complete control of the supply of particular goods or services, or a company or group that has such control: The Postal Service is guaranteed a monopoly on all first-class letters. fig. California has no monopoly on strangeness (= is not the only strange place). monopolistic adjective us\nYour browser doesn't support HTML5 audio\n/məˌnɑp·əˈlɪs·tɪk/\na monopolistic system\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; ECONOMICS a situation in which one company or person or a government has no competition in the sale of a particular product or service and is able to control its supply and price: business/corporate/government monopolies He argues that farm subsidies help keep agricultural land away from corporate monopolies.a monopoly of sth Each firm has a monopoly of goods that tend to be used together.a monopoly in/on sth A decision by the Supreme Court struck down the state's monopoly on radio and television stations.\n[ C ]\n&#160; ECONOMICS a company, person, etc. that is the only one supplying a particular product or service: The Justice Department is suing the company because they claim that it used unfair tactics to become a monopoly.\n[ C ] something that is controlled by one person or group and not shared by others: The network is a monopoly of the state telephone company.\nSee also\nbilateral monopoly\ncommercial monopoly\nlegal monopoly\nnatural monopoly\npublic monopoly\nstate monopoly"}