{"id":232519,"name":"monocular","type":"adjective","us_sound":"məˈnɑː.kjʊ.lɚ","us_link":"../audio/m/cdo1121usmono2844.mp3","uk_sound":"məˈnɒk.jʊ.lər","uk_link":"../audio/m/cdo1121ukmono2498.mp3","content":"Add to word list\nAdd to word list\nfor, using, or relating to one eye: The images you see are only half as bright as they would be with a traditional monocular eyepiece. Binoculars or clip-on monocular telescopes are conventionally used to observe sporting events or for bird watching. Compare\nbinocular\nMore examplesFewer examplesEye examinations with a tool called a monocular direct ophthalmoscope are used to detect damage to the retina.Most patients adapt well to their monocular status within a few months.Transient monocular blindness is associated with an increased risk of subsequent stroke.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\ngoggles\nmacular degeneration\nmultifocal\nmyopically\nnaked\nnearsighted\nnearsightedly\nocular\nophthalmology\nsightless\nsnow blindness\nsty\nSee more results »\na tube with a glass lens (= a curved piece of glass, plastic, or other transparent material) at either end that you look through to see things that are far away more clearly: He watches television, mostly sports, with a monocular. There's also a waterproof nocturnal monocular for watching in the dark. Compare\nbinoculars\nMore examplesFewer examplesThey make night vision goggles and monoculars.According to the company, using the Eye-Trek Monocular is akin to looking at images on a 10-inch monitor.Hand-held monoculars, telescopic lenses mounted over eye glasses, video enlargement machines, and other types of magnifiers may help some people with albinism.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\nlaser\nlens\nmagnification\nmagnify\nmagnifying glass\nopera glasses\noptics\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nrefracting telescope\nSee more results »"}