{"id":233281,"name":"mood","type":"noun","us_sound":"muːd","us_link":"../audio/m/mood.mp3","uk_sound":"muːd","uk_link":"../audio/m/ukmonot024.mp3","content":"Add to word list\nAdd to word list\nB1 the way you feel at a particular time: She's in a good/bad mood. Her mood seemed to change during the course of the conversation. The drink had put him in an amiable mood. The public mood changed dramatically after the bombing. The mood of the crowd suddenly turned (= the crowd suddenly became) aggressive.\nThesaurus: synonyms, antonyms, and examples\nfeeling or showing pleasurehappyI'm much happier in my new job.cheerfulShe's always very cheerful.in a good moodYou're in a good mood this morning!pleasedHe was pleased that she had come back.gladI was so glad to see her.\nSee more results »\nMore examplesFewer examplesHis mood swings between elation and despair.Why are you in such a foul mood this morning?The prime minister was in defiant mood in the House of Commons yesterday.His moods are very changeable.Oh, just stop it Alex, I'm really not in the mood for your jokes.\nSMART Vocabulary: related words and phrases\nMoods\n-humoured\nbe in one of your moods idiom\nblack mood\neat\nframe\nmind\nmoodily\nsomeone's state/frame of mind idiom\nstrop\nsuck\nsucking diesel idiom\nsulk\ntemperament\ntemperamentally\ntemperature\ntone\nup and down idiom\nvolatility\nwhat's eating someone? idiom\nyourself\nSee more results »\nIdioms\nbe in a mood\nbe in a mood for something/to do something\nbe in no mood for something/to do something\nbe in one of your moods\nbe in the mood (for something/to do something)\nmood noun [C]\n(FEELING)\nAdd to word list\nAdd to word list\nthe way you feel at a particular time: She’s in a good/bad mood today. \"Do you want to go to the movies?\" \"No, I’m not in the mood (= not interested in that).\"\nart The mood of a work of art is the emotional features of it, or the way it makes you feel.\nmood noun [C]\n(GRAMMAR)\ngrammar the forms of verbs used to show whether the person speaking intends to express a fact, an order, or a hope: the indicative/imperative/subjunctive mood"}