{"id":233400,"name":"moonshot","type":"noun","us_sound":"ˈmuːn.ʃɑːt","us_link":"../audio/m/cdo0318usmoon3112.mp3","uk_sound":"ˈmuːn.ʃɒt","uk_link":"../audio/m/cdo0317moonuk2514.mp3","content":"moonshot noun [C]\n(TRIP TO MOON)\nAdd to word list\nAdd to word list\nthe act of sending a spacecraft to the moon: This is technology that can be used in another moonshot or a Mars mission.\nMore examplesFewer examplesHe published s an expense report requesting $33.31 for expenses incurred during Aldrin's moonshot. In the 1960s, following the moonshot, it was predicted that within a few years dinner would come in the form of three pills.In those days, transatlantic crossings were like moonshots.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\nbooster\ncapsule\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nnose cone\nshuttle\nspace capsule\nspace probe\nspace tourism\nspace tourist\nspacefarer\nspaceman\nSee more results »\nmoonshot noun [C]\n(BOLD PLAN)\na plan or aim to do something that seems almost impossible: The company has received funding from the US Department of Energy, so it looks as if someone believes this moonshot could work. He believes the Covid testing moonshot is the only way out for the UK economy in the face of a probable winter surge.\nMore examplesFewer examplesHe knows the vaccine is a moonshot, but he figures anything less would amount to surrender.If ever there was a global moonshot worth supporting, this is it.We're taking a moonshot that we'll want to be interacting with computers in deeply emotional ways.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nobjective\npoint\npoodle\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »\nused to refer to a plan or aim to do something that seems almost impossible, or relating to such plans or aims: These super-rich companies have enough money to invest in whatever moonshot projects they like. Moonshot thinking starts with picking a big problem and articulating a radical solution.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nobjective\npoint\npoodle\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »"}