{"id":233676,"name":"more","type":"determiner","us_sound":"mɔːr","us_link":"../audio/m/more.mp3","uk_sound":"mɔːr","uk_link":"../audio/m/ukmorda003.mp3","content":"Add to word list\nAdd to word list\nA1 a larger or extra number or amount: Would you like some more food? The doctors can't cope with any more patients. Add some more cream to the sauce. You need to listen more and talk less! More people live in the capital than in the whole of the rest of the country. We spent more time on the last job than usual. The noise was more than I could bear. It was a hundred times more fun than I'd expected. She's more of a poet than a novelist. Bring as much food as you can - the more, the better.\nA1 used to form the comparative of many adjectives and adverbs: She couldn't be more beautiful. Let's find a more sensible way of doing it. You couldn't be more wrong. He finds physics far/much more difficult than other science subjects. Play that last section more passionately.\nused to emphasize the large size of something: More than 20,000 demonstrators crowded into the square. more and more\nB2 increasingly: It gets more and more difficult to understand what is going on.\nSee more the more...the more/less\nused to say that when an action or event continues, there will be a particular result: The more he drank, the more violent he became.\nSee more\nMore examplesFewer examplesBe a bit more confident in yourself!Men tend to be more aggressive than women.They still need a great deal more money to finish the project.Do you think Australia is a more democratic country than Britain?You should eat more food that contains a lot of fibre, such as fruit, vegetables and bread.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nsupererogatory\nwhole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlso, extra, and in addition\nGrammar\nComparison: nouns (more money, the most points) …\nMoreWe use the quantifier more to talk about additional quantities, amounts and degree. More is a comparative word. …\nMore with nouns, adjectives, adverbs, verbs, prepositionsWe use more with different classes of words. We use more after verbs but before every other word class: …\nMoreorlessMore or less means ‘mostly’, ‘nearly’ or ‘approximately’. We use it in mid position (between the subject and main verb, or after the modal verb or first auxiliary verb, or after be as a main verb). It is slightly informal: …\nAny more or anymore?We use any more as a determiner to describe ‘an indefinite quantity of something’. Any more is similar to some more. Some more is more common in affirmative statements; any more is more common in questions, in clauses with if and in sentences with negative words such as hardly, never, scarcely: …\nAny more as a determinerWe use any more as a determiner to describe ‘an indefinite quantity of something’. Any more is similar to some more. Some more is more common in affirmative statements; any more is more common in questions, in clauses with if and in sentences with negative words such as hardly, never, scarcely: …\nAny more as an adverbAny more is also an adverb and has the meaning of ‘no longer’ or ‘in the past but not now.’ In this meaning, we use it in end position: …\nNo more, not any moreNo more and not any more are determiners and adverbs. …\nIdioms\nall the more\nany more\ncouldn't agree/disagree more\nmore or less\nmore than\nthe more the merrier\nnot/no more than\nthat's more like it!\nAdd to word list\nAdd to word list\na larger or extra number or amount (of); comparative ofmany or much: You need to listen more and talk less. There were no more seats on the bus, so we had to stand. DisneyWorld was more fun than I expected. Would you play the song once more (= again)?\nMore is used to form the comparative of many adjectives and adverbs: You couldn’t be more wrong. He finds physics much more difficult than biology. Idioms\nmore and more\nmore like it\nmore often than not\nmore or less\nmore than\nthe more something happens the less another thing happens\nthe more something happens the more another thing happens"}