{"id":233792,"name":"morning","type":"noun","us_sound":"ˈmɔːr.nɪŋ","us_link":"../audio/m/morning.mp3","uk_sound":"ˈmɔː.nɪŋ","uk_link":"../audio/m/ukmorda011.mp3","content":"Add to word list\nAdd to word list\nA1 the part of the day from the time when the sun rises or you wake up until the middle of the day or lunch time: a beautiful/sunny/wet morning I work three mornings a week at the bookshop. She only works in the mornings. What's our schedule for this morning? I'd like an appointment for tomorrow morning, please. I'll see you on Saturday morning. I had too much to drink at Sarah's party, and I felt terrible the morning after. in the morning\nA1 during the early part of the day: I listen to the radio in the morning.\nB1 at some time between twelve o'clock at night and twelve o'clock in the middle of the day: The murder took place at four in the morning.\nB1 the next morning: She said she would see you in the morning.\nSee more the morning after\nthe day or days after something has happened or someone has done something, especially something that they regret (= wish had not happened or they had not done): A wild party is fun while it lasts, but what about the morning after?\nSee more\nMore examplesFewer examplesWhat time did you get to work this morning?Perhaps you should try getting up earlier in the mornings.The heating comes on at six in the morning.The report arrived on my desk this morning.The caretaker opens up the school every morning at seven.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnoon\nnoontime\no'clock\noffice hours\nopening time\nthe witching hour\nwhite night\nwine o'clock\nworkday\nworking day\nSee more results »\nIdiom\nmorning, noon, and night\na friendly way of greeting people when you meet them in the morning: Morning, Sue! How are you today? Compare\ngood morning\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\nfive\ng'day\ngod\nhello stranger idiom\nhowdy\nlady\nmerry Christmas! idiom\nmind\nnamaskar\npleased\npoke\npress the flesh idiom\npump someone's hand idiom\nshalom\nwish\nSee more results »\nAdd to word list\nAdd to word list\nthe part of the day from the time when the sun rises until the middle of the day: [ U ] Sunday/tomorrow morning [ C ] I work three mornings a week at the bookstore."}