{"id":234004,"name":"mortgage","type":"noun","us_sound":"ˈmɔːr.ɡɪdʒ","us_link":"../audio/m/mortgage.mp3","uk_sound":"ˈmɔː.ɡɪdʒ","uk_link":"../audio/m/ukmorta003.mp3","content":"Add to word list\nAdd to word list\nan agreement that allows you to borrow money from a bank or similar organization, especially in order to buy a house, or the amount of money itself: They took out a £400,000 mortgage (= they borrowed £400,000) to buy the house. a monthly mortgage payment\nMore examplesFewer examplesPeople who default on their mortgage repayments may have their home repossessed.Having a big mortgage is a real drain on your earnings.After falling behind with his mortgage repayments he now faces eviction from his home.She got behind with her mortgage and the house was repossessed.They were forced to give up their home because they couldn't pay the mortgage.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nplanning blight\nreal estate broker\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossession\nreverse mortgage\nSee more results »\nto borrow money to buy a house: Their home was mortgaged up to the hilt (= the full value of their home had been borrowed).\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nplanning blight\nreal estate broker\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossession\nreverse mortgage\nSee more results »\nAdd to word list\nAdd to word list\nan agreement that allows you to borrow money from a bank or similar organization by offering something of value, esp. in order to buy a house or apartment, or the amount of money itself: They took out a $90,000 mortgage to buy the house.\nto offer something of value in order to borrow money from a bank or similar organization: They had to mortgage their home to borrow enough money to pay for their children’s education.\nAdd to word list\nAdd to word list\na legal agreement to borrow money from a bank or other financial organization, especially to buy a house or other property, or the amount of money borrowed: apply for/take out/get a mortgage You take out a mortgage on your home at a fixed rate of interest. pay/pay off/repay a mortgage A large part of the money will be used to pay off a mortgage.mortgage payment/repayment Once the interest rate rises, they won't be able to afford their monthly mortgage payments.mortgage arrears/defaults Increases in unemployment will lead to a rise in mortgage arrears. a 15/25/30-year mortgage See also\nadjustable rate mortgage\nballoon mortgage\ndirect-reduction mortgage\nendowment mortgage\nequitable mortgage\nfirst mortgage\nlegal mortgage\nrepayment mortgage\nvariable rate mortgage\nto borrow money using property as security (= an asset that will belong to the lender if the borrower does not pay back the loan): mortgage sth to do sth He mortgaged his home to help finance the project. The company mortgaged its assets to secure a $23 billion credit line."}