{"id":234074,"name":"mosaic","type":"noun","us_sound":"moʊˈzeɪ.ɪk","us_link":"../audio/m/mosaic.mp3","uk_sound":"məʊˈzeɪ.ɪk","uk_link":"../audio/m/ukmorta011.mp3","content":"mosaic noun\n(PATTERN)\nAdd to word list\nAdd to word list\n[ C or U ] a pattern or picture made using many small pieces of coloured stone or glass, or the activity or method of making these: a beautiful tenth-century mosaic On one of the clinic's walls is a mosaic depicting a woman and child wearing traditional clothing. Mosaic is an ancient art form which can be used to brighten up a corner of your garden.\nLawrenLu/Moment/GettyImages\n[ C ] something that forms a pattern consisting of many small coloured areas: The \"island\" of Venice is actually a mosaic of 118 tiny islands. 200,000 mirrored stainless steel disks respond to air currents, creating an ever-changing mosaic of light.\nMore examplesFewer examplesThe Bardo Museum is home to one of the world's finest collections of Roman mosaics.You could learn candlemaking, glassblowing, ceramics, mosaic or even furniture making.The instrument panel is a mosaic of changing numeric displays.The savannah consists of shifting mosaics of woodland and open grasslands.\nSMART Vocabulary: related words and phrases\nCrafts\nartificer\nartisan\nartisanal\narts and crafts\nartsy-craftsy\ncrafty\ncrochet\ndécoupage\nemboss\nengrave\nhandcrafted\nhandicraft\nhandiwork\ninlay\nintarsia\nsilkscreen\nstraw\ntjanting tool\ntritik\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nmosaic noun\n(MIXTURE)\n[ C ] a combination of many different parts forming one thing: The country is a cultural and social mosaic due to the influx of different ethnic groups. With continued protection, orchids will continue to inhabit the unique mosaic of ecosystems that is South Florida.\nMore examplesFewer examplesI think it was this mosaic of experiences in his life that made him special.That story is another fragment in the mosaic of the African American story.Four of his nine novels were actually mosaics of interlinked novellas.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\ncrossed\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nmeld\nmethylate\nmingle\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nmade using, or in the form of, many small pieces of coloured stone, glass, ceramic, etc.: Fragments of an ancient mosaic pavement can be seen on the floor of the tomb. Shower rooms have green mosaic tiles, glass-bowl sinks and chrome fittings.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\nAdd to word list\nAdd to word list\na pattern or picture of many small pieces of colored stone or glass: a mosaic floor"}