{"id":234182,"name":"most","type":"determiner","us_sound":"moʊst","us_link":"../audio/m/most.mp3","uk_sound":"məʊst","uk_link":"../audio/m/ukmorta023.mp3","content":"Add to word list\nAdd to word list\nA2 the biggest number or amount of; more than anything or anyone else: What's the most you've ever won at poker? Which of you earns the most money? He wanted to do the most good he could with the $2,000, so he gave it to charity. The kids loved the fair, but they enjoyed the bumper cars most of all.\nA2 used to form the superlative of many adjectives and adverbs: Joanne is the most intelligent person I know. The department needs three more computers in order to work most effectively (= to work as effectively as possible).\nA2 almost all: I don't eat meat, but I like most types of fish. In this school, most of the children are from the Chinese community.\nformal very: It was a most beautiful morning.\nmainly US informal almost: You'll find her in the bar most every evening about six o'clock. at (the) most\nused when saying what is the largest possible amount or number: At most, the work will take a week.\nSee more make the most of something\nB2 to take full advantage of something because it may not last long: It's a beautiful day - we should make the most of it.\nSee more\nMore examplesFewer examplesWho's the most famous person you've ever interviewed on TV?This chemical is found in most weed killers.I like most vegetables but not cabbage.She's the most popular teacher in school.Disney's latest production looks likely to be their most successful ever.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmax\nmax out\nmaximal\nmaximally\nmaximum\nnadir\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge in number or quantity\nLinguistics: very & extreme\nAlmost\nGrammar\nMost, the most, mostlyWe use the quantifier most to talk about quantities, amounts and degree. We can use it with a noun (as a determiner) or without a noun (as a pronoun). We can also use it with adjectives and adverbs to form the superlative. …\nMostWe use the quantifier most to talk about quantities, amounts and degree. We can use it with a noun (as a determiner) or without a noun (as a pronoun). We can also use it with adjectives and adverbs to form the superlative. …\nThe mostThe most is the superlative form of many, much. We use the most with different classes of words. …\nMostlyMostly is an adverb that means ‘mainly’: …\nused to mean 'furthest': Dunnet Head is the northernmost part of the British mainland (= the part that is farther to the north than any other part).\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmax\nmax out\nmaximal\nmaximally\nmaximum\nnadir\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nAdd to word list\nAdd to word list\nthe biggest number or amount (of), or more than anything or anyone else; superlative ofmany or much: Which of you earns the most money? The kids loved the circus, and most of all the clowns.\nMost is used to form the superlative of many adjectives and adverbs: Joanne is the most intelligent person I know.\nMost also means almost all: I like most vegetables.\nMost also means very: He argued his case most persuasively. most pronoun us\nYour browser doesn't support HTML5 audio\n/moʊst/\nMost of the players are coming on the next bus."}