{"id":234226,"name":"mother","type":"noun","us_sound":"ˈmʌð.ɚ","us_link":"../audio/m/mother.mp3","uk_sound":"ˈmʌð.ər","uk_link":"../audio/m/ukmothe001.mp3","content":"mother noun\n(PARENT)\nAdd to word list\nAdd to word list\nA1 [ C ] a female parent: My mother was 21 when she got married. All the mothers and fathers had been invited to the end-of-term concert. The little kittens and their mother were all curled up asleep in the same basket. [ as form of address ] formal or old-fashioned May I borrow your car, Mother?\nThesaurus: synonyms, antonyms, and examples\nyour parentsparentMy parents died when I was young.biological parentSome children are raised by grandparents or other family members, instead of their biological parents.adoptive parentWhen he was 7 months old, his mother gave him up to his adoptive parents.motherHave you met my mother?fatherMy father fully supports my life choices.mumUK My mum and dad go there every year.\nSee more results »\nMore examplesFewer examplesMy mother smiled encouragingly at me as I went up on stage.His mother's death when he was aged six had a very profound effect on him.Like many mothers, she feels torn between her family and her work.The supermarket was full of harassed-looking mothers with young children.All the mothers and fathers had been invited to the end-of-term concert.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationship\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nmother noun\n(RELIGIOUS WOMAN)\n[ C ] (also Mother) the title of a woman who is in charge of, or who has a high rank within, a convent (= house of religious women): Mother Theresa a mother superior [ as form of address ] Good morning, Mother.\nSMART Vocabulary: related words and phrases\nReligious titles\nbeadle\nbrother\neminence\nfather\nFr.\ngrace\nlama\nMonsignor\nMsgr\npandit\npope\nrev\nReverend\nright\nsaint\nst\nswami\nvenerable\nVicar of Christ\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: monks & nuns\nmother noun\n(FOR FOOD)\n[ C or U ] (also mother dough) a mixture used for making sourdough bread, consisting of flour and water that has been allowed to ferment (= to undergo a chemical process of being broken down by bacteria or yeasts) and has been kept from a previous occasion when bread was made: Head baker Saci made his mother nearly twenty years ago. He shows them how to mix older mother dough with fresh new dough for the perfect balance of flavour.\n[ C or U ] a substance used for making any food or drink that is fermented (= that undergoes a chemical process of being broken down by bacteria or yeasts), that is kept from a previous occasion when the food or drink was made : The kefir mother grows slowly from batch to batch. Here's how to grow a kombucha mother. Organic, unfiltered apple cider vinegar also contains \"mother\", strands of proteins, enzymes and friendly bacteria that give the product a murky appearance.\nSMART Vocabulary: related words and phrases\nFlour & yeast\nall-purpose flour\nbaker's yeast\nbesan\nblue corn\ncassava\nfarinha\nflour\nfloury\ngluten\ngraham flour\nmielie meal\nnooch\nnutritional yeast\noatmeal\npatent flour\nsemolina\nsourdough\nstoneground\nunbolted\nwheatmeal\nSee more results »\nIdioms\nat your mother's knee\nthe mother of all something\nto treat a person with great kindness and love and to try to protect them from anything dangerous or difficult: Stop mothering her - she's 40 years old and can take care of herself.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating someone well\nmother noun\n(PARENT)\nAdd to word list\nAdd to word list\n[ C ] a female parent: My mother was 20 when I was born. Mother, where’s my red blouse?\nmother noun\n(EXTREME THING)\n[ U ] the largest or most extreme example of something: They got caught in a mother of a storm.\nmother verb [T]\n(PARENT)\nto treat someone with kindness and affection and try to protect that person from danger or difficulty: Leave me alone – I don’t need to be mothered."}