{"id":234275,"name":"motion","type":"noun","us_sound":"ˈmoʊ.ʃən","us_link":"../audio/m/motion.mp3","uk_sound":"ˈməʊ.ʃən","uk_link":"../audio/m/ukmothe013.mp3","content":"motion noun\n(MOVEMENT)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the act or process of moving, or a particular action or movement: The violent motion of the ship upset his stomach. He rocked the cradle with a gentle backwards and forwards motion. They showed the goal again in slow motion (= at a slower speed so that the action could be more clearly seen).\n[ C ] UK a polite way of referring to the process of getting rid of solid waste from the body, or the waste itself: The nurse asked if her motions were regular.\nMore examplesFewer examplesOnstage she is a human dynamo, spending the hour in perpetual motion.He gloved the ball, turned, and threw in one motion.The motion of the car almost lulled her to sleep.The spaceship's jets were fired periodically to dampen a side-to-side pendulum motion that had developed.I thought a phone call to the right person might set the wheels in motion.\nSMART Vocabulary: related words and phrases\nMovement\nambulatory\nbe treading water idiom\nbiodynamics\ncomings\nfloating\ngestural\nlocomotion\nmobile\nmobility\nmotile\nmotility\nmovable\nmovement\npassage\npull\npull someone up short idiom\nrooted\nrooted to the spot idiom\nslithery\nsteadiness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for movement\nAnimal physiology: excrement & its excretion\nmotion noun\n(SUGGESTION)\nC2 [ C ] a formal suggestion made, discussed, and voted on at a meeting: [ + to infinitive ] Someone proposed a motion to increase the membership fee to $500 a year. The motion was accepted/passed/defeated/rejected.\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nMore examplesFewer examplesDelegates have voted in favour of the motion.Anyone wishing to dissent from the motion should now raise their hand.Those voting for the motion, 96, and those voting against, 54.The motion for tonight's debate is, \"This house believes that capital punishment should be abolished.\"He proposed a motion that the chairman resign.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nIdioms\ngo through the motions\nput/set something in motion\nto make a signal to someone, usually with your hand or head: I saw him motion to the man at the door, who quietly left. Her family all gathered around her, but she motioned them away. [ + obj + to infinitive ] He motioned me to sit down. Synonyms\ngesticulate formal\ngesture\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngesture\nnon-verbally\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap\nsnap your fingers idiom\ntongue\nwink\nSee more results »\nmotion noun\n(MOVEMENT)\nAdd to word list\nAdd to word list\n[ C/U ] the act or process of moving, or a particular movement: [ U ] His range of motion was exactly equal on both sides. [ C ] She moved her finger in a circular motion.\nmotion noun\n(FORMAL REQUEST)\n[ C ] a formal request, usually one made, discussed, and voted on at a meeting: [ + to infinitive ] Someone made a motion to increase the membership fee.\n[ C ] A motion is also a request made to a judge in court for something to happen. in motion\nSomething in motion is moving or operating or has started: The alarm rang and suddenly everyone was in motion. The governor’s request set in motion the process for receiving federal funds.\nmotion verb [always + adv/prep]\n(SIGNAL)\nto make a signal to someone, usually with your hand or head: [ T ] He motioned me to sit down. [ I ] I saw him motion to the man at the door.\nAdd to word list\nAdd to word list\na formal suggestion made, discussed, and voted on at a meeting: introduce/make/propose a motion They will propose a motion to move the vote to the evening of June 9. approve/carry/pass a motion The group unanimously passed a motion endorsing the designs. defeat/reject a motion put forward/table/adopt a motion"}