{"id":234297,"name":"motive","type":"noun","us_sound":"ˈmoʊ.t̬ɪv","us_link":"../audio/m/eus73095.mp3","uk_sound":"ˈməʊ.tɪv","uk_link":"../audio/m/ukmothe018.mp3","content":"Add to word list\nAdd to word list\nB2 a reason for doing something: Why would she have killed him? She has no motive. Does he have a motive for lying about where he was? What is the motive behind (= the reason for) the bombing? I think you should examine/question their motives in offering to lend you the money. She denies that she has an ulterior (= secret) motive for making the donation.\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\nMore examplesFewer examplesHe gives a lot of money to charity, but self-aggrandizement is his motive.The motive for this shocking attack seems to be racial hatred.Detectives have been unable to assign a motive for the murder.He claims he just wants to help Lisa but I suspect he has an ulterior motive.\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\ndrive\nfirst principles\nfrom a place of idiom\nground\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nname\nobject\npeg\nplace\nrationale\nshould\nwhy\nSee more results »\n(of power or force) causing movement or action\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\npass\nround\nrove\nseethe\nshove\nslip\nSee more results »\nAdd to word list\nAdd to word list\na reason for doing something: Does he have a motive for lying about where he was? Judy moved to Florida because she likes it there, not for any ulterior motive (= secret reason). motivate verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈmoʊ·t̬əˌveɪt/\nShe’s motivated by a desire to help people."}