{"id":234504,"name":"mountain","type":"noun","us_sound":"ˈmaʊn.tən","us_link":"../audio/m/mountain.mp3","uk_sound":"ˈmaʊn.tɪn","uk_link":"../audio/m/ukmotor019.mp3","content":"mountain noun [C]\n(VERY LARGE HILL)\nAdd to word list\nAdd to word list\nA2 a raised part of the earth's surface, much larger than a hill, the top of which might be covered in snow: The Matterhorn is one of the biggest mountains in Europe. The Rockies are a mountain chain/range in the western United States. I'd love to go mountain-climbing. We're going to the mountains (= an area where there are mountains) for our holiday.\nzorazhuang/E+/GettyImages\nMore examplesFewer examplesWe camped on one of the lower slopes of the mountain.The view from the top of the mountain is breathtaking.What's the highest mountain in Europe?After three days lost in the mountains, all the climbers arrived home safe and sound.They slowly ascended the steep path up the mountain.\nSMART Vocabulary: related words and phrases\nGeography: hills & mountains\nacclivity\nbrow\nclifftop\nesker\nhillock\nMarilyn\nmesa\nmid-ocean ridge\nmotte\nMount Kilimanjaro\norographic\npinnacle\nscarp\nspur\nsteep\nthe Adirondack Mountains\nthe Alaska Range\nthe Alps\nthe Andes\nvolcano\nSee more results »\nmountain noun [C]\n(LARGE AMOUNT)\na mountain of something\nC2 a large amount of something: I've got a mountain of work to do.\nSee more\nUK a large amount of food that is stored instead of being sold, so that prices for it do not fall: a grain mountain\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nGrammar\nGeographical placesWe use the before the names of rivers. We usually write the without a capital letter. If we use the word river, we usually write it without a capital letter: the river Thames, the river Severn, the Yangtze river. …\nIdiom\nmake a mountain out of a molehill\nmountain noun [C]\n(HIGH PLACE)\nAdd to word list\nAdd to word list\na raised part of the earth’s surface, larger than a hill: the Blue Ridge Mountains We’re spending the weekend in the mountains (= an area with mountains). The Rockies form the biggest North American mountain range (= group of mountains).\nmountain noun [C]\n(LARGE AMOUNT)\na large amount of something: I’ve got mountains of work to do. You’ll never eat that mountain of food.\nAdd to word list\nAdd to word list\na large amount of food that is stored instead of being sold, in order to keep prices at high levels: a butter/beef/grain mountain"}