{"id":234676,"name":"move","type":"verb","us_sound":"muːv","us_link":"../audio/m/move.mp3","uk_sound":"muːv","uk_link":"../audio/m/ukmourn016.mp3","content":"move verb\n(CHANGE POSITION)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to (cause to) change position: I'm so cold I can't move my fingers. Will you help me move this table to the back room? Can we move (= change the time of) the meeting from 2 p.m. to 3.30 p.m. ? Don't move! Stay right where you are. I thought I could hear someone moving about/around upstairs. If you move along/over/up (= go further to the side, back, or front) a little, Tess can sit next to me. Police officers at the scene of the accident were asking people to move along/on (= to go to a different place). Come on, it's time we were moving (= time for us to leave). Let's stay here tonight, then move on (= continue our journey) tomorrow morning.\n[ I or T ] to change the position of one of the pieces used in a board game: In chess, the pieces can only move in certain directions.\nMore examplesFewer examplesYou can move the cursor either by using the mouse or by using the arrow keys on the keyboard.I didn't want to move in case I woke her up.In the summer, the shepherds move their sheep up into the hills .Could I possibly ask you to move your chair a little?The poor things were kept in small cages without room to move.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoard games\nmove verb\n(CHANGE PLACE)\nB1 [ I ] to go to a different place to live or work: We're moving to Paris. They've bought a new house, but it will need a lot of work before they can move into it/move in. I hear Paula has moved in with her boyfriend (= gone to live in his house). The couple next door moved away (= went to live somewhere else) last year. A lot of businesses are moving out of London because it's too expensive. move house B1 UK\nto leave your home in order to live in a new one: We're moving house next week.\nSee more\nMore examplesFewer examplesWhen we retire, we're going to move to a warmer climate .We would dearly love to sell our flat and move to the country.They decided to move abroad and make a fresh start.Now that the children are settled at school , we don't really want to move again.After nine years in Cambridge, Susannah and Guy moved to Watlington, where they lived happily ever after.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging homes & moving\nmove verb\n(PROGRESS)\n[ I or T ] to (cause to) progress, change, or happen in a particular way or direction: The judge's decision will allow the case to move forward. If you want to move ahead in your career, you'll have to work harder. Share prices moved up/down slowly yesterday. Sophie has been moved up/down a grade at school. It's time this company moved into (= started to take advantage of the benefits of) the digital age.\nMore examplesFewer examplesI don't really like working on a computer, but you have to move with the times, I suppose.Traffic moved forward at a crawl.The company has moved into plastics.The procession moved through the streets at a steady pace.By lap 26, Hamilton had moved into second position.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nmove verb\n(CAUSE)\n[ T ] to cause someone to take action: [ + obj + to infinitive ] formal I can't imagine what could have moved him to say such a thing.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nstoke\nurge\nSee more results »\nmove verb\n(CHANGE OPINION)\n[ I or T ] to (cause to) change an opinion or the way in which you live or work: He's made up his mind, and nothing you can say will move him on the issue. More and more people are movingaway from/towards vegetarianism.\nSMART Vocabulary: related words and phrases\nChanging your mind\n180\nabout-face\nabout-turn\nback away\nback out\ncave in\nclimb down\ncold\ngo back on something\nhave another think coming idiom\nmake a 180\nmake an about-face\nmake an about-turn\npull out\nsecond thought\nshift\nshift (your) ground idiom\nthere's no turning back idiom\nthink again idiom\nthink better of something idiom\nSee more results »\nmove verb\n(FEELINGS)\nB2 [ T ] to cause someone to have strong feelings, such as sadness, sympathy, happiness, or admiration: She said that she was deeply moved by all the letters of sympathy she had received. It was such a sad film that it moved him to tears (= made him cry).\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiring feelings in others\nmove verb\n(SELL)\n[ I or T ] informal to sell: No one wants to buy these toys - we just can't move them. This new shampoo is moving really fast.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nmove verb\n(BE WITH PEOPLE)\n[ I + adv/prep ] to spend time with people: She moves in/among a very small circle of people.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nbuild\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\npal up\npresent\npull\npull something on\nrub\nscore\nspeak\nstrike\nSee more results »\nmove verb\n(SUGGEST)\n[ I or T ]\n&#160; politics, law\n&#160; specialized to suggest something, especially formally at a meeting or in a law court: A vote was just about to be taken when someone stood up and said that they wished to move an amendment. [ + that ] I move that the proposal be accepted. Your Honour, we wish to move for dismissal of the charges.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nmove verb\n(PASS)\n[ I or T ] polite word (used especially by doctors and nurses) to pass the contents of the bowels out of the body: The doctor asked him if he'd moved his bowels that day.\nSMART Vocabulary: related words and phrases\nAnimal physiology: excrement & its excretion\naccident\nanal fissure\nbathroom\nbodily function\nbowel\ndefecate\ndoo-doo\ndung\ndunghill\nexcrement\nexcreta\nexcrete\nmotion\nmovement\npellet\npoo\npoop\npowder\nshit\nstool\nSee more results »\nIdioms\nmove heaven and earth\nmove it!\nmove on to bigger/better things\nmove with the times\nnot move a musclePhrasal verbs\nmove someone/something in\nmove in on something/someone\nmove off something/on (to something)\nmove on\nmove out\nmove noun\n(CHANGE OF POSITION)\nC2 [ S ] an act of moving: She held the gun to his head and said, \"One move and you're dead!\" I hate the way my boss watches my every move (= watches everything I do).\na movement or series of movements that form part of a dance: I picked up some new dance moves. Show us your moves!\n[ C ] in some board games, a change of the position of one of the pieces used to play the game, or a change of position that is allowed by the rules, or a player's turn to move their piece: It takes a long time to learn all the moves in chess. It's your move.\nMore examplesFewer examplesShe sat back for a minute to ponder her next move in the game.My cactus seems to be benefiting from its move from the living room to the kitchen windowsill.The cattle have had a move from the top field down into the meadow, I see.\"Where have the reference books gone?\" \"Oh - they've had a move. They're by the door now.\"Agassi's move to the net was perfectly timed, and he is rewarded with two match points.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot believing\nBoard games\nmove noun\n(CHANGE OF PLACE)\nC1 [ C ] an occasion when you go to live or work in a different place: We've had four moves in three years.\nMore examplesFewer examplesThey helped us with our move to Norwich.We have had three office moves in five years.The move to Scotland was a big wrench for the children.The film follows one family's move to Spain.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\n(furniture) remover phrase\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndiaspora\ngreener pastures idiom\nimmigrant\nimmigration\nmigrant\nmigrate\nmover\npasture\nrelocate\nrelocation\nremoval\nremovalist\nremover\nstake\nwinter\nSee more results »\nmove noun\n(ACTION)\nC1 [ C ] an action taken to achieve something: Buying those shares was a good move. This move towards improving childcare facilities has been widely welcomed. [ + to infinitive ] The city council is making a move to improve traffic flow in the city.\nThesaurus: synonyms, antonyms, and examples\nyour actionsactionYou should take responsibility for your own actions.actThis was considered to be an act of war.thingThat’s the last thing you should be doing if you’re pregnant.activityNot all of her business activities were scrupulously clean. moveApplying for that job was a good move.deedTheir evil deeds must not go unpunished.\nSee more results »\nMore examplesFewer examplesIt was a shrewd move to buy your house just before property prices started to rise.Quitting that job was the smartest move I ever made.The newspaper made the bold move of publishing the names of the men involved.\"The children are getting rather bored, so shall we take them to the park?\" \"Yes, I think that would be a good move.\"It was a brave move to stand up and question the boss's figures, but you certainly made him notice you!\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nIdioms\nbe on the move\nget a move on\nmake the first move\nmake a move\nAdd to word list\nAdd to word list\n[ I or T ] to go to a different place in order to live or work, or to make someone do this: The company announced it would be moving staff from Houston to Dallas early next year.move to/into a place I got a promotion last year that meant moving to Brussels. For many years the trend has been for people to move from rural to urban areas.\n[ I or T ] if a store, office, factory, etc. moves, or if someone moves it, it becomes situated in another place: move to/from a place The bank's headquarters have now moved to Amsterdam.move offices/headquarters/operations Airline operations are in the process of being moved to Terminal 2.\n[ I or T ] to change the job that you do, or to make someone do this: If you're not happy working in your current team, we can move you.move sb to sth After only six months at the firm, he was moved to sales.move to/from/into sth She wants to move into corporate finance.\n[ I ] to take action or make progress: One financial analyst said the court decision could prompt the company to move more quickly on the issue.move ahead/forward/away from sth The state is moving ahead with legislation reforms for small businesses.\n[ I or T ]\n&#160; COMMERCE if a product moves, or if a store, company, etc. moves it, it sells quickly: Our latest range of Internet TVs is really moving.\nMEETINGS\n&#160; formal to officially suggest something during a meeting: move that I move that we adopt the resolution.\nPhrasal verbs\nmove in\nmove on\nmove out\nmove to/towards sth\nmove up\n[ C ] action that a person or organization takes in order to achieve something: a move to do sth Moves to block free access to music on the Internet have met with limited success.a move by sb/sth Economists said a move by Japan to cut interest rates in isolation would have little effect on currency levels.make a move (to do sth) Moves are being made to help future doctors make objective decisions.first/next/latest move Our next move will crucially depend on the latest figures for inflation.a bold/strategic/dramatic move Strategic moves announced with the interim results should strengthen the balance sheet and improve cash flow.a move comes/follows The company's move comes as part of a wider industry crackdown on insurance fraud.applaud/approve/condemn a move Investors are expected to applaud the move.\n[ S ] the process of changing from one system, activity, etc. to another: a move to/into sth Environmentalists have welcomed the move to congestion charging.a move (away) from sth We have incorporated several new concepts in recent months, including a move from commission-only staff to a team bonus structure.\n[ C ] the process of changing the place where you live or work, or trading in a new place: a move from/to/into a place The move into Italy is part of a wider international expansion.\nSee also\nblock move\ncareer move"}