{"id":234803,"name":"much","type":"determiner","us_sound":"mʌtʃ","us_link":"../audio/m/much.mp3","uk_sound":"mʌtʃ","uk_link":"../audio/m/ukmozam027.mp3","content":"Add to word list\nAdd to word list\nA1 a large amount or to a large degree: I don't earn much money. You haven't said much, Joan - what do you think? I like her very much. I don't think there's much to be gained by catching an earlier flight. The children never eat (very) much, but they seem healthy. \"Is there any wine left?\" \"Not much.\" There's not/nothing much to do around here. How much (= what amount of) sugar do you take in your coffee? How much do these shoes cost? I spend too much on clothes. I don't have as much time as (= I have less time than) I would like for visiting my friends. Because of the rain, we weren't able to spend much of the day on the beach. Have you seen much of Polly (= often seen her) recently? I'd very much like to visit them sometime. One day I hope I'll be able to do as much (= the same amount) for you as you've done for me. Things around here are much as always/as usual (= have not changed a lot). The two schools are much the same (= very similar). Much to our surprise, (= we were very surprised that) they accepted our offer. I'm not much good at knitting (= do not do it very well). This is a much (= often) discussed issue. Blake has become a much (= greatly) changed person since his car accident. I've been feeling much healthier (= a lot more healthy) since I became a vegetarian. The repairs to our car cost much more than we were expecting. I'm very much aware of the problem. She's much the best person for the job (= she is certainly better than everyone else). I would much rather have my baby at home than in hospital. She is as much a friend to me as a mother (= although she is my mother, she is also a friend).\nThesaurus: synonyms, antonyms, and examples\nto have a certain monetary valuecostHiring a car for the week will cost close to £300!beThe cakes were £1.50 each or two for £2.sell forThe tickets sell for £100 each. fetchThe medieval manuscript fetched a record-breaking £1.2 million at auction. go for somethingHouses around here usually go for about £500,000. set someone back (something)Phew, that ring looks like it set you back.\nSee more results »\nmuch too much\na far larger amount of something than you want or need: You've drunk much too much to drive.\nSee more too much\nA2 more than someone can deal with: I can't take care of six children at my age - it's too much.\nSee more a bit much\ntoo extreme or not reasonable: I think it's a bit much for you to expect me to do all the cleaning.\nSee more\nUK informal humorous used at the end of a sentence to emphasize what you have just said: When he saw all the food on my plate, he said \"Hungry much?\"\nMore examplesFewer examplesIf I drink too much coffee, I can't sleep.How much liquid do you think this bottle contains?She runs much faster than he does.She looks much younger with her new hairstyle, don't you think?It was much further to the town centre than I remembered.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDenying & contradicting\nGrammar\nMuch, many, a lot of, lots of: quantifiersWe use the quantifiers much, many, a lot of, lots of to talk about quantities, amounts and degree. We can use them with a noun (as a determiner) or without a noun (as a pronoun). …\nMuch, many with a nounWe use much with singular uncountable nouns and many with plural nouns: …\nA lot of, lots of with a nounWe use a lot of and lots of in informal styles. Lots of is more informal than a lot of. A lot of and lots of can both be used with plural countable nouns and with singular uncountable nouns for affirmatives, negatives, and questions: …\nMuch, many, a lot of, lots of: negative questionsWhen we use much and many in negative questions, we are usually expecting that a large quantity of something isn’t there. When we use a lot of and lots of in negative questions, we are usually expecting a large quantity of something. …\nMuch, many, a lot, lots: without a nounWe usually leave out the noun after much, many and a lot, lots when the noun is obvious: …\nMuch with comparative adjectives and adverbs: much older, much fasterWe can use much before comparative adjectives and adverbs to make a stronger comparison: …\nToo much, too many and so much, so manyWe often use too before much and many. It means ‘more than necessary’. We can use too much before an uncountable noun and too many before a plural noun, or without a noun when the noun is obvious: …\nAs much as, as many asWhen we want to make comparisons connected with quantity, we use as much as and as many as: …\nMuch, many and a lot of, lots of: typical errorsWe use much with uncountable nouns and many with countable nouns: …\nMuch, a lot, lots, a good deal: adverbsWe use much, a lot, lots and a good deal as adverbs to refer to frequency, quantity and degree. …\nMuchWe use much in questions and negative clauses to talk about degrees of something. We put it in end position: …\nA lot, a good deal and a great dealWe can use a lot, a good deal and a great deal as adverbs of frequency, quantity or degree: …\nIdioms\nas much\nas much again\nas much as\nas much as you can do\nmuch as\nmuch less\nmuch to someone's delight, dismay, disappointment, surprise, etc.\nnot go much on something\nnot/nothing much\nnot so much\nMore idioms\nnot so much something as something\nso much\nso much for something\nC1 (something) of good quality: He's not much to look at, but he has a wonderful personality. I've never been much of a dancer (= good at dancing, or interested in doing it). There's not/nothing much on TV tonight.\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njim-dandy\njuicy\nknock\nknock spots off something idiom\nlike a boss idiom\nout of sight idiom\nplum\nroyally\nrule OK idiom\nsafe\nshabby\nshit hot\nsight\nsteal\nSee more results »\nGrammar\nMuch, many, a lot of, lots of: quantifiersWe use the quantifiers much, many, a lot of, lots of to talk about quantities, amounts and degree. We can use them with a noun (as a determiner) or without a noun (as a pronoun). …\nMuch, many with a nounWe use much with singular uncountable nouns and many with plural nouns: …\nA lot of, lots of with a nounWe use a lot of and lots of in informal styles. Lots of is more informal than a lot of. A lot of and lots of can both be used with plural countable nouns and with singular uncountable nouns for affirmatives, negatives, and questions: …\nMuch, many, a lot of, lots of: negative questionsWhen we use much and many in negative questions, we are usually expecting that a large quantity of something isn’t there. When we use a lot of and lots of in negative questions, we are usually expecting a large quantity of something. …\nMuch, many, a lot, lots: without a nounWe usually leave out the noun after much, many and a lot, lots when the noun is obvious: …\nMuch with comparative adjectives and adverbs: much older, much fasterWe can use much before comparative adjectives and adverbs to make a stronger comparison: …\nToo much, too many and so much, so manyWe often use too before much and many. It means ‘more than necessary’. We can use too much before an uncountable noun and too many before a plural noun, or without a noun when the noun is obvious: …\nAs much as, as many asWhen we want to make comparisons connected with quantity, we use as much as and as many as: …\nMuch, many and a lot of, lots of: typical errorsWe use much with uncountable nouns and many with countable nouns: …\nMuch, a lot, lots, a good deal: adverbsWe use much, a lot, lots and a good deal as adverbs to refer to frequency, quantity and degree. …\nMuchWe use much in questions and negative clauses to talk about degrees of something. We put it in end position: …\nA lot, a good deal and a great dealWe can use a lot, a good deal and a great deal as adverbs of frequency, quantity or degree: …\nmuch adjective, adverb\n(GREAT)\nAdd to word list\nAdd to word list\ngreat in amount, degree, or range: Mark’s got too much work to do. I don’t have much money to spend. Jody doesn’t eat very much. It doesn’t matter that much to me whether we go or not. Thank you so/very much. She doesn’t go out much (= often). He’s feeling much better/worse (= a lot better or worse). Rita would much rather have her baby at home than in a hospital (= She would greatly prefer it). Note: Much is used with singular, uncountable nouns. Idiom\nmuch less do something\nmuch noun [U]\n(AMOUNT)\nan amount or degree of something: How much sugar do you take in your coffee? Do these shoes cost much?\nmuch adverb\n(NEARLY)\nnearly; approximately: The two schools are much the same. She is so much like her mother.\nmuch pronoun, noun [U]\n(GREAT)\na great amount, degree, or range: There’s not much to do around here. He’s still recovering, and sleeps much of the time."}