{"id":235478,"name":"multimedia","type":"adjective","us_sound":"ˌmʌl.tiˈmiː.di.ə","us_link":"../audio/m/eus73122.mp3","uk_sound":"ˌmʌl.tiˈmiː.di.ə","uk_link":"../audio/m/ukmulli008.mp3","content":"Add to word list\nAdd to word list\nusing a combination of moving and still pictures, sound, music, and words, especially in computers or entertainment: multimedia software\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nthe use of a combination of moving and still pictures, sound, music, and words, especially in computers or entertainment: For three days, top artists from the worlds of advanced music and multimedia showcase their art. This is a program to create multimedia for the Web.\nMore examplesFewer examplesIt's been designed for portability and streaming multimedia.The means of designing and developing powerful multimedia must also be simple and easy-to-use.Multimedia is less in evidence here than in previous shows.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nAdd to word list\nAdd to word list\na combination of pictures, sound, and words, used esp. in computers or entertainment: a multimedia production\nAdd to word list\nAdd to word list\ncommunicating or sharing information in the form of sound, pictures, and video as well as text: Multimedia content now forms an integral part of mobile phone services. multimedia software/technology/services multimedia files/applications/packages a multimedia presentation/production/project\na multimedia industry or activity uses different types of media, such as computers, television, and newspapers, in order to sell or present information: a multimedia advertising/marketing campaign\nthe use of many different types of media to communicate and share information, especially using computers as well as traditional media: The development of consumer electronics was influenced by the growing popularity of information technology and multi-media. She is associate creative director of multimedia at a broadcasting company."}