{"id":235563,"name":"multiplication","type":"noun","us_sound":"ˌmʌl.tə.pləˈkeɪ.ʃən","us_link":"../audio/m/eus73127.mp3","uk_sound":"ˌmʌl.tɪ.plɪˈkeɪ.ʃən","uk_link":"../audio/m/ukmulli013.mp3","content":"Add to word list\nAdd to word list\n[ U or C ]\n&#160; mathematics\n&#160; specialized the process of adding a number to itself a particular number of times, or a calculation in which this is done: I was good at maths and had no trouble with multiplication and division. They started doing even longer multiplications. Compare\naddition\ndivision (CALCULATION)\nsubtraction\n[ U ] the process of increasing in number by a large amount, or of making something increase like this: This type of drug prevents cell multiplication. The multiplication of good brasseries has been a breath of fresh air to the restaurant industry. See\nmultiply\nMore examplesFewer examplesI asked the students to write about how multiplication and division were alike and different. When presented with simple multiplication or addition problems, I do them in my head.Interferons appear to inhibit the multiplication of viruses within cells.A pot of face cream is a haven for bacterial multiplication.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ncoefficient\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquintuple\nrecursion\nround something down\nsubtraction sign\nsubtractive\ntable\ntimes\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nAdd to word list\nAdd to word list\nmathematics the process of multiplying numbers: Emma’s learning multiplication (= how to multiply numbers) in school.\nAdd to word list\nAdd to word list\na large increase in number: the multiplication of sth The multiplication of TV channels has inevitably led to more fragmented viewing.\nthe mathematical process of adding one number to another a particular number of times: You should be able to do simple multiplication in your head. multiplication tables"}