{"id":235496,"name":"multinational","type":"adjective","us_sound":"ˌmʌl.t̬iˈnæʃ.ən.əl","us_link":"../audio/m/eus73124.mp3","uk_sound":"ˌmʌl.tiˈnæʃ.ən.əl","uk_link":"../audio/m/ukmulli010.mp3","content":"Add to word list\nAdd to word list\ninvolving several different countries, or (of a business) producing and selling goods in several different countries: The UN has sent a multinational peace-keeping force. a major multinational food company Compare\ntransnationalSee also\nnational adjective\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ncross-border\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\nstatehood\nstateless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: international politics & government\na large and powerful company that produces and sells goods in many different countries: Are multinationals now more powerful than governments?\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies involving or relating to different countries, or (of a business) operating in different countries: multinational corporations\nAdd to word list\nAdd to word list\na very large company that has offices, stores, etc. in many different countries but that is controlled from the country where it was started. A company with a quarter or more of its sales in other countries is considered to be a multinational: If multinationals become more important than governments, they can act as major forces of economic change. a big/large/leading multinational\nCOMMERCE a multinational organization is very large and has offices, stores, etc. in many diffferent countries: Over the years the firm has grown into a multinational organization with more than 200 affiliates in 17 countries. a multinational business/bank/enterprise\nrelating to or involving several different countries: The joint venture will be undertaken by a multinational group of 41 countries. multinational agreements"}