{"id":235543,"name":"multiple","type":"adjective","us_sound":"ˈmʌl.tə.pəl","us_link":"../audio/m/eus73125.mp3","uk_sound":"ˈmʌl.tɪ.pəl","uk_link":"../audio/m/ukmulli011.mp3","content":"Add to word list\nAdd to word list\nC1 very many of the same type, or of different types: The young man died of multiple burns. We made multiple copies of the report. We offer multiple (= many different) payment options. Opposite\nsingle\nMore examplesFewer examplesThey usually give you a discount if you buy multiple copies.He suffered multiple fractures in a motorcycle accident.He has several tattoos and multiple piercings.She sustained multiple injuries in the accident.He died from multiple stab wounds to the neck and upper body.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nmultiple noun [C]\n(NUMBER)\na number that can be divided by a smaller number an exact number of times: 18 is a multiple of 3, because 18 = 3 x 6.\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nreciprocal\nrecurring\nrecurring number\nremainder\nresponse variable\ntwentyfold\ntwofold\nweighting\nSee more results »\nmultiple noun [C]\n(LARGE COMPANY)\na large company that has shops in many towns\nSMART Vocabulary: related words and phrases\nMergers & acquisitions\nacqui-hire\nacquirable\nacquire\nacquisition\nacquisitive\nbuy someone out\nbuyout\nconglomerate\ncounterattack\ndenationalization\ndenationalize\nfire sale\nhostile\nleveraged buyout\nmonopolize\nmonopoly\nnon-hostile\noligopoly\nparent\nwhite knight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nhaving more than one and usually several of something: Most of the multiple-family domestic groups contained two small families living together. They studied the children's vocabularies and early multiple-word utterances. Synonym\nmulti-\nMore examplesFewer examplesFor more information, read the section on multiple-vote electoral systems.The farmer’s land can be viewed as a multiple-use resource.The distribution of multiple-species infestations among cattle was examined in this research.Another approach is multiple-criteria decision making.Chinese morphemes are graphically coded in the form of single- and multiple-unit characters.There has been a clear shift toward multiple-author papers.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nmultiple adjective [not gradable]\n(MANY)\nAdd to word list\nAdd to word list\nconsisting of or involving many things or types of things: Make multiple copies of the report.\nmultiple noun [C]\n(NUMBER)\nmathematics a number that results from multiplying one number by another when at least one of them is a whole number (= a number with no part of a number after it): 18 is a multiple of 3, because 6×3=18.\nAdd to word list\nAdd to word list\ninvolving many different people or things, or many different types of people or things : The company has grown through acquisition and now produces multiple brands for multiple markets. Our produce is shipped from multiple locations around the country.\nSTOCK MARKET the current price of one of a company's shares divided by the amount of profit related to it that the company makes in a year. Multiples are used to compare the prices of different shares: In valuation terms, the 38% share price appreciation since May has pushed the firm's multiple to record high levels. a forward/price earnings multiple Compare\nprice/earnings ratio\nCOMMERCE\n&#160; UK (also multiple store) one of many stores with the same name that are all owned by the same company: Supermarket multiples continue to dominate sales.\na number that is the result of multiplying one number by another: a multiple of sth Many people have borrowed huge multiples of their salary in order to buy a home.\nin multiples of 5/100/1000, etc.\nsomething that is sold, paid for, etc. in multiples of 5/100/1000, etc. is sold or paid for at one time by that amount: Savers can put between £20 and £400 a month into a Yearly Plan with instalments in multiples of £5."}