{"id":235311,"name":"multichannel","type":"adjective","us_sound":"ˌmʌl.tiˈtʃæn.spə/spl","us_link":"../audio/m/cdo0319usmult1149.mp3","uk_sound":"ˌmʌl.tiˈtʃæn.spə/spl","uk_link":"../audio/m/cdo1119ukmult0712.mp3","content":"multichannel adjective\n(BUSINESS)\nAdd to word list\nAdd to word list\nbusiness\n&#160; specialized involving or using many different ways to make a product, information, etc. available: Multichannel retailing refers to companies that sell online, in stores, and through catalogues. Retailers plan to aggressively pursue multi-channel marketing.\nMore examplesFewer examplesMany internet businesses are in fact multi-channel retailers.specialty businesses that focus on multichannel distributionMultichannel shoppers go into stores to touch products, go online to research prices, subscribe to e-mail lists that send out coupons, skim through catalogs and get stores' promotional messages on cellphones.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-order\nprocurement\nrewards card\nsanctions-busting\nsealed-bid\nshelf\nstretch\ntreat\nSee more results »\nmultichannel adjective\n(RADIO/SOUND)\ninvolving several different channels that can be used to send out or receive signals: Security staff use multichannel digital radios that work in tunnels.\nMore examplesFewer examplesParsons was a U. S. Army multichannel radio operator at Fort Hood, Texas.They use the Joint Tactical Radio System, which provides multichannel voice, data, imagery and video communications. Regular stereos just can't match the depth and definition of this high-quality multichannel standard.\nSMART Vocabulary: related words and phrases\nBroadcasting: radio\nam\nantenna\nanti-jamming\nanti-radar\nautotune\nbeacon\nCB\nLW\nmedium wave\nmulti-wavelength\nMW\nomnidirectional\nreceiver\nreception\nshort wave\nshout-out\ntranny\ntransponder\ntuner\ntwo-way\nSee more results »\nmultichannel adjective\n(TELEVISION)\ninvolving or having many different television stations: These consumers are more likely to have multichannel television not because they watch more television, but because they want more choice.\nMore examplesFewer examplesTV stations are trying to come up with a business model of how to live in a multichannel universe. Television - in an age when one in three have some form of multichannel TV - is no longer as \"special\" as it once was.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\ngaffer\nghost image\ngoggle-box\nHD\nHDTV\nplasma screen\nreceiver\nreveal\nsmart TV\nsquare-eyed\nsubtitler\nsweep\ntelegenic\nthe small screen phrase\nSee more results »"}