{"id":235555,"name":"multiply","type":"verb","us_sound":"ˈmʌl.tə.plaɪ","us_link":"../audio/m/eus73129.mp3","uk_sound":"ˈmʌl.tɪ.plaɪ","uk_link":"../audio/m/ukmulli015.mp3","content":"Add to word list\nAdd to word list\n[ T or I ]\n&#160; mathematics\n&#160; specialized to add a number to itself a particular number of times: If you multiply seven by 15 you get 105. When you multiply two odd numbers, is the answer always odd? I remember learning how to multiply and divide. Compare\nadd\ndivide verb (CALCULATE)\nsubtract\n[ T or I ] to increase, or to increase something, very much in number: Alzheimer's Disease affects more than 4 million Americans today, and the number is expected to multiply rapidly as the population ages. Major publishers are multiplying the number of titles offered in digital form.\n[ I ] of living things, to increase by producing new young animals, bacteria, etc.: 18 birds multiplied to 100 in just three years. In warm weather these germs multiply rapidly.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsubtraction sign\ntable\ntimes\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nRelated word\nmultiplication\nmultiply verb [I/T]\n(calculate)\nAdd to word list\nAdd to word list\nmathematics to add a number to itself a particular number of times: [ T ] If you multiply 7 by 15 you get 105.\nmultiply verb [I/T]\n(INCREASE)\nto increase greatly in number: [ I ] The viruses multiply within the body.\nAdd to word list\nAdd to word list\nto increase a lot in number or to make something do this: Lawsuits against big drugs companies have multiplied in recent years. According to Peruvian authorities, chemical fertilizers are multiplying coca leaf production by up to 1,000% per hectare.\nif you multiply a number, you add another number to it a particular number of times: multiply sth by 6/50/120, etc. Multiply your income by 3 to get a rough idea of what size of mortgage you can apply for.be multiplied by 6/50/120, etc. The total figure must be multiplied by 75% to produce the amount paid out to investors. They learn how to add, subtract, divide, and multiply."}