{"id":235961,"name":"murder","type":"noun","us_sound":"ˈmɝː.dɚ","us_link":"../audio/m/murder.mp3","uk_sound":"ˈmɜː.dər","uk_link":"../audio/m/ukmunif006.mp3","content":"murder noun [C or U]\n(CRIME)\nAdd to word list\nAdd to word list\nB1 the crime of intentionally killing a person: Two sisters have been charged with (= officially accused of) murder. There were three murders in the town last year. The three were convicted of (= proved guilty of) murder. a murder weapon (= a weapon used to commit a murder) Compare\nmanslaughter\nsuicide (DEATH)\nMore examplesFewer examplesThe newspaper article included a gruesome description of the murder.He was imprisoned in 1965 for attempted murder.He was imprisoned in 1945 for the brutal murder of a twelve-year old girl.He has admitted committing several crimes, including two murders.He died in mysterious circumstances, and there is still a possibility that it was murder.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish something off\npop off\nput someone to the sword idiom\nregicide\nrub\nslaughter\nsnuff\nthrottle\nSee more results »\nmurder noun [C or U]\n(GROUP)\na murder of crows\na group of crows (= large black birds): The crow's association with death as a result of its tendency to scavenge on the battlefield probably led to the sinister term 'murder of crows'.\nSee more Idioms\nbe murder\nbe murder on something\nB1 to commit the crime of intentionally killing a person: Her husband was murdered by gunmen as she watched. In the last year, terrorists have murdered several local journalists.\ninformal If you say you will or could murder someone, you mean you are very angry with them: If he's late again, I'll murder him!\ninformal to do or perform something very badly, so that you spoil it completely: karaoke singers who murder pop classics\nMore examplesFewer examplesShe had murdered or connived at the murder of one of her lovers.She has been charged with conspiracy to murder.He'd do anything to cover his ass, including lie, cheat and murder.He murdered his victims with a crowbar.His daughter was murdered by a drug addict.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish something off\npop off\nput someone to the sword idiom\nregicide\nrub\nslaughter\nsnuff\nthrottle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAngry and displeased\nFailing and doing badly\nIdiom\ncould murder something\nAdd to word list\nAdd to word list\nthe crime of intentionally killing a person: [ C ] There were three murders in the town last year. [ U ] He was convicted of murder.\nIf you say that something is murder, you mean it is very difficult or takes a lot of work: [ U ] It’s murder finding a parking space in this neighborhood. murder verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈmɜr·dər/\nHer husband was murdered. murderer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈmɜr·dər·ər/\na convicted murderer"}