{"id":236441,"name":"must","type":"modal verb","us_sound":"mʌst","us_link":"../audio/m/must.mp3","uk_sound":"mʌst","uk_link":"../audio/m/ukmusic009.mp3","content":"must modal verb\n(NECESSARY)\nAdd to word list\nAdd to word list\nA2 used to show that it is necessary or very important that something happens in the present or future: Meat must be cooked thoroughly. I must get some sleep. You mustn't show this letter to anyone else. Luggage must not be left unattended (= it is against the rules).formal Must you leave so soon?formal \"Must I sign this?\" \"Yes, you must.\"\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nIf you say that you must do something, you mean that you strongly intend to do something in the future: I must phone my sister. We must get someone to fix that wheel.UK I mustn't bite my nails.\nused for emphasis: I must say, you look absolutely great. I must admit, I wasn't looking forward to it.\nB1 If you tell someone else that they must do something pleasant, you are emphasizing that you think it is a good idea to do that: You must come and stay with us one weekend. We must meet for lunch soon.\nMore examplesFewer examplesI must do some ironing tonight.Food must be heated to a high temperature to kill harmful bacteria.You must give the bank a written notification if you wish to close your account.Soldiers must obey orders.Candidates must answer two questions from each paper.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessary evil\nnecessitate\nnecessity\nneed\nneeded\nowe\nsymbiotic\nsymbiotically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nLinguistics: very & extreme\nEncouraging and urging on\nmust modal verb\n(PROBABLY)\nB2 used to show that something is very likely, probable, or certain to be true: Harry's been driving all day - he must be tired. There's no food left - we must have eaten it all. When you got lost in the forest you must have been very frightened. \"You must know Frank.\" \"No, I don't.\"\nMore examplesFewer examplesThere must be a phone directory in the office somewhere.There's water on the floor - we must have a leak.Try to imagine what life must have been like for Neolithic man 10,000 years ago.The letter must have gone astray in the post.Why am I under arrest? There must be some mistake.\nSMART Vocabulary: related words and phrases\nConcluding and deducing\nanalysis\ndeduce\ndeducible\ndeduction\ndeductive\ndeductively\ndiagnosis\ngather\nhypothetico-deductive\nimply\nimpute something to someone\nin the last/final analysis idiom\ninconclusively\ninduction\ninferential\nmaths\nnon-deductive\nperceive\nput something down to something\nput two and two together idiom\nSee more results »\nGrammar\nMustMust comes first in the verb phrase (after the subject and before another verb): …\nMust: formsMust comes first in the verb phrase (after the subject and before another verb): …\nMust: usesWhen we think carefully about facts, we often use must to express deductions and conclusions from these: …\nMust and have (got) to?We usually use must to talk about obligations which come from the speaker and we generally use have (got) to when we refer to obligations that come from outside the speaker. …\nMust: typical errorsWe don’t use must to express obligation and necessity in the past. We use had to instead: …\nsomething that is necessary: If you live in the country a car is a must.\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nSMART Vocabulary: related words and phrases\nImportant and essential things\n-based\namenity\nbare\nbe-all\nbig league\nfocal point\nforeground\nfundament\ngrandaddy\nheavyweight\nhot button\nimperative\nneed\nnexus\nnub\nnucleus\npivot\nprecondition\nthe grandaddy of something idiom\nthe name of the game idiom\nSee more results »\na must-do, must-have, must-see, etc.\nsomething that is so good, you must do it, have it, or see it: The cashmere scarf is this season's must-have. It's a moderately entertaining film but it's certainly not a must-see.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomely\nhomey\nindulgent\nindulgently\njovial\nsensually\nsensuous\nsensuously\nserendipitous\nsweeten\nSee more results »\nmust modal verb\n(BE NECESSARY)\nAdd to word list\nAdd to word list\nused to show that it is necessary or important that something happen in the present or future: Seeing what others have and she lacks, she believes that she must have more. We must not surprise them (= it is wrong, dangerous, or forbidden).\nIf you say that you must do something, you can mean that you have a firm intention to do something in the future: I must call my sister later.\nMust is sometimes used for emphasis: I must admit I enjoy these movies.\nmust modal verb\n(PROBABLY)\nused to show that something is likely, probable, or certain to be true: Death must be better than this. \"It must have been fun.\" \"No, it wasn’t.\"\nsomething that is necessary: If you live in the suburbs a car is a must."}