{"id":236537,"name":"mute","type":"adjective","us_sound":"mjuːt","us_link":"../audio/m/mute.mp3","uk_sound":"mjuːt","uk_link":"../audio/m/ukmusic020.mp3","content":"Add to word list\nAdd to word list\nsilent or not speaking: The president has remained mute about plans to curtail the number of immigrants. I gazed at her in mute admiration.\nold-fashioned offensive a word used to describe someone who is not able to speak, which was used by doctors in the past but is now offensive\nSMART Vocabulary: related words and phrases\nFalling silent and not speaking\nbe (on) non-speakers idiom\nbite\nbite something back\nbite your tongue idiom\nbutton your lip idiom\nclam\nclam up\ndraw\nhave nothing to say for yourself idiom\nmouth\nradio silence\nsilence is golden idiom\nspeak\nspeechlessly\nspeechlessness\nstick\nstick in someone's throat idiom\ntight-lipped\ntongue-tied\nwordless\nSee more results »\nmusic a device for changing the sound of a musical instrument, usually making it quieter: He was playing his trumpet with a mute.\neugenesergeev/iStock/Getty Images Plus/Getty Images /GettyImages\n(also mute button) a button on an electronic device that makes it silent: I pressed the mute on my phone so she couldn't hear the people talking in the background. He was watching TV with the mute button on. on mute\nhaving the mute button pressed on a device so that it does not produce any sound: Place your phone on mute or vibrate or turn it off completely. Advertising annoys me; I put the TV on mute during every ad break.\nold-fashioned offensive a word for someone who is not able to speak, which was used by doctors in the past but is now extremely offensive\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectrical switches & connections\nRecording sounds and images\nIf you mute a noise, or a device making a noise, you make it less loud or not able to be heard at all: Heavy curtains muted the noise of the traffic. She muted the TV so she could hear what he was saying. Don't forget to mute your microphone when another person on the call is speaking.\nto make a person unable to be heard, for example when using video conferencing software: Automatically mute participants as they join the meeting, and allow participants to unmute themselves if they want to speak to others in the meeting.\nmusic\n&#160; specialized If you mute a musical instrument, you attach a device to it that changes its sound, usually making it quieter: The song features muted trumpets.\nto stop someone's messages, pictures, etc. appearing on a social media website when you look at it, without removing the person as a friend: Instagram now lets you mute your friends.\nSMART Vocabulary: related words and phrases\nSilence & quiet\ncrickets idiom\ndeafening\ndeafeningly\nhushed\ninaudibly\nkeep it down idiom\nkeep something down\nmuffled\nmuted\nquiet\nquietness\nradio silence\nsilent\nsilently\nsoundlessly\nsubdued\ntrail\ntrail away/off\nunder your breath idiom\nunmute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nPlaying music\nInternet, email and texting conventions\nCommunicating & keeping in touch\nAdd to word list\nAdd to word list\n(of a person) completely unable or unwilling to speak, or (of a place, object, or activity) silent: He stood mute before the judge. The decay of Dawson City bore mute testimony to the end of the gold rush era."}