{"id":236634,"name":"mutuality","type":"noun","us_sound":"ˌmjuː.tʃuˈæl.ə.t̬i","us_link":"../audio/m/cdo0623usmutu2653.mp3","uk_sound":"ˌmjuː.tjuˈæl.ə.ti","uk_link":"../audio/m/cdo0623ukmutu2656.mp3","content":"mutuality noun [U]\n(BEHAVIOUR)\nAdd to word list\nAdd to word list\nbehaviour in which two or more people or groups feel the same emotion, or do the same thing to or for each other: The building of new suburban estates undermined the mutuality of inner city communities. This mutuality demonstrates the students' social engagement with each other. Synonym\nreciprocity\nMore examplesFewer examplesTheir relationships emphasize the need for mutuality and respect for individual differences.\nSMART Vocabulary: related words and phrases\nReciprocating\nanother\neach other\ngive and take\nit takes two to tango idiom\nmutual\nmutually\nnon-reciprocal\none another phrase\none good turn deserves another idiom\nping-pong\nreciprocally\nreciprocate\nreciprocation\nreciprocity\nrequite\nreturn\nscratch\nturn\nunrequited\nyou scratch my back and I'll scratch yours idiom\nSee more results »\nmutuality noun [U]\n(FINANCIAL ORGANIZATION)\nthe fact or principle of a financial organization being owned by its members, rather than by shareholders (= people who own shares in it): The bank is showing the value of mutuality with attractive rates for savers. The business needs to demonstrate the benefits of mutuality.\nMore examplesFewer examplesThe members are holding a formal vote on abandoning mutuality.The movement is based on the principles of mutuality.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\ndebit\nelectronic banking\ngiro\ninvestment bank\nlandbanking\npay\nsafe deposit box\nstatement\nstress test\nsuperbank\nSee more results »\nRelated word\nmutual\nAdd to word list\nAdd to word list\na situation in which a financial organization is owned by its members rather than shareholders, allowing members to share any profits: With the insurer's traditional business in decline, it needs to find new ways for members to benefit from the company's mutuality. The building society confirmed that it was to reward members with a mutuality bonus of £1,000."}