{"id":236626,"name":"mutual","type":"adjective","us_sound":"ˈmjuː.tʃu.əl","us_link":"../audio/m/mutual.mp3","uk_sound":"ˈmjuː.tʃu.əl","uk_link":"../audio/m/ukmutto002.mp3","content":"Add to word list\nAdd to word list\nC1 (of two or more people or groups) feeling the same emotion, or doing the same thing to or for each other: Theirs was a partnership based on mutual respect, trust and understanding. Both countries are acting to their mutual advantage. The agreement was terminated by mutual consent.\nMore examplesFewer examplesThe two groups have existed in a state of mutual distrust for centuries.The peace talks broke down and ended in bitter mutual recriminations.She disliked Paul, and the feeling was mutual.They seem to live in mutual harmony.We have a mutual dislike of dogs.\nSMART Vocabulary: related words and phrases\nReciprocating\nanother\neach other\ngive and take\nit takes two to tango idiom\nmutualism\nmutually\nnon-reciprocal\none another phrase\none good turn deserves another idiom\nping-pong\nreciprocally\nreciprocate\nreciprocation\nreciprocity\nrequite\nreturn\nscratch\nturn\nunrequited\nyou scratch my back and I'll scratch yours idiom\nSee more results »\na financial organization that is owned by its members, rather than by shareholders\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\ndebit\nelectronic banking\ngiro\ninvestment bank\nlandbanking\npay\nsafe deposit box\nstatement\nstress test\nsuperbank\nSee more results »\nAdd to word list\nAdd to word list\n(of two or more people or groups) feeling the same emotion, or doing the same thing to or for each other: The organization promotes mutual understanding between peoples. We let the subject drop, by mutual agreement.\nA mutual friend is someone who is a friend of each of two or more other people: They were gossiping about parties and mutual friends.\nAdd to word list\nAdd to word list\nused to describe something that is done or felt by all or both people in a group: by mutual agreement/consent He has now left the company by mutual agreement.mutual benefit/advantage Firms often do business together for purposes of mutual benefit.mutual respect/understanding/interest Ours will be a partnership based on fairness and mutual respect. a mutual decision\nFINANCE used for describing a financial organization that is owned by its members, rather than by shareholders: We are a mutual building society and that means we can pay good savings rates to customers instead of paying out dividends to shareholders.\n(also mutual company) a financial organization such as a building society that is owned by its members, rather than by shareholders: Some mutuals converted to banks. See also\ndemutualize"}