{"id":225912,"name":"my","type":"determiner","us_sound":"maɪ","us_link":"../audio/m/my.mp3","uk_sound":"maɪ","uk_link":"../audio/m/ukmutto011.mp3","content":"Add to word list\nAdd to word list\nA1 of or belonging to me (= the speaker or writer): my parents my feet my name my jacket It wasn't my fault.formal She was somewhat surprised at my asking (= that I asked) for the book to be returned. See also\nI, i (LETTER)\nme pronoun\nmine pronoun my own\nused to emphasize that something belongs to or is connected with me and no one else: I want my own car.\nSee more\nused in front of a noun as a way of expressing love or as a polite or humorous form of address: My darling! Do you want any help, my dear?\nrelating to a part of some websites where you can choose to see only the information that is important to you\nMore examplesFewer examplesI'm sure I left my purse on the desk.I haven't had my holiday photos developed yet.I failed my History A level.I had a chat with my boss today about a possible salary increase.Both my parents are teachers.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nYou can also find related words, phrases, and synonyms in the topics:\nAffectionate terms of address\nInternet terminology\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nused to express surprise or pleasure: My, what delicious food! My, oh, my, what a busy day!\nSMART Vocabulary: related words and phrases\nExpressions of surprise\naccha\nachha\nactually\nay\nbegorrah\nblow\nclutch\nfancy\nglory\nheavens (above)! idiom\nhell's bells\nhold on idiom\nhow about that? idiom\nI ask you! idiom\nomg\nsagebrush\nsheesh\nshit\nshock, horror! idiom\nshut\nSee more results »\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nAdd to word list\nAdd to word list\nbelonging to or connected with me; the possessive form of I, used before a noun: I think about my father and my mother. He wanted to be my friend. My mind went absolutely blank. my own\nMy own is used to emphasize that something belongs to or is connected with me and no one else: I bit my own hand. Idioms\nbe my guest\nmy, (oh, my)"}