{"id":230551,"name":"mystic","type":"noun","us_sound":"ˈmɪs.tɪk","us_link":"../audio/m/mystic.mp3","uk_sound":"ˈmɪs.tɪk","uk_link":"../audio/m/ukmutto023.mp3","content":"Add to word list\nAdd to word list\nsomeone who attempts to be united with God through prayer: François Leclerc du Tremblay, also known as Père Joseph, was a French diplomat and mystic. He says that a mystic inspired him to run for office.\nMore examplesFewer examplesMystics have always known that we create our own reality.Crying became a part of spiritual discipline for many mystics.It is tempting to think of him as a secular mystic.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nnon-believer\nsecularist\nthe laity\ntheist\ntheistic\nunbelief\nunbeliever\nSee more results »\nrelating to magic or having magic powers, especially of a secret, dark, or mysterious kind: The town is full of shops selling tarot cards, books about ley lines, and mystic amulets. The whole scene has a mystic, fairy-tale quality. Synonyms\nmagical\nmystical\nrelating to the belief that there is hidden meaning in life, or that each human being can unite with God: The story depicts how a soul gains mystic knowledge. Synonym\nmystical\nMore examplesFewer examplesThere seemed to be some mystic powers at work.He went to India to learn more about the mystic healing powers of yoga.Her grandmother was into the mystic religion \"espiritismo\".\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nconjure\nenchantment\nescapology\nevil\nhex\nmagic word\nmagical\nmagically\nmugwort\nmystical\nthe evil eye idiom\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe supernatural - general words\nAdd to word list\nAdd to word list\na person who tries to communicate directly with God or other forces controlling the universe: His ideas might sound familiar to New Age mystics today."}