{"id":230773,"name":"myth","type":"noun","us_sound":"mɪθ","us_link":"../audio/m/myth.mp3","uk_sound":"mɪθ","uk_link":"../audio/m/ukmyth_001.mp3","content":"myth noun\n(ANCIENT STORY)\nAdd to word list\nAdd to word list\nB2 [ C or U ] an ancient story or set of stories, especially explaining the early history of a group of people or about natural events and facts: ancient myths The children enjoyed the stories about the gods and goddesses of Greek and Roman myth. Most societies have their own creation myths. Compare\nepic noun\nfolk tale\nlegend (STORY)\nsaga\nMore examplesFewer examplesIn Greek myth, love is personified by the goddess Aphrodite.The play is an adaptation of the Greek myth of Orpheus.\nSMART Vocabulary: related words and phrases\nAccounts and stories\nanecdote\nanother\nanti-narrative\nbe another story idiom\nbrushstroke\ncautionary tale\ncommentary\nlore\nmisdescription\nmulti-stranded\nmythic\nmythical\nplot\nsemi-legendary\nshaggy-dog story\nshort story\nsleeping beauty\nsob story\nstrand\nwrite something up\nSee more results »\nmyth noun\n(FALSE IDEA)\nC1 [ C or U ] disapproving a commonly believed but false idea: Statistics disprove the myth that women are worse drivers than men. It can be difficult to disentangle fact from myth. See also\nurban myth\nMore examplesFewer examplesIt's a myth that you have to wash your hair every day.The article rebuts five myths about the Vatican. The organization has peddled the myth that they are supporting the local population.The popular myth is that air travel is more dangerous than travel by car or bus.\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsehood\nfalsification\nfeed someone a line idiom\nfib\nfiction\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\nAdd to word list\nAdd to word list\nliterature a traditional story, esp. one which explains the early history or a cultural belief or practice of a group of people, or explains a natural event: [ C ] Kids like the stories about the gods and goddesses of Greek and Roman myths.\nA myth is also a commonly believed but false idea: [ C ] Equal opportunity continues to be a myth for many. mythological adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌmɪθ·əˈlɑdʒ·ɪ·kəl/\nmythological tales"}