{"id":25508,"name":"baby","type":"noun","us_sound":"ˈbeɪ.bi","us_link":"../audio/b/baby.mp3","uk_sound":"ˈbeɪ.bi","uk_link":"../audio/b/ukazt__013.mp3","content":"Add to word list\nAdd to word list\nA1 a very young child, especially one that has not yet begun to walk or talk: a newborn baby a six-week-old baby a baby boy baby clothes baby food Sandra had a baby (= gave birth to it) on 29 May. Owen is the baby (= the youngest person) of the family.\nThesaurus: synonyms, antonyms, and examples\na babybabyShe is having a baby in the spring.newbornNewborn babies are not able to focus their eyes fully for the first few weeks of life.new babyBringing home a new baby can be a confusing time for parents.bundle of joyCongratulations on bringing home your little bundle of joy!neonateThe doctor headed up a study on perception in neonates.infantInfants under 2 years of age must travel on an adult's lap.\nSee more results »\nEmma Kim/Cultura/GettyImages\nA2 a very young animal: a baby elephant/monkey\ndisapproving an adult or especially an older child who is crying or behaving like a child: It didn't hurt that much - don't be such a baby!\nmainly US a word you can use when you are talking to someone you love such as your wife, husband, partner, etc.: Oh baby, I love you. baby carrot, sweetcorn, etc.\na type of vegetable that is specially grown to stay small: I keep a bag of baby carrots on my desk to stop me eating crisps.\nSee more\ninformal Someone's baby is something that they have a special interest in and responsibility for: I don't know much about the project - it's Philip's baby.\nMore examplesFewer examplesThe baby lay in his cot, cooing, and gurgling.A new baby will automatically curl its fingers round any object it touches.Their baby was born last December.She wrapped the baby in a blanket.She has had three babies in the past five years.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby boom\ncrawler\ndesigner baby\ndevil\ndiddums\ndummy\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal young\nHeroes and cowards\nAffectionate terms of address\nDuty, obligation and responsibility\nto treat an older child as if he or she were a much younger child: The boys were now ten and twelve and didn't want their mother to baby them. Synonyms\ncoddle (PROTECT)\ncosset\nindulge\nmollycoddle informal mainly disapproving\npamper\nspoil\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbandobast\nbastion\nbe on the door phrase\nbuffer\ncocoon\ndefend\ndefensive\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\ninoculation\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParenting & caring for children\nAdd to word list\nAdd to word list\na very young child: Sandra had a baby on May 29th. My younger brother is the baby of the family.\nBaby can be used to refer to anything young or smaller than usual: baby corn/lima beans\ndisapproving Baby can also mean someone who is behaving childishly: She complained like a baby about her boyfriend.\ninfml Baby is an affectionate way of addressing someone.\ninfml A baby can also be a project or job someone has a special interest in or responsibility for: The new computer system is really Phil’s baby.\nto treat an older person like a young child: Some parents baby their children too much. I like to be babied when I’m sick."}