{"id":25997,"name":"backup","type":"noun","us_sound":"ˈbæk.ʌp","us_link":"../audio/b/eus70419.mp3","uk_sound":"ˈbæk.ʌp","uk_link":"../audio/b/ukbacks003.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] (someone or something that provides) support or help, or something that you have arranged in case your main plans, equipment, etc. go wrong: We're going to need some professional backup for this project. The party is going to be outdoors, so we'll need to organize somewhere as a backup in case it rains. Remember, your colleagues are your backup system when things go wrong.\nB2 [ C ] a copy of information held on a computer that is stored separately from the computer: Before we leave work each day, we make a backup of all the records we have entered into the computer that day. The department's backup disks are all stored in a different building.\n[ C ] US a player who plays when the person who usually plays is not available: He's a backup for the Dallas Cowboys.\nMore examplesFewer examplesThe paramedic who arrived first at the scene immediately called for backup.How can I run the pub on my own all evening without any backup?It is essential to have backup when you go diving, in case anything goes wrong.If we run out of sandwiches I've got some pizzas in the kitchen as backup.My neighbour came along to provide some backup, in case the youths gave me any trouble.\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\nabettor\naccessory\naccomplice\nacolyte\naide\nally\nbuddy\ncollaborator\nconfederate\nden mother\nenabler\nlifesaver\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nsponsor\nstrength\nsupport group\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nsupporting the main singer, performer, etc. : backup vocals Willie moves to Chicago, where he becomes a backup artist for a sultry blues singer.\nSMART Vocabulary: related words and phrases\nSinging\na cappella\naccompaniment\naccompany\nalto\nanthem\nbanger\nbarbershop\ncroon\ncrooner\ndirge\nditty\ndiva\ndoxology\nintonation\nquintet\nraise the roof idiom\nrapping\nscreamer\nseptet\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of music\nbackup noun [C/U]\n(SUPPORT)\nAdd to word list\nAdd to word list\nsupport or help, or someone or something that provides support or help: a backup generator They didn’t realize when they hired him that he had a backup band. We want to have the factual backup to make our case.\nbackup noun [C/U]\n(EXTRA COPY)\nan extra copy of information on a computer that is stored separately: Did you make a backup of these files?\nAdd to word list\nAdd to word list\na person, plan, piece of equipment, etc. that you can use to replace another if necessary: I use my other email account as a backup. The company is exploring alternative sources to provide backup for materials when the suppliers cannot deliver. Remember that your colleagues are your backup system when things go wrong.\nIT an extra copy of the information on a computer, that is stored separately: Keep a backup of your data in case a drive fails."}