{"id":25710,"name":"back","type":"adverb","us_sound":"bæk","us_link":"../audio/b/back.mp3","uk_sound":"bæk","uk_link":"../audio/b/ukazt__024.mp3","content":"back adverb\n(RETURN)\nAdd to word list\nAdd to word list\nB2 in, into, or towards a previous place or condition, or an earlier time: look back He looked back and saw they were following him.put back When you take the scissors, remember to put them back. Looking at her old photographs brought back (= made her remember) a lot of memories. He left a note saying \"Gone out. Back soon.\"be back She went to Brazil for two years, but now she's back. I was woken by a thunderstorm, and I couldn't get back to sleep (= could not sleep again). The last time we saw Lowell was back (= at an earlier time) in January.date back to This tradition dates back to the 16th century.\nA2 in return: If he hits me, I'll hit him back. You're not just going to let her say those things about you without fighting back, are you?\nA2 in reply: I'm busy at the moment - can I call you back? I wrote to Donna several months ago, but she hasn't written back yet.\nused about watching something that has been recorded, especially after experiencing it in real life: I haven't watched the race back on video and I think I never will. It is a good idea to record the conversation, then the customer can view it back at his or her convenience. When I saw the tackle back on video, it was clear that a penalty should have been given.\nMore examplesFewer examplesAfter the trip, it was nice getting back to a few home comforts.She thinks he'll come back, but she's deceiving herself.That's enough, Peter. Give those toys back, please.I think I locked the door but I'll go back and check just to make sure.When I look back I can see where we went wrong.Will you put the books back when you've finished with them?\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\naside\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nreverse\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReturning to a place\nRevenge and vengefulness\nAnswering & responding\nStarting again\nback adverb\n(FURTHER AWAY)\nB2 further away in distance: If we push the table back against the wall, we'll have more room. \"Keep back!\" he shouted, \"Don't come any closer!\" He sat back on the sofa. She threw back her head and laughed uproariously. The house is set back from the street.\nThesaurus: synonyms, antonyms, and examples\nin the opposite to a forward directionbackwardsUK The dog growled and I took a step backwards.backHe leant back on the sofa.in reverseI put the car in reverse.the wrong way aroundThe batteries are in the wrong way around.back to frontUK He always wears his baseball cap back to front.\nSee more results »\nMore examplesFewer examplesPlease stand back - then all of you will be able to see what I'm doing.The line of traffic stretched back several miles.Could you stand back from these shelves and tell me if they're level?Our house is set back from the road.As the body was carried through the crowd, people drew back respectfully.\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\naside\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nreverse\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nSee more results »\nGrammar\nBackBack is an adverb, noun, adjective or verb. …\nBack as an adverb[taking a photograph] …\nBack as a noun …\nBack as an adjective …\nBack as a verb[talking about a pet dog] …\nIdioms\nback and forth\nback in the day\nback then\nback to square one\nback noun [C]\n(FURTHEST PART)\nA2 the inside or outside part of an object, vehicle, building, etc. that is furthest from the front: out the back Ted was out the back.round the back If there's no reply at the front door, come round the back. He jotted her name down on the back of an envelope. I found my tennis racket at the back of the cupboard. We sat at the back of the bus. Our seats were right at the back of the auditorium. There is a beautiful garden at the back of (= behind) the house. He put his jacket on the back of his chair (= the part of the chair that you put your back against when you sit on it). back to back\nclose together and facing in opposite directions: The office was full of computers, and we had to sit back to back in long rows.\nhappening one after another, without interruption: Coming up after the break, three Rolling Stones classics back to back.\nSee more back to front C2 UK (US backwards)\nwith the back part of something where the front should be: You've put your jumper on back to front.\nSee more the back of your hand\nthe side of your hand that has hair growing on it: He kissed the back of her hand.\nSee more\nMore examplesFewer examplesI always keep a tool set in the back of my car.She lay on the grass and the stiff dry grass prickled the back of her legs.The previous owner of the house had built an extension on the back.I found her kneeling in prayer at the back of the church.The keyboard plugs in at the back of the computer.\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nbase\nbases\nbed\ncrust\nescutcheon\nface\nfront\nmeniscus\nmulti-sided\nnap\nobverse\noutside\noverlay\nplate\nrear\nside\nsubstrate\nsuperficialis\nsurface area\nSee more results »\nback noun [C]\n(BODY PART)\nA2 the part of your body that is opposite to the front, from your shoulders to your bottom: on your back He lay on his back, staring at the ceiling.turn your back I turned my back while she dressed. I have a bad back. Sleeping on a bed that is too soft can be bad for your back.\nfizkes/iStock/Getty Images Plus/GettyImages put your back out\nUK (US throw your back out) to cause a serious injury to your back: She put her back out lifting a box. He has had to withdraw from the competition after putting his back out.\nMore examplesFewer examplesThe dog rolled over onto its back.I pulled a muscle in my back lifting some drawers.I go to sleep on my back but I always wake up in a different position.Our dog has a black patch on his back.I've got a pain in my lower back.\nSMART Vocabulary: related words and phrases\nThe human torso\n-bellied\n-chested\nabs\naxilla\nbread basket\nbreast\nchest\ncoeliac\ndiaphragm\nflank\ngroin\npot\nshoulder\nspare tyre\nthoracic\nthorax\numbilicus\nvisceral muscle\nwaisted\nwaistline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInjuring and injuries\nback noun [C]\n(SPORT)\n(in some sports, such as football) one of the players in a team who try to stop players from the other team from scoring goals, rather than trying to score goals themselves: He plays at left back. Compare\nforward noun\nin sports such as American football and rugby, one of the players in the team who stand farthest away from the ball when the action starts: The big back scored all three of the team's touchdowns. We rarely managed to get the ball out to the backs.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nAmerican football\nRugby\nGrammar\nBackBack is an adverb, noun, adjective or verb. …\nBack as an adverb[taking a photograph] …\nBack as a noun …\nBack as an adjective …\nBack as a verb[talking about a pet dog] …\nIdioms\nat/in the back of your mind\nthe back of beyond\nin back of\nbe on someone's back\nbehind someone's back\nbend your back\nsomeone could do something with one arm/hand tied behind his/her back\nget off someone's back\nhave (got) someone's back\nhave your back to/against the wall\nMore idioms\non the back of something\non the back of someone/something\nsomeone's back is turned\nput/get someone's back up\nback verb\n(SUPPORT)\nC2 [ T ] to give support to someone or something with money or words: The management has refused to back our proposals.\nMore examplesFewer examplesThis theory needs to be backed up with solid empirical evidence.The troops were backed by tanks, artillery, and other heavy armour.It is hoped that all sides will back the peace plan.A poll indicated that 77 percent of Americans backed the president's plan, with only 6 percent in opposition.Although Paris backs the U.N. demands, it has made it clear it will not take part in any new military action.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInvesting money\nback verb\n(RISK MONEY)\nto risk money by saying that you think a horse, team, etc. will win a race, game, or competition in order to win more money if they do: The horse I backed came in last.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nback verb\n(MOVE AWAY)\nC2 [ I or T, + adv/prep ] to (cause to) move backwards: Please could you back your car up a few feet so that I can get mine out of the driveway?back into Ann gave up driving when she backed the car into the garage door.\nThesaurus: synonyms, antonyms, and examples\nto go backwardsreverseThe road ahead was blocked by a tree so I had to reverse. backI backed into the drive.back upI backed up into an empty parking space.retreatShe retreated hastily back up the stairs.pull backUN peacekeepers have pulled back from the border.withdrawThe British army withdrew from Dunkirk in 1940.\nSee more results »\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\nlock\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nback verb\n(COVER)\n[ T ] to cover the back of something with a material, often to make it stronger or thicker: The material is backed with a heavy lining.\nSMART Vocabulary: related words and phrases\nKnitting & sewing\nappliqué\nappliquéd\nAran\nBargello\nbaste\nhandknit\nhandknitted\nhank\nhem\nintarsia\nreknit\nresew\nrib\nrun something up\nrunning stitch\nsampler\nseam\nseamstress\nsew\nstitch\nSee more results »\nGrammar\nBackBack is an adverb, noun, adjective or verb. …\nBack as an adverb[taking a photograph] …\nBack as a noun …\nBack as an adjective …\nBack as a verb[talking about a pet dog] …\nIdiom\nback the wrong horsePhrasal verbs\nback away\nback down\nback off\nback onto something\nback out\nback someone up\nback something up\nback (something) up\nback up\nback adjective [before noun]\n(POSITION)\nat or near the back of something: She left the house by the back door. The back seat of the car folds down.\nMore examplesFewer examplesIt says on the back cover of the book 'highly commended'.She skidded off the road when her back wheels hit an icy patch.They sat in the back row of the cinema kissing and cuddling.Let's take our drinks out into the back garden.Apparently one of her back teeth is very sore.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nposition\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nback adjective [before noun]\n(PAID LATER)\npaid after the end of a period of time when it should have been paid: They owe the staff several thousand in back pay. He owes a lot in back taxes.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEarning money\nGrammar\nBackBack is an adverb, noun, adjective or verb. …\nBack as an adverb[taking a photograph] …\nBack as a noun …\nBack as an adjective …\nBack as a verb[talking about a pet dog] …\nIdioms\non the back burner\ntake a back seat\nback adverb [not gradable]\n(RETURN)\nAdd to word list\nAdd to word list\nin, at, or toward a previous place or condition or an earlier time\nBack can also mean in return:\nback adverb [not gradable]\n(FARTHER AWAY)\nfarther away; to a farther place Idioms\nback to the drawing board\nback and forth\nback in the saddle\nback to basics\nback adjective [not gradable]\n(RETURNED)\nhaving returned to a previous place or condition\nback adjective [not gradable]\n(AT THE BACK)\nat or near the back of something Idiom\non the back burner\nback noun\n(FARTHEST PART)\n[ U ] the part of something that is farthest from the front\n[ U ] The back of your hand is the side opposite the palm that has hair growing on it.\nback noun\n(BODY PART)\n[ C ] the part of your body opposite the front, from your neck to the top of your legs\n[ C ] The back of a seat is the part your back leans against.\nIdioms\nsomeone's back is turned\nin back of\nin the back of your mind\nback verb\n(SUPPORT)\n[ T ] to give support to someone or something with money or words\nback verb\n(MOVE BACKWARD)\n[ I/T ] to move backward Phrasal verbs\nback down\nback out\nback up (something)\nback up (something)\nback up someone/something\nback up something\nAdd to word list\nAdd to word list\nto give support or approval to someone or something: Shareholders will be asked to back the proposals.\nFINANCE to provide financial support for someone or something: A handful of firms will sell more than $2 billion of bonds backed by home equity, credit card, and other loans. Demand continues for government-backed loans. Investors are snapping up asset-backed bonds. Phrasal verbs\nback out (of sth)\nback sb/sth up\nback sth up\nback pay/rent/tax, etc.\npay, rent, tax, etc. that should have been paid or was expected at an earlier time: Most of the back taxes due were for the years 2006 through 2008.\non the back burner\nIf something is on the back burner, it is not being dealt with at the present time, especially because it is not urgent or important, but it will be dealt with in the future: Any plans of opening new restaurants are on the back burner until the recession ends. I lost my job and had to put my plans to move house on the back burner.\ntake a back seat\nto become less important (than something else): Agriculture, which generates only about $50 million a year in revenue, takes a back seat to other industries like oil and gas that bring in billions of dollars. Environmental issues take a back seat in tough economic times.\nto let other people have a more active and responsible position than you in an organization or activity: After appointing a new chief executive, the chairman of the fashion chain is finally taking a back seat at the business he founded.\nin return or reply: I'm busy at the moment - can I call you back? I e-mailed the customer services department and they said they would get back to me tomorrow."}