{"id":25804,"name":"background","type":"noun","us_sound":"ˈbæk.ɡraʊnd","us_link":"../audio/b/background.mp3","uk_sound":"ˈbæk.ɡraʊnd","uk_link":"../audio/b/ukbackc011.mp3","content":"background noun\n(PICTURE)\nAdd to word list\nAdd to word list\nB2 [ C ] the things that can be seen behind the main things or people in a picture: The artist himself did not paint the backgrounds to his pictures - they were done by his pupils. He has photographed her against lots of different backgrounds. They were filmed against a background of dark fir trees. The book's cover has white lettering on a blue background. The little figure that you can just see in the background of the photograph is me. Compare\nforeground noun\nMore examplesFewer examplesThe black lettering really stands out on that orange background.a white rose on a solid blue background\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npastel\npencil\nposter\nraster\nrehang\nscreen print\nshade\nsketch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: scenery & views\nAfter & behind\nbackground noun\n(SOUND)\nB2 [ S ] sounds that can be heard behind other sounds that are louder: If you listen carefully to this piece of music, you can hear a flute in the background. We couldn't hear what they were saying on the tape - there was too much background noise.\nMore examplesFewer examplesI could hear the strains of Mozart in the background.The computers were humming in the background.An airplane droned in the background.\nSMART Vocabulary: related words and phrases\nDescribing qualities of sound\naudibly\nboomy\nchocolatey\nchuff\nclomp\ncrackling\near-splitting\nlistenable\nmellifluously\nmelodically\nmelodious\nmelodiously\nmetallically\nraucous\nstaccato\nsymphonically\ntextured\nthready\ntinnily\ntunefully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAfter & behind\nbackground noun\n(SITUATION)\nB2 [ S or U ] the conditions that existed before a particular event happened, and that help to explain why it happened: These decisions have had to be made against a background of high unemployment. Can you give me some background on (= information about the conditions that existed before) the situation? the background\nC2 If someone or something is in the background, they are not the main point of attention: Her worries about her job have faded into the background since she learned about her father's illness.\nSMART Vocabulary: related words and phrases\nSituations and circumstances\naffair\nbackdrop\nbusyness\ncase\ncircumstance\ncomedy of errors\ncondition\nfarce\nfinancial affairs\nfooting\ngoing\nlandscape\nposition\npracticality\nscheme\nsituation\nsituational\nstake\nthe scheme of things idiom\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOf little or less importance\nbackground noun\n(FAMILY EXPERIENCE)\nB1 [ C ] your family and your experience of education, living conditions, money, etc.: The school has students from many different ethnic/cultural/religious backgrounds. They come from a privileged/wealthy background. a background in publishing\nMore examplesFewer examplesHis family background predisposes him to support the Democrats.Journalists were frantically researching the new prime minister's background, family, and interests.Since they discovered the truth about his background, his colleagues have regarded him with suspicion.She comes from an upper middle class background.When the authorities inquired into his background, they found he had a criminal record.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\nused to refer to something that is done before, and in preparation for, something else: Students are expected to do some background reading before the course starts. The book provides background information on the history of the region.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\nprep\npreparation\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\nSee more results »\nbackground noun\n(THINGS BEHIND)\nAdd to word list\nAdd to word list\n[ C/U ] things that appear to be farther away or behind what is nearer or in front, esp. in a picture: [ C ] He photographed the models against different backgrounds. [ U ] With so much noise in the background, I couldn’t hear what she was saying. [ C ] The city’s skyline was our background.\n[ C/U ] A background can also be whatever is happening around you but not involving you directly: Worry was always part of the background.\n[ C/U ]\n&#160; art In a painting or a story, the background is the people and things that are less important and not the main subject.\nbackground noun\n(EXPERIENCE)\n[ C ] the things that have made you into the person you are, esp. family, experience, and education: The school has students from many different backgrounds.\n[ C ] An event’s background is facts or history that help to explain how or why it happened: To understand the war, we need to consider its historical and political background.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; HR the type of experience, training, education, etc. that a person has: We have applicants from many different types of background. As well as a sound background in economics and statistics, the candidate must demonstrate an ability to communicate effectively. educational/professional backgroundeconomics/science, etc. background Applicants must have a strong engineering background.\n[ S or U ] the set of conditions that existed before a particular event, or information about them which helps to explain the event: So Deborah, why don't you give us a little background on the situation?\n[ U ]\n&#160; IT a computer feature that allows processes to continue without interrupting the user: Keep your firewall and antivirus programs running in the background."}