{"id":25860,"name":"backpack","type":"noun","us_sound":"ˈbæk.pæk","us_link":"../audio/b/backpack.mp3","uk_sound":"ˈbæk.pæk","uk_link":"../audio/b/ukbackc021.mp3","content":"Add to word list\nAdd to word list\na large bag used to carry things on your back, used especially by people who go camping or walking: It's a frame backpack with a belt and padded shoulder straps. Compare\nknapsack UK, old-fashioned or US\nhaversack old-fashioned\njonpic/E+/GettyImages\nSMART Vocabulary: related words and phrases\nContainers for carrying personal possessions\nattaché case\nbaggage\nbaggage allowance\nbillfold\nbindle\nbriefcase\nfanny pack\ngarment bag\ngrip\nhand luggage\nhandbag\npannier\npillbox\npocketbook\nportmanteau\nrucksack\nsack\nsaddlebag\nsatchel\nwashbag\nSee more results »\nto travel while carrying your clothes and other things that you need in a backpack, usually not spending very much money and staying in places that are not expensive: When we were students we backpacked in Thailand. Gavin and I backpacked our way around the world.\nUS to walk from place to place in the countryside, carrying the things you need in a backpack and camping at night: We backpacked in Sequoia National Park . He'd backpacked the Smokies.\nMore examplesFewer examplesThe couple backpacked across Europe for six weeks, spending nights in people's homes in Copenhagen, Berlin, Madrid, Florence and Rome. I was one of those young people in the '70s who hitchhiked and backpacked around the states with a dog-eared copy of On the Road. We backpacked some 40 miles along the creek.\nSMART Vocabulary: related words and phrases\nCamping\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\ncaravan site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\ntent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nMoving a long way on foot\nAdd to word list\nAdd to word list\na bag carried on the back, usually of cloth with many pockets and straps that go over your shoulders, used to carry things\nto walk long distances, carrying your things in a backpack: We backpacked through the Colorado Rockies last summer. backpacker noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈbæk·pæk·ər/\nA line of backpackers passed us on the trail."}