{"id":26141,"name":"bactrian","type":"noun","us_sound":"ˈbæk.tri.ən","us_link":"../audio/b/cdo0318usbact0371.mp3","uk_sound":"ˈbæk.tri.ən","uk_link":"../audio/b/cdo0318ukbact0124.mp3","content":"Bactrian noun\n(ANIMAL)\nAdd to word list\nAdd to word list\n[ C ] (also bactrian, bactrian camel) (also Bactrian camel) a type of camel (= a large animal that lives in the desert) with two humps (= raised areas) on its back: Camels, whether the single-humped dromedary or the two-humped Bactrian, are not easily loveable creatures. The picture showed him astride a Bactrian camel on the Great Wall of China. Compare\ncamel (ANIMAL)\ndromedary\nGlobalP/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThere are less than 1,000 wild bactrian camels left in China and Mongolia.The wild Bactrians had managed to withstand the absence of fresh water. Bactrians can reach 7ft tall and weigh 1,500lbs.\nSMART Vocabulary: related words and phrases\nWild mammals\naardvark\nanteater\narmadillo\nbandicoot\nbig beast\ngrizzly bear\nhedgehog\nhippopotamus\njavelina\njoey\npeccary\npine marten\nplatypus\npolar bear\npolecat\ntamandua\ntapir\nTasmanian devil\nTasmanian wolf\nthylacine\nSee more results »\nBactrian noun\n(ANCIENT PEOPLE)\n[ C ] a person from the ancient Asian country of Bactria: the king of the Bactrians\n[ U ] the language spoken by Bactrians: Latin, Greek, Bactrian, and (ancient) Slavonic have fewer declensions than Sanskrit.\nMore examplesFewer examplesHe established his rule over the Bactrians, Indians, and Cilicians.He could be a Mede, a Persian, or a Bactrian.\nSMART Vocabulary: related words and phrases\nNames of groups of people who lived in the past\nAnglo-Saxon\nAryan\nAztec\nCelt\nCeltic\nGreco-\nHebrew\nhun\nIndo-European\nIsraelite\nMayan\nMayanist\nnative\nNorseman\nPict\npie\nroman\nRomano\nSaxon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLanguage names\nbelonging to or relating to the ancient Asian country of Bactria, its people, or its language: the Bactrian people the Bactrian period\nMore examplesFewer examplesartifacts from cultures that flourished during Buddhist, Bactrian, Mauriyan, Indo-Greek, Kushan and Islamic periodsThe works blend Greek, Bactrian and nomadic traditions, reflecting Afghanistan's historical position at the crossroads of ancient civilizations. ancient Bactrian coinsa hoard of 2,000-year-old Bactrian gold jewelry and ornaments\nSMART Vocabulary: related words and phrases\nAncient history: before 500 AD\nancient\nancients\nantiquity\narchaic\nBronze Age\ncharioteer\ndolmen\nEuphrates\ngladiator\nglyph\nGrecian\nhieroglyph\nmummify\npalaeo-\npaleographical\nParthenon\npharaoh\npharaonic\nstele\nTigris\nSee more results »"}