{"id":26204,"name":"badging","type":"noun","us_sound":"ˈbædʒ.ɪŋ","us_link":"../audio/b/cdo1119usbadg0061.mp3","uk_sound":"ˈbædʒ.ɪŋ","uk_link":"../audio/b/cdo1119ukbadg0053.mp3","content":"Add to word list\nAdd to word list\na symbol or mark that is connected with a particular brand (= a type of product made by a particular company), especially a type of car: Both versions look the same from the outside, with no difference in badging.\na badge (= a small piece of metal or plastic carried or attached to clothing, or a symbol sewn onto clothing) that shows who someone is or which organization or group they belong to: Security companies are not allowed to use uniforms or badging that may be confused with a police officer.\nthe process of giving someone such as an employee a badge that shows who they are or which organization or group they belong to: The audit uncovered violations of regulations, including the badging of new employees prior to completing background checks.\nMore examplesFewer examplesThe badging, painted grille, special wheel styles and running boards distinguish the new model.Although it has new badging, the device does not appear to have any different functionality.The baseball cap is now a bit of personal badging, a crass way of aligning oneself with America, fitness, youth and consumerism.The software will handle accreditation and badging of over 50,000 participants in the Games.I have two people here waiting for somebody to pick them up to take them to badging and show them where they sit.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbegetter\nbig pharma\nbig tobacco\nboondoggle\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\ngeneric\nhaul\nmarque\nmover\nmulti-product\nnon-proprietary\nnotion\noutput\noverstock\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdentifying\nDecorations for clothes\nCeremonial clothes & objects\nTypes of employment\nOffice practices"}