{"id":26188,"name":"badge","type":"noun","us_sound":"bædʒ","us_link":"../audio/b/badge.mp3","uk_sound":"bædʒ","uk_link":"../audio/b/ukbacks020.mp3","content":"Add to word list\nAdd to word list\nB2 a small piece of metal or plastic with words or a picture on it, that you carry with you or fasten to your clothing or something else, in order to show who you are, that you are a member of a group, etc.: Everyone at the conference wore a badge with their name on . Don't forget to display your ID badge.\nJamie Grill/GettyImages\nUK (US button) a flat metal or plastic object, usually round, with a picture or message on it, that can be fastened to clothes with a pin, often in order to show that you like or support a particular group, idea, belief, etc.: They used to go round wearing badges with slogans like \"No nukes\" and \"Save the whale\". The birthday girl was wearing a badge with a nine on it.\nPeter Dazeley/The Image Bank/GettyImages\nUK (US patch) a small piece of cloth with words or a picture on it, that can be sewn onto clothes to show who you are, your rank, that you are a member of a particular group or organization, etc.: He sewed the school badge neatly onto his uniform. He collects old army badges.\nMartinPrescott/E+/GettyImages\nUS a small piece of metal carried by a police officer to prove who he or she is: The cop showed me her badge. He was asked to surrender his gun and badge.\navid_creative/E+/GettyImages\nMore examplesFewer examplesNew security measures require all visitors to sign in at reception and wear a visitor's badge.You have to show your parking badge on the windscreen of your car, or they'll tow your car away.She has all sorts of different badges pinned to her school bag.\nSMART Vocabulary: related words and phrases\nJewelry\nankle bracelet\nbangle\nbauble\nbe dripping with something idiom\nbutterfly\ncirclet\nclip-on\ncuff\ndrip\nearring\nengagement ring\nfinery\njewelled\njewellery\njewellery box\nrhinestone\nsignet ring\nsleeper\nsparkler\ntreasure\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecific signs and symbols\nBacking, supporting & defending\nIdiom\nbe a badge of something\nto put a badge or other mark on something: The car will be badged as an Opel for sale mainly in continental Europe and as a Vauxhall for sale in the UK.\nto give someone a badge: These self-printing badge kiosks ensure that attendees can be badged in moments.\nto describe something in a particular way: The allowance would be badged as a savings measure because of the welfare payments it would spare.\nMore examplesFewer examplesThe car is being badged as a Chevy, which suggests it will be at the affordable end of the scale.The next-generation Space Wagon is due in Japan next month, badged for the home market as the Chariot.These mortgage deals don't have to be badged \"first-time buyer\".\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\nstamp\ntagging\ntell something/someone apart\ntraceable\nSee more results »\nPhrasal verb\nbadge in\nAdd to word list\nAdd to word list\na small piece of metal worn to show your membership in a group or your authority within an organization such as the police\nAdd to word list\nAdd to word list\nWORKPLACE a small piece of metal, plastic, cloth, etc. that you wear on your clothing to identify who you are, the organization you belong to, etc.: A security guard checks each car, verifying that occupants have a company ID badge before letting them in."}