{"id":26231,"name":"badness","type":"noun","us_sound":"ˈbæd.nəs","us_link":"../audio/b/usbacch030.mp3","uk_sound":"ˈbæd.nəs","uk_link":"../audio/b/ukbacks027.mp3","content":"badness noun [U]\n(EVIL)\nAdd to word list\nAdd to word list\nthe quality of being evil or morally unacceptable: There is goodness and badness in everyone. Is this a case of badness or madness?\nMore examplesFewer examplesWe can define \"moral\" as being concerned with the judgment of the goodness or badness of human action and character.The casino is associated with money-laundering and other badness.the father who fears he's passed his badness onto his childrenShe never saw any badness in anyone.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissolute\ndissolutely\ndissoluteness\nenormity\nevil\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\nobscenely\nturpitude\nunconscionable\nunconscionably\nunethical\nunprincipled\nSee more results »\nbadness noun [U]\n(LOW QUALITY)\nthe fact of being very low in quality: I was amazed by the sheer badness of the film. He wrote poetry, known for its badness.\nMore examplesFewer examplesThis would be fine if the movie's badness was played for laughs, but it's not.The very badness of these books reminds us of other, better books.The badness of the painting is deliberate.\nSMART Vocabulary: related words and phrases\nNot of good quality\na miserable, poor, etc. excuse for something idiom\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbe an apology for something idiom\ndownscale\ninadequate\ninadequately\njanky\nmeretriciously\nshite\ntawdrily\ntawdriness\ntawdry\nthinness\nthird-class\ntrinket\nwretched\nSee more results »\nbadness noun [U]\n(SEVERE OR HARMFUL)\nthe quality of being severe, harmful, or unpleasant: Can you rate the badness of the pain on a scale from 1 to 10? I couldn't believe the badness of the weather.\nMore examplesFewer examplesWhatever we do, there are bad consequences, but you have to judge the relative badness of all the consequences.Each hurricane has its own brand of badness. According to this principle, the rightness or wrongness of an act is determined by the goodness or badness of its results.He seemed amazed at the badness of his own drunken condition.\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfrightful\nfrom hell idiom\nfun\nghastliness\nGothically\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nodious\nunpretty\nunspeakable\nunspeakably\nunsupportable\nunsympathetically\nSee more results »\nSee\nbad"}