{"id":26292,"name":"baggage","type":"noun","us_sound":"ˈbæɡ.ɪdʒ","us_link":"../audio/b/baggage.mp3","uk_sound":"ˈbæɡ.ɪdʒ","uk_link":"../audio/b/ukbag__005.mp3","content":"baggage noun [U]\n(BAGS)\nAdd to word list\nAdd to word list\nB1 bags, cases, etc. that you take with you when you travel: How many pieces of baggage do you have? We had to pay extra for our excess baggage (= our bags and suitcases that weighed more than was allowed). See also\nluggage\nCustomdesigner/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesFiona took so much baggage with her, we had difficulty getting it all on the coach.No one is allowed on the plane unless their baggage has been thoroughly checked.Can we leave our baggage at the hotel until it is time to leave for the airport?Passengers are allowed 20 kilos of baggage, plus one item of hand luggage.I asked Dad to look after the baggage while I went to buy the tickets.\nSMART Vocabulary: related words and phrases\nContainers for carrying personal possessions\nattaché case\nbaggage allowance\nbillfold\nbindle\nbriefcase\nbumbag\nexcess baggage\ngarment bag\ngrip\nhand luggage\nhandbag\nhatbox\npannier\npillbox\npocketbook\nrucksack\nsack\nsaddlebag\nsatchel\nschoolbag\nSee more results »\nbaggage noun [U]\n(FEELINGS)\nC2 the beliefs and feelings that influence how you think and behave: We all carry a lot of emotional baggage around with us.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\nsomeone's idea of something idiom\ntick\nSee more results »\nbaggage noun [U]\n(BAGS)\nAdd to word list\nAdd to word list\nthe bags that you take with you when you travel; luggage: How many pieces of baggage do you have?\nbaggage noun [U]\n(FEELINGS)\nthe beliefs and feelings that you have which influence how you think and behave: Everybody brings their own baggage to viewing a work of art.\nAdd to word list\nAdd to word list\nthe cases, bags, etc. that you take with you when you travel: Have a name tag on each piece of baggage. You'll need to put any sharp objects into your checked baggage.\ncarry-on/hand baggage\ncases or bags that you take onto a plane with you and are not checked in: I only had carry-on baggage so I went straight to the departure gate.\nexcess baggage\nbags, cases, etc. that weigh more than the weight you are allowed to take onto a plane, or the extra money you have to pay for it to be taken: On the return trip we were charged $80 excess baggage."}