{"id":26695,"name":"balancing","type":"verb","us_sound":"ˈbæl.əns","us_link":"../audio/b/balance.mp3","uk_sound":"ˈbæl.əns","uk_link":"../audio/b/ukbalal002.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nbalance\nB2 [ I or T ] to be in a position where you will stand without falling to either side, or to put something in this position: The flamingos balanced gracefully on one leg. She balanced a huge pot effortlessly on her head and walked down to the river.\nB2 [ T ] to give several things equal amounts of importance, time, or money so that a situation is successful: I struggle to balance work and family commitments.\n[ T ] to arrange a system that relates to money so that the amount of money spent is not more than the amount received: Stringent measures were introduced so that the government could balance its budget/the economy. balance the books\nto make certain that the amount of money spent is not more than the amount of money received: If the business loses any more money, we won't be able to balance the books this year.\nMore examplesFewer examplesHer suitcase was precariously balanced on the tiny luggage rack above her head.A see-saw balances at its fulcrum.The wine has just enough dryness to balance its fruitiness.Discover how eating raw food helps balance your body and aids digestion.At the moment the election seems balanced on a knife-edge.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\ntrade something off\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounting\nBudgeting money\nPhrasal verbs\nbalance something against something\nbalance (something) out/up"}