{"id":26684,"name":"balance","type":"noun","us_sound":"ˈbæl.əns","us_link":"../audio/b/balance.mp3","uk_sound":"ˈbæl.əns","uk_link":"../audio/b/ukbalal002.mp3","content":"balance noun\n(EQUAL STATE)\nAdd to word list\nAdd to word list\nB2 [ S or U ] a state where things are of equal weight or force: The toddler wobbled and lost his balance (= started to fall sideways). She had to hold onto the railings to keep her balance (= to stop herself from falling). New tax measures are designed to redress the balance (= make the situation more equal) between rich and poor. We must strike a balance between reckless spending and penny-pinching (= try to have something between these two things). Synonym\nequilibrium formal\n[ U ] The balance on a piece of electronic equipment for playing music is the particular mixture of different sounds, or the device that controls this. on balance\nB2 after thinking about all the different facts or opinions: I would say that, on balance, it hasn't been a bad year. On balance, I believe he was a good president. I think that on balance this is a safe city to live in. On balance, we support wind power as a source of clean energy. They have created a show that is, on balance, pretty entertaining.\nMore examplesFewer examplesHe lost his balance and tumbled over.The question threw him off balance for a moment.Teachers need to strike a delicate balance between instructing their pupils and letting them discover things for themselves.Most managers, politicians and bosses are men - how can women redress the balance ?The shift in the balance of power in the region has had far-reaching consequences.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\ntrade something off\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nAmplifiers, microphones & speakers\nbalance noun\n(WEIGHING MACHINE)\n[ C ] (US also balance scale) a device used for weighing things, consisting of two dishes hanging on a bar that shows when the contents of both dishes weigh the same\nSMART Vocabulary: related words and phrases\nMeasuring, weighing, & counting devices\ndial\ndipstick\nfitness tracker\ngage\ngamma counter\ngamma meter\ngauge\ngradation\nhydrograph\nindicator\nmicrometer\nplumb line\nprobe\nsensor\nsmart meter\nstraight edge\ntracker\nvoltmeter\nwand\nweather balloon\nSee more results »\nbalance noun\n(MONEY)\nB2 [ C usually singular ] the amount of money you have in a bank account, or the amount of something that you have left after you have spent or used up the rest: Once we know how much money we'll need, let's spend the balance (= the amount left). The company's success is reflected in its healthy bank balance.\n[ U ] Indian English the money that is returned to someone who has paid for something that costs less than the amount that they gave See also\nchange noun (MONEY)\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbastion\nbe left phrase\ncremains\ncutpiece\ndeposit\nground\nhangover\nredoubt\nrelic\nremainder\nremains\nremnant\nresidual\nrest\nsurvival\nthrowback\ntime capsule\nunallocated\nuneaten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\nPaying money\nIdioms\nin balance\nin the balance\nB2 [ I or T ] to be in a position where you will stand without falling to either side, or to put something in this position: The flamingos balanced gracefully on one leg. She balanced a huge pot effortlessly on her head and walked down to the river.\nB2 [ T ] to give several things equal amounts of importance, time, or money so that a situation is successful: I struggle to balance work and family commitments.\n[ T ] to arrange a system that relates to money so that the amount of money spent is not more than the amount received: Stringent measures were introduced so that the government could balance its budget/the economy. balance the books\nto make certain that the amount of money spent is not more than the amount of money received: If the business loses any more money, we won't be able to balance the books this year.\nSee more\nMore examplesFewer examplesHer suitcase was precariously balanced on the tiny luggage rack above her head.A see-saw balances at its fulcrum.The wine has just enough dryness to balance its fruitiness.Discover how eating raw food helps balance your body and aids digestion.At the moment the election seems balanced on a knife-edge.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\ntrade something off\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounting\nBudgeting money\nPhrasal verbs\nbalance something against something\nbalance (something) out/up\nbalance noun\n(POSITION)\nAdd to word list\nAdd to word list\n[ U ] the condition of someone or something in which its weight is equally divided so that it can stay in one position or be under control while moving: He jumped off the porch and lost his balance when he landed on the grass, falling to the ground. We’re teaching Sue how to ride a bike, but she’s still having trouble keeping her balance. The horse jumped the fence but landed off balance and fell.\n[ U ]\n&#160; art Balance in a work of art means that all the parts of it work together and no part is emphasized too much.\nbalance noun\n(OPPOSING FORCES)\n[ U ] a situation in which two opposing forces have or are given the same power: He works toward a balance between extremes. As a journalist, you try to strike a balance between serious reporting and the temptation to say clever things.\nbalance noun\n(AMOUNT)\n[ C usually sing ] the amount of money you have in a bank account or an amount of money owed: a bank balance\n[ C usually sing ] A balance is also the amount of something that you have left after you have spent or used up the rest: We’ll go over your homework for the first half hour and use the balance of the class period to prepare for the exam.\nIdioms\nbalance the budget\nin balance\non balance\nbalance verb\n(STAY IN POSITION)\n[ I/T ] to make something stay in one position by having its weight equally divided: [ T ] He balanced the book on top of his coffee cup.\nbalance verb\n(MAKE THINGS EQUAL)\n[ T ] to put opposing forces into a position in which neither controls the other: I had to balance the children’s needs against my own.\nAdd to word list\nAdd to word list\n[ C, usually singular ]\n&#160; BANKING the difference in the amount of money that has come into and gone out of a bank account in a particular period: Virtually all financial records - bank balances, mutual fund, and brokerage records - are held in electronic form. I checked my balance at the ATM. See also\nadverse balance of trade\nbalance of trade\ncash balance\nclosing balance\ncredit balance\ncompensating balance\ndebit balance\nidle balance\nopening balance\ntrial balance\nunfavourable balance\nunsold balance\n[ C, usually singular ]\n&#160; ACCOUNTING the amount shown in a company's financial records that is the difference between the total credits and the total debits in a particular account: This balance is then transferred to the profit and loss account. See also\nadverse balance of trade\ndouble declining balance\n[ C, usually singular ]\n&#160; FINANCE the amount of money that you still owe after you have paid a part of the total amount: Cut your outstanding mortgage balance and your monthly repayments will also come down.\n[ C ]\n&#160; FINANCE the amount of money that you owe on a credit card account: He is one of millions of people who does not pay off his credit card balance every month. See also\nbalance transfer\n[ S ] the remaining part of an amount: We ordered 200 copies; 50 to be delivered now and the balance next month.\n[ S or U ] the state where things exist in equal amounts or are of equal importance: They are looking for a better balance between internet security and ease of use. You need to find a balance between the demands of work and those of your home life. See also\ncompetitive balance\nwork-life balance\n[ T ]\n&#160; ACCOUNTING to arrange a system of accounts so that the amount of money spent is no more than the amount received: The Conservatives initially balanced the books by selling assets and cutting health and education spending.\n[ I ]\n&#160; ACCOUNTING, BANKING if an account balances, the amounts of money on the credit and debit sides are equal: He had made some kind of computation error and the account didn't balance.\n[ T ] to spend only as much money as you have received, or planned to spend: The President is unlikely to balance the budget in this term of office, but he does hope to lower the deficit.\n[ I or T ] (also balance (sth) out) to be equal in amount or value, or to make things equal in amount or value: They hoped that this month's good sales would balance out the poor sales in the previous month.\n[ T ] to give two or more things equal amounts of importance, time, or money so that a situation is successful: I struggle to balance work and family commitments.\na balancing act\na situation in which a person tries to give equal amounts of importance to two or more things so that a situation is successful: Outsourcing decisions are essentially a balancing act between the benefits of markets, lower production costs, and higher transaction costs."}