{"id":27021,"name":"balloon","type":"noun","us_sound":"bəˈluːn","us_link":"../audio/b/balloon.mp3","uk_sound":"bəˈluːn","uk_link":"../audio/b/ukbalal024.mp3","content":"Add to word list\nAdd to word list\nA2 a small, thin rubber bag that you blow air into or fill with a light gas until it is round in shape, used for decoration, as a children's toy, or for other purposes such as medical treatment or scientific research : We tied balloons and streamers to the ceiling ready for the party. Angioplasty is a medical procedure in which a balloon is used to stretch open a narrow or blocked artery. See also\nweather balloon\nSunlion2000/iStock/Getty Images Plus/GettyImages\n(also hot-air balloon) a very large balloon that is filled with hot air or gas and can carry people in a basket (= open container ) hanging under it: People first flew in a balloon in 1783.\njakkapan21/iStock/Getty Images Plus/GettyImages\n(also speech balloon, thought balloon) a round shape drawn next to the head of a character in a cartoon (= a story or joke told using drawings), in which the character's words or thoughts are written : The words appear inside a cartoon-style balloon hovering above the figures. He produced many of the best-known images of American Pop Art, especially frames from comic books complete with speech balloons. You can edit the photos, for example by adding thought balloons. Compare\nspeech bubble\nAnastasiia_Guseva/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesHe let the air out of the balloon.The balloon landed on the bush and burst with a bang.Lottie was carrying a balloon.He popped the balloons with a pin.\nSMART Vocabulary: related words and phrases\nToys & dolls\nbeach ball\nchew toy\ncuddly toy\ndoll's house\ndolly\nfidget\nfidget spinner\nfinger puppet\ngacha\nmarble\nmarionette\nmud pie\nrag doll\nRussian doll\nslap bracelet\nslime\nsnow globe\nsock puppet\nSoft Stuff\nstuffed animal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObjects & decorations connected with celebrations\nAir travel: balloons & parachutes\nPictures\nIdiom\nthe balloon goes up\nballoon verb [I]\n(INCREASE)\nto quickly increase in size, weight, or importance: Medical costs are likely to balloon for families as life spans increase. The rumours soon ballooned into a full-blown scandal.\nto get bigger and rounder, usually by filling with air: The silk of the parachute ballooned above me.\nMore examplesFewer examplesHis love of food caused him to balloon to 28 stone.He warned that the deficit may continue to balloon.The school opened last year and quickly ballooned from fewer than 100 students to over 400.This convenient inflatable pillow balloons in just a few breaths.\nSMART Vocabulary: related words and phrases\nEnlarging and inflating\naugmentation\nbloat\nbroaden\nbuild (someone/something) up\nbulk\nexpand\nexplosively\nflare\nfluff something up\nimplacably\ninflatable\ninflation\nlengthen\npuff\npump someone up\nreinflate\nreinflation\nscale something up\nstretch\nwiden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nBecoming bigger\nballoon verb [I]\n(FLY)\nto travel using a hot-air balloon: He planned to become the first person to balloon over the North Pole. Related words\nballooning\nballoonist\nSMART Vocabulary: related words and phrases\nAir travel: balloons & parachutes\naeronaut\naerostat\nairship\nbarrage balloon\nblimp\ncanopy\nchute\ndirigible\nhot-air balloon\nparachute\nripcord\nweather balloon\nwingsuit\nZeppelin\nAdd to word list\nAdd to word list\na small, thin, rubber bag that you can fill with air or another gas until it is round in shape, often used for decoration at parties or as a child’s toy\nA balloon is also a very large, round container filled with a gas that can rise in the air and carry people riding under it in an attached box.\nto become larger, esp. quickly: The rumors soon ballooned into (= quickly became) a full-grown scandal.\nAdd to word list\nAdd to word list\na type of loan that is paid back in regular small payments with a final larger payment: What we're seeing are interest-only, balloon mortgages with no money down. Only select a balloon over an adjustable rate mortgage if you are sure that you will be able to meet the final payment.\na\nballoon payment : Some borrowers may not be informed that balloon payments lurk ahead.\nto quickly increase in size or importance: The decline in sales to America caused the goods trade deficit to balloon to a record £4 billion."}