{"id":26948,"name":"baller","type":"noun","us_sound":"ˈbɑː.lɚ","us_link":"../audio/b/cdo0319usball0134.mp3","uk_sound":"ˈbɔː.lər","uk_link":"../audio/b/cdo0319ukball0116.mp3","content":"baller noun [C]\n(TOOL)\nAdd to word list\nAdd to word list\nfood &amp; drink\n&#160; specialized a small tool that is used to form food into balls, or to remove the flesh of fruit, etc.: Make melon balls using a melon baller or teaspoon.\npopovaphoto/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesScoop mashed sweet potatoes into orbs with a melon baller.Using a melon baller or a sharp teaspoon, hollow out the base of each pear.Take the melon baller and scoop out the centre of each tomato into a bowl. Using a vegetable baller, scoop out pieces of potato about the size of hazelnuts.\nSMART Vocabulary: related words and phrases\nKitchen utensils\nbain-marie\nbakeware\nbeater\nbottle opener\nbread knife\ncolander\ncookie cutter\ncookware\ncorer\nfish slice\nparing knife\npastry blender\npeeler\npepper mill\npestle\ntin opener\ntine\ntoasting fork\ntongs\nutensil\nSee more results »\nballer noun [C]\n(PERSON)\nUS informal a person who plays a ball game, especially someone who plays basketball well: The highlight was seeing a video of my favourite baller shattering the backboard.\nUS informal a successful person, especially one who is rich, lives well and buys expensive things: Now he's a baller, a ghetto star, still in his teens making six figures.\nMore examplesFewer examplesThis is an open letter to you, NBA baller and overall cool dude on NBA TV.He is clearly the better player; let's face it, he's the best Aussie baller we have had. If only I was a big baller and had the opportunity to eat here more often...\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nanchor\nback four\nballplayer\nbase jumper\nbenchwarmer\nboot boy\nchallenger\nkeeper\nlong-jumper\nlongboarder\nmajor league\nmid-table\nmidfield anchor\nracer\nretire\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nunranked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nRich people\nSuccessful (things or people)"}