{"id":27053,"name":"ballpark","type":"noun","us_sound":"ˈbɑːl.pɑːrk","us_link":"../audio/b/usbaffl027.mp3","uk_sound":"ˈbɔːl.pɑːk","uk_link":"../audio/b/ukbalal027.mp3","content":"Add to word list\nAdd to word list\nUS a place with a field for playing ball games, especially baseball games, and seats around it for people who are watching: Some people were selling tickets outside the ballpark. The stadium will be replaced by a new ballpark with better facilities.\nrion819/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSports venues\nall-seater\namphitheatre\narena\nbowling green\ncommentary box\ncrush barrier\ncurva\ncycle track\ndirectors' box\ndojo\nfitness centre\nice rink\nmezzanine\nrink\nrow Z\nstand\ntrack\ntunnel\nvelodrome\nvert\nSee more results »\nIdioms\nbe in the same ballpark\nbe in the (right) ballpark\nA ballpark estimate or figure is a number that is a guess, but one that you believe is near the correct number: We'll have to go away and cost this carefully, but as a ballpark figure I'd say that it'll be about two million dollars.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculation\nspeculatively\nsuspicion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApproximate\nballpark noun [C]\n(PLACE FOR SPORTS)\nAdd to word list\nAdd to word list\na large structure enclosing a field on which games, esp. baseball games, are played\nballpark noun [C]\n(ACCEPTABLE RANGE)\nan acceptable range in the amount or number of something when you do not know or cannot agree on an exact amount or number: I’d sell the house for $500,000, but his offer isn’t even in the ballpark. A ballpark figure of $3,000 would be realistic.\nbe in the same ballpark\nAdd to word list\nAdd to word list\nto be of a similar amount or at a similar level: The monthly costs of cable and satellite service are generally in the same ballpark for comparable packages.\nbe in the (right) ballpark\nto be close to the correct amount: Accounts receivable may be less than the printed numbers, but they're in the right ballpark.\na ballpark cost or figure is a number that is a guess, but that you believe is near the correct number: Do you have a ballpark figure of what the tax increases will be? a ballpark estimate"}