{"id":27037,"name":"ballot","type":"noun","us_sound":"ˈbæl.ət","us_link":"../audio/b/ballot.mp3","uk_sound":"ˈbæl.ət","uk_link":"../audio/b/ukbalal026.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a system or occasion of secret voting: Representatives were elected by ballot. Everyone casts his or her ballot (= votes) in secret. They decided to hold a ballot.\n[ C ] (also ballot paper) a piece of paper on which you write your vote put something to the ballot UK\nto vote secretly on a particular matter: OK, this seems to be an area of disagreement, so let's put it to the ballot.\nSee more\nMore examplesFewer examplesThe election of the government is carried out by secret ballot.The result of the strike ballot will be known tomorrow morning.Since she supported none of the candidates, she spoiled her ballot paper.ballot riggingThe delegates were elected by ballot.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nexit poll\nfirst-past-the-post\nflip\nfranchise\ngeneral election\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nto organize a secret vote by a group of people in order to find out their views: The union decided to ballot its members on the issue.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nexit poll\nfirst-past-the-post\nflip\nfranchise\ngeneral election\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nAdd to word list\nAdd to word list\na piece of paper on which you write a secret vote\nThe ballot is also a system or occasion of secret voting: [ U ] Issues need to be considered in open debate or put on the ballot.\nAdd to word list\nAdd to word list\n[ C ] an occasion when people vote on something, usually in secret, or the system for voting: The officials are elected by ballot. About 45 percent of the state's 2.8 million registered voters cast a ballot in the primary. The union is planning to hold a ballot for strike action.\n[ C ] (UK also ballot paper) a piece of paper on which you write your vote: In Britain, the normal share of spoiled ballot papers in a general election is less than 1%.\n[ C or U ]\n&#160; STOCK MARKET a method of choosing which investors will get shares that are being offered for the first time, when the demand for shares is greater than the number being offered\nto organize a secret vote by a group of people in order to find out their opinions: The union said it would ballot workers over industrial action in a pay dispute. Thousands of steelworkers are to be balloted for strike action.\nSTOCK MARKET to choose the investors who will get shares that are being offered for the first time, when the demand for shares is greater than the number being offered"}