{"id":27226,"name":"ban","type":"verb","us_sound":"bæn","us_link":"../audio/b/eus70431.mp3","uk_sound":"bæn","uk_link":"../audio/b/ukballs015.mp3","content":"Add to word list\nAdd to word list\nB2 to forbid (= refuse to allow) something, especially officially: The film was banned (= the government prevented it from being shown) in several countries. [ + from + -ing verb ] She was banned from driving for two years.\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\nMore examplesFewer examplesThe council plans to ban circuses with performing animals.The proposed new law would ban picketing.The council is making a move to ban traffic in some parts of the city.Certain chemicals have been banned because of their damaging effect on the environment.He's been banned from driving for six months.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nenact\nenforce\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\njurisprudentially\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nprohibit\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForbidding and banning things\nB2 an official order that prevents something from happening: There should be a ban on talking loudly in cinemas.\nMore examplesFewer examplesThe ban on media reporting during the election has made some people question the fairness of the election .The severe drought has led to a hosepipe ban in eastern England.The council has imposed a ban on alcohol in the city parks.The British Medical Association is/are campaigning for a complete ban on tobacco advertising.At last they've lifted the ban on jeans at the club.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nenact\nenforce\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\njurisprudentially\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nprohibit\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForbidding and banning things\nAdd to word list\nAdd to word list\nto forbid someone to do something or forbid an action: The bill would ban drivers from using hand-held phones. ban noun [ C ] us\nYour browser doesn't support HTML5 audio\n/bæn/\nThe president supported a ban on assault weapons.\nAdd to word list\nAdd to word list\nan official order that prevents someone doing something, or something from happening: ban on sth The police are enforcing the state's ban on the sale of fireworks.impose/enforce/lift a ban They have now lifted the ban on the export of live animals to Europe.\nto say officially that something is not allowed, or that someone is not allowed to do something: The law bans the import of ivory into the country.ban sb/sth from doing sth A number of airlines were banned from operating to the UK."}