{"id":27262,"name":"band","type":"noun","us_sound":"bænd","us_link":"../audio/b/band.mp3","uk_sound":"bænd","uk_link":"../audio/b/ukballs022.mp3","content":"band noun\n(MUSICIANS)\nAdd to word list\nAdd to word list\nA1 [ C, + sing/pl verb ] a group of musicians who play modern music together: a jazz/rock band The Beatles were probably the most famous band in the world.\nAnastasiia_Guseva/iStock/Getty Images Plus/GettyImages boy/girl band\na group of young men or women who perform popular songs together and dance as a group: He made his name in the 90s boy band Boyzone, before going on to a highly successful solo career.\nSee more\nMore examplesFewer examplesThe band played a familiar tune which had everyone clapping along.After the band stopped playing, people drifted away in twos and threes.This week the band did the last gig of their world-tour.He used to be the lead singer in a rock 'n' roll band.The band played a slow dance.\nSMART Vocabulary: related words and phrases\nGroups of musicians\nbig band\nboy band\nbrass band\nbrass section\nchamber orchestra\nduo\ngamelan\ngroup\nmarching band\noctet\nopener\npop group\nquartet\nquintet\nrhythm section\nseptet\nsupport band\nsymphony orchestra\ntribute band\ntrio\nSee more results »\nband noun\n(STRIP)\nC2 [ C ] a thin, flat piece of cloth, elastic, metal, or other material put around something, or a long, narrow piece of colour, light, etc. that is different from what surrounds it: a wrist band a red silk band A narrow band of grass separated the greenhouse from the vegetable garden.\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nbar\nbinding\nblindfold\nbraid\ncollar\ndog collar\nduct tape\nelastic band\ngag\nmasking tape\nraffia\nriband\nribbon\nrubber band\nstrap\nstreamer\nstripe\nsweatband\nthong\nSee more results »\nband noun\n(RANGE)\n[ C ] a particular range of values, numbers, etc.: The scheme is devised for young people in the 15–20 age band.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nbeyond the bounds of something\nbound\ncompass\ngamut\nglass ceiling\nlimit\nlimited\nmeta\nproviso\nrealm\nrestricted\nscope\nspecialized\nspectrum\nspread\nstretch\nstring\nSee more results »\nband noun\n(GROUP OF PEOPLE)\n[ C, + sing/pl verb ] a group of people who share the same interests or beliefs, or who have joined together for a special purpose: The former president still has a small band of supporters.\n[ C, + sing/pl verb ] (also Indian band) a group of indigenous North American people, usually a group who are related to each other, and who form part of a larger tribe: An advocacy group for indigenous bands says many Native languages face imminent extinction. In the late 1880s, five Indian bands lived along the San Luis Rey River.\n[ C, + sing/pl verb ]\n&#160; politics\n&#160; Canadian English specialized (also Indian band, First Nation band) a group that is a unit of government for Canadian First Nations people: He is a tribal councilman for the Cold Lake First Nations band. Each First Nation is typically represented by a band council. See also\nFirst Nation\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColonization & self-government\nUS (UK ring) to put a band on something, especially an animal: We banded the birds (= put bands around their legs) so that we could identify them later.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nbiometric\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nid\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nPhrasal verb\nband together\nband noun [C]\n(MUSICIANS)\nAdd to word list\nAdd to word list\na group of musicians who play music together, esp. popular music: a jazz/rock band a marching/military band\nband noun [C]\n(GROUP)\na group of people who have joined together for a special purpose, or a group of animals: a band of outlaws\nband noun [C]\n(STRIP)\na thin, flat strip of a material put around something to fasten or strengthen it, or a strip of color, light, etc., that is different from its surrounding area: The silver band from his wristwatch left a green ring over his wrist.\nAdd to word list\nAdd to word list\na range of values or amounts within fixed upper and lower limits: Most of our employees are within the lower age band. The government would like to widen the 20p tax band to include the majority of taxpayers. What salary band are you on?"}