{"id":27403,"name":"bandwidth","type":"noun","us_sound":"ˈbænd.wɪtθ","us_link":"../audio/b/usb02308.mp3","uk_sound":"ˈbænd.wɪtθ","uk_link":"../audio/b/ukb02308.mp3","content":"bandwidth noun [C usually singular or U]\n(INFORMATION)\nAdd to word list\nAdd to word list\na measurement of the amount of information that can be sent between computers, through a phone line, etc.: The system will handle signals that need high bandwidth, for instance those that encode TV pictures. high-bandwidth services/applications\nthe ability or time to deal with a situation, especially one that involves a large amount of information or a number of problems: I don't have the bandwidth to read stuff I know isn't going to lead to productive discussion. If people misreport or misrepresent my arguments, I am using more of my bandwidth to correct the misreporting.\nMore examplesFewer examplesTasks like simultaneously streaming several different video signals over a wireless connection require more bandwidth.Once software begins to use the extra bandwidth, you'll likely be glad you have it. There's enough bandwidth to let you surf, stream and down- load all at the same time.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\nbandwidth noun [C usually singular or U]\n(RADIO)\nthe range of frequencies used to send information over a distance using phone wires\nin radio, the width of a particular waveband\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: radio\nAdd to word list\nAdd to word list\nthe amount of information that can be sent over a network connection at one time: These streaming applications swallow enormous chunks of bandwidth for long periods of time.\nBandwidth is also the amount of time, information, or influence that someone has: He has more bandwidth (= more influence) than any presidential adviser has ever had in history.\nAdd to word list\nAdd to word list\nthe amount of information that can be sent between computers, over a phone line, using radio signals, etc. in a particular amount of time: As prices for telecommunications services fall, demand for high bandwidth services is increasing.\nthe range of frequencies (= numbers of waves produced in a particular amount of time) used to send information over a distance using phone lines or radio signals: Text messages require less bandwidth than phone calls. See also\nchannel capacity"}