{"id":27417,"name":"bang","type":"verb","us_sound":"bæŋ","us_link":"../audio/b/bang.mp3","uk_sound":"bæŋ","uk_link":"../audio/b/ukbands005.mp3","content":"bang verb\n(NOISE)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause something to) make a sudden very loud noise or noises: She banged her fist angrily on the table. Outside a door was banging in the wind.bang on He could hear someone banging on the door.\nThesaurus: synonyms, antonyms, and examples\nto make a sudden loud soundbangThe door banged shut.knockI know when the heating is on because the old radiator begins to knock and hiss.crackThunder cracked right before it began pouring and we ran for cover.clankI could tell he was upset by the way the pots clanked in the sink while he was washing up.clangChurch bells clanged in the distance.clashThe children covered their ears whenever the cymbals clashed.\nSee more results »\nMore examplesFewer examples\"Going... going... gone! \" said the auctioneer, banging down the hammer.\"Open up - it's the police!\" shouted the police officer, banging on the door.Before I bang the nails in, would you say this picture was level?I could hear my brother banging his drums before I'd even got to his house.A door banged and footsteps ran along the corridor overhead.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nbang verb\n(HIT)\n[ T ] to hit a part of the body against something by accident: bang your head She fell and banged her head.bang sth on sth I banged my head on the shelf as I stood up.bang against She was unsteady and banged against the furniture.\n[ T ] informal to hit a ball or other object very hard: He banged the ball into the net. I banged my shot against the crossbar.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang around\nbowl someone over\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nbang verb\n(SEX)\n[ T ] offensive an offensive word meaning to have sex with someone\nPhrasal verbs\nbang around\nbang sb around\nbang away\nbang on\nbang something out\nbang someone up\nbang up someone/something\nbang noun [C]\n(NOISE)\nB2 a sudden very loud noise: The window slammed shut with a loud bang.\nThesaurus: synonyms, antonyms, and examples\na sudden loud soundbangShe slammed the door with a bang.slamThe window closed with a slam.clashI can still hear the clash of metal against metal during the car crash.clankMy mechanic asked me to describe the clanks that my engine makes.clangThe jail door closed with a resounding clang.thumpHe dropped his suitcase with a loud thump and sprinted up the steps.\nSee more results »\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nbang noun [C]\n(HIT)\nan act of hitting someone or something: a bang on I think she must have got a bang on the head.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang around\nbowl someone over\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\nIdioms\nget a bang out of something\ngo with a bang\nmore bang for your buck(s)\nwith a bang\nused to suggest the sound of a sudden loud noise, such as a gunshot or an explosion: \"Bang! Bang! You're dead!\" said the child, pointing a plastic gun at me. go bang\nto make a sudden loud noise: The balloon went bang when it landed on the bush.\nSee more\nSMART Vocabulary: related words and phrases\nLinguistics: sounds used as interjections\naha\nahem\nbah\nbam\nblah\nblah, blah, blah\ncor\nduh\nhuh\now\npooh\npsst\nshh\nsquee\nuh-huh\nvocable\nvroom\nwham\nwhee\nwhew\nSee more results »\nIdiom\nbang goes something\nexactly or directly: I arrived bang on time.bang in the middle The car came to a halt bang in the middle of the road. I live bang opposite the supermarket.slap bang I turned the corner and walked slap bang into him.bang up to date software that is bang (= completely) up to date\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nIdioms\nbe bang on\nbang to rights\nAdd to word list\nAdd to word list\nto make or cause something to make a sudden loud, usually short noise, esp. by hitting two things together: [ T ] He banged his head on the open cupboard door.\nTo bang out something is to do something quickly: [ M ] I sat down at the piano and banged out a tune. Phrasal verb\nbang up someone/something\na sudden loud, usually short noise: She ran out of the room and slammed the door with a bang. Idiom\nbang for the buck\nbang for the/your buck\nAdd to word list\nAdd to word list\ninformal if you get more bang for your buck, you get more or better results for the amount of money or effort you spend: Charities try to get a better and bigger bang for the buck by keeping their expenses down. It may cost more, but you get more bang for your buck if you advertise on TV rather than on radio."}