{"id":27516,"name":"bankrupt","type":"adjective","us_sound":"ˈbæŋ.krʌpt","us_link":"../audio/b/bankrupt.mp3","uk_sound":"ˈbæŋ.krʌpt","uk_link":"../audio/b/ukbands025.mp3","content":"Add to word list\nAdd to word list\nC1 unable to pay what you owe, and having had control of your financial matters given, by a law court, to a person who sells your property to pay your debts: He went bankrupt after only a year in business. The recession has led to many small businesses going bankrupt.\ninformal having no money: I'll go bankrupt if you kids keep asking me for money!\ndisapproving not having any good qualities: He believes that modern society is morally bankrupt.\nMore examplesFewer examplesThe company went bankrupt and was put into the hands of the receivers.They piled up such a huge debt that they soon went bankrupt.When it was obvious the company was going bankrupt, the government ordered all their assets to be frozen.The business went bankrupt after investing an enormous amount on a product that failed to sell.Without the help of a generous investor, the theatre company would have gone bankrupt.\nSMART Vocabulary: related words and phrases\nLacking things\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ncupboard\nhole\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nneedful\nscrape\nscream\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nunappeased\nSee more results »\na person who is officially bankrupt: He was declared a bankrupt in 2011.\nto cause someone to become bankrupt: They feared that the loss would bankrupt them. Synonym\nruin\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankruptcy\nbe running on fumes idiom\nbelly\nbootstrap\ncharter\ndying\nfold\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nhave a corner on a market idiom\nreceiver\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nsubscale\nSee more results »\nAdd to word list\nAdd to word list\nwithout enough money to pay your debts: If I don’t find a job, I’ll be bankrupt in two months.\nlaw When a company or person is bankrupt, a court of law gives control of the finances to someone who will arrange to pay as much as possible of what is owed. bankrupt verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈbæŋ·krəpt/\nThe senator said the president’s plan would bankrupt the country.\nAdd to word list\nAdd to word list\nunable to pay what you owe, and having control of your financial matters given, by a court of law, to a person who sells your property to pay your debts: be/go bankrupt He went bankrupt after only a year in business.declare sb bankrupt She was officially declared bankrupt last week.\na person who is officially bankrupt: He was declared a bankrupt in 2007. See also\ndischarged bankrupt\nundischarged bankrupt\nto cause someone to become bankrupt: They feared that the losses they had sustained in the hurricane would bankrupt them."}