{"id":27663,"name":"bar","type":"noun","us_sound":"bɑːr","us_link":"../audio/b/bar.mp3","uk_sound":"bɑːr","uk_link":"../audio/b/ukbanqu012.mp3","content":"bar noun [C]\n(DRINKING PLACE)\nAdd to word list\nAdd to word list\nA1 a place where drinks, especially alcoholic drinks, are sold and drunk, or the area in such a place where the person serving the drinks stands: They noticed him going into the hotel bar.at the bar There weren't any free tables, so I sat at the bar.behind the bar Why don't you ask the guy behind the bar (= serving drinks there)?\nMore examplesFewer examplesAs a general rule, we don't allow children in the bar.You'll find her in the bar almost every evening about six o'clock.The hotel bar is open to non-residents.She roamed around America for a year, working in bars and restaurants.She fell into a conversation with a man at the bar.\nSMART Vocabulary: related words and phrases\nSelling & serving alcoholic drinks\nbarkeeper\nbarmaid\nbarman\nbartender\nbeer garden\nfree house\ngastropub\nhostelry\ninnkeeper\nlandlady\nlicensee\nliquor store\nnineteenth\npublic bar\npublic house\npublican\nroadhouse\nsaloon\nsaloon bar\nwine bar\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublic entertainment venues\nbar noun [C]\n(LONG PIECE)\nB2 a long, thin, straight piece of metal or wood: The gorilla rattled the bars of its cage.\nB1 a substance that has been made into a solid rectangular shape: a bar of soap a chocolate bar\nUK The bar of an electric heater is a long, thin wire in the shape of a spring that is wrapped tightly around a tube. When electricity passes through it, it produces heat and red light.\nMore examplesFewer examplesHe was chomping away on a bar of chocolate.Some maniac was running down the street waving a massive metal bar.a candy bar\"Would you get me a bar of chocolate from the kitchen?\" \"Another one?!\"Loop the rope over the bar.\nSMART Vocabulary: related words and phrases\nPoles, rods, shafts and sticks\nbargepole\nbaton\nbilly club\nboathook\nbollard\nbroomstick\ncane\nlightning conductor\nlitter grabber\nlitter pick\nlitter picker\nmaypole\npointer\nshaft\nstake\ntelephone pole\ntent pole\ntotem pole\ntrash grabber\ntrash picker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nHeaters & burners\nbar noun [C]\n(MUSIC)\n(US also measure) one of the small equal parts into which a piece of music is divided, containing a fixed number of beats: Normally the emphasis falls on the first beat of the bar. beats in a bar Waltzes have three beats in a bar.\nDonNichols/E+/GettyImages\nUS (UK bar line) a vertical line that divides one bar from another in a written piece of music\nBrostock/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBeats or lengths of musical notes\nbackbeat\nbar line\nbeat\ncommon time\ncompound time\ncrotchet\neighth\nfourth\nhalf note\nmeasure\nminim\noctave\npause\nquarter note\nrest\nthree-four time\nthree-quarter time\ntime signature\ntiming\nupbeat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting, reading & studying music\nbar noun [C]\n(ON PHONE, ETC.)\na way of measuring the strength of a signal or connection or the power available in a device, that is shown as a vertical line on a phone or computer screen: There was a hotspot where you could get a decent mobile phone signal - two, sometimes even three bars. The battery meter showed one bar of power left.\nMore examplesFewer examplesMy phone gets amazing reception even with only one bar, whereas my husband’s only really works with five full bars.The phone they used to call for help had only one bar of battery power left when they found a signal.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\ncable\ncybernetics\nhack\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\npatch\npatch someone through\nsilent\ntrace\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nbar noun [C]\n(ON UNIFORM)\nUS a\nstripe\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbinding\nblindfold\nbraid\ncollar\ndog collar\nduct tape\nelastic band\ngag\nmasking tape\nraffia\nriband\nribbon\nrubber band\nstrap\nstreamer\nstripe\nsweatband\nthong\nSee more results »\nbar noun [C]\n(PREVENTING)\nC2 [ usually singular ] something that prevents a particular event or development from happening: a bar to A lack of formal education is no bar to becoming rich.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbe a drag on someone/something idiom\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nIdioms\nbehind bars\nnot have a bar of something\nset the bar high/low\nbar verb [T]\n(PREVENT)\nto prevent something or someone from doing something or going somewhere, or to not allow something: The rule bars the use of evidence secured through an illegal search. bar someone from something The incident led to him being barred from the country.bar something to someone Most of the network of trails are barred to private vehicles.bar someone's way I tried to push past her but she barred my way (= stood in front of me and prevented me from getting past).\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndecertification\ndecertify\ndisallow\ndisqualification\ndisqualify\noff-limits\nout of bounds idiom\noutlaw\nprohibit\nprohibition\nunapproved\nunauthorized\nunkosher\nunsanctioned\nverboten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nbar verb [T]\n(CLOSE)\nto put bars across something, especially to keep it closed: We barred the door to stop anyone getting into the room.\nSMART Vocabulary: related words and phrases\nLocking and bolting\nbatten\nbolt\nhandcuff\nhermetically\nlatch\nlock\nlock (something) up\nlock someone out\nlock something away\nlock something in\nlockable\nlove lock\nmanacle\npadlock\nrelock\nshut\nshut someone away\nunder lock and key idiom\nexcept: Everyone is leaving the village, bar the very old and ill.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\nbar none idiom\nbarring\nclannish\ncount\ndiscount\nexcluding\nexclusion\nexclusionist\nexclusive\nexclusively\nexclusivity\nnegative\nostracism\nostracize\notherwise\nout of it idiom\noutlier\nstand-alone\nSee more results »\nIdioms\nbar none\nbe (all) over bar the shouting\nUK lawyers who are allowed to argue a case in a higher court\nUS all lawyers thought of as a group be called to the Bar UK\nto gain a qualification as a lawyer who can argue a case in a higher court: She studied law and was called to the Bar in 2013.\nSee more be admitted to the bar US\nto gain a qualification as a lawyer: After being admitted to the bar in 1998, he represented other people who had got into trouble with the regulators.\nSee more\nSMART Vocabulary: related words and phrases\nLawyers & legal officials\namicus\narticled\narticled clerk\nattorney\nattorney general\ncoroner\ncounsellor\ndraftswoman\nfirm\nI rest my case idiom\nKC\nlaw clerk\nparalegal\nprobation officer\nprocurator\nprocurator fiscal\nprosecution\nsuperlawyer\ntake silk idiom\ntribune\nSee more results »\nbar noun\n(POLE)\nAdd to word list\nAdd to word list\n[ C ] a strong pole, esp. one made of metal, used as a support, to force something to move, or to block an opening: He stuck his hand through the bars of the cage\n[ C ] A bar is also any of various small objects having a rectangular shape: a granola bar\nbar noun\n(DRINKING PLACE)\n[ C ] a place, sometimes within a restaurant, where alcoholic drinks are served, or a long, high table in such a place along which people stand or sit while drinking: He used to just sit in a bar and listen to jazz. They sat at the bar and chatted with the bartender.\nbar noun\n(MUSIC)\n[ C ] (also measure) one of the small equal parts into which a piece of music is divided, containing a fixed number of beats: He played four bars of music.\n[ C ] (also measure) A bar is also one of the vertical lines that divide a piece of music into equal parts.\nbar noun\n(LAWYERS)\n[ U ] all lawyers considered as a group: She passed the Massachusetts bar exam on her first try.\nbar verb [T]\n(PREVENT)\nto prevent someone from doing something or going somewhere: Protesters tried to break into the building, but the police barred their way.\nbar verb [T]\n(POLE)\nto put a strong pole or poles across an opening: We barred the windows as protection against burglars.\nbar preposition\n(EXCEPT)\nexcept for: He’s the greatest pitcher of all time, bar none (= no one else is better).\nAdd to word list\nAdd to word list\nsomething that prevents a particular event or development from happening: a bar (to sth) A lack of formal education does not have to be a bar to success in business and politics.\nLAW to prevent something or someone from doing something or going somewhere, or to refuse to allow something: bar sb/sth from (doing) sth Lawyers on both sides have been barred from discussing the case in the press. The government voted to bar the import of exotic birds.\nUK the group of barristers (= lawyers who are allowed to argue a case in a higher court), or the profession of such lawyers: a member of the bar He was called to the bar (= became a barrister) in 2006. It has been a privilege to have practised at the Bar for 47 years.\nUS all lawyers considered as a group, or the profession of law: Effectiveness requires that other members of the bar trust your word and credibility. She was admitted to the bar (= became a lawyer) in her early thirties."}