{"id":27753,"name":"barbecue","type":"noun","us_sound":"ˈbɑːr.bə.kjuː","us_link":"../audio/b/barbecue.mp3","uk_sound":"ˈbɑː.bɪ.kjuː","uk_link":"../audio/b/ukbanqu021.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] a metal frame on which meat, fish, or vegetables are cooked outdoors over a fire: Make sure you light the barbecue in plenty of time.\nWellmony/iStock / Getty Images Plus/GettyImages\nA2 [ C ] a meal that is prepared and eaten outdoors using such a frame, often during a party: He made some salads to have with the barbecue.\n[ C ] a party held outdoors, during which food is cooked on a barbecue: We're having a barbecue on Saturday - I hope you can come.\n[ U ] US meat, usually pork, cooked slowly on a metal frame in a container filled with smoke, and served in a barbecue sauce : They serve the best barbecue in town.\nLauriPatterson/E+/GettyImages\nMore examplesFewer examplesAsk your father whether he bought any charcoal for the barbecue.It rained, so the barbecue had to be postponed.The supermarket sells a range of food ideal for summer barbecues.There was a lovely smell drifting over from the neighbours' barbecue.Make sure you light the barbecue in plenty of time, and I'll prepare the food.\nSMART Vocabulary: related words and phrases\nHeaters & burners\nbar\nbarbecue pit\nbarbie\nBBQ\nbimetallic strip\ncigarette lighter\nelectric blanket\nelectric heater\nfan heater\nfurnace\ngas fire\ngeyser\nmatchstick\npatio heater\npotbellied stove\nretort\nroom heater\nsafety match\nwood stove\nwood-burning stove\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals\nCelebrations, parties & special occasions\nMeat - general words\nSausages, burgers & stuffings\nB1 to cook food on a barbecue: Their traditional sausages are delicious grilled or barbecued. Dad was outside barbecuing in the yard.\nMore examplesFewer examplesI'll barbecue some burgers.We had barbecued chicken wings.He was eating a slice of barbecued lamb with his hands.You could simply barbecue the steak on a grill.Summer nights were spent barbecuing in the back yard with friends.\nSMART Vocabulary: related words and phrases\nPreparing food using heat\nair fryer\nbain-marie\nbaking\nbaking parchment\nbarbecue pit\nblanch\nboil\ndeep fat fryer\ndeep-fried\ndeep-fry\ndone\ndoneness\npan-fry\nparboil\npoach\npoaching\nprecook\nsear\nwarm (someone/something) up\nwood-fired\nSee more results »\nAdd to word list\nAdd to word list\na metal frame on which food is cooked outside over a fire, or a meal prepared using such a frame and usually eaten outside: I like catfish cooked on a barbecue. Our neighbors invited all of us to a backyard barbecue. barbecue verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑr·bɪˌkju/\nDuring the summer we barbecue all the time."}