{"id":27944,"name":"bargain","type":"noun","us_sound":"ˈbɑːr.ɡɪn","us_link":"../audio/b/bargain.mp3","uk_sound":"ˈbɑː.ɡɪn","uk_link":"../audio/b/ukbareb007.mp3","content":"bargain noun [C]\n(LOW PRICE)\nAdd to word list\nAdd to word list\nB1 something on sale at a lower price than its true value: This coat was half-price - a real bargain. The airline regularly offers last-minute bookings at bargain prices. The sales had started and the bargain hunters (= people looking for things at a low price) were out in force.\nThesaurus: synonyms, antonyms, and examples\nsomething that is cheapbargainAnyone prepared to play a waiting game could bag a real bargain.giftAt one hundred pounds, this phone is a gift.snipUK Afternoon tea is a snip at £10 per head.good buyWoven cotton and linen are also a good buy.good dealYou may be able to get a better deal from your own bank.\nSee more results »\nMore examplesFewer examplesShe has a sharp eye for a bargain.Buyers who have waited for bargains at the end of the year will find slim pickings.The fall in property prices means that there are a lot of bargains waiting to be snapped up.Jonathan doesn't miss a trick! If there's a bargain to be had at the market, he'll find it.She's got a good nose for a bargain,Houses in this area used to be a real bargain, but they're not cheap any more.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbear market\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosting little or no money\nbargain noun [C]\n(AGREEMENT)\nan agreement between two people or groups in which each promises to do something in exchange for something else: \"I'll clean the kitchen if you clean the car.\" \"OK, it's a bargain.\" The management and employees eventually struck/made a bargain (= reached an agreement).\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nIdiom\ninto the bargain\nto try to make someone agree to give you something that is better for you, such as a better price or better working conditions: Unions bargain with employers for better rates of pay each year. Synonym\ndicker US\nSMART Vocabulary: related words and phrases\nNegotiating prices\nbargainer\nbargaining power\nbarter\nbeat\nbeat down\nbid\ncap\ndicker\ndrive a hard bargain idiom\ngazump\ngazunder\nhaggle\nhaggler\nnon-market\nnon-negotiable\noutbargain\nquotation\nquote\nsettle\nsettle on something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\nPhrasal verbs\nbargain something away\nbargain for/on something\nbargain noun [C]\n(AGREEMENT)\nAdd to word list\nAdd to word list\nan agreement between two people or groups in which each promises to do something in exchange for something else: He failed to carry out his side of the bargain.\nbargain noun [C]\n(LOW PRICE)\nsomething sold for a price that is lower than usual or lower than its value: We got tickets to the show at half-price, a real bargain.\nbargain verb [I]\n(LOW PRICE)\nto try to reach agreement with someone in order to get a lower price: You can usually bargain with antique dealers.\nbargaining noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑr·ɡə·nɪŋ/\nHarriman pressed for tougher bargaining by the American side. Phrasal verb\nbargain on something\nAdd to word list\nAdd to word list\nCOMMERCE something that is on sale at a lower price than usual: The airline regularly offers last-minute bookings at bargain prices.\nan agreement between two people or groups in which each promises to do something in exchange for something else: strike/make a bargain The management and employees eventually struck a bargain. See also\nDutch bargain\nCOMMERCE a situation in which two or more people agree on a price that something is sold at: strike a bargain They felt that the offer was too low but after some negotiation they eventually struck a bargain.\nSTOCK MARKET in the UK, an act of buying or selling shares on the London Stock Exchange: After the bargain is completed, the broker will want to know when payment will be made.\ninto the bargain (US also in the bargain)\nin addition to other facts which have been mentioned previously: Our latest recruit is an excellent analyst, and a very good manager into the bargain.\nCOMMERCE, HR to discuss something with somebody, for example a price or a rate of pay, in order to get an agreement that is of advantage to you: bargain (with sb) (for/over sth) Unions bargain with employers for better rates of pay each year.\nPhrasal verbs\nbargain sth away\nbargain for/on sth"}