{"id":28228,"name":"baroque","type":"adjective","us_sound":"bəˈroʊk","us_link":"../audio/b/baroque.mp3","uk_sound":"bəˈrɒk","uk_link":"../audio/b/ukbaroq001.mp3","content":"Add to word list\nAdd to word list\n(also Baroque) relating to the heavily decorated style in buildings, art, and music that was popular in Europe in the 17th century and the early part of the 18th century: The baroque St Martin's church is considered one of the most beautiful churches in the country. Their repertoire mixes Baroque works with contemporary music. baroque architects/painters/composers\ncomplicated in style, often when this is unnecessary or too much : This film shows the director at his most baroque. To an outsider like myself, local politics seem rather baroque. I struggled to follow his baroque logic.\nMore examplesFewer examplesThe chapel is splendid, with an early Baroque altar.The buildings of Prague include examples of Baroque, Art Nouveau, Functionalist, and Cubist styles.He was an art historian specializing in northern baroque art.The entrance hall was fitted out in the late baroque style of Christopher Wren.The food at the restaurant is sometimes local, sometimes global, sometimes simple, sometimes baroque.Hip hop seemed to be going through a decadent, baroque phase. In the end the twists and turns of the plot are just a little too baroque, suggesting the director did not have full control of his material.\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nfigurative\nmodernist\nmontage\nnaturalism\nnaturalistic\nnon-abstract\nrococo\nromantic\nromanticism\nscreen printing\nsilkscreen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture\nTypes of music\nComplexity\nthe baroque (also the Baroque)\nthe heavily decorated style in buildings, art, and music that was popular in Europe in the 17th century and the early part of the 18th century: The villa is an eccentric fusion of the classical, the baroque and the modernist. The opera was written at the point of transition from the Renaissance to the Baroque.\nMore examplesFewer examplesThese churches form some of London's most powerful expressions of the Baroque.He takes us through the history of classical music from Gregorian chant to the baroque, classical and romantic.\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nfigurative\nmodernist\nmontage\nnaturalism\nnaturalistic\nnon-abstract\nrococo\nromantic\nromanticism\nscreen printing\nsilkscreen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture\nTypes of music\nAdd to word list\nAdd to word list\nrelating to the highly decorated style in buildings, art, and music that was popular in Europe in the 17th century and the early part of the 18th century: baroque architecture"}