{"id":28374,"name":"barrier","type":"noun","us_sound":"ˈber.i.ɚ","us_link":"../audio/b/cdo1121usbarr0498.mp3","uk_sound":"ˈbær.i.ər","uk_link":"../audio/b/ukbaroq012.mp3","content":"barrier noun [C]\n(FENCE)\nAdd to word list\nAdd to word list\nB2 a long pole, fence, wall, or natural feature, such as a mountain or sea, that stops people from going somewhere: Barriers have been erected all along the route the Pope will take. The mountains acted as a natural barrier to the spread of the disease. See also\ncrash barrier\nUK a gate in some railway stations through which you must go to get on a train: Passengers are requested to show their tickets at the barrier.\nMore examplesFewer examplesThe land drops (away) sharply behind the barrier.At the given signal, the group rushed forward to the barrier.The barrier absorbed the main impact of the crash.They've put barriers up to stop people (from) getting through.The talks were meant to break down barriers between the two groups.\nSMART Vocabulary: related words and phrases\nParts of buildings: fences & rails\nbalustrade\nbanister\nbannister\nbarbed wire\nbarricade\ncrush barrier\nfence\nfence something in\nfence something off\nfencing\nfinial\nguard rail\nhandrail\nhoarding\nJersey barrier\npaling\npalisade\nsandbag\nshark fence\nwindbreak\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRailways & railway lines\nbarrier noun [C]\n(OBSTACLE)\nB2 anything that prevents people from being together or understanding each other: Despite the language barrier (= not speaking the same language), they soon became good friends. Shyness is one of the biggest barriers to making friends (= something that makes this difficult).\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprejudice\nprevent\npreventable\npreventative\nprevention\nscuttle\nsmother\nsuffocate\nSee more results »\nused to describe methods of preventing pregnancy that work by physically blocking sperm from coming into contact with an egg: GPs tend to offer the basic options of pill, barrier methods or sterilization. Barrier contraception has been shown to reduce the risk of HIV transmission.\nMore examplesFewer examplesCondoms are a top barrier method because they also protect from STDs. The medication can interfere with oral contraceptives, so use an alternative barrier form of contraception, such as a condom, while taking it.Birth control measures include abstinence, contraceptive pills or patch, injectable contraception, barrier contraceptives (condom, diaphragm with spermicide), or IUD.\nSMART Vocabulary: related words and phrases\nObstetrics: contraception\nbirth control\ncondom\ncontraception\ndiaphragm\nDutch cap\nemergency contraception\nfamily planning\nFemidom\nhave your tubes tied idiom\nIUD\njohnny\nminipill\nprophylactic\nrhythm method\nrubber\nsafe period\nsheath\nspermicidal\nunsterilized\nvasectomy\nSee more results »\nAdd to word list\nAdd to word list\nanything used or acting to block someone from going somewhere or from doing something, or to block something from happening: The Secret Service erected concrete barriers around the White House. Jackie Robinson was the African-American who succeeded in breaking major league baseball’s color barrier (= use of race to block something from happening).\nAdd to word list\nAdd to word list\nsomething that prevents something else from happening or makes it more difficult: barrier (to sth) In an ideal world, there would be no barriers to the free movement of people between countries. See also\nnon-tariff barrier\ntrade barrier\nsomething that keeps people or things apart: The language barrier is less frightening in print than over the telephone.barrier between sb/sth (and sb/sth) Lack of regular communication is named time and time again as the major barrier between management and employees.\na number or measurement that is considered to be important or hard to reach: The average wage in Britain has broken the £20,000 barrier. The Dow Jones broke the 10,000 barrier early in the day, but closed down 41.85 points at 9923.42."}