{"id":28586,"name":"basics","type":"noun","us_sound":"ˈbeɪ.sɪks","us_link":"../audio/b/basics.mp3","uk_sound":"ˈbeɪ.sɪks","uk_link":"../audio/b/ukbashf005.mp3","content":"Add to word list\nAdd to word list\nB2 the simplest and most important facts, ideas, or things connected with something: I really must learn the basics of first aid. The school can't even afford basics such as books and paper. Synonyms\nessential\nfirst principles UK\nfoundation (BASIC FACT)\nfundamentals\nprinciple (IDEA)\nthe rudiments back to basics\nIf you get back to basics, you start to give your attention to the simplest and most important matters after ignoring them for a while: This is all part of a new back-to-basics campaign to raise standards in schools.\nSee more\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nhandout\ninfo\ninfodemic\ninfodump\ninfographic\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nAdd to word list\nAdd to word list\nthe central and most important principles of something: Pablo has promised to teach me the basics of sailing.\nAdd to word list\nAdd to word list\nthings that people need to learn, know, or do before they can achieve something: Success is achieved by focusing on the basics - quality, innovation, and customer care.learn/master the basics (of sth) It shouldn't take long to learn the basics of the new software. Building up the organization didn't happen overnight - it took years to get the basics right.\nthings that people need in order to be able to live comfortably, work effectively, etc.: What proportion of your income do you spend on basics such as food and heating?\nget/go back to basics\nto spend time and effort doing the simplest but most important things, especially after an unsuccessful period of time spent doing things that are more complicated but less important: We need to get back to basics and start delivering on promises to customers."}