{"id":28695,"name":"basis","type":"noun","us_sound":"ˈbeɪ.sɪs","us_link":"../audio/b/basis.mp3","uk_sound":"ˈbeɪ.sɪs","uk_link":"../audio/b/ukbashf010.mp3","content":"basis noun [C]\n(IMPORTANT FACTS)\nAdd to word list\nAdd to word list\nC1 the most important facts, ideas, etc. from which something is developed: form the basis for This document will form the basis for our discussion.on the basis of Decisions were often made on the basis of (= using) incorrect information. Their proposals have no proven scientific basis.\nMore examplesFewer examplesThis information formed the basis of the report.Let's assume that they're coming and make plans on that basis.I suggest that we meet on a regular basis to discuss progress.Discrimination on the basis of race, gender, age or disability is not allowed.The initial negotiations are seen as laying the basis for more detailed talks.\nSMART Vocabulary: related words and phrases\nBeing based on or depending on something\nas the case might be phrase\nbase something on something\nbases\nboil down to something\nbuild around something\nfooting\nfound\nfoundational\nground\nhinge\nhinge on/upon something\nresult from something\nride\nride on something/someone\nrooted\nspring from something\nstrength\nthe stuff of something idiom\nunderstanding\nwake\nSee more results »\nbasis noun [C]\n(METHOD)\nB2 a way or method of doing something: on a voluntary basis Most of our staff work for us on a voluntary basis (= they work without being paid).\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbest practice\ndevice\nformula\nmethod\nmethodological\nmethodologically\nmethodologist\nmethodology\nstrategy\nstyleless\nstylistic\nstylistically\ntechnique\nthus\nvehicle\nSee more results »\nIdiom\non a need-to-know basis\nAdd to word list\nAdd to word list\nthe most important facts or principles or ideas that support something: There is no basis for their statements.\nA basis is also a way or method of doing something: Mostly people work on a part-time basis.\nAdd to word list\nAdd to word list\n[ C, usually singular ] a fact or situation that makes it possible for something to exist, happen, or develop in a particular way: basis for sth Should the TV licence fee continue to be the basis for the BBC's funding? Ministers claimed the figures were bogus and had no basis in reality.be/form/provide the basis for sth Sustainable development should form the basis for a corporate vision of the future.as a basis for sth It is hoped that the WTO agreements will serve as a basis for strengthening relationships with developing countries.\n[ S ] the way things happen, or are done or organized: on a daily/monthly/regular, etc. basis Skills need to be updated on an ongoing basis.on a full-time/permanent/temporary, etc. basis She's employed by the agency on a temporary basis. Assessment of insurance claims takes place on a case-by-case basis. See also\naccruals basis\ncash basis\n[ S or U ] the reason why someone does something or why something happens: There appears to be no logical basis for these proposals.on the basis of sth Discrimination on the basis of gender, age, race, or sexual orientation is against the law.on the basis that Some bidders were rejected on the basis that they lacked an understanding of the needs of the organization."}