{"id":28575,"name":"basic","type":"adjective","us_sound":"ˈbeɪ.sɪk","us_link":"../audio/b/basic.mp3","uk_sound":"ˈbeɪ.sɪk","uk_link":"../audio/b/ukbashf003.mp3","content":"Add to word list\nAdd to word list\nB1 simple and not complicated, so able to provide the base or starting point from which something can develop: I really need to get some basic financial advice. He only has a basic command of English (= he only knows the most important and simple words and expressions). The basic (= most important) problem is that they don't talk to each other enough. It's the most basic model (= it only has the most simple features). The crisis has led to price rises in basic foodstuffs, such as meat, cheese, and sugar. Synonyms\ncrude (SIMPLE)\nelementary\nfoundational formal\nfundamental (BASIC)\ninchoate literary\nrough and ready\nrude (SIMPLE) old use or literary\nrudimentary formal\nsimple (PLAIN)\nundeveloped\nunrefined\nunsophisticated\nThesaurus: synonyms, antonyms, and examples\nbasic knowledge, understanding, etc.basicI just need some basic information.elementaryI started an elementary-level art history course.fundamentalOne of the most fundamental principles of the rule of law is that one person cannot be punished for the actions of another.rudimentaryThey have only the most rudimentary grasp of the language.essentialWe have been able to determine the essential nature of a healthy diet.underlyingThe underlying idea is that having freedom is valuable.\nSee more results »\nslang disapproving boring and not unusual or surprising in any way: All the music they like is so basic. basic pay, salary, wage, etc. UK (US usually base pay, salary, wage, etc.)\nwhat a person earns before other amounts of money, such as payments for working extra hours, are added: She earns a basic salary of £450K per annum.\nSee more\nMore examplesFewer examplesThey lack basic foodstuffs, such as bread and milk.The course gives you basic instruction in car maintenance.She's teaching me some basic dance steps.Twice a week the children are tested in basic mathematical skills such as addition and subtraction.The basic facts of the story are starting to emerge though the details are still unclear.\nSMART Vocabulary: related words and phrases\nCrude and basic\n101\nat bottom idiom\nbackward\nbackwardly\nbackwardness\nhomespun\ninelegant\ninelegantly\nlow-tech\nMickey Mouse\nrough and ready idiom\nroughly\nroughness\nrudely\nrudeness\nsimplex\nskeletal\nskeletally\nstone-age\nvanilla\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTedious and uninspiring\na common language for writing computer programs in that uses instructions that are similar to English\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ngarbage collector\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nAdd to word list\nAdd to word list\nmost important or central to something: In physics we study basic principles of force and motion. We help with basic needs like food and shelter. basically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈbeɪ·sɪk·li/\nThe two cars are basically the same.\nAdd to word list\nAdd to word list\nabbreviation for Beginner's all-Purpose Symbolic Instruction Code: a simple language for writing computer programs"}