{"id":28919,"name":"bath","type":"noun","us_sound":"bæθ","us_link":"../audio/b/bath.mp3","uk_sound":"bɑːθ","uk_link":"../audio/b/ukbatch003.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] UK (US bathtub) a long plastic, metal, or ceramic container that is filled with water so that you can sit or lie in it to wash your whole body\nmladn61/iStock/Getty Images Plus/GettyImages\nA1 [ C usually singular ] the activity of washing yourself or someone else in a bath : mainly UK Susannah has a long hot bath every evening.mainly US I took a bath this morning. bath oil run a bath UK (US fill the tub)\nto fill a bath with water for washing: I'll run you a bath while you take off those wet clothes.\nSee more\n[ C ] US used to refer to a bathroom when describing a home: a four-bedroom two-bath house\n[ C ] a health treatment: mud/thermal baths\n[ C ] any container holding liquid: a bird bath baths [ C, + sing/pl verb ] plural baths\nUK old-fashioned →\nswimming baths UK old-fashioned : In those days it cost about six pence to go to the baths.\na public place where people went in the past to have a hot bath: Most families had no bathroom and used the public baths instead.\nSee more\nMore examplesFewer examplesDon't you just adore lying in a hot bath?He'd just got into the bath when the phone rang.I think we can plumb the new bath into the existing pipes.I've cleaned the basin and scrubbed the bath.I'll run you a bath while you take off those wet clothes.\nSMART Vocabulary: related words and phrases\nBathroom fixtures & fittings\nbacksplash\nbasin\nbath rack\nbathroom fittings\nbathroom suite\nbathtub\ndrain\nflush\nhip bath\nhot tub\nJacuzzi\nmedicine cabinet\nplughole\nshaver point\nshower pan\nshower tray\nshowerhead\nsplashback\ntowel rail\nwhirlpool\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPersonal care - general words\nParts of buildings: rooms\nMedical treatment: general words\nContainers for liquids and gases\nto wash in a bath or to wash someone in a bath: old-fashioned She baths every morning. I usually bath the kids in the evening.\nSMART Vocabulary: related words and phrases\nPersonal care - general words\namenity kit\nbaby wipe\nbeach body\nbeardy\nbed bath\nbubble bath\nfat-shaming\nfatphobia\nfatphobic\nflossing\nhand gel\nscrub\nscrub up well idiom\nshave\nspruce\nweak-chinned\nwell groomed\nwhirlpool bath\nwindblown\nwindswept\nSee more results »\nAdd to word list\nAdd to word list\nthe activity of washing yourself or another person or an animal in a large container filled with warm water\nWhen describing homes, a bath can also mean a bathroom:\ntake a bath informal\nAdd to word list\nAdd to word list\nto lose a lot of money as a result of a bad business deal or investment: Unless the shares take a bath, they should soon be worth £50K more than when we bought them."}