{"id":29137,"name":"battle","type":"noun","us_sound":"ˈbæt̬.əl","us_link":"../audio/b/battle.mp3","uk_sound":"ˈbæt.əl","uk_link":"../audio/b/ukbatch025.mp3","content":"battle noun [C]\n(FIGHT)\nAdd to word list\nAdd to word list\nB1 a fight between armed forces: the Battle of the Somme Her only brother was killed in battle (= while fighting).\nThesaurus: synonyms, antonyms, and examples\na fightfightHe got into a fight in school. fistfightHe was arrested for getting into a fistfight after the match.brawlHe was injured in a brawl outside the stadium.scuffleThere were a few scuffles between fans after the match.clashFive people were injured in clashes between strikers and owners.struggleHe managed to escape after a struggle.\nSee more results »\nMore examplesFewer examplesDuring the war, he saw many of his comrades fall in battle.They've been engaged in a legal battle with the council for several months.We will be flying 100 badly wounded civilians out of the battle zone tonight.She has fought a constant battle with depression throughout her career.In the battle to retake the village, over 150 soldiers were killed.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nbattle noun [C]\n(ARGUMENT)\nB2 an argument between two groups or against a situation that a group wants to change: The aid agency continues the battle against ignorance and superstition. The battle for women's rights still goes on.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nbattle noun [C]\n(EFFORT)\nB2 a determined effort to achieve something in a difficult situation or to change a bad situation: a long battle against cancer\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nIdioms\nbattle of wits\ndo battle\nto fight: Police battled with residents in this part of the city for three days. For years the two nations battled over territory.\nC2 to try hard to achieve something in a difficult situation: He had to battle against prejudice to get a job. Her parents battled for the right to be involved in the decision-making. We battled with the elements to get the roof fixed.\nThesaurus: synonyms, antonyms, and examples\nto try to do somethingtryI'll try to call her again.attemptI have never attempted to run a marathon.endeavourUK Engineers are endeavouring to locate the source of the problem.seekThey sought to reassure the public.battleHe was battling to fix the roof in the rain.striveWith limited resources, they are striving to make the school a better one.\nSee more results »\nMore examplesFewer examplesThey had to battle to save his life.We've battled with the authorities to change the system.I've battled for years to get him promoted.I battled with the wind and the rain to get here!He's always battling with management to get things changed.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrying and making an effort\nAdd to word list\nAdd to word list\na fight between armed forces, or an argument between two groups: [ C ] the Battle of Cedar Creek [ C ] a naval battle [ C ] The battle between street gangs went on for years. [ C ] They’re in a battle with their publisher over electronic rights.\nA battle can also be a serious effort to change a situation: [ C ] Doctors Without Borders is a group that wages battles against hunger and disease.\nto fight, compete, or argue with another person or group: [ I ] Congress is battling with the White House over funding. [ T ] Long Horse died battling the Sioux in 1875. [ I ] I thought we had the game under control, but they really battled back.\nIf you battle something, you try hard to change the situation: [ I ] The group was formed to battle prejudice.\nAdd to word list\nAdd to word list\n[ C ] a competition or argument between two or more people or organizations for power or control: battle for/over sth They were locked in a battle for boardroom control.battle against/with sb If you want to stay in the battle with competitors, you must constantly update your services.battle between sb and sb the ongoing battle between the government and the unions a fierce/bitter/long-running battlea takeover/bidding/bid battle After suffering a drop in profits, the firm found itself in the middle of a takeover battle.fight/lose/win a battle Has Europe lost the battle with America over online dominance?be locked in/engaged in a battle (to do sth) The entire aviation industry is locked in a battle to produce the most efficient aircraft and engines.\n[ S ] a situation in which you try very hard to solve problems or succeed: Many smaller firms are losing out in the battle for survival.face/fight a battle The government faces a battle to regain the confidence of the financial markets.an uphill battle Workers fought an uphill battle to prove their illnesses were caused by on-the-job toxic exposures. battle to do sth the battle to develop new technologies\nif two or more people or organizations battle, or battle each other, they compete with each other for power or control: The company will now have to battle its resurgent competitor.battle for/over sth Unions and management are currently battling over pay and staffing levels.battle with/against sb/sth He battled with the board for many months before finally resigning. Budget hotels are battling it out to bring US-style prices to Britain.\nto try very hard to solve a problem or to succeed: battle against sth She had to battle against prejudice to get the job. Against a background of changing consumer habits, the big music groups are battling falling sales. The retailer battled through a difficult spring and summer as sales fell by 2.5%.battle to do sth Hydro Electric staff battled to restore power to up to 20,000 customers."}