{"id":29110,"name":"batter","type":"verb","us_sound":"ˈbæt̬.ɚ","us_link":"../audio/b/batter.mp3","uk_sound":"ˈbæt.ər","uk_link":"../audio/b/ukbatch021.mp3","content":"Add to word list\nAdd to word list\nto hit something with force many times: batter against The waves battered against the rocks at the bottom of the cliff.batter something down The burglars had battered down the door of the house (= hit it so hard that it broke and fell down).be battered to death He was battered to death with a rifle butt. He was battering on the door with his fists and howling.\nto hit and behave violently towards a person repeatedly over a long period of time: Campaigners are concerned that the new laws on domestic violence do not show enough understanding of the lives of people who are battered.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhead-butt\nhell\nkick\nmess\nswing\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTreating people or animals badly\nbatter noun\n(FOOD)\n[ C or U ] a mixture of flour, eggs, and milk or another liquid, used to make pancakes or to cover food before frying it: Add the sour cream to the batter, beating well. Pour the pancake batter into the pan.in batter I find that fish fried in batter is lighter and crispier. Crepes and pancakes are made with different batters. Chefs over the world include tempura dishes on their menus, using a wide variety of different batters and ingredients.\nRobert Rowe / EyeEm/GettyImages\n[ C or U ] US (UK cake mixture) a mixture containing ingredients such as flour, butter, sugar, and eggs that will be baked and become a cake or cakes: I used to love eating the last bits of cake batter from the bowl. Divide the batter among 12 muffin cups. In most classic cake batters you typically add eggs to the batter.\nSMART Vocabulary: related words and phrases\nPancakes & batter\nBelgian waffle\nbhaji\nblini\nblintze\nchurro\ndosa\nDutch baby\negg roll\nflapjack\nfritter\nhotcake\nhush puppy\njohnnycake\nlatke\npakora\npotato pancake\nrugelach\nspring roll\ntoad-in-the-hole\nYorkshire pudding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCakes\nbatter noun\n(PLAYER)\n[ C ] the person in baseball, cricket, or rounders who hits the ball: The batter swings and misses. The International Cricket Council (ICC) announced that the word \"batsman\" would be replaced by the ungendered word \"batter\". Compare\nbatsman\nbatswoman\nShoji Fujita/DigitalVision/GettyImages\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nfoul\nglove\nhomer\nliner\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nbatter verb [I/T]\n(HIT)\nAdd to word list\nAdd to word list\nto hit someone or something again and again: [ T ] Thunderstorms were battering Kansas again on Sunday. [ T ] fig. He had been battered by opponents who turned public opinion against him.\nbatter noun\n(FOOD)\n[ U ] any liquid mixture containing milk, eggs, and flour, as used to make cake, pancakes, or other similar food, or to cover food before frying it\nbatter noun\n(STICK)\n[ C ] (in baseball) the player whose turn it is to hit the ball"}