{"id":29350,"name":"be","type":"verb","us_sound":"biː","us_link":"../audio/b/b.mp3","uk_sound":"biː","uk_link":"../audio/b/ukazt__003.mp3","content":"be verb\n(DESCRIPTION)\nAdd to word list\nAdd to word list\nA1 [ L ] used to say something about a person, thing, or state, to show a permanent or temporary quality, state, job, etc.: He is rich. It's cold today. I'm Andy. That's all for now. What do you want to be (= what job do you want to do) when you grow up? These books are (= cost) $3 each. Being afraid of the dark, she always slept with the light on. Never having been ill himself, he wasn't a sympathetic listener. Be quiet! [ + -ing verb ] The problem is deciding what to do. [ + to infinitive ] The hardest part will be to find a replacement. [ + that ] The general feeling is that she should be asked to leave. It's not that I don't like her - it's just that we rarely agree on anything!\nThesaurus: synonyms, antonyms, and examples\nto have a certain monetary valuecostHiring a car for the week will cost close to £300!beThe cakes were £1.50 each or two for £2.sell forThe tickets sell for £100 each. fetchThe medieval manuscript fetched a record-breaking £1.2 million at auction. go for somethingHouses around here usually go for about £500,000. set someone back (something)Phew, that ring looks like it set you back.\nSee more results »\nA1 [ I usually + adv/prep ] used to show the position of a person or thing in space or time: The food was already on the table. Is anyone there? The meeting is now (= will happen) next Tuesday. There's a hair in my soup.\n[ L ] used to show what something is made of: Is this plate pure gold?\nMore examplesFewer examplesDon't be so cheeky!Our solicitors have advised that the costs could be enormous.You have to go to college for a lot of years if you want to be a doctor.Come along - we don't want to be late!Oranges, lemons, limes and grapefruit are types of citrus fruit.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe a thing idiom\nbeen\nbeing\ncome\nextant\nfound\nhave legs idiom\nhood\nindissolubility\nlie in\nliving\nrun\nthey're\nthing\nthingness\nviability\nwe're\nwho're\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComprising and consisting of\nbe verb\n(ALLOW)\n[ + to infinitive ] formal used to say that someone should or must do something: You're to sit in the corner and keep quiet. Their mother said they were not to (= not allowed to) play near the river. There's no money left - what are we to do?\nMore examplesFewer examplesYou are not to come downstairs until you have tidied up your room.Tell her she is not to open the door to any strangers.You are never to use rude language like that in my house, do you understand?I've made it clear to the visitors that they are not to touch any of the machinery.The school rules state that no child is to leave the school premises during the day, unless accompanied by an adult.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nhave something on your hands idiom\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\npigeon\nportfolio\nsomeone's answer to someone/something idiom\nstick\nSee more results »\nbe verb\n(FUTURE)\n[ + to infinitive ] formal used to show that something will happen in the future: We are to (= we are going to) visit Australia in the spring. She was never to see (= she never saw) her brother again.\n[ + to infinitive ] used in conditional sentences to say what might happen: If I were to refuse they'd be very annoyed.formal Were I to refuse they'd be very annoyed.\nMore examplesFewer examplesThe four soldiers are to receive citations from the president for their brave actions.The three largest banks are to raise their interest rates.The government is to spend millions of dollars on combating drug abuse.If the company were to offer him more money, he might not leave.After they've finishing painting the hall, they are to start on the living room.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nin\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\nspace\ntime signature\ntimestamp\nup\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\nbe verb\n(CAN)\n[ + to infinitive ] used to say what can happen: The exhibition of modern prints is currently to be seen at the City Gallery.\nbe verb\n(EXIST)\n[ I ] to exist or live: formal Such terrible suffering should never be.old use or literary By the time the letter reached them their sister had ceased to be (= had died).\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe a thing idiom\nbeen\nbeing\ncome\nextant\nfound\nhave legs idiom\nhood\nindissolubility\nlie in\nliving\nrun\nthey're\nthing\nthingness\nviability\nwe're\nwho're\nSee more results »\nGrammar\nModal expressions with beThere are a number of expressions with be which have modal meanings, for example, be to, be able to, be allowed to, be supposed to: …\nBe as an auxiliary verbBe is one of three auxiliary verbs in English: be, do and have. We use be to make the continuous form and the passive voice: …\nBe: typical errorsRemember to use are for the third person plural form of be: …\nBe expressions (be able to, be due to)Be about to is used to talk about things which are going to happen very soon: …\nBe about toBe about to is used to talk about things which are going to happen very soon: …\nBe able toBe able to is like can. We use it to talk about abilities. We often use it in places where it is not possible to use can. For example, it isn’t possible to use can after another modal verb: …\nBe due toBe due to is used to talk about things that are expected or planned to happen at a certain time. We often use it with a time expression: …\nBe likely toBe likely to is used to talk about how probable things are: …\nBe meant toBe meant to is used to talk about what is desirable, expected or intended: …\nBe supposed toBe supposed to is used to talk about obligations and arrangements: …\nBeen or gone?We often use been to, instead of gone to, when we refer to completed visits to a place: …\nBeBe is an irregular verb with several forms: …\nBe: formsBe is an irregular verb with several forms: …\nBe: usesWe use be as a main verb and an auxiliary verb. …\nBe as a main verbBe as a main verb has a number of meanings. …\nIf + were toIn formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nPhrasal verb\nbe in for something\nbe auxiliary verb\n(CONTINUE)\nA2 [ + -ing verb ] used with the present participle of other verbs to describe actions that are or were still continuing: I'm still eating. She's studying to be a lawyer. The audience clearly wasn't enjoying the show. You're always complaining. I'll be coming back (= I plan to come back) on Tuesday.\nMore examplesFewer examplesLong hair on men seems to be coming back into fashion.I am embroidering this picture for my mother.The police are carrying out spot checks on drivers over the Christmas period to test for alcohol levels.Police are still looking for clues in their search for the missing girl.The two athletes are competing for the gold medal.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nceaseless\nimmanence\nimmanent\nimmanently\nimperishable\nimperishably\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\npermanence\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\nbe auxiliary verb\n(PASSIVE)\nA2 [ + past participle ] used with the past participle of other verbs to form the passive: I'd like to go but I haven't been asked. Troublemakers are encouraged to leave. A body has been discovered by the police.\nMore examplesFewer examplesHospitals need to be kept spotlessly clean.After my aunt died, we arranged for her house to be cleared .They're advising that children be kept out of the sun altogether.Your shoes will be repaired and ready for you to collect on Thursday.The first election results are expected around 1 a.m.\nGrammar\nModal expressions with beThere are a number of expressions with be which have modal meanings, for example, be to, be able to, be allowed to, be supposed to: …\nBe as an auxiliary verbBe is one of three auxiliary verbs in English: be, do and have. We use be to make the continuous form and the passive voice: …\nBe: typical errorsRemember to use are for the third person plural form of be: …\nBe expressions (be able to, be due to)Be about to is used to talk about things which are going to happen very soon: …\nBe about toBe about to is used to talk about things which are going to happen very soon: …\nBe able toBe able to is like can. We use it to talk about abilities. We often use it in places where it is not possible to use can. For example, it isn’t possible to use can after another modal verb: …\nBe due toBe due to is used to talk about things that are expected or planned to happen at a certain time. We often use it with a time expression: …\nBe likely toBe likely to is used to talk about how probable things are: …\nBe meant toBe meant to is used to talk about what is desirable, expected or intended: …\nBe supposed toBe supposed to is used to talk about obligations and arrangements: …\nBeBe is an irregular verb with several forms: …\nBe: formsBe is an irregular verb with several forms: …\nBe: usesWe use be as a main verb and an auxiliary verb. …\nBe as a main verbBe as a main verb has a number of meanings. …\nbe verb\n(RELATIONSHIP)\nAdd to word list\nAdd to word list\nused to connect two things or a thing with something that it has as a quality or condition: [ L ] It is cold today. [ L ] My name is Andy. [ L ] She is a doctor. [ L ] How old are you? [ L ] These books are (= cost) $12.99 each. [ L ] Please be patient.\nBe is also used to show the position of a person or thing in space or time: [ I always + adv/prep ] The food was on the table. [ I always + adv/prep ] Tony is in trouble again.\nbe verb\n(EXIST)\n[ L ] to exist: She apologized for the way things are around here. There was no sound.\nbe auxiliary verb\n(CONTINUE)\npresent tense am us/æm/ are us/ɑr/ is us/ɪz/ | present participle being us/ˈbi·ɪŋ/ | past tense was us/wʌz/ were us/wɜr/ | past participle been us/bɪn/ used with the present participle of other verbs to describe actions that are or were continuing: You are being very selfish. She was studying to be a lawyer. It is raining. I’ll be coming back (= I plan to come back).\nbe auxiliary verb\n(PASSIVE)\npresent tense am us/æm/ are us/ɑr/ is us/ɪz/ | present participle being us/ˈbi·ɪŋ/ | past tense was us/wʌz/ were us/wɜr/ | past participle been us/bɪn/ used with the past participle of other verbs to form the passive: He was asked to wait. Please be seated. The World Trade Center was built in the early 1970s.\nbe auxiliary verb\n(POSSIBLE CONDITION)\npast tense were us/wər/ were used to show the possibility of a condition or of something happening in the future: If I were afraid of you, why would I be here? If you were allowed to have one wish, what would it be? Note: In grammar, this form of be is called the subjunctive.\nbe auxiliary verb\n(FUTURE)\nfml present tense am us/æm/ are us/ɑr/ is us/ɪz/ | past tense was us/wʌz/ were us/wɜr/ used to say what will happen: [ + to infinitive ] The president is to decide this issue very soon.\nbe auxiliary verb\n(ALLOW)\nfml present tense am us/æm/ are us/ɑr/ is us/ɪz/ | past tense was us/wʌz/ were us/wɜr/ used to tell people they must or should do something: [ + to infinitive ] Their mother said they were to play nearby."}