{"id":29379,"name":"beacon","type":"noun","us_sound":"ˈbiː.kən","us_link":"../audio/b/beacon.mp3","uk_sound":"ˈbiː.kən","uk_link":"../audio/b/ukbattl022.mp3","content":"Add to word list\nAdd to word list\na light or fire in a place that is easy to see, such as on the top of a hill, that acts as a warning or signal: As part of the centenary celebrations a chain of beacons was lit across the region. The tower had a flashing beacon that people could see from miles away. Compare\nlighthouseSee also\nBelisha beacon\na device that sends out a radio signal to show the position of something such as a ship, aircraft, etc.: A plane's transponder is a beacon that transmits an identifying code. Planes fly along air corridors marked by ground-based radio beacons.\na good example that gives people hope or encouragement: She was a beacon of hope in troubled times. He said Britain could become a beacon to the rest of the world.\nMore examplesFewer examplesBoston Light on Little Brewster Island is the only beacon still manned by an active-duty Coast Guard crew.At the far end of the street, headlights shine like a beacon.Robot taxis would respond to electronic signals from navigation beacons. He developed a beacon to locate skiers buried in an avalanche.Dubai was transformed from an ancient Persian Gulf port into a glitzy international hub of spas and skyscrapers - and a beacon of modernity for the Arab world.\"How can the United States uphold our position as a beacon for the free exchange of ideas and science if we ourselves censor authors?\" he asks.He continued to believe in the idea of racial justice in America. And that's what makes him such a beacon.\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nbrand\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nL-plate\nMaltese cross\nMorse code\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFire & flame\nSigns, signals and symbols\nBroadcasting: radio\nEncouraging and urging on\nAdd to word list\nAdd to word list\na light that acts as a signal or warning: fig. a beacon of hope\nA beacon is also a device that sends a signal or information: a radar/navigation beacon"}