{"id":29511,"name":"bear","type":"verb","us_sound":"ber","us_link":"../audio/b/bare.mp3","uk_sound":"beər","uk_link":"../audio/b/ukbanqu030.mp3","content":"bear verb\n(ACCEPT, TAKE)\nAdd to word list\nAdd to word list\nB2 [ T ] to accept, tolerate, or endure something, especially something unpleasant: The strain must have been enormous but she bore it well. Tell me now! I can't bear the suspense! [ + to infinitive ] He couldn't bear to see the dog in pain. [ + -ing verb ] I can't bear being bored.\nThesaurus: synonyms, antonyms, and examples\nto accept or continue in a situation that is difficult or unpleasantbearI will bear the responsibility for whatever happens.endureShe endured years of hip pain before seeing a surgeon.sufferShe suffers from severe asthma. acceptI have finally accepted that I can't change who he is.resign yourself toI have resigned myself to the fact that I'll never work again.become resigned toPeople have become resigned to the fact that increased security means much longer wait times at airports.\nSee more results »\n[ T ] to be responsible for something: bear responsibility It's your decision - you have to bear the responsibility if things go wrong. They say that landlords should bear the burden of these repairs and not tenants. I suggest you claim on your insurance rather than bearing the cost yourselves. not bear thinking about\nto be too unpleasant or frightening to think about: \"What if she'd been driving faster?\" \"It doesn't bear thinking about.\"\nSee more\nMore examplesFewer examplesI can't bear this stifling humidity.I can't bear it when someone starts ramming their views down your throat.\"I can't bear to see good victuals wasted,\" said Martha.My mother couldn't bear waste - she always made us eat everything on our plates.I put my hands over my eyes because I couldn't bear to watch.The consumer must surely bear some responsibility in this situation.Deregulation is making users bear the cost of calls they did not ask for.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nput up with something/someone\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nstomach\nstruggle\nsweat it out idiom\ntolerance\ntough\ntough something out\nwait\nwait something out\nweather the storm idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDuty, obligation and responsibility\nbear verb\n(KEEP, HAVE)\nC1 [ T ] to have or continue to have something: bear in mind Thank you for your advice - I'll bear it in mind (= I will remember and consider it).bear a resemblance to Their baby bears a strong resemblance to strong to its grandfather. The stone plaque bearing his name was smashed to pieces. On display were boxing gloves that bore Rocky Marciano's signature. [ + two objects ] I don't bear them any ill feeling (= I do not continue to be angry with or dislike them).\nMore examplesFewer examplesThe numerous awards on the walls bear witness to his great success.I bear him no malice.She bears a faint resemblance to my sister.This explosion bears all the hallmarks of a terrorist attack.The book bears several striking similarities to last year's bestseller.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nbear verb\n(SUPPORT)\n[ T ] to hold or support something: bear someone's weight The chair, too fragile to bear her weight, collapsed.bear something's weight I don't think that the table will bear the weight of the heavy machinery.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npier\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nsinew\nunderpin\nweight-bearing\nSee more results »\nbear verb\n(PRODUCE)\nC2 [ T ] formal to give birth to young, or (of a tree or plant) to give or produce fruit or flowers: The pear tree they planted has never borne fruit. She had borne six children by the time she was 30. [ + two objects ] When his wife bore him a child he could not hide his delight. Most animals bear their young in the spring.\nSMART Vocabulary: related words and phrases\nPlant reproduction\nanther\nasexual reproduction\nasexuality\nasexually\nbarrenness\nbreeder\nchasmogamous\ngerminate\npalynology\npistillate\npollinate\npollination\npollinator\npropagate\nself-incompatible\nself-pollination\nsexlessly\nsiltation\nsporangium\nstamen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObstetrics: birth\nbear verb\n(BRING)\n[ T ] formal to carry and move something to a place: bear gifts At Christmas the family all arrive at the house bearing gifts. Countless waiters bore trays of drinks into the room. The sound of the ice cream van was borne into the office on the wind.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nbear verb\n(CHANGE DIRECTION)\nC1 [ I usually + adv/prep ] to change direction slightly so that you are going in a particular direction: bear left After you go past the church keep bearing left.bear right Bear right at the fork in the road. The path followed the coastline for several miles, then bore inland.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbranch\nbranch off\nbreak\ndecoy\ndo an about-face\ndo an about-turn\nexcursive\nexcursively\nflippy\nping-pong\nregear\nreverse\nsheer\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nwheel\nSee more results »\nbear verb\n(SAY)\nbear testimony/witness formal\nto say you know from your own experience that something happened or is true: She bore witness to his patience and diligence.\nIf something bears testimony to a fact, it proves that it is true: The iron bridge bears testimony to the skills developed in that era.\nSee more bear false witness old use\nto lie: He accused his neighbour of bearing false witness against him.\nSee more Grammar\nBorn or borne?We use born in the phrase be born to indicate that a child has entered the world: …\nBornWe use born in the phrase be born to indicate that a child has entered the world: …\nBear, bore, borneBear means to tolerate something, usually something that you dislike. It is most commonly used in the expression can’t bear. The past form is bore and the -ed form is borne: …\nIdioms\nbear fruit\nbear the scarsPhrasal verbs\nbear away\nbear someone/something away\nbear down\nbear down on someone/something\nbear in on/upon\nbear on something\nbear someone/something out\nbear up\nbear with someone\nbear noun [C]\n(ANIMAL)\nA2 a large, strong wild mammal with a thick fur coat that lives especially in colder parts of Europe, Asia, and North America: bear cub a bear cub (= young bear) a brown/black bear See also\ngrizzly bear\npolar bear\nteddy (TOY)\nGlobalP/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesWe sell all shapes and sizes of teddy bear.Emily hugged her teddy bear tightly to her chest.He had a scruffy old teddy bear which went by the name of Augustus.Polar bears live in the Arctic.The illustrations show monstrous beasts with bodies like bears and heads like tigers.\nSMART Vocabulary: related words and phrases\nWild mammals\naardvark\nanteater\narmadillo\nBactrian\nbandicoot\ngrizzly\ngrizzly bear\nhedgehog\nhippopotamus\njavelina\npangolin\npeccary\npine marten\nplatypus\npolar bear\nstoat\ntamandua\ntapir\nTasmanian devil\nTasmanian wolf\nSee more results »\nbear noun [C]\n(MAN)\nslang an older gay man who is large and has a lot of hair on his body\nbear noun [C]\n(FINANCE)\nfinance &amp; economics\n&#160; specialized a person who sells shares when prices are expected to fall, in order to make a profit by buying them back again at a lower price Compare\nbull (FINANCE) specialized\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nSee also\nthe/your average bearIdioms\nbe like a bear with a sore head\ndoes a bear/do bears shit in the woods?\nbear noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\na large, strong mammal with thick fur that lives esp. in colder parts of the world: a black/grizzly/polar bear\nbear verb\n(CARRY)\n[ T ] to carry or bring something: Fans bearing banners ringed the stadium.\nbear verb\n(SUPPORT)\n[ T ] to hold or support something: The bridge has to be strengthened to bear heavier loads.\nbear verb\n(ACCEPT)\nto accept something painful or unpleasant with determination and strength: [ T ] Since you will bear most of the responsibility, you should get the rewards. [ + to infinitive ] He could not bear to see her suffering.\nbear verb\n(HAVE)\n[ T ] to have as a quality or characteristic: My life bore little resemblance to what I’d hoped for.\nbear verb\n(PRODUCE)\n[ T ] past participle born us/bɔrn, boʊrn/ (of mammals) to give birth to young, or of a tree or plant to give or produce fruit or flowers: She bore three children in five years. Note: When talking about mammals, use the past participle spelling \"born\" to talk about a person or animal’s birth, and the spelling \"borne\" to talk about a mother giving birth to a child: She had borne four boys.\nbear verb\n(TRAVEL)\n[ I always + adv/prep ] to travel or move in the stated direction: After you pass the light, bear left until you come to a bank. Idiom\nbear fruitPhrasal verbs\nbear down\nbear down on someone/something\nbear out something/someone\nbear up\nbear with someone/something\nAdd to word list\nAdd to word list\nsomeone who expects prices on a financial market to go down and sells their shares, etc. hoping to buy them back in the future at a lower price: The brokerage, which has been a persistent bear in recent months, switched its recommendation from sell to hold. The bears are driven by bad economic news from Japan, such as July's 2.4% monthly slump in industrial production. Compare\nbullSee also\nbear market"}