{"id":29595,"name":"beat","type":"verb","us_sound":"biːt","us_link":"../audio/b/beat.mp3","uk_sound":"biːt","uk_link":"../audio/b/ukbeami019.mp3","content":"beat verb\n(DEFEAT)\nAdd to word list\nAdd to word list\nB1 [ T ] to defeat or do better than: beat sb at sth Simon always beats me at tennis. The Miami Heat beat the Pacers by five points, 95-90. Holland beat Belgium (by) 3–1. Our team was comfortably/easily/soundly beaten in the first round of the competition. The Nationalists were narrowly beaten in the election. He beat me fair and square (= without cheating). They were beaten hands down (= completely) by their opponents.beat a record She has beaten her own record of three minutes ten seconds. Synonyms\nannihilate informal\nconquer\ncrush (BEAT)\ndefeat\nhammer (DEFEAT) informal\nthrash (DEFEAT) informal\ntrounce informal\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\nB2 informal to be better or more enjoyable than another activity or experience: beat the hell out of slang Taking the bus beats the hell out of (= is much better than) walking all the way there.you can't beat You can't beat (= there is nothing more enjoyable than) a cold beer on a hot afternoon. [ + -ing verb ] Taking the bus sure beats walking.\n[ T ] To beat something that is going to happen is to take action before the thing happens: beat the rush I always do my shopping early to beat the rush. Let's try to beat the traffic by leaving early in the morning. beat someone to it\nto do something before someone else does it: I was just going to clean the kitchen, but you beat me to it.\nSee more\nMore examplesFewer examplesPaul beat me by three games to two.With this new product, we are well situated to beat our competitors.They will be a tough team to beat.The Liberal Democrats may form a pact with Labour to try to beat the Conservatives in the next election.She came within two seconds of beating the world record.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurpassing in quality or number\nActing and acts\nbeat verb\n(HIT)\nB2 [ I or T, usually + adv/prep ] to hit repeatedly: beat down The rain was beating down incessantly on the tin roof.beat to death She was beaten to death. They saw him beating his dog with a stick. The child had been brutally/savagely beaten. [ + obj + adj ] He was beaten senseless. Beat the drum.\nThesaurus: synonyms, antonyms, and examples\nto hit someone or somethinghitShe was expelled for hitting another pupil.whackShe whacked the water with her paddle.bashThe swinging door bashed him in the face.strikeShe had been struck on the head with a golf ball.beatHe was cruel to his dog and beat it with a stick.punchHe punched me in the stomach.\nSee more results »\nbeat a path through something\nto form a path in an area where long grass or bushes grow closely together, by hitting the plants with your hands or an object, or by stepping on them: We beat a path through the undergrowth.\nSee more\nMore examplesFewer examplesThe rain beat against her face as she struggled through the wind.They've threatened to beat him to a jelly if he doesn't repay the money.People were shocked by the advertisement which depicted a woman beating her husband.His bruises lent credence to his statement that he had been beaten.I felt sick when I heard about the prisoners being beaten.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nbeat verb\n(MIX)\nC1 to mix something repeatedly using a utensil such as a spoon or whisk: To make an omelette you first beat the eggs.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\nchurn\ncrossed\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nmeld\nmethylate\nmingle\nmosaic\nmush\nsaturated solution\nscramble\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCookery terms\nbeat verb\n(MOVEMENT)\nB1 [ I or T ] to (cause to) make a regular movement or sound: The doctor could feel no pulse beating. Her heart started to beat faster. The hummingbird beats its wings at great speed. beat time\nto make a regular sound or movement to music: He beat time on the table to mark the rhythm of the poem.\nSee more\nMore examplesFewer examplesThey danced to the beat of the drums.The beat of the music was strangely hypnotic.The car radio was pumping out music with a heavy beat.Every time he looks at me my heart skips a beat.Waltzes have three beats in/to the bar.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nshiver\nsway\nthrash\ntremulously\nvibrate\nvibration\nvibratory\nwaggle\nSee more results »\nIdioms\nbeat someone at their own game\nbeat someone hollow\nbeat someone's brains out\nbeat your breast/chest\nbeat a path to someone's door\nbeat a retreat\nbeat around the bush\nbeat a dead horse\nbeat it!\nbeat the rap\nMore idioms\nif you can't beat 'em, join 'em\nit beats me\ntake some beating\nthe beating heart of something\nthat beats everything\nPhrasal verbs\nbeat someone/something back\nbeat down\nbeat someone down\nbeat someone off\nbeat off\nbeat something out\nbeat someone out\nbeat out something\nbeat something out of someone\nbeat someone up\nMore phrasal verbs\nbeat yourself up\nbeat up on someone\nextremely tired: dead beat You've been working too hard—you look dead beat. I'm beat - I'm going to bed. Synonym\nbushed\nMore examplesFewer examplesAfter a weekend of partying, I'm absolutely beat.She had been through a hell of a lot and she looked beat.\nSMART Vocabulary: related words and phrases\nTired and making tired\nall in\nanti-fatigue\nat your worst idiom\nbe dead on your feet idiom\nbe fit/ready to drop idiom\nfinish something off\nfit to drop idiom\nfragile\ngassed\nhaggard\nshattered\nsleep deprivation\nsleep-deprived\nsleepily\nsleepiness\nstrung out\nworst\nwrecked\nyawningly\nzonked\nSee more results »\nbeat noun\n(MOVEMENT)\nB2 [ C or U ] a regular movement or sound, especially that made by your heart: skip a beat My heart skipped a beat (= I felt very excited) when she said, \"Yes, I'll marry you.\" I put my head on his chest but I could feel no heartbeat.\nMore examplesFewer examplesThey danced to the beat of the drums.The beat of the music was strangely hypnotic.The car radio was pumping out music with a heavy beat.Every time he looks at me my heart skips a beat.Waltzes have three beats in/to the bar.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanterograde\nanti-platelet\nblood donor\nblood vessel\ncapillary\nclot\nimmunoglobulin\nintravascular\nintravenously\njugular\njugular vein\nplatelet\nvasoactive\nvasoconstriction\nvasodilation\nVEGF\nveined\nSee more results »\nbeat noun\n(MUSIC)\nB2 [ C or U ] in music, a regular emphasis, or a place in the music where such an emphasis is expected: on the beat Make sure you play on the beat.to the beat He tapped his foot to the beat (= rhythm) of the music. The guitar comes in on the third beat.\nSMART Vocabulary: related words and phrases\nBeats or lengths of musical notes\nbackbeat\nbar\nbar line\ncommon time\ncompound time\neighth\nfour-four time\nfourth\nhalf note\nmeasure\nminim\noctave\npause\nquadruple\nrest\nsixteenth note\nthree-four time\nthree-quarter time\ntime signature\ntiming\nSee more results »\nbeat noun\n(AREA)\n[ C usually singular ] an area for which someone, such as a police officer, has responsibility as part of their job: Bob has worked as an officer on this particular beat for 20 years. be on/walk the beat\nA police officer who is on the beat or walking the beat is on duty, walking around rather than driving in a police car: Most people would like to see more bobbies on the beat in their area.\nSee more\nSMART Vocabulary: related words and phrases\nThe police generally\nanti-police\nanti-riot\nbaton\nbaton charge\nbilly club\nbooze bus\nescort\nfuzz\ngendarmerie\nInterpol\nkettle\nkettling\nlathi\npatrol car\nScotland Yard\nsecret police\nSpecial Branch\nstation house\nthe Royal Canadian Mounted Police\nwarrant\nSee more results »\nbeat noun\n(IN STORY)\n[ C ] mainly US an important moment, event, or subject in a story, film, etc.: The moment is gruesome, but it’s also an important beat in the story. The director effortlessly handles the plot twists and emotional beats.\nMore examplesFewer examplesIt's all about making sense of the story from beat to beat, figuring out if a scene adds up.The series has yet to progress from its promising debut, reiterating the same plot and character beats.The sequences are told sideways; the story beats aren’t as obvious as they usually are, but they do connect up with the larger story.Sometimes, when they cut the movie together, it doesn't work. Because the beats of comedy are in the cutting.This week in Washington, for many there is only one story, only one beat: the allegations against the president.\nSMART Vocabulary: related words and phrases\nCinema & theatre: parts of plays, shows & films\nact\nblooper reel\nbyplay\ncurtain call\ndream sequence\nexeunt\nexit\nfinale\nflashback\nfourth wall\nframing\nintermission\nmeet-cute\nplot hole\nscene\nset piece\nshowstopper\nstage direction\nwrap party\nSee more results »\nIdiom\nnot miss/skip a beat\nbeat verb\n(DEFEAT)\nAdd to word list\nAdd to word list\n[ T ] past tense beat | past participle beaten us/ˈbi·tən/ beat to defeat a competitor, or to do or be better than someone or something: In football, the Giants beat the 49ers, 17-3. Most people think that the governor will beat his opponent. The room wasn’t much, but it beat driving to a hotel 20 miles away.\n[ T ] past tense beat | past participle beaten us/ˈbi·tən/ beat To beat something that is going to happen is to take action that will prevent it from having an effect on you: I leave work early to beat the traffic.\nbeat verb\n(HIT)\n[ I/T ] past tense beat | past participle beaten us/ˈbit·ən/ beat to hit repeatedly: [ T ] He looked as if he’d been beaten. [ I ] The children were beating on the table.\nbeat verb\n(MIX)\n[ T ] past tense beat | past participle beaten us/ˈbit·ən/ beat to mix food with a fast circular motion: [ M ] Beat in the egg yolks.\nbeat verb\n(RHYTHM)\n[ I/T ] past tense beat | past participle beaten us/ˈbit·ən/ beat to make a rhythmic sound or movement, or to hit something in rhythm to make such a sound: [ I ] I was so nervous I could feel my heart beating. [ T ] He steadily beat the drum. [ I ] Without calcium, your heart could not beat correctly. Idioms\nbeat around the bush\nbeat it\n(it) beats mePhrasal verbs\nbeat someone to something\nbeat down\nbeat out someone\nbeat up someone\nbeat up on someone\nbeat noun [C usually sing]\n(AREA)\nan area for which someone, esp. a police officer, has responsibility as part of the job: People are comforted to see cops on the beat.\nbeat noun [C usually sing]\n(RHYTHM)\nmusic the rhythmic sound in music that repeats regularly: We clapped in time to the beat.\nbeat adjective\n(TIRED)\nextremely tired: I’m beat – I’m going to bed.\nAdd to word list\nAdd to word list\nto do better than someone or something: Yesterday's close beat the record set Feb. 1. With their lowest price guarantee, they will beat the price of a competitor's product by 10%.beat estimates/expectations/forecasts Declines in shares of the world's biggest chip maker halted when the company beat expectations for profits. They are selling the software packages at prices that are hard to beat.\nbeat the competition\nto be more successful than other people or companies that you are competing against: The way to beat the competition is to recruit and retain talented staff.\nbeat a path to sb's door\nto be eager to buy or get something from someone: By making furniture distinguished in design and workmanship, it has persuaded buyers to beat a path to its door.\nbeat a (hasty) retreat\nto decide not to continue with something that has become too difficult or not worth doing: Most of the market beat a hasty retreat, investors being unimpressed by a volatile performance on Wall Street.beat a retreat from sth The prime minister's cabinet continues to beat a retreat from many economic reforms.\nbeat sb at their own game\ninformal to use the methods by which someone has tried to defeat you to your own advantage: By buying two competitors who tried to beat him at his own game, he created the three networks he now owns.\nbeat sb to it\nto achieve something before someone else does it: We got very close to buying the franchise last year before another company beat us to it.\nbeat the odds\nto succeed despite having a disadvantage: Many mergers fail to deliver value to shareholders, but the bank's new president thinks it will be able to beat the odds.\nif you can't beat 'em, join 'em informal (also if you can't beat them, join them)\nsaid when you accept that you cannot be as successful as someone else without doing what they do: If you can't beat them, join them. Beginning in February the domestic distributor will become the exclusive U.S. importer for the popular foreign brands.\ntake some beating\nto do something so well that it is difficult for anyone else to do better: The automaker has delivered an impressive hatchback car that will take some beating. Phrasal verbs\nbeat sb/sth back\nbeat sb/sth down\nbeat off sb/sth\nbeat out sb/sth"}