{"id":29665,"name":"beauty","type":"noun","us_sound":"ˈbjuː.t̬i","us_link":"../audio/b/beauty.mp3","uk_sound":"ˈbjuː.ti","uk_link":"../audio/b/ukbeau_012.mp3","content":"beauty noun\n(BEING BEAUTIFUL)\nAdd to word list\nAdd to word list\nB1 [ U ] the quality of being pleasing and attractive, especially to look at: natural beauty This is an area of outstanding natural beauty. She believes that beauty comes from within. The piece of music he played had a haunting beauty.\n[ C ] a person or thing that is pleasing and attractive, especially to look at: Different cultures and eras have different ideas of what makes someone a great beauty. The caterpillar is a beauty - white with yellow and black markings - but it turns into an everyday, dull, brown moth.\n[ U ] the business of making people look attractive, using make-up, treatments, etc.: beauty products/treatments a beauty therapist/salon She said that people are now spending money on beauty and wellness because they realise it is good for them. This is a beauty brand inspired by Ayurveda - the traditional Indian system of medicine.\nMore examplesFewer examplesWe admired the beauty of the sunset.I don't think people should get surgery to meet contemporary standards of beauty.The beauty and range of his voice distinguishes him from other tenors.Not everyone appreciates the beauty of maths.She loved the beauty and fruitfulness of the autumn, when the whole countryside was ablaze with rich golden colours.It was a scene of indescribable beauty.The last day of the holiday was a beauty, with a warm breeze and a blue sky.\nSMART Vocabulary: related words and phrases\nBeauty and attractiveness\naesthetic\nattractiveness\nchic\ncrowning glory idiom\ndaintiness\ngorgeousness\ngrace\ngracefulness\ngrandeur\ngussy someone/something up\nlustrously\nmagnificence\nmajestically\nmajesty\nnobility\nsplendour\nstateliness\nsublimity\nsultriness\nswoony\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeauty treatments\nMake-up & skin care\nbeauty noun\n(EXCELLENT THING)\n[ C ] informal something that is an excellent example of its type: She showed me her car - it's a beauty. The second goal was a real beauty. Everyone told jokes — there were some beauties.\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbelter\nbunch\ngem\njewel\njim-dandy\nkiller\nking\nlulu\nmarvel\npeach\nscreamer\nsleeping beauty\nstandout\nsublime\nthe jewel in the crown idiom\nthe Rolls-Royce of something idiom\nSee more results »\nIdioms\nbeauty is in the eye of the beholder\nbeauty is only skin deep\nthe beauty of something\nyour beauty sleep\nAdd to word list\nAdd to word list\nan attractive quality that gives pleasure to those who experience it or think about it, or a person who has this attractive quality: [ U ] The Grand Canyon’s natural beauty attracts tourists from all over. [ C ] At 37 she was known as a great beauty.\nBeauty can also mean an attractive appearance: [ U ] Women’s magazines feature articles about diets and beauty tips. Idiom\nthe beauty of something"}