{"id":29785,"name":"because","type":"conjunction","us_sound":"bɪˈkʌz","us_link":"../audio/b/cdo1119usbeca0072.mp3","uk_sound":"bɪˈkəz","uk_link":"../audio/b/ukbeau_019.mp3","content":"Add to word list\nAdd to word list\nA1 for the reason that: \"Why did you do it?\" \"Because Carlos told me to\". We can't go to Julia's party because we're going away that weekend. Just because I'm lending you my dress for tonight doesn't mean you can borrow it whenever you want to.informal Where've you been, because (= the reason I am asking is that) we haven't seen you recently?\nMore examplesFewer examplesHe hated being in the army because he had to obey commands.The journey was quite quick because the road was clear.I didn't tell her that he was late because I didn't want to cause her any alarm.Patients were discharged from hospital because the beds were needed by other people.I almost missed my flight because there was a long queue in the duty-free shop.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwith a view to doing something idiom\nSee more results »\nGrammar\nAs, because or since?As, because and since are conjunctions. As, because and since all introduce subordinate clauses. They connect the result of something with its reason. …\nBecauseBecause is more common than as and since, both in writing and speaking. When we use because, we are focusing on the reason: …\nAs and sinceWe often use as and since when we want to focus more on the result than the reason. As and since are more formal than because. We usually put a comma before since after the main clause: …\nBecause, because of and cos, cos ofBecause introduces clauses of cause and reason. It is a subordinating conjunction. This means that the clause it introduces is a subordinate clause, which needs a main clause to make it complete. We use a comma when the subordinate clause comes before the main clause: …\nBecause: meaning and useBecause introduces clauses of cause and reason. It is a subordinating conjunction. This means that the clause it introduces is a subordinate clause, which needs a main clause to make it complete. We use a comma when the subordinate clause comes before the main clause: …\nBecause ofBecause of is a two-word preposition meaning ‘as a result of’: …\nCosCos, a short form of because, is pronounced /kəz/ or /kɒz/ and can also be spelt ’cause. It can be used instead of because (and cos of instead of because of). We often use it in speaking, emails and text messages, especially in informal situations: …\nJust because, simply becauseWe can emphasise because with just or simply: …\nused before giving a short reason or explanation, especially when you think the reason or explanation is obvious or you do not want to explain more: \"Why does that happen?\" \"Because science.\"\nMore examplesFewer examplesEnglish has a new preposition, because Internet.It always happens that way because politics.I like it because reasons.Didn't finish it because lazy.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwith a view to doing something idiom\nSee more results »\nAdd to word list\nAdd to word list\nfor the reason that: \"Why did you throw it?\" \"Because Carlos told me to.\" We can’t go to Julia’s party because we’re going away that weekend. because of preposition\nas a result of: The trip was canceled because of bad weather."}