{"id":30516,"name":"beforehand","type":"adverb","us_sound":"bɪˈfɔːr.hænd","us_link":"../audio/b/eus70476.mp3","uk_sound":"bɪˈfɔː.hænd","uk_link":"../audio/b/ukbeer_012.mp3","content":"Add to word list\nAdd to word list\nearlier (than a particular time): I knew she was coming that afternoon because she had phoned beforehand to say so.\nThesaurus: synonyms, antonyms, and examples\nat an earlier timebeforeI was sure I’d seen her face before.beforehandHe knew beforehand that his speech would anger many people.previouslyShe has previously denied the accusations.in advanceYou should prepare your ingredients in advance.ahead of timeUS Try to arrive at the airport ahead of time to minimize the possibility of delays.\nSee more results »\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprior\npriorly\nprologue\nquondam\nsecond-wave\nsecondary\nthe next but one idiom\nwake\nSee more results »\nGrammar\nBeforeBefore is a preposition, an adverb and a conjunction. Before means earlier than the time or event mentioned: …\nBefore as a prepositionWe use before most commonly with noun phrases to refer to timed events: …\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nBefore as an adverbBefore often comes after nouns such as day, morning, night, week, month, year to refer to the previous day, morning, etc.: …\nBefore as an adjunctWe use before to connect earlier events to the moment of speaking or to a point of time in the past: …\nBefore as a conjunctionWe use before as a subordinating conjunction. We commonly use before with the past simple tense. It suggests that the second event happened soon after the first one. The before clause, which indicates the second action, can be at the end or at the beginning of the sentence: …\nBefore with -ingA non-finite clause with before + ing-form is more formal: …\nJust before, immediately beforeWe can use adverbs such as just, immediately, shortly and long, and expressions involving words such as days, weeks, months, years in front of before: …\nBeforehandWe can use beforehand as an alternative to before as an adverb, especially when the reference to time is less specific. …\nOther uses of beforeWe use before meaning ‘in front of’ in more formal contexts: …\nBefore: typical errorsWe use above not before when we refer back to something we have already written: …\nAdd to word list\nAdd to word list\nearlier (than a particular time); in advance: She had phoned beforehand to let me know she was coming."}