{"id":30515,"name":"before","type":"preposition","us_sound":"bɪˈfɔːr","us_link":"../audio/b/before.mp3","uk_sound":"bɪˈfɔːr","uk_link":"../audio/b/ukbeer_011.mp3","content":"Add to word list\nAdd to word list\nA1 at or during a time earlier than (the thing mentioned): You should always wash your hands before meals. Before leaving he said goodbye to each of them. She's always up before dawn. Before he could reach the door, she quickly closed it. Before we make a decision, does anyone want to say anything else? She had to give the doorman a tip before he would help her with her suitcases (= he would not do it until she had given him a tip).\nThesaurus: synonyms, antonyms, and examples\nbefore somethingbeforeTry to arrive before the start of the meeting.prior toAll utensils should be washed prior to use.in advance ofCall in advance of your visit to see if you'll need a parking reservation.ahead ofMy sister is arriving ahead of me to do the shopping for the dinner.byMake sure you're back by midnight.\nSee more results »\nB1 until (the event mentioned): It was an hour before the police arrived.\nA2 in the past: He said he had never seen her before. I feel as though I've been here before.\nThesaurus: synonyms, antonyms, and examples\nat an earlier timebeforeI was sure I’d seen her face before.beforehandHe knew beforehand that his speech would anger many people.previouslyShe has previously denied the accusations.in advanceYou should prepare your ingredients in advance.ahead of timeUS Try to arrive at the airport ahead of time to minimize the possibility of delays.\nSee more results »\nMore examplesFewer examplesYou should always check your oil, water and tyres before taking your car on a long trip.Make sure your hands are clean before you have your dinner.Two weeks before my exams I shut myself away in my room with my books and I didn't speak to anyone.I want you to clear all these toys away before bedtime.She did well to find the way, considering she'd only been there once before.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbeforehand\nheel\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprior\npriorly\nprologue\nquondam\nsecond-wave\nsecondary\nthe next but one idiom\nwake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUntil a particular moment\nIn the past\nGrammar\nBeforeBefore is a preposition, an adverb and a conjunction. Before means earlier than the time or event mentioned: …\nBefore as a prepositionWe use before most commonly with noun phrases to refer to timed events: …\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nBefore as an adverbBefore often comes after nouns such as day, morning, night, week, month, year to refer to the previous day, morning, etc.: …\nBefore as an adjunctWe use before to connect earlier events to the moment of speaking or to a point of time in the past: …\nBefore as a conjunctionWe use before as a subordinating conjunction. We commonly use before with the past simple tense. It suggests that the second event happened soon after the first one. The before clause, which indicates the second action, can be at the end or at the beginning of the sentence: …\nBefore with -ingA non-finite clause with before + ing-form is more formal: …\nJust before, immediately beforeWe can use adverbs such as just, immediately, shortly and long, and expressions involving words such as days, weeks, months, years in front of before: …\nBeforehandWe can use beforehand as an alternative to before as an adverb, especially when the reference to time is less specific. …\nOther uses of beforeWe use before meaning ‘in front of’ in more formal contexts: …\nBefore: typical errorsWe use above not before when we refer back to something we have already written: …\nB1 in front of: The letter K comes before L in the English alphabet. Many mothers put their children's needs before their own. We have the whole weekend before us - what do you want to do? He stood up before a whole roomful of people, and asked her to marry him.\nA2 If a place is before another place, you will arrive at it first when you are travelling towards the second place: The bus stop is just before the school.\nIf something is before someone or before a group of people, it will be formally considered or examined by that person or group: The proposal before the committee is that we try and reduce our spending by ten percent. The men appeared before the judge yesterday.\nMore examplesFewer examplesHe bowed down before the king and begged for mercy.I could hardly believe the chaotic scene before me.There were still several people before me in the queue.He took out his gold watch and laid it on the table before hm.He got down on his knees before the altar.\nSMART Vocabulary: related words and phrases\nAhead, in front and beyond\nahead\nahead of\nante\nbe (right) under your nose idiom\nbeyond\ndownriver\nfollow\nfollow your nose idiom\nfore\nforward\nfront\nfront end\nfrontally\nhead\nlead\nnose\npara\npast\nup\nyonder\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\nLaw courts\nGrammar\nBeforeBefore is a preposition, an adverb and a conjunction. Before means earlier than the time or event mentioned: …\nBefore as a prepositionWe use before most commonly with noun phrases to refer to timed events: …\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nBefore as an adverbBefore often comes after nouns such as day, morning, night, week, month, year to refer to the previous day, morning, etc.: …\nBefore as an adjunctWe use before to connect earlier events to the moment of speaking or to a point of time in the past: …\nBefore as a conjunctionWe use before as a subordinating conjunction. We commonly use before with the past simple tense. It suggests that the second event happened soon after the first one. The before clause, which indicates the second action, can be at the end or at the beginning of the sentence: …\nBefore with -ingA non-finite clause with before + ing-form is more formal: …\nJust before, immediately beforeWe can use adverbs such as just, immediately, shortly and long, and expressions involving words such as days, weeks, months, years in front of before: …\nBeforehandWe can use beforehand as an alternative to before as an adverb, especially when the reference to time is less specific. …\nOther uses of beforeWe use before meaning ‘in front of’ in more formal contexts: …\nBefore: typical errorsWe use above not before when we refer back to something we have already written: …\nbefore preposition, conjunction, adverb [not gradable]\n(EARLIER)\nAdd to word list\nAdd to word list\nat or during a time earlier than (the thing mentioned): I left early because I wanted to arrive home before dark. Before making up your mind, think about all your options. It was another half hour before (= until) the ambulance finally arrived. Less than a week before, he’d graduated from college. before last\nBefore last means before the most recent: Today is Monday, so the day before last was Saturday. Idioms\nbefore you know it\nbefore long\nbefore preposition\n(IN FRONT)\nin front of: It took courage to stand before a courtroom full of people."}