{"id":30571,"name":"beg","type":"verb","us_sound":"beɡ","us_link":"../audio/b/beg.mp3","uk_sound":"beɡ","uk_link":"../audio/b/ukbeer_015.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to make a very strong and urgent request: They begged for mercy. [ + speech ] \"Please, please forgive me!\" she begged (him). [ + obj + to infinitive ] He begged her to stay, but she simply laughed and put her bags in the car. Synonyms\nadjure formal\nappeal (REQUEST)\nbeseech old use or literary\nentreat\nplead (REQUEST)\nThesaurus: synonyms, antonyms, and examples\nto beg for something or beg someone to do something begHe begged her to stay, but she wouldn't listen.imploreI implore you to change your mind.plead withHe pleaded with the guards to be allowed to see his daughter.appeal toI appeal to the public to remain calm.entreatThe banners entreated the government to release the prisoners.adjureThe gospel adjures us to love one another.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nB2 [ I or T ] to ask for food or money because you are poor: There are more and more homeless people begging on the streets these days. She had to beg for money and food for her children. He begged a loan from his boss.\n[ I ] If a dog begs, it sits with its front legs in the air as if to ask for something: They have trained their dog to sit up and beg. I beg your pardon\na polite way of saying \"I am sorry\" or \"Could you repeat what you just said?\": \"How do you take your tea?\" \"I beg your pardon?\" \"Your tea, madam. How do you take it?\"\na way of showing that you are angry about something that someone has just said: I beg your pardon? I hope you're not implying that I lied!\nSee more\nMore examplesFewer examplesShe made her old boyfriend beg her to come back and then she turned him down!He went down on his knees and begged for forgiveness.He decided to go, although I begged him not to.He bowed down before the king and begged for mercy.He was screaming in pain and begging for anaesthetic.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal (non-human) behaviour\nIdioms\nbeg the question\nbeg, borrow, or steal\ngo begging\nI beg to differ/disagreePhrasal verb\nbeg off\nAdd to word list\nAdd to word list\nto ask for money, or to ask someone to do something in an urgent way: [ I ] There are a lot of homeless people begging on the streets these days. [ T ] Is your child begging you for a skateboard?\nIf a dog begs, it sits with its front legs in the air as if to ask for something. Idioms\nbeg off\n(I) beg your pardon"}