{"id":30645,"name":"beginning","type":"noun","us_sound":"bɪˈɡɪn.ɪŋ","us_link":"../audio/b/beginning.mp3","uk_sound":"bɪˈɡɪn.ɪŋ","uk_link":"../audio/b/ukbeer_024.mp3","content":"Add to word list\nAdd to word list\nA2 [ C usually singular, U ] the first part of something or the start of something: Notes on how to use this dictionary can be found at the beginning of the book. She sat down and read the book straight through from beginning to end. I enjoyed my job at/in the beginning (= when I started it), but I'm bored with it now.\nThesaurus: synonyms, antonyms, and examples\nthe start of somethingbeginningLet's go back to the beginning. Can you tell me when you arrived at the crime scene?startI didn't like him from the very start.endThis is it – the end of the tour. openingThe opening of the ceremony was marred by protest.commencementWhat is the commencement date of their contract?kick-offWhat time is the kick-off for the banquet and show?\nSee more results »\n[ C often plural ] the origin of something, or the place, time, or way in which something started: The city had its beginnings in Roman times.\nMore examplesFewer examplesWe must be there by six, or else we'll miss the beginning of the film.The national anthems of the teams are played at the beginning of a big international football match.At the beginning of the book there's a quotation from Abraham Lincoln.Tell me what happened - start at the beginning.I did it all wrong, so I had to go back to the beginning and start again.\nSMART Vocabulary: related words and phrases\nBeginnings and starts\na baptism of/by fire idiom\nadvent\nbaptism\nbirth\ncommencement\ndawn\ninitiation\nintroduction\njumping-off point\nkick off\nonset\nopening\noutbreak\nsquare\nstarter\nstarting time\nthe thin end of the wedge idiom\nthin\ntrigger\nzero hour\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrigins and sources\nIdiom\nthe beginning of the end\nAdd to word list\nAdd to word list\nthe first part of something that continues"}