{"id":30795,"name":"behaviourist","type":"noun","us_sound":"bɪˈheɪ.vjɚ.ɪst","us_link":"../audio/b/usbedpo029.mp3","uk_sound":"bɪˈheɪ.vjə.rɪst","uk_link":"../audio/b/ukbegui010.mp3","content":"Add to word list\nAdd to word list\nsomeone who supports the theory of behaviourism (= the theory that human or animal behaviour is based on mental training and the influence of habit, rather than being explained by thoughts and feelings): Skinner was a behaviourist and advocated the theory of operant conditioning.\nsomeone whose study or work is related to animal behaviour: an animal behaviourist a practising canine behaviourist See\nbehaviourism\nMore examplesFewer examplesThis would be behaviourism, and Wittgenstein was not a behaviourist.They are fanatical behaviourists, believing that everything is subject to unlimited moulding and rearrangement through a process of reward and punishment.This technique of free association is a contribution to psychology which is used widely by psychotherapists, including behaviourists. Primate tool use has been studied by animal behaviourists.As a practising canine behaviourist, I have seen a steady increase in behaviour problems.Seek advice from a vet, animal behaviourist, or reputable dog trainer.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\ncathartic\ncathexis\ncertify\ncommittal\nFreudian\nJungian\npreconscious\nprofiler\nprojective\nprojectively\npsych\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal (non-human) behaviour\nsupporting or relating to the theory of behaviourism (= the theory that human or animal behaviour is based on mental training and the influence of habit, rather than being explained by thoughts and feelings): He's written a behaviourist account of the emotions. the relevance of behaviourist ideas to language teaching\nMore examplesFewer examplesUp to the 1960s behaviourist models of learning pervaded educational practice.The point serves as a corrective to behaviourist tendencies in general.Watson became known for his behaviourist approach, which he later applied to human behaviour. She takes seriously the views of certain behaviourist scientists who question whether the term \"play\" should be applied to animals."}