{"id":30775,"name":"behave","type":"verb","us_sound":"bɪˈheɪv","us_link":"../audio/b/eus70485.mp3","uk_sound":"bɪˈheɪv","uk_link":"../audio/b/ukbegui006.mp3","content":"Add to word list\nAdd to word list\nB1 to act in a particular way: She always behaves well/badly when her aunts come to visit. Whenever there was a full moon he would start behaving strangely. They behaved as if nothing had happened.\nThesaurus: synonyms, antonyms, and examples\nto behavebehaveThe kids behaved well at grandma’s yesterday.behavePeople behave differently when they can provide feedback anonymously.actTwo men were acting suspiciously in the car park.conduct yourselfCaptain Bingham has conducted himself in a manner unbecoming to an officer.comport yourselfShe comported herself with great dignity at her husband's funeral.\nSee more results »\nscience\n&#160; specialized to show particular behaviour in a particular situation or under particular conditions: They learn how particles behave in solids, liquids, and gases. It is believed that animals behave differently before a natural disaster.\nThesaurus: synonyms, antonyms, and examples\nto behavebehaveThe kids behaved well at grandma’s yesterday.behavePeople behave differently when they can provide feedback anonymously.actTwo men were acting suspiciously in the car park.conduct yourselfCaptain Bingham has conducted himself in a manner unbecoming to an officer.comport yourselfShe comported herself with great dignity at her husband's funeral.\nSee more results »\nB1 to be good by acting in a way that has society's approval: Did the children behave (themselves)?\nMore examplesFewer examplesI can't conceive how anyone could behave so cruelly.Small children often behave aggressively.I'm ashamed to be seen with you when you behave so badly!Let's stay calm and try to behave like responsible adults.I'd never behave like that in public.\nSMART Vocabulary: related words and phrases\nBehaving, interacting and behaviour\n-behaved\nas ye sow, so shall ye reap idiom\natavism\nattachment disorder\nattitude\nconduct\nhumanization\nhumanize\ninteract\ninteraction\nism\nmake nice idiom\nmanner\npresence\nprovincialism\nprovincialist\nprovinciality\nprovincially\nsauce\ntreat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving well\nConditions and characteristics\nPhysical & chemical processes\nAnimal (non-human) behaviour\nSocial order & disorder\nAdd to word list\nAdd to word list\nto act in a particular way, or to act in a way that is considered correct: [ I ] The judge will instruct the jury on how it is to behave.\nAdd to word list\nAdd to word list\nto do something or happen in a particular way: Commodities markets don't always behave in the way people expect."}