{"id":31005,"name":"belch","type":"verb","us_sound":"beltʃ","us_link":"../audio/b/belch.mp3","uk_sound":"beltʃ","uk_link":"../audio/b/ukbegui030.mp3","content":"Add to word list\nAdd to word list\n[ I ] to allow air from the stomach to come out noisily through the mouth: He belched noisily.\n[ I or T ] to produce a large amount of a substance such as gas or smoke, especially when this is unpleasant or harmful, or to be produced like this: The exhaust pipe belched out dense black smoke. The haze is caused mostly by sulphur dioxide belching from coal-burning power plants.\nMore examplesFewer examplesHe swigs from his drink, then belches.Disgustingly anti-social behavior includes spitting on the sidewalk or belching at the table.We saw clusters of natural gas wells, some belching fire. For the last five weeks, the town's power plant has been belching half a ton of pollutants into the air almost daily.Moments after the impact, the mangled steel columns and belching smoke are caught on film.\nSMART Vocabulary: related words and phrases\nNoises made by the body\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\ncough\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnore\nsnorer\nsnoring\nwheeze\nwind\nyawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts of fire\nan act of allowing air from the stomach to come out noisily through the mouth: The baby let out a loud, satisfied belch.\nan act of producing a substance such as gas or smoke, especially when this is unpleasant or harmful: The bus departed with a belch of exhaust fumes.\nMore examplesFewer examplesHe gave a loud belch and wiped his mouth.She masked a belch with the back of her hand.There was nothing to see on the drive except a belch of smoke from the occasional refinery.\nSMART Vocabulary: related words and phrases\nNoises made by the body\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\ncough\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnore\nsnorer\nsnoring\nwheeze\nwind\nyawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts of fire\nAdd to word list\nAdd to word list\nto have air from the stomach come out in a noisy way through the mouth\nIf something is belched or belched out, it comes out in quick, violent bursts: [ I/T ] The chimney was belching (out) thick smoke. belch noun [ C ] us\nYour browser doesn't support HTML5 audio\n/beltʃ/"}