{"id":31090,"name":"believe","type":"verb","us_sound":"bɪˈliːv","us_link":"../audio/b/believe.mp3","uk_sound":"bɪˈliːv","uk_link":"../audio/b/ukbelda010.mp3","content":"Add to word list\nAdd to word list\nA2 to think that something is true, correct, or real: Strangely, no one believed us when we told them we'd been visited by a creature from Mars. [ + that ] He believes that all children are born with equal intelligence. She's arriving tomorrow, I believe. \"Is she coming alone?\" \"We believe not/so (= we think she is not/is).\" [ + obj + to infinitive ] I believe her to be the finest violinist in the world. [ + obj + adj ] All the crew are missing, believed dead.\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\nnot believe a word of it\nto not believe that something is true: He told me she was just a friend, but I don't believe a word of it!\nSee more believe it or not B1 (also would you believe it?)\nsaid when telling someone about something that is true, although it seems unlikely: He's upstairs doing his homework, believe it or not.\nSee more believe me\nsaid when emphasizing that something is true: Believe me, I was scared!\nSee more if you believe that, you'll believe anything informal\nsomething that you say to emphasize that something is obviously not true: He said the car in front backed into him, and if you believe that, you'll believe anything!\nSee more make believe\nto pretend or imagine: Let's make believe (that) we're pirates.\nSee more\nMore examplesFewer examplesHe claims to have met the president, but I don't believe him.I still believe that people are fundamentally good.I don't believe that story for a moment.It's hard to believe there's anything wrong with him - he looks so healthy.I don't believe they should have put him in prison. It isn't right.\nSMART Vocabulary: related words and phrases\nBelieving\naccept\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ncredit\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nhold\nincline to/towards something\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nself-deluded\nstock\nword\nSee more results »\nIdioms\nbelieve something when you see it\nnot believe your eyes/ears\nnot believe your luckPhrasal verbs\nbelieve in something\nbelieve in someone\nAdd to word list\nAdd to word list\nto think that something is true or correct: [ T ] One juror said he didn’t believe the policeman’s testimony. [ + (that) clause ] She believed (that) it was wrong to censor the text.\nIf you believe in something, you feel that it is right: [ I always + adv/prep ] I believe in giving a person a second chance.\nIf you believe in someone you have confidence in that person's abilities: [ I always + adv/prep ] We just need to believe in ourselves. Idioms\nbelieve it or not\nbelieve me\nnot believe your eyes"}