{"id":31129,"name":"bell","type":"noun","us_sound":"bel","us_link":"../audio/b/bell.mp3","uk_sound":"bel","uk_link":"../audio/b/ukbelda016.mp3","content":"Add to word list\nAdd to word list\nB1 (also doorbell) an electrical device that makes a ringing sound when you press a button: I stood at the front door and rang the bell several times.\nDNY59/E+/GettyImages\nB2 a hollow metal object shaped like a cup that makes a ringing sound when hit by something hard, especially a clapper: The church bells rang out to welcome in the New Year.\nJackValley/E+/GettyImages\nMore examplesFewer examplesThe children arrived at school just as the bell was ringing.At the sound of the alarm bell, the customers all ran wildly for the doors.I rang the bell but nobody came to the door.In the square the church bells chimed.After their wedding the bells pealed out from the tower.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\ndrumstick\npedal steel\npenny whistle\npercussion\npercussionist\npercussive\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »\nIdioms\ngive someone a bell\nwith bells on\nbell verb\n(PUT BELL ON)\n[ T usually passive ] to put a bell or bells on something: They wear traditional dress with bare feet and belled ankles. He belled their cats in an attempt to stop them killing birds. a belled cap/sleigh\nMore examplesFewer examplesHawks and falcons are frequently belled.A herd of belled goats ran jangling across the road.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\ndrumstick\npedal steel\npenny whistle\npercussion\npercussionist\npercussive\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGloves & accessories\nbell verb\n(PHONE)\n[ I or T ] UK informal to telephone someone: Bell me when you're ready, OK? I belled him on his mobile. She belled Monday morning and told me the news.\nMore examplesFewer examplesHe bells me every Sunday.Bell your granny, would you?You didn't exactly bell at a good moment.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\ndialling tone\nDirectory Enquiries\noff the hook idiom\npick someone/something up\npocket dial\nprank call\nprank caller\nprepay\nroam\ntelecoms\ntelephone\nSee more results »\nbell verb\n(SHAPE)\n[ I ] literary to swell or curve outwards in a shape like a metal bell: We saw the ship, her sail belling in the wind, the spray bursting across her bows. She wore a beautiful satin coat that belled out at the back.\nMore examplesFewer examplesShe coughed and her cheeks belled.Water belled from the crown of the fountain.The mountain path belled out into a beautiful meadow.He was wearing filthy white socks with the toes belled out like lightbulbs.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbestrew\nbillow\ncirculate\ndispersion\ndisseminate\ndredge\ndusting\nencroach on/upon something\nfan out\ngo around\nrambling\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsmudging\nsprinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nIdiom\nbell the cat\nAdd to word list\nAdd to word list\na hollow, cup-shaped, metal object that makes a ringing sound when a part hanging inside swings against its sides, or when it is hit by any hard object: The school bell was ringing.\nA bell is also a doorbell.\nthe bell\nAdd to word list\nAdd to word list\n[ S ]\n&#160; STOCK MARKET the sound that signals the beginning and end of a period of trading on a stock exchange: after/before the bell The company said after the bell on Wednesday that its quarterly profit rose because of a 36% increase in sales of its software. Yesterday, all three major American indexes fell immediately after the opening bell.\nalarm/warning bells\n[ plural ] used to describe an occasion when you realize that something is wrong: ring/set off/sound warning bells These figures should sound warning bells that the consumer economy is increasingly fragile. Soaring costs of oil and gold set alarm bells ringing around the world."}