{"id":31198,"name":"belligerent","type":"adjective","us_sound":"bəˈlɪdʒ.ɚ.ənt","us_link":"../audio/b/belligerent.mp3","uk_sound":"bəˈlɪdʒ.ər.ənt","uk_link":"../audio/b/ukbelda024.mp3","content":"Add to word list\nAdd to word list\ndisapproving wishing to fight or argue: a belligerent person a belligerent gesture Watch out! Lee's in a belligerent mood.\nformal fighting a war: The belligerent countries are having difficulties funding the war.\nMore examplesFewer examplesHe was belligerent, and when the case went to trial openly mocked his prosecutor.Outside the bar is a scrum of belligerent drunks.The Army Medical Corps was appealing to those who wished to offer aid to fellow men in time of war, but not to join them in belligerent acts.Public opinion in both belligerent states seems to be shifting against the war.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferocity\nfierce\nfierceness\nfighting words\nflex\noutrage\nproactive aggression\npugnacious\npugnaciously\npugnacity\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWar\nRelated words\nbelligerence\nbelligerently\na country, group, or person who is fighting a war: Many hoped the belligerents were finally on the road to peace.\nMore examplesFewer examplesWars often end in partition treaties in which territory is divided among the belligerents.He said that citizens who associate themselves with an enemy government, and enter this country bent on hostile acts, are enemy belligerents.\nSMART Vocabulary: related words and phrases\nWar\nantebellum\nanti-militarism\nasymmetric warfare\nbattle-scarred\nbellicose\nconflagration\ngung-ho\nholy war\nhorizontal escalation\njungle warfare\npeacekeeping\nphoney war\nsinew\nsinews of war idiom\nsmokescreen\nStar Wars\ntactic\nthe Great War\nthe Second World War\nWorld War II\nSee more results »\nAdd to word list\nAdd to word list\neager to fight or argue: She was so belligerent that I gave up trying to explain. belligerence noun [ U ] us\nYour browser doesn't support HTML5 audio\n/bəˈlɪdʒ·ər·əns/"}