{"id":31290,"name":"below","type":"adverb","us_sound":"bɪˈloʊ","us_link":"../audio/b/below.mp3","uk_sound":"bɪˈləʊ","uk_link":"../audio/b/ukbelly006.mp3","content":"below adverb, preposition\n(POSITION)\nAdd to word list\nAdd to word list\nA1 in a lower position (than), under: From the top of the skyscraper the cars below us looked like insects. The author's name was printed below the title. For further information on this subject, see below (= lower on the page or later in the book). The ship's captain went below (= to the lower, covered part of the ship). Do you usually wear your skirts above or below the knee? She has three people working below her (= people to whom she gives orders).\nMore examplesFewer examplesWe looked out of the aircraft window down onto the patchwork of fields below.The sun glowed red as it sank slowly below the horizon.The temperature is expected to drop to ten degrees below zero tonight.The results are well below what we expected.Please print your name clearly below your signature.\nSMART Vocabulary: related words and phrases\nUnder & below\nbeneath\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderlying\nunderneath\nbelow adverb, preposition\n(LESS)\nB1 less than a particular amount or level: They have three children below the age of (= younger than) four. His marks in English have been below average for some time now. The temperature has fallen below freezing (= has been less than 0°C) recently. Last night it was ten degrees below (zero) (= minus ten degrees).\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\ndrabs\nmeasly\nmild\nmildness\nmingy\nminimal\nminimally\npiffling\nremote\nscantly\nslenderly\nslenderness\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nGrammar\nBelowBelow is a preposition or an adverb. …\nBelow meaning ‘lower than’We use below most commonly as a preposition meaning ‘lower than’. It has a similar meaning to under. The opposite of below is above. We use it when there is no contact between people or things: …\nBelow referring forward in writingIn formal writing, we use below to refer to something that we will mention or show later: …\nBelow: typical errorWe don’t use below when one thing touches or covers or hides something else; we usually use under instead: …\nBeneath, under or below?Beneath has a meaning similar to under and below but we do not use it with numbers: …\nIdiom\nbelow the belt\nAdd to word list\nAdd to word list\nin a lower position (than); under: The author’s name was printed below the title. There’s a basement below the first floor.\nBelow also means less in number or value: It’s been below freezing every day this week. It’s for young kids below the age of six."}