{"id":31329,"name":"beluga","type":"noun","us_sound":"bəˈluːɡə","us_link":"../audio/b/cdo0319usbelu0168.mp3","uk_sound":"bəˈluːɡə","uk_link":"../audio/b/cdo0319ukbelu0145.mp3","content":"beluga noun\n(ANIMAL)\nAdd to word list\nAdd to word list\n[ C ] plural beluga or belugas (also beluga whale, white whale) a small white whale that lives mainly in the Arctic: Biologists are trying to find out what is endangering belugas in the Cook Inlet. These beluga whales live under three feet of ice in the freezing waters of northern Russia's White Sea.\nW6/iStock/Getty Images Plus/GettyImages\n[ C ] plural beluga or belugas (also beluga sturgeon) a large fish that lives mainly in lakes and rivers in central Europe and Asia. It is is a type of sturgeon and is usually caught for its eggs, which are eaten as caviar: Beluga is the largest freshwater fish on earth. It can take a female beluga sturgeon 25 years to produce her first eggs.\nZocha_K/E+/GettyImages\nMore examplesFewer examplesKiller whales are the beluga's only marine predator. With binoculars you can watch the beluga whales that swim with the summer tide in and out of the river estuary.Polar bears' main source of food is seals, but they sometimes eat walruses and even beluga whales.Lake sturgeon are comparable in size and color to beluga.He imported some belugas from overseas to raise for their eggs and meat.A beluga sturgeon swims slowly through the murky water.\nSMART Vocabulary: related words and phrases\nMarine mammals\ncetacean\ndolphin\ndugong\nelephant seal\nfluke\ngrey seal\nharp seal\nhumpback whale\nkiller whale\nmanatee\nminke whale\nmonk seal\nnarwhal\norca\nporpoise\nsea cow\nsea lion\nsperm whale\nwalrus\nwhale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSea fish\nbeluga noun\n(FOOD)\n[ U ] a type of expensive caviar (= fish eggs) that comes from beluga fish: You might want to wash down your beluga with a glass of champagne.\nYevgen Romanenko/Moment/GettyImages\nMore examplesFewer examplesIf you ever get your hands on beluga, I would suggest not embellishing the flavour of the roe with anything at all.They found a supply of beluga worth $200,000.\nSMART Vocabulary: related words and phrases\nFish & seafood\nabalone\nalbacore\nAmerican shad\nbarramundi\nbay scallop\ncrappie\ncrawdad\ncrawfish\ncray\ncrayfish\nlobster thermidor\nlox\nmahi mahi\nmarron\nmatelote\nshad\nshellfish\nshrimp\nshrimp cocktail\nskipjack tuna\nSee more results »"}