{"id":31492,"name":"bend","type":"verb","us_sound":"bend","us_link":"../audio/b/bend.mp3","uk_sound":"bend","uk_link":"../audio/b/ukbelly015.mp3","content":"bend verb\n(CURVE)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause to) curve: The road bends to the left after the traffic lights.\nB2 to move your body or part of your body so that it is not straight: I bent down and picked up the coins lying on the road. Now, bend forward/over and touch your toes! Make sure you bend your knees when you're picking up heavy objects. After her fall she complained that she couldn't bend her leg properly. on bended knee\nin a position in which the knee of one leg is touching the floor: He went down on bended knee to ask her to marry him.\nSee more\nMore examplesFewer examplesLight rays bend as they pass from air to water.You'll snap that ruler if you bend it too far.the point where the road bendsHis new trousers ripped when he bent down.I bent down and picked up the coins lying on the road.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflex\nflexion\nflexure\nfluted\nrewind\nswirlingly\nswoopy\ntangle\ntangled\ntangly\nwristy\nwrithe\nzigzag\nSee more results »\nIdioms\nbend someone's ear\nbend the law/rulesPhrasal verb\nbend to something\nbend noun\n(CURVE)\nB2 [ C ] a curved part of something: There's a bend in the pipe so you can't see from one end to the other. The car came around the bend on the wrong side of the road.\n[ U ] in football, the curve in which a ball moves when it has been kicked in a particular way: Good players can put bend on the ball.\nMore examplesFewer examplesHe came off the road while driving his car around a bend at high speed .The river broadens out around the next bend.Be careful when you're cycling because there are several sharp bends along the route.The children are practising writing letters with lots of bends in them, like 's' and 'm'.Why does your cat have that funny little bend in her tail?\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntight\ntrajectory\nturn\nwhirl\nwhorl\nwraparound\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nFootball/soccer\nbend noun\n(ILLNESS)\nthe bends [ plural ]\na serious medical condition that divers (= people who swim underwater) get when they come up to the surface of the water too quickly: On the way up, divers stop at various depths in order to prevent the bends.\nSee more\nIdioms\ndrive someone around the bend\naround the bend\nAdd to word list\nAdd to word list\nto change the position of your body or a part of your body so that it is no longer straight but curved or forming an angle: [ I always + adv/prep ] She dropped her umbrella and bent down to pick it up. [ T ] Bend your knees and keep your back straight when lifting heavy objects. Idioms\nbend over backwards\nbend the rules\na curved path or an angle: a bend in the road"}