{"id":31519,"name":"beneath","type":"preposition","us_sound":"bɪˈniːθ","us_link":"../audio/b/eus70505.mp3","uk_sound":"bɪˈniːθ","uk_link":"../audio/b/ukbelly021.mp3","content":"beneath preposition\n(BELOW)\nAdd to word list\nAdd to word list\nB2 in or to a lower position than someone or something, under someone or something: Jaime hid the letter beneath a pile of papers. We huddled together for warmth beneath the blankets. After weeks at sea, it was wonderful to feel firm ground beneath our feet once more. Emma was so tired and hungry that her legs were beginning to give way beneath her (= she was about to fall over).\nMore examplesFewer examplesAs the wind increased, the deck of the ship began to heave beneath his feet.The water is some 20 to 30 metres beneath the ground.They went down into catacombs beneath the church.I heard a massive explosion and the ground shuddered beneath me.The table has a plastic coating which prevents liquids from permeating into the wood beneath.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderlying\nunderneath\nbeneath preposition\n(NOT GOOD ENOUGH)\nbe beneath someone\nC2 to not be good enough for someone: Office work of any description he felt was beneath him.\nSee more Grammar\nBeneathBeneath is a preposition or an adverb. …\nBeneath: meaning and useBeneath means ‘at a lower level than’. …\nBeneath, under or below?Beneath has a meaning similar to under and below but we do not use it with numbers: …\nbelow: She looked out of the window at the children playing beneath.\nSMART Vocabulary: related words and phrases\nUnder & below\nbelow\nlow\nlower\nneath\nnether\nsub\nsubjacent\nultra-low\nunder\nunderfoot\nunderlying\nunderneath\nGrammar\nBeneathBeneath is a preposition or an adverb. …\nBeneath: meaning and useBeneath means ‘at a lower level than’. …\nBeneath, under or below?Beneath has a meaning similar to under and below but we do not use it with numbers: …\nAdd to word list\nAdd to word list\nin or to a lower position than; under: Jerry hid the letter beneath a pile of papers. The cool grass felt good beneath their feet."}