{"id":32554,"name":"best","type":"adjective","us_sound":"best","us_link":"../audio/b/best.mp3","uk_sound":"best","uk_link":"../audio/b/ukbesid012.mp3","content":"Add to word list\nAdd to word list\nA1 of the highest quality, or being the most suitable, pleasing, or effective type of thing or person: This is the best meal I've ever had. He's one of our best students. Are you sure this is the best way of doing it? What's the best (= shortest or quickest) way to get to their house? Your parents only want what is best for you. She was my best friend (= the friend I liked most). It's best (= it is wise) to get to the supermarket early.\nThesaurus: synonyms, antonyms, and examples\nbetter than anyone or anything elsebestShe was the best singer in the country.excellentHe was an excellent singer.superlativeShe gave a superlative performance.superbThe meal was absolutely superb.outstandingHe was an outstanding chef.\nSee more results »\nMore examplesFewer examplesThis type of nursery care may well be the best choice for your child.Some of the best wines come from France.He won the award for best actor, and deservedly so .Everyone has their own ideas about the best way to bring up children.That's the best piece of news I've heard for a long time!\nSMART Vocabulary: related words and phrases\nGood, better and best\nall is well idiom\nat the best of times idiom\nbe the last word in something idiom\nbetter\nbetter still phrase\nburnished\ngold standard\nhigh-quality\nknock something into a cocked hat idiom\nleave someone/something in the dust idiom\nmiles idiom\nnext-best\nsecond\nsound\nsuper good\ntopper\nunsurpassed\nup your game idiom\nuplift\nwell\nSee more results »\nIdioms\nbe on your best behaviour\nbest bet\nbe the best thing since sliced bread\nmay the best man/person win!\nput your best foot forward\nwith the best will in the world\nB1 in the most suitable, pleasing, or satisfactory way, or to the greatest degree: Which evening would suit you best for the party? The Grand Canyon is best seen at sunset. He couldn't decide which one he liked best (= preferred).\nto the greatest degree when used as the superlative of adjectives beginning with \"good\" or \"well\": They were the best-dressed couple at the party. He was voted the best-looking (= most attractive) actor in Hollywood. as best you can mainly UK\nas well as you can: It is a difficult passage, but just translate it as best you can.\nSee more\nMore examplesFewer examplesFor reasons best known to himself he's decided to leave his job.\"The table that I liked best was about so wide,\" she said, holding her arms out a metre and a half.We could go now or this afternoon - whatever time suits you best.I'll have to do some thinking about how best to arrange the books.Under what conditions do plants grow best?\nSMART Vocabulary: related words and phrases\nGood, better and best\nall is well idiom\nat the best of times idiom\nbe the last word in something idiom\nbetter\nbetter still phrase\nburnished\ngold standard\nhigh-quality\nknock something into a cocked hat idiom\nleave someone/something in the dust idiom\nmiles idiom\nnext-best\nsecond\nsound\nsuper good\ntopper\nunsurpassed\nup your game idiom\nuplift\nwell\nSee more results »\nIdioms\ndo as you think best\nhad best\nB1 the most excellent in a group of things or people: My tastes are simple - I only like the best. He wanted the best for his children - good schools, a nice house, and trips abroad. I like all of Hitchcock's films, but I think \"Notorious\" is the best. Chris and I are the best of friends (= we are very close friends). Best, ... informal\nused at the end of a friendly message or letter before writing your name: I'll call you early next week to set up a lunch date. Can't wait to meet you. Best, Beth Morris all the best A2 informal\nused to say goodbye, or to end a letter to someone you know well, or to send good wishes to someone: All the best to your parents!\nSee more at best\nC2 even when considered in the most positive way: The food was bland at best, and at worst completely inedible.\nSee more at its best\nB1 at the highest standard that can be achieved: The documentary was an example of investigative journalism at its best.\nSee more be at your best\nto be as active or intelligent as you can be: I'm not at my best in the morning.\nSee more best of all\nB2 this is the most pleasing thing: There was wonderful food, good company, and, best of all, a jazz band.\nSee more best of luck\nused to wish someone success before a test, etc. or a difficult activity: US Best of luck on your finals!\nSee more the best of\nIn a sport such as tennis, if you play the best of a particular number of games, you play that number of games and the winner is the player who wins the greatest number of those games: Shall we play the best of five?\nSee more do/try your (very) best\nB1 to make the greatest effort possible: It doesn't matter if you fail, just do your best.\nSee more have had the best of\nIf you have had the best of something, you have enjoyed the most pleasant part of it, and everything that is left is worse: I think we've already had the best of the hot weather this summer.\nSee more to the best of your ability (also to the best of your abilities)\nas well as you can: Just do the job to the best of your ability.\nSee more to the best of my knowledge/belief\nB2 from what I know and understand from the information that I have: To the best of my knowledge, the chemicals which were found are not dangerous.\nSee more for the best\nC2 If an action is for the best, it is done to improve a situation or produce a good result, although it might seem unpleasant at the time: Ending a relationship is always hard but in this case it's for the best.\nSee more make the best of\nB2 to make an unsatisfactory situation as pleasant as possible: We'll have to spend the night here, so we might as well make the best of it.\nSee more\nMore examplesFewer examplesHe's one of our best salesmen - in fact I'd say he's the best.Her latest film, by common consent, is her best yet.The judges will select the best from this year's crop of first novels.It's only human nature to want the best for your children.Our hotel is the best in town.\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbeauty\nbunch\nflagship\ngem\nhumdinger\njewel\njim-dandy\nking\nlulu\npeach\nscreamer\nsleeping beauty\nstandout\nthe jewel in the crown idiom\nthe real deal\nthe Rolls-Royce of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWritten greetings\nIdioms\nat the best of times\nthe best of a bad bunch/lot\nthe best of both worlds\nthe best of British (luck)\nwith the best of them\nto defeat someone in a fight or competition: He bested his opponent in just two rounds. Synonyms\noutdo\noutflank\ntrump\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nbest adjective, adverb\n(HIGHEST QUALITY)\nAdd to word list\nAdd to word list\nof the highest quality, to the greatest degree, in the most effective way, or being the most suitable or pleasing; superlative ofgood orwell: He’s one of our best students. Which of the songs did you like best? She was my best friend at school. best bet\nSomeone’s best bet is the action most likely to be successful: If you want to get to the theater on time, your best bet is to get a cab. Best wishes\nBest wishes is a polite way of finishing a letter to someone.\nbest noun [U]\n(EXCELLENCE)\nthe most excellent in a group of things or people: As an athlete, Jim Thorpe is one of the best of all time. I like all of Hitchcock’s films, but I think \"Notorious\" is the best. Idioms\nat best\ndo your very best\nbest verb [T]\n(DEFEAT)\nto defeat someone in a fight or competition: In chess, I was bested by my 13-year-old niece."}