{"id":32675,"name":"bet","type":"verb","us_sound":"bet","us_link":"../audio/b/bet.mp3","uk_sound":"bet","uk_link":"../audio/b/ukbesid027.mp3","content":"Add to word list\nAdd to word list\nC1 [ I or T ] to risk money on the result of an event or a competition, such as a horse race, in the hope of winning more money: He regularly goes to the races and bets heavily. She bet £500,000 on the horse that came in second. [ + two objects, + (, that, ) ] I bet you $25 (that) I'll get there before you.\nB1 [ T ] informal If you say you bet (someone) that something is true or will happen, you mean you are certain that it is true or will happen: [ + (that) ] I bet you (that) she's missed the bus. I bet (that) he won't come.\nMore examplesFewer examplesOn the face of it, it seems like a bargain, but I bet there are hidden costs.I bet that computer knocked you back a few thousand.\"I bet you can't eat all that food on your plate.\" \"Is that a challenge?\"I bet you can't guess how old he is.I bet she wishes (that) she'd never got involved in the whole affair.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPredicting things and intuition\nIdioms\nbet big on something/someone\nbet the farm/ranch\n(how much) do you want to bet?\ndon't bet on it\nI bet\nwhat do you bet?\nyou bet\nyou can bet your life\nC2 an amount of money that you risk on the result of an event or a competition, such as a horse race: She had a bet on the race. He placed/put a bet on the grey horse.\ninformal a guess or opinion: [ + (that) ] My bet is (that) their baby will be a girl.\nMore examplesFewer examplesShe's never put a bet on a race before.He never usually remembers my birthday, so it's a safe bet he'll forget again this time!He went down to the bookmaker's in Chesterton Road to place a bet on the race.They were placing bets on who would win.After winning a couple of bets, he thought he was on a winning streak.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuesses and assumptions\nIdioms\nbe a fair bet\nbe a good bet\nbe a safe bet\nbe your best bet\ndo something for a bet\nAdd to word list\nAdd to word list\nto risk a sum of money on the unknown result of an event in the hope of winning more money than you have risked: [ T ] He went to the race track and bet $2 on a horse. [ I ] I bet that the Yankees won’t win the pennant this year.\nIf you bet someone that something is true or will happen, you think it is likely: [ T ] I bet (you) she missed the bus. Idiom\ndon’t bet on it\nan agreement to risk money on the unknown result of an event: He placed a bet on the race.\nA bet is also a guess or opinion: My bet is that the senator will decide not to run again.\nA bet is also a chance or opportunity: Putting your savings in a high-interest account is a good bet/your best bet.\nAdd to word list\nAdd to word list\nto risk money on something that may happen in the future: bet (sth) on sth In his opinion, no fee can compensate for the risk of betting a large chunk of a firm's capital on a single deal. bet that Some investors are betting that interest rates will rise.bet against sth You wouldn't want to bet against inflation rising later in the year.\nbet the farm/ranch US informal\nto risk a lot of money on something that may happen in the future: I hope we attract lots of customers because we've bet the ranch on this place.\nI bet (that) informal (also I'll bet (that))\nused to say that you feel certain that something is true or will happen: If the salary was high enough, I bet she'd take the job. I'll bet that only about 25% of those bottles are recycled.\nan act of risking money on something that may happen in the future: make a bet on sth A lot of people made a bet on housing and lost.a bet pays off He borrowed heavily to start the business, and the bet has paid off.\na guess or opinion: Jenson's bet is that properties will remain scarce and rents will keep rising. See also\nspread bet\na fair/good/safe bet\nsomething that is likely to happen or have a good result in the future: The bank says this account is a safe bet and a good alternative to investing in shares.\nsb's best bet\nthe decision or choice that someone can make that is likely to have the best result: Your best bet would be to sell the shares."}