{"id":32871,"name":"between","type":"preposition","us_sound":"bɪˈtwiːn","us_link":"../audio/b/between.mp3","uk_sound":"bɪˈtwiːn","uk_link":"../audio/b/ukbetid013.mp3","content":"between preposition, adverb\n(SPACE)\nAdd to word list\nAdd to word list\nA1 in or into the space that separates two places, people, or objects: The town lies halfway between Rome and Florence. Standing between the two adults was a small child. She squeezed between the parked cars and ran out into the road. There were two houses with a narrow path in between.\nMore examplesFewer examplesOn the train I was sitting between two very large men.The plants have seeded themselves in the cracks between the paving stones.There was a revolting green slime in between the bathroom tiles.We watched a spider spin a web between three tall grass stems.Our neighbours have no claim to that strip of land between our houses.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nbetween preposition, adverb\n(AMOUNT)\nA2 If something is between two amounts, it is greater than the first amount but smaller than the second: She weighs between 55 and 60 kilograms. The competition is open to children between six and twelve years of age. The room was either extremely cold or hot, never anything in between (= in the middle).\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nbetween preposition, adverb\n(TIME)\nA1 (also in between) in the period of time that separates two different times or events: You shouldn't eat between meals. There is a break of ten minutes between classes. The office is closed for lunch between 12.30 and 1.30. In between sobs, he managed to tell them what had happened. He visits his parents every month and sometimes in between.\nMore examplesFewer examplesBreakfast is served in the restaurant between 7 and 9Millions of Africans were sold into slavery between the 17th and 19th centuries.It will take us somewhere between three and four hours to get to Madrid.Visiting hours are between 6.00 and 9.00 p.m.The voucher is valid between July and December and entitles you to 10% off all overseas flights.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nGrammar\nBetween or among?Between and among are prepositions. …\nBetween, among: meaning and useWe use between to refer to two things which are clearly separated. We use among to talk about things which are not clearly separated because they are part of a group or crowd or mass of objects: …\nBetween and prepositional phrasesBetween is most often used to introduce a prepositional phrase which contains two singular or plural noun phrases: …\nNouns and verbs followed by betweenThe most common nouns often followed by between are: connection, difference, distinction, link, relationship: …\nAmong meaning ‘surrounding, part of or included in’We use among to suggest a sense of being a part of or surrounded by or included in something else. It is typically followed by a plural noun phrase: …\nAmong others and among other thingsIn the phrases among others and among other things, among means ‘as well as’: …\nIdioms\nbe between jobs/marriages/boyfriends, girlfriends, etc.\n(in) between times\nbetween preposition\n(SHARED)\nB1 among two or more people or things: The money was divided equally between several worthy causes. We drank two bottles of wine between the four of us. Trade between the two countries (= their trade with each other) has increased sharply in the past year. There is a great deal of similarity between Caroline and her mother (= they are very similar).\nMore examplesFewer examplesWe'll have to portion the money out between the six of us.It's simply not practical to divide the work between so many people.If it's a choice between higher pay and job security, I'd prefer to keep my job.We shared the preparation for the party between us, so it wasn't too much work.There's a lot of competition between computer companies.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperatively\ndistributively\ndouble act\nen bloc\nen masse\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\none-stop shop\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\nbetween preposition\n(OPPOSING)\nA1 A discussion, argument, or game between two or more people or groups of people involves both people or groups: The negotiations between the union and management have broken down. There has always been a fierce rivalry between the two schools. Tonight's game is between the New Orleans Saints and the St. Louis Rams.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperatively\ndistributively\ndouble act\nen bloc\nen masse\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\none-stop shop\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\nbetween preposition\n(CHOICE)\nIf you choose between two things, you choose one thing or the other: You'll have to choose between a holiday or a new washing machine. She was torn between loyalty to her father and love for her husband (= she could not decide which one to support).\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nbetween preposition\n(CONNECTING)\nA2 connecting two or more places, things, or people: There is a regular train service between Glasgow and Edinburgh. The survey shows a link between asthma and air pollution.\nfrom one place to another: He commutes daily between Baltimore and Washington, D.C.\nMore examplesFewer examplesA senior judge is acting as referee in the pay dispute between the trade union and management.Scientists have established the link between lung cancer and smoking.There is a good relationship between staff and pupils at the school.There's very little communication between mother and daughter .There isn't enough contact between teachers and parents.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nbetween preposition\n(SEPARATING)\nA2 separating two places or things: The wall between East and West Berlin came down in 1989. The report states that the gap between the rich and the poor has increased dramatically over the past decade.\nMore examplesFewer examples\"So what's the difference between these two TVs?\" \"Well, they're basically the same, but the more expensive one comes with a remote control.\"There's a striking contrast between what he does and what he says he does.The train crosses the border between France and Spain.There's a marked contrast between his character and hers.Somebody will have to compromise if we are to break the deadlock between the two warring factions.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nGrammar\nBetween or among?Between and among are prepositions. …\nBetween, among: meaning and useWe use between to refer to two things which are clearly separated. We use among to talk about things which are not clearly separated because they are part of a group or crowd or mass of objects: …\nBetween and prepositional phrasesBetween is most often used to introduce a prepositional phrase which contains two singular or plural noun phrases: …\nNouns and verbs followed by betweenThe most common nouns often followed by between are: connection, difference, distinction, link, relationship: …\nAmong meaning ‘surrounding, part of or included in’We use among to suggest a sense of being a part of or surrounded by or included in something else. It is typically followed by a plural noun phrase: …\nAmong others and among other thingsIn the phrases among others and among other things, among means ‘as well as’: …\nIdiom\n(just) between you and me\nbetween preposition, adverb\n(SPACE)\nAdd to word list\nAdd to word list\n[ not gradable ] in or into the space that separates two places, people, or objects: We live halfway between Toronto and Montreal. She squeezed in between the parked cars.\n[ not gradable ] If something is between two amounts, it is greater than the first amount but smaller than the second: She weighs between 55 and 60 pounds.\nbetween preposition, adverb\n(TIME)\nin the period of time that separates two different times or events: There’s a ten-minute break between classes. You should arrive between 8 and 8:30. In between sobs, he managed to tell them what had happened.\nbetween preposition\n(AMONG)\nshared by or involving two or more people or things: The money was divided equally between her three children. Trade between the two countries has increased sharply. There is a great deal of similarity between Caroline and her mother. Between the three of us, we were able to afford a nice graduation gift. You’ll have to choose between dinner and a movie. Next week’s game will be between the two finalists.\nbetween preposition\n(CONNECTING)\nconnecting two or more places, things, or people: There is regular train service between New York and Philadelphia. The survey shows a link between asthma and air pollution.\nbetween preposition\n(SEPARATING)\nseparating two places or things: The wall between East and West Berlin came down in 1989. What’s the difference between this $100 watch and the $500 one (= In what way are they different)? Idiom\nbetween you and me"}