{"id":30889,"name":"beyond","type":"preposition","us_sound":"biˈjɑːnd","us_link":"../audio/b/beyond.mp3","uk_sound":"biˈjɒnd","uk_link":"../audio/b/ukbetid029.mp3","content":"beyond preposition, adverb\n(FURTHER AWAY)\nAdd to word list\nAdd to word list\nB1 further away in the distance (than something): In the distance, beyond the river, was a small town. From the top of the hill we could see our house and the woods beyond.\nMore examplesFewer examplesThe path extends beyond the end of the road.We swam out beyond the breakers.Our house is just beyond the bridge.The campsite is over there, just beyond that hill.Can you see where the village starts, just beyond those trees?\nSMART Vocabulary: related words and phrases\nAhead, in front and beyond\nahead\nahead of\nante\nbe (right) under your nose idiom\nbefore\ndownriver\nfollow\nfollow your nose idiom\nfore\nforward\nfront\nfront end\nfrontally\nhead\nlead\nnose\npara\npast\nup\nyonder\nbeyond preposition, adverb\n(OUTSIDE A LIMIT)\nB1 outside or after (a stated limit): Few people live beyond the age of a hundred. We cannot allow the work to continue beyond the end of the year. I've got nothing to tell you beyond (= in addition to) what I told you earlier. The repercussions will be felt throughout the industry and beyond (= in other areas). Tonight's performance has been cancelled due to circumstances beyond our control (= events that we are unable to deal with). She has always lived beyond her means (= spent more than she has earned). go beyond sth\nto be more than or not limited to something: The appeal of this device goes beyond convenience.\nSee more beyond belief, repair, recognition, etc.\nC2 too great or bad for anyone to believe, repair, recognize, etc.: His thoughtlessness is beyond belief.\nSee more beyond excited, serious, angry, etc.\ninformal extremely excited, serious, angry, etc.: She says she is beyond excited to see her son for the first time in more than three years.\nSee more beyond reasonable doubt UK (US beyond a reasonable doubt)\nIf a legal case or a person's guilt is proved beyond reasonable doubt, there is enough proof for the person accused of a crime to be judged guilty: Her guilt was established beyond reasonable doubt.\nSee more\nMore examplesFewer examplesHow she manages to fit so much into a working day is beyond my comprehension .The pain was bad beyond endurance.We did so well - beyond all our expectations.If traffic increases beyond a certain level, the city grinds to a halt .These tests are beyond the capability of an average twelve-year-old.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprior\npriorly\nprologue\nquondam\nsecond-wave\nsecondary\nthe next but one idiom\nwake\nSee more results »\nbeyond preposition, adverb\n(NOT UNDERSTAND)\nbe beyond someone\nC1 informal If something is beyond you, you are unable to understand it: Physics is completely beyond me.\nSee more\nGrammar\nBeyondBeyond is a preposition or an adverb. …\nIdioms\nbeyond compare\nbeyond a joke\nbeyond a shadow of a doubt\nbeyond the pale\nfrom beyond the grave\nbeyond preposition, adverb [not gradable]\n(FARTHER AWAY)\nAdd to word list\nAdd to word list\nfarther away in the distance than something: Beyond the river was a small town. From the top of the hill we could see our house and the woods beyond.\nbeyond preposition, adverb [not gradable]\n(OUTSIDE A LIMIT)\noutside or after a stated limit: Few people live beyond the age of a hundred. Beyond a certain level of tiredness, it is impossible to work productively. Tonight’s performance has been cancelled due to circumstances beyond our control.\nBeyond also means more than: I’ve got nothing to tell you beyond what I said earlier. My job goes beyond teaching facts – my aim is to get children to think for themselves.\nBeyond also means at a point where something could not be: She has changed beyond recognition. The car was damaged beyond repair. Idioms\nbeyond me\nbeyond someone’s wildest dreams"}