{"id":33056,"name":"bezoar","type":"noun","us_sound":"ˈbiː.zɔːr","us_link":"../audio/b/cdo1121usbezo0540.mp3","uk_sound":"ˈbiː.zɔːr","uk_link":"../audio/b/cdo1121ukbezo0636.mp3","content":"bezoar noun [C]\n(SOLID MASS)\nAdd to word list\nAdd to word list\nmedical\n&#160; specialized a solid mass of material that cannot be digested, that remains in the body in the digestive system: The indigestible part of some foods could remain in the stomach too long and possibly form bezoars. Gastric bezoars are a rare cause of abdominal pain.\na solid mass found in the digestive system, especially of a cow, goat, or sheep, that was believed in the past to have magical powers: Apparently a bezoar would counteract almost any poison.\nMore examplesFewer examplesBezoars can cause loss of appetite, constipation, nausea and vomiting and abdominal pain. A ball of hair, food, vegetable fibre and other indigestible material in the stomach is called a bezoar.Using an endoscopic irrigation device the bezoar was broken up and dislodged from the diverticulum.When Ron is poisoned, Harry quickly shoves a bezoar down his throat. In the 17th century a group of Jesuit monks in the Portuguese colony of Goa in India began producing man-made bezoars.\nSMART Vocabulary: related words and phrases\nDigestive disorders\nachalasia\nacid reflux\nanti-diarrhoea\nanti-diarrhoeal\nAztec two-step\ncolic\ndiarrhoea\ngastritis\ngastro-oesophageal reflux disease\ngastroenteritis\ngastroparesis\ngippy tummy\nGORD\nhyper-catabolism\nIBD\nindigestion\nsprue\nstomach flu\nulcerative colitis\nunexplained gastrointestinal bleeding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMagic\nbezoar noun [C]\n(GOAT)\na type of wild goat with curved, flat horns: This wild goat or bezoar is the ancestor of the domestic goat.\nSMART Vocabulary: related words and phrases\nSheep & goats\nbilly goat\newe\ngoat\nibex\nkid\nlamb\nmerino\nmountain goat\nnanny goat\novine\nram\nshearling\nsheep\nwether"}