{"id":33175,"name":"bias","type":"noun","us_sound":"ˈbaɪ.əs","us_link":"../audio/b/bias.mp3","uk_sound":"ˈbaɪ.əs","uk_link":"../audio/b/ukbfpo_005.mp3","content":"bias noun\n(PREFERENCE)\nAdd to word list\nAdd to word list\nC2 [ C usually singular, U ] the action of supporting or opposing a particular person or thing in an unfair way, because of allowing personal opinions to influence your judgment: The senator has accused the media of bias. Reporters must be impartial and not show political bias.bias against There was clear evidence of a strong bias against her.bias towards There has always been a slight bias towards employing liberal arts graduates in the company.unconscious bias Unconscious bias (= that the person with the bias is not aware of) can influence decisions in recruitment, promotion, and performance management.\n[ C usually singular ] the fact of preferring a particular subject or thing: She showed a scientific bias at an early age.\n[ C usually singular, U ] the fact of a collection of data containing more information that supports a particular opinion than you would expect to find if the collection had been made by chance: Understanding the bias introduced by human annotation of data is a crucial problem in AI research.selection bias A selection bias in the personality study might have meant that only confident, extroverted people volunteered to take part. publication bias He describes how publication bias can mean that negative results aren't reported. survivorship bias The methodological failings of the report included survivorship bias: the tendency for failed companies to be excluded from performance studies.\nMore examplesFewer examplesThe radio station was said to have a strong left-wing bias.Have you noticed any bias in the reporting of the Middle East situation in the media?There was a clear racial bias in the selection of candidates.The teacher seems to have a bias towards the girls in her class.This is a clear example of the bias found in historical accounts of the war.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\nelitism\none-sided\none-sidedly\none-sidedness\none-way\nthe old school tie\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiking more\nBalance and imbalance\nbias noun\n(IN BOWLS)\n[ C ] in bowls (= a game in which the players roll a large black or brown ball as close as possible to a smaller white ball), the shape given to one side of the ball that makes it not round: A bowl will turn towards the side with the bias when rolled.\nSMART Vocabulary: related words and phrases\nBowls, bowling & croquet\nbisque\nboule\nbowl\nbowling\nbowling alley\nbowling ball\nbowling green\ncroquet\ncrown green bowls\nduckpin bowling\nend\njack\nlawn bowling\nmallet\nskittle\nstrike\ntenpin bowling\ntenpins\nbias noun\n(CLOTHING)\n[ U ]\n&#160; fabrics &amp; fashion\n&#160; specialized a direction at an angle across the threads of woven material cut on the bias\n(also bias-cut) If a piece of clothing is cut on the bias, the cloth has been cut in a diagonal direction: I like to wear skirts cut on the bias. The dresses in his new winter collection are all cut on the bias. Anything cut on the bias tends to make my hips look big. Leila's dress was cut on the bias so that it floated outwards from her whenever she moved. She wore a dress that was cut on the bias and studded with rhinestones. The collection includes bias-cut dresses and skirts with embroidered hems. The shoes would look fabulous with a simple, bias-cut silk dress.\nSMART Vocabulary: related words and phrases\nTextiles: general words\nbaize\nBargello\nbrocade\ncloth\ncutpiece\ndenier\ndoff\nfibre\nmultifilament\nnap\npadding\npile\npill\nreweave\nsuiting\nswatch\ntextile\nthe weft\nwebbed\nyarn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nto cause someone or something to have a bias: bias someone against someone The judge ruled that the information should be withheld on the grounds that it would bias the jury against the accused.\nSMART Vocabulary: related words and phrases\nLiking more\ndruthers\neach\neach to his/their own phrase\nfave\nfavour\nfavoured\nfavourite\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\nprefer\npreferable\npreferably\npreference\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nAdd to word list\nAdd to word list\nan unfair personal opinion that influences your judgment: [ U ] They vowed to fight racial bias in the school. [ C usually sing ] Does news coverage reflect a reporter’s bias? bias verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑɪ·əs/ -s- | -ss-\nThe judge withheld the information on the grounds that it would bias the jury.\nAdd to word list\nAdd to word list\n[ C, usually singular or U ] the fact of allowing personal opinions to influence your judgment in an unfair way: In her view, none of the interview panel had shown any bias.gender/racial bias a federal law prohibiting gender and racial bias in employmentbias against sb/sth The email suggested a clear bias against American products.bias in favour of sb/sth The company showed a marked bias in favour of employing men. a clear/definite/strong bias\n[ C, usually singular ] the fact of preferring someone or something: bias towards sb/sth In general, investment trusts have more of a bias towards emerging markets, including the Far East.\n[ C or U ] the fact that information is not correct because of the method used in collecting or presenting it: In the market research there was a bias in the sample of people who were selected to give their opinions. There is a need to build in safeguards against statistical bias.\n[ C or U ]\n&#160; FINANCE the fact of prices, etc. increasing or decreasing: Interest rates are set to have an upward bias in the next 12 months. a negative/downward bias a positive/upward bias"}