{"id":33176,"name":"biased","type":"adjective","us_sound":"ˈbaɪ.əst","us_link":"../audio/b/biased.mp3","uk_sound":"ˈbaɪ.əst","uk_link":"../audio/b/ukbfpo_006.mp3","content":"Add to word list\nAdd to word list\nC1 showing an unreasonable like or dislike for someone or something based on personal opinions: The newspapers gave a very biased report of the meeting. I think she's beautiful but then I'm biased since she's my daughter. Synonyms\none-sided\nslantedOpposite\nunbiased\nThesaurus: synonyms, antonyms, and examples\nunfairunfairThey objected to the state's unfair treatment of dissenters. unjustThey protested unjust laws.biasedThe newspaper gave a very biased report of the meeting.slantedThe report was slanted in favour of the developers.discriminatoryThe company has a zero-tolerance policy toward discriminatory practices.prejudicedIt is well known that the company is prejudiced against older workers and refuses to hire anyone over the age of 50.\nSee more results »\nA biased collection of data contains more information that supports a particular opinion than you would expect to find if the collection had been made by chance: The unexpected results may be partially due to the biased sample used in the study.\nMore examplesFewer examplesA lot of people think that most newspapers are biased towards one particular political party.Liverpool only lost the game because the referee was biased.The president criticized the Western press for their biased views.It's obvious that most of the committee are biased in favour of the Labour Party.His account of the situation was very biased and you should check your facts before making a judgment.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\nelitism\none-sided\none-sidedly\none-sidedness\none-way\nthe old school tie\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBalance and imbalance\nAdd to word list\nAdd to word list\nshowing an unreasonable preference or dislike based on personal opinion: The newspapers gave a biased report of the meeting.\nAdd to word list\nAdd to word list\npreferring or disliking someone or something more than someone or something else, in a way that means that they are treated unfairly: biased against sb/sth He believes the American justice system is biased against blacks.biased in favour of sb/sth They claimed that the settlement was biased in favour of corporate clients.\ngiving results that are not accurate because information has not been collected correctly: A biased sample of interviewees has a set of characteristics that are different from those of the population as a whole. Compare\nunbiased"}