{"id":33260,"name":"bibliography","type":"noun","us_sound":"ˌbɪb.liˈɑː.ɡrə.fi","us_link":"../audio/b/bibliography.mp3","uk_sound":"ˌbɪb.liˈɒɡ.rə.fi","uk_link":"../audio/b/ukbfpo_012.mp3","content":"bibliography noun\n(LIST OF BOOKS)\nAdd to word list\nAdd to word list\n[ C ] a list of the books and articles that have been used by someone when writing a particular book or article: Other sources of information are found in the bibliography at the end of this article. I've finished my essay—I just need to add footnotes and a bibliography.\n[ C ] a list of the books from a particular writer or publisher, or written about a particular subject: At the end of the interview is a good bibliography of the writer's work. He's only 46, and his bibliography already includes almost 100 novels. This book is an indispensable addition to the Beatles bibliography.\nMore examplesFewer examplesShe has included a bibliography so that readers can refer to the primary sources.The extensive bibliography provides ample guidance for readers who want to make a deeper study of the subject.Most books on art materials and techniques also include excellent bibliographies for further reading.The centre has compiled a bibliography of scientific research on meditation.The authors provide bibliographies of the poets' works and lists of useful, up-to-date anthologies and criticism.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nepilogue\nerrata\nerratum\nex-libris\nextract\nfascicle\njacket\nlibrary\nmonograph\nomnibus\npreface\nprologue\nspine\nSee more results »\nbibliography noun\n(STUDY OF BOOKS)\n[ U ] the study of books, their history, their physical appearance, and how they are classified (= put into groups according to type), especially in a library: He is a professional librarian skilled in bibliography and at home in the world of books. Compare\nlibrary science\nMore examplesFewer examplesHe catalogued books for the booksellers Pearson &amp; Co. and lectured in bibliography at Cambridge University.In the early 1930s he turned his attention towards bibliography, and became a lecturer at the London School of Librarianship.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nepilogue\nerrata\nerratum\nex-libris\nextract\nfascicle\njacket\nlibrary\nmonograph\nomnibus\npreface\nprologue\nspine\nSee more results »\nRelated word\nbibliographical\nAdd to word list\nAdd to word list\na list of the books and articles that have been used by someone when writing a book or article"}