{"id":33234,"name":"bible","type":"noun","us_sound":"ˈbaɪ.bəl","us_link":"../audio/b/bible.mp3","uk_sound":"ˈbaɪ.bəl","uk_link":"../audio/b/ukbfpo_010.mp3","content":"Add to word list\nAdd to word list\n(usually Bible); (also Holy Bible) (a copy of) the holy book of the Christian religion consisting of the Old and New Testaments, or the holy book of the Jewish religion consisting of the Law, the Prophets, and the Writings: In the Bible it says that Adam and Eve were the first human beings. Her parents gave her a bible when she was a young child. Bible-reading classes are held in the church hall every Thursday evening.\na book, magazine, etc. that gives important advice and information about a particular subject: Vogue magazine quickly became the bible of fashionable women.\nMore examplesFewer examplesAccording to the Bible, an angel told Mary that she would have God's son Jesus.In some countries, witnesses in court have to swear on the Bible.He's always quoting from the Bible.The Bible says that God created the world.It is difficult for many people to accept a literal interpretation of the Bible.\nSMART Vocabulary: related words and phrases\nThe Bible - people, events & places\nAdam\nannunciation\napocalypse\napostolic\nEden\nepistle\nepistolary\nevangelist\nJesus Christ\nJudgment Day\nMadonna\npost-biblical\nPromised Land\npsalm\nresurrection\nthe ark\nthe disciples phrase\nthe last judgment\nthe Last Supper\nthe Second Coming\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks: reference books\nAdd to word list\nAdd to word list\nthe holy writings of the Christian religion consisting of the Old Testament and the New Testament, or the holy writings of the Jewish religion consisting of the Torah and other writings, or a book containing either of these sets of writings: [ C ] Her parents gave her a Bible when she was young.\nA Bible is also the holy writings of any religion.\nA bible is a book that gives important advice and information about a particular subject: [ C ] The magazine became the bible of fashionable women."}