{"id":33410,"name":"bicycle","type":"noun","us_sound":"ˈbaɪ.sə.kəl","us_link":"../audio/b/bicycle.mp3","uk_sound":"ˈbaɪ.sɪ.kəl","uk_link":"../audio/b/ukbfpo_022.mp3","content":"Add to word list\nAdd to word list\nA2 a two-wheeled vehicle that you sit on and move by turning the two pedals (= flat parts you press with your feet): I go to work by bicycle. He got on his bicycle and rode off. You should never ride your bicycle without lights at night. Synonym\ncycle\ntalevr/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesI ride my bicycle to work.The bicycle was resting against the wall.a bicycle shedI got my bag caught in the wheel of my bicycle.She had no brakes on her bicycle.\nSMART Vocabulary: related words and phrases\nBicycles\nbackie\nbackpedal\nbalance bike\nbicycling\nbike path\nbike rack\nBMX\nchopper\nfreight bike\nhandlebar\nkeirin\nkickstand\nmountain biker\npushbike\nreflector\nskibob\nstabilizer\ntandem\ntraining wheels\ntrishaw\nSee more results »\nto ride a bicycle: He bicycles to work through the heart of Amsterdam. After the event, we bicycled six miles back home.\nMore examplesFewer examplesOn one holiday they bicycled through France's wine regions.For 50 years he bicycled the three miles from his home to his office.They bicycled, camped, and hiked most weekends.I had just bicycled ten miles and needed a shower.Why not bicycle or walk instead of driving?\nSMART Vocabulary: related words and phrases\nBicycles\nbackie\nbackpedal\nbalance bike\nbicycling\nbike path\nbike rack\nBMX\nchopper\nfreight bike\nhandlebar\nkeirin\nkickstand\nmountain biker\npushbike\nreflector\nskibob\nstabilizer\ntandem\ntraining wheels\ntrishaw\nSee more results »\nAdd to word list\nAdd to word list\na vehicle with two wheels and a seat for a rider whose feet push pedals around in circles to make the wheels turn: He rides his bicycle to school. bicycle verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑɪ·sɪ·kəl/\nI saw you bicycling through town yesterday."}