{"id":33496,"name":"bid","type":"verb","us_sound":"bɪd","us_link":"../audio/b/bid.mp3","uk_sound":"bɪd","uk_link":"../audio/b/ukbfpo_023.mp3","content":"bid verb\n(OFFER)\nAdd to word list\nAdd to word list\nC2 [ I or T ] present participle bidding | past tense bid | past participle bid to offer a particular amount of money for something that is for sale and compete against other people to buy it, especially at a public sale of goods or property: She knew she couldn't afford it, so she didn't bid. The communications group has shown an interest in bidding for the company. A foreign collector has bid $500,000 for the portrait. [ + two objects ] What am I bid for this fine vase?\n[ I ] present participle bidding | past tense bid | past participle bid If two or more people bid for a job, they compete with each other to do the work by offering to do it for a particular amount of money: The department is trying to ensure fairer competition among firms bidding for city contracts.\n[ T + to infinitive ] present participle bidding | past tense bid | past participle bid If someone bids to do something, they compete with other people to do it: Paris is bidding to host the next Olympics.\n[ I or T ] present participle bidding | past tense bid | past participle bid (in some card games) to say, before play starts, how many points you expect to win in a particular game: Before you decide how to bid, you need to evaluate how strong the hand of cards you are holding is. She bid three diamonds.\nMore examplesFewer examplesOnline auctions, where buyers bid for items over the internet, have become increasingly popular.How much did you bid for that antique vase?Five countries are bidding to host the next World Cup.The game gives players the chance to bid for property.The council invited contractors to bid for the right to build on the site of the old City Hall.\nSMART Vocabulary: related words and phrases\nNegotiating prices\nbargain\nbargainer\nbargaining power\nbarter\nbeat\nbeat down\ncap\ndicker\ndrive a hard bargain idiom\ngazump\ngazunder\nhaggle\nhaggler\nnon-market\nnon-negotiable\noutbargain\nquotation\nquote\nsettle\nsettle on something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\nCompeting and contending (non-sporting)\nCard games\nbid verb\n(TELL)\n[ T ] old-fashioned present participle bidding | past tense bid or bade | past participle bidden to give a greeting to someone, or to ask someone to do something: [ + two objects ] They bade her good morning. I must now bid you farewell (= say goodbye to you).literary She bade her hopes farewell (= she stopped being hopeful). [ + object + (to) infinitive ] He bade (= asked) them (to) leave at once.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexpect\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWelcoming, greeting & greetings\nbid noun [C]\n(OFFER)\nC2 an offer of a particular amount of money for something that is for sale: I made a bid of $150 for the painting. She made/put in a bid of £69,000 for the flat, which was accepted.\nC1 an offer to do something when you are competing with other people to do it: [ + to infinitive ] Sydney made a successful bid to host the Olympic Games. I gave the job to the contractors who made/gave the lowest bid (= who offered to do the work for the lowest amount of money).\n(in some card games) a statement, made before play starts, of how many points a player thinks he or she will get in a particular game : The declarer must make as many tricks as his bid has promised.\nMore examplesFewer examplesThe hospital is making approaches to local businesses in their bid to raise money.They've put in a bid for the company/a bid to buy the company.At the last minute another company stepped forward with a bid.Their million-pound bid for the company was trumped at the last moment by an offer for almost twice as much from their main competitor.The company's shares wobbled with the news of a foreign takeover bid.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nsplurge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting and contending (non-sporting)\nCard games\nbid noun [C]\n(ATTEMPT)\nC2 an attempt to achieve or get something: Her bid for re-election was unsuccessful. The company has managed to fight off a hostile takeover bid (= an attempt by another company to take control of it). They have reduced the cost of borrowing in a bid to get the economy moving again.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nshoot\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nbid verb\n(OFFER)\nAdd to word list\nAdd to word list\n[ I/T ] present participle bidding | past tense and past participle bid to offer a particular amount of money for something when competing against other people to buy it: [ T ] A collector bid $500,000 for the portrait.\n[ I/T ] present participle bidding | past tense and past participle bid People who bid for/on a job offer to do it for a particular amount of money.\n[ I/T ] present participle bidding | past tense and past participle bid Someone who bids to do something competes with others to do it: [ I ] Paris is bidding to host the next Olympics.\nbid verb\n(TELL)\n[ T ] present participle bidding | past tense bid or bade us/bæd, beɪd/ | past participle bidden us/ˈbɪd·ən/ bid to give a greeting to someone, or to ask someone to do something: He bade us farewell.\nbid noun [C]\n(OFFER)\nan offer of a particular amount of money for something that is for sale: The minimum bid for these dolls is $75.\nA bid is also an offer to do a job for a particular price: His bid to build the garage was too high.\nA bid for something is an attempt to achieve or obtain it: Her bid for reelection was unsuccessful.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE, FINANCE to compete to buy something by offering a particular amount of money for it: We have a keen interest in the property, although we have not made any definite decision to bid.bid for sth Potential buyers must register and bid for items online before the cutoff dates.bid sth for sth The previously unknown company bid $9.3 billion for the oil fields.\n[ I ] to compete for work by offering to do it for a particular price: bid for sth Taylor-Stanley yesterday confirmed it had bid for the contract.bid on sth Follow these steps to bid successfully on a government contract.\n[ I ] to compete to be chosen to do something: The city is bidding to host the 2020 Olympic Games.\nPhrasal verb\nbid sth up\nCOMMERCE, FINANCE an offer to buy something for a particular price: a bid of £50mmake a bid for sth It is believed the team are ready to make a bid for the player. a failed/successful bid\nan offer to do work for a particular price: invite bids for sth/to do sth The state government is inviting bids to carry out maintenance work on all the state highways.make/put in/submit a bid for/on sth It was the second time they had submitted a bid for the contract.\nan attempt to achieve or get something: bid for sth He lost his bid for re-election to the board. The government has reduced the cost of borrowing in a bid to get the economy moving again. See also\nagreed bid\ncabinet bid\ncash bid\nclosed bid\nconditional bid\ncounter-bid\nfriendly bid\nhostile bid\nopen bid\nopposed bid\npaper bid\nsealed bid\ntakeover bid\nunconditional bid"}