{"id":33685,"name":"big","type":"adjective","us_sound":"bɪɡ","us_link":"../audio/b/big.mp3","uk_sound":"bɪɡ","uk_link":"../audio/b/ukbiff_005.mp3","content":"big adjective\n(LARGE)\nAdd to word list\nAdd to word list\nA1 large in size or amount: He's a big man. Could I try these shoes in a bigger size? They have a big house in the country. She has blonde hair and big blue eyes. She had a big pay rise.great big I had a great big slice of chocolate cake for dessert.biggest ever A thousand people took part in the region's biggest ever cycle race.informal You write August with a big (= capital) \"a\".big spender informal She's always been a big spender (= she has always spent a lot of money).big eater informal You're not a very big eater, are you? (= You do not eat a lot.) Synonyms\nastronomical (LARGE) informal\ncolossal\nelephantine formal\nenormous\ngargantuan\ngiant\ngigantic\nginormous informal\ngoodly old-fashioned\ngreat (BIG)\nhefty\nhuge\nimmense\njumbo\nlarge\nmahoosive UK informal\nmammoth\nmassive\noutsize\noversize mainly US\nprodigious formal\nrespectable\nsizeable mainlyUK\nstupendous\nthumping UK informal\ntidy mainly UK\ntremendous\nvast\nvoluminous formal\nwalloping informal humorous\nwhopping informal\nThesaurus: synonyms, antonyms, and examples\nhaving a body that is bigger than averagelargeThey sell clothes for large men.bigHe is quite big for his age.well builtHe's muscular and well built.heavysetThe victim was a heavyset, bearded male in his 30s.thicksetMax is thickset and heavy, like a rugby player.burlyHe got out of the way for the burly biker.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ngreater than the average size or amountbigThey live in a big house in the country.largeA large number of people were crowded into the room.greatThe party was a great success.enormousThey bought an enormous house in the suburbs.\nSee more results »\nA2 informal older or more like an adult: big brother Her big (= older) brother told her to go away.big sister Her big (= older) sister drove her to school.big enough I'm ashamed of you. You're big enough to know better (= at an age where you should know that your behaviour is not acceptable).\nThesaurus: synonyms, antonyms, and examples\nadult activities, behaviour, etc.adultThe victim was an adult male.adultA lot of people have never seen an adult movie.bigWhat do you want to do when you’re big?grown upHer children are all grown up now.full-grownThe website offers both puppies and full-grown dogs for sale.grownI've seen grown men cry when she sings.\nSee more results »\nC2 [ before noun ] informal used to add emphasis: You're a big bully!in a big way He fell for her in a big way (= was greatly attracted to her).\nMore examplesFewer examplesWhat happened to your jacket? There's a big rip in the sleeve.The big windows make the room feel wonderfully light and airy.There's a big sports hall for tennis and badminton and such like.We made a big profit on that deal.That jacket looks a bit big for you.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing age & birthdays\nLinguistics: very & extreme\nbig adjective\n(IMPORTANT)\nA2 important, because of being powerful, or having a lot of influence or a serious effect: He had a big decision to make. There's a big difference between starting up a business and just talking about it. The big story in the news this week is the mayor's resignation. The four biggest banks are all planning to cut their service charges.\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving a bad result or outcomeseriousHer condition is not thought to be serious.badHe got a bad case of food poisoning.bigOnline fraud is a big problem.majorIt's not a major problem, but it does need to be taken care of.graveThe public are in grave danger.\nSee more results »\nbe big in somewhere/something informal\nto be important or famous in a particular place or type of work: They're big in Japan, but no one's heard of them here.\nSee more\nC1 informal If a product or activity is big, it is extremely popular: Hip-hop is still big today.\nMore examplesFewer examplesShe'll be in big trouble if she crashes Sam's car.Her big opportunity came when she was offered a role in a Spielberg film.His height and reach give him a big advantage over other boxers.I must get some sleep - I've got a big day tomorrow.Exercise can make a big difference to your state of health.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiked, or not liked, by many people\nSee also\nhave big shoes to fillIdioms\na big ask\nbe big of someone\nbe big on something\nbig fish/cheese/gun/noise/shot/wheel\nthe big/bigger picture\nthe bigger the better\nthe bigger they are, the harder they fall\nthe big I am\nhave big ideas\nmake it big\nMore idioms\ntoo big for your boots\nwhat's the big idea?\nthe taller players on a basketball team: The coach likes his bigs to protect the basket and fight for rebounds. All of our bigs are good shooters. the bigs\nthe leagues (= groups of teams that take part in competitions between each other) where sport is played at the highest level, especially in baseball: He first made it to the bigs as a twenty-year-old. He leads the bigs in home runs this year.\nMore examplesFewer examplesThey used a rotation of bigs to neutralize the opposition's star player.He had a ten-year career in the bigs.He finally made it to the bigs after spending nine years in the minor leagues.\nSMART Vocabulary: related words and phrases\nBasketball, netball & volleyball\nairball\nbackboard\nballer\nbasketball\nbeach volleyball\nbrick\ncatch and face idiom\ncharge\ncoast\ndunk\nelbow\nfoul\nfree throw\ninbounds pass\nkorfball\nlay someone up\nlay something in\nnetball\noutrebound\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nbig adjective [-er/-est only]\n(LARGE)\nAdd to word list\nAdd to word list\nlarge in size or amount: a big ant/man/building/city Do you have these shoes in a bigger size? He tried to impress his friends by using big words. She got a big raise. I had a great big slice of chocolate cake. This is the region’s biggest bicycle race.\nBig can also mean to a large degree: a big spender/eater\ninfml Big can also mean older: a big sister/brother\ninfml Big can also be used to add emphasis: You’re a big bully!\nbig adjective [-er/-est only]\n(IMPORTANT)\nimportant, because of being powerful, influential, or having a serious effect: He had a big decision to make about his future. There’s a big difference between starting up a business and just talking about it. The big story in the news this week is the blizzard in the Midwest. We just bought a house, so today’s a big day for us.\ninfml If a product or activity is big, it is extremely popular: Those toys are very big in Japan. Idioms\nbig deal\nbe big on something\nno big deal\ntoo big to fail BANKING, FINANCE\nAdd to word list\nAdd to word list\ndescribing a bank that is so important to the economy of a country that the government will give it public money to prevent it from failing. This happened with many big banks between 2008-2009. : UK taxpayers funded banks thought too big to fail to the tune of billions of pounds, which makes the latest round of public spending cuts very hard to take. Who was it said that if a bank is too big to fail, it's too big?"}