{"id":33938,"name":"bilingual","type":"adjective","us_sound":"baɪˈlɪŋ.ɡwəl","us_link":"../audio/b/bilingual.mp3","uk_sound":"baɪˈlɪŋ.ɡwəl","uk_link":"../audio/b/ukbiff_030.mp3","content":"Add to word list\nAdd to word list\nC1 able to use two languages equally well: They are raising bilingual children. He is bilingual in Mandarin and English. She works as a bilingual secretary for an insurance company.\n(of a group or place) using two languages as main languages: Some cities such as Fribourg are bilingual. Canada is a bilingual country, with nearly one-third of its population of French origin.\nwritten, created or done using two languages: a bilingual dictionary His website is bilingual. These children have had a bilingual education. Compare\nmonolingual\nmultilingual\ntrilingual\nMore examplesFewer examplesThe report recommends that the bank hires more bilingual staff.We estimate that half the world's population is bilingual.Here in Montreal we are in a truly bilingual area.She is the editor of the bilingual anthology \"The Voices of Hope/Las Voces de la Esperanza\".Bilingual education includes a variety of strategies for using a student's native language in addition to English.They wanted to launch a bilingual newspaper.\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\nmistranslate\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nrender\nrendering\nspoken\ntarget language\ntranslator\ntransliterate\ntrilingual\nword for word idiom\nSee more results »\na person who speaks two languages equally well: The phone lines will be staffed by bilinguals.\nMore examplesFewer examplesStudies show that bilinguals are better at problem-solving.These versatile bilinguals are highly significant for the future of the English language.We shall study two groups of bilingual children in the UK: Welsh-English bilinguals in Gwynedd and Punjabi bilinguals in Lancashire.It's interesting to explore whether or not emotion is coded differently in a bilingual's two languages.\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\nmistranslate\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nrender\nrendering\nspoken\ntarget language\ntranslator\ntransliterate\ntrilingual\nword for word idiom\nSee more results »\nAdd to word list\nAdd to word list\nable to speak or using two languages: Kate is bilingual. a bilingual dictionary"}