{"id":34047,"name":"billow","type":"verb","us_sound":"ˈbɪl.oʊ","us_link":"../audio/b/billow.mp3","uk_sound":"ˈbɪl.əʊ","uk_link":"../audio/b/ukbilio014.mp3","content":"Add to word list\nAdd to word list\nto spread over a large area, or (especially of things made of cloth) to become filled with air and appear to be larger: Smoke billowed (out) from the burning building. The sheets/shirts hanging on the line billowed in the breeze. We watched the boats with their billowing sails.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\ncirculate\ndispersion\ndisseminate\ndredge\ndusting\nencroach on/upon something\nfan out\ngo around\nrambling\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsmudging\nsprinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\na large, moving mass of something, such as smoke or cloud, that spreads over a large area: billows of smoke Sophie stepped into the shower through a billow of steam.\nliterary a large wave: They were swept by the billows of that savage sea. The wind rushes over the rolling billows, and no ferryboat can cross in such weather.\nMore examplesFewer examplesThe wind really blew, whipping up huge billows of dust and sand.I flew up and came out on a beautiful clear world with blue sky and billows of clouds just under me.People were whisked away as black billows of smoke rose overhead.\nSMART Vocabulary: related words and phrases\nPrecipitation: clouds, dew, fog & steam\nbrume\nchemtrail\ncirrus\ncloudily\ncloudlessly\ncondensate\ncumulonimbus\nhaze\nhaze over\nlowering\nmist\nmoisture\nnimbus\novercast\npall\nScotch mist\nsteamily\nsub-visible\nvapour trail\nvog\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeas & oceans\nAdd to word list\nAdd to word list\nto spread over a large area, or (esp. of items made of cloth) to become filled with air and appear to be larger: The building is draped in blue plastic sheeting that flaps and billows like a sail.\na large wave or any large, swelling mass: billows of smoke"}