{"id":34032,"name":"billion","type":"number","us_sound":"ˈbɪl.jən","us_link":"../audio/b/eus70537.mp3","uk_sound":"ˈbɪl.jən","uk_link":"../audio/b/ukbilio012.mp3","content":"Add to word list\nAdd to word list\nB2 the number 1,000,000,000: The population of China is over a/one billion. Cosmetics is a billion-dollar industry. The government has invested billions of dollars in the project.\nUK old-fashioned 1,000,000,000,000 Note: This number is now called a trillion. a billion sth/billions of something informal\na very large number: There were billions of flies everywhere.\nSee more the billions\nnumbers or amounts of money between 1,000,000,000 and 1,000,000,000,000: The cost of the damage is reckoned to be in the billions. The number of interactions they will need to analyze could easily reach into the billions. The governor said that the state could not afford a school construction plan in the billions of dollars.\nMore examplesFewer examplesJapan exported $117 billion in merchandise to the US in 1999.8 billion has been wiped off share prices worldwide.In China, the policy of one child per family was introduced to stabilize the country's population at 1.6 billion.The Clinton administration last winter assembled the $50 billion emergency bailout package to ease a financial crisis in Mexico.The national debt stands at $55 billion.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nfive\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzillion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge in number or quantity\nAdd to word list\nAdd to word list\n1,000,000,000: Congress cut spending by $255 billion. Four hurricanes battered Florida, causing billions of dollars in damage.\nAdd to word list\nAdd to word list\none thousand million: 1,000,000,000: a loss of £2 billion The banks lost billions in the crash."}