{"id":34175,"name":"binder","type":"noun","us_sound":"ˈbaɪn.dɚ","us_link":"../audio/b/binder.mp3","uk_sound":"ˈbaɪn.dər","uk_link":"../audio/b/ukbilio024.mp3","content":"binder noun [C]\n(COVER)\nAdd to word list\nAdd to word list\na hard cover in which paper documents or magazines are stored: a leather/plastic binder He's filled five binders with notes. See also\nring binder\nhanohiki/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesA carefully kept logbook (a three-ring binder with pages for sketches and notes of your observations) will become a valued resource.Create a binder just for holiday recipes-foods you made, how you tweaked the seasonings, what could have used more or less time in the oven, recipes you wanted to try but didn't.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nepilogue\nerrata\nerratum\nex-libris\nextract\nfascicle\njacket\nlibrary\nmonograph\nomnibus\npreface\nprologue\nspine\nSee more results »\nbinder noun [C]\n(JOB)\na\nbookbinder\nSMART Vocabulary: related words and phrases\nPeople who work in publishing\nagent\nanthologist\nbookbinder\nco-editor\nco-publisher\ncompositor\nconcierge\neditor\neditor-at-large\nillustrator\nproofreader\npublisher\nreader\nreviewer\nsensitivity reader\nsuperagent\nsyndicate\nvanity press\nbinder noun [C]\n(MACHINE)\na machine used on farms to fasten crops into sheaves (= bundles) after they have been cut: The way to harvest cereals 50 years ago was to use a binder, that cut the crop and tied it up in sheaves.\nSMART Vocabulary: related words and phrases\nFarm vehicles & equipment\nall-terrain vehicle\nATV\nCaterpillar tractor\ncombine\ngoad\nharrow\nharvester\nmilking machine\nplanter\nplough\nploughshare\nreaper\nscarecrow\nseeder\nsifter\nsorter\nspreader\ntractor\nyoke\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nbinder noun [C]\n(SUBSTANCE)\na substance added to a mixture to make all the parts stick together: You can use egg as a binder.\nMore examplesFewer examplesOur food has no artificial or processed ingredients, no low-cost fillers or binders.Lump charcoal is a pure form of charcoal and is preferred by many purists who dislike artificial binders used to hold briquettes in their shape.\nSMART Vocabulary: related words and phrases\nGlues, gluing & stickiness\nadhere\nadherent\nadhesion\nadhesive\nadhesively\nBlu-Tack\ngloopy\nglue\nglue gun\nglue stick\ngluey\npropanone\nputty\nScotch tape\nself-adhesive\nslimily\ntackiness\ntacky\ntreacly\nviscid\nSee more results »\nbinder noun [C]\n(TIGHT MATERIAL)\na strip of material wrapped tightly around part of the body to firmly press or hold it in place, for example after surgery (= a medical operation): Compression devices such as abdominal binders and compression stockings may help.\na special piece of clothing that some people, especially transgender people (= people whose gender does not match the body they were born with), wear to make their chests appear flatter by holding their breasts flat: One of the most important parts of choosing the right binder for you is getting the right size. Can you recommend a company that makes good binders for busty individuals? This transgender nonprofit ships free binders to people who need them.\nMore examplesFewer examplesPatients are required to wear breast binders for three to six weeks to hold the implant in place during the healing process.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbiomaterial\nbiventricular pacemaker\nblade\nbrace\ncotton wool\nElastoplast\nexoskeleton\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\nobturator\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnderwear\nAdd to word list\nAdd to word list\na stiff cover that can hold loose papers, often having a part that fastens them: a three-ring binder\nAdd to word list\nAdd to word list\nLAW a short document showing an agreement between a buyer and a seller, used for a short period while the complete document is being prepared: a binder agreement In the case of a real estate purchase, a binder contains the basic terms of the transaction. A binder will give insurance coverage for a specified period of time until the actual insurance policy can be issued. See also\ncover note\nWORKPLACE a hard cover in which paper documents can be stored: Your report will look more professional if it is presented in an attractive binder. See also\nring binder"}