{"id":34181,"name":"binding","type":"adjective","us_sound":"ˈbaɪn.dɪŋ","us_link":"../audio/b/binding.mp3","uk_sound":"ˈbaɪn.dɪŋ","uk_link":"../audio/b/ukbilio026.mp3","content":"Add to word list\nAdd to word list\n(especially of an agreement) that cannot be legally avoided or stopped: a binding agreement The contract wasn't legally binding.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nself-regulation\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nbinding noun\n(MATERIAL/FASTENING)\n[ C or U ] the type of cover that a book has: She took a book from the shelf, admiring the gold edges to the pages and the green leather binding.\n[ U ] a thin strip of material that can be sewn along the edges of clothes or other objects: The jacket is beautifully finished, and binding on the seams and pockets adds strength.\n[ C ] a device that is fixed to a ski, for holding a boot firmly: I need to adjust these bindings – they are too tight.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nconcordance\nepigraph\nepilogue\nerrata\nerratum\nex-libris\nISBN\njacket\nlibrary\nmonograph\nomnibus\npreface\nspine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBands, straps and strips\nKnitting & sewing\nWinter sports\nbinding noun\n(MAKING CHEST FLAT)\n[ U ] the act, usually done by transgender people (= people whose gender does not match the body they were born with), of making your chest appear flatter by wrapping it very tightly with a piece of cloth or a binder (= a special piece of clothing used for this purpose) that helps hold your breasts flat: Binding can help reduce gender dysphoria and improve mental health for trans men. Chest binding is common among people who want their chest to look less feminine. We recommend that you talk to a healthcare provider if you experience negative side effects from binding, such as shortness of breath.\nAdd to word list\nAdd to word list\n(esp. of an agreement) not to be avoided or broken: Both sides agreed to submit the dispute to binding arbitration (= to a decision they would have to obey).\nThe binding of a book is the type of cover it has: a cloth binding\nAdd to word list\nAdd to word list\nused to describe an agreement, contract, etc. that cannot be changed or stopped: Once signed, these documents are legally binding.binding on sb The court ruled that verbal distribution agreements are binding on both parties. a binding agreement/contract/commitment"}