{"id":34173,"name":"bind","type":"verb","us_sound":"baɪnd","us_link":"../audio/b/bind.mp3","uk_sound":"baɪnd","uk_link":"../audio/b/ukbilio023.mp3","content":"bind verb\n(TIE/FASTEN)\nAdd to word list\nAdd to word list\nC2 [ T ] to tie something or someone tightly or to fasten something: They bound the packages with brightly coloured ribbon. Bind together the two broken ends. The prisoner was bound hand and foot.\n[ T ] (also bind up) to tie something around a part of the body, especially a part that is damaged: He had already bound the child's arm when I arrived.\n[ T ] to sew or stick material along the edges of something such as a jacket, in order to make it stronger or to decorate it: The edges of the carpet are bound to stop them fraying.\n[ T ] to make separate pieces of paper into a book: There are several different ways to bind a book, for example you can stitch or stick the pages together. See also\nbookbinding\nMore examplesFewer examplesHe had been bound and gagged and left in a cell for three days.He found a length of frayed rope and used it to bind the man's hands and legs.We tore up some material and bound up the wound as tight as we could.The manuscript has been bound in gold and silver and encrusted with jewels.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical dressings, supports & devices\nKnitting & sewing\nDecorating or making something attractive\nCovering and adding layers\nbind verb\n(COMBINE)\n[ I or T ] (used especially in cooking) to make a mixture stick together in a solid mass, or to be made to stick together like this: Add enough water to bind everything together. The mixture wouldn't bind.\n[ I or T ]\n&#160; chemistry\n&#160; specialized to combine with something by a chemical bond (= the force holding atoms together in a molecule), or to be combined like this: Protein's ability to bind iron may enhance iron absorption in the body. The tissue cells will bind strongly to each other.\nMore examplesFewer examplesYou may need more egg to bind the mixture.Turn the dough out onto a floured surface and knead lightly to bind.Androgens are hormones that enter the prostate cell and bind to the androgen receptor protein.A protein found on red blood cells in sickle-cell disease binds these cells to blood vessel walls.In people with diabetes, HDL molecules bind with a natural compound called myristic acid.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry - general words\nPhysics: atoms, molecules & sub-atomic particles\nbind verb\n(UNITE)\nC2 [ T ] to unite people or to make them feel that they share something: The things that bind them together are greater than their differences. \"We have one country, one Constitution and one future that binds us,\" he said. Close personal ties bind me to this place.\nMore examplesFewer examplesShe talked of a connection that has always bound Dominicans together, whether at home or abroad.Whatever our faith, our common humanity should bind us all.Their shared suffering binds them to one another.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nbind verb\n(MAKE CHEST FLAT)\n[ I or T ] to make your chest appear flatter by wrapping it very tightly with a piece of cloth or a binder (= a special piece of clothing used for this purpose) that helps hold your breasts flat: I'm non-binary and have been binding for a year now. He uses a tight sports bra to bind. It is crucial to practise proper safety when chest binding. Many trans men bind their chests as an alternative to, or while waiting for, top surgery. Phrasal verb\nbind someone to something\na difficult or annoying situation in which you are prevented from acting as you might like: Having to visit her every week is a terrible bind. Borrowing money may put you in a real bind.\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\nbind verb [T]\n(TIE)\nAdd to word list\nAdd to word list\nto tie someone or something tightly, or to fasten things together: The room was full of wooden boxes bound with twisted wire. fig. The club is home to a mix of people bound together by a love of boats and boating.\nfig. To bind someone is also to force the person to keep a promise: This contract binds the state to use this land as a park, said Judge Harry Smith.\nTo bind a book is to fasten one edge of the pages together inside a cover to make a book.\nbind noun [U]\n(UNPLEASANT SITUATION)\na difficult situation in which none of the choices available are good: If you lose a lot of your customers, you’ll soon get in a financial bind.\nAdd to word list\nAdd to word list\nLAW if a legal agreement or official decision binds someone, it forces them to do something or to keep a promise: bind sb to do sth The contracts bind investors to maintain the road.be bound to sth We are bound to the original contract\nCOMMERCE to agree not to increase the rate of a tax, tariff, etc. above a particular level: bind sth (at sth) Jamaica bound all its industrial tariffs at a uniform ceiling rate of 50%. Compare\nbound"}