{"id":34338,"name":"biodynamics","type":"noun","us_sound":"ˌbaɪ.oʊ.daɪˈnæm.ɪks","us_link":"../audio/b/cdo0319usbiod0189.mp3","uk_sound":"ˌbaɪ.əʊ.daɪˈnæm.ɪks","uk_link":"../audio/b/cdo0319ukbiod0162.mp3","content":"biodynamics noun [U]\n(FARMING)\nAdd to word list\nAdd to word list\na particular type of organic farming or plant growing (= using no artificial chemicals) that gives attention to the movements of the moon and planets: Biodynamics is a labour-intensive way to work the land. Although plenty of viticulturists are sceptical, respect for biodynamics is growing.\nMore examplesFewer examplesBiodynamics was pioneered in the 1920s by the Austrian philosopher Rudolf Steiner.Some winemakers are seeing better-quality fruit, healthier vines, and better results through biodynamics. Biodynamics involves a holistic belief that the farm or vineyard is itself an organic entity that must maintain proper natural balance in order to successfully yield crops. He wanted to plant the vineyard on a heptagonal scheme, because proponents of biodynamics hold that a seven-sided figure contains great stores of energy.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\nfake\nfalse\nfreshness\nGod-given\nimitation\nnon-toxic\norganically\npure\nrawness\nrefined\nunbleached\nunnatural\nunnaturally\nunprocessed\nuntamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFarming - general words\nGardening - general words\nbiodynamics noun [U]\n(MOVEMENT)\nthe study of physical movement in people and living things: Athletes today outperform those of the past thanks to advances in nutrition, sports medicine, biodynamics, and equipment. The team trains with help from Imperial College's biodynamics lab.\nMore examplesFewer examplesHe is director of the Cincinnati Children's Hospital Sports Medicine Biodynamics Center.It's important to understand the technical side of fitness and the biodynamics of the body.\nSMART Vocabulary: related words and phrases\nMovement\nambulatory\nbe treading water idiom\ncomings\ngestural\ngesturally\nmobile\nmobility\nmotile\nmotility\nmotion\nmovable\nmovably\nmovement\npassage\npull someone up short idiom\nrooted\nrooted to the spot idiom\nslithery\nsteadiness\nstillness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe body"}