{"id":34417,"name":"biological","type":"adjective","us_sound":"ˌbaɪ.əˈlɑː.dʒɪ.kəl","us_link":"../audio/b/biological.mp3","uk_sound":"ˌbaɪ.əˈlɒdʒ.ɪ.kəl","uk_link":"../audio/b/ukbingo015.mp3","content":"Add to word list\nAdd to word list\nB2 connected with the natural processes of living things: the biological sciences Eating is a biological necessity!\n[ before noun ] related by birth: She decided to search for her biological mother after her adoptive parents died.\nThesaurus: synonyms, antonyms, and examples\nyour parentsparentMy parents died when I was young.biological parentSome children are raised by grandparents or other family members, instead of their biological parents.adoptive parentWhen he was 7 months old, his mother gave him up to his adoptive parents.motherHave you met my mother?fatherMy father fully supports my life choices.mumUK My mum and dad go there every year.\nSee more results »\nUK used to describe a substance used for cleaning that uses enzymes to remove dirt: biological washing powder Compare\nnon-bio UK\nusing living matter, such as bacteria, to seriously harm and kill people and animals, and to damage crops: biological weapons/warfare\nMore examplesFewer examplesResearch involving the use of biological warfare agents will be used for defensive purposes.Breathing and sleeping are examples of biological rhythms in humans.Immunology is a branch of biological science.a biological research stationbiological weapons\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nbiophysics\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\npolymorphism\nprimary producer\nprimitively\nprokaryote\npseudopod\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFamily: relations in general\nCleaning agents\nArms & munitions in general\nRelated word\nbiologically\nAdd to word list\nAdd to word list\nrelating to the natural processes of living things: the biological sciences\nBiological also means being related through birth: the biological father/mother/parents"}