{"id":34907,"name":"birth","type":"noun","us_sound":"bɝːθ","us_link":"../audio/b/berth.mp3","uk_sound":"bɜːθ","uk_link":"../audio/b/ukbenev026.mp3","content":"Add to word list\nAdd to word list\nA2 [ C or U ] the time when a baby or young animal comes out of its mother's body: It was a difficult birth. He weighed eight pounds at birth. More men are present at the births of their children these days. The application form will ask for your country/place of birth (= where you were born).\n[ C ] a child that is born: The percentage of live births (= children who are born alive and continue to live) continues to increase. Registration of births and deaths became compulsory in 1871.\n[ U ] the position of the family into which you are born, especially its social position: He had received all the advantages of birth (= having been born into a family of a high social class) and an expensive education. American, Italian, etc. by birth (or an American, an Italian, etc. by birth)\nB2 born in a particular place or having parents of a particular nationality: Oscar Wilde was Irish by birth.\nSee more\nC1 the beginning of something: These asteroids were formed at the birth of the solar system.\nThesaurus: synonyms, antonyms, and examples\nthe start of somethingbeginningLet's go back to the beginning. Can you tell me when you arrived at the crime scene?startI didn't like him from the very start.endThis is it – the end of the tour. openingThe opening of the ceremony was marred by protest.commencementWhat is the commencement date of their contract?kick-offWhat time is the kick-off for the banquet and show?\nSee more results »\nMore examplesFewer examplesI weighed 10 lb at birth.Elaine and Ian Gibson proudly announce the birth of their son, John Maurice.She's been blind since birth.I've filled in the form, but you still need to insert your bank details and date of birth.Research has demonstrated that babies can recognize their mother's voice very soon after birth.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\nBeginnings and starts\nOrigins and sources\nIdiom\ngive birth\n[ I or T ] to produce a baby or young animal from your body: She birthed and raised eight children. An elephant in the zoo birthed a calf. In the United States, more and more women are choosing to birth in water. Synonym\ngive birth\n[ T ] to help a baby or young animal to be born: Many of these midwives have decades of experience birthing babies. A team of elephant keepers and trainers helped to birth the calf.\n[ T ] to produce or create something; to cause something to start existing: Greece is the nation that birthed the Olympics. I wanted him to be involved in the film because after all, he birthed the idea.\nMore examplesFewer examplesI know all the trouble my mum went through birthing me and my siblings.I think the mother should get all the gifts as she has actually birthed the child.I know many women who have birthed successfully at home.The actor came out of the same British comedy scene that birthed Monty Python.Agriculture gave rise to the city-state, birthing the human ecosystem that has been our home for millennia.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nAdd to word list\nAdd to word list\nthe occasion when a baby comes out of its mother’s body: [ C ] He remembered the birth of their first child. [ U ] Their son weighed eight pounds at birth.\nBirth also refers to your family origin: [ U ] She was Swedish by birth.\nWhen a woman gives birth, one or more babies come out of her body: [ U ] She gave birth to twins."}