{"id":35161,"name":"bit","type":"noun","us_sound":"bɪt","us_link":"../audio/b/bit.mp3","uk_sound":"bɪt","uk_link":"../audio/b/ukbipla028.mp3","content":"bit noun [C]\n(AMOUNT)\nAdd to word list\nAdd to word list\nA2 informal a small piece or amount of something: Would you like a bit of chocolate? The glass smashed into little bits. There were bits of paper all over the floor. She tries to do a bit of exercise every day. I don't understand this bit. a bit informal\nB2 a short distance or period of time: I'm just going out for a bit. See you later.\nSee more a bit of something\nC1 a slight but not serious amount or type of something: Maria's put on a bit of weight, hasn't she?\nSee more a bit...\nA2 slightly: The dress is a bit too big for me.\nUK very: Blimey, it's a bit cold!\nSee more bit by bit\nC1 gradually: I saved up the money bit by bit.\nSee more not a bit (also not one bit)\nnot in any way: She wasn't a bit worried about the test.\nSee more quite a bit\nB1 a lot: They have quite a bit of money.\nSee more to bits\ninto small pieces: The car was blown to bits.\nvery much: I love my son to bits.\nSee more\nMore examplesFewer examplesI think we need a bit of colour in this room.We may as well finish off this pie - there's only a little bit left.I brought a few things back from India - bits of jewellery and material mainly.I've bracketed the bits of text that could be omitted.That salmon was very expensive so make sure you eat up every bit.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\nbit noun [C]\n(HORSE)\na piece of metal put in a horse's mouth to allow the person riding it to control its movements\nalacatr/E+/GettyImages\nSMART Vocabulary: related words and phrases\nHorse riding\nbridle\ncanter\ncinch\ncurry\nendurance rider\nendurance riding\nequestrianism\neventer\ngirth\nhigh-spirited\nhorseman\njib\njodhpurs\nmounted\npony trekking\nrein\nsaddle-sore\nsidesaddle\nsnaffle\nwhip\nSee more results »\nbit noun [C]\n(COMPUTER)\ncomputing\n&#160; specialized a unit of information in a computer that must be either 0 or 1: a 32-bit computer (= a computer that processes 32 bits of information at a time)\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nbit noun [C]\n(COIN)\nUK, old use a coin representing a small amount of money: a threepenny/sixpenny bit\nUS informal, old use an amount of money that is equal to 12 1/2 cents, usually used in the expression \"two bits,\" or 25 cents Compare\ntwo bits US informal\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBritish money\nInformal words for money\nbit noun [C]\n(TOOL)\nthe part of a tool used for cutting or drilling (= making holes)\nYevgen Romanenko/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\ngimlet\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\npincer\nplunger\nprong\nrasp\nrazor knife\nreamer\nsander\ntrowel\nSee more results »\nGrammar\nA bitWe use a bit (of) or bits (of) to refer to quantities. The phrases can refer to both abstract and concrete things. They are an informal alternative to some, or a piece of or pieces of: …\nPiece words and group wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nPiece wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nIdioms\nbe a bit much\nbe a bit of all right\na bit of fluff/stuff/skirt\na bit of rough\na bit on the side\nget the bit between your teeth\nnot a bit of it\nbe in bits\nbits and pieces\npast simple of bite\nSMART Vocabulary: related words and phrases\nBiting, chewing & swallowing\nbite\nbiter\nchamp\nchew\nchomp\ndunk\ngnaw\nlick\nmastication\nmunch\nnibble\nnon-biting\npeck\npeck at something\nsuck\nunbitten\nunchewable\nunchewed\nSee more results »\nbit noun [C]\n(PIECE)\nAdd to word list\nAdd to word list\na small piece or a small amount of something: little bits of paper We need every bit of evidence we can find. We showed a little bit on videotape. Could you talk a bit (= for a short period) about your childhood experiences?\nA bit or a little bit can mean slightly or to some degree: We found the dinner a little bit of a disappointment.\nbit noun [C]\n(HORSE)\na piece of metal put in a horse’s mouth to allow the person riding it to control its movements\nbit noun [C]\n(COMPUTER)\nthe smallest unit of information in a computer, represented by either 0 or 1\nbit noun [C]\n(TOOL)\nthe part of a tool used to cut or drill (= make holes) Idiom\nchafing at the bit\nbit\n(BITE)\npast simple of bite\nAdd to word list\nAdd to word list\nIT the smallest unit of information in a computer's memory: Can I run 32-bit programs on a 64-bit computer?"}