{"id":35436,"name":"black","type":"adjective","us_sound":"blæk","us_link":"../audio/b/black.mp3","uk_sound":"blæk","uk_link":"../audio/b/ukbitch026.mp3","content":"black adjective\n(COLOUR)\nAdd to word list\nAdd to word list\nA1 having the darkest colour there is, like the colour of coal or of a very dark night: black shoes\nMore examplesFewer examplesI wanted a simple black dress, nothing fancy.I heard a loud bang and then saw black smoke.The zebra is a wild African horse with black and white stripes.When you fill in the form, please write clearly in black ink.Amalie was dressed completely in black, right down to black lipstick and a black earring.\nSMART Vocabulary: related words and phrases\nBlack, white & grey\nblackness\ncoaly\ndove grey\ndusty\nebony\ngreyish\ngreyly\ngreyness\ngunmetal grey\ninky\njet black\nlily-white\npearl\npearly\npitch darkness\npitchy\nsable\nsnow white\nsombrely\nsooty\nSee more results »\nblack adjective\n(PEOPLE)\nA2 (also Black) relating or belonging to people with black or dark brown skin, especially people who live in Africa or whose family originally came from Africa: black culture Black Americans\nMore examplesFewer examplesThere's a large Black community living in this area.The armed forces are now giving positive encouragement to applications from Asians and Black people.Britain is a multi-ethnic society, with many Black and Asian people.He had a Black mother and a white father.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nashy\nblush\ncolouring\ncraggily\ncraggy\ncutaneous\nmole\npallor\npore\nsanguine\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbed\ntattooist\nwrinkle\nSee more results »\nblack adjective\n(COFFEE/TEA)\nwithout any milk or cream added: a cup of strong black coffee I like my tea black, with sugar.\nSMART Vocabulary: related words and phrases\nWarm drinks\nAmericano\narabica\nAssam\nbabyccino\nbed-tea\ncoffee maker\ncongou\ncrema\ncuppa\nDarjeeling\ninfusion\nIrish coffee\njasmine tea\njoe\nKeepCup\nrobusta\nrooibos\nRosie Lee\nsencha\nstewed\nSee more results »\nblack adjective\n(BAD)\nwithout hope: The future looked black.\nliterary bad or evil: a black-hearted villain\nSMART Vocabulary: related words and phrases\nSerious and unpleasant\nabominable\nabominably\nabysmal\nabysmally\napocalyptic\nfraught\nfrightful\nfrom hell idiom\nfun\nghastliness\nnoisome\nnot be all fun and games idiom\nnoxiously\nobjectionable\nobjectionably\nunpleasantness\nunpretty\nunspeakable\nunspeakably\nunsupportable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorally wrong and evil\nIdioms\nblack and blue\nnot be as black as you are painted\npaint a black picture of something/someone\nblack noun\n(COLOUR)\nA2 [ U ] the colour of coal or of the sky on a very dark night: She often dresses in black (= in black clothes).\nbgblue/DigitalVision Vectors(NO PRPER IMAGE)/GettyImages black and white\nBlack and white photography has no colours except black, white, and grey: The old newsreels were filmed in black and white.\nSee more\nSMART Vocabulary: related words and phrases\nBlack, white & grey\nblackness\ncoaly\ndove grey\ndusty\nebony\ngreyish\ngreyly\ngreyness\ngunmetal grey\ninky\njet black\nlily-white\npearl\npearly\npitch darkness\npitchy\nsable\nsnow white\nsombrely\nsooty\nSee more results »\nblack noun\n(PEOPLE)\n[ C ] offensive (also Black) a word for a person who has black or brown skin, which may be considered offensive when used as a noun rather than an adjective\nGrammar\nFixed expressions with andWe often use and in common fixed expressions. The order of the words cannot change: peace and quiet, pick and choose, come and go, knife and fork, black and white. …\nIdioms\nbe (down) in black and white\nbe in the black\nblack-and-white\nblack is white\nsth is the new black\nsee things in black and white\nblack verb [T]\n(MAKE DARK)\nto put a black substance on something or to make something black: The soldiers used to black their faces.\nSMART Vocabulary: related words and phrases\nBlack, white & grey\nblackness\ncoaly\ndove grey\ndusty\nebony\ngreyish\ngreyly\ngreyness\ngunmetal grey\ninky\njet black\nlily-white\npearl\npearly\npitch darkness\npitchy\nsable\nsnow white\nsombrely\nsooty\nSee more results »\nblack verb [T]\n(AVOID)\nUK If a trade union or other organization blacks goods or people, it refuses to handle or work with them.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nunsanctioned\nSee more results »\nPhrasal verbs\nblack something out\nblack out\nblack (something) up\nblack adjective, noun [U]\n(COLOR)\nAdd to word list\nAdd to word list\n(of) the darkest color there is, like night: He was dressed all in black.\nBlack coffee or tea has no milk or cream in it. Idioms\nin black and white\nin the black\nblack adjective\n(DARK SKIN)\n[ -er/-est only ] of or belonging to a group of people having skin that is brown, esp. African-American people: As a black woman, I am proud of my African-American heritage. Note: Although African-American is the word preferred by many, black is also widely used and is not offensive: Black leaders disagreed over how to respond. As a noun, African-American is now more commonly used, but when describing historical events, black may be used.\nblack adjective\n(SAD OR BAD)\nwithout hope, very bad, or sad: The blackest time of all was when his eyes failed.\nin the black\nAdd to word list\nAdd to word list\nFINANCE, ACCOUNTING a company or organization that is in the black has made a profit: Analysts predict that the group will end the fiscal year in the black.\nFINANCE, STOCK MARKET shares that are in the black have increased in value: Smaller shares ended in the black, but with less dramatic gains than the blue chips.\nBANKING, ACCOUNTING a bank account that is in the black has money in it: We hope that the harder we work, the more our account will stay in the black.\ngo into/move into/return to, etc. the black\nto start making a profit after losing money: This is the biggest shopping day of the year, when retailers aim to go into the black.\nto increase in value: The main index actually moved back into the black late afternoon. Compare\nred\nUK if a trade union blacks goods, an organization, etc. it refuses to deal with them"}