{"id":35485,"name":"blackening","type":"verb","us_sound":"ˈblæk.ən","us_link":"../audio/b/blacken.mp3","uk_sound":"ˈblæk.ən","uk_link":"../audio/b/ukblack004.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nblacken\nblacken verb [I or T usually passive]\n(BECOME/MAKE BLACK)\nto become black or to make something become black, for example because of dirt or smoke: The folds of the curtains were blackened with dirt. The buildings were blackened by explosions. Copper pots dangle over a blackened hearth. The sky suddenly blackened.\nThesaurus: synonyms, antonyms, and examples\nto make fire or damage with fireburnThe fire was still burning after 24 hours.burn (fuel)The car burns biofuel.burnShe burned his diaries to stop the information from becoming public.blazeBush fires blazed across the county.smoulderUK The fire smouldered and soon went out.scorchThe sun had scorched the grass and turned it brown.\nSee more results »\nto make food black on the outside by cooking it in a very hot pan, usually after covering it in oil or butter and herbs or spices, or to become black in this way: The blackened catfish is topped with mushrooms and served over spinach. My girlfriend ordered the blackened prawns. Leave the pan on a high heat so that the chicken blackens.\nMore examplesFewer examplesThe earth along the river bank is blackened by thousands of years of cooking fires.The images show lungs blackened from cigarette smoking.The wires caught fire and blackened the wall.During this process the paprika caramelizes and blackens.We welcomed him with one of the best summer meals, a blackened steak salad. Blackened fish tacos: three tacos stuffed with blackened whitefish, rice, cheese, and spicy salsa.I wasn't sure how they go about blackening the food, so I didn't order it.\nSMART Vocabulary: related words and phrases\nMaking things dirty & untidy\nblacken\nclutter\ncontaminate\ndefile\ndirty\ndisarrange\nfoul\nmess\nmix\nmix someone/something up\nmuddle\nmuddle something up\nmuss\npollute\npolluter\nrecontaminate\nsoil\nstain\ntarnish\nthe polluter pays principle idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing food using heat\nCookery terms\nblacken verb [I or T usually passive]\n(SPOIL)\nblacken someone's name/image/reputation\nto make someone have a bad reputation: The financial crash blackened the image of bankers. He accused politicians of \"blackening the reputation\" of war veterans.\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nhatchet job\nscurrilous\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslur\nsmear\ntarnish\nSee more results »"}