{"id":35549,"name":"blackmail","type":"noun","us_sound":"ˈblæk.meɪl","us_link":"../audio/b/blackmail.mp3","uk_sound":"ˈblæk.meɪl","uk_link":"../audio/b/ukblack011.mp3","content":"Add to word list\nAdd to word list\nC2 the act of getting money from people or forcing them to do something by threatening to tell a secret of theirs or to harm them: If you are in a position of authority, any weakness leaves you open to blackmail.\nMore examplesFewer examplesI don't believe she would ever stoop to bribery or blackmail.They were found guilty of blackmail and sent to prison.His secret financial activities made him vulnerable to blackmail.Undoubtedly, blackmail is a very serious offence.They were villains who resorted to threats and blackmail to get what they wanted.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndefalcation\ndefraud\ndolus\nembezzle\nembezzlement\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nmatch-fixing\nnobble\npyramid scheme\nsiphon\nSee more results »\nIdiom\nemotional blackmail\nC2 to get money from someone by blackmail: They used the photographs to blackmail her into spying for them.\nMore examplesFewer examplesWhen he found out about my affair he tried to blackmail me.A computer hacker's attempt to blackmail the bank was foiled by detectives last month.The gang thought they could use the photographs to blackmail the pop star.If someone is blackmailing you, you really must inform the police.The film is about a city dealer who is blackmailing his boss.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblag\ndeceive\ndiddle\nfiddle\nflannel\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\nhocus-pocus\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nput something across/over someone\nracket\nSee more results »\nRelated word\nblackmailer\nAdd to word list\nAdd to word list\nthe act of threatening to harm someone or someone's reputation unless the person does as you say, or a payment made to someone who has threatened to harm you or your reputation if you fail to pay the person: Reckless behavior made him an easy target for blackmail. blackmail verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈblækˌmeɪl/\nThe guy who blackmailed my father went to jail.\nAdd to word list\nAdd to word list\na situation in which threats are made to harm a person or organization if they do not do something such as give someone money: Large corporations can be vulnerable to blackmail demands by computer hackers.\nto make threats to harm a company or organization if they do not do something you want, such as give you money: A former executive, seeking damages of $2.5 million, was accused of trying to blackmail the company."}