{"id":35611,"name":"blade","type":"noun","us_sound":"bleɪd","us_link":"../audio/b/blade.mp3","uk_sound":"bleɪd","uk_link":"../audio/b/ukblack017.mp3","content":"blade noun [C]\n(FLAT PART)\nAdd to word list\nAdd to word list\nB2 the flat part on a knife or similar tool or weapon, with a very thin edge used for cutting: a sword with a steel blade a packet of razor blades\nalexkar08/iStock/Getty Images Plus/GettyImages\na wide, flat part on a tool or machine, used to push back water or air: a propeller blade windscreen wiper blades\nused in the names of other objects that are flat, thin, and sometimes long, like a blade\na long, narrow leaf of grass or a similar plant: a blade of grass\nLitvalifa/iStock/Getty Images Plus/GettyImages\nthe metal part on the bottom of an ice skate\nSelektor/E+/GettyImages\nsports\n&#160; specialized a curved device that a person who has lost part of a leg can attach to their body where the leg was, in order to be able to walk or run, for example in a race : The blades, made from lightweight carbon fibre, store kinetic energy in a similar fashion to a spring and allow the athlete to run and jump.\nFilippo Romeo/EyeEm/GettyImagesSee also\nshoulder blade\nMore examplesFewer examplesa double-edged bladea scissor bladea knife with a sharp blade.He screamed as the blade sliced into his leg.I saw the blade of an open knife shine in his hand in the torchlight.\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\nexcavator\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\nhacksaw\nplunger\nrasp\nrazor knife\nreamer\nsander\nsandpaper\ntrowel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTools in general\nParts of plants\nSkates & skateboards\nMedical dressings, supports & devices\nAthletics\nblade noun [C]\n(MAN)\nold use an attractive and confident young man: a dashing young blade\nAdd to word list\nAdd to word list\nthe thin, flat cutting part of a tool or weapon: The blade on this knife isn’t very sharp.\nA blade is also a thin, flat leaf of grass: The boy made a whistle from a blade of grass."}