{"id":35636,"name":"blah","type":"adjective","us_sound":"blɑː","us_link":"../audio/b/usb02325.mp3","uk_sound":"blɑː","uk_link":"../audio/b/cdo0319ukblah0181.mp3","content":"Add to word list\nAdd to word list\nnot very good, special, or interesting: It's a stylish restaurant but the food is kind of blah. Synonym\nmeh\nThesaurus: synonyms, antonyms, and examples\nnot interesting or excitingboringThat was such a boring film I nearly fell asleep during it.excruciatingShe went over the plot of the book in excruciating detail.deadlyHis latest film was just deadly. I left after the first hour!mind-numbingThe incident was described in a mind-numbing, 400-page report so dense that no one read it.\nSee more results »\nnot feeling much interest, energy, or excitement: I was feeling a bit blah and I left early.\nMore examplesFewer examplesI thought Joan was a fantastic character whereas Ann was just blah.In the winter we often feel more blah than beautiful.If you are feeling blah about things, trying changing your routine.\nSMART Vocabulary: related words and phrases\nLinguistics: sounds used as interjections\naha\nahem\nbah\nbam\nblah, blah, blah\ncor\nduh\ner\nhuh\now\npsst\nsquee\ntut\nuh-huh\nvocable\nwham\nwhee\nwhew\nwoot\nyuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLacking interest and enthusiasm\nBore and bored\nTired and making tired\n[ U ] disapproving a lot of speech or writing that has very little meaning: Don't invent a lot of blah about fate and destiny. The speech contained no actual policy proposals, just blah. Synonym\nblather\n[ U ] a word, phrase, amount, etc. when you do not say or know exactly which, sometimes used when you are giving an example: You might read in a magazine that so-and-so says blah about so-and-so. Blah squared is blah multiplied by blah. Synonym\nx the blahs US\na feeling of having very little interest, energy, or excitement: Stay physically active to stop the winter blahs getting to you. The thought of making dinner every night leaves me with the blahs.\nMore examplesFewer examplesThere followed more blah about music than I have ever heard in my life.\nSMART Vocabulary: related words and phrases\nNonsense\nbabble\nbalderdash\nballs\nbaloney\nblather\nblither\nblithering\ndouble-talk\ndoublespeak\ndrivel\neyewash\nflapdoodle\ngarbage\nmoonshine\nmumbo jumbo\nnonsense\nnonsensical\nnonsensically\nprattle\nrhubarb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTalking too much\nGeneral\nLacking interest and enthusiasm\nBore and bored\nTired and making tired\nSee also\nblah, blah, blah\nto talk a lot in a way that has very little meaning: I wish they'd all stop blahing about politics. The media has been blahing on about this for months. Synonym\nblather\nMore examplesFewer examplesI'm blahing now—I've lost my thread.They can blah on as much as they like—nobody's listening.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblither\nchirp\ncoo\ncrap\ndeclamatory\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\nthrow your voice idiom\ntrash\nturn of phrase\ntwittering\nwang\nwhang\nwhang on\nyammer\nSee more results »\nAdd to word list\nAdd to word list\nboring or ordinary: I thought the show was blah. Idiom\nblah, blah, blah"}