{"id":35655,"name":"blame","type":"verb","us_sound":"bleɪm","us_link":"../audio/b/blame.mp3","uk_sound":"bleɪm","uk_link":"../audio/b/ukblack021.mp3","content":"Add to word list\nAdd to word list\nB1 to say or think that someone or something did something wrong or is responsible for something bad happening: Don't blame me (= it is not my fault) if you miss the bus! Hugh blames his mother for his lack of confidence. Hugh blames his lack of confidence on his mother.\nThesaurus: synonyms, antonyms, and examples\nto blame someone for somethingblameHe blamed his wife for the error.lay the blame onThe bridge's architect was quick to lay the blame on the engineers.pin the blame onNo one should be looking to pin the blame on others.apportion blameWhen a company fails it isn't always possible to apportion blame.hold someone responsibleIf anything goes wrong, I will hold you responsible.take the blameIf we fail, I'll take the blame.\nSee more results »\nI don't blame someone\nC2 said in order to tell someone that you understand why they are doing something and that you agree with the reason for doing it: I don't blame him for getting angry - she's being really annoying.\nSee more be to blame\nC1 to be the reason for something bad that happens: The hot weather is partly to blame for the water shortage.\nSee more\nMore examplesFewer examplesIt's tempting to blame television for the increase in crime.They blamed their defeat on the media's one-sided reporting of the election campaign.She blamed me for practically every mistake in the report.Human error has been blamed for the air crash.Anything that goes wrong in the office is blamed on Pete.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\ncontributory negligence\nfinger\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nIdiom\na bad workman blames his tools\nB2 the situation in which people say or think that someone or something did something wrong or is responsible for something bad happening: Health officials put the blame for the disease on (= say that the reason for the disease is) poor housing conditions. They tried to pin (= put) the blame for the killing on an innocent army officer. We want to find out what happened, not to apportion blame (= to say someone or something was wrong). take the blame\nIf you take the blame for something, you say that you did it or that it is your fault: If anything goes wrong, I'll take the blame.\nSee more\nMore examplesFewer examplesIt is not the job of the investigating committee to allocate blame for the disaster.The report assigned the blame for the accident to inadequate safety regulations.She can't accept she made a mistake and now she's trying to lay the blame on her assistant.I accept my portion of the blame.Teachers cannot be expected to shoulder all the blame for poor exam results.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\ncontributory negligence\nfinger\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nAdd to word list\nAdd to word list\nto make someone or something responsible for something: You can’t blame the government for all your troubles. you don’t blame someone\nIf you don’t blame someone for something, you understand and accept that person's reasons for it: I don't blame her for not supporting the final budget agreement. blame noun [ U ] us\nYour browser doesn't support HTML5 audio\n/bleɪm/\nHe put the blame on everyone but himself."}