{"id":35659,"name":"blamed","type":"verb","us_sound":"bleɪm","us_link":"../audio/b/blame.mp3","uk_sound":"bleɪm","uk_link":"../audio/b/ukblack021.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nblame\nB1 to say or think that someone or something did something wrong or is responsible for something bad happening: Don't blame me (= it is not my fault) if you miss the bus! Hugh blames his mother for his lack of confidence. Hugh blames his lack of confidence on his mother.\nThesaurus: synonyms, antonyms, and examples\nto blame someone for somethingblameHe blamed his wife for the error.lay the blame onThe bridge's architect was quick to lay the blame on the engineers.pin the blame onNo one should be looking to pin the blame on others.apportion blameWhen a company fails it isn't always possible to apportion blame.hold someone responsibleIf anything goes wrong, I will hold you responsible.take the blameIf we fail, I'll take the blame.\nSee more results »\nI don't blame someone\nC2 said in order to tell someone that you understand why they are doing something and that you agree with the reason for doing it: I don't blame him for getting angry - she's being really annoying. \"I decided to leave.\" \"I don't blame you!\" be to blame\nC1 to be the reason for something that happens: The hot weather is partly to blame for the water shortage.\nThesaurus: synonyms, antonyms, and examples\nbe to blame for somethingbe to blameNo one can decide who is to blame.be at faultBoth the fans and the players were at fault.be someone's faultThis is all my fault.be responsibleWe're still trying to determine who was responsible for the attacks.the blame lies withSome of the blame lies with investors.the blame rests withMuch of the blame rests with the government, which has confused people with conflicting health messages\nSee more results »\nMore examplesFewer examplesIt's tempting to blame television for the increase in crime.They blamed their defeat on the media's one-sided reporting of the election campaign.She blamed me for practically every mistake in the report.Human error has been blamed for the air crash.Anything that goes wrong in the office is blamed on Pete.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing based on or depending on something\nIdiom\na bad workman blames his tools"}