{"id":36004,"name":"bleeding","type":"noun","us_sound":"ˈbliː.dɪŋ","us_link":"../audio/b/cdo1121usblee0611.mp3","uk_sound":"ˈbliː.dɪŋ","uk_link":"../audio/b/ukblank029.mp3","content":"Add to word list\nAdd to word list\nthe process of losing blood from the body: Blood clotting is the body's way to stop bleeding. to stanch/staunch/stem (= stop) the bleeding Some of these remedies can cause internal bleeding.\n(in the past) a treatment for illness that consisted of taking blood from someone or making someone lose blood: Bleeding was one of the most common treatments at that time. The child was taken ill and the doctor recommended bleeding with leeches.\nMore examplesFewer examplesDoctors struggled to stop the bleeding.She rushed over and applied bandages to stanch the bleeding.If the bleeding persists, take the child to a hospital.Millions of Americans pop these pills daily, and complications like stomach bleeding lead to hospitalizations and deaths each year.The condition can cause excessive menstrual bleeding.Treatments typical of 18th-century medicine included bleeding, mercury, powerful laxatives and drugs that induced vomiting (emetics).\nSMART Vocabulary: related words and phrases\nDisorders & diseases of the heart & blood\nacquired agammaglobulinemia\nagammaglobulinemia\nagnogenic myeloid metaplasia\nangina\nanoxia\ndilated cardiomyopathy\nEbstein's anomaly\neconomy-class syndrome\nEisenmenger syndrome\nendocarditis\nfur\nhaemophilia\nlockjaw\nnon-haemolytic\npaediatric thrombocytopenia\npatent ductus arteriosus\npericarditis\nperipheral vascular disease\nRaynaud's disease\nvaricose vein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlternative & traditional therapies\nused when you are annoyed with something: I can't get the bleeding car to start!\nSMART Vocabulary: related words and phrases\nExpressions of anger\nay\nbally\nbeg\nbiscuit\nblast\nblasted\nbloody\ndickens\ndrat\ndratted\negad\nfie\nflaming\nflip\nla\nmarry\nneed\nprecious\nput/stick that in your pipe and smoke it! idiom\nrats\nSee more results »"}