{"id":36001,"name":"bleed","type":"verb","us_sound":"bliːd","us_link":"../audio/b/bleed.mp3","uk_sound":"bliːd","uk_link":"../audio/b/ukblank027.mp3","content":"Add to word list\nAdd to word list\nB1 [ I ] to lose blood: Your arm is bleeding. He was bleeding heavily.\n[ T ] (in the past) to make someone lose blood, as a cure for an illness\n[ T ] If you bleed a closed system such as a radiator or a brake, you remove air or liquid from it to make it work correctly.\n[ I ] If colour, ink, paint, etc. bleeds, it spreads beyond the edges of something onto an area that is another colour: Avoid slow-drying ink because the colours tend to bleed into one another before they've dried. Dyes can sometimes bleed when a rug is cleaned. When we used ordinary paper the colours bled through rather than sitting on top of the page.\nMore examplesFewer examplesShe was found unconscious and bleeding.What's the matter with your hand? It's bleeding.My nose was bleeding and I plugged it with cotton wool.He was bleeding profusely.By now his leg had stopped bleeding.\nSMART Vocabulary: related words and phrases\nDisorders & diseases of the heart & blood\nacquired agammaglobulinemia\nagammaglobulinemia\nagnogenic myeloid metaplasia\nangina\nanoxia\ndefibrillation\ndilated cardiomyopathy\nEbstein's anomaly\neconomy-class syndrome\nEisenmenger syndrome\nfur\nhaemophilia\nhypoglycaemia\nlockjaw\nnon-diabetic\nnon-haemolytic\npaediatric thrombocytopenia\npatent ductus arteriosus\npericarditis\nvaricose vein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlternative & traditional therapies\nBuilding: plumbing, pipes & sewage\nMovement of liquids\nColour - general words\nIdiom\nbleed someone dryPhrasal verb\nbleed out\nAdd to word list\nAdd to word list\nto lose blood: [ I ] Before help could reach him, the man bled to death. [ T ] fig. Because of the taxes, our state is bleeding jobs (= many jobs are leaving).\nAdd to word list\nAdd to word list\nFINANCE, ACCOUNTING to lose a lot of money, or to make this happen: The newspaper is bleeding money and is now almost €150 million in the red.bleed sth from sth The energy crisis is estimated to be bleeding $1.4 billion a month from the region's economy.\nbleed sb/sth dry\ndisapproving to take all or most of the money of a person, organization, country, etc.: Unfair trade bleeds countries dry through repayments of national debts."}