{"id":36039,"name":"blender","type":"noun","us_sound":"ˈblen.dɚ","us_link":"../audio/b/blender.mp3","uk_sound":"ˈblen.dər","uk_link":"../audio/b/ukbleep006.mp3","content":"blender noun [C]\n(MACHINE)\nAdd to word list\nAdd to word list\n(UK also liquidizer) an electric machine used in the kitchen for breaking down foods or making smooth liquid substances from soft foods and liquids: Put the roasted pumpkin into a blender with a cup of coconut milk.\nmammamaart/Vetta/GettyImages\nMore examplesFewer examplesTo make the dressing, pulse the oil, vinegar, mustard and herbs in a blender.Blend the soup in a blender until you have a smooth texture.Whizz the berries, honey and lemon juice together in a blender with some ice.I didn't have a blender so I just mashed it with a fork.\nSMART Vocabulary: related words and phrases\nKitchen appliances\nAga\nair fryer\nbroiler\ncafetière\ncirculator\ngas mark\ngriddle\ngrinder\nhalogen hob\nhand blender\nmeat grinder\nmincer\nmulticooker\noven\noven hood\nstove hood\nstovetop\nteakettle\ntoaster\ntoaster oven\nSee more results »\nblender noun [C]\n(CREATOR)\na person or company that blends (= combines) different ingredients or types of something to make a product such as wine, tea, or perfume: Dom Perignon was a monk from Champagne who gained fame as a master blender. The firm is a blender and importer of tea.\nsomeone who combines different things or styles: She is known as a blender of country music and jazz.\nMore examplesFewer examplesPerfume blenders take flowers from several successive years to combine them into a blend that smoothes out the variations between the seasons.The blender will make up a trial blend, say 60 c.c. of one wine, 25 c.c. of another, and 80 c.c. of another. He has been in the whisky trade for 40 years, working for 12 years as a blender for Chivas Regal.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblitz\nbrew\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nhybridize\nmethylate\nmingle\nmosaic\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWines & winemaking\nDrinks - general words\nAdd to word list\nAdd to word list\nan electric machine that cuts or crushes foods into small pieces or liquids, used esp. in cooking"}