{"id":36035,"name":"blend","type":"noun","us_sound":"blend","us_link":"../audio/b/blend.mp3","uk_sound":"blend","uk_link":"../audio/b/ukbleep004.mp3","content":"Add to word list\nAdd to word list\nC2 a mixture of different things or styles: a rich blend of the finest coffee beans Their music is a blend of jazz and African rhythms.\na word formed by combining two other words: \"Meritage\" is a blend that combines \"merit\" and \"heritage\". Synonym\nportmanteau word\nMore examplesFewer examplesThe building's design is an interesting blend of traditionalism and modernism.The label says that it's a blend of fine Scottish malt whiskies.Is this made of pure wool or a wool blend of some sort?This body lotion contains a soothing blend of camomile and lemongrass.Her new album is a refreshing blend of contemporary and traditional songs.These terms are blends from the word \"engineer\".\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend in/blend into something\nblender\nblitz\nbrew\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nhybridize\nmethylate\nmingle\nmosaic\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistic terms & linguistic style\nto mix or combine things together, or to mix or combine with something else, to make one substance: In a separate bowl, blend the egg and cream. Stir until the flour is blended into the butter. Emulsifiers help the mixture to blend. Synonyms\ncombine\nintermingle\nto combine with something else in a way that is attractive or works well, or to combine things like this: The carpet blends well with the colour of the walls. They seamlessly blend elements of jazz and classical music.\nto make something into a smooth liquid, or chop it into small pieces, using an electric machine: When the vegetables are soft, blend the soup until smooth. Blend the peppers in a liquidizerblender. Put the nuts and herbs in a blender and blend coarsely. Related word\nblender\nMore examplesFewer examplesBlend the cream cheese with the vanilla and icing sugar.You can buy ready-made spice blends but I prefer to blend the spices myself.The way all the flavours blend in the soup is divine.The building's three wings blend harmoniously, despite having been designed by three different architects.Coarsely chop or blend the walnuts and sprinkle on top.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend in/blend into something\nblender\nblitz\nbrew\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nhybridize\nmethylate\nmingle\nmosaic\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCookery terms\nConnecting and combining\nPhrasal verb\nblend in/blend into something\nAdd to word list\nAdd to word list\nto mix together or combine: [ I ] The president’s daughter hopes to blend in with the other students. blend noun [ C ] us\nYour browser doesn't support HTML5 audio\n/blend/\nHis books are a blend of journalism and history."}