{"id":36386,"name":"blocking","type":"noun","us_sound":"ˈblɑː.kɪŋ","us_link":"../audio/b/cdo0123usbloc0316.mp3","uk_sound":"ˈblɒk.ɪŋ","uk_link":"../audio/b/cdo0123ukbloc0518.mp3","content":"blocking noun [U]\n(PREVENTING)\nAdd to word list\nAdd to word list\nthe action or fact of preventing something such as light, air, or a moving object from passing through a place: He is responsible for dealing with parking violations such as blocking of driveways. The structure will be largely built from glass in order to minimize the blocking of bay views. See also\nbed-blocking\nthe act of preventing something from happening or succeeding: The blocking of legislation was a deliberate strategy. See also\nad blocking\nMore examplesFewer examplesIf asbestos is inhaled it can lead to a blocking of the lungs with scar tissue.He was considering a trade law that could result in the blocking of imports or levying of tariffs.He was notorious for his mocking of the United Nations and blocking of treaties.They said that the web blocking software did not work well and violated free-speech rights.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncork\ndam\ndam something up\nensconce\nensconced\ngum\nseal something in\nseal something off\nself-seal\nself-sealing\nshut\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nblocking noun [U]\n(SPORT)\nin American football, the act of moving in front of opponents and pushing them back so that the player with the ball can carry it forwards more easily: As a college player he was best known for his blocking. His blocking skills help the team's running game. Related word\nblock\nMore examplesFewer examplesTo become a complete player, he will have to improve his blocking.Some fine blocking set up James to run for over a hundred yards in the first half.He does not catch a lot of passes, but his blocking is outstanding.\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\ncarry\ncarry the ball idiom\nchain\nconversion\nfullback\nhuddle\nlinebacker\noffence\noutgain\noutkick\npick\nplace-kick\nrush\nscramble\nsplit end\nSuper Bowl\ntouchdown\nSee more results »\nblocking noun [U]\n(THEATRE)\ntheatre &amp; film\n&#160; specialized the way that actors are arranged physically on a stage or film set: The long, narrow stage creates some awkward blocking—performers sometimes have to repeat things so both sides of the house can see them. The actors already know their lines; they’re here to learn blocking and refine their delivery.\nMore examplesFewer examplesThe rehearsal space is only half the size of the theatre stage, which causes serious difficulties for blocking and staging.The stage blocking was done in a peculiar, old-fashioned style that didn't flow easily from one event to another.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nappearance\ncamp\nchew\nchew the scenery idiom\ncome on\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\ntread\nunderstudy\nvoice acting\nwalk\nwalk through something\nwalkthrough\nSee more results »"}