{"id":36368,"name":"blocker","type":"noun","us_sound":"ˈblɑː.kɚ","us_link":"../audio/b/cdo0123usbloc0315.mp3","uk_sound":"ˈblɒk.ər","uk_link":"../audio/b/cdo0123ukbloc0517.mp3","content":"blocker noun [C]\n(PREVENTING STH)\nAdd to word list\nAdd to word list\nsomething or someone that prevents something from happening or succeeding: I've installed an ad blocker so I don't get all those annoying adverts popping up when I'm browsing. The school needs to identify staff who are blockers of progress. See also\nbed blocker\nsomething that prevents something from passing through it to reach a place: Titanium and zinc are effective blockers of ultraviolet radiation.\nmedical\n&#160; specialized a substance or medicine that stops a particular process from happening in the body: Calcium channel blockers help control an irregular heart beat. To test whether opiates were responsible for the effects, researchers gave subjects an opiate receptor blocker. See also\nbeta blocker\nMore examplesFewer examplesWe need to identify the blockers to the project succeeding and address them urgently.Democrats hope to gain control of the Senate, which is the main blocker of legislation.They developed a technological blocker to prevent the show from being aired via satellite in some countries.This sun cream contains effective UVA and UVB blockers.The drug is an effective acid blocker to help relieve indigestion.Calcium-channel blockers obstruct the tiny ducts in cells through which calcium ions must pass to constrict blood vessels.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClosing and blocking\nMedicines & drugs\nblocker noun [C]\n(IN SPORTS)\nsports\n&#160; specialized in American football, a player who stops players from the other team from reaching the player carrying the ball: His size and speed made him both an excellent blocker and a useful offensive player. He was so good at sacking the quarterback that teams sometimes used as many as three blockers to keep him away.\nsports\n&#160; specialized in ice hockey (= a game played on ice), a large, thick piece of material worn on the hand and arm of a goaltender (= the player who stands in the team's goal to try to stop the other team from scoring): Right-handed goaltenders will wear the blocker on the right hand. The puck bounced clear off the goalie's blocker.\nMore examplesFewer examplesAlthough he received the glory of scoring touchdowns, he would always go out of his way to give credit to his blockers.\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocking\ncarry\ncarry the ball idiom\nchain\nconversion\nfullback\nhuddle\nlinebacker\noffence\noutgain\noutkick\npick\nplace-kick\nrush\nscramble\nsplit end\nSuper Bowl\ntouchdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHockey"}