{"id":36366,"name":"blockbusting","type":"adjective","us_sound":"ˈblɑːkˌbʌs.tɪŋ","us_link":"../audio/b/cdo1119usbloc0115.mp3","uk_sound":"ˈblɒkˌbʌs.tɪŋ","uk_link":"../audio/b/cdo1119ukbloc0102.mp3","content":"Add to word list\nAdd to word list\n(usually of a book or film) very successful or popular and making a lot of money: He was the director of photography behind the blockbusting Indiana Jones movies. The search for the next blockbusting writer continues.\nMore examplesFewer examplesMeryl Streep proved that she could dance and she could jive in the blockbusting adaptation of the hit Abba musical. Millions watched blockbusting BBC nature series \"Planet Earth\".He wrote a blockbusting novel about a politician who falls from grace.The rise in pre-tax profit to £51m yesterday was perhaps not blockbusting, but not bad.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nhigh-flying\npocket\nrail\nrepresent\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nsuperseller\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nthe practice of persuading people in an area to sell their homes cheaply by making them afraid that their value is going to fall, for example by suggesting that new people from a different social group or race are moving into the area: She remembers blockbusting being used to scare homeowners into selling. We will protect property from being greatly devalued in a real estate blockbusting scheme.\nMore examplesFewer examplesIn Chicago, where she grew up, she witnessed \"blockbusting\" - a tactic used to get white homeowners to sell out of fear that their neighborhood is becoming integrated and their homes are losing value.This reminds me of the \"blockbusting\" used in some large cities in the past.Combating unwanted real estate blockbusting solicitations has become a top priority for many Rockland officials and communities.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nencumbrance\nequity\nfirst-time buyer\nlandlady\nletting\nplanning blight\nreal estate broker\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossession\nreverse mortgage\nSee more results »\nAdd to word list\nAdd to word list\nused to describe a very successful product, film, etc. that makes a lot of money: a blockbusting Hollywood action comedy"}