{"id":36354,"name":"blockade","type":"noun","us_sound":"blɑːˈkeɪd","us_link":"../audio/b/blockade.mp3","uk_sound":"blɒkˈeɪd","uk_link":"../audio/b/ukbliss018.mp3","content":"Add to word list\nAdd to word list\nthe situation in which a country or place is surrounded by soldiers or ships to stop people or goods from going in or out: an air and sea blockade The Soviet blockade of Berlin was lifted in May 1949. There is still some hope that the economic blockade will work and make military intervention unnecessary.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nincursion\nkamikaze\npre-emption\nprivateer\nraid\nreconquer\nreconquest\nSee more results »\nto surround a country or place with soldiers, ships, etc. to stop people or goods from going in or out: The Estonian port of Tallinn was blockaded for a time by Soviet warships. Fishermen began blockading ports to protest the high cost of diesel fuel.\nMore examplesFewer examplesThe army blockaded all roads in and out of the region.Protesters have blockaded airports to prevent the president from travelling.Farmers blockaded oil depots or drove their tractors slowly through the streets of cities.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nincursion\nkamikaze\npre-emption\nprivateer\nraid\nreconquer\nreconquest\nSee more results »\nAdd to word list\nAdd to word list\nthe act of using force or the threat of force to stop the movement of people or goods into or out of a country or area, or the people or objects used to prevent such movement: The blockade consisted of a dozen ships surrounding the port. blockade verb [ T ] us\nYour browser doesn't support HTML5 audio\n/blɑˈkeɪd/\nThe army blockaded roads leading into the city.\nAdd to word list\nAdd to word list\na situation in which a group of people prevent goods or people entering or leaving a place as a way of showing a government or large organization that they do not agree with its decisions: The blockade of oil refineries caused fuel prices to double.impose/lift a blockade French farmers lifted their blockade of the Channel Tunnel yesterday.\na situation in which one country refuses to trade with another country: It has defended the economic blockade despite mounting international criticism.\nto prevent goods or people entering or leaving a place, especially as a way of showing disagreement with a government or large organization: Protesters are threatening to blockade refineries if the Government does not lower the tax on fuel."}