{"id":36353,"name":"block","type":"noun","us_sound":"blɑːk","us_link":"../audio/b/bloc.mp3","uk_sound":"blɒk","uk_link":"../audio/b/ukbliss017.mp3","content":"block noun\n(AREA)\nAdd to word list\nAdd to word list\nA2 [ C ] mainly US the distance along a street from where one road crosses it to the place where the next road crosses it, or one part of a street like this, especially in a town or city: The museum is just six blocks away. My friend and I live on the same block.\nAbstract Aerial Art/DigitalVision/GettyImages\nA2 [ C ] a square group of buildings or houses with roads on each side: I took a walk around the block. round/around the block\non the next street that crosses this street: He lives just around the block.\nSee more\nMore examplesFewer examplesThe queue for tickets snaked all the way around the block.He went for/took a walk around the block, to get some air.She drove the car round the block to charge (up) its batteries.She likes to roll out the welcome wagon for everyone who moves onto the block.He was found slain in an alley two blocks from his apartment.\nSMART Vocabulary: related words and phrases\nTowns & regions: areas in towns & cities\nanti-development\narrondissement\nbackstreet\nbackstreets\nborough\nbotanic garden\nbusiness park\nChinatown\nindustrial estate\nmarketplace\nold town\non skid row idiom\nouter ring\nplaza\nresidential\nshantytown\nskid\nslummy\nsubdivision\nWimbledon\nSee more results »\nblock noun\n(PIECE)\nB2 [ C ] a solid, straight-sided piece of hard material: a block of wood/ice\nkoya79/iStock/Getty Images Plus/GettyImages the block [ S ]\n(in the past) a large piece of wood on which criminals had their head cut off: Anne Boleyn went to (= was killed on) the block.\nMore examplesFewer examplesa 200 kilo block of concreteThey cut enormous blocks of stone out of the hillside.The blocks of stone had to be lifted into position with a system of pulleys.When a glacier meets the sea, large blocks of ice may break off and float away as icebergs.Hollow blocks are used because they are lighter.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath penalties\nblock noun\n(BUILDING)\nB1 [ C ] a large, usually tall building divided into separate parts for use as offices or homes by several different organizations or people: an office blockUK a tower blockUK a block of flats\nNirian/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBuildings in general\n-bedroomed\nbeach hut\nbuilding\nbunkhouse\ncampanile\nfour-square\ngeodesic dome\nhalf-timbered\nheritage\nheritage-listed building\nnew-build\nnon-residential\nnon-structural\nNorman\nobservation tower\nstructurally\nstructure\ntower\nturreted\nwarren\nSee more results »\nblock noun\n(GROUP)\n[ C ] a group of things bought, dealt with, or considered together: a block of tickets/seats/shares Corporate hospitality firms make block bookings (= buy large numbers of seats) at big sporting events.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nblock noun\n(OBJECT BLOCKING)\nC2 [ C usually singular ] something that blocks a tube or opening: A block in (= an object blocking) the pipe was preventing the water from coming through. Synonym\nblockage\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncongest\ncork\ndam\ndam something up\nensconce\nfur\nsandbag\nseal something in\nseal something off\nself-seal\nself-sealing\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nblock noun\n(IN SPORT)\nin sport, the act of stopping an opponent or the ball from moving forwards: The defender made a lunging block.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nBasketball, netball & volleyball\nIdioms\ngo on the block\nhave/put your head on the block\nB2 to prevent movement through something: A fallen tree is blocking the road. As she left the court, an angry crowd tried to block her way.\nC1 to be between someone and the thing they are looking at, so that they cannot see: My view was blocked by a tall man in front of me.\nC2 to stop something from happening or succeeding: She was very talented and I felt her parents were blocking her progress. A group of politicians blocked the proposal.\nin sport, to stop an opponent or the ball from moving forwards: Nobody blocked him as he ran into the open space. She jumped up and blocked the shot.\nIf a bank blocks someone's account, they make it impossible for that person to remove money from it: Federal agents blocked the accounts of five money-transfer operations in the city.\nto stop emails, text messages, phone calls, etc. from being received: The carriers said they have rigorous filters to block spam, and they allow customers to block messages from certain numbers. Prosecutors say Wilson allegedly made the calls from a blocked phone number.\non social media, to stop a particular person from being able to communicate with you or read what you have written: My mom found out that I blocked her on Twitter and gave me another serious talk. In the Block Users section you should see a list of people you've blocked. Someone you’ve blocked won’t be able to add you to a group.\nMore examplesFewer examplesIn theory the British government could use its veto to block this proposal.The road is open now, but it is often blocked by snow in the winter.The dense foliage overhead almost blocked out the sun.From the smell it was evident that the drains had been blocked for several days.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprejudice\nprevent\npreventable\npreventative\nprevention\nscuttle\nsmother\nsuffocate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClosing and blocking\nBetween\nStaying and remaining\nGeneral terms used in ball sports\nAmerican football\nBasketball, netball & volleyball\nBanks\nCommunications - general words\nInternet terminology\nRelated word\nblockedPhrasal verbs\nblock something/someone in\nblock something off\nblock something out\nblock something up\nblock noun [C]\n(AREA OF A CITY)\nAdd to word list\nAdd to word list\nthe buildings next to each other between crossing streets, or the distance from one street to the next in a city or town: There’s a good deli on this block.\nA block is also an area enclosed by four streets that form a rectangle in a city or town: The new building will take up an entire city block.\nblock noun [C]\n(LUMP)\na solid, straight-sided lump of hard material: The warehouse stores building material, including cement blocks.\nA block is also a child’s toy, usually a set of pieces of wood that can be arranged to make structures, walls, etc.\nblock noun [C]\n(GROUP)\na group of things considered together, or an amount of something: a block of tickets/seats a block of time\nblock verb [T]\n(PREVENT)\nto prevent movement through or past something, or to prevent something from happening or succeeding: A fallen tree blocked the road. A large man in front of me blocked my view. Earl scored 28 points and blocked five shots. Congress blocked US aid to the government because of its segregation and human rights policies. Phrasal verbs\nblock out something\nblock out something\nAdd to word list\nAdd to word list\nto decide officially to stop something from happening or continuing: The federal government's fight to block a bankruptcy settlement was rejected by the Supreme Court.block a bid/deal/merger The Federal Trade Commission said it planned to block the merger.\nBANKING if a bank blocks someone's account, they make it impossible for that person to remove money from it: Accounts of all suspected terrorists have been blocked.\nCOMMUNICATIONS to stop emails, text messages, phone calls, etc. from a particular person: The new phone allows users to block messages from particular senders.\nSTOCK MARKET a large number of shares that are sold by one organization at a particular time: Deutsche Bank placed a block of six million shares at 781p. The shares were sold on the Toronto Stock Exchange in a block trade.\nECONOMICS an official decision to stop something happening or continuing: a block on sth Lobbyists are calling for a block on bonuses to rail operators while their safety record is so poor.put/remove a block on sth The government has put a block on all arms sales to the country.\nPROPERTY a building consisting of several apartments, offices, etc.: There are four apartments in each block. a block of office buildings\non the block US\navailable to buy: She offers a beginner's guide to the newest pensions on the block. A few more newspapers may go on the block before the end of the year.\nlay your head/neck on the block\nto risk a bad thing happening to you, for example getting a bad reputation, by doing something or helping someone: Agency executives willing to lay their heads on the block in a pure results-driven agreement would be very brave."}