{"id":36443,"name":"bloody","type":"adjective","us_sound":"ˈblʌd.i","us_link":"../audio/b/bloody.mp3","uk_sound":"ˈblʌd.i","uk_link":"../audio/b/ukblood013.mp3","content":"Add to word list\nAdd to word list\nC2 used to express anger or to emphasize what you are saying in a slightly rude way: I've had a bloody awful week. It's a bloody disgrace that some war widows don't get a decent pension. Don't be a bloody idiot! This computer's bloody useless! It's always going wrong. Don't you tell me what to do! I'll do what I bloody well like in my own house. I had a bloody good time last night. Life would be bloody boring if nothing ever went wrong.\nMore examplesFewer examplesThat sod Wilkins, excuse my French, has taken my bloody parking space.You stupid bloody fool!You trod on my bloody foot!That car's been nothing but bloody trouble since I got it.How did Pearson make the team? He's bloody useless.\nSMART Vocabulary: related words and phrases\nExpressions of anger\nay\nbally\nbeg\nbiscuit\nblast\nblasted\nblooming\ndickens\ndoggone\ndrat\ndratted\negad\nfie\nflaming\njust my luck! idiom\nla\nmarry\nneed\nprecious\nput/stick that in your pipe and smoke it! idiom\nSee more results »\nIdiom\nbloody hell\nB2 covered with or full of blood: a bloody nose\nC1 extremely violent and involving a lot of blood and injuries: It was a long and bloody battle and many men were killed.\nThesaurus: synonyms, antonyms, and examples\nviolentviolentHer ex-boyfriend was violent.aggressiveShe was very aggressive towards the TV reporters.ferociousA ferocious dog guarded the house.fierceThe battle for the stronghold was fierce, with hundreds of soldiers killed.savageIt was a savage attack.brutalHe was jailed for the brutal crime.\nSee more results »\nMore examplesFewer examplesThere is a danger that America's metaphoric 'war on drugs' may turn into a bloody reality.A bloody civil war followed the proclamation of an independent state.He told the doctor he had been passing bloody stools.This is the latest act of terrorism in a long-standing and bloody campaign of violence.The songs describe the bloody battles between the clans.\nSMART Vocabulary: related words and phrases\nDisorders & diseases of the heart & blood\nacquired agammaglobulinemia\nagammaglobulinemia\nagnogenic myeloid metaplasia\nangina\nanoxia\ndefibrillation\ndilated cardiomyopathy\nEbstein's anomaly\neconomy-class syndrome\nEisenmenger syndrome\nfur\nhaemophilia\nhypoglycaemia\nlockjaw\nnon-diabetic\nnon-haemolytic\npaediatric thrombocytopenia\npatent ductus arteriosus\npericarditis\nvaricose vein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nViolent or aggressive\nRelated word\nbloodily\nto make something bloody: The first punch bloodied his nose.\nSMART Vocabulary: related words and phrases\nDirty & untidy\nall over the place idiom\nAugean\nbesmeared\nbespattered\nbloodied\nlook like something the cat brought/dragged in idiom\nlook like/as if you've been dragged through a hedge backwards idiom\nmanky\nmessily\nmessy\nslovenly\nsluttish\nsluttishly\nsoiled\nsordid\nunsterile\nunsterilized\nuntidily\nuntidy\nuntrimmed\nSee more results »\nRelated word\nbloodied\nAdd to word list\nAdd to word list\nshowing blood or losing blood: I had a bloody nose.\nBloody also means with much loss of life and many serious injuries: The Civil War was a very bloody war."}