{"id":36420,"name":"blood","type":"noun","us_sound":"blʌd","us_link":"../audio/b/blood.mp3","uk_sound":"blʌd","uk_link":"../audio/b/ukbliss026.mp3","content":"blood noun [U]\n(LIQUID)\nAdd to word list\nAdd to word list\nA2 the red liquid that is sent around the body by the heart, and carries oxygen and important substances to organs and tissue, and removes waste products: lose blood He lost a lot of blood in the accident.dried blood She pointed to a patch of dried blood on the carpet. give/donate blood\nto allow a trained person to take some blood from your body so that it can be stored and is ready to be given to people who have lost a lot of blood in an accident or operation: Essentially, giving blood is about saving lives.\nSee more bloods [ plural ] informal\nan informal word for blood tests (= scientific examinations of a person's blood to find out if they have any diseases or lack any important substances): We go around the ward and do routine bloods in the morning. A nurse came in to take his bloods. I went to see the doctor and she ordered some bloods. My bloods came back normal.\nMore examplesFewer examplesThe teacher drew a diagram showing how the blood flows through the heart.The appeal for people to donate blood was very successful.She lost a lot of blood in the accident.The police found traces of blood on his jacket.The sight of so much blood made him shudder.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanterograde\nanti-platelet\nblood donor\nblood vessel\ncapillary\nclot\nimmunoglobulin\nintravascular\nintravenously\njugular\njugular vein\nplatelet\nvasoactive\nvasoconstriction\nvasodilation\nVEGF\nveined\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nblood noun [U]\n(FAMILY)\nC2 family relationship by birth rather than marriage: by blood They are related by blood. She has Russian blood (= one or more of her relatives was Russian).\nThesaurus: synonyms, antonyms, and examples\nyour ancestorsancestorI discovered that one of my ancestors was a member of King Henry VIII's court.forebearMy forebears were enslaved and brought to this country.forefatherI visited the land of my forefathers.ancestryDNA tests tell me that I have Central Asian ancestry.extractionMy family is of Italian extraction.family treeSince many families will be gathering for the holiday, it's a perfect time to create a family tree.\nSee more results »\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\nSee also\nbe (only) flesh and blood\nsomeone's (own) flesh and bloodIdioms\nbe after someone's blood\nbe in the/someone's blood\nblood and guts\nblood is thicker than water\nsomeone's blood is up\nget blood out of/from a stone\nhave (someone's) blood on your hands\nblood, sweat, and tears\nmake someone's blood boil\nmake someone's blood run cold\nMore idioms\nnew/fresh blood\nto give someone their first experience of something: They decided to blood him in the international team at the age of only 18.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nblood noun [U]\n(LIQUID)\nAdd to word list\nAdd to word list\nthe red liquid that is sent around the body by the heart and that is necessary for life: He lost a lot of blood in the accident.\nblood noun [U]\n(RELATIONSHIP)\na person’s relationship to a family or a nation by birth rather than by marriage: They are related by blood. She has Russian blood in her veins.\nblood adjective [not gradable]\n(RELATED)\nrelated by birth: blood relatives a blood brother"}