{"id":36610,"name":"blower","type":"noun","us_sound":"ˈbloʊ.ɚ","us_link":"../audio/b/cdo1121usblow0622.mp3","uk_sound":"ˈbləʊ.ər","uk_link":"../audio/b/cdo1121ukblow0692.mp3","content":"blower noun [C]\n(BLOWING AIR)\nAdd to word list\nAdd to word list\na device that blows out air, for example to heat or cool a place, or to remove something from a place: Turn the heater control to hot, and set the blower to medium/high speed. Use the blower to collect the leaves into piles. See also\nsnow blower\nleaf blower\na person who blows air down a tube to shape heated glass into objects: When the blower is attaching bases to wine glasses, the stem will slide off if the glass is too hot, and won't stick if it's too cold. Synonym\nglassblower\nMore examplesFewer examplesA fire official said that the blowers that remove smoke from the building weren't working.The car was freezing so we rolled up the windows and put the blowers on high. He switched on the blower and a stream of warm air gushed out at them.Track workers used blowers and sweepers to try to get the loose materials off the track before the race.The agency had dispatched about 115 workers with 35 ploughs, blowers and snow-clearing trucks.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\ncrankshaft\nflywheel\ngenerator\nHeath Robinson\nhoist\nmill\nshredder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\ntelerobotics\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGlass\nblower noun [C]\n(PHONE)\nthe blower UK old-fashioned informal\nthe telephone: I had Charles on the blower this morning. Get on the blower and complain.\nMore examplesFewer examplesShe was straight on the blower telling me all about it.He used the blower to speak those immortal words to his assistant in the next room: \"Watson, come here, I want you.\"His habit of making nocturnal calls will mean the blower waking the household even before the milkman has called.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nbrick\nburner\ncaller ID\ncell phone\ndevice\ndumbphone\next.\nextension\nplatform\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nspeed dial\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nthe phone: Get on the blower and invite him round.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nbrick\nburner\ncaller ID\ncell phone\ndevice\ndumbphone\next.\nextension\nplatform\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nspeed dial\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »"}