{"id":36599,"name":"blow","type":"verb","us_sound":"bloʊ","us_link":"../audio/b/blow.mp3","uk_sound":"bləʊ","uk_link":"../audio/b/ukblood028.mp3","content":"blow verb\n(SEND OUT AIR)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to move and make currents of air, or to be moved or make something move on a current of air: blow away The letter blew away and I had to run after it.blow something down A gale-force wind had blown the fence down . The wind was blowing harder every minute. I blew the dust off the books. I wish you wouldn't blow smoke in my face.\nC2 [ I or T ] to make a sound by forcing air out of your mouth and through an instrument, or to make a sound when someone does this: Ann blew a few notes on the trumpet. He scored the winning goal just before the whistle blew.\n[ T ] to blow air down a tube into a piece of heated soft glass, in order to shape it into an object: a beautiful blown glass vase blow your nose\nB1 to force air from your lungs and through your nose to clear it: Remember to wash your hands after you blow your nose.\nSee more blow someone a kiss (also blow a kiss to/at someone)\nto kiss your hand and blow on it in the direction of someone: As I finished my speech, she blew me a kiss from the audience.\nSee more\nMore examplesFewer examplesTo play the recorder, blow gently into the mouthpiece.A light wind was blowing.The storm uprooted trees and blew fences down.Strong winds blew the ship ashore.The referee blew his whistle for half-time.\nSMART Vocabulary: related words and phrases\nWind & winds\nanemometer\nblast\nchinook\ncrosswind\ncyclonic\neasterly\njet stream\nleeward\nnorthwesterly\nsea breeze\nsigh\nslipstream\nsquall\nstiff\nthe Coriolis effect\ntornado\nweathervane\nwindblown\nwindswept\nwuthering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlaying music\nGlass\nblow verb\n(DESTROY)\n[ T ] to cause something to be destroyed by a bomb, technical failure, etc.: His car had been blown to pieces.\n[ I or T ] If an electrical fuse (= a short, thin piece of wire) blows, or if something electrical blows a fuse, the device it is in stops working because it is receiving too much electricity.\n[ I ] informal If a tyre blows, it suddenly gets a hole in it and goes flat. blow something sky-high\nto seriously damage something by making it explode: The explosion blew the building sky-high.\nSee more\nMore examplesFewer examplesThere was an overload on the electrical circuit and the fuse blew.My hairdrier's stopped working - I think the fuse has blown.The car was blown to bits.So many films nowadays involve everyone and everything being blown to smithereens.There was a picture in the paper of a man whose leg had been blown off.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\ncostly\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nsink\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExploding and erupting\nblow verb\n(SPEND)\n[ T ] informal to spend a large amount of money, especially on things that are not really necessary: When I got paid I blew it all on a night out.\nThesaurus: synonyms, antonyms, and examples\nto spend moneyspendHow much do you intend to spend on a house?payWhen you bought the tickets, how much did you pay?investShe's invested all her savings in the business.pay outI've just paid out £700 to get the car fixed.splurgeWe've just splurged on new kitchen appliances.blowWe won a £15 million settlement in court and we blew it all in six years.\nSee more results »\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nlash out (something)\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nIdioms\nbe blowed if...\nblow (it)!\nblow someone's brains out\nblow someone's cover\nblow your lid/top/stack\nblow something/someone out of the water\nblow someone's mind\nblow your own trumpet/horn\nblow a fuse/gasket\nblow hot and cold\nMore idioms\nblow it\nblow smoke up someone's arse\nblow the cobwebs away\nblow the gaff\nblow the whistle on someone/something\nI'll be blowed!\nPhrasal verbs\nblow someone away\nblow someone/something away\nblow something/someone off\nblow (something) out\nblow someone out\nblow over\nblow (someone/something) up\nblow something up\nblow up\nblow noun\n(HIT)\nC2 [ C ] a hard hit with a hand or a weapon: a sharp blow to the stomach\nMore examplesFewer examplesThe blow caught him right on the bridge of his nose.He planted a blow on his opponent's jaw.The police said that it was the blow that had been delivered to her head that had killed her.Feeling muzzy from the blow on his head, he got up very slowly.She died after receiving a blow to the head.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nblow noun\n(BAD EVENT)\nC2 [ C ] an unexpected event that has a damaging effect on someone or something: Losing his job was a severe blow to his confidence. Her death came as a terrible blow to her parents.\nMore examplesFewer examplesThe news came as a crushing blow.He's lost his job, but the redundancy money will cushion the blow.The latest trade figures have dealt a severe blow to hopes of an early economic recovery.The news came as a shocking blow.The latest opinion polls have administered a severe blow to the party.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nchill\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\nSee more results »\nblow noun\n(AIR)\n[ C usually singular ] an act of blowing: a blow on the trumpet It took him three blows to get all the candles out.\n[ C usually singular ] UK old-fashioned a walk in the fresh air: Shall we go out for a blow?\nSMART Vocabulary: related words and phrases\nNoises made by the body\nbelch\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnorer\nsnoring\nsnort\nwheeze\nwind\nyawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving gently on foot\nblow noun\n(DRUG)\n[ U ] UK slang →\ncannabis\n[ U ] US slang →\ncocaine\nSMART Vocabulary: related words and phrases\nSpecific types of drug\nalprazolam\namnesiac\namyl nitrite\nanaphrodisiac\nanti-AIDS\nanti-aphrodisiac\naphrodisiac\ncaffeine\ndesigner drug\nE, e\necstasy\ngas and air\nGHB\nkhat\nlegal high\nLSD\npep pill\npopper\nroach\nsmack\nSee more results »\nIdiom\ncome to blows\nblow verb [I/T]\n(MAKE AIR CURRENT)\nAdd to word list\nAdd to word list\nto make a current of air, or to move something or be moved with a current of air: [ M ] The wind blew over a garbage can (= pushed it down on its side). [ M ] We brought in the birthday cake and watched Lisa blow out the candles.\nTo blow up something is to push air inside it to make it larger: [ M ] We blew 12 balloons up for Charles’ party.\nIf you blow your nose, you force air through it to push out something that is blocking it, so that you can breathe better.\nblow verb [I/T]\n(DESTROY)\nto destroy something in an explosion or to be destroyed in this way: [ T ] The gas explosion blew a huge hole in the ground. [ M ] The explosion from the gas leak blew all the windows out.\ninfml To blow a sum of money is to spend it in a foolish way: [ T ] I blew my first paycheck on a night out with my friends. Idioms\nblow it\nblow your mind\nblow off steam\nblow something out of proportion\nblow the lid off something\nblow the whistle on\nsoften the blowPhrasal verbs\nblow away someone\nblow away someone\nblow off something/someone\nblow over\nblow up\nblow up something\nblow noun [C]\n(HIT)\na hard hit with the hand or a weapon: A sharp blow on the chest sent him spinning to the floor.\nA blow is also an unexpected, harmful event: Her death at twenty was a terrible blow to her parents.\nIf people come to blows, they physically fight: The brothers almost came to blows over sharing the car.\nAdd to word list\nAdd to word list\nto spend a lot of money on something that is not important or effective: Central Bank blew $900m of foreign-exchange reserves in the first two weeks of October alone.\nblow the whistle (on sb/sth)\nto tell someone in authority about something harmful or illegal that someone is doing: If two of the firm's employees hadn't blown the whistle, the scandal would never have become known.\nblow the lid on/off sth\nto tell people the real and unpleasant facts about something that were previously not known: The report blew the lid on the culture of secrecy surrounding the company's new range of fizzy-drink products.\nblow a hole in sth\nto cause serious harm or damage to something: Defeat would blow a hole in the club's finances.\nsomething that causes serious problems or spoils your chances of success: be a blow to sth The loss of 1000 jobs is another blow to the country's manufacturing sector.come as a blow (to sb/sth) Unemployment figures will come as a blow to the Chancellor as he prepares next week's budget.deal/deliver a blow (to sb/sth) Rising pollution levels threaten to deal a blow to the state's billion-dollar tourism industry.a major/devastating/bitter blow We have suffered a major blow.\nsoften/cushion the blow\nto make the bad effects of something seem to be not as bad as they could have been: If things go wrong there are no mechanisms to soften the blow."}