{"id":36870,"name":"blur","type":"noun","us_sound":"blɝː","us_link":"../audio/b/blur.mp3","uk_sound":"blɜːr","uk_link":"../audio/b/ukblunt003.mp3","content":"Add to word list\nAdd to word list\nsomething that you cannot see clearly: If I don't wear my glasses, everything is just a blur.\nsomething that you cannot remember or understand clearly: It all happened so long ago that it's just a blur to me now. The last few days seem to have gone by in a blur.\nSMART Vocabulary: related words and phrases\nIndistinct & invisible\nblurred\nblurrily\nblurry\ncloudily\nfuzzily\nfuzziness\nfuzzy\ninvisibly\nmelt (away) into something\nnot see hide nor hair of someone idiom\nsmudged\nsuper-subtle\nswimmy\nunclear\nunseen\nvague\nvaporous\nvapory\nviewless\nwashy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForgetting and forgetfulness\nto (make something or someone) become difficult to see clearly: As she drifted into sleep, the doctor's face began to blur and fade.\nto make the difference between two things less clear, or to make it difficult to see the exact truth about something: This film blurs the line/distinction/boundary between reality and fantasy.\nSMART Vocabulary: related words and phrases\nIndistinct & invisible\nblurred\nblurrily\nblurry\ncloudily\nfuzzily\nfuzziness\nfuzzy\ninvisibly\nmelt (away) into something\nnot see hide nor hair of someone idiom\nsmudged\nsuper-subtle\nswimmy\nunclear\nunseen\nvague\nvaporous\nvapory\nviewless\nwashy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPuzzle and confuse\nAdd to word list\nAdd to word list\nsomething whose shape is not clear\nA blur is also something that you cannot remember clearly: It all happened so long ago that it’s just a blur to me now. blurry adjective us\nYour browser doesn't support HTML5 audio\n/ˈblɜr·i, ˈblʌr·i/\nThe exhibit consisted of blurry, blown-up, black-and-white photographs.\n-rr- to become unclear, or to make something hard to see: [ T ] These deals are blurring the distinction between local and long-distance telephone service.\n-rr- If a memory has blurred or something has blurred it, it becomes hard to remember clearly: My childhood memories are already blurring. blurred adjective us\nYour browser doesn't support HTML5 audio\n/blɜrd/\nPeople who develop meningitis can get a stiff neck, blurred vision, and headaches."}