{"id":36893,"name":"blush","type":"verb","us_sound":"blʌʃ","us_link":"../audio/b/blush.mp3","uk_sound":"blʌʃ","uk_link":"../audio/b/ukblunt008.mp3","content":"Add to word list\nAdd to word list\nB2 to become pink in the face, usually from embarrassment: blush to think I blush to think what a fool I made of myself. I always blush when I speak in public.\nMore examplesFewer examplesI blush whenever I think about it - it was awful!Even the mention of her name makes him blush.She blushed with embarrassment.Here comes your favourite person now - look, you're blushing!The poor boy was blushing when the headmistress made him come up to collect his prize.\nSMART Vocabulary: related words and phrases\nExpressing and showing feelings\na gleam in your eye idiom\nabandon\naffective\nbe in/get into a state idiom\nbeat your breast/chest idiom\nbeetroot\ncrimson\nfling\nflush\nfreak\nfreak (someone) out\ngame face\ngo/turn beetroot (red) idiom\npale\nroar\nsook\nspill\nspill out\nsulk\nswitch something on\nSee more results »\n[ C ] a pink colour in the face, usually from embarrassment: A blush of shame crept up his face.\n[ C or U ] US (UK blusher) a powder or cream put on the cheeks to make them look pink: You would never wear a shade of blush that doesn't work with your skin tone.\nYevgen Romanenko/Moment/GettyImages\n[ C or U ] (also blush pink) a pale pink colour: The soft, neutral colours of blush and beige pair perfectly together. The dresses come in ravishing shades of blush pink and leaf green.\nPatchakorn Phom-in/iStock/Getty Images Plus/GettyImages\n[ C or U ] (also blush wine) a pink wine: Rosés - or, to be more precise, California blush wines - are selling well this summer. See also\nrosé\nAVRORRA/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesShe looked shocked, a blush rushing to her cheeks.\"Thank you,\" he said with a blush.Skim your cheeks with a sparkly rose blush.Porto Cervo is beautiful at sunset, when the blush pinks, yellows and terra-cottas of the homes on the hills surrounding the town glow.Look for a linen suit in a pastel shade such as mint, lilac or even a pale blush pink.They sell a merlot, a cabernet sauvignon, a blush and a chardonnay.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nashy\nbloodless\ncolouring\ncraggily\ncraggy\ncrimson\ncutaneous\ncutis\nmole\npallor\npore\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbathing\nsunbed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\nMake-up & skin care\nLess common colours\nWines & winemaking\nIdiom\nat first blush\nblush verb [I]\n(REDDEN)\nAdd to word list\nAdd to word list\nto become redder or darker in the face, usually from embarrassment: He blushed at the thought of what he’d done.\nblush noun\n(RED COLOR)\n[ C ] a red color on the face, usually from embarrassment\nblush noun\n(MAKEUP)\n[ U ] a substance, often a powder, put on the face to add a slightly red color"}