{"id":36936,"name":"board","type":"noun","us_sound":"bɔːrd","us_link":"../audio/b/board.mp3","uk_sound":"bɔːd","uk_link":"../audio/b/ukblunt021.mp3","content":"board noun\n(WOOD)\nAdd to word list\nAdd to word list\nB2 [ C ] a thin, flat piece of cut wood or other hard material, often used for a particular purpose: Cheeses were laid out on a board. There was a \"For Sale\" board outside the house. See also\nbackboard\nbreadboard\ncheeseboard\nchopping board\ncutting board\nserving board\nsoundboard\nnantonov/iStock/Getty Images Plus/GettyImages\nA2 [ C ] a flat piece of wood or other hard material with a special pattern on it, used for playing games: a chess board See also\ncheckerboard\nA1 [ C ] a\nblackboard or\nwhiteboard : The teacher wrote her name up on the board.\nNomadsoul1/GettyImages\nA2 [ C ] a\nnoticeboard UK : I stuck the notice (up) on the board.\nImage Source/GettyImages\n[ C ] a\ndiving board : I dived off the top board today, Dad.\nJena Ardell/Moment/GettyImages the boards [ plural ]\nthe wooden fence surrounding the ice surface in ice hockey: He'd crashed into the boards and hurt his leg quite badly.\nold-fashioned the stage in a theatre: It was over two decades since he had trodden the boards (= acted in a theatre).\nSee more\nMore examplesFewer examplesToday's specials are written on the board.He stuck up a notice on the board with pins.He advertises his services on the company notice board.When it was his turn to dive, he gulped and stepped up onto the diving board.The man's body was as stiff as a board when it was found in the snow.\nSMART Vocabulary: related words and phrases\nTypes of wood\nAmerican elm\nAtlantic white cedar\nbalsa wood\nbark\nbasswood\nblack locust\nboxwood\ncork\nknotty\nlumber\nmatchwood\nMDF\nmulga\noaken\npaulownia\npiny\npitch pine\nponderosa pine\nsoftwood\nthree-ply\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoard games\nPublishing: paper & stationery\nSchools in general\nSwimming\nboard noun\n(PEOPLE)\nC1 [ C usually singular, + sing/pl verb ] the group of people who are responsible for controlling and organizing a company or organization: board of directors Every decision has to be approved by the board of directors. board of governors The board of governors meet/meets once a month to discuss school policy. She started in the firm after college and now she's on the board/a board member.\nMore examplesFewer examplesThe decision will have to be ratified by the executive board.There's a board of five directors, but she is the Managing Director.There is a predominance of people with an arts degree on the board of governors.She persuaded the board of her worthiness to run the company.The editorial board has an expert with a world-wide reputation in the person of Professor Jameson.\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nlayer\nline manager\nmajordomo\nsilent partner\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\nboard noun\n(EXAM)\nboards [ plural ] US informal\nan official examination given by some medical and business organizations in the US: This is my last chance to pass the boards.\nSee more\nboard noun\n(TRANSPORT)\non board\n(or on board something) on a boat, train, or aircraft: As soon as I was on board, I began to have second thoughts about leaving.\nas part of a group or team, especially for a special purpose: bring someone on board Let's bring Rob on board for the Saudi deal - he's the expert.\nin agreement with a particular course of action, especially so that you get involved with it: Seeing his enthusiasm and expertise, others quickly got on board with his grand ideas.\nSee more\nboard noun\n(MEALS)\nB2 [ U ] meals provided when you are staying somewhere, usually for money\nSMART Vocabulary: related words and phrases\nAccommodating people\naccommodate\nbillet\nboard and lodging\nboarding and lodging\ncamp\ndeinstitutionalize\nfull board\ninstitutionalize\nmodified American plan\nnon-residential\nnoninstitutionalized\nplacement\nquarter\nrehouse\nresettle\nresettlement\nroom and board\nseat\nself-catering\nsleep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals\nIdioms\nacross the board\ngo by the board\ntake something on board\nboard verb\n(GET ON)\nB1 [ I or T ] to get onto or allow people to get onto a boat, train, or aircraft: At London airport she boarded a plane to Australia. Will passengers waiting to board please go to the ticket counter?\nMore examplesFewer examplesThe platform was crammed with people trying to board the train.I took out a travel insurance policy before I boarded the plane.They boarded a ship that was sailing the next day.He was thought to have boarded the plane in New York.Flight 474 to Buenos Aires is now boarding at gate 9.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\nalight\nbestride\nclimb\ndebark\ndeplane\ndisembark\ndisembarkation\ndismount\nembark\nembarkation\nentrain\nget\nget off\nget on\nget out\nhop\nmount\nreboard\nsettle\nstraddle\nSee more results »\nboard verb\n(STAY)\n[ I ] to pay to sleep and eat meals in someone's house: During his stay in England he boarded with a family in Bath.\n[ I ] to sleep and eat at school during the school term: When you went to school were you a day student or did you board?\n[ T ] UK to arrange for a pet animal to be temporarily taken care of at a place other than its home: He boards the dog out when he goes on business trips.\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\npopulate\nreoccupation\nrepopulate\nrepopulation\nreside\nresidence\nsettle\nslum\ntenancy\nwarehousing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccommodating people\nboard verb\n(SLIDE)\n[ I ] to slide on the snow by standing on a specially shaped board: I love to go boarding in the winter. Synonym\nsnowboard\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nboard verb\n(HIT)\n[ I ] in ice hockey, to make a dangerous hit that sends an opponent into one of the boards that surround the rink (= playing area): He was given a penalty for boarding.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nPhrasal verb\nboard something up\nboard noun\n(FLAT PIECE)\nAdd to word list\nAdd to word list\n[ C ] a thin, flat piece of hard material such as wood or plastic: The floor boards of the old house squeaked as he walked across them.\n[ C ] A board is also a flat piece of hard material that is made to be used for a particular purpose: an ironing board a cheese board\n[ C ] A board can be a chalkboard.\n[ C ] A board can also be a circuit board.\nboard noun\n(PEOPLE)\n[ C ] the group of people who are responsible for controlling the operation of a public or private organization: a community/school board She sits on the board of several large companies.\nboard noun\n(MEALS)\n[ U ] meals provided when you are staying somewhere\nIdiom\non board\nboard verb\n(GET ON)\n[ I/T ] to get onto or allow people to get onto an aircraft, train, or ship: [ I ] Flight 701 to Los Angeles is now boarding at gate 14A.\nboard verb\n(MEALS)\n[ T ] to arrange for an animal to be temporarily taken care of and fed at a place other than its home: [ T ] We board our dogs at the kennel when we go away. Phrasal verb\nboard up something\nAdd to word list\nAdd to word list\n[ C or S ]\n&#160; MANAGEMENT, WORKPLACE\n&#160; (also board of directors) the group of people who shareholders choose to manage a company or organization: The board has decided to reject the offer. Club manager, Gomez, insists he has the full backing of the board.be/sit/have a seat on the board He sat on the board of the WPP Group for over ten years.step down/stand down/resign from the board She will stand down from the board at the forthcoming AGM. At the age of 27, she is the youngest member to join the board. an emergency board meeting. a non-executive board member Compare\nboard of directors\nboard of trustees\nmanagement board\n[ C ]\n&#160; MANAGEMENT a group of people who are responsible for making rules and decisions on behalf of an organization: A complaint was filed with the state medical board. a school governing board\n[ C ]\n&#160; IT\n&#160; (also circuit board) a flat object covered with small metal electrical connections that create one or more circuits, used in computers and other electronic equipment : a graphics board\n[ C ]\n&#160; WORKPLACE\n&#160; (also noticeboard) a flat object on a wall on which information can be fixed: There is a list of names on the board outside my office.\n[ U ] (also board and lodging) a room and meals that are provided for someone who is staying away from home, for example in a hotel: The package includes food and board.\nthe boards\nWORKPLACE examinations given by some business organizations in the US: The best strategy for passing the boards is to study early and often.\nbe above board\nto be legal and honest: Pay-offs and all other financial dealings were ruled to have been above board.\nacross the board\naffecting all areas, parts of an organization, people, etc. involved in a particular situation: The new 18% tax rate will apply across the board.\nbe/come/get on board\nto be or start to be involved in an activity: Make sure all senior managers are on board and involved in the internet strategy.\nbring/get sb on board\nto make someone become involved in an activity: A consultancy firm was brought on board to ensure consistency and compatibility.\non board\nTRANSPORT travelling on a plane, ship, or train: The aircraft had 92 passengers on board.\ntake sth on board\nto accept a new idea, method of working, etc.: It's important that we take on board the environmental concerns of consumers. See also\nadvertising board\nappeals board\nbulletin board\nexamination board\nfull board\nhalf board\nmarketing board\nmessage board\noversight board\nprinted circuit\nView all\nreview board\nsupervisory board\ntourist board\nTRANSPORT if passengers board a plane, ship, or train, or if a plane, ship, or train is boarding, passengers get on to it before the start of a journey: Flight 2864 to Frankfurt is now boarding at Gate 12."}