{"id":37186,"name":"body","type":"noun","us_sound":"ˈbɑː.di","us_link":"../audio/b/body.mp3","uk_sound":"ˈbɒd.i","uk_link":"../audio/b/ukboat_026.mp3","content":"body noun\n(PHYSICAL STRUCTURE)\nAdd to word list\nAdd to word list\nA1 [ C ] the whole physical structure that forms a person or animal: A good diet and plenty of exercise will help you to keep your body healthy. She rubbed suncream over her entire body.\nB1 [ C ] the main part of a person's or animal's body, without the head, or without the head, arms, and legs: He had a fat body but thin legs and arms.\nA2 [ C ] a dead person: A body was washed up on the beach last week. Synonyms\ncadaver specialized\ncarcass\ncorpse\nstiff (BODY) slang\n[ C ] the painted metal shell of a vehicle, such as a car or an aircraft See also\nbodywork\n[ C usually singular ] old-fashioned a person: How is a body supposed to live in these conditions?\n[ C ] UK (US bodysuit) a piece of tight-fitting women's clothing that covers the top half of the body and fastens between the legs\nMore examplesFewer examplesThe human body is composed of about 60% water.The jacket hung loosely on his thin body.Police had marked off the area where the body was found.His head throbbed, and his body ached.The bodies of dolphins are more streamlined than those of porpoises.\nSMART Vocabulary: related words and phrases\nThe body\n-bodied\nanimal\naxial\nbiodynamics\nbiomechanics\nbod\nbodily\nbuild\ncorporal\ncorporeal\ncorporeality\nendomorph\nfigure\nflesh\nframe\nhyperphysical\ninternally\nmesomorph\nmind-body\nphysical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath and dying\nThe exterior of vehicles\nAir travel: parts of aeroplanes\nPeople in general\nUnderwear\nJumpers, shirts & tee-shirts\nbody noun\n(GROUP OF PEOPLE)\nC2 [ C, + sing/pl verb ] a group of people who have joined together for a particular reason: governing body The sport's governing body announced changes to some rules for the coming season. student body Chatsworth High School's student body raised £5,000 for the charity. The committee serves as an advisory body to the organization. The RSPCA is a respected body working for animal welfare. There is a large body of people who are unaware of their basic rights. in a body formal literary\nIf people do something in a body, they do it together as a group, in an official way: The cleaning staff went in a body to the manager to complain.\nSee more\nMore examplesFewer examplesa self-regulating bodyThese three official bodies are the guardians of the nation's countryside.FIFA is football's world governing body.The elections will be overseen by an independent body.Almost the entire student body took part in the demonstration.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nbody noun\n(AMOUNT)\n[ C ] a large amount of something: There is a growing body of evidence to support their claim. She collected a huge body of information on the subject. A substantial body of opinion (= a large group of people with the same opinion) is opposed to any change.\n[ C ] formal A body of water is a large area of water, such as a lake.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInland waters\nbody noun\n(MAIN PART)\nthe body [ S ]\nthe main part of a book, article, etc.: I thought the most interesting details in the book were not in the body of the text, but in the notes at the end.\nthe main part of a large building: to enter the body of the cathedral\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nbody noun\n(OBJECT)\n[ C ]\n&#160; physics\n&#160; specialized a separate object or mass: The distance between the two bodies in space was measured daily.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nbody noun\n(QUALITY)\n[ U ] a strong or thick quality: This Bordeaux has plenty of body (= strong flavour). Conditioner can give your hair more body.\nSMART Vocabulary: related words and phrases\nPower and intensity\nascendant\nbe (as) solid as a rock idiom\nbrunt\ncast iron\nclout\ngrunt\nintensity\ninvincibility\ninvulnerability\njuggernaut\nkeenness\nkick-ass\nresilient\nrichness\nripely\nrobustness\nstridency\nvigour\nvirulence\nvividness\nSee more results »\nIdiom\nkeep body and soul together\nbody noun\n(PHYSICAL CREATURE)\nAdd to word list\nAdd to word list\n[ C ] the whole physical structure that is a person or animal: A good diet and plenty of exercise will help you keep your body healthy.\n[ C ] Sometimes body can refer to the main, physical part of a person or animal but not include the head, or not include the head and the arms and legs.\n[ C ] A body is also a dead person: Police found the man’s body in the next room.\nbody noun\n(MAIN PART)\n[ U ] the main part of something such as a book, a large building, or a vehicle: Most scientists will be less interested in the body of the article than in the detailed notes at the end.\nbody noun\n(GROUP OF PEOPLE)\n[ C ] a group of people who have joined together for a particular reason: Congress is a legislative body created to consider and pass laws.\nbody noun\n(AMOUNT)\n[ C ] an amount of something: There is a growing body of evidence to support their innocence.\n[ C ] A body of water is a large area of water, such as a lake."}