{"id":37377,"name":"boho","type":"noun","us_sound":"ˈboʊ.hoʊ","us_link":"../audio/b/cdo0318usboho0598.mp3","uk_sound":"ˈbəʊ.həʊ","uk_link":"../audio/b/cuk00159.mp3","content":"Add to word list\nAdd to word list\n[ C ] a person who is interested in artistic and unusual things, for example art, music, or literature, and lives in an informal way that ignores the usually accepted ways of behaving: Brooklyn bohos Synonym\nbohemian\n[ U ] a relaxed, informal and unusual style of dress or decoration that is typical of a boho: Soft, romantic seventies boho is a popular look this summer.\nMore examplesFewer examplesStudents and bohos populate this regenerated and rapidly expanding area. In the 19th century, Romanticism led to artists reinventing themselves as free-loving bohos.The look was skinny grey jeans and flouncy boho.I like a bit of boho, and try to mix vintage with modern.For me, the worst look is boho, as I'm quite a classic dresser. That look just doesn't work for me.\nSMART Vocabulary: related words and phrases\nNomadic & alternative lifestyles\na rolling stone (gathers no moss) idiom\nbeatnik\nbohemian\ncommunal\ncommune\ndemi-monde\nflower child\ngo/get back to nature idiom\ngreaser\nhermit\nNew Age\nNew Age traveller\nNew Ager\nnomad\nnomadic\nsubculture\nthe Beat Generation\ntraveller\nunderground\nwild child\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nBuilding: interior decoration\nrelating to or typical of a boho: a boho lifestyle It's a brilliant place for anyone who is a bit boho, eccentric or artistic. Their house is boho chic. Synonym\nbohemian\nMore examplesFewer examplesShe used to sing and do spoken-word performances in Philadelphia's boho cafés.The cafes at the western end are younger and trendier, with boho types lounging on luminous bean bags.Their boho friends included a singer named Sadie and her Hendrix-like guitarist boyfriend.They may see themselves as free-thinking and \"boho\", but that does not go much farther than taking a few yoga classes.The designer has adopted the look with lots of variations, mostly with a Seventies, boho feel.The new suit style is more boho, with velvet tuxes taking over from the traditional pinstripe.\nSMART Vocabulary: related words and phrases\nNomadic & alternative lifestyles\na rolling stone (gathers no moss) idiom\nbeatnik\nbohemian\ncommunal\ncommune\ndemi-monde\nflower child\ngo/get back to nature idiom\ngreaser\nhermit\nNew Age\nNew Age traveller\nNew Ager\nnomad\nnomadic\nsubculture\nthe Beat Generation\ntraveller\nunderground\nwild child\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nBuilding: interior decoration"}