{"id":37503,"name":"bold","type":"adjective","us_sound":"boʊld","us_link":"../audio/b/bold.mp3","uk_sound":"bəʊld","uk_link":"../audio/b/ukboer_017.mp3","content":"bold adjective\n(BRAVE)\nAdd to word list\nAdd to word list\nB2 not frightened of danger: make the bold move The team made the bold move of trading its star player. take the bold step The newspaper took the bold step of publishing the names of the men involved. She was a bold and fearless climber. Synonym\nbrave\nThesaurus: synonyms, antonyms, and examples\nbravebraveThe King was a brave warrior.courageousShe was a courageous woman who never complained about her illness.daringHe made a daring escape from his kidnappers.boldI wasn't bold enough to leave my job.adventurousShe's a very adventurous person and enjoys mountain climbing.\nSee more results »\nMore examplesFewer examplesPoliticians tried to dress up the bill as a bold new strategy for combatting poverty.I thought I'd be bold and make a fashion statement.Ending negotiations was seen as a bold stroke by many commentators.Of the three organizations criticized, only one was bold enough to face the press.The plan to escape was bold and simple.\nSMART Vocabulary: related words and phrases\nBrave and courageous\nadventurous\nadventurously\naudacious\nballsy\nbe man enough to do something idiom\nfaint heart never won fair lady/maiden idiom\nfearless\nfearlessly\ngallant\ngallantly\nlion-hearted\nman up\nmanfully\nmuster something up\nnerves of steel idiom\nunflinchingly\nunperturbed\nvaliant\nvaliantly\nvalorously\nSee more results »\nbold adjective\n(NOTICEABLE)\nB1 strong in colour or shape, and very noticeable to the eye: bold colour They painted the kitchen in bold colours. in bold (type/print)\nprinted in thick dark letters: This sentence is printed in bold.\nSee more\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwonder\nwritten all over someone's face idiom\nSee more results »\nbold adjective\n(NOT SHY)\nnot shy, especially in a way that shows no respect: He was a bold and defiant little boy.\nThesaurus: synonyms, antonyms, and examples\ncertain of your abilities or valueconfidentHe was confident that his approach would work best.assuredShe gave an assured performance to a packed concert hall.self-assuredThe interview showed her as a very self-assured woman.self-confidentHe was self-confident and sure he'd get the job. assertiveYou'll have to be more assertive if you want to be promoted.boldHe was a bold and defiant little boy.\nSee more results »\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConfidence & self-assurance\nRelated words\nboldly\nboldnessIdioms\n(as) bold as brass\nif I may be/make so bold (as to)\nto print letters or words in thick dark letters on a page or screen: I went through the list bolding some of the items. You can click on bolded words to hear their pronunciation.\nMore examplesFewer examplesBy bolding the word \"experienced,\" she hopes to downplay the fact she has spent fewer years in office than any other candidate.I'd like to focus on the points that I've bolded.Draw attention to your skills and attributes on your CV by underlining them, bolding them, or indenting them as bullet points.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nbold adjective [-er/-est only]\n(BRAVE)\nAdd to word list\nAdd to word list\nbrave, or without fear: He is a qualified politician with bold ideas.\nBold can also mean not shy, and almost rude: She was friendly without being bold.\nbold adjective [-er/-est only]\n(NOTICEABLE)\nlikely to attract your attention; showy: The costumes were in beautiful, bold colors. boldly adverb us\nYour browser doesn't support HTML5 audio\n/ˈboʊld·li/\nHe dealt boldly with the problem and hoped he was right."}