{"id":37676,"name":"bomb","type":"noun","us_sound":"bɑːm","us_link":"../audio/b/bomb.mp3","uk_sound":"bɒm","uk_link":"../audio/b/ukbolsh006.mp3","content":"bomb noun\n(WEAPON)\nAdd to word list\nAdd to word list\nB1 [ C ] a weapon that explodes and is used to kill or hurt people or to damage buildings: drop a bomb During World War II, the British dropped a huge number of bombs on Dresden. A 100-pound bomb exploded in a market today, injuring three people. A bomb went off near a hospital in Baghdad. The terrorists had planted a bomb near the police station. the bomb\none or more atom bombs: The US was the first country to have the bomb.\nMore examplesFewer examplesThe bomb killed four soldiers and three civilians.A bomb exploded at one of the capital's busiest railway stations this morning.Police are hunting the terrorists who planted the bomb.A nuclear bomb could wipe the whole country off the map.A remote control device was used to detonate the bomb.\nSMART Vocabulary: related words and phrases\nBombs & missiles\nanti-mine\nanti-missile\nanti-radar\nanti-satellite\nanti-ship\ndirty bomb\nenrich\nenrichment\nExocet\nfirebomb\nMolotov cocktail\nmortar\nmushroom cloud\nnapalm\nneutron bomb\nsubmunition\nsuicide belt\nsuicide vest\nsuperbomb\nsurface-to-air missile\nSee more results »\nbomb noun\n(FAILURE)\n[ S ] US informal something that has failed: The play was a real bomb.\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that is not successfulfailureThe shuttle launch was a complete failure.successThe operation was a success.turkeyI really wanted to like it, but that show ended up being a real turkey.clunkerUS That pitch was a real clunker. bombUS His website was one of the biggest dotcom bombs in the history of the internet.dudMy charger doesn't work - I think I've got a dud.\nSee more results »\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nbomb noun\n(MONEY)\na bomb UK informal\na lot of money: cost a bomb That coat must have cost a bomb. Their wine is really good but it costs a bomb. Festival tickets cost a bomb. What a present! It must be worth a bomb! This knock-off cream is just as good as the expensive stuff and you'll save a bomb on skin care. He spent a bomb on his daughter's wedding.\nSMART Vocabulary: related words and phrases\nLarge amounts of money\na king's ransom idiom\narm\nbig bucks\nblank cheque\nboxcar\nbundle\ncost someone a pretty penny idiom\ncost, charge, etc. the earth idiom\nearth\ngratuity\nhandsome\nking\nmake a bundle idiom\nmegabucks\nnot to be sneezed at idiom\npacket\npile\npot\nriches\ntreasure\nSee more results »\nbomb noun\n(IN SPORT)\ninformal in sports such as rugby, a kick where the ball goes very high in the air: Smith hoisted a dangerous bomb to the far corner. The first try came when Jackson made a mess of dealing with a high bomb.\ninformal in baseball, a home run (= a point scored by hitting the ball so far that you have time to run all the way around the four corners of the playing field before it is returned): Griffey launched a three-run bomb in the eighth inning. He hit thirty bombs last season.\ninformal in sports such as American football, a very long, high pass: Smith hoisted a bomb to the ten-yard line.\nSMART Vocabulary: related words and phrases\nRugby\ncharge something down\nconverted\ncooler\ndrop kick\nfield of play\nflanker\nheel\nmatch fitness\nmisfield\noutcome variable\noutkick\nplace-kick\nprop\nsquad rotation\nsteal\ntest match\nthrow something in\nunconverted\nwing back\nwork rate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nAmerican football\nIdioms\nbe the bomb\ngo (like/down) a bomb\ngo like a bomb\nbomb verb\n(USE WEAPON)\nB1 [ T ] to drop bombs on something: Planes bombed the city every night.\nB1 [ T ] to destroy something by exploding a bomb inside it: This hotel was bombed a few years ago.\nMore examplesFewer examplesPlanes bombed the guerrilla positions yesterday in an attempt to flush out snipers from underground tunnels.Fighter planes have successfully bombed the enemy's main armoury.Our city was bombed to smithereens during the war.They thought the country could be bombed into submission.Many important historical documents were destroyed when the library was bombed.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nshooting\nSee more results »\nbomb verb\n(GO FAST)\n[ I + adv/prep ] informal to travel very fast in a vehicle: He was bombing along on his motorbike.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving quickly\nbomb verb\n(FAIL)\n[ I ] mainly US informal to fail: Her last book really bombed.\nThesaurus: synonyms, antonyms, and examples\nto not work or happen as intendedfailWe tried our best, but ultimately the project failed.fall apartThings were going smoothly until we hired him, and now everything is falling apart.fall to piecesThe plan has potential, but unless we proceed carefully, it could fall to pieces. fall throughOur plans to visit fell through at the last minute.crackThe Liberal Party is cracking under the pressure of these allegations.\nSee more results »\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\nPhrasal verbs\nbomb out\nbomb someone out\nbomb something out\nbomb noun [C]\n(WEAPON)\nAdd to word list\nAdd to word list\na weapon that explodes: Was there any warning before the bomb went off?\nbomb noun [C]\n(FAIL)\ninfml a complete failure: The last play was a bomb.\nbomb verb\n(WEAPON)\n[ T ] to explode bombs, or to drop bombs from aircraft: They bombed enemy airfields.\nbomb verb\n(FAIL)\n[ I ] infml to fail completely: A lot of students bombed on that last exam.\ncost a bomb\nAdd to word list\nAdd to word list\nto cost a lot of money: Bank loans, if available at all, cost a bomb.\nmake a bomb\nto make a lot of money: They made a bomb selling scrap metal.\nto fail very badly: The movie bombed at the box office."}