{"id":37711,"name":"bombe","type":"noun","us_sound":"bɑːm","us_link":"../audio/b/cdo1121usbomb0649.mp3","uk_sound":"bɒm","uk_link":"../audio/b/cdo1121ukbomb0713.mp3","content":"bombe noun\n(SWEET)\nAdd to word list\nAdd to word list\n[ C or U ] (also UK bombe glacée plural bombes glacées) a sweet dish consisting of ice cream and usually other layers such as cake, fruit, or chocolate, frozen into a round shape: The Coconut Bombe features the sun-kissed flavours of coconut encased in creamy white chocolate.\nMore examplesFewer examplesThe delicious bombe consists of a heart of strawberry sorbet, a middle layer of white chocolate parfait and an outer layer of meringue, topped with fresh strawberries.The cheesecake, chocolate bombe, apple pie and sorbet are all home-made. For dessert, I chose the lime and pineapple bombe. She sought out Italian gelateria on her travels, their glass cabinets filled with ice cream gateaux and frozen bombes.The bombe glacée is indispensable, it seems, to a good dinner.\nSMART Vocabulary: related words and phrases\nPuddings, desserts & ices\nbaked Alaska\nbaklava\nbanana split\nbananas Foster\nbanoffee pie\ncrumble\ndessert\ndulce de leche\ndumpling\nentremets\nkugel\nlolly\nmochi\nmousseline\nNeapolitan ice cream\nsorbet\nsoufflé\nspotted dick\nspumoni\nsummer pudding\nSee more results »\nbombe noun\n(MACHINE)\n[ C ] a device that was a kind of early computer, used by the British during World War II to crack (= understand) codes used by the Germans to send secret information: The director of the Bletchley Park Trust believes that the Turing bombe is a true progenitor of the modern computer.\nMore examplesFewer examplesBy November 1941 there were fifteen bombes: at the end of the war there were several hundred.The bombe, designed by Alan Turing and Gordon Welchman, after the Polish cryptographic bomba by Marian Rejewski (1938), came into productive use in 1941.\nSMART Vocabulary: related words and phrases\nCodes & decoding\ncipher\ncode\ncode word\ncoded\ncryptanalysis\ncrypto\ncryptography\ncryptologist\ncypher\ndecipher\nencode\nencrypt\npasscode\nQR code\nscrambler\ntoken\ntokenization\ntokenize\nuncoded\nSee more results »"}