{"id":37986,"name":"bonus","type":"noun","us_sound":"ˈboʊ.nəs","us_link":"../audio/b/bonus.mp3","uk_sound":"ˈbəʊ.nəs","uk_link":"../audio/b/ukbonfi011.mp3","content":"Add to word list\nAdd to word list\nB2 an extra amount of money that is given to you as a present or reward for good work as well as the money you were expecting: a productivity bonus a Christmas bonus The company used to give discretionary bonus payments.\nB2 a pleasant extra thing: I love the job, and it's an added bonus that it's so close to home.\nMore examplesFewer examplesThe salary was set at £12,000, plus a bonus if the company had a good year.Good weather is an added bonus but the real appeal of the area is the fantastic variety of landscape.Profit sharing is when the profits of a company are given to staff in the form of an additional bonus payment.The DVD version of the film features a bonus disc containing extra footage and interviews with the actors.The new contract gives workers less salary, but bonuses for hitting efficiency and sales targets.\nSMART Vocabulary: related words and phrases\nGifts in the form of money\naid\naward\nbenefaction\nbequest\nbounty\ncharity box\nChristmas box\ndebt relief\ndonation\ndonation box\ndowry\nforeign aid\ngift card\ngift certificate\ngratuity\nhonorarium\nMaundy\nreward\ntip\ntronc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPleasure and happiness\nAdd to word list\nAdd to word list\nan extra amount of money given to someone as a reward for work or as encouragement: The salary was $40,000, plus a bonus.\nA bonus is also any result that is an unexpected benefit: After the heart transplant, every day is a bonus for me.\nAdd to word list\nAdd to word list\nWORKPLACE an amount of money given to an employee in addition to their salary as a reward for working well: a bonus of €1000/£500, etc. She received a bonus of $15,065, equal to 40% of her salary.earn/get/receive a bonus Teachers can earn an annual bonus of $1,026 if they meet the goals.pay (sb) a bonus Bank bosses are still being paid huge bonuses. a Christmas bonus a bonus award/payment/scheme\nFINANCE an amount of money or shares given by a company to its shareholders: Investors are set to receive a bonus of at least £1.50 a share.\nINSURANCE a payment made to the customers of an insurance company out of its profits: Annual bonus rates on some life policies have fallen recently. See also\nacceptance bonus\nattendance bonus\ncapital bonus\nloyalty bonus\nperformance bonus\nproductivity bonus\nretention bonus\nsigning bonus\nterminal bonus"}