{"id":37902,"name":"bony","type":"adjective","us_sound":"ˈboʊ.ni","us_link":"../audio/b/bony.mp3","uk_sound":"ˈbəʊ.ni","uk_link":"../audio/b/ukbonfi014.mp3","content":"bony adjective\n(THIN)\nAdd to word list\nAdd to word list\nvery thin, so that the bones show under the skin: long bony fingers She looked frail, her face bony.\nThesaurus: synonyms, antonyms, and examples\nhaving less flesh on the body than averagethinShe's on a diet but I think she's already too thin.skinnyYou should eat more. You're much too skinny.scrawnyHe hated his scrawny legs.slimHe was tall, very slim, with pale, deep-set eyes.slenderHe put his arms around her slender waist.\nSee more results »\nMore examplesFewer examplesI could not sleep comfortably: the floor was too hard, my body too bony.She pointed a bony finger at him.The cattle were boney and underfed.\nSMART Vocabulary: related words and phrases\nAnimal physiology: thin or slender (of people)\nbe as thin as a rake phrase\nbe skin and bone(s) idiom\nectomorph\nemaciated\nemaciation\ngauntly\ngauntness\nhollow\nlithe\nraw-boned\nscrawny\nskinny\nslight\nslimness\nsparely\nthinness\nultra-thin\nwasted\nwirily\nwiry\nSee more results »\nbony adjective\n(CONTAINING BONE)\nmedical\n&#160; specialized made of bone or a substance like bone: Surgery can correct bony deformities of the feet. In a horse's jaw, a bony plate separates food and air passages. The animal has boney, armour-like plates on its back.\ncontaining a lot of bones: bony fish\nMore examplesFewer examplesTeeth decay occurs when bacteria in the mouth produce acids, which dissolve the hard, bony tissue of the tooth.The pituitary gland in the brain is well protected in a bony capsule at the base of the skull.Complications can include boney growths around the joint. There was a small, bony lump on his knee.The fish is delicious, but very bony.\nSMART Vocabulary: related words and phrases\nBone structures\nacetabular\nacetabulum\nacromial\nacromioclavicular\nacromion\nbreastbone\nendoskeleton\nilium\nintercarpal\nintercondylar\ninterlaminar\ninterosseous\nkneecap\nsacroiliac\nsacrospinous\nsacrotuberous\nsacrum\nsagittal\nshinbone\ntrapezium\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe skin, hair & bone of non-human animals\nAdd to word list\nAdd to word list\nvery thin, so that bones can be seen: She had a long, bony face.\n(of fish) having a lot of bones in it"}