{"id":38044,"name":"book","type":"noun","us_sound":"bʊk","us_link":"../audio/b/book.mp3","uk_sound":"bʊk","uk_link":"../audio/b/ukbonfi028.mp3","content":"book noun\n(TEXT)\nAdd to word list\nAdd to word list\nA1 [ C ] a written text that can be published in printed or electronic form: Have you read any good books recently? He has a new book out (= published). She wrote a book on car maintenance.\nhudiemm/E+/GettyImages\nA1 [ C ] a set of pages that have been fastened together inside a cover to be read or written in: a hardback/paperback book I took a book with me to read on the plane. He writes all his expenses in a little book he carries with him.\nNehru Sulejmanovski/EyeEm/GettyImages\n[ C ] one of the parts that a very long book, such as the Bible, is divided into: the book of Job\nMore examplesFewer examplesWe're reading a different book this week.In the last two years the book has only sold 200 copies.She published a book of poems and followed it up with a novel.I have to return my library books on the sixth of July.He's the author of several hugely successful children's books.\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\ncaption\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\nintertextual\nintertextuality\nintertextually\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nversification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\nbook noun\n(IN COVER)\nC2 [ C ] a number of one type of thing fastened together flat inside a cover: a book of stamps/tickets/matches\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nbook noun\n(MONEY RECORD)\nbooks [ plural ]\nthe written records of money that a business has spent or received: balance the books Running a school is much more of a business than it used to be - by law we have to balance our books.\nSee more\n[ S ] the situation in which a bookmaker accepts and pays out amounts of money that are risked on a particular result: They've already opened/started a book on the result of the next World Cup.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nIdioms\nby the book\nin someone's bad books\nin someone's good books\nin my book\noff the books\non the books\none for the books\nbook verb\n(ARRANGE)\nA2 [ T or I ] to arrange to have a seat, room, performer, etc. at a particular time in the future: be booked up I'd like to go but I'm booked up (= I have arranged to do other things) until the weekend.be fully booked Unfortunately the restaurant was fully booked (= there were no tables available). [ + two objects ] I've booked us two tickets to see \"Carmen\"/I've booked two tickets for us to see \"Carmen\". She'd booked a table for four at their favourite restaurant. Will booked a seat on the evening flight to Los Angeles. We were advised to book early if we wanted to get a room. They booked a jazz band for their wedding.\nMore examplesFewer examplesI've booked the car into the garage.I've booked a table at the restaurant for nine o'clock.He booked a double room.We booked the holiday on a whim.It's a good thing that we booked our tickets early.\nSMART Vocabulary: related words and phrases\nMaking bookings & reservations\nadvance booking\nbook in/book into somewhere\nbooker\nbooking\ndouble-book\noverbook\npre-booked\nrebook\nreservation\nreserve\nride-hailing\nseason\nunreserved\nvacancy\nbook verb\n(MAKE A RECORD)\n[ T ] If a police officer, referee, etc. books someone, they write down the person's name in an official record because they have done something wrong: A football player who is booked twice in a game is sent off the field. My grandmother was booked for speeding last week.\nSMART Vocabulary: related words and phrases\nArresting & charging\napprehend\napprehension\narrest\nassist\nattach\nbust\nbusted\ncollar\nfed\nhandcuff\nhandcuffs\nhouse arrest\nknock\nnail\npick\npick someone/something up\npolice action\npost-arrest\nprobable cause\nwarrant\nSee more results »\nPhrasal verbs\nbook in/book into somewhere\nbook someone in/book someone into something\nbook something in\nbook noun [C]\n(TEXT)\nAdd to word list\nAdd to word list\nan object consisting of a number of pages of text or pictures fastened together along one edge and fixed inside two covers: The artist’s sketch books filled several shelves.\nA book is also a number of similar items fastened together inside a cover: a book of matches/stamps\nbook verb\n(ARRANGE)\n[ I/T ] to arrange to have the use of a seat, room, etc. at a particular time in the future: [ T ] Our travel agent booked us on a flight to Paris.\n[ I/T ] Someone who books a performer arranges a performance: [ T ] They booked the Rolling Stones for two concerts in New York.\nbook verb\n(ACCUSE)\n[ T ] to officially accuse someone of a crime: Detectives booked him for resisting arrest.\nAdd to word list\nAdd to word list\n[ C ] a set of pages in a cover that you read or write in: book about/on sth She is author of three books about criminal procedure. The company publishes an extensive range of books. children's/reference/self-help books an address book\nbooks [ plural ]\nACCOUNTING the written records of money that a business has spent or received: At the end of the year, the accountant goes over the books. John kept the books and helped her run her business. See also\nappointment book\nbankbook\nthe Beige Book\nthe Blue Book\ncash received book\nduplicate book\nlog book\nminute book\norder book\npaying-in book\nplat book\npurchase book\nrule book\nsales day book\nsales returns book\nstatutory book\ngo by the book (also do sth by the book)\nto do something exactly as the rules tells you: My lawyer always goes strictly by the book. This is a private deal - we don't have to do everything by the book.\non the books\nemployed by a company or officially belonging to an organization: There are 256 people on the books at the cement works. Carla is on the books of a modelling agency.\n[ I or T ] mainly UK to arrange a place on a flight, a room in a hotel, a ticket for an event, etc. for a particular time in the future: Because tickets are limited, you have to book early.book a flight/holiday/show When he tried to book a flight home to Australia, his credit card was refused. book a table/room/seat.book an appointment/meeting If you want to see Ms. Smith you'll have to book an appointment.book sth for sth It's the day we have provisionally booked for the launch of the new media website. See also\nreserve\n[ T ]\n&#160; ACCOUNTING to make a record of something in a company's accounts: The loss would have been much larger had they not booked an £8m profit from property sales.book sth in sth Jarvis expects to be able to book some or all of that figure in the current year's accounts.\nPhrasal verbs\nbook in/into sth\nbook someone in/book someone into something"}