{"id":38220,"name":"booster","type":"noun","us_sound":"ˈbuː.stɚ","us_link":"../audio/b/booster.mp3","uk_sound":"ˈbuː.stər","uk_link":"../audio/b/ukboomi008.mp3","content":"booster noun [C]\n(SUPPORT)\nAdd to word list\nAdd to word list\nsomething that improves or increases something or makes it stronger: a confidence/morale booster Vitamin D is believed to be an immune-system booster. This whole idea is just a profit booster for drug companies.\nUS a person who enthusiastically supports or promotes something (= tells people how good it is): I don't want to come across as a booster for any particular product. The mayor and town boosters hope the new ballpark will be a catalyst for development.\nMore examplesFewer examplesIt's such a morale booster to get messages from home.Their faith in me was a huge confidence booster.This way of organizing email is a great productivity booster.He was a great booster for the baseball club.The politican remains an ardent booster of Hollywood.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrationalize\nrectify\nremedial\nreorganize\nrepair\nrepolish\nrestructure\nrevamp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSupporters, members & defenders\nbooster noun [C]\n(DRUG)\na small amount of a substance that is given to increase the effect of the same substance that was given some time before, to continue to protect a person from illness: a polio/tetanus booster a booster jab/shot/vaccination/vaccine\nMore examplesFewer examplesVaccine manufacturers said they recommended yearly boosters because they could not prove that all animals received long-term immunity.The government has approved booster shots for vulnerable people.If you plan on travelling to North Africa, typhoid and polio boosters are advised.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nCaplet\nchemotherapy\ndosage\ndose\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\nbooster noun [C]\n(ENGINE)\nan engine on a spacecraft that gives extra power for the first part of a flight: a rocket booster a booster rocket\nMore examplesFewer examplesThe space shuttle used solid-fuel boosters and a liquid-fuel main engine.The key advance was the ability to take off toward space in a single stage, without jettisoning boosters.\nSMART Vocabulary: related words and phrases\nSpace travel\naerospace\nastronautics\nautopilot\nbiosatellite\nblast\ncapsule\ncosmonaut\nearthbound\nescape velocity\nEVA\nflyby\nlauncher\nrocket scientist\nshuttle\nspace capsule\nspace probe\nspace shuttle\nspace tourism\nspace tourist\nspaceman\nSee more results »\nRelated word\nboost\nbooster noun [C]\n(SUPP0RTER)\nAdd to word list\nAdd to word list\nan action or thing that improves or increases something: Winning this game was a great morale booster for the team.\nA booster is also someone who is an enthusiastic supporter of something.\nbooster noun [C]\n(ROCKET)\nthe first stage of a rocket (= object sent into space) that pushes it off the ground"}