{"id":38218,"name":"boost","type":"verb","us_sound":"buːst","us_link":"../audio/b/boost.mp3","uk_sound":"buːst","uk_link":"../audio/b/ukboomi007.mp3","content":"boost verb [T]\n(INCREASE)\nAdd to word list\nAdd to word list\nB2 to increase or improve something: The company is looking for ways to boost sales in Asia, its biggest market. I tried to boost his morale by praising his cooking. Share prices were boosted by reports of the president's recovery.\nMore examplesFewer examplesThe magazine misreported its sales figures in order to boost advertising revenue.The new player's skilful debut performance should boost the team's confidence.She claimed tax cuts would boost the economy.The board is even considering increasing charges to boost profits.The compliments she received after the presentation boosted her self-esteem.The theatre managed to boost its audiences by cutting ticket prices.More money is needed to boost the industry.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nboost verb [T]\n(GET VACCINE)\n[ usually passive ] to give someone a booster vaccine (= a small amount of a substance put into a person's body to protect them from illness, that increases the effect of the same substance that was given some time before): The government mounted a public health campaign urging everyone to get boosted before the winter flu season. More than half of over 18s in the country have now been boosted against Covid.\nMore examplesFewer examplesYou may need immunising or boosting against certain infections.Have you been boosted yet? If not, book your booster online.\nSMART Vocabulary: related words and phrases\nMedicines & drugs: preventing infection\nanti-AIDS\nanti-bac\nanti-plague\nanti-rabies\nantimicrobial\nantiseptic\nbiosecurity\ncauterization\ncontainment\nCovid-secure\ndouble-vaxxed\nrubbing alcohol\nscrub up\nshielding\nsocial distancing\nsterility\nsterilize\nsurgical spirit\nswab\nunexposed\nSee more results »\nB2 an occasion when something is improved or increased: The lowering of interest rates will give a much-needed boost to the economy. Passing my driving test was such a boost to my confidence.\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\nMore examplesFewer examplesAn immediate interest cut might give a small boost to the economy. Even so, any recovery is likely to be very slow.The publicity generated by the court case has given a welcome boost to our sales.The change in the exchange rate provided a timely boost to the company's falling profits.The city will get a real boost if its Olympic bid is successful.Vitamin supplements can give your immune system a boost.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things better\nboost verb\n(MAKE BETTER)\nAdd to word list\nAdd to word list\n[ T ] to improve or increase something: We took various steps to try to boost sales.\nboost verb\n(LIFT)\n[ T always + adv/prep ] to lift someone or something by pushing from below: She boosted the little boy up to see over the fence.\nboost noun\n(IMPROVEMENT)\n[ C usually sing ] an improvement or increase, or an action that causes this: The president’s approval rating got a boost following his speech.\nboost noun\n(LIFT)\n[ C ] a push from below that lifts a person or thing: I need a boost to get over the wall.\nAdd to word list\nAdd to word list\nto increase or improve something: boost profits/prices/rates The industry has exceeded all expectations for boosting profits and dividends.boost exports/sales/trade The lower exchange rate is already boosting exports.boost confidence/morale He was elected on a platform to create jobs and boost investor confidence. The effect of these policies would be to encourage spending and boost the economy. boost production/performance/productivityboost sth (by) 20%/50%/100%, etc. The company boosted its dividend nearly 50%.\nan act or event that increases or improves something: Typically sales jump in the autumn, when they get a boost from the back-to-school and holiday shopping seasons. The campaign for pension reform received a boost on Friday. Shares on Wall Street were given a boost by a rally in the US Treasury bond market. a big/major/huge/significant boost\nan increase: a boost in sth Motorists who operate diesel-powered vehicles would face a 1.5-cent-a-gallon boost in fuel taxes. The income boost for the two million lowest paid will not take effect until October."}