{"id":38523,"name":"borrow","type":"verb","us_sound":"ˈbɑːr.oʊ","us_link":"../audio/b/borrow.mp3","uk_sound":"ˈbɒr.əʊ","uk_link":"../audio/b/ukborin004.mp3","content":"borrow verb\n(RECEIVE)\nAdd to word list\nAdd to word list\nA2 [ T ] to get or receive something from someone with the intention of giving it back after a period of time: borrow something from someone I had to borrow a pen from the invigilator to do the exam.UK non-standard Can I borrow £100 off you until next week? She used to borrow money and not bother to pay it back.borrow something from something He borrowed a novel from the library.\nC1 [ I or T ] to take money from a bank or other financial organization and pay it back over a period of time: borrow heavily Like so many companies at that time, we had to borrow heavily to survive.borrow something from something We could always borrow some money from the bank.\n[ T ] to take and use a word or idea from another language or piece of work: borrow something from something English has borrowed many words from French.borrow heavily from She has created new string sounds that borrow heavily from folk and jazz.\nMore examplesFewer examplesCan I borrow a couple of bucks?Do you have a Birmingham to London train timetable that I could borrow?You have to sign books out when you borrow them from the library.He's a bit possessive about his CDs - I wouldn't dare ask to borrow them.Just because I'm lending you my dress for tonight doesn't mean you can borrow it whenever you want to.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow heavily\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay down something\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nborrow verb\n(MATHEMATICS)\n[ T ] to put a number into a different column when doing subtraction\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ncoefficient\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquintuple\nrecursion\nround something down\nsubtraction sign\nsubtractive\ntable\ntimes\ntreble\nSee more results »\nRelated words\nborrower\nborrowingGrammar\nLend or borrow?Lend means ‘give something to someone for a short time, expecting that you will get it back’. The past simple and the -ed form are lent: …\nIdiom\nlive on borrowed time\nAdd to word list\nAdd to word list\nto take something from someone with the intention of giving it back after using it: [ T ] Could I borrow your bike until next week? [ T ] fig. We constantly borrow words from other cultures. borrower noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑr·ə·wər, ˈbɔr-/\nThe rate charged to borrowers is 9.7%. borrowing noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈbɑr·ə·wɪŋ, ˈbɔr-/\n[ U ] Jefferson opposed government borrowing.\nAdd to word list\nAdd to word list\nFINANCE, BANKING to take money from a bank or other financial organization with the intention of paying it back over a period of time, usually with interest added on: He will have to borrow £300 million to make his controversial takeover bid successful. Find out how much you can afford to borrow before you decide to buy a house.borrow from sth If you borrow from a credit card, the interest can be 20%.borrow sth from sth This is a way of borrowing money from international financial markets. Countries who had borrowed heavily to pay for oil imports were hit hard.\nto ask someone to give you money for a period of time, after which you intend to give it back to them: Can I borrow £20? I'll pay you back tomorrow.borrow (sth) from sb He borrowed some money from a friend. Compare\nlendPhrasal verb\nborrow against"}