{"id":38528,"name":"borrowing","type":"noun","us_sound":"ˈbɑːr.oʊ.ɪŋ","us_link":"../audio/b/usbooks020.mp3","uk_sound":"ˈbɒr.əʊ.ɪŋ","uk_link":"../audio/b/ukborin006.mp3","content":"Add to word list\nAdd to word list\nthe fact of borrowing money, especially from a bank, or the amount that is borrowed: Public borrowing has increased in recent years. The state is precariously close to its borrowing limit. See\nborrow\nMore examplesFewer examplesMany institutions rely on short-term borrowing.Borrowing costs have increased in recent months.The deficit is financed by borrowing from abroad.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay down something\npay someone/something back\nreceivership\nSee more results »\nAdd to word list\nAdd to word list\nthe act of borrowing money or the amount of money that a person, company, government, etc. borrows: Deficit spending and foreign borrowing are reaching levels that could threaten the nation's future growth. Credit card borrowing was down £400,000 in November.short-term/medium-term/long-term borrowing An overdraft is not suitable for long-term borrowing.reduce/cut/control borrowing Government debt interest is projected to flatten out as borrowing is reduced.increase/encourage borrowing Low interest rates encourage borrowing, thereby stimulating demand for goods. See also\nbank borrowing\nconsumer borrowing\ncorporate borrowing\nfederal borrowing\ngovernment borrowing\nmortgage borrowing\npublic borrowing\nborrowings [ plural ]\nthe amount of money that a person, company, government, etc. borrows: The chairman recently reported that bank borrowings were down and profits were up eightfold.repay/clear borrowings Repay personal borrowings first, before borrowings for business purposes. long-term/short-term borrowings reduce/cut borrowings See also\nnet borrowings"}