{"id":38720,"name":"bother","type":"verb","us_sound":"ˈbɑː.ðɚ","us_link":"../audio/b/bother.mp3","uk_sound":"ˈbɒð.ər","uk_link":"../audio/b/ukborin028.mp3","content":"bother verb\n(MAKE AN EFFORT)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to make the effort to do something: [ + to infinitive ] He hasn't even bothered to write. You could have phoned us but you just didn't bother. [ + -ing verb ] Don't bother making the bed - I'll do it later. [ + -ing verb or + to infinitive ] You'd have found it if you'd bothered looking/to look.why bother You won't get any credit for doing it, so why bother? can't be bothered B2 mainly UK informal\nIf you can't be bothered doing/to do something, you are too lazy or tired to do it: I can't be bothered to iron my clothes.\nSee more\nMore examplesFewer examplesI don't know why he bothers to bet - his horses always come in last.Don't bother drying the pans - just leave them to drain.It annoys me that she didn't bother to phone.Why bother getting up at all when you don't have a job to go to?They went to a lot of trouble for their dinner party, but half the guests didn't bother to turn up.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\ngrantsmanship\nseek\nshoot\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nstrain after/for effect idiom\nSee more results »\nbother verb\n(WORRY)\nB2 [ T ] to make someone feel worried or upset: Does it bother you that he's out so much of the time? Living on my own has never bothered me. I don't care if he doesn't come - it doesn't bother me. [ + that ] It bothers me that he doesn't seem to notice.\nMore examplesFewer examplesThe idea of going grey doesn't bother me, but I'd hate to go bald.\"He can do what he likes - it doesn't bother me, \" she said airily.It doesn't bother me what people think.It bothered him that no-one had taken the trouble to contact him.She doesn't seem at all bothered about her exam results.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nhit/touch a (raw) nerve idiom\nnerve\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\nshatteringly\ntear\ntoxic\nSee more results »\nbother verb\n(ANNOY)\nA2 [ T ] to annoy or cause problems for someone: Don't bother your father when he's working.sorry to bother you I'm sorry to bother you, but could you help me lift this suitcase?bother someone with something I didn't want to bother her with work matters on her day off. The noise was beginning to bother us, so we left. She threatened to call the police if he didn't stop bothering her.\nThesaurus: synonyms, antonyms, and examples\nto annoy someoneannoyIt annoys me that you're always late.botherIt bothers me that you don't help with the washing up.irritateAfter a while her behaviour really began to irritate me.peeveWhat peeved her most was that he hadn't even called her.bugHe's been bugging me all morning.aggravateIt really aggravates me the way he never thanks me for what I've done.\nSee more results »\nMore examplesFewer examplesShe looked busy and I didn't want to bother her.If the noise bothers you I'll switch it off.The neighbours make a bit of noise but it doesn't bother me.Will it bother you if I have the TV on?I didn't want to bother her when she has so many problems of her own.\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoy\nbend\ngo too far idiom\ngoat\ngrate\nhack someone off\nharass\njoke\nnark\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\nset someone's teeth on edge idiom\ntit\ntroll\nSee more results »\nbother noun\n(EFFORT)\n[ U ] trouble or problems: I can take you there - it's really no bother. Please don't go to any bother on my account (= don't make any special effort for me).UK I had a bit of bother getting hold of his phone number. the bother\nthe effort that is necessary to achieve something: Some people don't get married because they don't want the bother. It hardly seems worth the bother to go all that way just for two nights. If this change is going to disrupt people's lives so much, it's not worth the bother. Many employers don't want to go through the bother of sponsoring a worker for a visa. You might as well shave off your beard and save yourself the bother. She asked the question, which spared me the bother.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbulky\nburden\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nbother noun\n(ANNOYING)\n[ S ] UK an annoying person or situation: I'm sorry to be a bother, but could I have that number again? It's such a bother having to do everything twice. Synonyms\nannoyance\nbore (ANNOYING) informal\ninconvenience\nirritant (MAKING ANGRY)\nnuisance\na pain (in the neck) informal\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that annoys youannoyanceThe café was cash only, which was a minor annoyance as I only had my credit card with me. nuisanceIt's a nuisance to have to drive to the nearest shop.inconvenienceThank you for holding - we apologize for the inconvenience.irritationThe CEO's poor communication skills became a source of irritation to the company's investors.irritantThe noise of the building work is a constant irritant.boreIt's such a bore to have to pack everything up again.\nSee more results »\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbulky\nburden\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nused to express anger: Oh bother! It's raining and I left my umbrella at home.\nSMART Vocabulary: related words and phrases\nExpressions of anger\nay\nbally\nbeg\nbiscuit\nblast\nblasted\nbloody\ndickens\ndrat\ndratted\negad\nfie\nflaming\nflip\nla\nmarry\nneed\nprecious\nput/stick that in your pipe and smoke it! idiom\nrats\nSee more results »\nbother verb\n(MAKE AN EFFORT)\nAdd to word list\nAdd to word list\n[ I ] to make an effort to do something, esp. something that is not convenient: You won’t get any credit for doing it, so why bother? Don’t bother doing the laundry. [ + to infinitive ] He didn’t even bother to say goodbye.\nbother verb\n(ANNOY)\n[ I/T ] to annoy, worry, or cause problems for someone: [ T ] The heat was beginning to bother him, so he sat down. [ T ] Does it bother you if your children aren’t interested?\nbother noun [U]\n(EFFORT)\na big effort: I’m not sure gardening is worth the bother.\nbother noun [U]\n(WORRY)\nsomething that annoys or causes problems for someone: That dog has never been a bother to anyone."}