{"id":38719,"name":"both","type":"predeterminer","us_sound":"boʊθ","us_link":"../audio/b/both.mp3","uk_sound":"bəʊθ","uk_link":"../audio/b/ukborin027.mp3","content":"Add to word list\nAdd to word list\nA1 (referring to) two people or things together: Both my parents are teachers.both of whom They have two children, both of whom live abroad.both of which She has written two novels, both of which have been made into television series. Both Mike and Jim have red hair/Mike and Jim both have red hair.both of them I loved both of them.them both I loved them both. The problem with both of these proposals is that they are hopelessly impractical.both of us Are both of us invited, or just you? Would you like milk or sugar or both?both something and something Both men and women have complained about the advertisement. I felt both happy and sad at the same time.both sides I think it's important to listen to both sides of the argument. Improved childcare facilities would benefit both sexes, not just women. I failed my driving test because I didn't keep both hands on the steering wheel.\nMore examplesFewer examplesHe embraced her, kissing her on both cheeks.This room serves as both a study and a dining room.After the crash both drivers got out and inspected their cars for damage.The two scientists both made the same discovery independently, at roughly the same time.The recipe is given in both metric and imperial measures.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\nany\napiece\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nGrammar\nBothWe use both to refer to two things or people together: …\nBoth with nounsWhen we use both before a determiner (e.g. a/an, the, her, his) + noun, both and both of can be used: …\nBoth with pronounsWe can use both after a subject pronoun or an object pronoun: …\nBoth as a pronounWe can use both on its own as a pronoun: …\nBoth: positionIf both refers to the subject of a clause, we can use it in the normal mid position for adverbs, between the subject and main verb, after a modal verb or the first auxiliary verb, or after be as a main verb: …\nBoth in short answersWe use both on its own in short answers: …\nBoth of or neither of in negative clausesWe usually use neither of rather than both of … not in negative clauses: …\nBoth … and as a linking expressionWe use both … and to emphasise the link between two things. This makes a stronger connection than and alone: …\nBoth: typical errorsWe don’t use both with a negative verb; we use either instead: …\nAdd to word list\nAdd to word list\nused to refer to two people or things together: Would you like milk or sugar or both in your coffee? If both parents work, who will care for the kids? Are both of us invited, or just you? Keep both hands on the steering wheel."}