{"id":38825,"name":"bottom","type":"noun","us_sound":"ˈbɑː.t̬əm","us_link":"../audio/b/bottom.mp3","uk_sound":"ˈbɒt.əm","uk_link":"../audio/b/ukbothe007.mp3","content":"bottom noun\n(LOWEST PLACE)\nAdd to word list\nAdd to word list\nA1 [ C usually singular ] the lowest part of something: He stood at the bottom of the stairs and called up to me. Extra information will be found at the bottom of the page. The ship had sunk to the bottom of the sea/the sea bottom. At school, Einstein was (at the) bottom of (= the least successful student in) his class. The manager of the hotel started at the bottom (= in one of the least important jobs) 30 years ago, as a porter. The rich usually get richer, while the people at the bottom (= at the lowest position in society) stay there. bottoms [ plural ]\nthe lower part of a piece of clothing that consists of two parts: I've found my bikini bottoms but not my top.\nSee more\nMore examplesFewer examplesThe Titanic was a passenger ship which sank to the bottom of the ocean in 1912.Sign your name in the blank space at the bottom of the form.He found my letter at the very bottom of the pile.The water in the lake is so clear that you can see the bottom.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\ntip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces of objects\nbottom noun\n(IN BASEBALL)\n[ C usually singular ] in baseball, the second part of an inning (= period of play), when the team that is playing at home (= on its own field) has its turn to try to hit the ball and score: He made a crucial error in the bottom of the ninth inning. Cleveland scored a run in the bottom of the second. Compare\ntop\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nbottom noun\n(FARTHEST PART)\nB1 [ C usually singular ] the farthest part of something: His feet stuck out from the bottom of the bed.UK They live at the bottom of our street (= the other end of the street from us).\nMore examplesFewer examplesWe took all the rubbish to the bottom of the garden and burned it.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\ntip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces of objects\nbottom noun\n(BODY PART)\nB1 [ C ] the part of your body that you sit on: She slipped and fell on her bottom.\nMore examplesFewer examplesShe was wearing a tiny skirt that only just covered her bottom.Powder the baby's bottom to stop it chafing.She gave him a smart smack on the bottom.Stand up straight, tuck your tummy in and tuck your bottom under.That waiter just pinched my bottom!\nSMART Vocabulary: related words and phrases\nThe buttocks\narse\nass\nback end\nbackside\nbot\nbum\nbun\nbutt\nbuttock\nduff\nfanny\nfundament\ngluteal\nposterior\nprat\nrear\nrump\nseat\ntail\ntush\nSee more results »\nIdioms\nat bottom\nbe at the bottom of something\nbottoms up!\nfrom the bottom of your heart\nget to the bottom of something\nthe bottom drops/falls out of the market\nbottom noun\n(LOWEST PART)\nAdd to word list\nAdd to word list\n[ C usually sing ] the lowest part of something: He stood at the bottom of the stairs and called up to me.\n[ C usually sing ] A bottom is the lower part of an item of clothing that consists of two parts: pajama bottoms\n[ C usually sing ] The bottom is also the least important position: The manager of the hotel started at the bottom 30 years ago.\nbottom noun\n(BODY PART)\n[ C ] the buttocks\nAdd to word list\nAdd to word list\n[ S or U ] the lowest or worst level of something: hit/reach bottom The Nasdaq fell 29.5% but investors recouped all of their losses 7 weeks after stocks hit bottom.at the bottom There was a job for him in the company, as long as he was prepared to start at the bottom.at the bottom of sth The time to buy is at the bottom of a recession.\n[ S ] the lowest part of something: at the bottom (of sth) Click on \"save page\" at the bottom of the page.\nthe bottom drops/falls out of the market\nECONOMICS, STOCK MARKET used when a product or share has reached its lowest price and people have stopped buying it: The dot-com bubble burst and the bottom fell out of the tech market. When the bottom dropped out of the stock market, he lost money.\nlowest in a range of levels: the bottom end/level The flotation could produce a £132m profit at the top end of the range and £59m at the bottom end. That still leaves us in the bottom half of spending levels in the EU.\nlowest in position: the bottom corner/edge/part The navigation buttons are in the bottom part of the window."}