{"id":38910,"name":"bougie","type":"adjective","us_sound":"ˈbuː.ʒi","us_link":"../audio/b/cdo0318usboug0628.mp3","uk_sound":"ˈbuː.ʒi","uk_link":"../audio/b/cdo0318ukboug0206.mp3","content":"Add to word list\nAdd to word list\nbelonging to or typical of the middle class (= a social group between the very rich and the poor), especially in giving a lot of importance to money, education, and social class, or in liking and wanting expensive and unusual things: People in the neighbourhood have strong opinions about inauthentic bougie snobs. It's one of those places where you pay a lot of money but don't get much. Too bougie for me!\nMore examplesFewer examplesOat milk, soy milk, almond milk - bougie people like any \"milk\" that doesn't actually come from a cow. Doing an unpaid internship is kind of bougie because it means, hey, I can afford to work for no money!There was mostly a bougie crowd, but it still felt very community-oriented.\nSMART Vocabulary: related words and phrases\nClass & class-consciousness in general\nanti-bourgeois\nanti-snob\narriviste\nbourgeois\ngo/come down in the world idiom\ngo/come up in the world idiom\nheap\nhigh society\npetit bourgeois\npetty bourgeois\npleb\nplebby\nsocial climbing\nsocial mobility\nthe bottom of the heap idiom\nthe gentry\nthe petite bourgeoisie\ntrailer trash\nunderclass\nupper class\nSee more results »\nbougie noun [C]\n(PERSON)\nUS informal disapproving someone who belongs to the middle class (= a social group between the very rich and the poor), especially someone who supports traditional customs and values, or gives a lot of importance to money, education, and social class, or likes and wants expensive and unusual things: There's nothing bougies love more than dinner parties.\nMore examplesFewer examplesYou're such a bougie with your artisan bread and organic veggies.As a black man with degrees from Princeton and Harvard who uses \"summer\" as a verb to explain what he does on Martha's Vineyard, he is used to being called a bougie.\nSMART Vocabulary: related words and phrases\nClass & class-consciousness in general\nanti-bourgeois\nanti-snob\narriviste\nbourgeois\ngo/come down in the world idiom\ngo/come up in the world idiom\nheap\nhigh society\npetit bourgeois\npetty bourgeois\npleb\nplebby\nsocial climbing\nsocial mobility\nthe bottom of the heap idiom\nthe gentry\nthe petite bourgeoisie\ntrailer trash\nunderclass\nupper class\nSee more results »\nbougie noun [C]\n(INSTRUMENT)\nmedical\n&#160; specialized a thin medical instrument that can bend, put into a part of the body in order to open it up, examine it, or treat it : A 54-60-F Maloney bougie was passed into the stomach.\nMore examplesFewer examplesSeveral attempts to force the endotracheal tube over a gum elastic bougie were unsuccessful.For endoscopic bougie dilation of the stricture, a guide wire will be placed in the stomach.Oesophageal dilation by the Savary-Gaillard bougie technique is an effective method for treating oesophageal stricture.One patient sustained an oesophageal perforation during passage of the bougie.\nSMART Vocabulary: related words and phrases\nMedical & surgical equipment\nbioprinting\nblood pressure monitor\ncannula\ncatheterization\ncatheterize\nclinical thermometer\nECG\nelectrocardiograph\nendoscope\nexoskeleton\nhypodermic\nincubator\nlaryngoscope\nlateral flow test\nmagnetic resonance imaging\nmicrocatheter\nnebulizer\nneedle exchange\nsyringe\nventilator\nSee more results »"}