{"id":39131,"name":"bow","type":"verb","us_sound":"baʊ","us_link":"../audio/b/bough.mp3","uk_sound":"baʊ","uk_link":"../audio/b/ukbothe014.mp3","content":"Add to word list\nAdd to word list\nto bend your head or body forward, especially as a way of showing someone respect or expressing thanks to people who have watched you perform: bow to They bowed to the Queen.bow your head We bowed our heads in prayer. He stood at the back, head bowed in silent contemplation.bow down He bowed down before (= in front of) the king and begged for mercy. Compare\ncurtsy verb\nMore examplesFewer examplesThey bowed deferentially as she came into the room.The children bowed their heads in shame.The Princess, visibly moved, kept her head bowed during the ceremony.They had to bow to the Prince.She bowed down before the King.\nSMART Vocabulary: related words and phrases\nPhysical gestures of respect\nbow down\nbow your head\nchest bump\ncurtsy\ndap\ndap someone up\ndoff\nelbow bump\nfistbump\ngenuflect\nhandshake\nhigh five\nprostrate\nprostration\nsalaam\nsalute\ntake a bow\nvail\nIdiom\nbow and scrapePhrasal verbs\nbow down to someone\nbow out\nbow to someone/something\nbow noun\n(BEND)\n[ C ] the movement of bending your head or body forward, especially as a way of showing someone respect or expressing thanks to people who have watched you perform: take a bow The audience applauded enthusiastically, and she came back on stage to take another bow.\nSMART Vocabulary: related words and phrases\nPhysical gestures of respect\nbow down\nbow your head\nchest bump\ncurtsy\ndap\ndap someone up\ndoff\nelbow bump\nfistbump\ngenuflect\nhandshake\nhigh five\nprostrate\nprostration\nsalaam\nsalute\ntake a bow\nvail\nbow noun\n(FRONT PART)\n[ C ] (also bows) the front part of a boat or ship Compare\nstern\n[ U ] in the sport of rowing, the rowing position closest to the front of the boat: She has moved from the number 5 seat to row at bow. The man in the bow seat is the youngest in the crew.\n[ C usually singular ] in the sport of rowing, the person sitting closest to the front of the boat: He was bow in his University's eight.\nSMART Vocabulary: related words and phrases\nParts of ships & boats\nabaft\nbilge water\nboathook\nboiler room\nbowline\ncleat\nescape hatch\nkeel\npaddle\nperiscope\npropeller\nprow\nrigging\nspar\nsteerage\nstem\nstrop\nsun deck\nsuperstructure\ntopsail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRowing\nIdiom\nfire a (warning) shot across someone's bow\nbow noun [C]\n(KNOT)\nB2 a knot with two curved parts and two loose ends, used as a decoration or to tie shoes: I tied the ribbon around the present in a pretty bow.\nAndrea Nissotti/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nbow noun [C]\n(WEAPON)\nB2 a weapon for shooting arrows, made of a long, thin piece of wood or fibreglass bent into a curve by a tightly stretched string: bow and arrow He made his own bow and arrows. The arrow had been shot from a bow. So-called recurve bows are used in Olympic archery competitions. See also\ncrossbow\nlongbow\nGary Ombler/Dorling Kindersley/GettyImages\nSMART Vocabulary: related words and phrases\nTarget sports\naim\narcher\narchery\narrow\narrowhead\nbullseye\nclay pigeon\ndart\ndartboard\nend\nmarksmanship\nquiver\nriflery\nringer\nshooter\nshooting gallery\ntarget\ntarget practice\ntoxophilite\ntrapshooting\nSee more results »\nbow noun [C]\n(MUSIC)\nC2 a long, thin piece of wood with hair from the tail of a horse stretched along it, used to play musical instruments that have strings: Violins are played with bows.\nChris_Tefme/iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\nIdiom\nput a bow on something\nto play an instrument that has strings, using a long, thin piece of wood with hair from the tail of a horse stretched along it: I'm not bowing, but using my fingers pizzicato. You can achieve a completely different tone by bowing the strings nearer to the bridge.\nMore examplesFewer examplesPizzicato - plucking rather than bowing - is a feature throughout the piece, but some of the pizzicato notes are played with the left hand while the right continues to bow.String players play more continuously than other musicians in the orchestra - violinists tend to bow through every movement. The string players bowed lightly, producing the most delicate sounds possible.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\nbow verb [I/T]\n(BEND)\nAdd to word list\nAdd to word list\nto bend the head or body forward as a way of showing respect, expressing thanks, or greeting someone: [ T ] We knelt and bowed our heads in prayer. Phrasal verbs\nbow down to someone\nbow out\nbow to something\nbow noun [C]\n(BEND)\nthe act of bending the head or body forward: The troupe’s artistic director took a bow with his dancers at the final curtain last night.\nbow noun [C]\n(SHIP PART)\nthe front part of a ship\nbow noun [C]\n(KNOT)\na knot with two curved parts and two loose ends, which is used as a decoration or to tie shoes\nbow noun [C]\n(WEAPON)\na weapon for shooting arrows, often used for sport, made of a long, narrow piece of wood bent into a curve by a string that is stretched tightly between its two ends\nbow noun [C]\n(INSTRUMENT)\na long, thin piece of wood with many hairs stretched between its ends, used to play musical instruments that have strings: a violin bow"}