{"id":39202,"name":"bowl","type":"noun","us_sound":"boʊl","us_link":"../audio/b/bowl.mp3","uk_sound":"bəʊl","uk_link":"../audio/b/ukboer_020.mp3","content":"bowl noun\n(DISH)\nAdd to word list\nAdd to word list\nA2 [ C ] a round container that is open at the top and is deep enough to hold fruit, sugar, etc.: a soup/cereal/salad/sugar bowl a bowl of soup/rice/porridgebowl of She eats a bowl of cereal every morning. Just put the dirty dishes in the washing-up bowl, and I'll do them later. See also\nbegging bowl\nfinger bowl\ngoldfish bowl\nmixing bowl\npunch bowl\ntoilet bowl\nantpkr/iStock/Getty Images Plus/GettyImages\n[ C ] a dish made of layers of different foods served in a bowl: The healthy acai bowl has three layers: a blended, yogurt-like bottom of acai and hemp milk, homemade granola in the middle, and fresh bananas and strawberries on top. I always order a burrito bowl with chicken, salsa, beans, corn, guacamole, and extra lettuce, because I just don't like tortillas.\nAlexander Spatari/Moment/GettyImages\n[ C ] the rounded inside part of something: toilet bowl The toilet bowl was cracked and stained, and the walls were covered in mould.\n[ C ] mainly US a large bowl-shaped building or structure, used for important sports events or musical performances: the Hollywood Bowl\ngroveb/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesIn a large bowl, mix together the flour, sugar, and raisins.Would you like a bowl of soup?I bought a wooden salad bowl at the local craft fair.Crack three eggs into a bowl and mix them together.Could you put these apples in the fruit bowl?\nSMART Vocabulary: related words and phrases\nDishes, bowls, cups & glasses\nballon\nbeaker\nbowl of something\ncake stand\nchafing dish\negg cup\nfinger bowl\nflute\nglassware\ngo-cup\nramekin\nsalver\nsaucer\nserving board\nside dish\ntrencher\ntumbler\ntureen\nwashbowl\nwine glass\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals\nPublic entertainment venues\nSports venues\nbowl noun\n(GAME)\nbowls [ U ] UK\n(US lawn bowling) a game played either outside on smooth grass or inside on an artificial surface, in which the players roll a large black or brown ball as close as possible to a smaller white ball: Bowls is one of the most popular sports in the UK.\nSee more\n[ C ] a large ball used in the game of bowls\nmatty2x4/iStock/Getty Images Plus/GettyImages\n[ C ] (in the US) a special game of American football usually played after the season has finished See also\nSuper Bowl\nSMART Vocabulary: related words and phrases\nBowls, bowling & croquet\nbias\nbisque\nboule\nbowling\nbowling alley\nbowling ball\nbowling green\ncroquet\ncrown green bowls\nduckpin bowling\nend\njack\nlawn bowling\nmallet\nskittle\nstrike\ntenpin bowling\ntenpins\nYou can also find related words, phrases, and synonyms in the topics:\nSpecific sporting events\nCompetitions, & parts of competitions\nIdiom\nlife is just a bowl of cherries\nbowl verb [I or T]\n(ROLL)\nto roll a ball along a smooth surface during a game of bowls or bowling\nSMART Vocabulary: related words and phrases\nBowls, bowling & croquet\nbias\nbisque\nboule\nbowling\nbowling alley\nbowling ball\nbowling green\ncroquet\ncrown green bowls\nduckpin bowling\nend\njack\nlawn bowling\nmallet\nskittle\nstrike\ntenpin bowling\ntenpins\nbowl verb [I or T]\n(CRICKET)\nto throw a ball towards a batsman (= the player who hits the ball) using a vertical circular movement of the arm while running: Pringle was tired after bowling for an hour.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nPhrasal verbs\nbowl down/along something\nbowl someone out\nbowl someone over\nbowl noun [C]\n(DISH)\nAdd to word list\nAdd to word list\na round container that is open at the top and is used esp. to hold liquids or other food, or the food it contains: a salad/soup bowl She eats a bowl of cereal every morning.\nA bowl is also the curved, inside part of something: a toilet bowl\nA bowl is also a large, circular building used esp. for sports, or a special football game played in it after the regular season has ended: the Rose Bowl\nbowl verb [I/T]\n(ROLL)\nto roll a ball along a smooth surface during a game, especially in the game of bowling: [ I ] It’s your turn to bowl. [ T ] She bowled a strike. Phrasal verb\nbowl someone over"}