{"id":39278,"name":"boxcar","type":"noun","us_sound":"ˈbɑːks.kɑːr","us_link":"../audio/b/boxcar.mp3","uk_sound":"ˈbɒks.kɑːr","uk_link":"../audio/b/ukbount022.mp3","content":"Add to word list\nAdd to word list\na railway carriage with a roof, used for carrying goods: The boxcar left the train tracks but it remained upright.\nFotosearch/GettyImages\nMore examplesFewer examplesThey crash into each other, like runaway boxcars hurtling off different trains.He said undocumented immigrants are in constant need of assistance, with plights ranging from getting caught in sealed boxcars to suffering snake bites.The world's largest smelter piped enough metals-laden slag into the river to fill four boxcars each day.Jackson grew up in a converted boxcar in southern Illinois.\nSMART Vocabulary: related words and phrases\nRailways: trains & parts of trains\nbogie\nboiler\nbullet train\ncarriage\ncoach\ncowcatcher\nemergency cord\nfootplate\nfreight car\nguard's van\ninterurban\nloco\nluggage van\npuffer train\nrolling stock\nshunter\nsleeper\nsleeping car\nsmoker\nthird rail\nSee more results »\n(of a number, price, etc.) very high: They are buying out smaller firms by offering them boxcar prices.\nMore examplesFewer examplesPeople don't want to pay boxcar prices to watch Slovakia play Belarus in the World Juniors.The SAT scores tend to be boxcar numbers.His horse won at boxcar odds.Their horses ran first and second and paid boxcar prices.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nbulky\nexpansive\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge amounts of money\nAdd to word list\nAdd to word list\na railroad car with sliding doors and a roof, which is used to carry freight\nAdd to word list\nAdd to word list\nUS a covered railway car with sliding doors on its sides, used for transporting goods: Eight truckloads of merchandise a day are bound for the rail yard to be loaded onto boxcars."}