{"id":37383,"name":"boy","type":"noun","us_sound":"bɔɪ","us_link":"../audio/b/boy.mp3","uk_sound":"bɔɪ","uk_link":"../audio/b/ukbount028.mp3","content":"Add to word list\nAdd to word list\nA1 a male child or, more generally, a male of any age: a teenage/adolescent boy As a young boy, my father used to walk three miles to school. You've been a very naughty boy!little boy Their little boy is very sick.boys and girls All right, boys and girls, settle down!\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nFlashpop/Stone/GettyImages the boys B2 [ plural ]\na group of male friends: He used to like spending Friday nights with the boys.\n(also our boys) an approving way of speaking about your country's soldiers: We must not forget our boys serving far from home.\nSee more one of the boys\na typical male: He plays baseball, drinks a lot of beer and generally acts like one of the boys.\nSee more\nMore examplesFewer examplesHe's an affectionate little boy.He was always a good boy, very friendly and eager to please.We've got two grandchildren - a three-year-old girl and a bouncing baby boy.She's at that age where she's starting to get interested in boys.According to witnesses, the robbery was carried out by two teenage boys.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nnipper\nonly child\noops-a-daisy\npacifier\npapoose\ntike\ntoddler\ntoilet-trained\ntomboy\ntot\nSee more results »\nIdioms\nbad/big boy\nboys will be boys\nmy (dear) boy\nthe boys in blue\nused to express excitement, worry, disappointment, etc. or to emphasize something: Boy, that was good!\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nroll\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nAdd to word list\nAdd to word list\na male child or, more generally, a male of any age: Some boys were playing basketball in the schoolyard.\nBoy sometimes means son: We have two children – a boy and a girl. Idiom\n(Oh) boy!\nAdd to word list\nAdd to word list\nabbreviation for\nbeginning of year"}