{"id":39356,"name":"brace","type":"noun","us_sound":"breɪs","us_link":"../audio/b/brace.mp3","uk_sound":"breɪs","uk_link":"../audio/b/ukboyfr010.mp3","content":"brace noun\n(SUPPORT)\nAdd to word list\nAdd to word list\n[ C ] plural braces something that is used to support or connect things, or to make something stronger: He was recently fitted with a brace for his bad back.\n[ C ] UK plural braces (US braces [ plural ]) a set of connected wires that is attached to a person's teeth in order to make them straight: I had to wear a brace for my crooked teeth when I was a teenager.\nHudzilla/GettyImages braces [ plural ]\nUK (US suspenders) a pair of narrow straps that stretch from the front of the trousers over your shoulders to the back to hold them up: a pair of braces\nUS (UK calipers) supports that are fastened to the legs of people who have difficulties with walking: The photos don't show the heavy steel braces that meant he could walk despite this condition.\nSee more\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nshore\nsinew\nunderpin\nweight-bearing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical dressings, supports & devices\nDentistry\nbrace noun\n(PAIR)\n[ C ] plural brace two things of the same type, especially two wild birds that have been killed for sport or food: a brace of pheasants\nSMART Vocabulary: related words and phrases\nNumbers: groups of things according to number\nbaker's dozen\ncompanion\ncouple\ndozen\ndyad\ndyadic\ngross\nnull\npair\nquaternity\nscore\ntriad\ntrinity\ntrio\ntwosome\nbrace verb [T]\n(SUPPORT)\nto support an object in order to stop it from falling down: The side wall of the old house was braced with a wooden support.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nshore\nsinew\nunderpin\nweight-bearing\nSee more results »\nbrace verb [T]\n(PREPARE)\nbrace yourself\nto prepare yourself physically or mentally for something unpleasant: The passengers were told to brace themselves (= to press their bodies hard against something or hold them very stiff) for a crash landing.\nSee more\nbrace verb [T]\n(PREPARE)\nAdd to word list\nAdd to word list\nto prepare yourself physically or mentally for something unpleasant: The weather forecasters told us to brace ourselves for a heavy storm.\nbrace verb [T]\n(SUPPORT)\nto support yourself or a part of your body: She braced herself against the dresser.\nTo brace an object is to support or strengthen it: You will need to brace the walls.\nbrace noun [C]\n(SUPPORT)\nsomething that supports, fastens, or strengthens: He was recently fitted with a brace for his bad back."}