{"id":39761,"name":"brainstorm","type":"verb","us_sound":"ˈbreɪn.stɔːrm","us_link":"../audio/b/brainstorm.mp3","uk_sound":"ˈbreɪn.stɔːm","uk_link":"../audio/b/ukboyfr029.mp3","content":"Add to word list\nAdd to word list\n(of a group of people) to suggest a lot of ideas for a future activity very quickly, before considering some of them more carefully: The team got together to brainstorm. I brainstorm with my colleagues to come up with new promotions and events. We brainstormed possible titles for the project. Related word\nbrainstorming\nMore examplesFewer examplesAfter 30 minutes of brainstorming we came up with the answer.We brainstorm about different dishes we could serve.Conference delegates get into groups to brainstorm marketing concepts.After brainstorming with my advisor, we came up with a method.It can be good to brainstorm a project over a drink.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nproposition\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nmainly US (UK usually brainwave) a sudden clever idea: have a brainstorm The toy's inventor was watching his children play one day when he had a brainstorm. This was a brainstorm I came up with when I was driving. The concept was the brainstorm of a worker at the plant.\nThesaurus: synonyms, antonyms, and examples\nan ideaideaI've got an idea - why don't we ask John for help?planThe plan is to hire a car when we get there.thoughtHave you had any thoughts on presents for your mother?suggestionHave you got any suggestions for improvements?brainwaveUK I wasn't sure what to do and then I had brainwave - I could ask Anna for help.brainstormUS She was stuck until she had a brainstorm and the solution came to her.\nSee more results »\nUK a sudden state of being unable to think clearly: have a brainstorm I must have had a brainstorm - I went shopping and forgot to take any money. It was a stupid brainstorm and it cost his team the victory.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nexceptionalism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nnon-dogmatic\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nsupersensible\ntenet\ntheory\nthinking\ntrope\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConfusion, confusing and feeling confused\nAdd to word list\nAdd to word list\nto suggest a lot of ideas for a future activity very quickly before considering some of them more carefully: [ I ] They brainstormed and mapped plans for dealing with problems like affordable housing and the budget shortfall. brainstorming noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈbreɪnˌstɔr·mɪŋ/\nWe need to do some brainstorming before we get down to detailed planning.\na sudden, new idea that you are enthusiastic about: They got this brainstorm that they could make a living by buying and selling antiques.\nAdd to word list\nAdd to word list\nMEETINGS to meet in a group to suggest a lot of new ideas very quickly, with the intention of considering them more carefully later: Engineers from all over the company met every couple of weeks to brainstorm. Remember all ideas are welcomed - so start brainstorming! A team will brainstorm a job description for the new leadership post.\na new, original idea or set of ideas: They have started to turn their brainstorm into a real product."}