{"id":39902,"name":"brand","type":"noun","us_sound":"brænd","us_link":"../audio/b/brand.mp3","uk_sound":"brænd","uk_link":"../audio/b/ukbrain010.mp3","content":"brand noun [C]\n(PRODUCT)\nAdd to word list\nAdd to word list\nB2 a type of product made by a particular company and sold under a particular name: brand of This isn't my usual brand of deodorant. She has worked on ad campaigns for well-known brands. Most people associate the brand with high quality. The manufacturer's brands include many popular cosmetic ranges.brand loyalty The ultimate goal of many marketing campaigns is to create brand loyalty. See also\ngeneric brand\nglobal brand\nleading brand\nluxury brand\noff-brand\non-brand\nown brand\nstore brandRelated word\nbranded\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nbusiness\n&#160; specialized the set of qualities that people connect with a particular product or organization: Our brand stands for quality and reliability. The company spent a lot of money and energy establishing its brand. His actions risk badly damaging the party's brand.\nbusiness\n&#160; specialized the set of qualities that people connect with a particular person, or the idea of themselves that the person tries to present to others: A spokesperson for the company said, \"She is the perfect ambassador for us because her personal brand is very much aligned with our corporate mission.\" I have to be careful what pictures I post on social media, because I don't want to tarnish my brand. brand of something\na particular type of something, or way of doing something: a team that plays a distinctive brand of football\nSee more\nMore examplesFewer examplesAmong young people, this brand of designer clothing is the ultimate status symbol.Our products compare favourably with all the leading brands.I always buy the same brand of toothpaste just out of habit.Freshness and modernity is part of our brand.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nConditions and characteristics\nbrand noun [C]\n(FLAME)\nliterary a piece of burning wood used to give light\nSMART Vocabulary: related words and phrases\nFire & flame\nbeacon\nblaze\nbonfire\nbushfire\ncampfire\nconflagration\ndumpster fire\nfire\nfireball\nfirebrand\nfirepit\nfirestorm\ninferno\nopen fire\nopen fireplace\npilot\nspark\nwildfire\nSee more results »\nbrand noun [C]\n(MARK)\na mark that is burned or frozen into the skin of an animal such as a cow to show who owns it: The brand was still visible on the animal's hide.\nkalimf/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nL-plate\nMaltese cross\nMorse code\npatch\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal farming - general words\nbrand verb\n(GIVE BAD NAME)\n[ T + obj + noun/adj ] to say that someone or something is a particular bad thing, usually when this is unfair: Because of one mistake he was branded a criminal. She was arrested and falsely branded a terror suspect. The media branded him racist.brand someone/something as something He claims the report unfairly branded him as a bad credit risk. His supporters immediately branded the pictures as fake.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nbrand verb\n(CREATE BRAND)\n[ T ]\n&#160; business\n&#160; specialized to make a product, organization, person, or place easy to recognize as different from others by connecting it with a particular name, design, symbol, set of qualities, etc.: In my job I've learned how to brand and promote a product. You can brand the website with your own colours and logo. They have branded the service as an ethical, environmentally-friendly investment option. brand yourself as something This is not good enough for an airline that brands itself as a premium luxury carrier. He branded himself \"The New Vegan Chef.\" Related word\nbranding\nMore examplesFewer examplesMaking a reference to New York City, Minneapolis branded itself \"the mini apple.\"We branded every store so it was instantly recognizable.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nbrand verb\n(MARK)\n[ T ] to mark an animal such as a cow by burning or freezing its skin to show you own it: The cattle were rounded up and branded.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nshear\nsheep shearing\nsheepdog\nshepherd\nslaughter\nsubtherapeutic\nteaser\nSee more results »\nbrand noun [C]\n(PRODUCT)\nAdd to word list\nAdd to word list\na type of product made by a particular company: This isn’t my usual brand of deodorant.\nbrand noun [C]\n(MARK)\na special symbol on the skin of an animal that shows it belongs to someone: cattle brands\nbrand verb [T]\n(JUDGE)\nto consider or refer to someone as being bad or as having done something bad: They branded him as a man without moral convictions.\nbrand verb [T]\n(MARK)\nto mark the skin of an animal with a particular symbol to show that you own it\nAdd to word list\nAdd to word list\nthe name of a product produced or sold by a particular company: It was to become the leading brand of specialty coffee in North America. The group is expanding its key brands north of the border. a well-known/popular/top-selling brand The supermarket's own label range has now surpassed a number of top selling brands. a fashion/fast food/car brand domestic/international/global brands premium/luxury/quality brands See also\naspirational brand\ncommodity brand\nconsumer brand\ndealer's brand\nfamily brand\nhouse brand\nprivate brand\nmanufacturer's brand\nname-brand\nnational brand\nown-brand\nsignature brand\nstandalone brand\nstore-brand\nto give a product a particular name or label in order to sell it: We want these local craftsmen to realize the commercial benefits of branding these products.brand sth as sth Many consumers are more likely to buy products branded as Fairtrade. See also\nbranded\nbranding"}