{"id":39836,"name":"branch","type":"noun","us_sound":"bræntʃ","us_link":"../audio/b/branch.mp3","uk_sound":"brɑːntʃ","uk_link":"../audio/b/ukbrain009.mp3","content":"branch noun [C]\n(PART)\nAdd to word list\nAdd to word list\nB2 a part of something larger: branch of Immunology is a branch of biological science. One branch of their family (= one group of relatives) emigrated to Brazil. In the US, the president is part of the executive branch of the government.\nB1 one of the offices or groups that form part of a large business organization: local branch I used to work in the local branch of a large bank.branch manager She's a branch manager.branch office Take the forms into your local branch office.\nMore examplesFewer examplesThe bank has three branches in Norwich, and over three hundred countrywide.Police officers from the organized crime branch have raided solicitors'' offices in central London.The customer has only to bring the goods in to any branch and an immediate, no-questions-asked refund or replacement will be provided.To contact our Australian branch, email us at info@cambridge.edu.au.The company has announced the closure of several of its rural branches.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOffice practices\nbranch noun [C]\n(TREE PART)\nB1 one of the parts of a tree that grows out from the main trunk and has leaves, flowers, or fruit on it: bare/leafy/flowering branches The fruit on the lower branches was protected from the sun.overhanging branch Watch out for overhanging branches.\nFrank Carter/Lonely Planet Images/GettyImages\nSMART Vocabulary: related words and phrases\nParts of plants\n-stemmed\nbilobed\nblade\nbulb\ncaning\ncascara sagrada\ncorolla\nendodermis\nknot\npine needle\nrhizome\nspine\nsprig\nsting\nstinger\nstoma\nstubbly\ntea leaf\ntrilobed\ntubule\nSee more results »\nbranch noun [C]\n(RIVER/ROAD)\na part of a river or road that leaves the main part: This branch of the river eventually empties into the Atlantic.\nSMART Vocabulary: related words and phrases\nParts of watercourses\nartesian well\nbackwater\nbasin\nconfluence\ndrainage basin\nestuarine\nfirth\nhead\ninterbasin\ninterchannel\nlock\nlock-keeper\nmeander\nmooring\nnarrows\nreach\nspring\ntributary\nwater table\nweir\nSee more results »\nbranch noun [C]\n(BLOOD VESSEL)\nmedical\n&#160; specialized a smaller blood vessel or nerve that grows out of the main part\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nbranch verb [I]\n(TREE)\nto produce branches: branch out The top of the tree had been cut off to encourage it to branch out lower down.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nbranch verb [I]\n(SPLIT)\nto divide into two: The road branches at the bottom of the hill.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nPhrasal verbs\nbranch off\nbranch off something\nbranch out\nbranch noun [C]\n(TREE PART)\nAdd to word list\nAdd to word list\none of the parts of a tree that grows out from the main trunk and has leaves, flowers, or fruit on it: After the storm, the ground was covered with twigs and branches. fig. This branch of the river (= lesser part that joins the main flow) eventually empties into the Atlantic Ocean.\nbranch noun [C]\n(PART)\na part of something larger: Pediatrics is a branch of medicine (= a subject that is part of a larger subject).\nA branch is one of the offices or groups that form part of a large business organization: a local branch of the bank\nbranch verb [I]\n(SEPARATE)\nto separate from a main part and go in a new direction: fig. We drove down a narrow track that branched off from the main road .\nPhrasal verb\nbranch out\nAdd to word list\nAdd to word list\nCOMMERCE one of the local offices of a large company, such as a bank, which is open to the public: to close/open a branch Many banks have promoted online services and closed branches.a branch of sth You should be able to walk into a branch of the building society anywhere in the country to deposit or withdraw money. Contact your local branch to arrange an appointment with a consultant. She has been a customer of the same bank branch for decades. The company operates in 18 states and has 45 branch offices. a domestic/foreign/overseas branch\nGOVERNMENT a division of a government or large organization with a particular responsibility: the executive/legislative/judicial branch The authority lets the executive branch draft trade deals that Congress could reject but not change. This latest investigation is being held by the disciplinary branch of the accountancy profession."}