{"id":40051,"name":"brat","type":"noun","us_sound":"bræt","us_link":"../audio/b/brat.mp3","uk_sound":"bræt","uk_link":"../audio/b/ukbrain024.mp3","content":"brat noun [C]\n(CHILD)\nAdd to word list\nAdd to word list\ninformal disapproving a child, especially one who behaves badly: Stop it, you're being a brat! My sister is coming over at the weekend with her brats.spoilt brat She's behaving like a spoilt brat.\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nUS the child of someone in the armed forces (= the army, navy, etc.): army brat He grew up an army brat, always on the move.military brat She was born as a military brat in Heidelberg, Germany. How would you describe your military childhood and the brat experience?\nMore examplesFewer examplesWhen I was younger I was a complete brat.She doesn't see why she should listen to other people talking endlessly about their brats.She struck him as a typical Hollywood brat - neglected yet indulged, selfish, and forced to grow up too fast.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncrawler\ndesigner baby\ndevil\ndiddums\ndummy\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParents & children\nbrat noun [C]\n(SAUSAGE)\nUS informal a type of sausage made from pork (= meat from a pig), spices, and herbs. Brat is short for\nbratwurst : People queued up at the food vendors for a brat with kraut. First, put 5 brats in a pan, then add 2 cans of beer.\nMore examplesFewer examplesTheir brats are now sold at about 4,000 fast food outlets nationwide.I eat venison steaks and roasts, but my kids prefer brats and Polish sausage.I gulped down a can of beer and devoured a couple of brats.\nSMART Vocabulary: related words and phrases\nSausages, burgers & stuffings\nandouille\nandouillette\nbaloney\nbarbecue\nbeefburger\ncocktail sausage\ncorn dog\ncorned beef\ncroquette\nCumberland sausage\nknackwurst\nknockwurst\nlinguiça\nliver sausage\nloaf\nsausage\nsausage meat\nsaveloy\nslider\nsnag\nSee more results »\nAdd to word list\nAdd to word list\na child who behaves badly or one you do not like: My nephew is a little spoiled brat."}