{"id":40094,"name":"brave","type":"adjective","us_sound":"breɪv","us_link":"../audio/b/brave.mp3","uk_sound":"breɪv","uk_link":"../audio/b/ukbrain026.mp3","content":"Add to word list\nAdd to word list\nB1 showing no fear of dangerous or difficult things: a brave soldier It was a brave decision to quit her job and start her own business. She was very brave to learn to ski at 50. Of the three organizations criticized, only one was brave enough to face the press. Richards has made a brave attempt to answer his critics. This action will cause problems, despite the bank's brave talk/words about carrying on as if nothing had happened.\nThesaurus: synonyms, antonyms, and examples\nbravebraveThe King was a brave warrior.courageousShe was a courageous woman who never complained about her illness.daringHe made a daring escape from his kidnappers.boldI wasn't bold enough to leave my job.adventurousShe's a very adventurous person and enjoys mountain climbing.\nSee more results »\nMore examplesFewer examplesThe four soldiers are to receive citations from the president for their brave actions.Sailing the Atlantic in such a tiny boat wasn't so much brave as foolhardy.Nelson Mandela is revered for his brave fight against apartheid.It is a brave person who will die for their beliefs.Let us make sure that these brave men did not die for nothing.\nSMART Vocabulary: related words and phrases\nBrave and courageous\nadventurous\nadventurously\naudacious\nballsy\nbe man enough to do something idiom\nfaint heart never won fair lady/maiden idiom\nfearless\nfearlessly\ngallant\ngallantly\nlion-hearted\nman up\nmanfully\nmuster something up\nnerves of steel idiom\nunflinchingly\nunperturbed\nvaliant\nvaliantly\nvalorously\nSee more results »\nRelated word\nbravelyIdiom\nput on a brave face\nto deal with an unpleasant or difficult situation: Let's brave the snow and go for a walk (= go for a walk even though it is snowing).literary She braved the wrath of her parents by refusing to marry the man they had chosen. Synonyms\nendure\nweather\nSMART Vocabulary: related words and phrases\nBrave and courageous\nadventurous\nadventurously\naudacious\nballsy\nbe man enough to do something idiom\nfaint heart never won fair lady/maiden idiom\nfearless\nfearlessly\ngallant\ngallantly\nlion-hearted\nman up\nmanfully\nmuster something up\nnerves of steel idiom\nunflinchingly\nunperturbed\nvaliant\nvaliantly\nvalorously\nSee more results »\na young Native American warrior (= fighting man). This word is usually considered offensive.\nSMART Vocabulary: related words and phrases\nSoldiers in the past\ncavalryman\ncenturion\nconquistador\ndecurion\nknight errant\nknightly\nlegion\nmusketeer\nninja\npaladin\nsamurai\nSaracen\nthe Allies\nwarrior\nAdd to word list\nAdd to word list\nshowing no fear of dangerous or difficult things: She liked to read stories of brave pioneer women who had crossed the country in covered wagons. Of the three organizations criticized, only one was brave enough to face the press. bravely adverb us\nYour browser doesn't support HTML5 audio\n/ˈbreɪv·li/\n\"The pain isn’t so bad,\" she said bravely. bravery noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈbreɪ·və·ri, ˈbreɪv·ri/\nThey were awarded medals for bravery.\nto deal with dangerous or difficult things without fear: He braved the anger/wrath of his father by quitting law school and becoming an artist."}