{"id":40241,"name":"breakaway","type":"noun","us_sound":"ˈbreɪ.kə.weɪ","us_link":"../audio/b/usbraci028.mp3","uk_sound":"ˈbreɪ.kə.weɪ","uk_link":"../audio/b/ukbraw_025.mp3","content":"Add to word list\nAdd to word list\nan act of separating from a group, especially because of disagreement: The sports association accepted the inevitability of a breakaway by the elite clubs. The breakaway group formed a new political party.\nsports\n&#160; specialized in the sport of cycle racing (= racing on bicycles), a rider or a small group of riders that goes ahead of the main group and tries to keep at a distance from it, or an occasion when this happens: The peloton usually catches the breakaway before the finish line. Without radio contact, if a group breaks away from the peloton the riders usually don't know who is in the breakaway. There was a breakaway shortly before the first climb. Solo breakaways are almost never successful. The breakaway riders were far enough ahead to have hopes of a win. Compare\npeloton\nsports\n&#160; specialized in many team sports such as football, basketball, and hockey, the action of running or moving ahead of all the other players towards the goal: He scored on a breakaway. They have some good players now who are very fast on the breakaway. Soon afterwards she scored another brilliant breakaway goal.\nMore examplesFewer examplesThe country experienced a series of regional conflicts and breakaways. One more crisis or breakaway and the party could be finished.Retaking control of the breakaway regions was his priority.What are they going to do—start their own breakaway religion?Many of the people on the list were part of the breakaway faction.Most riders in the peloton usually don't know who is in the breakaway. Teams defending the yellow jersey will usually devote riders to chasing down breakaways. Their senior guard scored a breakaway basket to put his team on top.The team were forced to rely on breakaway runs from their star forward.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\ndisunity\npartible\nperiodization\nperiodize\npolarize\npolarized\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nGeneral terms used in ball sports\nAdd to word list\nAdd to word list\nindependent after leaving another group: a breakaway republic/territory"}