{"id":40268,"name":"breakout","type":"noun","us_sound":"ˈbreɪk.aʊt","us_link":"../audio/b/breakout.mp3","uk_sound":"ˈbreɪk.aʊt","uk_link":"../audio/b/ukbreak001.mp3","content":"Add to word list\nAdd to word list\na violent escape, especially by a group, from prison: There has been a mass breakout from one of Germany's top security jails. Synonyms\ngaolbreak UK\njailbreakCompare\nmake a break (from/for)See also\nbreak out (ESCAPE)\nSMART Vocabulary: related words and phrases\nRunning away and escaping\nabscond\nabscond from somewhere\nabscond with someone/something\nback away\nback off\nelude\nescapology\nextrication\nflee\nfugitive\nheel\nleg\nloose\nrunaway\nscarce\nscarper\nscram\nshake something off\nthrow\nunderground\nSee more results »\nbreakout adjective [before noun]\n(SUCCESSFUL)\nmainly US used to describe someone or something that suddenly becomes very well known or successful in a particular type of activity, or an achievement that helps them do this: She was the breakout star of this year's Women's World Cup. This was the breakout book by one of the most original writers of his generation.\nMore examplesFewer examplesJust a few days before going into bookshops, Time magazine declared it \"the breakout fiction debut of the year\".Sam Rockwell plays the role in the breakout performance of the year.Carice Van Houten was the breakout star of \"Black Book\".The drama went on to be the breakout success of the new TV season. He ended the show with his breakout hit Crazy.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nbelt\nboom\nfeat\nfruition\nhave something under your belt idiom\nhe who laughs last, laughs longest/best idiom\nlaugh\nprospect\nsecret sauce\nsellout\nsense of achievement\nstratosphere\ntear\nSee more results »\nbreakout adjective [before noun]\n(MEETING)\nused in connection with smaller groups that separate from a meeting to discuss a particular issue, before returning to the main meeting: a breakout session/meeting See also\nbreakout room\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nAdd to word list\nAdd to word list\nan increase, especially a sudden one: With little change in the stock market, the long-hoped-for breakout still appears to be a few weeks away. We are hoping for a major breakout in profits later this year.\nUS →\nbreakdown\nvery successful, especially when compared to something else: They described 2008 as a breakout year for European technology firms.\nrelating to a meeting of one or more small groups that are part of a larger group: The CEO gave a speech in the morning, and breakout sessions followed in the afternoon. The conference centre has eight break-out rooms."}