{"id":80586,"name":"breastfeeding","type":"noun","us_sound":"ˈbrest.fiː.dɪŋ","us_link":"../audio/b/cus00269.mp3","uk_sound":"ˈbrest.fiː.dɪŋ","uk_link":"../audio/b/cuk00170.mp3","content":"Add to word list\nAdd to word list\na way of feeding a baby directly with milk from a woman's breasts: A good diet is essential during breastfeeding. Breastfeeding can be difficult at first.\nMore examplesFewer examplesNew mothers are taught all about the benefits of breastfeeding.The baby would fall asleep after just five minutes of breastfeeding.For many reasons, breastfeeding isn't always possible.\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncaretaking\nchild-rearing\nchildless\nchildlessness\nchildmind\nlawnmower parent\nlooked-after\nmothering\nnanny\nnon-custodial\nstay-at-home\nswaddle\nunadoptable\nunadopted\nunweaned\nSee more results »\nSee\nbreastfeed\nA breastfeeding mother feeds her baby directly with milk from her breasts. A breastfeeding baby is fed in this way: Most breastfeeding mothers can eat whatever they want without problems. The oily compounds in chillis may upset breastfeeding babies.\nrelating to the activity of feeding a baby directly with milk from the breasts: Linda has been a breastfeeding counsellor for 20 years. The paper analyses the breastfeeding information supplied by manufacturers of artificial infant milk.\nMore examplesFewer examplesWe sell stylish clothing for breastfeeding mums.The woman gained international attention when she was separated from her breastfeeding baby by immigration officials. Britain has the lowest breastfeeding rate in Europe.\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncaretaking\nchild-rearing\nchildless\nchildlessness\nchildmind\nlawnmower parent\nlooked-after\nmothering\nnanny\nnon-custodial\nstay-at-home\nswaddle\nunadoptable\nunadopted\nunweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChildren & babies\nSee\nbreastfeed"}