{"id":40276,"name":"breakthrough","type":"noun","us_sound":"ˈbreɪk.θruː","us_link":"../audio/b/breakthrough.mp3","uk_sound":"ˈbreɪk.θruː","uk_link":"../audio/b/ukbreak002.mp3","content":"Add to word list\nAdd to word list\nB2 an important discovery or event that helps to improve a situation or provide an answer to a problem: Scientists are hoping for a breakthrough in the search for a cure for cancer. A major breakthrough in negotiations has been achieved.\nMore examplesFewer examplesThis drug has been heralded as a major breakthrough in the fight against breast cancer.They had minor breakthroughs but real success eluded them.Biological research has often been a precursor to medical breakthroughs which benefit patients.The leaders emphasized that a substantial breakthrough had been achieved, but there was more work to be done.Researchers reported another important breakthrough in cancer research.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbring something to light idiom\ncatch someone red-handed idiom\ncatch someone with their pants/trousers down idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTurning points & deciding moments\nvery important in the progress or development of something or someone, because of solving a big problem or making a big improvement: The article described the impact of their breakthrough discovery of the structure of DNA. The grant funds innovative projects that may lead to breakthrough improvements in health care.\nMore examplesFewer examplesThe first breakthrough cure for tuberculosis was streptomycin in the 1940s.The year ahead isn't expected to produce any breakthrough technologies.I finally realized that the common factor in all these failed relationships was me. It was a breakthrough moment.Her depiction of the young Queen Elizabeth was her breakthrough role.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbring something to light idiom\ncatch someone red-handed idiom\ncatch someone with their pants/trousers down idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTurning points & deciding moments\nAdd to word list\nAdd to word list\nan important discovery or development that helps to solve a problem: The Polaroid camera was a technological breakthrough.\nAdd to word list\nAdd to word list\nan important discovery or event that helps to improve a situation or provide an answer to a problem: breakthrough in sth The development of digital imagery was a breakthrough in computer technology.achieve/make a breakthrough At last a breakthrough in negotiations has been achieved. a major/real/significant breakthrough"}