{"id":40184,"name":"breach","type":"noun","us_sound":"briːtʃ","us_link":"../audio/b/breach.mp3","uk_sound":"briːtʃ","uk_link":"../audio/b/ukbraw_013.mp3","content":"breach noun [C]\n(BROKEN PROMISE/RULE)\nAdd to word list\nAdd to word list\nan act of breaking a law, promise, agreement, or relationship: breach of They felt that our discussions with other companies constituted a breach of our agreement.breach of contract He was sued for breach of contract.security breach There have been ten serious security breaches (= breaks in the security system) at the airport already this year. (a) breach of the peace law\n&#160; specialized\n(an example of) illegal noisy or violent behaviour in a public place: Ten percent of this group were in persistent trouble for minor breaches of the peace.\nSee more be in breach of something formal\nto be breaking a particular law or rule: The theatre was in breach of the safety laws for having no fire doors.\nSee more\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments\nbreach noun [C]\n(OPENING)\nformal a hole that is made in a wall or in another structure being used for protection during an attack: A cannon ball had made a breach in their castle walls. Compare\nchink noun (CRACK)\ncleft\ncrack noun (NARROW SPACE)\ncranny\ncrevice\nfissure\ngap (HOLE)\ninterstice formal\nopening noun (HOLE)\nslit noun\nslot noun (LONG HOLE)\nSMART Vocabulary: related words and phrases\nMaking holes in things\nbore\nborer\ncutout\ndent\ndrill\ngouge\nhole\nperforate\nperforated\npierce\npiercing\nprick\nprobe\npunch\npuncture\nrebore\nredrill\nriddle\nundrilled\nbreach verb [T]\n(BREAK PROMISE/RULE)\nto break a law, promise, agreement, or relationship: They breached the agreement they had made with their employer.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking & breaking promises & commitments\nbreach verb [T]\n(MAKE OPENING)\nto make an opening in a wall or fence, especially in order to attack someone or something behind it: Their defences were easily breached.\nSMART Vocabulary: related words and phrases\nMaking holes in things\nbore\nborer\ncutout\ndent\ndrill\ngouge\nhole\nperforate\nperforated\npierce\npiercing\nprick\nprobe\npunch\npuncture\nrebore\nredrill\nriddle\nundrilled\nbreach noun [C]\n(BREAK)\nAdd to word list\nAdd to word list\nan act of breaking a rule, law, custom, or practice: In a breach of security, unauthorized people were able to board the plane.\nbreach noun [C]\n(OPENING)\nan opening in a wall or fence or in a line of military defense breach verb [ T ] us\nYour browser doesn't support HTML5 audio\n/britʃ/\nThe river breached the dams.\nAdd to word list\nAdd to word list\na failure to obey a law or to do what was promised or agreed: breach of sth Companies face fines of up to €75,000 for each breach of the legislation.be/constitute a breach To publish in this form would constitute a breach of copyright.a clear/flagrant/blatant breach His refusal to account for the money was a flagrant breach of all rules of professional conduct. a serious/fundamental/grave breach a possible/potential/alleged breach The property developer was awarded $2,000,000 for breach of contract over the restaurant chain's withdrawal from a lease. Both the Stock Exchange and the panel cleared the bank of any breach of regulations or insider-trading. The public are used to breaches of promise by governments. See also\nanticipatory breach\nbreach of confidence\nbreach of duty\nbreach of fiduciary duty\nbreach of trust\nbreach of warranty\nbreach of the peace\nthe offence of illegal, noisy, or violent behaviour: He was charged with breach of the peace at a blockade of the naval base last March.\nbe in breach of sth\nto be breaking a particular law or rule: Checks at Companies House show the firm is nearly 10 months overdue with its accounts in breach of company law. The vendor will be required to warrant that it is not in breach of any of the contracts of employment.\nto not obey a law or to not do what was promised or agreed: The corporation was sued for allegedly breaching a contract to supply voice-mail systems. The organization's conduct during the conflict breached international law, according to a leading human rights group. breach rules/regulations Since the group warned it was in danger of breaching its banking covenants last week, the shares have tumbled 47%."}