{"id":40247,"name":"breakdown","type":"noun","us_sound":"ˈbreɪk.daʊn","us_link":"../audio/b/breakdown.mp3","uk_sound":"ˈbreɪk.daʊn","uk_link":"../audio/b/ukbraw_027.mp3","content":"breakdown noun\n(FAILURE)\nAdd to word list\nAdd to word list\nB2 [ C ] a failure to work or be successful: I had a breakdown (= my car stopped working) in the middle of the road. Both sides blamed each other for the breakdown of talks. See also\nbreak down (MACHINE)\nThesaurus: synonyms, antonyms, and examples\nthe fact of not being successfulfailureFailure is not an option.breakdownThe complete breakdown of local infrastructure left residents without water or electricity.meltdownThe markets experienced a meltdown at the news of the sale. collapseThe car manufacturer's collapse left the region's economy in tatters. failHe tried to sing the anthem, but it was an epic fail.\nSee more results »\nMore examplesFewer examplesThe breakdown in negotiations will be seen as a step backwards.Some children were well brought up, despite family breakdown, he admitted.An immediate effect of the war was a breakdown of law and order.He warned that the breakdown of the family unit would lead to an impoverished society.the trauma of marriage breakdown\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nmess\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nbreakdown noun\n(DIVISION)\nC2 [ C or U ] a division of something into smaller parts: We asked for a breakdown of the accident figures into day time and night time. The rate of breakdown of muscle protein was assessed.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nbreakdown noun\n(ILLNESS)\nB2 [ C ] a\nnervous breakdown\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nmanic depression\nobsessive-compulsive disorder\npsychosis\nsad\nscarred\nself-alienation\nsenility\nsociopathic\nSee more results »\nbreakdown noun [C]\n(FAILURE)\nAdd to word list\nAdd to word list\na mechanical failure, or a failure in a system or a relationship: There was evidently a breakdown in communication leading to the false report. Their car trip was a disaster – they had frequent breakdowns and never reached their destination.\nbreakdown noun [C]\n(DIVISION)\na division of information into parts that belong together: We need a breakdown of the statistics into age groups.\nbreakdown noun [C]\n(ANXIETY)\na condition in which you are unable to control thoughts or feelings that prevent you from living and working as you usually do: It's about a middle-aged New York cop who is having a nervous breakdown.\nAdd to word list\nAdd to word list\n[ C or U ] a failure to work correctly or to be successful: The city is losing millions of dollars in lost productivity because of all of the mechanical breakdowns and system failures. Each side blamed the other for the breakdown of the negotiations.breakdown in sth There has been a breakdown in communication between management and staff.\n( US also breakout) a division of something into its parts, so that you can see all the details: I asked for a full breakdown of the costs involved in setting up a new website."}