{"id":80612,"name":"breath","type":"noun","us_sound":"breθ","us_link":"../audio/b/breath.mp3","uk_sound":"breθ","uk_link":"../audio/b/ukbreak011.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the air that goes into and out of your lungs: out of breath He burst into the room, red-faced and out of breath (= unable to breathe comfortably because of tiredness or excitement).short of breath She was dizzy and short of breath (= unable to breathe in enough air). Her breath smelled of garlic. catch your breath ( also get your breath, get your breath back)\nC1 to pause or rest for a short time until you can breathe comfortably or regularly again: I had to stop running to catch my breath.\nSee more draw breath (also draw a breath)\nto breathe: Without pausing to draw breath she told me everything.\nto pause for a short time between doing one thing and the next: Give me a minute to draw breath, won't you?\nSee more hold your breath\nB2 to keep air in your lungs and not release it so that you need more: How long can you hold your breath under water?\nC2 to wait for something to happen, often feeling anxious: Fans held their breath waiting for the final whistle.\nSee more\n[ C ] a single action of breathing air into your lungs take a breath\nB2 to breathe air into your lungs (as a single action): take a deep breath The doctor told me to take a deep breath (= breathe in a lot of air).\nSee more a breath of air\nthe smallest amount of wind: There wasn't a breath of air in the room.\na short period of time spent outside: I'm just going out for a breath of (fresh) air - I won't be long.\nSee more\nMore examplesFewer examplesHer breath reeked of garlic.I heard his breath rasping in his chest.The disease may cause cold sweating, nausea, vomiting and shortness of breath .She paused to get her breath back and then carried on jogging.It's terribly smoky in here - I'm just going out for a breath of fresh air.\nSMART Vocabulary: related words and phrases\nAnimal physiology: breathing & stopping breathing\naerobic\nasphyxia\nasphyxiation\nbreathable\nbreathlessly\ndraw breath phrase\nexpire\nheave\npuff\nshallow\nshort of breath\nshortness\nsleep apnoea\nsmother\nsnuffly\nstrangle\nstrangulate\nsuffocating\nthrottle\nwinded\nSee more results »\nIdioms\na breath of fresh air\nin the same breath\ntake someone's breath away\nunder your breath\nwith your last/dying breath\nAdd to word list\nAdd to word list\nthe air that you take into and let out of your lungs: [ C usually sing ] She drew/took a deep breath. [ U ] He seemed a little out of breath (= to be breathing too fast). [ C usually sing ] As he jumped in the pool, he held his breath (= delayed releasing the air in his lungs). Idiom\na breath of fresh air"}