{"id":80677,"name":"breed","type":"verb","us_sound":"briːd","us_link":"../audio/b/breed.mp3","uk_sound":"briːd","uk_link":"../audio/b/ukbreak023.mp3","content":"breed verb\n(REPRODUCE)\nAdd to word list\nAdd to word list\nB2 [ T ] to keep animals for the purpose of producing young animals in a controlled way: Terriers are bred for their fighting instincts. His main income comes from breeding cattle. See also\ninbred (ESTABLISHED)\npurebred\nthoroughbred\nwell bred (PERSON)\n[ I ] (of animals) to have sex and produce young animals: The blackbird, like most birds, breeds in the spring.\nMore examplesFewer examplesWhile the animals are still immature, they do not breed.The map on the opposite page shows where these birds commonly breed.She breeds pedigree Burmese cats.Animals bred in captivity would probably not survive if they were released into the wild.At this time of year the birds return to the island to breed.\nSMART Vocabulary: related words and phrases\nBreeds & breeding\nbeget\nbreeder\nbreeding\nbreeding ground\nbrood mare\ncrossable\nfull-blooded\nheritage\nheritage breed\ninbred\ninbreeding\npedigree\npedigreed\npuppy farm\npuppy mill\npurebred\nstud\nteaser\nthoroughbred\nwell bred\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal reproduction\nbreed verb\n(CAUSE)\nC2 [ T ] to cause something to happen, usually something bad: Favouritism breeds resentment.\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspark\nSee more results »\nB2 a particular type of animal or plant: a breed of dog/cat/horse/sheep/cattle What's your favourite breed of dog/dog breed?\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\ninformal a type of person: Arletty was that rare breed of actress - beautiful, sexy and funny. A new breed of film-maker has taken over Hollywood. Authentic blues singers are a dying breed (= becoming rare) these days.\nMore examplesFewer examplesThe centre works to protect and preserve rare breeds of European sheep.There is now a huge variety of dog breeds.We have several breeds of deer in the park, not just one.The Gloucester Old Spot is the oldest breed of pedigree spotted pig in the world.Burmese, Oriental and Tonkinese are my favourite breeds of cat.\nSMART Vocabulary: related words and phrases\nBreeds & breeding\nbeget\nbreeder\nbreeding\nbreeding ground\nbrood mare\ncrossable\nfull-blooded\nheritage\nheritage breed\ninbred\ninbreeding\npedigree\npedigreed\npuppy farm\npuppy mill\npurebred\nstud\nteaser\nthoroughbred\nwell bred\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecies & genders\nCategories and varieties\nPeople in general\nAdd to word list\nAdd to word list\na particular type of animal or plant: the different breeds of dogs\nA breed is also a type of person or thing: Authentic blues singers are a dying breed (= there are not many of them left).\nto keep animals or plants for the purpose of producing young animals or plants, often for chosen qualities: [ T ] He bred hogs and cows and sold the meat and dairy products.\nWhen animals breed, they reproduce."}