{"id":80758,"name":"breton","type":"noun","us_sound":"ˈbretən","us_link":"../audio/b/usb00016.mp3","uk_sound":"ˈbretən","uk_link":"../audio/b/ukb00016.mp3","content":"Add to word list\nAdd to word list\n[ U ] the Celtic language spoken by some people in Brittany, France: He grew up speaking Breton.\n[ C ] a person from Brittany in France: My wife is a Breton.\n[ C ] informal a top (= a piece of clothing worn on the top half of the body) that is white with horizontal stripes, usually dark blue or black, and usually long sleeves and a straight neck: I wore a pair of cropped jeans and my Breton.\nMore examplesFewer examplesIn France, small minorities speak Breton and Basque.They sang in Breton, a Celtic tongue related to Welsh.The inhabitants of the island are mostly descendants of Bretons who settled here 300 years ago.They were Bretons who had served in the French Navy.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nGujarati\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nNauruan\nRomany\nUzbek\nVietnamese\nYiddish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nJumpers, shirts & tee-shirts\nrelating to the Celtic language spoken by some people in Brittany, France: He wrote in the Breton language. He acquired a deep interest in both Irish and Breton literatures.\nrelating to Brittany in France, or its people: The story concerns the love of a Breton knight for an Irish princess.\n[ before noun ] used to describe a piece of clothing worn on the top half of the body that is white with horizontal stripes, usually dark blue or black, and usually long sleeves and a straight neck : a Breton top/shirt/T-shirt/sweater/jumper A simple Breton stripe top is versatile for summer holidays.\nMore examplesFewer examplesThe composer was inspired by Breton legends of the Round Table. The Breton coast is one of the most dramatic in France.Visit the Breton town and shop for regional goodies at the market.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nGujarati\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nNauruan\nRomany\nUzbek\nVietnamese\nYiddish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nJumpers, shirts & tee-shirts"}