{"id":80852,"name":"bribe","type":"verb","us_sound":"braɪb","us_link":"../audio/b/bribe.mp3","uk_sound":"braɪb","uk_link":"../audio/b/ukbrew_006.mp3","content":"Add to word list\nAdd to word list\nC1 to try to make someone do something for you by giving them money, presents, or something else that they want : He bribed immigration officials and entered the country illegally. [ + to infinitive ] They bribed the waiter to find them a better table.\nMore examplesFewer examplesHe discovered that certain corrupt officials had been bribed to approve shoddy construction work.Apparently various prominent businessmen had been bribing the minister for favours.He bribed the children with sweets and pocket money not to tell their mum what he'd done.\"You can have my chocolate bar if you'll tell me the answer.\" \"Are you trying to bribe me?\"They should not have been allowed over the border, but somehow they managed to bribe the guards.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimpersonation\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nnobble\npyramid scheme\nsiphon\nvishing\nSee more results »\nC1 money or a present that you give to someone so that they will do something for you, usually something dishonest: He was accused of accepting/taking bribes from wealthy businessmen. Synonym\npayoff\nMore examplesFewer examplesIt was easy to see the gift as a sort of bribe.He showed great strength of character when he refused to accept the bribes.Greenway appeared at Bow Street Magistrates' Court to face seven charges of accepting bribes.His political career ended when he compromised himself by accepting bribes.The only way I can get him to do his homework is by offering him bribes.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\ncashback\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nRelated word\nbribery\nAdd to word list\nAdd to word list\nthe act of giving someone money or something else of value, often illegally, to persuade that person to do something you want: Congressmen have been accused of accepting bribes to pass bills favoring particular companies.\nto give someone money or something else of value, often illegally, to persuade that person to do something you want: He was accused of bribing a building inspector.\nAdd to word list\nAdd to word list\nto try to make someone do something for you, often something dishonest, by giving them money, gifts, or something else that they want: bribe sb with sth They were accused of trying to bribe voters with promises of tax cuts.bribe sb to do sth Corrupt officials had been bribed to approve shoddy construction work.\nmoney or a gift that you give to someone so that they will do something for you, often something dishonest: offer/accept/take a bribe He was accused of accepting bribes from wealthy businessmen. It was easy to see the gift as a sort of bribe."}