{"id":81006,"name":"brief","type":"adjective","us_sound":"briːf","us_link":"../audio/b/brief.mp3","uk_sound":"briːf","uk_link":"../audio/b/ukbrew_025.mp3","content":"brief adjective\n(SHORT IN TIME)\nAdd to word list\nAdd to word list\nB1 lasting only a short time or containing few words: His acceptance speech was mercifully brief. I had a brief look at her report before the meeting. It'll only be a brief visit because we really don't have much time. After a brief spell/stint in the army, he started working as a teacher. The company issued a brief statement about yesterday's accident.\nThesaurus: synonyms, antonyms, and examples\ncontinuing for less time than usualshortHe received a short jail sentence.quickI need to make a quick phone call - I'll be right back.briefWe had a brief chat this morning.short and sweetThe business meeting was short and sweet.momentaryIt was just a momentary lapse in judgment - I won't do it again.\nSee more results »\nused to express how quickly time goes past: For a few brief weeks we were very happy.\nMore examplesFewer examplesHis illness was mercifully brief.When you've got a minute, I'd like a brief word with you.The meeting was brief and businesslike.She called me this morning at the office and we had a brief chat.She sketched out the plan in a few brief sentences.\nSMART Vocabulary: related words and phrases\nShort in time\nabbreviated\nat a moment's/two hours'/three weeks', etc. notice idiom\nawhile\nbe short notice idiom\nbite-sized\nblink\nbout\nbriefly\ndose\nin abbreviated form\nin small doses idiom\nin the blink of an eye idiom\ninstant\njiffy\nshort-stay\nshortness\nsnatched\nsplit second\ntick\ntransient\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot saying much\nbrief adjective\n(SHORT IN LENGTH)\n(of clothes) very short: She was wearing a fairly brief skirt, as I recall.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow\nlow slung\nmini\nshallow\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\n[ T ] to give someone detailed instructions or information: We had already been briefed about/on what the job would entail. Compare\ndebrief brief against/in favour of someone/something\n[ I ] UK to make information about someone or something public, with the intention of criticizing/praising him, her, or it: On several occasions government officials briefed against their own ministers.\nSee more\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nbrief noun\n(SHORT FORM)\nin brief\nB2 If something is said in brief, it is said in a very short form, with very few details: \"So you didn't enjoy the party much.\" \"In brief, no.\"\nSee more\nbrief noun\n(UNDERWEAR)\nbriefs [ plural ]\na piece of underwear worn by men or women, covering the area between the waist and the tops of the legs: cotton briefs\nSee more\nbrief noun\n(INSTRUCTIONS)\n[ C ] UK a set of instructions or information: [ + to infinitive ] It was my brief to make sure that the facts were set down accurately.\n[ C ]\n&#160; law\n&#160; specialized a document or set of documents containing the details about a court case\nSMART Vocabulary: related words and phrases\nInstructions and orders\nas per instructions idiom\nbriefing\ncharge\nclarion call\ncommandment\ncounter-order\ndictate\ndiktat\ndoctor's orders\nfiat\nimperatively\ninterdict\nmarching orders\norder\norders are orders idiom\nunbriefed\nwalkthrough\nwith\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nbrief noun\n(LAWYER)\nUK informal a lawyer who will speak for someone in a court of law : My brief advised me to plead guilty.\nSMART Vocabulary: related words and phrases\nLawyers & legal officials\namicus\narticled\narticled clerk\nattorney\nattorney general\ncounsellor\nDPP\ndraftswoman\nfirm\nI rest my case idiom\nKC\nnotary\nparalegal\nprobation officer\nprocurator\nprocurator fiscal\nsuper-firm\nsuperlawyer\ntake silk idiom\ntribune\nSee more results »\nbrief adjective [-er/-est only]\n(SHORT IN TIME)\nAdd to word list\nAdd to word list\nlasting only a short time or containing few words: Rory had a brief career as an actor.\nbrief verb [T]\n(GIVE INSTRUCTIONS)\nto give someone instructions or information about what to do or say: He is briefing the account executives on the new airline accounts.\nAdd to word list\nAdd to word list\nWORKPLACE instructions that explain what someone's work or task is: His brief was to streamline the group's financial services operation.give sb/prepare a brief We have prepared a brief for a full study by a consultant.\nLAW a document that shows the facts of a legal case that will be argued by a lawyer in a court: to prepare/file/submit a brief See also\ncreative brief\ndesign brief\nwatching brief\nto give someone information about something: Managers were touring the US to brief investors on last week's interim results.\nWORKPLACE to explain someone's work or task to them: It's my job to brief volunteers beforehand and explain what their responsibilities are.\nLAW to tell a lawyer the facts of a legal case that he or she will argue in court"}