{"id":81059,"name":"bright","type":"adjective","us_sound":"braɪt","us_link":"../audio/b/bright.mp3","uk_sound":"braɪt","uk_link":"../audio/b/ukbriga005.mp3","content":"bright adjective\n(LIGHT)\nAdd to word list\nAdd to word list\nB1 full of light, shining: bright sunshine The rooms were bright and airy. The lights are too bright in here - they're hurting my eyes. A bright star was shining in the East. When she looked up her eyes were bright with tears. In 2009 I moved to New York, attracted by the bright lights (= the promise of excitement) of the city.\nThesaurus: synonyms, antonyms, and examples\nfull of light so you can seelightI'll wait until it's light outside before I go for a jog.brightIt was quite bright in the examination room.sunnyThe baby's nursery was bright and sunny.sunlitThe house boasts a sunlit parlour with floor-to-ceiling windows.sun-drenchedThey spent a week on the sun-drenched beaches of Bali.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving or giving out strong lightbrightA bright light was shining through the gloom.shiningWe topped our Christmas tree with a shining star.brilliantThe moon shed a brilliant light over the ocean.intenseThe intense light reflecting off snow at high altitudes can damage your eyes.blazingWe stepped out of the plane into blazing sunshine.\nSee more results »\nMore examplesFewer examplesThe light was so bright that I had to cover my eyes.The office is quite bright and airy - it's a pleasant working environment.It was a bright moonlit night.The lake sparkled in the bright sunlight.He screwed his eyes tight shut against the bright light.\nSMART Vocabulary: related words and phrases\nThe qualities of light\nbacklit\nbrightly\nbrilliantly\ncoruscating\ndazzlingly\ndullness\nflickering\nfloodlit\nglittering\nincandescent\nlambent\nluminescence\nluminosity\nlustrously\nnon-fluorescent\nnon-solar\nopalescent\novercast\nspangly\nunshaded\nSee more results »\nbright adjective\n(COLOUR)\nA2 strong in colour: Leslie always wears bright colours. He said hello and I felt my face turn bright red. a bright shade of green\nMore examplesFewer examplesShe painted her nails a bright red.You can't mistake their house - it's got a bright yellow front door.She looks best in bright, vibrant colours, like red and pink.Jazz the dress up with some bright accessories.His eyes were bright blue with a roguish twinkle in them.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nfluorescent\nharsh\nneutrally\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npsychedelic\nvibrancy\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nbright adjective\n(INTELLIGENT)\nB2 intelligent and quick to learn: They were bright children, always asking questions. She was enthusiastic and full of bright ideas and suggestions.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nMore examplesFewer examplesDa Silva plays a bright, lonely student from New York, adrift in small-town Arizona.She's fresh out of/from university and very bright.He's very good-looking but not terribly bright.She wants a man who is bright, attractive and funny as well, which is asking the impossible in my opinion.He's a bright enough student - he just lacks motivation.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nwhip-smart\nwisdom\nSee more results »\nbright adjective\n(HAPPY)\nB2 full of hope for success or happiness: You're very bright and cheerful this morning. Things are starting to look brighter for British businesses. She's an excellent student with a bright future.\nMore examplesFewer examplesThe receptionist had a bright set smile on his face, but I could tell that he was bored.The experts are painting a brighter picture of the state of the economy.With no job or qualifications, the future didn't look bright for James.The customers loved her bright and cheerful manner.Look on the bright side - no one was badly hurt.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\ngruntled\nhappily\nhappy camper\nhappy place idiom\njaunty\nself-healing\nshining\nsunnily\nswooning\nswooningly\nSee more results »\nSee also\nbright as a buttonRelated words\nbrightness\nbrightlyIdiom\nbright-eyed and bushy-tailed\nbrights [ plural ] US informal (UK full beam [ U ])\nA car's brights are its headlights (= the powerful lights at the front) when they are brightest and aimed straight ahead: You can't just go around driving with your brights on.\nSee more\nbright adjective\n(LIGHT)\nAdd to word list\nAdd to word list\n[ -er/-est only ] full of light, or shining: the bright lights of downtown\nbright adjective\n(COLOR)\n[ -er/-est only ] strong in color: a bright green hat\nbright adjective\n(INTELLIGENT)\n[ -er/-est only ] (of a person) intelligent and quick to learn: He’s a bright, well-organized guy. She was full of bright ideas.\nbright adjective\n(HAPPY)\nfull of hope or happiness: He has a bright future ahead of him. brightness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈbrɑɪt·nəs/\nThe brightness of the summer day made him blink.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET used to describe a financial market where prices are rising and there is a lot of activity: Trading was bright with shares up just over 1% at 103.85p.\nfull of hope for success: a bright futurebe/look bright for sb/sth The outlook is bright for Asian stock markets."}