{"id":81144,"name":"bring","type":"verb","us_sound":"brɪŋ","us_link":"../audio/b/bring.mp3","uk_sound":"brɪŋ","uk_link":"../audio/b/ukbriga019.mp3","content":"bring verb [T]\n(TOWARDS PLACE)\nAdd to word list\nAdd to word list\nA2 to take or carry someone or something to a place or a person, or in the direction of the person speaking: \"Shall I bring anything to the party?\" \"Oh, just a bottle.\" [ + two objects ] Bring me that knife/Bring that knife to me. Can you help me bring in the shopping (= take it into the house)?bring sb in for questioning The police brought several men in for questioning (= took them to the police station because they might have been involved in a crime). When they visit us they always bring their dog with them.\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nMore examplesFewer examplesI'll see if Louisa will bring her guitar to the party.Please remember to bring a mat and a towel with you to the next aerobics class.Is it okay if I bring a friend to the party?The waiter brought the menu and the wine list.I brought him some sandwiches because I thought he might be hungry.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbudge\ncall for someone\ncargo\nchauffeur\nconvey\nhump\nimport\nportable\nportage\npost-delivery\nput something/someone down\nredeliver\ntransplant\ntransportation\ntruck\nSee more results »\nbring verb [T]\n(CAUSE)\nB1 to cause, result in, or produce a state or condition: [ + two objects ] She's brought us so much happiness over the years. [ + -ing verb ] The explosion brought the whole building crashing to the ground.bring sth down Several trees were brought down (= made to fall) by the storm. The closure of the factory brought poverty to the town (= resulted in it becoming poor). Bring the water to the boil (= make it start boiling). She suddenly brought the interview to an end. bring tears to sb's eyes Her tragic story brought tears to my eyes (= made me cry). What will the future bring for these refugees? Synonyms\ncause\ninflict\nvisit something on/upon someone old use or formal\nwreak formal bring someone to something\nto cause someone to come to a particular place or thing: what brings What brings you (= why have you come) to Miami?\nSee more\nMore examplesFewer examplesIt took them two hours to bring the fire under control.Diplomacy has so far failed to bring an end to the fighting.Few observers believe that the treaty will bring a lasting peace to the region.It's nice to be able to bring a smile to people's faces .December brought some seasonable snow showers.\nSMART Vocabulary: related words and phrases\nCausing things to happen\n-induced\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nbring verb [T]\n(LAW)\nto make or begin as part of an official legal process: He was arrested for fighting, but the police have decided not to bring charges.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring an action\ncease\ncomplainant\nindictment\ninstruct\nlitigant\nlitigate\nlitigation\nlitigious\nlitigiously\npetitioner\nprosecutorial\nreindict\nreindictment\nretry\nspecimen charge\nsummons\nSee more results »\nGrammar\nBring, take and fetchBring means moving something or someone. The movement is either from where the listener is to where the speaker is, or from the speaker to the listener. …\nBringBring means moving something or someone. The movement is either from where the listener is to where the speaker is, or from the speaker to the listener. …\nTakeTake means movement with something or someone from where the speaker or listener is to a different place: …\nBring or take?seen from the viewpoint of the doer – she …\nFetchFetch means to go to another place to get something or someone and return with the thing or the person. We use it for people and things that are not here but that we need or are due to be here. We can usually use get instead of fetch: …\nBring, take and fetch: typical errorsWe don’t use take when something is seen from the receiver’s viewpoint: …\nIdioms\nbring someone to book\nbring someone up short\nbring home the bacon\nbring the house down\nbring up the rear\nnot bring yourself to do somethingPhrasal verbs\nbring something about\nbring someone/something along\nbring someone around\nbring something back\nbring someone down\nbring something down\nbring something forward\nbring something in\nbring someone in\nbring something off\nMore phrasal verbs\nbring someone on\nbring something on\nbring someone out\nbring something out\nbring someone out in something\nbring someone round\nbring someone to\nbring someone/something together\nbring someone up\nbring something up\nbring verb [T]\n(TAKE)\nAdd to word list\nAdd to word list\nto take or carry someone or something to a place or a person, or in the direction of the person speaking: Bring me that book./Bring that book to me. I brought my daughter to the office. [ M ] Next time you come, bring your boyfriend along. [ M ] It started raining, so I brought in the laundry. This broadcast was brought to you (= paid for) by Powdermilk Biscuits.\nbring verb [T]\n(CAUSE)\nto cause, result in, or produce a state: The rain brought some relief from this heat. The explosion brought the building crashing to the ground. What brings you here? Prosecutors brought charges against the program’s director. Funding cuts brought an end to the project. Wicks brought her to the attention of a movie producer.\nbring verb [T]\n(FORCE)\nto make yourself do something that you do not want to do: I couldn’t bring myself to disappoint her.\nIdioms\nbring someone/something into line (with someone/something)\nbring to light\nbring to mind\nbring something to the tablePhrasal verbs\nbring about something\nbring someone around\nbring someone around\nbring back something\nbring back something\nbring down someone\nbring down something\nbring forth something\nbring forward something\nbring forward something\nMore phrasal verbs\nbring in something\nbring off something\nbring on something\nbring out something\nbring out something\nbring up someone\nbring up something\nAdd to word list\nAdd to word list\nto make something come to a particular place, point, or level: Producers need to bring oil production to levels that create more stable and more sustainable oil prices.\nto create or produce a particular state or condition: bring sth to an end/close Without warning, she suddenly brought the interview to an end.\nLAW to make or begin something as part of an official legal process: bring a case/lawsuit/charge against sb Detectives believe they have enough evidence to bring charges against the chief financial officer.\nPhrasal verbs\nbring sth about\nbring sth back\nbring sth before sb/sth\nbring sb/sth down\nbring sth down\nbring sth forward\nbring sb in\nbring sb/sth in\nbring sth in\nbring sth off\nMore phrasal verbs\nbring sth out\nbring sth up"}