{"id":83079,"name":"bunch","type":"noun","us_sound":"bʌntʃ","us_link":"../audio/b/bunch.mp3","uk_sound":"bʌntʃ","uk_link":"../audio/b/ukbulru018.mp3","content":"bunch noun\n(GROUP)\nAdd to word list\nAdd to word list\nB1 [ C ] a number of things of the same type fastened together or in a close group: a bunch of flowers/grapes/bananas/keysmainly US informal The reorganization will give us a whole bunch (= a lot) of problems.\nB1 [ S ] a group of people: They're a bunch of jerks. Your friends are a nice bunch. the best/pick of the bunch\nthe best person or thing, or the best people or things, from a group of similar people or things: Send in your poems and we'll publish the best of the bunch.\nSee more\nMore examplesFewer examplesUK Those builders are a bunch of cowboys - they made a terrible job of our extension.These politicians are just a bunch of crooks.a bunch of grapesUsing a bunch of bananas, the zoo-keeper persuaded the monkey back into its cage.She sent him a bunch of red roses.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ndataset\nempty set\nensemble\nfamily\nfeast\ngeneration\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nbunch noun\n(HAIRSTYLE)\nbunches [ plural ] UK\nIf a girl has her hair in bunches, it is tied together in two parts with one at each side of her head: As a little girl she wore her hair in bunches.\nSee more Idiom\na bunch of fives\nAdd to word list\nAdd to word list\na number of things of the same type fastened or closely grouped together, or any particular group of things or people: We ate a whole bunch of grapes. They’re a nice bunch of people. infml I’ve got a bunch of things to do.\nto pull together or gather into a unit: [ I ] Beth sat in bed with pillows bunched behind her, reading."}