{"id":83110,"name":"bundle","type":"noun","us_sound":"ˈbʌn.dəl","us_link":"../audio/b/bundle.mp3","uk_sound":"ˈbʌn.dəl","uk_link":"../audio/b/ukbulru020.mp3","content":"Add to word list\nAdd to word list\nC2 a number of things that have been fastened or are held together: a bundle of clothes/newspapers/books a bundle of sticks\nMore examplesFewer examplesWe sorted the newsletters into bundles for distribution.I've got a bundle of clothes here to give to charity.How much asparagus shall I buy - a couple of bundles?Inside the embroidery kit there should be two different bundles of yarn.We left out several bundles of old newspapers for recycling.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\nempty set\nensemble\nfamily\nfeast\ngeneration\nglory box\npackage\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nstore cupboard\nSee more results »\nIdioms\nbundle of joy\na bundle of laughs\na bundle of nerves\ngo a bundle on something\nmake a bundle\nbundle verb\n(PUSH)\n[ I or T, + adv/prep ] to push or put someone or something somewhere quickly and roughly: He bundled his clothes into the washing machine. She was bundled into the back of the car. The children were bundled off to school early that morning.\nSMART Vocabulary: related words and phrases\nWrapping, packing and loading\nblister pack\nbottle\nbottling\nBubble Wrap\nbundle (someone) up\nfreighter\npackage\npackaged\npackaging\npacker\npacket\npacking\nparcel\nparcel something up\npolystyrene\nsheathe\nshrink-wrap\ntinned\ntraffic light\nvacuum-packed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPushing and shoving\nbundle verb\n(SELL TOGETHER)\n[ T ] to include an extra computer program or other product with something that you sell: The system came bundled with a word processor, spreadsheet, and graphics program.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundling\nchain of production\nconcession\ncustomer service\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nPOS\nsell out\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nsupersize\nSee more results »\nRelated word\nbundlingPhrasal verbs\nbundle (someone) up\nbundle something up\nbundle noun [C]\n(GROUP)\nAdd to word list\nAdd to word list\na number of things that are fastened or held together: He carried bundles of newspapers to the garage.\ninfml A bundle is also a large amount of money: When they sold their house, they made a bundle. Idiom\na bundle of nerves\nbundle verb\n(FASTEN)\n[ T ] to fasten a number of things together: [ I/T ] We’re supposed to bundle magazines before throwing them away.\nbundle verb\n(MOVE QUICKLY)\n[ always + adv/prep ] to cause someone to move quickly: [ I ] We bundled into the car. [ T ] Every morning I bundled the children off to school.\nPhrasal verb\nbundle up\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING a combination of products, services, or pieces of equipment that are supplied together or sold as a group: Phone companies depend on being able to sell a bundle of services - long-distance, local calling, Internet access, wireless - to be profitable. software bundles\nMONEY\n&#160; informal a large amount of money: make/earn a bundle He made a bundle on the stock market. cost/spend/save a bundle\nCOMMERCE, MARKETING to add extra products, services, or pieces of equipment to another product or service and sell them together, so you get the extra product, service, etc. for free or for a cheaper price: bundle sth with sth Check whether there is any life insurance cover bundled with the pension. bundled products/services bundled software/games"}