{"id":83222,"name":"bunting","type":"noun","us_sound":"ˈbʌn.t̬ɪŋ","us_link":"../audio/b/eus70633.mp3","uk_sound":"ˈbʌn.tɪŋ","uk_link":"../audio/b/ukbunny003.mp3","content":"bunting noun\n(CLOTH)\nAdd to word list\nAdd to word list\n[ U ] rows of brightly coloured small flags, often in the colours of a country's flag, that are hung across roads or rooms, or above a stage, as decoration for special occasions or political events: The room was decked with festive bunting. Flags and red, white and blue bunting were hung along the main street.\nUrs Flueeler/EyeEm/GettyImages\nMore examplesFewer examplesThe streets were covered with flags and bunting.He stood on a stage decked out in red, white and blue bunting.A giant American flag and bunting graced the porch of his three-story home.\nSMART Vocabulary: related words and phrases\nObjects & decorations connected with celebrations\nAdvent calendar\nballoon\nbauble\nbonbon\nbridal wear\nChristmas ball\nChristmas cracker\ngarland\nglow stick\ngrogger\nhamper\nhorn of plenty\nillumination\nnoisemaker\nparty popper\npennant\npiñata\nsouvenir\ntinsel\nwreath\nSee more results »\nbunting noun\n(BIRD)\n[ C ] plural bunting or buntings any of several types of small singing bird with a short, wide beak, and usually brownish feathers, found in Europe, Asia, and Africa: They saw lapwings, skylarks and buntings.\nKevin Agar/500px/GettyImages\n[ C ] plural bunting or buntings any of several types of small singing bird with a short, wide, pointed beak and brightly coloured feathers on the male bird, found in North and South America: The state bird of Colorado is the lark bunting.\nMore examplesFewer examplesThe water hole was luminous with birds: fire finches, golden-breasted buntings, herons.Bird species at risk include barn owls, redshank, corn bunting and corncrake.\nSMART Vocabulary: related words and phrases\nOther wild birds\nbird of paradise\nblackbird\nblue tit\nbluebird\nbluejay\ngoldfinch\ngreenfinch\nhoneyeater\nhoopoe\nhornbill\nmagpie\nmartin\nmockingbird\nmynah\nnightingale\nstarling\nswift\nswiftlet\ntoucan\nturtle dove\nSee more results »\nbunting noun\n(BASEBALL)\n[ U ] in the game of baseball, an act by the batter of hitting the ball fairly slowly and only a short distance, to put it into a position that causes difficulties for the fielders (= the players on the team whose turn it is to throw and catch the ball), and helps the batter's own team to score: Infielders struggled with Gray's skilful bunting.\nMore examplesFewer examplesThere was another round of bullpens and pitchers' fielding practice and hitting and bunting.The Japanese play \"small ball\", a style emphasizing bunting, stealing, sacrifice hitting, and team harmony.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nfoul\nglove\nhomer\nliner\nsecond base\nshag\nshortstop\nslider\nslogger\nthe World Series\nSee more results »"}