{"id":83234,"name":"buoyancy","type":"noun","us_sound":"ˈbɔɪ.ən.si","us_link":"../audio/b/eus70634.mp3","uk_sound":"ˈbɔɪ.ən.si","uk_link":"../audio/b/ukbunny004.mp3","content":"buoyancy noun [U]\n(FLOATING)\nAdd to word list\nAdd to word list\nthe quality of being able to float: We tested the boat for buoyancy. He swam with an inflatable buoyancy device.\nMore examplesFewer examplesI rise, gaining buoyancy as air fills my lungs. The weight of the cargo affected the buoyancy of the vehicle.The ball's buoyancy pulled him back up to the surface.\nSMART Vocabulary: related words and phrases\nStaying afloat, capsizing & sinking\nbail out\nbuoy\nbuoyantly\ncapsize\nducking\nfloatation\nflotation\nground\nkeel\nkeel over\nkickboard\noutrigger\nrefloat\nresurface\nride\nride something out\nright\nrun\nsunken\nwaterlogged\nSee more results »\nbuoyancy noun [U]\n(SUCCESS)\nthe quality of being successful or able to make a profit: There is continued buoyancy in the property market. The buoyancy of the oil market is likely to encourage price growth.\nMore examplesFewer examplesBook publishers reported buoyancy in the 24+ age group market.The trend has been driven by buoyancy in stock market prices. Buoyancy in New York also helped the FTSE 100 index.Europe's economy has drawn much of its buoyancy from growing exports.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\nhigh-flying\npocket\nrail\nrepresent\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nsuperseller\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nbuoyancy noun [U]\n(HAPPINESS)\na happy, positive quality, especially in spite of problems: He was a man of remarkable buoyancy.\nMore examplesFewer examplesShe was normally subdued, but today she radiated buoyancy.This catchy track has a happy buoyancy.His buoyancy had not been punctured by any of these events.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nfrenzy\nfriskiness\nfrisson\nfrolic\nget-up-and-go\nglam\nhubbub\nperkiness\nphysicality\npiquancy\npizzazz\npzazz\nzeal\nzealousness\nSee more results »\nSee\nbuoyant\nAdd to word list\nAdd to word list\nthe ability to float: We tested different materials for buoyancy.\nAdd to word list\nAdd to word list\nsuccess and a lot of activity in an economy, market, etc.: Costs have been pushed up by the buoyancy of the public sector.\nthe condition of increasing or staying at a high level: The news failed to give buoyancy to the company's shares."}