{"id":83286,"name":"burden","type":"noun","us_sound":"ˈbɝː.dən","us_link":"../audio/b/burden.mp3","uk_sound":"ˈbɜː.dən","uk_link":"../audio/b/ukbunny010.mp3","content":"Add to word list\nAdd to word list\na heavy load that you carry: The little donkey struggled under its heavy burden.\nC1 something difficult or unpleasant that you have to deal with or worry about: the burden of responsibility My elderly mother worries that she's a burden to me. Buying a house often places a large financial burden on young couples.\nMore examplesFewer examplesThe war had put an insupportable financial burden on the country.The irony of it is that the new tax system will burden those it was intended to help.A huge burden was lifted from my shoulders when I told my parents about my problem.Such a high increase will impose an undue burden on the local tax payer.Not until this turbulent region can shuffle off the burdens of the past will it be able to settle peacefully into the community of nations.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nbuttress\ncantilever\ngroan\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nscaffolding\nshore\nsinew\nstilt\nunderpin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult things and people\nDifficult situations and unpleasant experiences\nIdiom\nthe burden of proof\nto trouble someone with something difficult or unpleasant: I don't want to burden you with my problems.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nAdd to word list\nAdd to word list\na duty or responsibility that is hard to bear: I don’t want to be a burden on my children.\nto give someone problems, trouble, or responsibilities: He was burdened with debts.\nAdd to word list\nAdd to word list\na difficult situation or unpleasant responsibility that you must deal with or worry about: ease/lighten/reduce the burden (on sb) By training additional staff, management could significantly ease the burden on its over-worked personnel.heavy/big/enormous burden I sympathize with the heavy burden of paperwork they have to deal with. the administrative/legal burden\nthe responsibility of paying money that you owe, or the large amount of money that you owe: bear/carry/assume the burden (for sth) If the new law is passed, tax payers will assume the burden for rising energy costs.financial/economic burden He proposed that the state accept the financial burden. a tax/mortgage/loan burden See also\ndebt burden\nto make someone responsible for something that is very difficult, unpleasant, or expensive to deal with: be burdened with/by sth Borrowers are already burdened with mortgage extras such as arrangement fees and life assurance cover. a nation burdened by heavy unemployment"}