{"id":83415,"name":"burgundy","type":"noun","us_sound":"ˈbɝː.ɡən.di","us_link":"../audio/b/usb00021.mp3","uk_sound":"ˈbɜː.ɡən.di","uk_link":"../audio/b/ukb00021.mp3","content":"Add to word list\nAdd to word list\n(also Burgundy) wine, usually red, that comes from the Burgundy region of eastern central France: She ordered a glass of burgundy. This is one of the best burgundies I have tasted. The wine reminded me of a fine white Burgundy.\na dark reddish-purple colour, like the colour of red wine: I like to wear burgundy and purple. There are deep reds and bright golds, mixed in with lavenders, burgundies and blues.\nenjoynz/DigitalVision Vectors/GettyImages\nMore examplesFewer examples \"I don't really like burgundy,\" he announced helpfully after I had ordered the wine.These wines once commanded prices as high as top white Burgundies.The best red burgundies are pale in colour and delicate, but with intense, gamey, damson, plum and sometimes strawberry flavours.The coat is available in red, burgundy, forest green, camel, navy, or chocolate.Look for the nostalgic, Bloomsbury-influenced shades - muted mustards, burgundies, dusty pinks and olives.\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfull-bodied\ngrape\njeroboam\nLambrusco\nlay something down\nplonk\nplummy\nspumante\nsuper-smooth\ntable wine\nterroir\nultra-dry\nwiney\nzinfandel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nhaving a dark reddish-purple colour, like the colour of red wine: She was wearing a burgundy silk shirt. He padded across the burgundy carpet to the kitchen.\nMore examplesFewer examplesThe padded seating is covered with coarse, burgundy upholstery.She wore a burgundy one-piece swimsuit, burgundy high-heeled sandals and burgundy toenails. The walls are deep green and burgundy red.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ndun\nearth tone\nemerald\npeach\npuce\nsaffron\nsanguine\nsapphire\nsepia\nsky blue\nslaty\ntangerine\ntaupe\ntea rose\nverdure\nSee more results »"}