{"id":83434,"name":"buried","type":"verb","us_sound":"ˈber.i","us_link":"../audio/b/berry.mp3","uk_sound":"ˈber.i","uk_link":"../audio/b/ukbenev024.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nbury\nbury verb [T]\n(COVER WITH EARTH, ETC.)\nB1 to put a dead body into the ground: His father is buried in the cemetery on the hill. See also\nburial\nB2 to put something into a hole in the ground and cover it: The dog trotted off to bury its bone. buried treasure\nusually passive to cover something or someone completely with a large quantity of something: If an avalanche strikes, skiers can be buried alive by snow.\nold-fashioned If someone says they buried someone, usually a close relation, they mean that the person died: She buried both her parents last year. No-one should have to bury their child.\nMore examplesFewer examplesA ceasefire has been called to allow the survivors to bury their dead.He made a short speech at the graveside, then the body was finally buried.Robin Hood asked to be buried where his arrow landed.X marks the spot where the treasure is buried.In AD 79 the city of Pompei was buried under a layer of ash seven metres deep.\nSMART Vocabulary: related words and phrases\nBurying, cremating and preserving bodies\nbier\nburial\nbury\ncist\ncommittal\ncremains\ncremate\ncremation\ncryogenic\nembalmer\nexhume\nmummy\nreburial\nrebury\nreinter\nreinterment\nsarcophagus\nsati\ntaxidermist\nunburied\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHiding and disguising\nCovering and adding layers\nDeath and dying\nbury verb [T]\n(HIDE)\nC2 to put something in a place where it is difficult or impossible to find or see: I found the article buried away in the business section of the newspaper. She buried her face in her hands and began to sob.\nto try to prevent people from finding out about something that has happened: This was an attempt to bury the truth about the senator's death. One of the oldest tricks for burying bad news is to release it on the last day of the parliamentary session.\nto try to forget an unpleasant experience or try not to feel an unpleasant emotion: He'd had to bury his pain over the years. Many of us have been hurt in relationships, and a frequent form of defence is to bury your feelings.\nMore examplesFewer examplesI found some old letters buried in a drawer.This is a story of deceit and complicity by government and industry to bury the truth about the dangers of uranium mining.Everyone knows that Friday is when you release news you want to bury, because Friday news gets reported in the little-read Saturday papers.Many soldiers bury the feelings and memories of war when they get home. Could she really entirely bury her anger about the media circus she had to endure?Her constructive criticism and wise counselling helped me uncover buried feelings and emotions which I had long denied.\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflage\ncamouflaged\ncloak\ndrown\nhole up (somewhere)\nillusion\nillusionistically\nillusively\nillusorily\nsecrete\nshroud\nshut someone/something out\nsidle\nskulk\nsmokescreen\nstash\ntuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForgetting and forgetfulness\nbury verb [T]\n(SCORE)\nsports\n&#160; mainly UK informal specialized to send a ball into the net of a goal with a lot of force: He made a zig-zagging run before burying the ball with his left foot. Thornton buried the shot into the left-hand side of the net.\nMore examplesFewer examplesShe buries the ball just inside the right post.This is the sort of chance he usually buries, but he missed it.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdiom\nbury the hatchetPhrasal verb\nbury yourself in something"}