{"id":83474,"name":"burlesque","type":"noun","us_sound":"bɝːˈlesk","us_link":"../audio/b/usbunse012.mp3","uk_sound":"bɜːˈlesk","uk_link":"../audio/b/ukbunny029.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a type of writing or acting that tries to make something serious seem stupid and funny: The dance scene is in part a burlesque of Bollywood films. The political burlesques are not very hard-hitting and rather bland. The comedy is subtle and nuanced; it never tips over into burlesque. Synonym\nparody\n[ C or U ] US a type of theatre entertainment in the US in the late 19th and early 20th centuries that had funny acts and a striptease (= a performance in which someone removes their clothes): He worked for many years in vaudeville and burlesque. They describe the show as an old-fashioned musical burlesque. Compare\nvaudeville\n[ U ] a modern type of entertainment that includes dancing and striptease (= a performer removing their clothes): Naked dancing has become accepted as a form of arty entertainment in the growing fashion for burlesque.\nMore examplesFewer examplesThey performed burlesques of classic movies such as \"Gone With the Wind\".After appearing on Broadway and in burlesque, she switched to films in 1908.There is a feminist movement in burlesque that is women saying, \"I can be ultra feminine and sexy and I'm doing it for myself.\"\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\nGothic\nhokum\none-shot\npaean\nparodic\nparody\npassion project\npolice procedural\npsychological\nslow\nsmash\ntragicomedy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHumour & humorous\nSpectacles & performances\nrelating to or in the style of burlesque entertainment: I really like performing, and I wanted to do something burlesque and a little gaudy. He worked in night clubs as a burlesque acrobat.\nshowing or writing about something serious in a way that tries to make it seem stupid and funny: The piece she wrote was a burlesque treatment of a religious sermon. Synonyms\nmocking\nsatirical\nMore examplesFewer examplesWomen in burlesque attire danced on the bar.There's something burlesque about the look of the car.Critics found the writing stilted and artificial to the point of it being burlesque. The play-within-a-play was a burlesque affair rendered with lacerating wit.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nHumour & humorous"}