{"id":83774,"name":"business","type":"noun","us_sound":"ˈbɪz.nɪs","us_link":"../audio/b/business.mp3","uk_sound":"ˈbɪz.nɪs","uk_link":"../audio/b/ukbushr005.mp3","content":"business noun\n(SELLING)\nAdd to word list\nAdd to word list\nA1 [ U ] the activity of buying and selling goods and services: My brother's in business. He's in the frozen food business. Our firm does a lot of business with overseas customers. Eventually they found a consultant they felt they could do business with (= with whom they could work well). Currently, there are fewer firms in business (= operating) in the area than ever before. This new tax will put a lot of small firms out of business (= they will stop operating). She set up in business (= started her own company) as a management consultant. Synonyms\ncommerce\nenterprise (BUSINESS)\ntrade (BUYING AND SELLING)\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nMore examplesFewer examplesMany things make it difficult for women to reach the top in US business.The way to be successful in business is always to stay one jump ahead of your competitors.What can European companies learn from Japanese business practices?She runs her own printing business.They put a lot of money into the family business.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nbusiness noun\n(COMPANY)\nA2 [ C ] a particular company that buys and sells goods and services: The two brothers established/set up/started up a clothes retailing business. She runs her own printing business. They put a lot of money into the family business. Synonyms\nconcern (BUSINESS)\nenterprise (BUSINESS)\ntrade (BUSINESS)\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nbusiness noun\n(WORK)\nB1 [ U ] work that you do to earn money: I'm in Baltimore on business. a business appointment\n[ U ] the amount of work done or the number of goods or services sold by a company or organization: Business is good/brisk/booming/flourishing (= I'm selling a lot). Business is bad/slack/quiet (= I'm not selling much). How is business (= are you selling much) at the moment?\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nbusiness noun\n(MATTER)\n[ S or U ] a situation or activity, often one that you are giving your opinion about: Arranging a trip abroad is a time-consuming business. These killings are a horrible business. I make it my business (= I feel it is my particular duty) to check the monthly accounts. We have some unfinished business to discuss (= we still have something important to discuss).\nMore examplesFewer examplesThe advertising world can be a very cut-throat business.It was a ghastly business all round.If you try any funny business you'll be sorry.Eating spaghetti can be a messy business.I was more than a little curious about the whole business.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\nbusiness noun\n(THINGS YOU DO)\n[ U ] the things that you do or the matters that relate only to you: I started on the business of filling out the form. What she does with her life is her business.\nMore examplesFewer examplesIn spite of last night's terrorist attack, most people seem to be going about their business as if nothing had happened.\"Where have you been?\" \"Mind your own business!\"I was just motoring along, minding my own business, when suddenly I was stopped by the police.How you choose to conduct your private life is your own business!He's an interfering old busybody - who I go out with is none of his business!\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\nIdioms\nbe in business\nbe none of someone's business\nbe the business\n(it's) business as usual\nbusiness before pleasure\ndo the business\nget down to business\nhave no business doing something\nlike nobody's business\nnot be in the business of something\nMore idioms\nwhat a business!\nbusiness noun\n(BUYING AND SELLING)\nAdd to word list\nAdd to word list\n[ C/U ] the activity of buying and selling goods and services, or a particular company that does this, or work in general rather than pleasure: [ C ] He runs a dry cleaning business. [ U ] I’m in Baltimore on business. [ U ] Our firm does a lot of business with overseas customers. [ U ] She’s going into business (= starting a business) as a management consultant. [ U ] How’s business?\n[ C/U ] Business is also the degree of success of a company or of your work: [ U ] Business has been good.\nbusiness noun\n(A MATTER)\n[ U ] a matter or a situation: I have some business to settle with Mr. Redford. Preparing your taxes can be a tricky business.\nbusiness noun\n(THINGS YOU DO)\n[ U ] the things that you do or the matters that relate only to you: What she does after work is her own business. When I asked him what he was doing, he told me it was none of my business (= it did not involve me).\nIdioms\nbusiness as usual\nin business\nAdd to word list\nAdd to word list\n[ U ] the activity of buying and selling goods and services: in business She is an academic, but all her brothers work in business.be in business Currently, fewer firms are in business in the area than ever before.go into/set up in business She set up in business as a management consultant.be/be put/go out of business This new tax will put a lot of small firms out of business.do business with sb/sth Our firm does a lot of business with overseas customers.open for business/be open for business The new restaurant opens for business this Saturday, 12th June.a business deal/transaction/investment He made a $550,000 business deal with Beijing Machinery Import and Export.business activities/practices Many of us want to adopt more environmentally friendly business practices.a business venture/proposition/idea We can help you put your business idea into practice. The scare over product safety in China has created a business opportunity for testing laboratories. a business consultant/executive a business contact/partner the business world/sector She stood against a powerful coalition of political and business interests.\n[ U ] work that you do to earn money: be in the ... business He's in the frozen food business.the music/insurance/tourism business This is a glossary of terms used in the insurance business.on business Are you in Baltimore on business? a business appointment/meeting/trip a business call/letter\n[ C ] a company or organization that buys and sells goods or services: own/run/manage a business She owns several businesses in the city.set up/start a business He hopes to start a bicycle repair business. a telecoms/design/hairdressing businessa family/local business We are a family business, and everyone helps out in the shop. By the age of 24 I was running my own business.grow/develop/build the business We all know we could perform better, grow the business, plan for the future - if we had more time. Most business owners would like to think they know what their customers want.\n[ U ] the amount of work done or the number of goods or services sold by a company or organization: How is business at the moment?bring in/attract/win business The ads in the local press brought in a lot of business. He gives tips on finding new business, building a relationship with the customer, and closing deals.business is good/brisk/booming After last year's long dry summer, business is booming for irrigation companies. business is bad/slack/quiet\n[ U ] the fact that someone buys goods or services from a particular store, company, etc.: lose/need/want sb's business If you do not delight the customer, you risk losing their business.\nbusiness as usual\nused to say that a business is operating, people are working, etc. in the way that they normally do: It will be business as usual for the office even while the building work is going on.\nbusiness is business\nused to say that in a particular situation the most important thing is to do what is right for a business: It would have been nice to sell the company to friends, but business is business.\nsb you can do business with\nsomeone who you feel you can work well with, because you understand each other: Eventually they found a consultant they felt they could do business with. See also\nany other business\nbig business\ne-business\nfirst order of business\norganizing business\nrepeat business\nshow business\nsmall business"}