{"id":83816,"name":"busted","type":"adjective","us_sound":"ˈbʌs.tɪd","us_link":"../audio/b/cdo0318usbust0698.mp3","uk_sound":"ˈbʌs.tɪd","uk_link":"../audio/b/ukbushr013.mp3","content":"busted adjective\n(BROKEN)\nAdd to word list\nAdd to word list\n(UK usually bust) broken: Here's how to get help with a busted phone. He carried on playing guitar despite a busted finger.\nThesaurus: synonyms, antonyms, and examples\nbrokenbrokenThe microwave's broken.deadThe phone's dead; there must be a problem with the line.defunctThe TV's defunct!bustUK You won't be able to watch the game, the TV's bust.bustedUS Oh no, my laptop's busted.out of orderThe coffee machine was out of order.\nSee more results »\nMore examplesFewer examplesThe buildings needed only minor repairs - a leaky air conditioner, a busted water heater.If it's really busted, they'll have to give us another car.\nSMART Vocabulary: related words and phrases\nTearing and breaking into pieces\napart\nasunder\nbobble\nbobbly\nbreak into pieces\ncatch\ncrack\nfall apart\nfall to pieces idiom\nfragment\nfragmentation\nfragmented\nfrayed\nrip\nsplinter\nsplit\nsunder\ntear something apart\ntear something up\nteardown\nSee more results »\nbusted adjective\n(CAUGHT)\ncaught or arrested by the police for doing something illegal: He was busted for marijuana possession ten years ago.\nseen doing something wrong by someone: Were you ever busted for smoking at school? I saw you! You are so busted!\nMore examplesFewer examplesA picture at the bottom of the page shows a pair of hands cuffed together under the headline \"Busted\".An illegal smuggling ring got busted Thursday.I found myself watching as an attractive woman walked out of the elevator. Suddenly I felt the security camera staring at me. \"I'm busted,\" I thought.The story is about teenage lovers busted by an angry dad while kissing in a parked car.\nSMART Vocabulary: related words and phrases\nArresting & charging\napprehend\napprehension\narrest\nassist\nattach\nattachment\nbust\ncharge sheet\ncollar\nhandcuff\nhandcuffs\nhouse arrest\nknock\nnail\npick someone/something up\npolice action\npost-arrest\nprobable cause\npull\nthe knock at/on the door idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBad and wrong behaviour"}