{"id":83775,"name":"busyness","type":"noun","us_sound":"ˈbɪz.i.nəs","us_link":"../audio/b/cdo0318usbusy0699.mp3","uk_sound":"ˈbɪz.i.nəs","uk_link":"../audio/b/cdo0318ukbusy0230.mp3","content":"Add to word list\nAdd to word list\nthe fact of working hard or giving your attention to a particular thing: Some of us can handle more busyness and activity than others. I’m exhausted from the intense busyness of work over the past couple of months.\nthe state of a place that is full of activity or people: Some people like the busyness of fashionable yacht harbours. It is hard to imagine the busyness inside one of our cells.\na situation in which there are many things to do: The busyness of the time leading up to the wedding had wiped me out. Modern life has introduced incredible busyness. See\nbusy\nMore examplesFewer examplesI could claim busyness at work, but let's be honest, it really doesn't take much time to write a daily blog.I hope my busyness is temporary and once my dissertation is finished I’ll have time to relax.There is too much busyness in schools. Anyone fond of the town’s sleepy atmosphere may resent the busyness that the new townhouse developments will bring.A review of public hospitals found many barriers to care provision including the busyness of postnatal wards.Kids are more likely to talk about their feelings at bedtime than they are during the busyness of the day.We enjoyed the busyness of markets, cafes, galleries, museums, and theatres in Montreal.\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nharness\nmad\nplate\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nspread yourself too thin idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFull\nSituations and circumstances"}