{"id":83757,"name":"busy","type":"adjective","us_sound":"ˈbɪz.i","us_link":"../audio/b/busy.mp3","uk_sound":"ˈbɪz.i","uk_link":"../audio/b/ukbushr018.mp3","content":"busy adjective\n(DOING THINGS)\nAdd to word list\nAdd to word list\nA2 If you are busy, you are working hard, or giving your attention to a particular thing: Mum was busy in the kitchen. The kids are busy with their homework. She's busy writing out the wedding invitations. I've got plenty of jobs to keep you busy. He was too busy talking to notice us come in.\nThesaurus: synonyms, antonyms, and examples\nnot availablebusyI'm busy all morning - can we meet up in the afternoon?tied upI'll be tied up in meetings until 3.00pm, but could meet after that.unavailableThe CEO is currently unavailable - may I take a message?engagedI can't come to tea - I'm engaged elsewhere.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving a lot to dobusyI was busy clearing out the shed.up to your ears in somethingI'm up to my ears in chores!up to your eyeballs in somethingDon't bother her - she's up to her eyeballs in paperwork.up to your eyes in somethingI'm up to my eyes in work at the moment.up to your neck in somethingI can't help, I'm up to my neck in schoolwork.have your hands fullI have my hands full with the kids at the moment, so I can't take on any more work.\nSee more results »\nIf you are busy, you are not free or available to do something: Would you like to come over at the weekend, or are you busy? I'm busy on Tuesday morning but we could meet in the afternoon.\nA1 A busy place is full of activity or people: a busy restaurant Their house is near a very busy road.\nThesaurus: synonyms, antonyms, and examples\nfull of activitybusyThe pub is always busy on a Friday.fullShe leads a rich, full life.hecticThey tried to fit a holiday into their hectic schedules.freneticThe frenetic pace of city life is exhausting.bustlingThey moved to the bustling city centre.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ntoo full of vehiclesbusyThe M4 is always busy.congestedTraffic is congested heading into and out of the city this morning. gridlockedChicago is one of the most gridlocked cities in America.backed upThere's an accident on the motorway and traffic is backed up for miles.bumper to bumperThe road is bumper to bumper as tourists flock up the coast.jammedTraffic is jammed up for miles.\nSee more results »\nA2 In a busy period, you have a lot of things to do: I have a busy week ahead of me. You've had a busy day.\n(UK also engaged) If a phone line is busy, someone is using it: I tried calling you but the line was busy.\nMore examplesFewer examplesThe meeting will have to wait until tomorrow, because I'm too busy now.Davies is busy adapting Brinkworth's latest novel for television.She's busy knitting baby clothes.A bomb exploded at one of London's busiest railway stations this morning.I like to keep busy.\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nharness\nmad\nplate\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nspread yourself too thin idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnavailable and inaccessible\nbusy adjective\n(WITH PATTERNS)\ndisapproving having too much decoration or too many colours: The jacket was a bit too busy for my tastes - I'd prefer something plainer.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\ndelicacy\nfinicky\nhigh-tech\nindirectly\ninsolubility\nintractability\nonerousness\nornate\nornately\nover-elaborate\nover-fussy\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nRelated word\nbusyness\nbusy yourself\nto make the time pass by doing something: I busied myself with tidying up my desk. I busied myself in the kitchen and tried hard not to worry. I busied myself with voluntary work and, in time, forgot that I was miserable. Anna busied herself in the garden till lunch. Tom left the women to talk and busied himself arranging the children's toys. My mother busied herself with dinner preparations while my father and brother chatted. Synonym\noccupy\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nfait accompli\nmove\nresponsibility\nrole-play\nrot\nstep\nstep up\nstuff\ntalk\nSee more results »\nAdd to word list\nAdd to word list\n(of a person) actively involved in doing something or having a lot of things to do, or (of a time or place) when or where a lot of things are happening: a busy street the busy summer months I’ve been so busy lately that I haven’t had time to have any social life. Getting the house ready for her relatives kept her busy the whole day.\nIf a telephone is busy, it is being used by someone else: Her line is still busy.\nto make the time pass by doing something: Aimee busied herself with a favorite book.\nAdd to word list\nAdd to word list\nworking hard, or giving your attention to a particular thing: too busy to do sth I have been far too busy to think about taking time off.busy with sth/sb All our agents are currently busy with other customers.busy doing sth While we were busy planning our expansion, he was planning to take over the company.a busy man/woman/person I won't take up much of your time, because I know you're a busy woman.\nfull of activity or people: a busy office/restaurant/street The shop is always busy on Saturdays.\nin a busy period, you have a lot of things to do: a busy week/day/morning It’s been a busy week.\nCOMMUNICATIONS\n&#160; ( UK also engaged) if a telephone line is busy, someone is using it: I tried calling the office, but the line was busy."}