{"id":83867,"name":"butchery","type":"noun","us_sound":"ˈbʊtʃ.ɚ.i","us_link":"../audio/b/usbusty006.mp3","uk_sound":"ˈbʊtʃ.ər.i","uk_link":"../audio/b/ukbushr027.mp3","content":"butchery noun\n(FOR MEAT)\nAdd to word list\nAdd to word list\n[ U ] the work of killing animals and preparing meat for sale: \"Flank\" is a term used in butchery for meat from between the ribs and the hips of an animal. Butchery is a skill that takes time to learn.\n[ C ] a place where animals are killed for their meat or meat is prepared for sale: He ran a butchery on a chicken farm. Synonym\nabattoir\n[ C ] a shop or part of a shop that sells meat: The supermarket has a butchery, bakery, deli counter, and restaurant. He opened a butchery stall at an East London market. Synonym\nbutcher (SHOP)\nMore examplesFewer examplesSkinning rabbits is one of many basic butchery techniques which are being lost.Reputable farmers would have nothing to do with illegal butchery.Alongside a butchery selling the farm's own beef, pork, and lamb, the farm shop has an on-site bakery and a well-stocked delicatessen. Many of these villages still have traditional small butcheries and fishmongers. The meat mincer was in the butchery which had been built on the family's cattle farm.\nSMART Vocabulary: related words and phrases\nPreparing animals & fish for cooking\nbone\nboneless\nceviche\nchine\nclean\ndebeard\ndevein\nfleishig\nFrenching\ngut\nhang\njoint\npaillard\npluck\nskin\nskinless\nspatchcock\ntenderize\ntruss\nuntrimmed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeat - general words\nAnimal farming - general words\nKilling\nFactories\nShops & auctions\nbutchery noun\n(CRUEL KILLING)\n[ C or U ] cruel killing, or an act of cruel killing, especially of large numbers of people: This invasion has involved the butchery of innocent men, women, and children. We must never allow the butcheries of the Second World War to be repeated.\nMore examplesFewer examplesHe admits that most empires are built on butchery.The film tells a dark tale of butchery and revenge.To witness such a butchery was a deep trauma.Enraged by these butcheries, the people rose up against the regime.\nSMART Vocabulary: related words and phrases\nMurder & attempted murder\nasphyxiation\nassassinate\nassassination\nassassination attempt\nattempt\nbutcher\ndrive-by\ngenocidal\ngenocide\ngun someone down\nholocaust\nhomicide\npolish\npolish something off\npop off\nput someone to the sword idiom\nregicide\nslaughter\nsnuff\nthrottle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKilling"}