{"id":84030,"name":"button","type":"noun","us_sound":"ˈbʌt̬.ən","us_link":"../audio/b/eus70644.mp3","uk_sound":"ˈbʌt.ən","uk_link":"../audio/b/ukbutte008.mp3","content":"button noun [C]\n(FOR FASTENING)\nAdd to word list\nAdd to word list\nB1 a small, usually circular object used to fasten something, for example a shirt or coat: I did up/undid (= fastened/unfastened) the buttons on my blouse. He unfastened his top button. I had to sew a new button onto my trousers\nmalerapaso/E+/GettyImages\nMore examplesFewer examplesThe jacket is navy with gold buttons.I fastened the buttons on my coat and wrapped my scarf tightly around my neck.He toyed nervously with a button on his jacket as he was speaking.\nSMART Vocabulary: related words and phrases\nFasteners for clothes\nbelt\nbrace\nbuckle\nbuckled\nbutton fly\nbutton-through\ncinch\neyelet\nfastener\nflies\ngrommet\nhook and eye\nsash\nsnap\nsnap fastener\nstud\nsuspender\nsuspenders phrase\ntoggle\nVelcro\nSee more results »\nbutton noun [C]\n(ON MACHINE)\nB1 a small, sometimes circular object that you press to operate a device or a machine, or an area on a computer screen that looks and acts like one of these: He inserted the disk and pressed the \"play\" button.\nBryan Mullennix/The Image Bank/GettyImages\nMore examplesFewer examplesThe machine emits a high-pitched sound when you press the button.Press this button and the video will automatically tune itself to the next channel.To turn the television on, you just push this button.I put my money in the slot and pressed the button but nothing came out.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nbutton noun [C]\n(SHOWING SUPPORT)\nUS (UK badge) a flat metal or plastic object, usually round, with a picture or message on it, that can be fastened to clothes with a pin, often in order to show that you like or support a particular group, idea, belief, etc.: They were prohibited from wearing political buttons at school. Some of them wore Trump buttons and hats.\nTetra Images/GettyImages\nMore examplesFewer examplesHer employers weren't happy when she showed up to work wearing a big union button.A button on her lapel read \"Proud LGBT Parent\".He sported a \"No Nukes\" button and a smiley face button.\nSMART Vocabulary: related words and phrases\nVoters & candidates in elections\nabstainer\nBrexiteer\ncandidate\ncarpetbagger\nconstituency\nconstituent\ncoronate\nfloating voter\nmulti-candidate\nnay\nnon-voter\nnon-voting\nprimary\nslate\nswing voter\nticket\nunaffiliated\nvoter\nwrite in\nyea\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nbutton noun [C]\n(FENCING)\nsports\n&#160; specialized a small plastic cover on the end of a foil (= thin, light sword) used in fencing (= the sport of fighting with long, thin swords): In modern fencing, points are blunted and then covered with a button.\nMore examplesFewer examplesWeapons have a button on the end - not a sharp tip!The foil comprises a handle, a small round guard, a blade, which is thicker at the base than at the top, and a button on the end.\nSMART Vocabulary: related words and phrases\nFighting sports\naikido\nall-in wrestling\narm-wrestling\nbantamweight\nblack belt\nfeint\nfull nelson\ngrappler\ngumshield\nhalf nelson\nhammerlock\nleft-hander\npugilist\npugilistic\npunch-drunk\npunchbag\npuncher\npunching bag\nsouthpaw\nwrestler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLids, covers and stoppers\nProtection and protectors\nIdioms\nat the push of a button\nbright as a button\npress/push/hit (all) the right buttons\npress/push someone's buttons\nright on the button\nto fasten something, usually a piece of clothing, using buttons: Button (up) your coat, it's cold outside.\nSMART Vocabulary: related words and phrases\nFasteners for clothes\nbelt\nbrace\nbuckle\nbuckled\nbutton fly\nbutton-through\ncinch\neyelet\nfastener\nflies\ngrommet\nhook and eye\nsash\nsnap\nsnap fastener\nstud\nsuspender\nsuspenders phrase\ntoggle\nVelcro\nSee more results »\nIdioms\nbutton it\nbutton your lip\nbutton noun [C]\n(CLOTHING FASTENER)\nAdd to word list\nAdd to word list\na small, usually circular object that is sewn on a shirt, coat, or other piece of clothing, and is used to fasten it\nA button is also a small, usually circular sign that you can pin on your clothes: When you pay the admission fee at the museum, they give you a button to wear to show you’ve paid.\nbutton noun [C]\n(OBJECT YOU PRESS)\na small object that you press to operate a device or a machine: The button on the left starts the tape recorder and the one on the right stops it.\nbutton verb [T]\n(FASTEN)\nto fasten something, usually a piece of clothing, using buttons: He buttoned his shirt.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS, IT a small, often circular object which you press to operate a device or a machine, or an area on a computer screen which looks and works like one of these: press/hit/push a button Press the green button to start the machine and the red button to stop it.the send/save/delete button Always re-read your email messages carefully before you hit the send button.\nMARKETING →\nbutton ad"}