{"id":84091,"name":"buzz","type":"verb","us_sound":"bʌz","us_link":"../audio/b/buzz.mp3","uk_sound":"bʌz","uk_link":"../audio/b/ukbutte016.mp3","content":"buzz verb\n(MAKE SOUND)\nAdd to word list\nAdd to word list\nC2 [ I ] to make a continuous, low sound such as the one a bee makes: I can hear an insect buzzing. My phone buzzed at five in the morning and woke me.\n[ I or T ] to press a buzzer in order to get someone's attention: I buzzed him but there was no answer. The first person to buzz may answer.\n[ T + adv/prep ] to allow someone to enter a place by pressing a button that opens a door and makes a buzzing sound: Press the intercom and I'll buzz you in. We were buzzed into the lobby. A secretary buzzed them up to the conference room on the top floor.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmew\nmiaow\nmoo\npurr\nroar\nsqueal\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nArriving, entering and invading\nbuzz verb\n(BUSY OR EXCITED)\n[ usually + adv/prep, I ] to move around quickly or with a lot of energy: Reporters were buzzing around, trying to get the full story. From here you can see cars buzzing along the motorway.\nC2 [ I ] (of a place) to be full of people or activity: The airport is buzzing as Christmas nears. At this time on a Saturday, the restaurant is buzzing with customers. The whole town buzzed with rumours.\n[ I ] (of a person or their mind) to be thinking about many different things at the same time: I had so many questions - my head was buzzing. My mind was buzzing and I just couldn't get to sleep. Karina's on great form. She's buzzing with new ideas and projects. His mind buzzed with all the possibilities that lay before him.\n[ I ] informal to talk in an excited way about something: Everyone was buzzing about how cool this place was. Political bloggers buzzed over this unexpected turn of events. Her latest movie has got everyone buzzing. be buzzing\ninformal to be very excited and happy or energetic: It's all going really well for me here. I'm buzzing!\nSee more\nMore examplesFewer examplesMy mother and my aunts were all buzzing around in the kitchen.He decided to buzz over to France for lunch in his helicopter.This place is usually buzzing late into the night.It's no wonder the media world is buzzing about his planned takeover.My head's buzzing with all these ideas.She made her way to the station, her mind buzzing with everything she'd seen and heard.The singer confirmed that he and his girlfriend were expecting a boy and said, \"I'm buzzing!\"\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusy and active\nInformal talking & conversation\nbuzz verb\n(FLY LOW)\n[ T ] informal If an aircraft buzzes a place or people, it flies over it or them very low and fast.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nflight\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nlift\nmid-air\nnon-flying\nskim\nsoar\nsoaring\nsomersault\nswishy\nswoop\nwaft\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: aviation\nbuzz verb\n(CUT HAIR)\n[ T ] informal to cut someone's hair very short using a special machine\nSMART Vocabulary: related words and phrases\nHair care\nargan oil\nblow dryer\nblowout\nbobble\nbobby pin\nbrush\ncoconut oil\ncoily\ncrimp\nhair gel\nhair slide\nhairdryer\npermanent wave\nrelaxed\nrelaxer\nroller\nsnood\nstraighteners\nstyling\nuncombed\nSee more results »\nPhrasal verb\nbuzz off\nbuzz noun\n(SOUND)\nC2 [ C usually singular ] a continuous, low sound: I heard a buzz and then saw the plane in the distance.\nMore examplesFewer examplesHe was woken by the buzz of a mosquito in his ear.I miss having people around, the buzz of coworkers talking.They make a series of clicks and buzzes and whistles and chirps.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmew\nmiaow\nmoo\npurr\nroar\nsqueal\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nbuzz noun\n(EXCITEMENT)\nC2 [ C usually singular ] informal a feeling of excitement, energy, and pleasure that something gives you: I love riding fast - it gives me a real buzz. I get a buzz out of public speaking. Synonym\nthrill\n[ C usually singular or U ] informal an exciting, busy atmosphere (= feeling or mood) in a place: The streets surrounding the stadium had a buzz about them that hasn't been felt for many years. There's a real buzz in the streets of Covent Garden.\nThesaurus: synonyms, antonyms, and examples\nactivityactivityThere were several police vans and a lot of activity in the area.hubbubI couldn't find her with all the hubbub going on.bustleI miss the bustle of the big city.hustle and bustleShe got used to the hustle and bustle of daily life.flurry of activityWhat was the reason behind this sudden flurry of activity?burst of activityIt's usually quiet in the shop, but occasionally we have a sudden burst of activity.\nSee more results »\n[ C usually singular or U ] informal excited, usually positive, talk about something or someone: There's such a buzz about sustainability now. His hairstyles generated more buzz than his music.\nMore examplesFewer examplesActing is hard but there's such a buzz when you get it right.I miss the buzz of the city, the cultural life, the intellectual community.There's so much buzz about this new player.The band got a good buzz going with its first album. Alas, buzzes don't last, and neither did they.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nIdiom\ngive someone a buzz\nbuzz verb\n(MAKE SOUND)\nAdd to word list\nAdd to word list\n[ I/T ] to make a continuous, low sound such as the sound some insects make, or to move quickly while making this sound: [ I ] Something was buzzing around me as I tried to sleep.\n[ I/T ] Someone who buzzes you calls you by using a device that makes a low, continuous sound: [ T ] All were expected to run, literally, into McLaughlin’s office whenever he buzzed them.\nbuzz verb\n(BE FILLED WITH)\n[ I ] to be filled with excitement, activity, or sounds: The place was buzzing with excitement.\nbuzz noun [C usually sing]\n(MAKE SOUND)\na continuous, low sound: the buzz of conversation\ninfml A buzz is also a telephone call: I’ll give you a buzz early next week.\nAdd to word list\nAdd to word list\nto press a buzzer in order to get someone's attention: I buzzed his office but there was no answer. If I need to talk to you, I'll buzz.\n[ S ]\n&#160; MARKETING interested or excited talk about a new product, an event, or a person: To create a buzz that will spread to potential customers, the product itself should really excite the users.\ngive sb a buzz\nCOMMUNICATIONS\n&#160; informal to phone someone: I'll give you a buzz next week."}