{"id":33138,"name":"by","type":"preposition","us_sound":"baɪ","us_link":"../audio/b/buy.mp3","uk_sound":"baɪ","uk_link":"../audio/b/ukbutte013.mp3","content":"by preposition\n(AGENT)\nAdd to word list\nAdd to word list\nA2 used to show the person or thing that does something: The motorcycle was driven by a tiny bald man. We were amazed by what she told us. I'm reading some short stories (written) by Chekhov. The book was translated by a well-known author. I felt frightened by the anger in his voice.\nMore examplesFewer examplesThe roof of the temple was held up by a row of thick stone columns.The girl's mother was at home today, being comforted by relatives.The English were conquered by the Normans in 1066.The temperature is controlled by a thermostat.Any painting by Van Gogh is worth a fortune.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nby preposition\n(METHOD)\nA2 used to show how something is done: They travelled across Europe by train/car. She did the decorating (all) by herself (= alone, without help from anyone). We went in by (= through) the front door. Do you want to be paid in cash or by cheque? He learned English by listening to the radio. Suddenly, she grabbed him by the arm (= took hold of this part of his body). I refuse to live by (= following) their rules.\nMore examplesFewer examplesShe cheated in the test by copying from the boy in front.I don't have any cash on me, so could I pay by cheque?Whenever I travel by train, I always travel first class.He managed to stay afloat by holding on to the side of the boat.The pilot avoided a collision by changing course.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nby preposition\n(POSITION)\nB1 near or at the side of: A small child stood sullenly by her side. He wanted to keep her close by him always. The policewoman walked by (= past) them without saying a word.\nMore examplesFewer examplesWe spent a week by the coast.He held my arms down by my sides.He has a house down by the harbour.She sat reading by the fireside.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\nby preposition\n(NOT LATER THAN)\nA2 not later than; at or before: She had promised to be back by five o'clock. The application must be in by the 31st to be accepted. By the time I got to the station the train had already gone.\nThesaurus: synonyms, antonyms, and examples\nbefore somethingbeforeTry to arrive before the start of the meeting.prior toAll utensils should be washed prior to use.in advance ofCall in advance of your visit to see if you'll need a parking reservation.ahead ofMy sister is arriving ahead of me to do the shopping for the dinner.byMake sure you're back by midnight.\nSee more results »\nMore examplesFewer examplesWe are committed to withdrawing our troops by the end of the year.All contributions for the school magazine must be received by 1 August.We need a firm decision by the end of the week.I've got to be home by seven.I aim to be a millionaire by the time I'm 35.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nby preposition\n(MEASUREMENT)\nB2 used to show measurements or amounts: Our office floor space measured twelve metres by ten (= was twelve metres in one direction and ten in the other). Their wages were increased by 15 percent. Freelance workers are paid by the hour (= for every hour they work). These phones have sold by the thousand (= several thousand have been sold). minute by minute/hour by hour/day by day, etc. (also by the minute/hour/day, etc.)\nused to say that something increases or changes with every minute, hour, day, etc. that passes: The death toll from the hurricane was climbing minute by minute.\nSee more minute-by-minute/hour-by-hour, etc.\ndescribing or showing what happens every minute, hour, etc.: Police presented a minute-by-minute timeline of the incident.\nSee more\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nby preposition\n(DURING)\nduring: We travelled by night and rested by day.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nby nature, profession, trade, etc.\nused when describing someone's character, job, etc.: She is, by nature, a sunny, positive kind of person.\nSee more\nbe all right/fine by someone\nIf something is all right/fine by someone, they agree that it can happen: \"I'd rather go later.\" \"That's fine by me.\"\nSee more Grammar\nByBy is a preposition or an adverb. …\nBy and timeWe use by meaning ‘not later than’ to refer to arrangements and deadlines: …\nBy and the passiveWhen we use the passive voice, we can use a phrase with by to say who did the action: …\nBy meaning ‘how to do something’We use by + -ing form to describe how to do something: …\nBy + myself etc.When we say by + myself, yourself, himself, herself, itself, oneself, ourselves, yourselves, themselves, it means ‘alone’. We sometimes use all for emphasis: …\nBy and placeWe use by to mean ‘beside’ or ‘at the side of’: …\nBy and measurements and amountsWe use by to talk about measurements, and increases and decreases in amounts: …\nBy meaning ‘during’We sometimes use by + day and by + night to mean ‘during the day or the night’: …\nBy meaning ‘written’ or ‘composed’We use by when we talk about the writers of books, songs, poems, symphonies, etc.: …\nBy: typical errorsWe say by car, by bus, by plane etc. but if there is a determiner (e.g. a/an, the, some, his), we say in or on: …\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nB1 at the side of or (in distance or time) past: The policewoman walked by without saying a word. Why don't you call in for a cup of coffee next time you're passing by? The years flew by.\nMore examplesFewer examplesI was just passing by, so I thought I'd drop in for a chat.He tapped Brown on the shoulder as he went by.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\nGrammar\nByBy is a preposition or an adverb. …\nBy and timeWe use by meaning ‘not later than’ to refer to arrangements and deadlines: …\nBy and the passiveWhen we use the passive voice, we can use a phrase with by to say who did the action: …\nBy meaning ‘how to do something’We use by + -ing form to describe how to do something: …\nBy + myself etc.When we say by + myself, yourself, himself, herself, itself, oneself, ourselves, yourselves, themselves, it means ‘alone’. We sometimes use all for emphasis: …\nBy and placeWe use by to mean ‘beside’ or ‘at the side of’: …\nBy and measurements and amountsWe use by to talk about measurements, and increases and decreases in amounts: …\nBy meaning ‘during’We sometimes use by + day and by + night to mean ‘during the day or the night’: …\nBy meaning ‘written’ or ‘composed’We use by when we talk about the writers of books, songs, poems, symphonies, etc.: …\nBy: typical errorsWe say by car, by bus, by plane etc. but if there is a determiner (e.g. a/an, the, some, his), we say in or on: …\nIdiom\nby and by\nby preposition\n(CAUSE)\nAdd to word list\nAdd to word list\nused to show the person or thing that causes something to happen or to exist: The car was driven by a short, bald man. I’m reading some short stories by Chekhov. I took her umbrella by mistake.\nby preposition\n(METHOD)\nused to show how something is done: They thought about flying to Boston but decided to go by car. She did the repair work by herself (= without help). Do you want to be paid in cash or by check? He learned English by listening to the radio.\nby preposition\n(ACCORDING TO)\naccording to: By my watch, it’s 2 o’clock. The students were listed by name.\nby preposition\n(NOT LATER THAN)\nnot later than; at or before: She promised to be back by 10 p.m.\nby preposition\n(MEASUREMENT)\nused to show measurements or amounts: Their wages increased by 12%. The room measures 15 feet by 20 feet.\nby preposition\n(DURING)\nduring: We traveled by night and rested by day.\nIdioms\nby all means\nby and large\nby heart\nby hook or by crook\nby the book\nby the same token\nby preposition, adverb [not gradable]\n(NEAR)\nnear, beside, or (in distance or time) past: A small child stood quietly by her side. Claire waved as she drove by. As time went by, she became more attached to him."}