{"id":35382,"name":"byzantine","type":"adjective","us_sound":"ˈbɪz.ən.tiːn","us_link":"../audio/b/usbusty018.mp3","uk_sound":"bɪˈzæn.taɪn","uk_link":"../audio/b/ukbysta004.mp3","content":"Add to word list\nAdd to word list\ncomplicated and difficult to understand: rules of byzantine complexity He called for an overhaul of the byzantine tax system. The calculations become positively Byzantine in their complexity.\nMore examplesFewer examplesThe byzantine legal manoeuvring went on for years.They are seeking alternatives to the current Byzantine process for channelling money into education schemes.Anyone who has managed the complex challenges of a large household can survive the most byzantine office intrigues.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\ndelicacy\nfinicky\nhigh-tech\nindirectly\ninsolubility\nintractability\nonerousness\nornate\nornately\nover-elaborate\nover-fussy\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult to understand\nfrom or relating to the ancient city of Byzantium (also known as Constantinople and now called Istanbul), to the Eastern Roman Empire of which it was the capital from the 4th to the 15th century CE, or to the Eastern Orthodox Church: Mosaic art flourished in the Byzantine Empire from the 6th to the 15th centuries. Her compositions are inspired by religious icons and Byzantine art.\nMore examplesFewer examplesThe walls of the cave feature 4th-century rock art similar to Byzantine representations of John the Baptist.The plundering of Constantinople in 1204 contributed to the collapse of the Byzantine Empire three centuries later. The Fourth Crusade attacked Constantinople, home of Byzantine Christians.The jewellery is inspired by Byzantine and Baroque styles, incorporating elaborate flourishes and large gems.\nSMART Vocabulary: related words and phrases\nMiddle Ages (medieval Period) 501-1500\nalchemy\nbestiary\nBlack Death\nbubonic plague\nchivalric\nchivalrous\nHejira\njoust\nLancastrian\nmangonel\nmediaeval\nmedieval\nNorman\npre-Columbian\npre-feudal\nRomanesque\nthe Norman Conquest\ntroubadour\nViking\nYorkist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAncient history: before 500 AD\nChristian denominations\nAdd to word list\nAdd to word list\nworld history of or having to do with the ancient city of Byzantium or the Eastern Roman Empire"}