{"id":1,"name":"a","type":"noun","us_sound":"eɪ","us_link":"../audio/a/a_01_00.mp3","uk_sound":"eɪ","uk_link":"../audio/a/uka____001.mp3","content":"A, a noun\n(LETTER)\nAdd to word list\nAdd to word list\n[ C or U ] the first letter of the English alphabet\nSMART Vocabulary: related words and phrases\nLetters of alphabets\naitch\nalphabet\nalphabetic\nalphabetical\nalphabetically\nalphabetization\nalphanumeric\nalphanumerically\nB, b\ngamma\nI, i\niota\nJ, j\nK, k\nkappa\nQ, q\nrho\nS, s\nsigma\nT, t\nSee more results »\nA, a noun\n(MUSIC)\n[ C or U ] a note in Western music: This concerto is in the key of A major.\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nregister\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nA, a noun\n(MARK)\n[ C or U ] a mark in an exam or for a piece of work that shows that your work is considered excellent: Sophie got an A for English. She got straight As (= all her marks were As) in her final exams. Jim is a straight-A student (= all his marks are A).\nSMART Vocabulary: related words and phrases\nMarks & results\n2:1\n2:2\nB, b\nC, c\nclass\ncontinuous assessment\nformatively\nGPA\ngrade boundary\ngrade-point average\nhonor student\npass\npass rate\npassing grade\npositive\npositivity\nscore\nstraight As\nstraight-A\nthird\nSee more results »\nIdioms\nfrom A to B\nfrom A to Z\na determiner\n(NOT PARTICULAR)\nA1 used before a noun to refer to a single thing or person that has not been mentioned before, especially when you are not referring to a particular thing or person: I've bought a car. She's got a boyfriend. There was a sudden loud noise. What a shame that you couldn't go to the party. I heard a child crying. Is he a friend of yours (= one of your friends)?\nA1 used to say what type of thing or person something or someone is: She wants to be a doctor when she grows up. This is a very mild cheese. Experts think the painting may be a Picasso (= one done by Picasso).\nA1 used to mean any or every thing or person of the type you are referring to: Can you ride a bike? A cheetah can run faster than a lion. A teacher needs to have a lot of patience.\nused before some uncountable nouns when you want to limit their meaning in some way, such as when describing them more completely or referring to one example of them: I only have a limited knowledge of Spanish. He has a great love of music. There was a fierceness in her voice.\nA2 used before some nouns of action when referring to one example of the action: Take a look at this, Jez. I'm just going to have a snack. There was a knocking at the door.\nA2 used when referring to a unit or container of something, especially something you eat or drink: I'd love a coffee. All I had for lunch was a yogurt.\nA2 used before the first but not the second of two nouns that are referred to as one unit: a cup and saucer a knife and fork\nA2 used before some words that express a number or amount: a few days a bit of wool a lot of money\nused in front of a person's name when referring to someone who you do not know: There's a Ms Evans to see you.\nused in front of someone's family name when they are a member of that family: Is that a Wilson over there?\nused before the name of a day or month to refer to one example of it: My birthday is on a Friday this year. It's been a very wet June.\nMore examplesFewer examplesWhat is the usual pay for a job like this one?Suddenly a dog ran out into the road in front of us.The customer said she'd like this coat if it was a nicer colour.Colin told a joke about a postman, but it wasn't very funny.Shall I bring a bottle of wine with me?\na determiner\n(ONE)\nA1 one: a hundred a thousand a dozen There were three men and a woman.\nA2 used between a fraction and a unit of measurement: half a mile a quarter of a kilo three quarters of an hour six tenths of a second\nA2 used when saying how often something happens in a certain period: Take one tablet three times a day. I swim once a week.\nA2 used when saying how much someone earns or how much something costs in a certain period: She earns $100,000 a year. My plumber charges £30 an hour. I pay £25 a week for my parking permit.\nSMART Vocabulary: related words and phrases\nNumbers: cardinal, including nought & zero\nB, b\nbi\ncipher\ndeca-\nduodecillion\nfifteen\nforty\ngoogol\njillion\nkazillion\nnaught\nnineteen\nsix\nsixty\nten\nthirteen\nthirty\nunit\nzero\nzillion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFractions\nLinguistics: both, all, each & every\nGrammar\nA/an and theA/an and the are articles. They are a type of determiner and they go before a noun. …\nA/an and the: meaningA/an and the are articles. They are a type of determiner and they go before a noun. …\nWhen do we use a and when do we use an?In speaking, we use a /ə/ before a consonant sound: …\nHow do we pronounce the?We pronounce the in two ways depending on whether the sound which comes after the is a vowel or a consonant: …\nWhen do we use articles? …\nA/an and the: typical errorsWe don’t use the with plural nouns when we are referring to things in general: …\nA noun\n(ELECTRICITY)\nwritten abbreviation for\namp\nSMART Vocabulary: related words and phrases\nElectricity - units\namp\namperage\ncoulomb\nelectron\nerg\nkilowatt\nlumen\nmegawatt\nmicrocoulomb\nmilliampere\nmuon\nohm\nterawatt\nthe Faraday constant\nvolt\nvoltage\nW, w\nwatt\nwattage\nIdiom\nfrom A to B\na preposition\n(EACH OR EVERY)\nAdd to word list\nAdd to word list\nin or for each or every; per: Take one tablet three times a day. These shoes cost $30 a pair.\nA noun\n(LETTER)\n[ C ] (also a) plural A’s or a’s the first letter of the English alphabet\nA noun\n(MUSICAL NOTE)\n[ C/U ]\n&#160; music\n&#160; plural A’s or As in Western music, the sixth note in the scale (= series of notes) that begins on the note C, or a set of notes based on this note\nA noun\n(MARK)\n[ C ] plural A’s or As a mark that means excellent, given to something of the highest quality, esp. school work: The teacher gave me an A for my essay."}