{"id":91,"name":"abandon","type":"verb","us_sound":"əˈbæn.dən","us_link":"../audio/a/abandon.mp3","uk_sound":"əˈbæn.dən","uk_link":"../audio/a/uka____013.mp3","content":"abandon verb [T]\n(LEAVE)\nAdd to word list\nAdd to word list\nB2 to leave a place, thing, or person, usually for ever: We had to abandon the car. By the time the rebel troops arrived, the village had already been abandoned. As a baby he was abandoned by his mother.abandon ship We were sinking fast, and the captain gave the order to abandon ship.\nMore examplesFewer examplesIf disturbed, the bird may abandon the nest, leaving the chicks to die.It was his instinct for self-preservation that led him to abandon his former friends and transfer his allegiance to the new rulers.According to an eyewitness account, the thieves abandoned their vehicle near the scene of the robbery and then ran off.The police are trying to trace the mother of a newborn baby found abandoned outside a hospital.The house had been abandoned for several years before they decided to demolish it.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon ship\nabandonment\nabsquatulate\nbackward\nbe ready to roll idiom\ngone\nmove\np.o.q.\npiss off\npull\npull out\npull something off\npush along\npush off\nsea\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nwalk out\nSee more results »\nabandon verb [T]\n(STOP)\nC1 to stop doing an activity before you have finished it: The game was abandoned at half-time because of the poor weather conditions. They had to abandon their attempt to climb the mountain. The party has now abandoned its policy of unilateral disarmament.\nThesaurus: synonyms, antonyms, and examples\nto cancel somethingcancelSorry, I have to cancel our plans tonight.call offThe game has been called off because of the weather.offThe meeting's off because James is ill.scrapWe've scrapped our plans for a trip to France.suspendThe ferry service has been suspended for the day because of bad weather.postponeWe've postponed the wedding until next year.\nSee more results »\nMore examplesFewer examplesSweden isn't likely ever to abandon its traditional neutrality.Pressure to abandon the new motorway is increasing.We were unable to get funding and therefore had to abandon the project.A lot of farming techniques have been abandoned because they were too labour-intensive.Most European countries have abandoned laws that make vagrancy a crime.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbitter\nbrake\ncure\nhang\njack something in\nkill something stone-dead idiom\nknock\nknock off (something)\nlay\nlid\nsnap\nstamp on something\nstamp something out\nstanch\nstaunch\nstem\nSee more results »\nabandon yourself to something\nto allow yourself to be controlled completely by a feeling or way of living: He abandoned himself to his emotions.\nSee more\nRelated words\nabandoned\nabandonment\nwith (gay/wild) abandon\nin a completely uncontrolled way: We danced with wild abandon.\nSee more\nAdd to word list\nAdd to word list\nto leave behind or run away from someone or something, or to give up something: Air attacks forced the villagers to abandon their homes. The weather was so bad, we abandoned our plans for a picnic. abandonment noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈbæn·dən·mənt/\nArcheologists don’t know what could have caused a mass abandonment of the area.\nAdd to word list\nAdd to word list\nto stop an activity before it is finished, usually because you think you cannot succeed: abandon a project/plan/an idea The car maker has abandoned its plans to build a giant new plant.abandon a lawsuit/case/claim The high cost of legal representation can influence a person's decision about whether to abandon a claim.\nto leave a person, place, or thing that needs you to care for them: He kept the company going because he didn't want to abandon his staff. A vehicle had been abandoned on the side of the road.\nINSURANCE to allow an insurance company to keep property that has been lost or damaged, in exchange for an insurance payment\nabandonment noun [ U ]\nHigh winds forced the abandonment of efforts to erect the structure."}