{"id":231,"name":"abbreviation","type":"noun","us_sound":"əˌbriː.viˈeɪ.ʃən","us_link":"../audio/a/abbreviation.mp3","uk_sound":"əˌbriː.viˈeɪ.ʃən","uk_link":"../audio/a/uka____027.mp3","content":"Add to word list\nAdd to word list\na short form of a word or phrase: \"ITV\" is the abbreviation for \"Independent Television\".\nThesaurus: synonyms, antonyms, and examples\nto be the abbreviation for somethingbe an/the abbreviation forDST is the abbreviation for daylight saving time.stand forGPS stands for \"Global Positioning System\".short for somethingJo is short for Josephine.be abbreviated toThe word \"immunoglobulin\" is often abbreviated to \"Ig\".be shortened toThe word \"propeller\" is often shortened to \"prop\".\nSee more results »\nMore examplesFewer examplesThere is a list of abbreviations near the beginning of the book.What does the abbreviation WHO stand for?Please use the abbreviation \"cm\" for \"centimetres\", without any full stop after it.Sorry - could you explain what some of these abbreviations mean in your letter?We generally use the abbreviation \"MP\" instead of writing out \"Member of Parliament\" in full.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonymous\nbuzzword\ncognate\ncoinage\nhomographic\nhomography\nhomonymic\nhomonymy\nhomophonic\npalindrome\npragmatics\nproductive\nproductively\nreceptive\nreceptively\nSee more results »\nGrammar\nInitialsAn initial is the first letter of a word. We often use initials to refer to the names of countries and organisations: …\nAcronymsAcronyms are words which are formed from the first letters of other words, and which are pronounced as full words. Examples of acronyms: …\nAbbreviations, initials and acronymsWhen we abbreviate a word or phrase, we shorten it. Abbreviations can be formed from the first letters of the word or phrase. In such cases, we normally say them by spelling out each letter: …\nAbbreviations and lettersWhen we abbreviate a word or phrase, we shorten it. Abbreviations can be formed from the first letters of the word or phrase. In such cases, we normally say them by spelling out each letter: …\nAdd to word list\nAdd to word list\na shortened form esp. of a word or phrase: UN is the abbreviation for the United Nations. The letters i.e. are an abbreviation of a Latin phrase that means \"that is.\""}