{"id":761,"name":"about","type":"preposition","us_sound":"əˈbaʊt","us_link":"../audio/a/about.mp3","uk_sound":"əˈbaʊt","uk_link":"../audio/a/ukabnor020.mp3","content":"about preposition\n(CONNECTED WITH)\nAdd to word list\nAdd to word list\nA1 on the subject of, or connected with: go on about He's always going on about what a great job he's got.there's something about There's something about her attitude that worries me.what about it \"Is that your car?\" \"Yes, what about it?\" while someone is about it UK informal Could you make me a coffee too while you're about it (= while you are making one for yourself)? What's that book about? a film about the Spanish Civil War We were talking/laughing about Sophie. I'm worried about David. I really don't know what all the fuss is about. What didn't you like about the play? There's something special/strange/unique about him (= in his character).\nThesaurus: synonyms, antonyms, and examples\naboutaboutWe always seem to talk about money.regardingI wrote to them regarding the new contract.concerningWhat is your letter concerning?in/with regard toComplaints have been made with regard to your behaviour in the office.in connection withShe is wanted for questioning in connection with the disappearance of their child.onShe’s writing a book on feminism in the 21st century.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\ndo something about someone/something\nto take action to solve a problem: I wish you'd do something about your bedroom - it's a real mess.\nSee more\nMore examplesFewer examplesHe is always talking about how clever his children are.I wish you'd stop making jokes about my friends.Lots of people have complained about the noise.The film was about creatures from outer space.I was very nervous about driving again after the accident.Stop jumping about, Billy, and just stand still for a moment!\nSMART Vocabulary: related words and phrases\nRegarding and concerning\napply to\napropos\napropos of something\naround\nas\nas to idiom\ncover\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nre\nrelate\nsay\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\nabout preposition\n(NO ORDER)\nmainly UK (US usually around) positioned around a place, often without a clear purpose or order: Their belongings were flung about the room.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nalong\nanterior\naround\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nabout preposition\n(POSITION)\nUK formal in a particular place: Do you have such a thing as a pen about you/your person? (= Do you have a pen?) She was puttering about the kitchen.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nalong\nanterior\naround\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nGrammar\nAboutAbout is a preposition or an adverb. …\nAbout as a prepositionThe most common meaning of about as a preposition is ‘on the subject of’ or ‘connected with’: …\nAbout as an adverbWe use about as an adverb when we talk about time, number and quantity. About makes the time, number or quantity less specific and more approximate: …\nBe about toWe use the modal expression be about to as an adjective in the modal expression be about to to refer to something that will happen very soon in the future: …\nIdiom\nhow/what about...?\nabout adverb\n(APPROXIMATELY)\nA1 a little more or less than the stated number or amount: about six feet tall about two months ago \"What time are you leaving work today?\" \"About five.\"\nThesaurus: synonyms, antonyms, and examples\napproximatelyapproximatelyHe makes approximately $60,000 a year. aboutThe job will take about three months.aroundI will be there around four o'clock.roughlyThere were roughly 200 people at the meeting.or soThey raised £200 or so for charity.\nSee more results »\nMore examplesFewer examplesThe town is about 100 miles northwest of Las Vegas.Fry the onion and garlic for about two minutes.The average temperature worldwide has risen by about one degree Fahrenheit in the past 100 years.\"We'll be at your house at about nine o'clock, okay?\"We sent out the wedding invitations about three weeks ago.\nSMART Vocabulary: related words and phrases\nApproximate\napprox.\napproximate\napproximately\naround\nat a guess idiom\nexact\nguess\ninexactly\nish\nloosely\nloosey-goosey\nmore\nround\nrule\nsense\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nabout adverb\n(ALMOST)\nalmost: We're about ready to leave. Well, I think that's about it for now (= we have almost finished what we are doing for the present).\nThesaurus: synonyms, antonyms, and examples\nnot completelyalmostWe need to hurry up - it's almost time to go.nearlyIt's nearly midnight.nearHe was near tears (= almost crying).aboutAre you about ready to leave?all butThe concert was all but over by the time we arrived. well-nighIt was well-nigh impossible to get a person on the phone these days.\nSee more results »\nSMART Vocabulary: related words and phrases\nAlmost\na hop, skip, and a jump idiom\nalmost\nas good as idiom\nas much as idiom\nbe on the way to something idiom\nintent\nmore\nmore or less idiom\nmuch\nnear\npart\nsub\nthat was close! idiom\nthe best/better part of idiom\nto/for all intents and purposes idiom\nup to (doing) something idiom\nverge\nverge on something\nvirtual\nway\nSee more results »\nabout adverb\n(ALL DIRECTIONS)\nB2 mainly UK (US usually around) in many different directions: They heard someone moving about outside. I've been running about all morning trying to find you.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nalong\nanterior\naround\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nabout adverb\n(NO ORDER)\nB2 mainly UK (US usually around) positioned around a place, often without a clear purpose or order: She always leaves her clothes lying about on the floor.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nalong\nanterior\naround\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nabout adverb\n(PLACE)\nmainly UK (US usually around) in or near a place: Is John about (= somewhere near)? There's a lot of flu about (= many people have the flu) at the moment.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nalong\nanterior\naround\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nGrammar\nAboutAbout is a preposition or an adverb. …\nAbout as a prepositionThe most common meaning of about as a preposition is ‘on the subject of’ or ‘connected with’: …\nAbout as an adverbWe use about as an adverb when we talk about time, number and quantity. About makes the time, number or quantity less specific and more approximate: …\nBe about toWe use the modal expression be about to as an adjective in the modal expression be about to to refer to something that will happen very soon in the future: …\nabout adjective\n(INTENDING)\nbe about to do something\nB1 to be going to do something very soon: I was about to leave when Mark arrived.\nSee more\nGrammar\nBe about toWe use the modal expression be about to as an adjective in the modal expression be about to to refer to something that will happen very soon in the future: …\nBe able toBe able to is like can. We use it to talk about abilities. We often use it in places where it is not possible to use can. For example, it isn’t possible to use can after another modal verb: …\nBe about toWe use be about to + base form of the verb to refer to things that we expect to happen very soon. We often use it with just, for emphasis: …\nabout preposition\n(CONNECTED WITH)\nAdd to word list\nAdd to word list\non the subject of; connected with: \"What’s that book about?\" \"It’s about the Civil War.\" I don’t know what all the fuss is about. There’s something about her attitude that worries me. Idiom\n(it's) about time\nabout adverb [not gradable]\n(APPROXIMATELY)\na little more or less than a specific number; approximately: He’s about six feet tall. It happened about two months ago. I’ve had just about enough of your complaining (= I do not want to hear any more).\nabout adjective [+ to infinitive; not gradable]\n(INTENDING)\nalmost ready to do something, or intending to do something soon: He looked as if he was about to burst into tears. I’m not about to apologize to him.\nabout preposition, adjective, adverb [not gradable]\n(IN THIS PLACE)\npositioned or moving in or near a place: Reporters stood about, waiting for more news."}