{"id":763,"name":"above","type":"adverb","us_sound":"əˈbʌv","us_link":"../audio/a/above.mp3","uk_sound":"əˈbʌv","uk_link":"../audio/a/ukabnor023.mp3","content":"above adverb, preposition\n(HIGHER POSITION)\nAdd to word list\nAdd to word list\nA1 in or to a higher position than something else: There's a mirror above the sink. He waved the letter excitedly above his head. She's rented a room above a shop. Her name comes above mine on the list. The helicopter was hovering above the building. It's on the shelf just above your head. A crack had started to appear just above the light on the ceiling.\nMore examplesFewer examplesThere's a mirror above the sink.The moon rose slowly above the horizon.He had a cut an inch long above his left eye.The helicopter was hovering above the building.The castle is built on a hill that rises above the town.\nSMART Vocabulary: related words and phrases\nAbove & over\naloft\no'er\nover\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nabove adverb, preposition\n(MORE)\nA2 more than an amount or level: above average Rates of pay are above average (= greater than average). It says on the box it's for children aged three and above. Temperatures rarely rise above zero in winter. She values her job above her family. They value their freedom above all else. above all\nB1 most importantly: Above all, I'd like to thank my family.\nSee more\nMore examplesFewer examplesTemperatures rarely rise above zero in winter.I value her friendship above anything else.The results are well above what we expected.The top of Mount Everest is 8,848 m above sea level.The temperature was above normal for the time of year.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nbillion\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nsome\nstrength\nsuper-large\nsupererogation\nSee more results »\nabove adverb, preposition\n(RANK)\nin a more important or advanced position than someone else: Sally's a grade above me.\nMore examplesFewer examplesA captain ranks above a lieutenant.A major-general is above a brigadier in the British army.Melanie's husband worked above mine in the Quality Control Department.The old man resented having someone above him telling him what to do.You don't get your own office here until you're a manager or above.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nabove adverb, preposition\n(TOO IMPORTANT)\nC2 too good or important for something: No one is above suspicion in this matter.\nSMART Vocabulary: related words and phrases\nShowing arrogance and conceit\n(as) proud as Lucifer idiom\nairs and graces idiom\narrogant\narrogantly\nas if you owned the place idiom\negocentrically\negoistic\negoistically\negomaniacal\negomaniacally\npatronize\npatronizing\npatronizingly\npomposity\npompous\nswollen head\nswollen-headed\ntalk down to someone\nthink the (whole) world revolves around you idiom\nthrow your weight around idiom\nSee more results »\nGrammar\nAboveAbove is a preposition (prep) or an adverb (adv). …\nAbove or over?When we use above as a preposition, it means ‘higher than’. Its meaning is close to that of the preposition over. In the following sentences, over can be used instead of above: …\nIdioms\nabove and beyond something\nbe not above something\ngo above and beyond (sth)\nget above yourself\nabove adverb, adjective\n(ON PAGE)\nB1 When used in a piece of writing, \"above\" means higher on the page, or on a previous page: Please send the articles to the address given above. The letter was sent to the above address. the above\nall the people or things listed earlier: All of the above (= everyone listed earlier) should be invited. Once we've finished all of the above we can start on the next project.\nMore examplesFewer examplesWrite to the above address, enclosing an sae.You can contact me on the above phone number.Applications should be sent to the above address.Study the diagram above and then answer the questions.To the best of my knowledge, the above information is accurate.\nSMART Vocabulary: related words and phrases\nAbove & over\naloft\no'er\nover\noverhead\noverlie\nsuper\nsupra\nsur-\ntopper\nupmost\nYou can also find related words, phrases, and synonyms in the topics:\nQuoting & making references\nGrammar\nAboveAbove is a preposition (prep) or an adverb (adv). …\nAdd to word list\nAdd to word list\nhigher than, more than, or at a level greater than: The helicopter was hovering above the building. Temperatures here rarely rise above freezing in winter. Our wages are above average. I could hardly hear him above the blare of the music.\nIn writing, above can mean as stated higher up on this page or on a previous page: Refer to the diagram shown above.\nTo be above doing something is to consider yourself too important or too moral to do it: He’s not above lying to protect himself. Idiom\nabove all\nthose mentioned earlier: All of the above are to be included."}