{"id":854,"name":"abridgment","type":"noun","us_sound":"əˈbrɪdʒ.mənt","us_link":"../audio/a/eus70022.mp3","uk_sound":"əˈbrɪdʒ.mənt","uk_link":"../audio/a/ukabrea003.mp3","content":"abridgment noun\n(SHORTER VERSION)\nAdd to word list\nAdd to word list\n[ C ] a book, play, or piece of writing that has been made shorter by removing some details or less important information: The books are abridgments of well-known classics. In 1676 Bauthumley published an abridgement of Foxe's Book of Martyrs.\n[ U ] the act of making a book, play, or piece of writing shorter by removing some details or information: Drastic abridgment makes this story even more difficult to understand. This version of the play is marred only by some awkward abridgement.\nMore examplesFewer examplesI didn't want my work to be merely an abridgment of the hearings.The document is an English abridgment of the Japanese original. There seems to be a current enthusiasm for extreme abridgement.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nannual\nanthology\naudiobook\nbacklist\nbestiary\ndime novel\ne-reader\neasy read\nexercise book\nfiction\nmust-read\nnovel\nnovelette\nnovelistic\nnovelistically\ntrilogy\nvade mecum\nworkbook\nya\nyoung adult\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSummaries and summarizing\nabridgment noun\n(REDUCTION OF RIGHTS)\n[ U or C ] the act of reducing someone's freedom, rights, etc., or an instance of this: He says there are laws which are completely unethical and an abridgment of freedom. The measure establishes a dangerous precedent in the abridgement of human liberty. See\nabridge\nMore examplesFewer examplesHe called the spending limits an abridgment of a party's right to free political expression.He wrote a research paper on the abridgment of the civil liberties in the United States.Government secrecy pales in comparison to the secrecy and abridgements of free expression that exist in private companies.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nattenuate\nattenuated\nattenuating\nattenuation\naxe\nboil\ndamp\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nforeshortened\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »"}