{"id":884,"name":"abrupt","type":"adjective","us_sound":"əˈbrʌpt","us_link":"../audio/a/abrupt.mp3","uk_sound":"əˈbrʌpt","uk_link":"../audio/a/ukabrea007.mp3","content":"abrupt adjective\n(SUDDEN)\nAdd to word list\nAdd to word list\nC2 sudden and unexpected, and often unpleasant: abrupt end Our conversation came to an abrupt end when George burst into the room.abrupt change There was an abrupt change in her attitude towards me when she heard that I was Alan's girlfriendabrupt halt The car juddered and came to an abrupt halt in the middle of the road. The road ended in an abrupt (= sudden and very steep) slope down to the sea.\nMore examplesFewer examplesThe party came to rather an abrupt ending when Tom's parents came home.There was an abrupt fall in our sales figures following the bad publicity.As you step into the air-conditioned office, there is an abrupt change in temperature.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunscripted\nunstarry\nunsuspected\nuntimely\nuntoward\nSee more results »\nabrupt adjective\n(UNFRIENDLY)\nC2 using too few words when talking, in a way that seems rude and unfriendly: He is sometimes very abrupt with clients. an abrupt manner/reply\nThesaurus: synonyms, antonyms, and examples\nnot speaking much or oftenquietShe's a quiet little thing.taciturnHer father was a shy, taciturn man.abruptHe is criticised for being too abrupt with his clients.curtShe was very curt with him.terseI don't appreciate how terse she is in meetings.\nSee more results »\nSMART Vocabulary: related words and phrases\nBlunt and direct in speech & behaviour\nabruptly\nabruptness\nbald\nbaldly\nbaldness\nblisteringly\nbluff\ndirectness\ndownrightly\nedgelord\nflat out phrase\nforthright\noutspoken\noutspokenly\nplain speaking\nplain-spoken\nplainness\nshoot\nsuffer\nvocal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot being friendly\nNot saying much\nRelated words\nabruptly\nabruptness\nabrupt adjective\n(SUDDEN)\nAdd to word list\nAdd to word list\nsudden and not expected, often with unpleasant results: There was an abrupt change in her mood. We came to an abrupt curve in the road.\nabrupt adjective\n(NOT FRIENDLY)\nnot friendly or polite; showing little interest in talking to other people: His abrupt manner makes me uncomfortable. abruptly adverb us\nYour browser doesn't support HTML5 audio\n/əˈbrʌp·tli/\nThey abruptly left the party."}