{"id":939,"name":"absence","type":"noun","us_sound":"ˈæb.səns","us_link":"../audio/a/absence.mp3","uk_sound":"ˈæb.səns","uk_link":"../audio/a/ukabrea015.mp3","content":"absence noun\n(NOT BEING PRESENT)\nAdd to word list\nAdd to word list\nB2 [ U or C ] the fact of not being where you are usually expected to be: during someone's absence A new manager was appointed during her absence.in someone's absence I'll be gone for two weeks, with Chris handling the deliveries in my absence. She has had repeated absences from work this year.\nMore examplesFewer examplesThe smell of cigarette smoke confirmed what he had suspected: there had been a party in his absence.I'm deputizing for the director during his absence.Unbeknownst to me, he'd gone and rented out the apartment in my absence.Can you account for your absence last Friday?Her absence from the meeting changed the dynamic in the room.\nSMART Vocabulary: related words and phrases\nAbsent\nabsent\nabsentee\nabsenteeism\nanywhere\nAWOL\ngo AWOL idiom\nin absentia\nin someone's absence\nin the absence of someone/something\nlacuna\nmissing\nmissing person\nnegative\nno-show\nnot anywhere to be found idiom\nnowhere\nnowhere to be found idiom\nsomeone's back is turned idiom\nstation\nunrepresented\nSee more results »\nabsence noun\n(NOT EXISTING)\nB2 [ U ] the fact of not existing: in the absence of In the absence of (= because there were not) more suitable candidates, we decided to offer the job to Mr Conway. He drew attention to the absence of concrete evidence against the defendant.\nMore examplesFewer examplesIn the absence of anything better, the settee would serve as a bed for a couple of nights.In our search for evidence, we were stymied by the absence of any recent documents.They complained about the absence of vegetarian food on the menu.In the absence of a strong government, the country soon fell into chaos.In the absence of a television, the children were forced to find other things to keep them amused.\nSMART Vocabulary: related words and phrases\nNon-existence and not being\nabsent\naren't\ndefunct\ndie\nextinct\nextinguishment\nin the absence of someone/something\nisn't\nnegation\nnon-body\nnon-existent\nnon-extant\nnonexistential\npresence\nseronegative\nsuch\nthere's no such thing/person (as) idiom\nunfulfilled\nvanished\nwasn't\nSee more results »\nIdiom\nabsence makes the heart grow fonder\nAdd to word list\nAdd to word list\nthe state of not being somewhere, or a period in which you are not somewhere: [ C ] She has had repeated absences from school this year.\nAn absence can also be a lack of existence: [ U ] He drew attention to the absence of any solid evidence against the defendant. absent adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈæb·sənt/\nIf Callie is absent from school, she should bring a note from home. absently adverb us\nYour browser doesn't support HTML5 audio\n/ˈæb·sənt·li/\nHe stared out the window, absently rubbing his cheek.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; HR a time when someone is not at work or at the place they are expected to be: absence from sth Her absence from the meeting was noted.in sb's absence His fellow directors voted in his absence to fire him. The worst day for workplace absences is Monday.\n[ U ] the fact that something is not where it is needed or expected: The business was suffering from an absence of an overall plan for moving forward.in the absence of sth In the absence of any alternative, we'll continue in the same way as before. See also\nleave of absence"}