{"id":990,"name":"absolutely","type":"adverb","us_sound":"ˌæb.səˈluːt.li","us_link":"../audio/a/absolutely.mp3","uk_sound":"ˌæb.səˈluːt.li","uk_link":"../audio/a/ukabrea023.mp3","content":"Add to word list\nAdd to word list\nB1 completely: I believed/trusted him absolutely. You must be absolutely silent or the birds won't appear. We've achieved absolutely nothing today.\nB1 used for adding force to a strong adjective that is not usually used with \"very\" or to a verb expressing strong emotion: It's absolutely impossible to work with all this noise. The food was absolutely disgusting/delicious. I absolutely loathe/adore jazz.\nB2 used as a strong way of saying \"yes\": \"It was an excellent film, though.\" \"Absolutely!\" absolutely not\nC2 used as a strong way of saying \"no\": \"Are you too tired to continue?\" \"Absolutely not!\"\nSee more\nMore examplesFewer examplesThe hotel we stayed in was absolutely superb.That meeting achieved absolutely nothing - it was a complete waste of time.My sister absolutely loves chocolate.The decorations that the children had made were absolutely beautiful.This case is absolutely full - I can't fit another thing into it.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nYes, no & not\nAdd to word list\nAdd to word list\ncompletely; beyond any doubt: You are absolutely right. Are you absolutely sure that you locked the front door?\nAbsolutely is also used in conversation to show emphasis in agreeing to something: \"Can you lend me $10 till tomorrow?\" \"Absolutely, it’s no problem.\"\nIf you say absolutely not, you are showing emphasis in not agreeing to something: \"You mean you won’t sign this?\" \"No, absolutely not.\""}