{"id":1086,"name":"abstract","type":"adjective","us_sound":"ˈæb.strækt","us_link":"../audio/a/abstract.mp3","uk_sound":"ˈæb.strækt","uk_link":"../audio/a/ukabsor008.mp3","content":"abstract adjective\n(GENERAL)\nAdd to word list\nAdd to word list\nB2 existing as an idea, feeling, or quality, not as a material object: Truth and beauty are abstract concepts. Opposite\nconcrete\nAn abstract argument or discussion is general and not based on particular examples: This debate is becoming too abstract - let's have some hard facts! Opposite\nconcrete\nThesaurus: synonyms, antonyms, and examples\nabstract ideasabstractHappiness, faith, and confidence are abstract qualities.conceptualThe introduction lays out a conceptual framework for the book.notionalThere is a notional improvement in air quality that cannot be demonstrated.theoreticalVitamin supplements can give a theoretical boost to health.\nSee more results »\nthe abstract\ngeneral ideas: in the abstract So far we've only discussed the question in the abstract (= without referring to any real examples). I have difficulty dealing with the abstract - let's discuss particular cases.\nMore examplesFewer examplesIt is sometimes easier to illustrate an abstract concept by analogy with something concrete.He is good at explaining quite complex, abstract ideas in a nice simple way.Your idea is rather vague and abstract - could you explain it in a bit more detail, please?These early humans were clearly capable of abstract thought, and probably language too.Some of these new theories are so abstract that they don't seem to relate to our everyday work at all.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nanti-Darwinism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nhunch\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral\nabstract adjective\n(ART)\nB2 used to refer to a type of painting, drawing, or sculpture that uses shapes, lines, and colour in a way that does not try to represent the appearance of people or things: abstract art an abstract painter\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\nanti-romantic\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nfigurative\nmodernist\nmontage\nnaturalism\nnaturalistic\nnon-abstract\nrococo\nromantic\nromanticism\nscreen printing\nsilkscreen\nSee more results »\nabstract noun [C]\n(SHORT DOCUMENT)\na short form of a speech, article, book, etc., giving only the most important facts or ideas: There is a section at the end of the magazine that includes abstracts of recent articles/books.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nbiodata\ncatch-all\ncurriculum vitae\nCV\ngist\nhandout\nin short idiom\nnutshell\nresume\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nsummarization\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\ntrot\nupsum\nSee more results »\nabstract noun [C]\n(ART)\na painting that uses shapes, lines, and colour in a way that does not try to represent the appearance of people or things\nSMART Vocabulary: related words and phrases\nPictures\n-scape\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ncartoon\nfloral\ngraphic novel\nhalo\nhellscape\nidentikit\nillustration\npencil\nraster\nrehang\nscreen print\nseascape\nshade\nsketch\nSee more results »\n[ I or T ] to consider something in a general way or make a general judgment after looking at particular details: Most interviewees focus on their own experience and do not generalize or abstract the situation. A general rule is arrived at by abstracting from the data.\n[ T ] to remove or separate someone or something from a place or context (= the situation, facts, words, etc. that exist around something): abstract someone from something It was impossible to abstract children from their social environment with all its dangers.abstract something from something Relevant information was abstracted from the database or from medical records.\n[ T ] to give a summary or abstract (= a short description giving the most important ideas) of something: If you find an article you think should be abstracted in our journal, submit it for consideration.\nMore examplesFewer examplesThere are several observations that might be abstracted from this example.We abstracted the number of cases and deaths from the 2001–2019 annual reports.She leaves it to the reader to collect and abstract insights from her text.We abstract a general data structure from the list of data.\nSMART Vocabulary: related words and phrases\nElaborating, specifying and simplifying\nanti-reductionism\nanti-reductionist\nbroad brush\nbroaden\ncomplicate\nenlarge on/upon something\nexpand\nexpand on something\nexpansively\nexpansiveness\novergeneralization\novergeneralize\noversimplification\noversimplify\nparticularization\nspec\nspecification\nspecificity\nspecify\nsplit hairs idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\nSummaries and summarizing\nAdd to word list\nAdd to word list\nexisting as an idea, feeling, or quality, not as a material object: \"Humanity\" is an abstract idea.\nEnglish If a statement, argument, or discussion is abstract, it is general and not based on particular examples.\nart A painting, drawing, or sculpture is described as abstract if it tries to represent the qualities of objects or people but does not show their outer appearance: abstract art\nwriting a few sentences that give the main ideas in an article or a scientific paper\nAdd to word list\nAdd to word list\nexisting as an idea, feeling, or quality, not as a material object: \"Satisfaction\" is difficult to measure as it is an abstract concept.\na shortened form of a speech, article, book, etc., giving the most important facts or ideas: There is a section at the end of the magazine which includes abstracts of recent articles."}