{"id":1095,"name":"abstraction","type":"noun","us_sound":"æbˈstræk.ʃən","us_link":"../audio/a/usabort026.mp3","uk_sound":"æbˈstræk.ʃən","uk_link":"../audio/a/ukabsor012.mp3","content":"abstraction noun [C or U]\n(NOT REAL)\nAdd to word list\nAdd to word list\nthe quality of existing as or representing an idea, a feeling, etc. and not a material object, or something that has this quality: They discuss the issue of realism versus abstraction in sculpture. Actual black holes have been found: they are no longer mathematical abstractions.\nthe quality of being very general and not based on real examples, or something that has this quality: She's always talking in abstractions. He has a tendency towards abstraction and pretentiousness which weakens his argument. Related word\nabstract adjective\nMore examplesFewer examplesOne of the problems of modern art for many people is its abstraction.The exhibition features abstractions by one of America's best-known post-war artists.He talked about his love for the purity and abstraction of mathematics.The practical details which interest students may seem quite different from the high-level concepts and abstractions discussed by academics.Laura had no time for such abstraction and wanted to know what was actually needed.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nafterthought\nanthropocentrism\nanti-Darwinian\nanti-Darwinism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nhunch\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral\nabstraction noun [C or U]\n(REMOVING)\nthe action of removing or separating something from a place or context (= the situation, facts, words, etc. that exist around something), or something that is removed like this: Water abstraction from rivers is increasing, due to the rise in demand and increasing population density in the region. The quality rating is a statistical abstraction from various data sources. Related word\nabstract verbCompare\nextraction\nMore examplesFewer examplesAbstraction of water is likely to affect the generating capacity of the dam downstream.His theory was constructed using carefully chosen abstractions from different papers in the field's diverse literature.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nbowdlerization\nbowdlerized\nclear the decks idiom\ndrain\nextraction\ngouge something out\ngrapeseed\nirremovable\nirremovably\nlet someone down\nscoop\nscratch\nslice\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nunboxing\nSee more results »\nAdd to word list\nAdd to word list\nan idea that develops by looking at or thinking about a number of different things"}