{"id":1128,"name":"absurd","type":"adjective","us_sound":"əbˈsɝːd","us_link":"../audio/a/absurd.mp3","uk_sound":"əbˈsɜːd","uk_link":"../audio/a/ukabsor014.mp3","content":"Add to word list\nAdd to word list\nB2 stupid and unreasonable, or silly in a humorous way: What an absurd thing to say! Don't be so absurd! Of course I want you to come. It's an absurd situation - neither of them will talk to the other. Do I look absurd in this hat?\nThesaurus: synonyms, antonyms, and examples\nstupidstupidSome people are too stupid to realize what's bad for them.foolishShe was really foolish to quit her job like that.sillyIt was silly of you to go out in the sun without a hat.crazyYou'd be absolutely crazy to marry that man.dumbUS She was terrified of asking dumb questions.\nSee more results »\nthe absurd\nthings that happen that are stupid or unreasonable: The whole situation borders on the absurd. She has a keen sense of the absurd.\nMore examplesFewer examplesYou want Granny to live in the caravan? That's an absurd suggestion!It's just another of those absurd rules imposed upon us by the justice system.He's got some absurd idea in his head about building his own house.It's absurd to waste your money on a machine you'll never use.Blake looked absurd in those tight leather trousers, but I tried not to laugh.\nSMART Vocabulary: related words and phrases\nStupid and silly\nabsurdity\nabsurdly\nadolescent\nagainst your better judgment idiom\nAlice-in-Wonderland\ndorky\ndottiness\ndotty\ndozily\ndoziness\nin his/her/their wisdom idiom\ninadvisable\ninjudicious\ninjudiciously\ninsanely\nundiscriminating\nunintelligent\nunreasonable\nunreasonably\nunsmart\nSee more results »\nRelated words\nabsurdly\nabsurdity\nAdd to word list\nAdd to word list\nridiculous or completely unreasonable: [ + to infinitive ] It is absurd for the council to cut taxes without proposing another way to raise money. absurdity noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əbˈsɜr·dɪ·t̬i, æb-, -ˈzɜrd-/\nIt's a serious situation but with some absurdity, and managing the balance between serious and funny is a delicate matter."}