{"id":1175,"name":"abuse","type":"verb","us_sound":"əˈbjuːz","us_link":"../audio/a/uszzzzc001.mp3","uk_sound":"əˈbjuːz","uk_link":"../audio/a/ukabsor022.mp3","content":"abuse verb [T]\n(USE WRONGLY)\nAdd to word list\nAdd to word list\nto use something for the wrong purpose in a way that is harmful or morally wrong: She is continually abusing her position/authority by getting other people to do things for her. I never expected that he would abuse the trust I placed in him. He fears that his brother may be abusing alcohol.\nMore examplesFewer examplesIf you abuse your body now, you'll pay the price when you're older.The Mayor and his cohorts have abused their positions of power.In a landmark case/decision, the Governor pardoned a woman convicted of killing her husband, who had physically abused her.People who have been abused as children often experience feelings/a sense of worthlessness.The minister was sacked for abusing power for his personal gain.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nuse\nvictimization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing and misusing\nabuse verb [T]\n(TREAT CRUELLY)\nto treat someone cruelly or violently: sexually abuse The therapist works with children who have been sexually abused. physically abuse The dog showed signs of being physically abused. Men who abuse their partners are good at portraying themselves as the real victims.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nuse\nvictimization\nSee more results »\nabuse verb [T]\n(SPEAK RUDELY)\nto speak to someone rudely or cruelly: verbally abuse The athlete was being verbally abused by a drunk fan in the crowd. The crowd started abusing him after he failed to save a goal.\nSMART Vocabulary: related words and phrases\nInsults & abuse\nabusive\nabusively\nbackhanded compliment\nbrickbat\ncontumely\ncut (someone) to the quick idiom\ndenigration\ndis\njeer\nmouth\nname\nneg\nnegging\npoint-scoring\nput something/someone down\nrevile\nslap\nsledging\nslight\nverbal abuse\nSee more results »\nRelated word\nabuser\nabuse noun\n(WRONG USE)\nB2 [ C or U ] the use of something in a way that is harmful or morally wrong: abuse of power The investigation revealed abuses of power committed by the governor's office. alcohol abuse The actress disclosed that she was seeking treatment for alcohol abuse. drug abuse Chronic drug abuse can lead to gradual brain damage. substance abuse He had struggled with substance abuse for much of his life. It was an abuse of her kindness to keep asking Ms Lawson for favours.\nMore examplesFewer examplesThe government say they are trying to do more to educate the public about the consequences of drug abuse.After years of abuse from her husband, she eventually found the courage to leave him.Judge Hawthorne was chosen to head the team investigating the allegations of abuse.There are few crimes more truly shocking than the abuse of children.The family said they had endured years of torment and abuse at the hands of the neighbours.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nuse\nvictimization\nSee more results »\nabuse noun\n(CRUEL BEHAVIOUR)\nB2 cruel, violent, or unfair treatment of someone: child abuse She claimed to have been a victim of child abuse.physical abuse She endured physical abuse (= bad treatment) from her stepfather.sexual abuse He was arrested for the sexual abuse of a minor. The nasty way he treats his colleagues borders on abuse.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nuse\nvictimization\nSee more results »\nabuse noun\n(RUDE SPEECH)\nC2 [ U ] rude and offensive words said to another person: verbal abuse He had apparently experienced a lot of verbal abuse from his co-workers.torrent of abuse They hurled/unleashed a torrent of abuse at the actors (= they said a lot of rude and offensive things to the actors).term of abuse \"Idiot!\" is a term of abuse (= an insulting expression). I was astonished at the stream of abuse coming from his lips.\nSMART Vocabulary: related words and phrases\nInsults & abuse\nabusive\nabusively\nbackhanded compliment\nbrickbat\ncontumely\ncut (someone) to the quick idiom\ndenigration\ndis\njeer\nmouth\nname\nneg\nnegging\npoint-scoring\nput something/someone down\nrevile\nslap\nsledging\nslight\nverbal abuse\nSee more results »\nAdd to word list\nAdd to word list\nbad or cruel treatment of a person or animal, or the use of something in an unsuitable or wrong way: [ U ] The rescued dogs had been victims of physical abuse.\nto treat a person or animal badly or cruelly, or to use something in the wrong way: He was always welcome but he never abused the privilege by visiting us too often. abuser noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈbju·zər/\nProviding an alcohol or drug abuser with the right treatment can cost more than $20,000.\nAdd to word list\nAdd to word list\n[ C or U ] a situation in which a person uses something in a bad or wrong way, especially for their own advantage or pleasure: The former president has been accused of corruption and abuse of power. The politician employs his two sons to work in his office at taxpayers' expense, which critics say is an abuse of his position. The CEO was fined for market abuse after encouraging his friends to buy shares before the takeover was announced publicly. Employees are routinely tested for drug and alcohol abuse.\n[ U ] rude and offensive words said to another person: He claimed he had received verbal abuse from his co-workers.\nto use something in a bad or wrong way, especially for your own advantage or pleasure: The Chief Executive is accused of abusing his position by advising family members when to buy and sell shares. Workers found to be abusing drugs or alcohol will be offered help.\nto use rude and offensive words to another person: Striking workers abused colleagues who continued to go into work."}