{"id":1478,"name":"acceptance","type":"noun","us_sound":"əkˈsep.təns","us_link":"../audio/a/acceptance.mp3","uk_sound":"əkˈsep.təns","uk_link":"../audio/a/ukac___024.mp3","content":"Add to word list\nAdd to word list\ngeneral agreement that something is satisfactory or right, or that someone should be included in a group: gain acceptance The idea rapidly gained acceptance (= became approved of) in political circles. The party marked his acceptance into the community. Synonyms\nacknowledgment\nrecognition\nThesaurus: synonyms, antonyms, and examples\nacceptance of somethingacceptanceThe idea was slow to find general acceptance.acknowledgmentWe still await an acknowledgment of the fact that our case was handled improperly.recognitionThere was no recognition of having done anything wrong.resignationShe sighed in weary resignation.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nC1 the act of agreeing to an offer, plan, or invitation: Her acceptance of the award was very controversial. an acceptance speech\nthe fact of accepting a difficult or unpleasant situation: His attitude to his children's behaviour is one of resigned acceptance.\nMore examplesFewer examplesStaff objected at first, but Angela's ideas have now found general acceptance in the office.Surely such a horrible idea could never gain acceptance here?The union's strike plans met with little acceptance at the meeting.Our aim is to provide a place where troubled young people can find acceptance and understanding.We've seen widespread acceptance of our recycling scheme, which is very pleasing.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\nAccepting & agreeing reluctantly\nAdd to word list\nAdd to word list\nAcceptance of an offer or an invitation means that you say yes to it: The White House indicated its acceptance of the offer to visit Russia.\nAcceptance of a person is the act of agreeing to that person’s becoming a member of an organization or group, or to that person’s belonging to your group as an equal.\nAdd to word list\nAdd to word list\n[ U ] the act of agreeing to something such as an offer or invitation: The board has recommended acceptance of the offer. On acceptance of the proposal, a draft agreement will be sent to both parties.\n[ U ]\n&#160; COMMERCE, LAW the act of formally agreeing to buy or sell goods at a particular price or to use something in a particular way: We will confirm acceptance of your order by email. A formal letter of acceptance is sent to the successful supplier. Placing of an order constitutes acceptance of our terms and conditions.\n[ U ]\n&#160; MARKETING willingness of people to use a new product or service or to believe a new idea: gain/find/win acceptance These devices are gaining acceptance within the marketplace.consumer/customer/public acceptance The project aims to assess consumer acceptance of GM foods.\n[ C ]\n&#160; FINANCE an agreement by a shareholder to sell their shares to another company during a takeover: The bidding company has received acceptances in respect of 73.27% of the issued shares.\n[ C or U ]\n&#160; FINANCE an act of agreeing to pay a bill of exchange (= a written order to pay someone a particular amount of money) by writing your name on the document, or the document itself: In essence, an acceptance is a promise to pay.\n[ U ]\n&#160; INSURANCE an agreement or contract between an insurance company and a customer to provide insurance: This life insurance plan offers guaranteed acceptance for the over 50s.\n[ U ]\n&#160; IT, PRODUCTION approval of a new machine, computer system, etc. after testing it to check that it works correctly: A number of acceptance tests were performed. See also\nbanker's acceptance\ndocuments against acceptance\nnon-acceptance\nuser acceptance test"}