{"id":1533,"name":"accessory","type":"noun","us_sound":"əkˈses.ər.i","us_link":"../audio/a/accessory.mp3","uk_sound":"əkˈses.ər.i","uk_link":"../audio/a/ukacces001.mp3","content":"accessory noun\n(EXTRA)\nAdd to word list\nAdd to word list\nC1 [ C usually plural ] something added to a machine or to clothing that has a useful or decorative purpose: fashion accessory Sunglasses are much more than a fashion accessory. She wore a green wool suit with matching accessories (= shoes, hat, bag, etc.). Accessories for the top-of-the-range car include leather upholstery, electric windows, and a sunroof.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nMore examplesFewer examplesWe stock the full range of model railway accessories.Jazz up a classic outfit with some bright accessories.Mum's found a lovely dress for the wedding, but she needs to find some matching accessories.We stock a range of bedroom and bathroom accessories as well as furniture.The kitchen looks better with a coat of paint and a few new accessories.\nSMART Vocabulary: related words and phrases\nThings added or attached to other things\nadd on something\nadded value\naddition\nadjunct\nadmixture\nappurtenance\nattachment\nbelay\nfashion accessory\nfrill\nfrippery\nhereto\njacked up\nmounted\nnew addition\nnon-detachable\nonto\nshim\nsuperaddition\ntrimming\naccessory noun\n(CRIMINAL)\n[ C ] someone who helps another person to commit a crime but does not take part in it: He was charged with being an accessory to murder. accessory after the fact law\n&#160; specialized\nsomeone who helps someone after that person has committed a crime, for example by hiding them from the police: She was charged with being an accessory after the fact.\nSee more accessory before the fact law\n&#160; specialized\nsomeone who helps in the preparation of a crime: The person who gave him the gun was an accessory before the fact.\nSee more\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\na tower of strength idiom\nabettor\naccomplice\nacolyte\naide\naider\nbackup\ncollaborator\nconfederate\nden mother\nenabler\nfacilitator\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nsponsor\nstrength\nsupport group\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCriminals - general words\naccessory noun\n(SOMETHING EXTRA)\nAdd to word list\nAdd to word list\n[ C usually pl ] something extra that improves or completes the thing it is added to: We sell plants, seeds, fertilizer, and gardening accessories, such as tools and gloves.\naccessory noun\n(CRIMINAL)\n[ C ] law someone who helps another person to commit a crime but does not take part in it\nAdd to word list\nAdd to word list\n[ usually plural ] something extra that improves or completes the thing it is added to: The store also sells computer accessories, such as cables, batteries, and webcams. These accessories are designed to enhance driver comfort. a range of women's fashion accessories bathroom/home/kitchen accessories car/cell phone accessories\nLAW a person who helps another person to commit a crime but does not take part in it: He was charged as an accessory to murder.\naccessory after the fact\nLAW someone who helps a person after they have committed a crime, for example by hiding them from the police\naccessory before the fact\nLAW someone who helps in the preparation of a crime"}