{"id":1434,"name":"accelerate","type":"verb","us_sound":"ekˈsel.ɚ.eɪt","us_link":"../audio/a/accelerate.mp3","uk_sound":"əkˈsel.ə.reɪt","uk_link":"../audio/a/ukac___011.mp3","content":"Add to word list\nAdd to word list\nC2 [ I ] When a vehicle or its driver accelerates, the speed of the vehicle increases: I accelerated to overtake the bus. Opposite\ndecelerate\nThesaurus: synonyms, antonyms, and examples\nto get fasterspeed upThe car sped up to 100 mph.pick up speedThe hurricane is picking up speed as it approaches the coast.gain speedAccidents often happen when a driver gains speed going downhill. gather speedThe economic recovery was starting to gather speed.accelerateThe vehicle accelerated around the turn.\nSee more results »\nC2 [ I ] If a person or object accelerates, he, she, or it goes faster. Opposite\ndecelerate\nC1 [ I or T ] to happen or make something happen sooner or faster: Inflation is likely to accelerate this year, adding further upward pressure on interest rates. They use special chemicals to accelerate the growth of crops. Opposite\ndecelerate\nThesaurus: synonyms, antonyms, and examples\nto get fasterspeed upThe car sped up to 100 mph.pick up speedThe hurricane is picking up speed as it approaches the coast.gain speedAccidents often happen when a driver gains speed going downhill. gather speedThe economic recovery was starting to gather speed.accelerateThe vehicle accelerated around the turn.\nSee more results »\nMore examplesFewer examplesThe driver accelerated on the bend and appeared to lose control of the vehicle.We watched as the motorbike accelerated away into the distance.The van driver accelerated every time I tried to overtake him.Anne gripped my hand as the plane began accelerating along the runway.You have to accelerate gradually as you run down the track, and then take a big jump.\nSMART Vocabulary: related words and phrases\nIncreasing and decreasing speed of motion\naccelerant\naccelerating\nacceleration\naccelerative\nbrake\ncatch\ncatch (someone) up\ndampener\ngun\nisolator\nnon-accelerating\nput your foot down idiom\nquicken\nretard\nretardation\nspurt\nstep on the gas idiom\nthrottle (something) back/down\nupshift\nupshifting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHurrying and doing things quickly\naccelerate verb\n(GO FASTER)\nAdd to word list\nAdd to word list\n[ I ] to move more quickly, or to make something happen faster or sooner: [ I ] He stepped on the gas and accelerated rapidly to pass a car.\naccelerate verb\n(INCREASE RATE)\n[ T ]\n&#160; physics to make something, esp. a process or a very small piece of matter, move faster\nAdd to word list\nAdd to word list\nto go faster or make something go faster: The car can accelerate to 60 miles per hour in just 6 seconds. Inflation is likely to accelerate this year, adding further upward pressure on interest rates. They use chemical treatments to accelerate the growth of crops."}