{"id":1521,"name":"accessing","type":"verb","us_sound":"ˈæk.ses","us_link":"../audio/a/access.mp3","uk_sound":"ˈæk.ses","uk_link":"../audio/a/ukac___026.mp3","content":"Add to word list\nAdd to word list\npresent participle of\naccess\naccess verb [T]\n(ENTER PLACE)\nto be able to get to or get inside a place: It is too difficult for anyone using a wheelchair to access the building. Students need a card to access restricted areas such as residences and labs. The basement room is accessed from outside.\nMore examplesFewer examplesTo access the block, visitors must pass the front desk where they have to produce photographic identification.The upper levels can be accessed using a lift or ramp.Worshippers must be able to access holy sites in Jerusalem.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\naccess verb [T]\n(USE OR GET)\nto be able to use or obtain something such as a service: Older people may have difficulty accessing medical services. It needs to be easier for small businesses to access government resources and advice.\nMore examplesFewer examplesThe programme would create a system to help parents easily access mental health services for their children.The majority of these people are living in poor rented accommodation and are not able to access the housing market.We will try to block terrorists' ability to access funds in foreign accounts.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\naccess verb [T]\n(ON COMPUTER)\nB2 to open a computer file (= a collection of stored information), a website, etc. in order to look at or change information in it: Most people use their phones to access the internet. You have to enter a password to access the database. A hacker remotely accessed the company's servers.\nThesaurus: synonyms, antonyms, and examples\nto access something on a computer, tablet, or smartphoneaccessI tried to access the site, but my browser became unresponsive.downloadI downloaded the software and installed it.uploadI uploaded my changes, and the site went live.retrieveThe data can be retrieved in a fraction of a second.\nSee more results »\nMore examplesFewer examplesHe used his office computer to access confidential files.Only registered students can access the site.It should not be possible for employers to access your private health data.You can now access your bank account securely online.Your financial information is fully encrypted and cannot be accessed.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »"}