{"id":1507,"name":"access","type":"noun","us_sound":"ˈæk.ses","us_link":"../audio/a/access.mp3","uk_sound":"ˈæk.ses","uk_link":"../audio/a/ukac___026.mp3","content":"access noun [U]\n(GETTING NEAR)\nAdd to word list\nAdd to word list\nB1 the method or possibility of getting near to a place or person: The only access to the village is by boat. The main access to (= entrance to) the building is at the side. The children's father was refused access to them at any time (= refused official permission to see them).\nMore examplesFewer examplesUnidentified cyberterrorists gained access to emails and financial details of customers.Red Cross officials were allowed access to the prison for the first time a few days ago.The doors are extra-wide for ease of access.This type of account offers you instant access to your money.Having such easy access to some of the best cinema and theatre is one of the perks of living in Sydney.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\naccess noun [U]\n(RIGHT)\nB1 the right or opportunity to use or look at something: The system has been designed to give the user quick and easy access to the required information.gain access to We were able to gain access to the safe. have access to Hackers had complete access to the company files.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\naccess verb [T]\n(ENTER PLACE)\nto be able to get to or get inside a place: It is too difficult for anyone using a wheelchair to access the building. Students need a card to access restricted areas such as residences and labs. The basement room is accessed from outside.\nMore examplesFewer examplesTo access the conference center, visitors must pass the front desk where they have to produce identification.The upper levels can be accessed using a lift or ramp.Worshippers must be able to access holy sites in Jerusalem.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\naccess verb [T]\n(USE OR GET)\nto be able to use or obtain something such as a service: Older people may have difficulty accessing medical services. It needs to be easier for small businesses to access government resources and advice.\nMore examplesFewer examplesThe programme would create a system to help parents easily access mental health services for their children.The majority of these people are living in poor rented accommodation and are not able to access the housing market.We will try to block terrorists' ability to access funds in foreign accounts.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\naccess verb [T]\n(ON COMPUTER)\nB2 to open a computer file, a website, etc. in order to look at or change information in it: Most people use their phones to access the internet. You have to enter a password to access the database. A hacker remotely accessed the company's servers (= was able to look at information stored on the company's servers using a computer located in a different place).\nThesaurus: synonyms, antonyms, and examples\nto access something on a computer, tablet, or smartphoneaccessI tried to access the site, but my browser became unresponsive.downloadI downloaded the software and installed it.uploadI uploaded my changes, and the site went live.retrieveThe data can be retrieved in a fraction of a second.\nSee more results »\nMore examplesFewer examplesHe used his office computer to access confidential files.Only registered students can access the site.It should not be possible for employers to access your private health data.You can now access your bank account securely online.Your financial information is fully encrypted and cannot be accessed.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nAdd to word list\nAdd to word list\nthe method or way of approaching a place or person, or the right to use or look at something: Without an official pass, the guards will deny you access to (= will not let you enter) the courthouse.\nAccess to something can also mean the opportunity or ability to use it: Many of the families do not have access to health care.\nto get information, esp. when using a computer: People now can access information from the Internet as never before.\nAdd to word list\nAdd to word list\nthe right or opportunity to use or receive something: get/have/provide access to sth Community radio stations have access to public funding. Everyone is entitled to fair access to employment.\nthe right or ability to look at documents and information: allow/grant/give sb access to sth She was granted access to the official archives.gain access to sth You can gain access to your records via this website.deny/restrict access to sth They planned to restrict access to their website content with the use of a subscription system. Merchants have online access to their product data. Auditors have unrestricted access to all records.\nIT the ability to use a system such as the internet, or the way in which you can do this: access to sth Do you have access to the internet? Business travellers expect free internet access. broadband/wireless access\nthe method or possibility of getting to or entering a place: access to sth The site has easy access to the motorway. The premises are equipped for disabled access.\nCOMMERCE the right or ability to buy and sell goods in a particular country or market: access to sth Our website gives us access to global markets.\nBANKING the right to use a bank account, or to remove money from a bank account or an investment: access to sth Some accounts allow instant access to your savings.\nLAW the legal right to see your child or children, or other family member, especially after a divorce: access to sb Many fathers go to court to seek access to their children. See also\nopen-access\nwheelchair access\nIT to open a computer file or to use a computer system such as the internet: Many users now access the internet via their mobile phones. I can access my email remotely.\nBANKING to look at a bank account, and be able to move money into or out of it: You can access your account online or by phone.\nto be able to get or use something, especially a service: We advise staff on how to access appropriate training."}