{"id":1455,"name":"accent","type":"noun","us_sound":"ˈæk.sənt","us_link":"../audio/a/accent.mp3","uk_sound":"ˈæk.sənt","uk_link":"../audio/a/ukac___014.mp3","content":"accent noun [C]\n(PRONUNCIATION)\nAdd to word list\nAdd to word list\nB1 the way in which people in a particular area, country, or social group pronounce words: He's got a strong southern/Boston accent. She's French but she speaks with an impeccable English accent. He speaks with a broad/heavy/strong/thick Yorkshire accent. I thought I could detect a slight Canadian accent.\nMore examplesFewer examplesAt university he affected an upper-class accent.He took elocution lessons to try to make his accent sound more genteel.A woman with a very posh accent phoned for him earlier.Many celebrities develop a working class accent to increase their street-credibility.She speaks English without the slightest trace of an accent.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\naccent noun [C]\n(MARK)\nB2 a mark written or printed over a letter to show you how to pronounce it: a grave accent There's an acute accent on the e of \"café\".\nMore examplesFewer examplesThere's an acute accent on the e in blé, which is the French word for corn.Pay attention to the accents on the words, because they show you how to pronounce them.Françoise is spelled with an accent - a cedilla - on the 'c'.There is an accent called an umlaut in the German word 'Gebaüde', which means 'building'.They use quite a lot of accents in Turkish writing, don't they?\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\nacute\napostrophe\nat sign\nblock capitals\nbracket\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\nstroke\ntilde\nunbracketed\nuncapitalized\nSee more results »\naccent noun [C]\n(EMPHASIS)\nlanguage, music\n&#160; specialized a special emphasis given to a particular syllable in a word, word in a sentence, or note in a set of musical notes: The accent falls on the final syllable. the accent is on something\ngreat importance is given to a particular thing or quality: This season the accent is definitely on long, flowing, romantic clothes.\nSee more\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTechnical music terms\nStressing & emphasizing\nRelated word\naccented\nto emphasize something: In any advertising campaign, you must accent the areas where your product is better than the competition.specialized Accent the first note of every bar.\nSMART Vocabulary: related words and phrases\nStressing & emphasizing\naccentuate\naccentuation\nall day long idiom\nbelieve\ndeadass\ndrive/hammer something home idiom\nexactly\ninsistence\ninsistency\ninsistently\nintensely\nlike blazes idiom\nmisemphasis\npercent\nram\nstress\nthemselves\nvaunt\nwork/laugh/freeze, etc. your arse off idiom\nwork/laugh/freeze, etc. your ass off idiom\nSee more results »\naccent noun [C]\n(WAY OF PRONOUNCING)\nAdd to word list\nAdd to word list\nthe way in which people in a particular area or country pronounce words: She spoke with a slight southern accent.\nAn accent is also a mark written or printed over a letter to show how to pronounce it.\naccent noun [C]\n(EMPHASIS)\na special emphasis given to a syllable in a word or to a word in a sentence: In the word \"government,\" the accent is on the first syllable.\naccent verb [T]\n(EMPHASIZE)\nto give special emphasis to a syllable in a word or to a word in a sentence: In Spanish, you usually accent the next-to-last syllable."}