{"id":1473,"name":"accept","type":"verb","us_sound":"əkˈsept","us_link":"../audio/a/accept.mp3","uk_sound":"əkˈsept","uk_link":"../audio/a/ukac___020.mp3","content":"accept verb\n(TAKE)\nAdd to word list\nAdd to word list\nB1 [ T ] to agree to take something: Do you accept credit cards? She was in Mumbai to accept an award for her latest novel. I offered her an apology, but she wouldn't accept it. I accept full responsibility for the failure of the plan. The new coffee machines will accept coins of any denomination.\nThesaurus: synonyms, antonyms, and examples\nto accept something that is offeredacceptThey were charged with accepting illegal contributions. takeShe offered him the job and he took it.say yes (to)I asked him to marry me and he said yes.take someone up onThank you – I’d like to take you up on your offer.\nSee more results »\nB1 [ I or T ] to say yes to an offer or invitation: We've offered her the job, but I don't know whether she'll accept it. I've just accepted an invitation to the opening-night party. I've been invited to their wedding but I haven't decided whether to accept.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nMore examplesFewer examplesAfter a lot of careful thought, she decided to accept their offer.She is too proud to accept any help.Do you think the seller will accept £196,000 for the house?I don't usually accept lifts from strange men.UK A lot of shops won't accept cheques unless you have a cheque card with you.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\naccept verb\n(APPROVE)\nB2 [ T ] to consider something or someone as satisfactory: The manuscript was accepted for publication last week. She was accepted as a full member of the society. His fellow workers refused to accept him (= to include him as one of their group).\nMore examplesFewer examplesIt is difficult for many people to accept a literal interpretation of the Bible.The committee decided with one voice to accept the proposal.While I accept that he's not perfect in many ways, I do actually quite like the man.He was a very stubborn man who refused to accept defeat.We must accept the results of a democratic election.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\naccept verb\n(BELIEVE)\nB2 [ T ] to believe that something is true: The police refused to accept her version of the story. He still hasn't accepted the situation (= realized that he cannot change it). [ + that ] I can't accept that there's nothing we can do.\nThesaurus: synonyms, antonyms, and examples\nto say that you are wrongconfessRawlinson finally confessed to the robbery.own upCome on, own up - who's eaten the last sandwich?fess upFess up - you wanted to go to the cinema instead, didn't you?come cleanI decided to come clean about the broken vase.concedeShe did eventually concede that the instructions were not very clear.admitHe admitted that he had been wrong.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accept that something is trueacceptI fully accept that I was wrong.acknowledgeI acknowledge that the project has faced delays, but we will do all we can to make up time.recognizeI do recognize that mistakes were made.admitWhy don't you just admit you got it wrong?\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accept or continue in a situation that is difficult or unpleasantbearI will bear the responsibility for whatever happens.endureShe endured years of hip pain before seeing a surgeon.sufferShe suffers from severe asthma. acceptI have finally accepted that I can't change who he is.resign yourself toI have resigned myself to the fact that I'll never work again.become resigned toPeople have become resigned to the fact that increased security means much longer wait times at airports.\nSee more results »\nMore examplesFewer examplesShe can't accept she made a mistake and now she's trying to lay the blame on her assistant.Rationally, he knows that she won't ever go back to him, but emotionally he can't accept it.She refused to accept that she was wrong and stalked furiously out of the room.I had to accept that the relationship had run its course.It was a terrible struggle for him to accept her death.\nSMART Vocabulary: related words and phrases\nBelieving\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ncredit\ndeluded\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nhold\nrecognize\nroom for doubt idiom\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nstock\nword\nSee more results »\nAdd to word list\nAdd to word list\nto agree to take something, or to consider something as satisfactory, reasonable, or true: She accepted the job offer. He was accused of accepting bribes. Do you accept credit cards? He refuses to accept the fact that he could be wrong.\nIf you accept an offer or an invitation, you say yes to it: We accepted an invitation to visit China.\nTo accept is also to allow someone to become a member of an organization or group: He was accepted by three colleges.\nTo accept is also to consider someone as now belonging to your group as an equal: She never felt accepted by the other girls in her sorority.\nAdd to word list\nAdd to word list\n[ T ] to agree to take something: accept a cheque/credit card/cash Do you accept credit cards?accept a booking/order Your order has been accepted and will be processed within 48 hours. The buyer may refuse to accept the goods if they do not comply with the contract. Please accept my apology for our mistake. I accept full responsibility for the failure of the project.\n[ I or T ] to say yes to an offer or invitation: accept an offer/job/position We've offered her the job, but I don't know whether she'll accept. Almost 80% of policyholders voted to accept the deal. I've accepted an invitation to speak at the conference.\n[ T ] to consider something or someone as satisfactory: accept sb/sth as sth We are pleased to announce that we have been accepted as a full member of the Association of Consultant Engineers.accept sth for sth The design has been accepted for production.\n[ T ]\n&#160; INSURANCE to agree to provide insurance for something or someone: The decision by insurance underwriters to accept the risk demonstrates the strength of his case.\n[ T ]\n&#160; FINANCE to agree to pay a bill of exchange"}