{"id":1518,"name":"accessible","type":"adjective","us_sound":"əkˈses.ə.bəl","us_link":"../audio/a/accessible.mp3","uk_sound":"əkˈses.ə.bəl","uk_link":"../audio/a/ukac___028.mp3","content":"Add to word list\nAdd to word list\nB2 able to be reached or easily obtained : The resort is easily accessible by road, rail, and air. The building has fast internet accessible to subscribers. The problem with some of these drugs is that they are so very accessible.\nable to be entered or used by everyone, including people who use a wheelchair, people who are blind, etc.: They agreed to build more affordable and accessible housing. All the toilets are fully accessible.\nC2 easy to understand or enjoy: Lea Anderson is a choreographer who believes in making dance accessible. Covent Garden has made some attempt to make opera accessible to a wider public.\nMore examplesFewer examplesThe penthouse level is accessible only by private lift.Many smaller villages are only accessible by bus.The library has a large collection of rare books accessible to scholars.I got an error message saying that the database was not currently accessible.All parts of the museum are accessible to wheelchairs.If your restaurant is not accessible, you will lose not only disabled customers but their friends and family too. The book has succeeded in making philosophy accessible to a wider audience.The annotation of literary texts makes them more accessible.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessibly\nat your command idiom\navailability\navailable\ndrop\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non hand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEasy to understand\nRelated word\naccessibilitySee also\n-accessible\nused at the end of words to mean that something can be reached or obtained in a particular way or by a particular group of people: handicapped-accessible The facility is handicapped-accesible, with a ramp leading to the entrance. wheelchair-accessible The stadium currently has 90 wheelchair-accessible seats. Computer-accessible medical records avoid paper waste and save time. The device has two front-accessible USB ports.\nMore examplesFewer examplesThe charity raised money to buy a new wheelchair-accessible van.The new web-accessible system will enable direct comparisons of school finances and student performance.The site will have lorry-accessible biodiesel pumps.These registers are not user-accessible.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessibly\nat your command idiom\navailability\navailable\ndrop\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non hand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nAdd to word list\nAdd to word list\npossible to approach, enter, or use: The island is accessible only by ferry. Public areas and buildings are now more accessible to people with disabilities. By using more illustrations, he made the magazine more accessible to the public (= easier to understand).\nAdd to word list\nAdd to word list\nable to be easily got or used: be accessible to sb The website is accessible to all users.\nable to be reached or entered: The studios are fully accessible to people with disabilities. Our building is wheelchair accessible. to be accessible by car/road/public transport\neasy to understand: The material is accessible and does not require specialist knowledge.\nif a person is accessible, they are willing to see people and are friendly and easy to talk to: You will find all our staff friendly and accessible. Compare\ninaccessible"}