{"id":1443,"name":"accelerator","type":"noun","us_sound":"ekˈsel.ɚ.eɪ.t̬ɚ","us_link":"../audio/a/eus70037.mp3","uk_sound":"əkˈsel.ə.reɪ.tər","uk_link":"../audio/a/ukac___013.mp3","content":"Add to word list\nAdd to word list\nthe pedal (= a part that you push with your foot) in a vehicle that makes it go faster\nphysics\n&#160; specialized in physics, a machine that makes particles (= small pieces of matter) move very fast\nbusiness\n&#160; specialized a company or plan that helps new companies or organizations to grow quickly and become successful: Start-up accelerators have become increasingly popular elements of the regional growth infrastructure. Accelerator programmes are a relatively new way of supporting start-ups.\nSMART Vocabulary: related words and phrases\nThe interior of vehicles\nback seat\nbrake\nbrake pedal\ndashboard\ndemister\ndickey\ndimmer switch\ndip switch\nfootbrake\ngas pedal\nhorn\ninertia reel\nluggage rack\nsafety belt\nspeedometer\nsteering column\nsteering wheel\nstick shift\ntachograph\nvisor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics in general\nMachines - general words\nHelpers and accomplices\naccelerator noun [C]\n(CHEMICAL)\nAdd to word list\nAdd to word list\nchemistry a substance that is added to other substances to speed up a chemical reaction\naccelerator noun [C]\n(SOMETHING THAT INCREASES RATE)\nphysics\n&#160; (also particle accelerator) a device used to accelerate very small pieces of nuclear material for scientific experiments\naccelerator noun [C]\n(THING THAT MAKES SOMETHING GO FASTER)\na pedal (= part worked with the foot) in a car that makes the car go faster when pressed\nAdd to word list\nAdd to word list\n[ C ] something that makes a process happen or makes something progress more quickly: Good companies use technology as an accelerator of momentum. In the postwar period, governments saw co-operatives as an economic accelerator. Accelerators offer you a way to pay off your mortgage sooner by increasing the number or amount of payments.\n[ S ]\n&#160; ECONOMICS\n&#160; (also accelerator effect) the principle that investment increases as demand increases, but by greater amounts\nput your foot on the accelerator (also hit the accelerator); (step on the accelerator)\nto make something happen or progress more quickly: This company needs someone who can put their foot on the accelerator with our excellent new products.\ntake your foot off the accelerator\nto make something happen or progress more slowly: Insurers are taking their foot off the accelerator in anticipation of a softer market."}