{"id":1517,"name":"accessibility","type":"noun","us_sound":"əkˌses.əˈbɪl.ə.t̬i","us_link":"../audio/a/eus70040.mp3","uk_sound":"əkˌses.əˈbɪl.ə.ti","uk_link":"../audio/a/ukac___027.mp3","content":"Add to word list\nAdd to word list\nthe fact of being able to be reached or obtained easily : Two new roads are being built to increase accessibility to the town centre. The accessibility of online information is an important consideration.\nthe quality of being able to be entered or used by everyone, including people who have a disability: The theater offers full wheelchair accessibility. We carried out a full audit of the office building's accessibility.\nthe quality of being easy to understand or enjoy: The accessibility of her plays means that she is able to reach a wide audience. The quality and accessibility of materials have to be high if there are to be no barriers to learning.\nMore examplesFewer examplesThe pockets are designed for easy accessibility.The government wants to improve health care accessibility.Lack of accessibility was a problem in the court building, but ramps have now been fitted.Accessibility for disabled voters is vital for the functioning of our democracy.Much of the play's charm lies in its accessibility and simplicity.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessible\naccessibly\nat your command idiom\navailability\navailable\ndrop\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non hand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEasiness and simplicity\nSee\naccessible\nAdd to word list\nAdd to word list\nthe quality or characteristic of something that makes it possible to approach, enter, or use it: Touch-screen voting machines meet the requirements for accessibility to people with disabilities. Accessibility is one of the most important aspects of textual analysis.\nAdd to word list\nAdd to word list\nthe ability to get something easily: We aim to improve the accessibility of our service to young people. Features have been added to enhance the accessibility of the website.\nthe ability to reach or enter a place or building: The new offices provide better accessibility for wheelchairs.\nthe fact of a person being willing to see people and of being friendly and easy to talk to: He is known for his accessibility and personal involvement in the day-to-day running of the business."}