{"id":1475,"name":"acceptable","type":"adjective","us_sound":"əkˈsept.ə.bəl","us_link":"../audio/a/acceptable.mp3","uk_sound":"əkˈsept.ə.bəl","uk_link":"../audio/a/ukac___022.mp3","content":"Add to word list\nAdd to word list\nB1 satisfactory and able to be agreed to or approved of: Clearly we need to come to an arrangement that is acceptable to both parties. So what is an acceptable level of radiation? This kind of attitude is simply not acceptable.\nB1 just good enough, but not very good: Her performance was acceptable, but not stunning.\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nMore examplesFewer examplesThe samples varied in quality but were generally acceptable.This essay is not of an acceptable standard - do it again.an acceptable answerThey have returned with a watered down and more acceptable version of the proposal.Discrimination on grounds of race is not acceptable.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptably\naccepted\naccordingly\nconvenience\ncorrectly\ncorrectness\ndecent\ndecently\neligibility\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuite good, or not very good\nRelated word\nacceptability\nAdd to word list\nAdd to word list\nsatisfactory; good enough: An offer that is acceptable to the union leaders might still be voted down by the union members.\nIf behavior is acceptable, it is considered to be within the range of behavior that is permitted and is not disapproved: In those days, it was not acceptable for men to wear shirts without ties."}