{"id":1552,"name":"accidental","type":"adjective","us_sound":"ˌæk.səˈden.t̬əl","us_link":"../audio/a/eus70043.mp3","uk_sound":"ˌæk.sɪˈden.təl","uk_link":"../audio/a/ukacces003.mp3","content":"Add to word list\nAdd to word list\nB2 happening or existing by chance: Reports suggest that eleven soldiers were killed by accidental fire from their own side. The site was located after the accidental discovery of bones in a field. He plays a naive salesman who becomes an accidental hero by saving a child's life. Synonym\ninadvertent\nThesaurus: synonyms, antonyms, and examples\nhappening by chance with no cause or reasonrandomIt was a random encounter between two long-lost friends.chanceA chance meeting brought them back together.arbitraryIt seems like the decision to cancel such a successful TV programme was completely arbitrary.haphazardHer cabinets were stuffed with a haphazard jumble of books, clothes, tins of soup, and papers.coincidentalAny similarity between the characters in this book and real people, living or dead, is purely coincidental.inadvertentA good editor will catch and correct all inadvertent typos in a text.\nSee more results »\nMore examplesFewer examplesAll our household goods are insured against accidental damage.The coroner concluded that his death was accidental.Our meeting wasn't planned - it was completely accidental.She says she didn't mean to break it, but I don't think it was accidental.When my condition improved after taking the herbal medicine, the doctor said it was purely accidental.\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccident\naccidentally\naccidentally on purpose idiom\naccidents will happen idiom\nan accident waiting to happen idiom\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ncatastrophe\ndisaster area\ndisastrous\ndisastrously\ndumpster fire\nemergency\nmishap\nnatural disaster\nnon-emergency\nperfect storm\npost-accident\nSee more results »\naccidental noun [C]\n(IN MUSIC)\nmusic\n&#160; specialized a sign showing that there is a temporary change from the key signature (= the set of musical notes that should normally be played for a particular piece of music)\nSMART Vocabulary: related words and phrases\nTechnical music terms\nadagio\naleatory\nantiphonal\narpeggio\narr.\narrange\ncadence\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\naccidental noun [C]\n(BIRD)\nbiology\n&#160; specialized a bird that is found in a place where birds of its type are not usually found : You may spot accidentals driven in by the stormy weather.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nbehaviourist\nclaw\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnon-migratory\nnuzzle\nscent\nskitter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnique and unusual"}