{"id":1551,"name":"accident","type":"noun","us_sound":"ˈæk.sə.dənt","us_link":"../audio/a/accident.mp3","uk_sound":"ˈæk.sɪ.dənt","uk_link":"../audio/a/ukacces002.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] something bad that happens that is not expected or intended and that often damages something or injures someone: have an accident Josh had an accident and spilled water all over his work.involved in an accident The lorry had been involved in an accident. The sign was damaged in an accident. She was injured in a car/road accident (= when one car hit another). Synonyms\ncollision (ACCIDENT)\ncrash (ACCIDENT)\nsmash (ACCIDENT) UK\nsmash-up UKCompare\nfender bender US informal\nprang noun UK informal\nThesaurus: synonyms, antonyms, and examples\nan accidentaccidentAccidents at work can sometimes result in serious injury.mishapDue to a surgical mishap, she's lost the use of her left arm.mischanceIt would be a great loss if, by some mischance, the message was never received.misfortuneThey were beset by misfortunes their whole lives.misadventureThe film was about his comic misadventures in love.death by misadventureUK The coroner recorded a verdict of death by misadventure.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na traffic accidentaccidentAn accident on the M11 is blocking traffic in a northerly direction.collisionPolice responded to the collision and closed the road.head-onBoth drivers were injured in the head-on collision.shuntUK My insurance company refused to pay out after my little shunt.crashA serious crash on the motorway yesterday led to its closure for two hours.car crashHe died in a car crash.\nSee more results »\n[ C or U ] something that happens by chance, without anyone intending or planning it: accident of birth Social status is often merely an accident of birth (= caused by whether people are born rich, poor, etc.). I like to think it is not an accident that hidden in the word \"created\" are the letters R-E-A-D. He became president by an accident of history.\nMore examplesFewer examplesI was hardly able to move my arm after the accident.She injured her spine in a riding accident.Did you leave his name out by accident or was it intentional?It was an accident - I didn't mean to break it, honestly.The company refused to accept responsibility for the accident.\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccidental\naccidentally\naccidentally on purpose idiom\naccidents will happen idiom\nan accident waiting to happen idiom\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ncatastrophe\ndisaster area\ndisastrous\ndisastrously\ndumpster fire\nemergency\nmishap\nnatural disaster\nnon-emergency\nperfect storm\npost-accident\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChance and randomness\nIdioms\naccidents will happen\nan accident waiting to happen\nbe no accident\nby accident\nhave an accident\nmore by accident than design\naccident noun [C]\n(INJURY)\nAdd to word list\nAdd to word list\nan event not intended by anyone but which has the result of injuring someone or damaging something: He was killed in an automobile accident at the age of 21.\naccident noun [C]\n(EVENT NOT PLANNED)\nsomething that happens unexpectedly and unintentionally: It’s no accident that (= There are reasons that explain why) she was chosen to be a member of the most powerful committee in Congress. accidental adjective us\nYour browser doesn't support HTML5 audio\n/ˌæk·səˈdent·əl/\nThe fire began shortly after 1:30 a.m. and appears to have been accidental. accidentally adverb us\nYour browser doesn't support HTML5 audio\n/ˌæk·səˈdent·əl·i/\nHe accidentally left the water running and flooded a bathroom floor in the hotel. Idiom\nby accident"}