{"id":1659,"name":"accompany","type":"verb","us_sound":"əˈkʌm.pə.ni","us_link":"../audio/a/accompany.mp3","uk_sound":"əˈkʌm.pə.ni","uk_link":"../audio/a/ukacces017.mp3","content":"accompany verb [T]\n(GO WITH)\nAdd to word list\nAdd to word list\nB1 to go with someone or to be provided or exist at the same time as something: accompanied by The course books are accompanied by four CDs. Depression is almost always accompanied by insomnia. The salmon was accompanied by (= served with) a fresh green salad.\nformal to show someone how to get to somewhere: accompany someone to something Would you like me to accompany you to your room?\nformal to go with someone to a social event or to an entertainment: accompany someone to something \"May I accompany you to the ball?\" he asked her. I have two tickets for the theatre on Saturday evening - would you like to accompany me?\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nMore examplesFewer examplesThere's a workbook to accompany the course book.Visitors must be accompanied by club members.His faithful old dog accompanied him everywhere he went.The prince is always accompanied by his bodyguards.The school rules state that no child shall be allowed out of the school during the day, unless accompanied by an adult.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany someone to something\nbring\nbring someone/something along\nchaperone\ncome along\nconvoy\ndirect\ndrop\nlead\nmarch\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nshow someone round (something)\nsteer\nusherette\nwalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimultaneous and consecutive\naccompany verb [T]\n(PLAY MUSIC)\nC2 to sing or play an instrument with another musician or singer: accompany on Miss Jessop accompanied Mr Bentley on the piano. Erin sang while I accompanied on the guitar.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\nair guitar\nbeat something out\nbeatbox\nblow\nbusk\npick someone/something out\nplay (something) by ear idiom\nplayability\nplayable\npluck\npump\nraise\ntap\nthrow\ntranspose\ntransposition\nultra-smooth\nvibe\nwah-wah\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSinging\nAdd to word list\nAdd to word list\nto go with someone or to exist at the same time as something: Students cannot leave the building during class hours unless they are accompanied by an adult.\nmusic In music, to accompany is to play an instrument in support of someone who is playing an instrument or singing."}