{"id":1730,"name":"accountant","type":"noun","us_sound":"əˈkaʊn.t̬ənt","us_link":"../audio/a/accountant.mp3","uk_sound":"əˈkaʊn.tənt","uk_link":"../audio/a/ukaccou002.mp3","content":"Add to word list\nAdd to word list\nB1 someone who keeps or examines the records of money received, paid, and owed by a company or person: a firm of accountants Compare\ncomptroller formal\ncontroller\nThesaurus: synonyms, antonyms, and examples\nan accountantaccountantMy accountant takes care of my taxes.bookkeeperWe hired a bookkeeper to take care of the business accounts.comptrollerThis needs to be run past the Chief Comptroller's Office.controllerShe became the corporate controller after working for years in the accountancy department.\nSee more results »\nMore examplesFewer examplesAny accountant worth their salt should be aware of the latest changes in taxation.His accountant had aided and abetted him in the fraud.The upper middle class tend to go into business or the professions, becoming, for example, lawyers, doctors or accountants.Trainee accountants average £12,000 per year.At the end of the year, the accountant goes over the books.\nSMART Vocabulary: related words and phrases\nAccounting\naccountancy\naccounting\naccounts\nannualized\nauditor\nbad debt\nbalance\nbalance sheet\nbean counter\nbill\nbudget\ndouble entry bookkeeping\nfalse accounting\nforensic accountant\nforensic accounting\nfraudulent accounting\nloss\nunaudited\nunreconciled\nwrite something down\nSee more results »\nAdd to word list\nAdd to word list\nsomeone who keeps or examines the records of money received, paid, and owed by a company or person: a tax accountant\nAdd to word list\nAdd to word list\na person or company whose job is preparing the financial records of people, companies, or organizations: According to figures compiled for accountant KPMG, year-on-year the negative trading statements were down 10% See also\ncertified management accountant\ncertified public accountant\nchartered accountant\nchartered certified accountant\ncost accountant\nforensic accountant"}