{"id":1678,"name":"accomplish","type":"verb","us_sound":"əˈkɑːm.plɪʃ","us_link":"../audio/a/accomplish.mp3","uk_sound":"əˈkʌm.plɪʃ","uk_link":"../audio/a/ukacces019.mp3","content":"Add to word list\nAdd to word list\nC1 to finish something successfully or to achieve something: The students accomplished the task in less than ten minutes. She accomplished such a lot during her visit. I feel as if I've accomplished nothing since I left my job. Synonyms\nachieve\nattain formal\nfulfil (MAKE HAPPEN) mainly UK\nreach\nrealize (ACHIEVE)\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nMore examplesFewer examplesYou can actually accomplish a lot more by gentle persuasion.If you are fit, the climb can be accomplished in less than three hours.He believes you can accomplish a lot in a relatively short space of time.New technology means that astronomers can accomplish in a single night what once took years.The new coach told the press that he believed his team could accomplish great things.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\nachieve\nacquit\nactualize\nattain\nbear\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngo places idiom\ngrade\nkill\nrise\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nsomewhere\nstand out\nSee more results »\nAdd to word list\nAdd to word list\nto do or finish something successfully; achieve something: On retiring from the Congress, he said he had accomplished everything he set out to do."}