{"id":1724,"name":"account","type":"noun","us_sound":"əˈkaʊnt","us_link":"../audio/a/account.mp3","uk_sound":"əˈkaʊnt","uk_link":"../audio/a/ukacces028.mp3","content":"account noun\n(BANK)\nAdd to word list\nAdd to word list\nB1 [ C ] (also bank account) an arrangement with a bank to keep your money there and to allow you to take it out when you need to: close an account I withdrew my money and asked the bank to close my account. open an account I've opened an account with a building society . I paid the money into my account this morning.UK She paid the cheque into her account.US She deposited the check in/into her account. I need to withdraw some money from my account.\nThesaurus: synonyms, antonyms, and examples\nan accountaccountThe company's accounts show a loss in the first quarter.the booksI let our accountant do the books.bank statementI receive a monthly bank statement.statementThe bank sends me a statement every month.\nSee more results »\nMore examplesFewer examplesI was relieved to see from my statement that my account was in credit.I closed that bank account when I came to London.The account was in debit at the end of the month.To open an account, you need to make a minimum deposit of $500.Alison drew some money out of her account to pay for our trip.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank balance\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\nelectronic banking\ngiro\ninvestment bank\npin\nsafe deposit box\nstatement\nstress test\nsuperbank\nthe Square Mile\nSee more results »\naccount noun\n(REPORT)\nB2 [ C ] a written or spoken description or record of an event: give an account of She gave a thrilling account of her life in the jungle.keep an account of He kept a detailed account of the suspect's movements. Several eyewitnesses' accounts differed considerably from the official version of events. by/from all accounts\nC1 as said by most people: By all accounts, San Francisco is a city that's easy to fall in love with.\nSee more by your own account\nIf something is true by your own account, what you say is true although you have not proved it: By his own account, he's quite wealthy.\nSee more\nMore examplesFewer examplesShe gave a clear, factual account of the attack.The book is a work of fiction and not intended as a historical account.The foregoing account was written 50 years after the incident.She gave a hair-raising account of her escape through the desert.She gave a clear and lucid account of her plans for the company's future.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounts and stories\naccount noun\n(REASON)\non account of something formal\nB2 because of something: He doesn't drink alcohol on account of his poor health.\nSee more\naccount noun\n(BUSINESS)\n[ C ] an agreement with a shop or business that allows you to buy things and pay for them later: Could you put it on/charge it to my account (= can I pay for it later), please? Do you have an account at this store/with us, madam? settle an account Could you please settle your account in full (= give us all the money you owe us)?\n[ C ] a customer who does business with a company: If the advertising agency loses this account, it will make a big dent in their profits.\nSMART Vocabulary: related words and phrases\nSaving money\nbank\ndeposit\ndeposit account\ndepositor\ndirect deposit\nISA\non deposit idiom\npension plan\nput\nput something aside\nput something by\nredeposit\nretirement plan\nsalt\nsalt something away\nsquirrel\nsquirrel something away\nTESSA\nundersaver\nwar chest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nRenting & hiring\nAccounting\naccount noun\n(INTERNET)\n[ C ] an arrangement to use a social media website or internet service by a particular person who gives their name and some personal details: I decided to delete my account. She thought that her Instagram account had been hacked.\nMore examplesFewer examplesDo you have a Spotify account?Enter your email address and a password to register your account.He has a Twitter account under the name \"WiseGuy1000\".\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\naccount noun\n(IMPORTANCE)\nbe of no/little account formal\nto not be important: It's of no account to me whether he comes or not.\nSee more\nIdioms\nbe brought/called to account\nhold someone to account\non someone's account\non no account\ntake something into account\nturn/use something to good account\naccount verb [T + obj + noun/adj ]\n(JUDGE)\nto think of someone or something in the stated way: She was accounted a genius by all who knew her work. Synonym\njudge\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nIdiom\nthere's no accounting for tastePhrasal verbs\naccount (to someone) for something\naccount for something\naccount noun [C]\n(FINANCIAL SERVICE)\nAdd to word list\nAdd to word list\nmoney kept in a bank or other organization that you can add to or take back\nAn account is also an arrangement with a store or a company that allows you to buy things and pay for them later:\naccount noun [C]\n(REPORT)\na written or spoken description of an event Idioms\non someone’s account\non account of something\nAdd to word list\nAdd to word list\nBANKING\n&#160; (also bank account); ( written abbreviation a/c); (also acct.) an arrangement with a bank in which the customer puts in and takes out money and the bank keeps a record of it: close/open an account When she starts school we're opening an account in her name and we'll put money into it each year.deposit/pay money into an account Anna could deposit her savings into an account offering more interest.an account with sth She applied for the card soon after opening an account with the bank.joint/separate account It's better to have separate accounts and feed money into a joint account for shared bills. a checking/cheque/current accountbusiness/personal account Each month I transfer money from my business account to my personal account. a deposit/savings account\nFINANCE\n&#160; (also UK credit account); (also US charge account) an agreement with a store or company that allows you to buy things and pay for them later: open an account with sth If you open an account with the store you save 10%.charge sth to an account Jenny got the bill and said she'd charge it to the company account.\nACCOUNTING a record of money received, spent, or owed: An account of travel expenses incurred by an employee must be submitted for reimbursement together with receipts.\nMARKETING a customer who does business regularly with a company: lose/win an account The company has won a batch of high-profile advertising accounts\nIT an agreement with a company that allows you to use the internet and email, and gives you space on the internet to put your documents: Some people have a specific service in mind, whether it's an account with free Web space or the ability to develop an electronic commerce site online.\non account\nto be paid for at a later time: $25,000 in inventory was purchased on account from suppliers in July.\npaid as part of the total amount owed: Part is paid on account, and the rest is paid at the end of the period.\nSee also\nadjustment account\nappropriation account\nbalance of payments capital account\nbalance of payments current account\nbank account\ncall account\ncash account\ncash management account\ncharge account\nclient account\nView all\nclub account\nconsignment account\ncontra account\ncontrol account\ncredit account\ncurrent account\ncustodial account\ndebit account\ndemand account\ndeposit account\ndepreciation account\ndiscretionary account\ndormant account\ndrawing account\nemail account\nentertainment account\nExchange Equalization Account\nexpense account\nexternal account\nforeign currency account\ninactive account\nincome and expenditure account\nindividual retirement account\ninstant access account\njoint account\nloro account\nmargin account\nmerchant account\nnostro account\nnotice account\nNOW account\nnumbered account\npostal account\nprofit-and-loss account\npublic account\npurchases account\nsales account\nsales returns account\nsavings account\nsundries account\nsuspense account\ntrust account\nvostro account"}