{"id":1648,"name":"accommodation","type":"noun","us_sound":"əˌkɑː.məˈdeɪ.ʃən","us_link":"../audio/a/cald4us0013.mp3","uk_sound":"əˌkɒm.əˈdeɪ.ʃən","uk_link":"../audio/a/ukacces013.mp3","content":"accommodation noun\n(PLACE TO STAY)\nAdd to word list\nAdd to word list\nB1 [ U ] mainly UK (US usually accommodations [ plural ]) a place to stay or live: They paid for his flights and hotel accommodation. There's a shortage of cheap accommodation in the city. There is accommodation for about five hundred students on campus. Hostels are a temporary solution until the families can be housed in permanent accommodation.\nThesaurus: synonyms, antonyms, and examples\naccommodationaccommodationUK Our holiday accommodation was not up to standard.place to stayIf you need a place to stay, I have a spare room.lodgingOur lodging on the estate wasn't free: we had to help with household tasks in payment.lodgingsAfter work she returned to her lodgings on the outskirts of town.digsUK I had digs in Jesus Lane, not far from college.\nSee more results »\n[ U ] old-fashioned UK (US accommodations [ plural ]) a particular type of place to sit or sleep on a train, boat, etc.: We were assigned first-class accommodation on the train.\nMore examplesFewer examplesWhile he was at the library, Steve decided to seek out some information on accommodation in the area.The price includes travel and accommodation but meals are extra.Feeling guilty about the homeless is relatively easy; finding cheap, secure accommodation for them is more difficult.\nSMART Vocabulary: related words and phrases\nHome\nabode\nbolthole\ncrib\ndomestically\ndomesticated\nfold\ngaff\ngive something/someone houseroom phrase\nhabitation\nhangout\nharem\nnest\nnon-domestic\nnon-home\npad\npremises\nrabbit hutch\nresidence\nresidential\nroof\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTickets\naccommodation noun\n(ARRANGEMENT)\n[ C or U ] formal an agreement between two groups who have different opinions on a subject, or the process of reaching an agreement like this: She may be able to reach an accommodation with other EU members on the question of immigration. He sought accommodation with the United States.\n[ C usually plural or U ] US a special arrangement that is made for a person or group that has different needs to others: make accommodations for The hotel tries to make accommodations for people with small children.reasonable accommodations Companies should make reasonable accommodations for disabled employees. As a host, what do you consider to be a reasonable accommodation for someone with a medically restricted diet? As a business we offer flexible work hours and other accommodations for parents. My children had no recognized disability so I did not qualify for any accommodation with regard to work hours.\nMore examplesFewer examplesI think we could have come to an accommodation about a reasonable use of the site, but the other side refused to negotiate.He believed that the Empire should be ruled through accommodations with local people.We must address the issue of accommodations for gifted students.Some accommodations were allowed for students with learning difficulties.Accommodations were made for people with particular religious practices.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccreditation\nagree to something\nagree with something\naligned\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroll over\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlans and arrangements\naccommodation noun\n(OF EYE)\n[ U ]\n&#160; anatomy\n&#160; specialized the process by which an eye is able to focus (= see clearly) by changing the shape of the lens\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\nall eyes are on someone/something idiom\nastigmatic\nbeholder\nbinocular\ncorner\nfix\ngaze\nglare\nglass\npenetrating\nperceive\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsee something with your own eyes idiom\nsighting\nspot\ntab\nSee more results »\naccommodation noun\n(IN SPEECH)\n[ U ]\n&#160; language\n&#160; specialized (also speech accommodation, linguistic accommodation, communication accommodation) the process in which someone changes their accent (= the way that people who come from a particular area, social group, etc. pronounce words) or other things about the way that they speak according to the speech style or behaviour of the person who they are speaking to: When two people from different social backgrounds meet, there is often a tendency for their ways of speaking to alter so that they become more alike, a process known as accommodation. She carried out a study of linguistic accommodation in social settings. Speech accommodation theory holds that communicators are motivated to adjust aspects of their speech styles as a way of expressing attitudes and intentions.\n[ U ]\n&#160; phonetics\n&#160; specialized a process in which a speech sound is changed according to the sound that comes directly before or after it: One of the most common forms of accommodation is that consonants tend to be labialized when followed by a rounded vowel, as in cool or rude.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\nalphabetic\nAmericanism\nAnglicism\nantonym\nantonymous\napplicative\nbuzzword\ncognate\ncoinage\nhomography\nhomonymic\nhomonymy\nhomophonic\nhomophony\nproductive\nproductively\nreceptive\nreceptively\nreferent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: phonology & phonetics\nAdd to word list\nAdd to word list\n[ U ]\n&#160; PROPERTY\n&#160; UK ( US accommodations [ plural ]) a place in which to live, work, stay, etc.: The cost, including flights, accommodation, and meals, was €100,000. temporary accommodation luxury accommodations.\n[ C or U ] a satisfactory arrangement between people who disagree about something: come to/find/reach an accommodation I thought we could come to an accommodation about what is a reasonable use of the site, but all we heard was \"No, I don't negotiate\".\n[ S ]\n&#160; FINANCE\n&#160; mainly US a loan that is made temporarily to someone who needs money quickly, in order to give them time to make a formal arrangement for a loan"}