{"id":1641,"name":"accommodated","type":"verb","us_sound":"əˈkɑː.mə.deɪt","us_link":"../audio/a/eus70045.mp3","uk_sound":"əˈkɒm.ə.deɪt","uk_link":"../audio/a/ukacces011.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\naccommodate\naccommodate verb [T]\n(FIND A PLACE FOR)\nto provide with a place to live or to be stored in: New students may be accommodated in halls of residence.formal There wasn't enough space to accommodate the files.\nThesaurus: synonyms, antonyms, and examples\nto accommodate someoneaccommodateThere aren’t enough rooms to accommodate all the students.give accommodation toThe university gives free accommodation to nursing students.provide accommodation toWe only provide accommodation to first-year students.lodgeStudents will be lodged with host families.houseThe base can house up to 2,000 soldiers.put someone upI can put you up for a couple of nights.\nSee more results »\nMore examplesFewer examplesWhile he was at the library, Steve decided to seek out some information on accommodation in the area.Feeling guilty for the homeless is one thing, finding cheap secure accommodation for them is quite another thing.Hostels are usually provided as a stopgap until the families can be housed in permanent accommodation.There's accommodation for about five hundred students on campus.The price includes travel and accommodation but meals are extra.\nSMART Vocabulary: related words and phrases\nAccommodating people\naccommodate\nbillet\nboard\nboard and lodging\nboarding and lodging\ndeinstitutionalize\nfull board\nhalf board\nhouse\nmodified American plan\nnon-residential\nnoninstitutionalized\nplacement\nput\nput something away\nresettlement\nroom and board\nseat\nself-catering\nsettle\nSee more results »\naccommodate verb [T]\n(SUIT)\nto give what is needed to someone: The new policies fail to accommodate people with disabilities. We always try to accommodate (= help) our clients with financial assistance if necessary. accommodate yourself\nto change yourself or your behaviour to suit another person or new conditions: Some find it hard to accommodate themselves to the new working conditions. She was desperately trying to accommodate herself to her new living arrangements. At that point, I had not accommodated myself to the life of a fisherman. We tried to find a way of accommodating ourselves to a society we disliked. As a politician, he had to be able to accommodate himself to public opinion.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdapting and modifying\naccommodate verb [T]\n(EYE)\nanatomy\n&#160; specialized (of an eye) to change the shape of the lens in order to focus (= see clearly)\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »"}