{"id":1838,"name":"accuracy","type":"noun","us_sound":"ˈæk.jɚ.ə.si","us_link":"../audio/a/accuracy.mp3","uk_sound":"ˈæk.jə.rə.si","uk_link":"../audio/a/ukaccou014.mp3","content":"Add to word list\nAdd to word list\nB2 the fact of being exact or correct: Patricia has checked the reports and can vouch for the accuracy of the information.with accuracy Experience is needed to use the machine with accuracy.pinpoint accuracy The computer will calculate your position with pinpoint accuracy.great accuracy He always hits the ball with great accuracy.high degree of accuracy Predictions can be made with a high degree of accuracy.\nthe ability to do something without making mistakes\nMore examplesFewer examplesThe latest missiles can be fired with incredible accuracy.Her paintings are almost photographic in their detail and accuracy.All high-tech weaponry demands frequent servicing to ensure accuracy.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccurate\naccurately\naright\nauthoritative\nauthoritatively\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\ninfallibly\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\naccuracy noun [U]\n(CORRECTNESS)\nAdd to word list\nAdd to word list\nthe fact of being correct and without any mistakes: He challenged the accuracy of the research results.\nscience Accuracy is also the agreement of a particular measurement with an accepted standard.\naccuracy noun [U]\n(EXACTNESS)\nthe fact of being exactly aimed and moving on an intended path: The predawn raid was executed with pinpoint accuracy.\nAdd to word list\nAdd to word list\nthe ability to do something without making mistakes: She says she can type 85 words per minute with 90% accuracy.\nthe quality of being correct and without mistakes: The applicant has the right to challenge the accuracy of a credit report."}