{"id":1840,"name":"accurate","type":"adjective","us_sound":"ˈæk.jɚ.ət","us_link":"../audio/a/accurate.mp3","uk_sound":"ˈæk.jə.rət","uk_link":"../audio/a/ukaccou015.mp3","content":"Add to word list\nAdd to word list\nB1 correct, exact, and without any mistakes: an accurate machine an accurate description The figures they have used are just not accurate. Her novel is an accurate reflection of life in Spain. We hope to become more accurate in predicting earthquakes. Opposites\nimprecise\ninaccurate\ninexact\nThesaurus: synonyms, antonyms, and examples\ncomplete and true in every detailexactWhat is your exact location?preciseIt was a mathematically precise model of how the wind would affect the structure.accurateWe need accurate measurements before we can begin the building project.superaccurateScientists use a superaccurate atomic clock to measure time.specificPlease make your questions as specific as possibile.\nSee more results »\nMore examplesFewer examplesWe'll need accurate costings before we can agree to fund the scheme.The number is accurate to three decimal places.The film makes no attempt to be historically accurate.Her predictions turned out to be uncannily accurate.I hereby certify that the above information is true and accurate.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurately\naright\nauthoritative\nauthoritatively\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\ninfallibly\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nRelated word\naccurately\naccurate adjective\n(CORRECT)\nAdd to word list\nAdd to word list\ncorrect and without any mistakes\naccurate adjective\n(EXACT)\nexactly aimed and moving on an intended path accurately adverb us\nYour browser doesn't support HTML5 audio\n/ˈæk·jər·ət·li/\nAdd to word list\nAdd to word list\ncorrect and without any mistakes: accurate data/details/information Internet communication instantly provides timely and accurate data for evaluating investment opportunities. The aim at all times is to have an accurate estimate of the final cost."}