{"id":1824,"name":"accumulate","type":"verb","us_sound":"əˈkjuː.mjə.leɪt","us_link":"../audio/a/accumulate.mp3","uk_sound":"əˈkjuː.mjə.leɪt","uk_link":"../audio/a/ukaccou011.mp3","content":"Add to word list\nAdd to word list\nC2 [ T ] to collect a large number of things over a long period of time: As people accumulate more wealth, they tend to spend a greater proportion of their incomes. The company said the debt was accumulated during its acquisition of nine individual businesses. We've accumulated so much rubbish over the years.\nC2 [ I ] to gradually increase in number or amount: A thick layer of dust had accumulated in the room. If you don't go through the papers on your desk on a regular basis, they just keep on accumulating.\nMore examplesFewer examplesIt can be dangerous to let too much soot accumulate inside a chimney.During a successful business career, she accumulated a great amount of wealth.After a long career in the antiques trade, Harry had accumulated many rare treasures.During our six years in this house, we seem to have accumulated an awful lot of junk.Why don't you just do a little ironing every now and then, instead of letting it accumulate?\nSMART Vocabulary: related words and phrases\nCollecting and amassing\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\ngarner\nharvest\nput something together\nrake something up\nreassemble\nreconcentrate\nreconcentration\nthe assembled company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nAdd to word list\nAdd to word list\nto collect or increase something gradually, esp. over a period of time: [ T ] We’ve accumulated a lot of junk over the years. [ T ] He accumulated a fortune in the music business. accumulation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˌkjum·jəˈleɪ·ʃən/\n[ U ] the accumulation of wealth\nAdd to word list\nAdd to word list\n[ I ] to gradually increase in amount: While the deficit was allowed to accumulate, nothing was done to address the problem.\n[ T ] to collect an amount of something over a period of time: The table shows what you need to save monthly to accumulate $1 million by age 65.accumulate/debts/losses/wealth The report also said a further 90,000 households had accumulated wealth of more than £1m."}