{"id":1861,"name":"accusative","type":"noun","us_sound":"əˈkjuː.zə.t̬ɪv","us_link":"../audio/a/eus70054.mp3","uk_sound":"əˈkjuː.zə.tɪv","uk_link":"../audio/a/ukaccou019.mp3","content":"Add to word list\nAdd to word list\nthe form of a noun, pronoun, or adjective that is used in some languages to show that the word is the direct object of a verb: Does \"in\" take the accusative or the ablative? The accusative marks the object, while the genitive marks the possessor of something.\nMore examplesFewer examplesThe French would always use the strong accusative, \"toi\" and \"moi\".When we think a thought, \"thought\" is a cognate accusative (like \"blow\" in \"strike a blow\").a gerundial form that takes an accusative\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\nart\nbare infinitive\nbent\ncontinuous\ndangling participle\ngerund\ninfinitive\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npluperfect\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nin the form of a noun, pronoun, or adjective that is used in some languages to show that the word is the direct object of a verb: They don't know what the accusative case is. He deplored the use of an accusative pronoun in place of a nominative pronoun.\nMore examplesFewer examplesUsing the word as an accusative singular is not an error. She used \"whom\" when it should have been \"who\", because she thought it was accusative but it was nominative.In Turkish, there is a complicated relationship between the use of accusative case-marking and definiteness.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\nart\nbare infinitive\nbent\ncontinuous\ndangling participle\ngerund\ninfinitive\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npluperfect\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nAdd to word list\nAdd to word list\ngrammar having or relating to the case (= form) of a noun, pronoun, or adjective that is used to show that a word is the direct object of a verb"}