{"id":1871,"name":"accuse","type":"verb","us_sound":"əˈkjuːz","us_link":"../audio/a/accuse.mp3","uk_sound":"əˈkjuːz","uk_link":"../audio/a/ukaccou021.mp3","content":"Add to word list\nAdd to word list\nB2 to say that someone has done something morally wrong, illegal, or unkind: \"It wasn't my fault.\" \"Don't worry, I'm not accusing you.\"accuse someone of something He's been accused of robbery/murder. Are you accusing me of lying? The surgeon was accused of negligence.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nstand accused of something formal\nIf you stand accused of doing something wrong, people say that you have done it: The government stands accused of eroding freedom of speech.\nSee more\nMore examplesFewer examplesShe's been accused of acting dishonestly.She accused her employer of sex discrimination .He's been accused of robbery/murder.Are you accusing me of lying?\"It wasn't my fault.\" \"Don't worry, I'm not accusing you.\"\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nfinger\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking legal action\nRelated word\naccuser\nAdd to word list\nAdd to word list\nto say that someone is responsible for a crime or for having done something wrong: He was accused of failing to pay his taxes. She accused me of lying. accusation noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˌæk·jəˈzeɪ·ʃən/\nHe denied the accusation, saying he was innocent.\nAdd to word list\nAdd to word list\nto say that someone has done something wrong or illegal: accuse sb of (doing) sth He is accused of misleading investors and lenders about the financial health of the company."}