{"id":2218,"name":"ache","type":"noun","us_sound":"eɪk","us_link":"../audio/a/ache.mp3","uk_sound":"eɪk","uk_link":"../audio/a/ukaceta006.mp3","content":"Add to word list\nAdd to word list\nB1 a continuous pain that is unpleasant but not very strong: aches and pains As you get older, you have all sorts of aches and pains.dull ache I've got a dull (= slight) ache in my lower back.\nThesaurus: synonyms, antonyms, and examples\npainpainThere are drugs you can take to ease the pain.agonyMothers will often talk about the agony of childbirth.sorenessIf you sailed through the exercises without soreness, you can move on.acheI developed a dull ache in my jaw.discomfortSometimes receding gums can cause discomfort.stingBee stings can cause an allergic reaction in some people.\nSee more results »\nB1 used in combinations with parts of the body to mean a continuous pain in the stated part: earache/a headache/toothache/backache I've had a stomach ache all morning.\nMore examplesFewer examplesShe felt a persistent ache at the back of her head.He's been suffering various aches and pains for years.No, it isn't a sharp pain - just a general ache.She complained of an ache in her shoulder which kept her awake at night.This painkiller is good for general aches and pains, but maybe you need something stronger?\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsore\nsting\nstitch\nthrob\nSee more results »\nB2 to have a continuous pain that is unpleasant but not very strong: My head/tooth/back aches. I ache/I'm aching all over. I've got one or two aching muscles after yesterday's run.\nThesaurus: synonyms, antonyms, and examples\nto cause painhurtMy leg hurts.acheMy legs are still aching from my run yesterday.throbMy head throbbed.stingHis cheeks stung from the aftershave he'd just put on.smartThe smoke was thick, making her eyes smart.rubThe clothing is cleverly stitched to prevent the seams rubbing anywhere.\nSee more results »\nMore examplesFewer examplesIf you're not used to exercise your joints may ache the next day.My arms ache from carrying this bag.My back really aches after moving those heavy boxes around all day.After my exercise class, my whole body ached.She's aching and shivering, so I've sent her to bed.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsore\nsting\nstitch\nthrob\nSee more results »\nPhrasal verb\nache for something\nAdd to word list\nAdd to word list\na continuous pain that is unpleasant but not usually strong: She has a fever, muscle aches, and a cough.\nAche is often used in combination: earache/headache/toothache\nto have a continuous pain that is unpleasant but not usually strong: [ I ] They did pushups until their arms ached. [ I ] fig. Her heart ached (= She felt very sorry) for the people who had lost their loved ones in the plane crash."}