{"id":2258,"name":"achievement","type":"noun","us_sound":"əˈtʃiːv.mənt","us_link":"../audio/a/achievement.mp3","uk_sound":"əˈtʃiːv.mənt","uk_link":"../audio/a/ukaceta009.mp3","content":"Add to word list\nAdd to word list\nB1 something very good and difficult that you have succeeded in doing: sense of achievement It gives you a sense of achievement if you actually make it to the end of a very long book. An Olympic silver medal is a remarkable achievement for one so young. The Tale of Genji has been described as the greatest achievement of Japanese literature. Synonyms\naccomplishment\nattainment formal\ndeed (ACTION)\nexploit\nfeat\nThesaurus: synonyms, antonyms, and examples\nan achievementachievementFinishing the marathon in 10th place was an incredible achievement.accomplishmentWinning the award was a major accomplishment.attainmentsThe faculty were distinguished for their scientific attainments.attainmentThe study will track each student's educational attainment.realizationUK It was the realisation of all her dreams.fulfilmentUK The trip was the fulfilment of his dreams.\nSee more results »\nMore examplesFewer examplesHe was very proud when his daughter received a commendation for her achievement.In the 1860s, Tolstoy was at the zenith of his achievement.If the new leader does manage to unify his warring party it will be quite an achievement.This is a truly remarkable achievement.Getting the job finished on time was no mean achievement.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement test\nascension\nascent\nattainment\nbelt\nboom\nfeat\nfruition\nhave something under your belt idiom\nhe who laughs last, laughs longest/best idiom\nlaugh\nprospect\nsecret sauce\nsellout\nsense of achievement\nstratosphere\ntear\nSee more results »\nAdd to word list\nAdd to word list\nsomething that you did or got after planning and working to make it happen, and that therefore gives you a feeling of satisfaction, or the act of working to make this happen: [ C ] a scientific achievement [ C ] For an actor, winning an Oscar is one of the greatest achievements you can hope for.\nAdd to word list\nAdd to word list\n[ C ] something that a person, company, etc. has done or finished successfully: Look at your achievements and your value in monetary terms.\n[ U ] the act of achieving something or of achieving things generally: The company's name is synonymous with outstanding achievement. See also\nattainment"}