{"id":2257,"name":"achieved","type":"verb","us_sound":"əˈtʃiːv","us_link":"../audio/a/achieve.mp3","uk_sound":"əˈtʃiːv","uk_link":"../audio/a/ukaceta008.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nachieve\nB1 to succeed in finishing something or reaching an aim, especially after a lot of work or effort: The government's training policy, he claimed, was achieving its objectives. She finally achieved her ambition to visit South America. I've been working all day, but I feel as if I've achieved nothing. Synonyms\naccomplish\nattain formal\nfulfil (MAKE HAPPEN) mainly UK\nreach\nrealize (ACHIEVE)See also\nunderachieve\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nMore examplesFewer examplesWe've achieved some marvellous results with this new drug.He has already achieved his main ambition in life - to become wealthy.I've been working all day, but I feel as if I've achieved nothing.She was so desperate for success that she'd do anything to achieve it.We've set ourselves a series of goals to achieve by the end of the month.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »"}