{"id":2561,"name":"acknowledge","type":"verb","us_sound":"əkˈnɑː.lɪdʒ","us_link":"../audio/a/acknowledge.mp3","uk_sound":"əkˈnɒl.ɪdʒ","uk_link":"../audio/a/ukaceta021.mp3","content":"Add to word list\nAdd to word list\nC1 to accept, admit, or recognize something, or the truth or existence of something: acknowledge someone as something Historians generally acknowledge her as a genius in her field. [ + -ing verb ] She acknowledged having been at fault. [ + that ] She acknowledged that she had been at fault. You must acknowledge the truth of her argument. [ + obj + to infinitive ] She is usually acknowledged to be one of our best artists. They refused to acknowledge (= to recognize officially) the new government. The government won't even acknowledge the existence of the problem.\nThesaurus: synonyms, antonyms, and examples\nto say that you are wrongconfessRawlinson finally confessed to the robbery.own upCome on, own up - who's eaten the last sandwich?fess upFess up - you wanted to go to the cinema instead, didn't you?come cleanI decided to come clean about the broken vase.concedeShe did eventually concede that the instructions were not very clear.admitHe admitted that he had been wrong.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accept that something is trueacceptI fully accept that I was wrong.acknowledgeI acknowledge that the project has faced delays, but we will do all we can to make up time.recognizeI do recognize that mistakes were made.admitWhy don't you just admit you got it wrong?\nSee more results »\nC1 to tell someone, usually in a letter or email, that you have received something they sent you: They didn't acknowledge my letter.acknowledge receipt of Please acknowledge receipt of this letter.\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nMore examplesFewer examplesAlways acknowledge your sources at the end of an essay.The government has acknowledged that homelessness is a problem but it has failed to grasp the scale of the problem.It is widely acknowledged that the welfare system is under-resourced.She acknowledged me with a quick bob of her head.I regarded her failure to acknowledge my greeting as a slight.\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhand\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nacknowledge someone's presence\nto show that you have seen someone: He didn't even acknowledge my presence. He walked past her, without acknowledging her presence by the slightest alteration in his expression.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nstrike while the iron is hot idiom\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nwake\nSee more results »\nAdd to word list\nAdd to word list\nto accept the truth or recognize the existence of something: The president acknowledged his mistake in not vetoing the tax bill. He’s acknowledged as a leader in the Latino community. fml Please acknowledge receipt of this letter (= tell us when you receive it).\nAdd to word list\nAdd to word list\nto let someone know that you have received something that they sent to you: acknowledge receipt of sth Please acknowledge receipt of this letter."}