{"id":2571,"name":"acknowledgment","type":"noun","us_sound":"əkˈnɑː.lɪdʒ.mənt","us_link":"../audio/a/eus70060.mp3","uk_sound":"əkˈnɒl.ɪdʒ.mənt","uk_link":"../audio/a/ukaceta022.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] the fact of accepting that something is true or right: All I want is some acknowledgment that his behaviour is unreasonable. Synonyms\nacceptance\nrecognition (ACCEPTING)\nThesaurus: synonyms, antonyms, and examples\nacceptance of somethingacceptanceThe idea was slow to find general acceptance.acknowledgmentWe still await an acknowledgment of the fact that our case was handled improperly.recognitionThere was no recognition of having done anything wrong.resignationShe sighed in weary resignation.\nSee more results »\nsomething given to thank someone for what they have done: in acknowledgment of We sent her a copy of the book in acknowledgment of her part in its creation. She was given a floral arrangement by her boss as an acknowledgment for a job well done.\na letter or email to say that something has been received: I applied for four jobs, but I've only had one acknowledgment so far. acknowledgments [ plural ] (also acknowledgements)\na short text at the beginning or end of a book where the writer names people or other works that have helped in writing the book: She included Wilson in her acknowledgements.\nSee more\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdmitting & confessing\nAnswering & responding\nAdd to word list\nAdd to word list\nthe act or fact of accepting the truth or recognizing the existence of something: [ C ] Her resignation was an acknowledgment of defeat. [ C ] I applied for a grant and just received an acknowledgment (= letter saying that my letter was received)."}