{"id":2713,"name":"acquaintance","type":"noun","us_sound":"əˈkweɪn.təns","us_link":"../audio/a/eus70061.mp3","uk_sound":"əˈkweɪn.təns","uk_link":"../audio/a/ukacqua002.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] a person that you have met but do not know well: a business acquaintance Compare\nbuddy noun informal\nchum noun (FRIEND) old-fashioned informal\ncompanion (PERSON)\ncrony informal disapproving\nfriend noun (PERSON YOU LIKE)\nmate noun (FRIEND) UK informal\nmucker UK informal\npal noun informal\n[ U ] formal used in some expressions about knowing or meeting people: I have absolutely no acquaintance with the family. You have yet to have the pleasure of her acquaintance. A small girl of my acquaintance insists on eating cornflakes without milk, flake by flake.on further acquaintance I wasn't sure about Darryl when I first met her, but on further acquaintance I rather like her.\n[ U ] formal knowledge of a subject: acquaintance with Sadly, my acquaintance with Spanish literature is rather limited.\nMore examplesFewer examplesHe gradually lost contact with all his old acquaintances.Professor Stevens is a professional acquaintance of mine - shall I introduce you to him?I recently met an old work acquaintance of mine and I hardly recognized him.I hope you'll consider me a friend and not just an acquaintance.The news quickly spread around all our friends and acquaintances.\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintanceship\nacquainted\nacquainted with someone\namigo\nbedmate\ncompanion\ncomrade\ncrony\nfair-weather friend\nfam\nflatmate\nfriendless\nintimate\nneighbour\npal\npeeps\npeer group\npen pal\npenfriend\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnowledge and awareness\nRelated word\nacquaintanceshipIdioms\nhave a passing/slight/nodding acquaintance with something\nmake someone's acquaintance\nAdd to word list\nAdd to word list\na person whom you know but do not know well and who is therefore not exactly a friend\nAcquaintance is also knowledge about something: [ U ] The young have little acquaintance with real-life tragedy."}