{"id":2755,"name":"acquisition","type":"noun","us_sound":"ˌæk.wəˈzɪʃ.ən","us_link":"../audio/a/acquisition.mp3","uk_sound":"ˌæk.wɪˈzɪʃ.ən","uk_link":"../audio/a/ukacqua010.mp3","content":"Add to word list\nAdd to word list\n[ U ] the process of getting something: The acquisition of huge amounts of data has helped our research enormously. Their main methods of food acquisition were hunting and fishing.\n[ U ] the process of gradually learning something or gaining something such as a skill: acquisition of Education is not merely about the acquisition of knowledge. Anxiety can interfere with the acquisition of new skills.language acquisition Language acquisition starts at a very young age.\n[ C ] something that someone buys, often to add to a collection of things: recent acquisition I like your earrings - are they a recent acquisition? (= Did you get them recently?) The museum's latest acquisition is a four-million-dollar sculpture.\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\n[ C or U ]\n&#160; business\n&#160; specialized something such as a building, another company, or a piece of land that is bought by a company, or the act of buying it: mergers and acquisitions She worked on mergers and acquisitions, specializing in asset valuation. The company is considering a number of acquisitions. Several small media companies are his next likely targets for acquisition.\n[ C or U ]\n&#160; media, publishing\n&#160; specialized the right to sell or publish something, such as a particular work or work by a particular author, that is bought or obtained by a company or person; the act of buying or obtaining this right: They are very pleased with another new acquisition, a biography of the former Prime Minister. He built the firm into a leading publisher with his clever acquisitions, including Robert Louis Stephenson's \"Treasure Island\". Acquisition of digital rights for new books is now a standard part of contract negotiations.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nawardee\ncarve\ncarve something out (for yourself)\ndraw\nearn\nfill\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\ngrantsmanship\nscore\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\nLearning & knowing\nHaving and owning - general words\nMergers & acquisitions\nCinema & theatre: production, direction & recording\nAdd to word list\nAdd to word list\nthe act of obtaining or beginning to have something, or something obtained: [ C ] The museum has made several recent acquisitions. [ U ] The acquisition of a new language requires a commitment of time and effort.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; FINANCE something that is bought by a company, such as another company, a building, or a piece of land: complete/make an acquisition Management intend to use the cash to make acquisitions.finance/fund an acquisition The company will fund the acquisition from its existing cash resources.big/large/major acquisitions If the company doesn't make any big acquisitions this year, it will hand back cash to shareholders. a potential/proposed/recent acquisition Investment banks were changing rapidly into financial supermarkets whose business increasingly revolved around mergers and acquisitions. Compare\nmerger\n[ U ]\n&#160; FINANCE the act of buying something such as a company, a building, or a piece of land: acquisition of sth There were many additional costs related to the company's acquisition of Walker Software. land acquisition A spokesman confirmed that the company was in acquisition talks.\n[ U ] the process of getting something: acquisition of sth System changes will lead to the modification of the project and the acquisition of new resources and skills. Hong Kong manufacturers are meeting the challenge through effective procurement and technology acquisition. Compare\nacquire\nSee also\nbootstrap acquisition\nbust-up takeover\ncustomer acquisition"}