{"id":2764,"name":"acquit","type":"verb","us_sound":"əˈkwɪt","us_link":"../audio/a/acquit.mp3","uk_sound":"əˈkwɪt","uk_link":"../audio/a/ukacqua012.mp3","content":"Add to word list\nAdd to word list\n[ T often passive ] to decide officially in a law court that someone is not guilty of a particular crime: acquit someone of something She was acquitted of all the charges against her.acquit someone on something Five months ago he was acquitted on a shoplifting charge. Compare\nconvict verb\nThesaurus: synonyms, antonyms, and examples\nnot responsible for doing something bad or wronginnocentI don't know if they are innocent or guilty.blamelessShe is not entirely blameless in the matter.guiltlessHe's not exactly guiltless in this matter - she helped the robber escape.acquittedThe two men were acquitted of her murder.exoneratedThe exonerated prisoners banded together and sued the judge who had falsely convicted all of them.\nSee more results »\nacquit yourself formal\nto do better than expected in a difficult situation: I thought that he acquitted himself admirably in today's meeting. If Holmes acquits herself well in today's race, she may earn a place in the national team. The three starting forwards acquitted themselves quite well in last night's game.\nMore examplesFewer examplesWe're not sure how our student actors will acquit themselves.I found the event a struggle and I didn't acquit myself particularly well.His troops acquitted themselves well in the battle.\nSMART Vocabulary: related words and phrases\nInnocent\naccuse\nacquit someone of something\nacquittal\nbe above/beyond reproach idiom\nbe in the clear idiom\nbeat the rap idiom\ncome up/out smelling of roses idiom\nculpability\nculpably\nexculpate\nexculpatory\nguiltlessly\ninculpable\ninnocence\ninnocency\ninnocent\nreproach\nsinless\nsinlessly\nsqueaky-clean\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nacquit verb [T]\n(DECIDE NOT GUILTY)\nAdd to word list\nAdd to word list\nto decide officially in a court of law that someone is not guilty of a particular crime: She was acquitted. The jury acquitted him.\nacquit verb [T]\n(PERFORM)\nfml to cause yourself to perform or behave in the stated way: She acquitted herself well, finishing second."}