{"id":2742,"name":"acquire","type":"verb","us_sound":"əˈkwaɪɚ","us_link":"../audio/a/acquire.mp3","uk_sound":"əˈkwaɪər","uk_link":"../audio/a/ukacqua008.mp3","content":"Add to word list\nAdd to word list\nB2 to get or obtain something: From humble beginnings he went on to acquire great wealth. newly acquired I was wearing a newly acquired jacket.recently acquired The museum will put the recently acquired Picasso on display this spring.seem to have acquired I seem to have acquired (= have got although I don't know how) two copies of this book. Synonyms\nbuy (PAY FOR)\nget (OBTAIN)\nget hold of informal\nobtain (GET) formal\npick something up (BUY)\npurchase formal\nsnap something up informal\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nbusiness\n&#160; specialized to buy a business or property, or buy shares in a business: He acquired the firm in 2008. In 1949 the property was acquired by United Steel Companies. The airline will acquire a 49 percent share of its rival. It took several years to find and acquire the land needed for the project.\nmedia, publishing\n&#160; specialized to buy or obtain the right to sell or publish something, for example the right to publish a particular work or the works of a particular writer: He acquired Winnie the Pooh merchandising rights from A. A. Milne, the author of the children's stories. The book was acquired by Sarah McGill, an editor at Riverdale Books. Warner Bros. acquired the rights to the movie in North America.\nto gradually learn or gain something such as a language or skill: We want to understand more about how children acquire language. The purpose of university is to acquire knowledge and critical thinking skills.acquire a habit With practice, students can acquire better study habits. acquire a reputation He has acquired a reputation for being difficult to work with.acquire a taste for I soon acquired a taste for the local cuisine.\nmedical\n&#160; specialized to develop a medical condition or catch a disease that you were not born with: They develop gene therapy products for the treatment of acquired and inherited diseases. They estimate that millions of patients every year acquire infections while in hospital.\nMore examplesFewer examplesShe acquired the painting at a jumble sale for the princely sum of 25p.When she married Giles, she acquired a ready-made family - two teenage sons and a daughter.As people grow older, their faces acquire more character.To build his market share, he acquired the rights to existing games such as Clue, Sorry and Risk, rather than depending solely on himself to invent new games.I didn't like red wine before but I acquired a taste for it while I was living in France.He acquired a reputation as an entertaining speaker.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquisition\nawardee\ncarve\ncarve something out (for yourself)\ndraw\nearn\nfill\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\ngrantsmanship\nscore\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\nMergers & acquisitions\nCinema & theatre: production, direction & recording\nLearning & knowing\nHaving and owning - general words\nBeing & falling ill\nIdiom\nan acquired taste\nAdd to word list\nAdd to word list\nto obtain or begin to have something: His family acquired the property in 1985. She acquired her love of the outdoors as a child.\nAdd to word list\nAdd to word list\nto buy or take control of a company or part of a company, often by buying shares in it: They acquired a chain of about 20 phone shops.acquire control/ownership of sth He had just acquired control of the New York Times.be acquired by sb/sth Mutual of New York was later acquired by French insurance conglomerate AXA. Many checkout staff acquired shares in the company.\nMARKETING to get the legal right to use or do something: acquire rights to sth The broadcaster did not disclose exactly how it acquired rights to the material.\nto get something that is important to your business: We've acquired a million new customers in a year. It's a good time to acquire new talent.\nWORKPLACE to get something that is important to you in your job: Aptitude tests attempt to judge a person's ability to acquire new skills."}