{"id":3041,"name":"across","type":"adverb","us_sound":"əˈkrɑːs","us_link":"../audio/a/across.mp3","uk_sound":"əˈkrɒs","uk_link":"../audio/a/ukacqua024.mp3","content":"Add to word list\nAdd to word list\nA2 from one side to the other of something with clear limits, such as an area of land, a road, or a river: She walked across the field/road. They're building a new bridge across the river. When I reached the river, I simply swam across.\nMore examplesFewer examplesHe folded his arms across his chest.Her books and clothes were packed into chests and shipped across to Canada.Their hoofs threw up clods of earth as they galloped across the field.On the eastern horizon, a huge cloud of smoke from burning oil tanks stretched across the sky.Quigley clouted me smartly across the side of the head.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\nfront\ngive\ngive onto something\non\nopposite\nother\noverland\nthrough\nthru\nto\ntrans\nunblock\nSee more results »\nGrammar\nAcross, over or through? …\nAcrossWe use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nOverWe use over as a preposition and an adverb to refer to something at a higher position than something else, sometimes involving movement from one side to another: …\nAcross or through? …\nAcross, over and through: typical errors …\nA2 on the opposite side of: The library is just across the road.\nin every part of a particular place or country: Voting took place peacefully across most of the country.\nMore examplesFewer examplesThere is a small wood just across the river.Across the valley, troops were gathering.Across the world, people are praying for peace.My school is just across the road from where I live.His workshop is just across the courtyard.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\nfront\ngive\ngive onto something\non\nopposite\nother\noverland\nthrough\nthru\nto\ntrans\nunblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomewhere, anywhere, nowhere, or everywhere\nGrammar\nAcross, over or through? …\nAcrossWe use across as a preposition (prep) and an adverb (adv). Across means on the other side of something, or from one side to the other of something which has sides or limits such as a city, road or river: …\nOverWe use over as a preposition and an adverb to refer to something at a higher position than something else, sometimes involving movement from one side to another: …\nAcross or through? …\nAcross, over and through: typical errors …\nAdd to word list\nAdd to word list\nfrom one side to the other side of, or at the other side of: We walked across the bridge. She was sitting across the aisle. He opened a store across the street from the theater. Over 300,000 refugees fled across the border.\nIf something is happening across the country, it is happening in all parts of the country."}