{"id":3076,"name":"act","type":"verb","us_sound":"ækt","us_link":"../audio/a/act.mp3","uk_sound":"ækt","uk_link":"../audio/a/ukacqua027.mp3","content":"act verb\n(BEHAVE)\nAdd to word list\nAdd to word list\n[ I ] to behave in the stated way: act like Don't be so silly - you're acting like a child! He acted as if he'd never met me before.\nThesaurus: synonyms, antonyms, and examples\nto behavebehaveThe kids behaved well at grandma’s yesterday.behavePeople behave differently when they can provide feedback anonymously.actTwo men were acting suspiciously in the car park.conduct yourselfCaptain Bingham has conducted himself in a manner unbecoming to an officer.comport yourselfShe comported herself with great dignity at her husband's funeral.\nSee more results »\nMore examplesFewer examplesWhen he saw the crash, the young boy acted very responsibly and called the police.Try to act confidently, even if you feel nervous.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nact verb\n(DO SOMETHING)\nB2 [ I ] to do something for a particular purpose or to solve a problem: [ + to infinitive ] Engineers acted quickly to repair the damaged pipes.act for Who is acting for the defendant?act on behalf of The agent was acting on behalf of (= representing) her client, a Broadway actress. She acted without thinking.\nThesaurus: synonyms, antonyms, and examples\nto take actiontake actionIt may already be too late to take action to prevent the loss of habitat these animals face.actThey need to act decisively to prevent further damage to crops.take measuresWe call on the government to take the necessary measures to bring to justice those responsible for this attack.take stepsThe authorities have taken steps to prevent any reoccurrence of the problem. do somethingIt's about time the government did something about it.\nSee more results »\nMore examplesFewer examplesYou'll have to act fast or you will lose your chance.It's very important to act now before the problem gets really serious.The court decided that the companies acted illegally.Despite what you think, I'm only acting in your best interests .\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nact verb\n(HAVE AN EFFECT)\n[ I ] to have an effect: The anaesthetic acted quickly.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nact verb\n(PERFORM)\nB1 [ I or T ] to perform a part in a film, play, etc.: Ellis Pike was chosen to act the part of the lawyer in the film. Have you ever acted in a play before? act the fool, martyr, etc.\nto behave in a particular, usually bad, way: Why are you always acting the fool?\nSee more\nMore examplesFewer examplesThe whole play was appallingly acted.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappearance\nblocking\ncamp\ncamp it up\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nPhrasal verbs\nact as something\nact on something\nact out\nact something out\nact up\nact noun\n(THING DONE)\nB2 [ C ] something that you do: an act of aggression/bravery/madness/terrorismsimple act The simple act of telling someone about a problem can help. a kind/thoughtless/selfish act artistic representations of the sexual act\nThesaurus: synonyms, antonyms, and examples\nyour actionsactionYou should take responsibility for your own actions.actThis was considered to be an act of war.thingThat’s the last thing you should be doing if you’re pregnant.activityNot all of her business activities were scrupulously clean. moveApplying for that job was a good move.deedTheir evil deeds must not go unpunished.\nSee more results »\nMore examplesFewer examplesHis murder was an outrageous and barbarous act.The word 'flight' has two different meanings: a plane journey, and the act of running away.The law specifically forbids acts of this kind.The George Cross is awarded to British civilians for acts of great bravery.It was an act of extraordinary irresponsibility to leave someone who wasn't properly trained in charge of the machine.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nact noun\n(PERFORMANCE)\nC2 [ S ] behaviour that hides your real feelings or intentions: Was she really upset or was that just an act?\n[ C ] a person or group that performs a short piece in a show, or the piece that they perform: a comedy/juggling/trapeze act Our next act is a very talented young musician.\nB1 [ C ] a part of a play or opera: Shakespeare's plays were written in five acts. The hero does not enter until the second act/Act Two.\nMore examplesFewer examplesThe main characters are offstage for most of the second act.The best part of his stage act was a brilliant Elvis Presley impression.I saw the worst comedy act I've ever seen last night - it was absolutely dreadful!He put on an act of bravery, but I know that he was absolutely terrified.They may seem to be very polite and friendly, but it's only an act.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse\nfalse modesty\nfalsifiable\nfalsify\nmountebank\nout-bluff\npass something off as something\nphoney\nphony-baloney\nprofessed\npurport\nquackery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: actors & performers\nSpectacles & performances\nCinema & theatre: parts of plays, shows & films\nact noun\n(LAW)\n[ C ]\n&#160; law\n&#160; specialized a law or formal decision made by a parliament or other group of people who make the laws for their country: an Act of Parliament the Betting and Gaming Act Almost two hundred suspects were detained in the UK last year under the Prevention of Terrorism Act. The state legislature passed an act banning the sale of automatic weapons.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nIdioms\nact of God\nbe a hard/tough act to follow\ndo a disappearing/vanishing act\nget your act together\nget/muscle in on the act\nput on an act\nact verb\n(DO SOMETHING)\nAdd to word list\nAdd to word list\n[ I ] to do something for a particular purpose or in a particular way: [ + to infinitive ] The president acted quickly to bring federal aid to areas damaged by flooding. She acted responsibly. He acted as if he’d never seen me before. She acted as (= performed in the position of) a tour guide for the group. He said he was acting on (= doing something as a result of) the advice of his lawyer.\nact verb\n(PERFORM)\n[ I/T ] to perform in a movie, play, or television show: [ T ] He acts the part of a small-town lawyer. [ I ] She has acted in lots of television sitcoms. Idiom\nact your agePhrasal verbs\nact out\nact up\nact up\nact up\nact noun [C]\n(LAW)\nlaw a law made by Congress or another legislature: an act of Congress\nact noun [C]\n(PERFORM)\none of a set of short performances that are parts of a show, or the person or group who performs one of these parts: a circus act fig. His story is just an act (= is pretended and not sincere).\nAn act is also one of the main parts of a play or opera: The play is presented in three acts.\nAdd to word list\nAdd to word list\n[ C ] something that someone does: A partner may be held responsible for the acts of his co-partners committed in the name of the firm. He has led an investigation into stock market manipulation and various illegal acts and swindles. See also\naction noun\n[ C ]\n&#160; LAW\n&#160; (also Act) a law or formal decision made by a parliament or other group of elected law-makers: The 2010 act, with its requirement for a review of financial controls, has helped drive up the cost of corporate audits by as much as 50%.\nbe a hard/tough act to follow informal\nto be so good that it is unlikely that anyone or anything that comes after will be as good: The company could lose momentum without its chief executive, who will be a hard act to follow.\nget in on the act informal mainly UK ( US get into the act)\nto take advantage of or become involved with something that someone else started: There's always a debate in the machine room about the product, long before the marketing men and editors get in on the act.\nget your act together informal\nto organize yourself so that you do things in an effective way: Mr Dinsdale said it was crucial that the Department of Trade &amp; Industry got its act together. See also\nconsolidating act\nto do something with the intention of achieving a particular result: act to do sth Engineers will need to act quickly to repair the damaged pipes.act quickly/swiftly/now Anyone who wants a fixed-rate deal should act now.act decisively/improperly/responsibly It is now time for management to act decisively.act against/in sb's interests There were claims that the management was acting against shareholders' interests. Members should act in the best interests of the company.\nact in good faith\nto do something believing that it is the right thing to do: Although errors of judgement were made, at all times the company's staff acted in good faith. Phrasal verbs\nact as sth\nact for/on behalf of sb/sth\nact on sth"}