{"id":3269,"name":"activity","type":"noun","us_sound":"ækˈtɪv.ə.t̬i","us_link":"../audio/a/eus70064.mp3","uk_sound":"ækˈtɪv.ə.ti","uk_link":"../audio/a/ukactiv007.mp3","content":"activity noun\n(MOVEMENT)\nAdd to word list\nAdd to word list\nB2 [ U ] the situation in which a lot of things are happening or people are moving around: economic activity Economists are concerned by the low level of economic activity.business activity Experts predict that this could depress business activity for years.flurry of activity There was a sudden flurry of activity when the director walked in. There was a lot of activity in preparation for the Queen's visit.\nThesaurus: synonyms, antonyms, and examples\nactivityactivityThere were several police vans and a lot of activity in the area.hubbubI couldn't find her with all the hubbub going on.bustleI miss the bustle of the big city.hustle and bustleShe got used to the hustle and bustle of daily life.flurry of activityWhat was the reason behind this sudden flurry of activity?burst of activityIt's usually quiet in the shop, but occasionally we have a sudden burst of activity.\nSee more results »\nMore examplesFewer examplesThe house, usually bustling with activity, was strangely silent.There is increased volcanic activity in the region.Have you seen the feverish activity in the kitchen?The house was a hive of activity on the day before the wedding.After a sudden burst of activity, the team seemed to run out of energy again.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nactivity noun\n(WORK)\nB2 [ C or U ] the work of a group or organization to achieve an aim: He was found guilty of terrorist activity. criminal activities\nThesaurus: synonyms, antonyms, and examples\nyour actionsactionYou should take responsibility for your own actions.actThis was considered to be an act of war.thingThat’s the last thing you should be doing if you’re pregnant.activityNot all of her business activities were scrupulously clean. moveApplying for that job was a good move.deedTheir evil deeds must not go unpunished.\nSee more results »\nMore examplesFewer examplesAfter weeks of frenetic activity, the job was finally finished.Textbook writing can be an intellectually and financially rewarding activity.There was a sudden spurt of activity in the housing market.There has been a lot of criminal activity in the town lately.He was imprisoned for his terrorist activities.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nactivity noun\n(ENJOYMENT)\nA2 [ C usually plural ] something that is done for enjoyment, especially an organized event: His spare-time activities include cooking, tennis, and windsurfing. We offer our guests a wide range of outdoor/sporting activities.\nMore examplesFewer examplesThese activities should be available to all pupils, not just a select few.She does a variety of fitness activities.Hostile feelings and violent responses often seem to be sublimated into sporting activities.indoor activitiesleisure activities\nSMART Vocabulary: related words and phrases\nPastimes - general words\namusement\navocation\navocational\navocationally\ncaper\nfrolic\ngame\nhobby\ninterest\nleisure\nnonprofessional\nnonprofessionally\npastime\npursuit\nrec\nrecreate\nrecreation\nrecreational\nrecreationist\nrelaxation\nAdd to word list\nAdd to word list\nthe doing of something, or something that you are doing, have done, or could do: [ C ] There were lots of activities for children at the museum. [ C ] Her favorite activity is visiting antique shops. [ U ] Carbon dioxide is also produced by human activity.\nAdd to word list\nAdd to word list\n[ U ] a situation in which a lot of things are happening or being done: business/commercial/economic activity Any conflict has the potential to disrupt business activity. manufacturing/marketing/trading activityboost/increase activity This package of tax cuts and spending increases is designed to boost economic activity over the next year. The increased level of activity in our principal markets flattened out during the first half of this year.\n[ C, usually singular ] the work of a person, group, or organization to achieve something, especially to make money: The company's activities stretch from Australia to the US. We invest primarily in companies which have their principal business activities in the Pacific Basin. manufacturing/marketing/management activities"}