{"id":3258,"name":"active","type":"adjective","us_sound":"ˈæk.tɪv","us_link":"../audio/a/active.mp3","uk_sound":"ˈæk.tɪv","uk_link":"../audio/a/ukactiv003.mp3","content":"active adjective\n(BUSY)\nAdd to word list\nAdd to word list\nB1 busy with a particular activity: remain active He is 90 years old, but remains active in the local community.stay active The goal of our organization is to make sure that people stay active.keep active You have to try to keep active as you grow older. physically/mentally active\nThesaurus: synonyms, antonyms, and examples\nhaving a lot to dobusyI was busy clearing out the shed.up to your ears in somethingI'm up to my ears in chores!up to your eyeballs in somethingDon't bother her - she's up to her eyeballs in paperwork.up to your eyes in somethingI'm up to my eyes in work at the moment.up to your neck in somethingI can't help, I'm up to my neck in schoolwork.have your hands fullI have my hands full with the kids at the moment, so I can't take on any more work.\nSee more results »\nMore examplesFewer examplesIt's good for old people to stay active if they can.I had an active social life when I was at college.At 84 he's still quite active, although he walks with the aid of a stick.It was a very active day on the stock market today.\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetic\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nplate\nrev\nrun round\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nSee more results »\nactive adjective\n(INVOLVED)\nB2 involved in a particular activity: active in She's very active in (= involved in) local politics. Enemy forces remain active in the mountainous areas around the city.politically active Both of his parents were very politically active.sexually active It is important to educate children before they become sexually active.take an active role in He takes an active role in the team nowadays.play an active role in The family plays an active role in the local community.active member She's an active member of her trade union (= not only belongs to it, but does work to help it).\nMore examplesFewer examplesThey both play an active part in their local church.\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetic\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nplate\nrev\nrun round\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nSee more results »\nactive adjective\n(VOLCANO)\nC1 An active volcano is one that might erupt (= throw out hot liquid rock or other matter) at any time.\nSMART Vocabulary: related words and phrases\nGeology: earthquakes & volcanic eruptions\naftershock\ncrater\nfault line\ngeyser\nlahar\nmagma\nnon-volcanic\nphreatic\npyroclastic\nquake\nseismically\nseismograph\nshock wave\ntectonically\ntemblor\nthe Richter scale\ntremor\nvolcanic\nvolcano\nvulcanicity\nSee more results »\nactive adjective\n(GRAMMAR)\nB1 language An active verb or sentence is one in which the subject is the person or thing that performs the stated action: \"Catrin told me\" is an active sentence, and \"I was told by Catrin\" is passive. Compare\npassive adjective\nMore examplesFewer examplesWhen you use active verbs in your written work, rather than passive ones, it sounds clearer and more direct.Active sentences, such as 'The dog chased the cat', are more concise than passive sentences like 'The cat was chased by the dog'.Speechwriters should use active verbs for a strong, direct style.The sentence 'Oranges contain vitamin C' uses an active verb.In the sentence 'A thief stole my wallet', the verb is active and in the past simple tense.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nGrammar\nWord order and focusThere are a number of ways in which we can arrange subjects, verbs, objects, complements and adjuncts within a clause. Depending on how we arrange them, we can focus on certain elements over others, especially if we arrange them in an unusual way. …\nWord order: structuresThere are a number of options which we can use to add emphasis or focus within a clause. …\nIndirect object versus prepositional complementWhen we talk about someone receiving something, we can express it using the typical word order: indirect object (io) + direct object (do). …\nActive and passive voiceActive voice is the typical word order. That is when we put the subject (the doer) first, followed by the new information (which is the focus): …\nCleft sentencesCleft means ‘divided’ and in a cleft sentence a single message is divided across two clauses. We use cleft sentences, especially in speaking, to connect what is already understood to what is new to the listener. By doing this we can focus on the new information. There are different types of cleft sentence. …\nthe active\n→\nthe active voice\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nactive adjective\n(DOING SOMETHING)\nAdd to word list\nAdd to word list\ndoing something as you usually do, or being able to do something physically or mentally: He was still an active runner at 55. She’s active in state politics (= involved in it). She intends to remain politically active. His National Guard unit was put on active duty (= made part of the regular fighting force).\nAn active volcano is one that might begin to throw out hot gases, liquid, or rocks at any time.\nactive adjective\n(GRAMMAR)\n[ not gradable ]\n&#160; grammar describing a verb or sentence in which the subject is the person or thing that does what is stated: In \"Alex gave me a gift,\" the verb \"give\" is active, and in \"I was given a gift by Alex,\" \"give\" is passive. actively adverb us\nYour browser doesn't support HTML5 audio\n/ˈæk·tɪv·li/\nHe isn’t actively involved in the day-to-day management of the business anymore.\nAdd to word list\nAdd to word list\nbusy with or involved in a particular activity: active in sth He expects to remain active in commodity trading in London. She claims to be active in almost every aspect of her business.\ndoing something practical rather than allowing a situation to develop by itself: an active member/participant He has been an active member of the Executive Committee since 2004.an active part/role Employees who take an active part in the project feel more involved and more responsible about the results. active participation/interventionactive in sth We would expect countries whose firms are highly globalized to be more active in adopting e-commerce. See also\nproactive\nFINANCE involving a lot of buying and selling of shares, etc.: active buying/trading Trading was most active in five-year maturities. The session was active early, but volume dropped off after midday. This made Intel the second-most active stock in U.S. trading.\nused to describe a company that is selling goods and services or doing business, especially in a particular place: Whitbread was especially active but several other brewers were also buying at the rate of 20 or 30 a year.be active in sth The company is active in a wide range of businesses, including oil, chemicals, and construction. Over the last ten years, the company has become active in Europe.\nworking or being used at a particular time: active accounts/cardholders/customers The company has more than one million active cardholders, with about 44% of all group sales being made through the card. active employees/members The organization releases a weekly survey of the number of active oil and gas drilling rigs in the U.S. and Canada.\nIT relating to programs, etc. that are being used at a particular time: Click the associated tab in a bar running across the screen, and the selected page opens in the active window."}