{"id":3232,"name":"action","type":"noun","us_sound":"ˈæk.ʃən","us_link":"../audio/a/action.mp3","uk_sound":"ˈæk.ʃən","uk_link":"../audio/a/ukacqua029.mp3","content":"action noun\n(DOING SOMETHING)\nAdd to word list\nAdd to word list\nB2 [ U ] the process of doing something, especially when dealing with a problem or difficulty: This problem calls for swift/prompt action from the government. [ + to infinitive ] Action to prevent the spread of the disease is high on the government's agenda.plan of action So what's the plan of action? (= What are we going to do?)swing into action The complaints system swings into action (= starts to work) as soon as a claim is made.take action We must take action (= do something) to deal with the problem before it spreads to other areas. The committee was spurred into action (= encouraged to do something) by the threat of government cuts.\nThesaurus: synonyms, antonyms, and examples\nnecessary actionactionThey are considering legal action.course of actionThey have not yet decided on a particular course of action.measureMeasures are in place to prevent flooding.stepThese simple steps will ensure that infections are not spread.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take actiontake actionIt may already be too late to take action to prevent the loss of habitat these animals face.actThey need to act decisively to prevent further damage to crops.take measuresWe call on the government to take the necessary measures to bring to justice those responsible for this attack.take stepsThe authorities have taken steps to prevent any reoccurrence of the problem. do somethingIt's about time the government did something about it.\nSee more results »\nMore examplesFewer examplesThe government is supporting military action.The richer countries of the world must take action to help the poorer countries.I hope these arguments have convinced you of the need for action.The army are said to be ready for action.It is clear that most women supported this action, from the results of the opinion poll.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\naction noun\n(SOMETHING DONE)\nB2 [ C ] something that you do: She has to accept the consequences of her actions. I asked him to explain his actions.\nThesaurus: synonyms, antonyms, and examples\nyour actionsactionYou should take responsibility for your own actions.actThis was considered to be an act of war.thingThat’s the last thing you should be doing if you’re pregnant.activityNot all of her business activities were scrupulously clean. moveApplying for that job was a good move.deedTheir evil deeds must not go unpunished.\nSee more results »\nC2 [ C ] a physical movement: I'll say the words and you can mime the actions. It only needs a small wrist action (= movement of the wrist) to start the process.\nMore examplesFewer examplesShe wrote an angry letter to the paper complaining about the council's action.The four soldiers received medals for their brave actions.The defendant was depressed and therefore not fully responsible for her own actions.We will not allow the violent actions of terrorists to change our way of life.I'm sorry I punched him - it was a reflex action.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\naction noun\n(ACTIVITY)\nB1 [ U ] things that are happening, especially exciting or important things: I like movies with a lot of action. In her last novel, the action (= the main events) moves between Greece and southern Spain.\nThesaurus: synonyms, antonyms, and examples\nactivityactivityThere were several police vans and a lot of activity in the area.hubbubI couldn't find her with all the hubbub going on.bustleI miss the bustle of the big city.hustle and bustleShe got used to the hustle and bustle of daily life.flurry of activityWhat was the reason behind this sudden flurry of activity?burst of activityIt's usually quiet in the shop, but occasionally we have a sudden burst of activity.\nSee more results »\n[ U ] a style of film in which a lot of exciting and often violent things happen: His filmmaking style blends action, horror, and comedy. The action genre is often assumed to appeal more to men. See also\naction movie where the action is\nat the place where something important or interesting is happening: A journalist has to be where the action is.\nSee more\nMore examplesFewer examplesThe movie provides plenty of thrilling action while delivering a political message.At various points in the play, the action tips from comedy into farce.Her latest film is the staple offering of action and comedy which we have come to expect.I never expected to be involved in the action genre where I'd be dodging explosions and jumping out of speeding cars.She landed a part in a multi-million pound action thriller and made the Hollywood A list.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nproceedings\nreoccurrence\nsaga\nspree\nsynchronicity\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nCinema ratings & types of film\naction noun\n(EFFECT)\n[ S ] the effect something has on another thing: They recorded the action of the drug on the nervous system.\nMore examplesFewer examplesAccumulations of sand can be formed by the action of waves on coastal beaches.The action of market forces means that the cost of something rises if demand for it rises and the amount available remains constant.His many years of research made him an expert on the action of snake venom.The distinctive landscape has been formed by the action of running water on the limestone.The project will study the action of various drugs on the human body.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\ncorollary\nend result\nfallout\nfirst fruit\nimplication\nin\nirony\nramification\nrepercussion\nresultant\nresultantly\nresulting\nsequel\nside effect\néclat\nSee more results »\naction noun\n(WAR)\nC2 [ U ] fighting in a war: see action He saw action in the trenches. Her younger son was killed in action. missing in action\nA soldier or other member of the armed forces who is missing in action cannot be found after a battle or other military action, so it is not possible to say if they are dead or alive. : He was reported missing in action.\nSee more\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\naction noun\n(WAY THING WORKS)\nC2 [ U or C ] the way something moves or works: We studied the action of the digestive system. The car has a very smooth braking action.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\naction noun\n(LEGAL PROCESS)\nC1 [ C or U ]\n&#160; law\n&#160; specialized a legal process that is decided in a law court: bring an action She brought an action (for negligence) against the hospital. The book was halted in South Africa by a threat of legal action. a libel action A criminal action was brought against him.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nIdioms\nactions speak louder than words\nout of action\na man/woman of action\na piece/slice of the action\nto do something to deal with a particular problem or matter: I'll just run through the minutes of the last meeting, raising those points that still have to be actioned.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\naction noun [C/U]\n(SOMETHING DONE)\nAdd to word list\nAdd to word list\nthe process of doing something, or something done, esp. for a particular purpose: [ U ] Quick action in calling the fire department saved many lives. [ C ] It was a reckless action which he later came to regret. [ + to infinitive ] We want a leader who will take action to fix our problems. [ U ] Financial advisers urged the city to take action (= do something) to deal with the fiscal crisis.\nAction is also fighting in a war: [ U ] Her younger son was killed in action.\nIn an action film/movie, there is usually a lot of violence and many exciting things happen.\naction noun [C/U]\n(MOVEMENT)\nthe way something moves or works, or the effect it has on something else: [ C ] The heart’s action in regulating blood flow is critically important.\naction noun [C/U]\n(LEGAL PROCESS)\nlaw a process in a court of law to correct a wrong by which a person or group claims to have been hurt: [ C ] She brought an action against the hospital for negligence.\nIdiom\nactions speak louder than words\nAdd to word list\nAdd to word list\n[ U ] the process of doing something, especially in order to deal with a problem or difficult situation: take action (to do sth) The report urged industrialised nations to take further action to cut their budget deficits.action on sth Campaigners say more action is needed on climate change.call/press for action Unions are pressing for action on the pay dispute. decisive/drastic/prompt action The committee was spurred into action by the threat of government cuts. You need to clearly outline a specific course of action in your business plan.\n[ C ] something that you do, especially in order to deal with a problem or difficult situation: Industry analysts said the company's actions cannot control market prices. He said that employees must be held accountable for their actions.\n[ U ]\n&#160; STOCK MARKET, FINANCE important things that are happening in a market, etc.: Fund managers let themselves be carried away by the favorable market action of the shares.\n[ C or U ]\n&#160; LAW a legal process that is decided in a court of law: civil/court/legal action He threatened legal action to recover the property.bring an action against sb/sth The purchaser could have brought an action against the vendor under section 12 of the Sale of Goods Act.\nput sth into action\nto begin working to make an idea or a plan happen or be successful: We need to put these plans into action in measurable ways, so that employees regain a sense of control over their lives.\nan action plan/a plan of action\na way of dealing with a problem or difficult situation, or achieving something: The Board will devise an action plan to address the problems at the plant.\na piece/slice of the action informal\ninvolvement in something successful that someone else has started: It's one thing to be a staff attorney and quite another to be an equity partner getting a piece of the action. See also\naffirmative action\nclass action\ndirect action\ndisciplinary action\ngroup action\nindustrial action\njob action\npersonal action\nprimary action\nright of action\nView all\nsecondary action\nstrike action\nto do something to deal with a particular task, problem, or plan: Some of the conclusions and recommendations of the report can be actioned straight away."}