{"id":3277,"name":"actor","type":"noun","us_sound":"ˈæk.tɚ","us_link":"../audio/a/actor.mp3","uk_sound":"ˈæk.tər","uk_link":"../audio/a/ukactiv008.mp3","content":"actor noun [C]\n(IN THEATRE, FILM, ETC.)\nAdd to word list\nAdd to word list\nA2 someone who pretends to be someone else while performing in a film, play, or television or radio programme: \"Who's your favourite actor?\" \"Robert de Niro.\" She is one of the most versatile actors working today. Synonym\nthespian formalCompare\nactress\nThesaurus: synonyms, antonyms, and examples\nan actoractorHe is a celebrated Hollywood actor.actressLet’s take a closer look at this year's Academy Award nominees for Best Actress in a Leading Role.playerThey belong to the Littlehampton Players.thespianIt is a Saturday-morning acting group for budding thespians.luvvyThe luvvies were out in force for the awards ceremony.\nSee more results »\nMore examplesFewer examplesAs an actor he could communicate a whole range of emotions.Tributes have been pouring in from all over the world for the famous actor who died yesterday.Hamlet was played by Romania's leading actor, Ion Caramitrou.He made his reputation as an actor playing villains.\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactress\nall-star\nalum\nbelly dancer\nbill\nbody double\ncast\nchorus\nimproviser\njuvenile lead\nleading lady\nleading man\nluvvy\nperformer\nspear carrier\nstage name\nstarlet\nstooge\nstraight man\nsuperstar\nSee more results »\nactor noun [C]\n(DOING STH)\na person or an organization that is involved in politics, society, etc. in some way because of their actions: International law recognizes that a state can engage in armed conflict against a non-state actor. Business must work with government and with all other actors in society to be part of the solution to climate change. See also\nbad actor\nMore examplesFewer examplesChildren are social actors in their own right, who make their own social, economic, and cultural contribution.He wrote that the church should not be a political actor.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nall in\nalong\nattendee\nbe (a) party to something idiom\nbe all over it idiom\ncatch\nconcern\nengagement\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nimmersion\nmuscle\nneck\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nre-engagement\nSee more results »\nactor noun [C]\n(PERFORM)\nAdd to word list\nAdd to word list\na person who plays the part of a character in a movie or play: The play has a cast of six actors."}