{"id":3288,"name":"actual","type":"adjective","us_sound":"ˈæk.tʃu.əl","us_link":"../audio/a/actual.mp3","uk_sound":"ˈæk.tʃu.əl","uk_link":"../audio/a/ukactiv009.mp3","content":"Add to word list\nAdd to word list\nB2 existing in fact: We had estimated about 300 visitors, but the actual number was much higher. The exams are in July, but the actual results (= the results themselves) don't appear until September. Synonym\nreal (NOT IMAGINARY)\nThesaurus: synonyms, antonyms, and examples\nexisting in factrealHe doesn't think climate change is real.trueHe had finally found true love.actualWe had 500 people register for the conference, but we won't have the actual number of attendees until afterwards.factualThere's no factual information at all in that email.\nSee more results »\nin actual fact\nB2 really: I thought she was Portuguese, but in actual fact she's Brazilian.\nSee more\nMore examplesFewer examplesI often prefer the ads on TV to the actual programmes.The documentary was a misrepresentation of the truth and bore little resemblance to actual events.The actual signing of the treaty was a downbeat affair without any ceremony.Their predictions were hopelessly out of line with the actual results.He said he went to Florida for medical treatment, but in actual fact he was trying to escape from the British police.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactuality\nactually\nall that glitters is not gold idiom\nanger\napocryphal\nfalsely\nfantastical\nfever dream\nfictional\nfictionality\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nGrammar\nActual and actuallyActual is an adjective meaning ‘true’, ‘real’ and ‘the thing in itself’. It does not refer to time. Actual always comes immediately before the noun it is describing: …\nActualActual is an adjective meaning ‘true’, ‘real’ and ‘the thing in itself’. It does not refer to time. Actual always comes immediately before the noun it is describing: …\nActually as a discourse markerActually is often used in speaking as a discourse marker. We use it to indicate a new topic of conversation or a change or contrast in what is being talked about. We also use actually to give more detail about a topic. We do not use it to refer to time: …\nActually as contrastWe can use actually to emphasise a contrast with what is expected to be true or real: …\nActual and actually: typical errorsIn some languages actual has the meaning of ‘current’ and ‘at the present time’. This is not correct in English: …\nIdiom\nwhat the actual fuck?\nAdd to word list\nAdd to word list\nreal; existing in fact: We expected 50 people, but the actual number was a lot higher.\nAdd to word list\nAdd to word list\ntrue or exact: actual amount/cost/figure Residents are paying electricity prices that are double the actual cost of generating electricity. There is a gap between desired and actual performance. actual sales/results\nreal, rather than part of an idea or plan: He's had a lot of interviews, but never had an actual job.\nINTERNET real, not on the internet: The actual stores offer local convenience while the virtual stores offer variety for shoppers.\nACCOUNTING an amount of money that a company really spends, rather than an amount of money that it plans or expects to spend: We continuously compare budgeted amounts with actuals.\nSTOCK MARKET something that physically exists such as oil, metal, grain, or coffee that is traded on the stock market: Transactions can be trade in actuals or by means of futures contracts. See also\ncash commodity"}