{"id":3303,"name":"actually","type":"adverb","us_sound":"ˈæk.tʃu.ə.li","us_link":"../audio/a/actually.mp3","uk_sound":"ˈæk.tʃu.ə.li","uk_link":"../audio/a/ukactiv012.mp3","content":"actually adverb\n(IN FACT)\nAdd to word list\nAdd to word list\nA2 in fact or really: I didn't actually see her - I just heard her voice. So what actually happened?\nMore examplesFewer examplesThere seems to be some confusion over who is actually giving the talk.I didn't actually want any more dessert, but Julia forced it on me .I looked through the window, but I didn't actually go in.They suspected that she'd killed him but they could never actually prove that it was her.It's unclear what actually happened that night.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nall that glitters is not gold idiom\nanger\napocryphal\nfalsely\nfantastical\nfever dream\nfictional\nfictionality\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nactually adverb\n(SURPRISE)\nB1 used in sentences in which there is information that is in some way surprising or the opposite of what most people would expect: I didn't like him at first, but in the end I actually got quite fond of him. I'm one of the few people who doesn't actually like champagne.humorous Don't tell me he actually paid for you!\nMore examplesFewer examplesIt really gets me the way we're expectedhe expects us to actually laugh at his pathetic jokes!You actually like modern jazz, do you? Each to their own.I didn't actually want any more dessert, but Julia forced it on me.Peter might look a bit fierce, but actually he's fairly harmless.She appears to actually like the man, which I find incredible.\nSMART Vocabulary: related words and phrases\nExpressions of surprise\naccha\nachha\nay\nbegorrah\nbejabbers\nblow\nfancy\nglory\nheaven\nhell's bells\nhold on idiom\nhow about that? idiom\nI ask you! idiom\nI can't even idiom\nsagebrush\nsheesh\nshit\nshock, horror! idiom\nshut\nshut the front door! idiom\nSee more results »\nactually adverb\n(SAYING NO)\nB2 used as a way of making a sentence slightly more polite, for example when you are expressing an opposing opinion, correcting what someone else has said, or refusing an offer: \"Alexander looks like he'd be good at sports.\" \"Actually, he's not.\" Actually, Gavin, it was Tuesday of last week, not Wednesday. \"Do you mind if I smoke?\" \"Well, actually, I'd rather you didn't.\"\nMore examplesFewer examplesI wouldn't mind something to eat, actually.I'd like a cup of coffee, please - actually, on second thoughts, I'll have a beer.\"Did your American friends enjoy their stay?\" \"Yes. Actually, they're Canadian.\"\"Mark's coming today to look at the books.\" \"Actually, it's tomorrow.\"\"You must be exhausted after that long journey.\" \"Actually, I feel fine.\"\nSMART Vocabulary: related words and phrases\nPolite expressions\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\ncould\ndisrespect\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\noffence\npardon\npardon (me) idiom\nproblem\nsay\nwelcome\nwould\nyou're welcome idiom\nSee more results »\nGrammar\nActual and actuallyActual is an adjective meaning ‘true’, ‘real’ and ‘the thing in itself’. It does not refer to time. Actual always comes immediately before the noun it is describing: …\nActualActual is an adjective meaning ‘true’, ‘real’ and ‘the thing in itself’. It does not refer to time. Actual always comes immediately before the noun it is describing: …\nActually as a discourse markerActually is often used in speaking as a discourse marker. We use it to indicate a new topic of conversation or a change or contrast in what is being talked about. We also use actually to give more detail about a topic. We do not use it to refer to time: …\nActually as contrastWe can use actually to emphasise a contrast with what is expected to be true or real: …\nActual and actually: typical errorsIn some languages actual has the meaning of ‘current’ and ‘at the present time’. This is not correct in English: …\nIdiom\ndo you/did you/does he, etc. actually?\nAdd to word list\nAdd to word list\nused to say that something is true, esp. when the true situation may not be known: We actually had a hard time moving the sofa.\nActually is often used when you want to emphasize that something is surprising or unusual: He actually expected me to pay for his dinner."}