{"id":3458,"name":"adapt","type":"verb","us_sound":"əˈdæpt","us_link":"../audio/a/adapt.mp3","uk_sound":"əˈdæpt","uk_link":"../audio/a/ukactiv029.mp3","content":"Add to word list\nAdd to word list\nB2 [ T ] to change, or to change something, to suit different conditions or uses: adapt something for something Davies is busy adapting Brinkworth's latest novel for television. The play had been adapted for (= changed to make it suitable for) children.adapt from The recipe here is a pork roast adapted from Caroline O'Neill's book \"Louisiana Kitchen\". Many software companies have adapted popular programs to the new operating system. [ + to infinitive ] We had to adapt our plans to fit Jack's timetable.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nB2 [ I ] to change your ideas or behaviour to make them suitable for a new situation: adapt to The good thing about children is that they adapt very easily to new environments. It took me a while to adapt to the new job.\n[ I ]\n&#160; biology\n&#160; specialized If a living thing adapts, it changes slightly over time so it can continue to exist in a particular environment: adapt to Species have adapted to climate changes throughout history. The ways in which organisms have adapted to survive in this extreme environment are not well understood.\nMore examplesFewer examplesTo remain competitive the company has to be able to adapt to the changing marketplace.We live in a changing world and people must learn to adapt.The two cultures were so utterly disparate that she found it hard to adapt from one to the other.The novel has been adapted for screen by a famous Hollywood director.The best-selling computer game has been adapted for a younger audience.His best asset is his ability to adapt quickly.Once in the body, these bacteria adapt to the environment and develop resistance to commonly used antibiotics.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\nflex\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nRelated word\nadapted\nAdd to word list\nAdd to word list\nto adjust to different conditions or uses, or to change to meet different situations\nAdd to word list\nAdd to word list\n[ I ] to become familiar with a new situation: adapt to sth To remain competitive the company has to be able to adapt to the changing marketplace. adapt to doing sth Dick has adapted very well to running a multinational.\n[ T ] to change something to suit different conditions or uses: Sometimes you have to adapt the design to suit the customer's requirements.adapt sth for sth It was the first time a British brewer had adapted a product for French tastes. adapted adjective\nThis adapted procedure was problematic in many ways."}