{"id":3478,"name":"adaptive","type":"adjective","us_sound":"əˈdæp.tɪv","us_link":"../audio/a/usacqui018.mp3","uk_sound":"əˈdæp.tɪv","uk_link":"../audio/a/ukadapt004.mp3","content":"Add to word list\nAdd to word list\nhaving an ability to change to suit changing conditions: We teach our clients to run projects in an adaptive manner. Effective leaders need to be highly adaptive.\nbiology\n&#160; specialized relating to the way that a living thing changes slightly over time so it can continue to exist in a particular environment: A plant physiologist, she observes the capacity of plants for adaptive behaviour. adaptive responses to environmental challenges\nMore examplesFewer examplesThe vehicle's radar system includes collision warning and adaptive cruise control.The speaker shared his insights on nurturing a new generation of adaptive innovators. He warned that the organization remains \"a determined, adaptive, resilient enemy\".T-cells are part of our adaptive immune system that seek and destroy previously-encountered pathogens.Antibiotics can destroy both good and bad bacteria, ultimately weakening our immune system and making pathogenic bacteria more adaptive and difficult to cure.There is a theory that phobias are a result of evolution – a malfunction of adaptive response.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\nflex\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nAdd to word list\nAdd to word list\nable to adjust: These governments do not possess the adaptive capacity to endure such changes.\nbiology able to adjust to the conditions of a particular environment\nAdd to word list\nAdd to word list\nchanging quickly to suit different conditions: Adaptive organizations rely on fast feedback from customers to respond to market changes. Their favoured approach seems to be adaptive management, in which policymakers alter their policies as conditions change. adaptive processes/systems/strategies"}