{"id":3507,"name":"add","type":"verb","us_sound":"æd","us_link":"../audio/a/ad.mp3","uk_sound":"æd","uk_link":"../audio/a/ukactiv022.mp3","content":"Add to word list\nAdd to word list\nA2 to put two or more numbers or amounts together to get a total: add in It's $45 - $50 if you add in the cost of postage.add on Don't forget to add on your travelling expenses. We'll keep a running subtotal and add the tax on at the end. If you add (= calculate the total of) three and four you get seven.\nThesaurus: synonyms, antonyms, and examples\nto add up numbersaddAdd 24, 63, and 55.add upMy job was to add up the scores at the end. totalTotal the daily payments for a month and you arrive at your monthly expenditure. find the sumFind the sum of the following numbers.find the totalFind the total of £26.33, £55.09, and £109.65.add up toThe figures add up to a huge amount.\nSee more results »\nA2 to put something with something else to increase the number or amount or to improve the whole: add something to something She's added a Picasso to her collection. Beat the butter and sugar together and slowly add the eggs.add to Her colleagues' laughter only added to her embarrassment.\nB1 to say another thing: [ + that ] She was sad, she said, but added (= said also) that she felt she had made the right decision. [ + speech ] \"Oh, and thank you for all your help!\" he added as he was leaving.\nThesaurus: synonyms, antonyms, and examples\nto add a commentaddWould you like to add any further comments?go onHe went on to say that there was little point in intervening at such a late stage in the process.state furtherHe stated further that he felt honoured to be given such an exceptional opportunity.continue\"Let me give an example,\" he continued.\nSee more results »\nMore examplesFewer examplesFirst, fry the garlic. Next, add the ginger.You have to add the cost of postage to the subtotal.If you add the plural inflection '-s' to 'dog' you get 'dogs'.Two of the cathedral's chapels were added later - the Lady Chapel and the Chapel of St Paul.Have you anything further to add to the discussion?\nSMART Vocabulary: related words and phrases\nAugmenting and supplementing\na new lease of life idiom\naccrete\naccrue\nadd something in\naddendum\naddition\nannexure\nbolt\nextension\ngain\nhorizon\nincremental\ninterpolate\ninterpolation\nnew\ntag something on\ntop something up\ntransfuse\nweight\nwrite something into something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying & uttering\nIdioms\nnot add up\nto add insult to injuryPhrasal verbs\nadd on something\nadd (something) up\nadd up to something\nabbreviation for Attention Deficit Disorder: a name used mainly in the 1980s for a condition in which someone, especially a child, is often in a state of activity or excitement and unable to direct their attention towards what they are doing: A person with ADHD, previously known as ADD (attention-deficit disorder), has trouble focusing on activities, organizing and finishing tasks, and following instructions. She said her child's teacher thought he might have ADD. Synonym\nADHD\nMore examplesFewer examplesMillions of children are now medicated for brain-related learning disorders such as ADD.His advice has helped countless sufferers of Attention-Deficit Hyperactivity Disorder (ADHD), formerly known as Attention-Deficit Disorder (ADD).\nSMART Vocabulary: related words and phrases\nGeneral bodily disorders\nADHD\nalbinism\nanal fissure\natrophic\nbloodshot\ncollapsed\ncongestion\nfunny turn\ngammy\nnecrosis\nnon-systemic\noedema\noveractive\nprocidentia\nprolapsed\nrupture\nscurvy\nseptic\nsuppurate\nsystemic\nSee more results »\nadd verb [I/T]\n(INCREASE)\nAdd to word list\nAdd to word list\nto put something with something else to increase the number or amount or to make it more important: [ T ] Beat the butter and sugar together, and then add the eggs. [ T ] \"Thanks for all your help!\" he added as he was leaving. [ I ] Factors beyond their control added to their success.\nadd verb [I/T]\n(CALCULATE)\nmathematics to calculate the total of a group of numbers: [ T ] If you add three and four you get seven. added adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈæd·ɪd/\nHe had the added disadvantage of being the only man present. Idiom\nadd fuel to the firePhrasal verbs\nadd on something\nadd up\nadd up\nadd up (something)\nadd up to something\nadd up to something\nAdd to word list\nAdd to word list\nto put something with something else in order to improve it or increase the number or amount: add sth to sth Investors can add more money to the fund at any time. You can add a link to your own website.\nto put one number or amount with another in order to calculate a total: add sth to sth You have to add the cost of postage to the subtotal. add sth together So when you add all those figures together, that is where 534 comes from.\nFINANCE to increase in value by a particular amount, or to make something increase in value by a particular amount: add sth to sth Today its shares added 7p to 460p.\nPhrasal verbs\nadd in\nadd on\nadd up\nadd up to sth"}