{"id":3564,"name":"additive","type":"noun","us_sound":"ˈæd.ə.t̬ɪv","us_link":"../audio/a/eus70073.mp3","uk_sound":"ˈæd.ɪ.tɪv","uk_link":"../audio/a/ukadapt018.mp3","content":"Add to word list\nAdd to word list\na substance that is added to food in order to improve its taste or appearance or to keep it fresh and stop it from decaying: food additives This margarine is full of additives - just look at the label!\nSMART Vocabulary: related words and phrases\nAdditives in food & drinks\nanti-caking agent\nbaking powder\nbaking soda\nbicarb\nbicarbonate of soda\ncreamer\nE number\nemulsifier\nfiller\nflavour enhancer\niodized salt\nIrish moss\nlecithin\nmalt extract\nmaltodextrin\npectin\nstabilizer\nthickener\nthickening\nxanthan gum\nSee more results »\nmathematics\n&#160; specialized relating to or involving addition (= the process of adding numbers together): Let Z be the additive group of integers. The strategy is applicable to single-winner voting systems that are additive point systems.\nformal involving combining things or using things together: Creating colours on a screen is an additive process, in which the primary colours are red, green, and blue.\nformal increasing by being combined, or increasing over time: Jenkins predicted a powerful additive effect might occur when these cholesterol-lowering foods are combined. RA is an additive polyarthritis. This means that it affects more joints as time passes.\nMore examplesFewer examplesA +3 cm crest and a -3 cm trough result in a height of zero, i.e., the waves momentarily cancel each other out at that point. This additive rule is referred to as the principle of superposition, \"superposition\" being merely a fancy word for \"adding\".An additive solution concept assigns to every player in {υ + ω} the sum of what he would receive in υ and ω.FDM is an additive process in which a layer of plastic is extruded on top of the previous layer, one at a time. Researchers are concerned these drugs may have an additive effect - where small concentrations of two or more drugs become more poisonous when absorbed together at the same time.The mixture of alcohol and heroin has an additive effect: a drinker could take a lower-than-lethal dose and still OD.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\narithmetical\nassociative property\ncoefficient\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquintuple\nrecursion\nround something down\nsubtraction sign\nsubtractive\ntable\ntimes\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nCovering and adding layers\nIncreasing and intensifying\nCompare\nsubtractive\nmultiplicative\nAdd to word list\nAdd to word list\nsomething added to a substance, esp. food, to improve it or to preserve it: Additives keep certain foods fresh. This paint has an additive that keeps mold from growing on it."}