{"id":3547,"name":"adding","type":"verb","us_sound":"æd","us_link":"../audio/a/ad.mp3","uk_sound":"æd","uk_link":"../audio/a/ukactiv022.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nadd\nA2 to put two or more numbers or amounts together to get a total: If you add (= calculate the total of) three and four you get seven. It's $45 - $50 if you add in (= include) the cost of postage. Don't forget to add on your travelling expenses/add your expenses on.\nThesaurus: synonyms, antonyms, and examples\nto add up numbersaddAdd 24, 63, and 55.add upMy job was to add up the scores at the end. totalTotal the daily payments for a month and you arrive at your monthly expenditure. find the sumFind the sum of the following numbers.find the totalFind the total of £26.33, £55.09, and £109.65.add up toThe figures add up to a huge amount.\nSee more results »\nA2 to put something with something else to increase the number or amount or to improve the whole: Beat the butter and sugar together and slowly add the eggs. She's added a Picasso to her collection. Her colleagues' laughter only added to (= increased) her embarrassment.\nB1 to say another thing: [ + that ] She was sad, she said, but added (= said also) that she felt she had made the right decision. [ + speech ] \"Oh, and thank you for all your help!\" he added as he was leaving.\nThesaurus: synonyms, antonyms, and examples\nto add a commentaddWould you like to add any further comments?go onHe went on to say that there was little point in intervening at such a late stage in the process.state furtherHe stated further that he felt honoured to be given such an exceptional opportunity.continue\"Let me give an example,\" he continued.\nSee more results »\nMore examplesFewer examplesFirst, fry the garlic. Next, add the ginger.You have to add the cost of postage to the subtotal.If you add the plural inflection '-s' to 'dog' you get 'dogs'.Two of the cathedral's chapels were added later - the Lady Chapel and the Chapel of St Paul.Have you anything further to add to the discussion?\nSMART Vocabulary: related words and phrases\nAugmenting and supplementing\naccrete\naccrue\nadd\nadd something in\naddendum\naddition\nbeef\nbolt\nbulk up\nextension\ngain\nhorizon\nincremental\ninterpolation\nnew\ntack something on\ntag something on\ntop something up\ntransfuse\nwrite something into something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying & uttering\nIdioms\nnot add up\nto add insult to injuryPhrasal verbs\nadd on something\nadd (something) up\nadd up to something"}