{"id":3557,"name":"addition","type":"noun","us_sound":"əˈdɪʃ.ən","us_link":"../audio/a/addition.mp3","uk_sound":"əˈdɪʃ.ən","uk_link":"../audio/a/ukadapt015.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the process of adding numbers or amounts together: Twice a week the children are tested in basic mathematical skills such as addition (= calculating the total of different numbers put together) and subtraction. in addition (to)\nB1 as well (as): In addition to his apartment in Manhattan, he has a villa in Italy and a castle in Scotland.\nSee more\n[ C ] something that has been added to something else: useful addition to He admits tofu is a useful addition to the range of meat alternatives available.worthy addition to Her latest novel is a worthy addition to the spy thriller genre.welcome addition Fresh summer vegetables are a welcome addition to many recipes.latest addition I have many exotic plants in my collection, and this orchid is my latest addition. The new model is the latest addition to the range.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nB2 [ C ] someone new who has joined or been added to a group: new addition We have had several new additions to the family recently. A new secretary would be a welcome addition.\n[ U ] the act of adding a substance or thing to something else: Most working environments are improved by the addition of (= by adding) a few plants and pictures.\n[ C ] US (UK extension) a new part added to a house or other building: addition to We're building an addition to our house.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nMore examplesFewer examplesThe test involves simple calculations, such as addition and subtraction.Have you got any savings in addition to your savings account at the bank?The company announced several new additions to its product range. She's young and dynamic and will be a great addition to the team.With the addition of a few pictures on the walls, this room will look very homely.Some dentists are convinced that the addition of fluoride in water is ineffective.\nSMART Vocabulary: related words and phrases\nAugmenting and supplementing\naccrete\naccrue\nadd\nadd something in\naddendum\nbeef\nbolt\nbulk up\nextension\ngain\nhorizon\nincremental\ninterpolation\nnew\ntack something on\ntag something on\ntop something up\ntransfuse\nweight\nwrite something into something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\nThings added or attached to other things\nOrganizations - joining & leaving\nParts of buildings in general\naddition noun\n(CALCULATION)\nAdd to word list\nAdd to word list\n[ U ]\n&#160; mathematics the process of calculating the total of a group of numbers: [ U ] We learn addition and subtraction in first and second grade.\naddition noun\n(INCREASE)\n[ C/U ] the joining of something to something else to make it larger or more important, or the person or thing that joins something: [ C ] Harold is the newest addition to our staff.\nAdd to word list\nAdd to word list\n[ C ] something extra that is added to something: an addition to sth The company provides a compensation package which amounts to an addition to the employee's salary.\n[ U ] the act of adding something to something else: the addition of sth to sth The addition of women to the board was a deliberate diversity strategy.\n[ C ] US ( UK extension) a new part added to a building: an addition to/on sth The commissioners plan to build an addition on the front of the building.\nin addition to sth\nused for saying that something else exists or is included: In addition to movies, the company also published magazines."}