{"id":3595,"name":"address","type":"noun","us_sound":"ˈæd.res","us_link":"../audio/a/eus70074.mp3","uk_sound":"əˈdres","uk_link":"../audio/a/ukadapt021.mp3","content":"address noun [C]\n(HOME DETAILS)\nAdd to word list\nAdd to word list\nA1 the number of the house, name of the road, and name of the town where a person lives or works, and where letters can be sent: her business/home address a change of address\na place where someone lives: Police searched an address in North London in connection with a drugs arrest.\nMore examplesFewer examplesAny further correspondence should be sent to my new address.Please send the articles to the address given above.Her new address is 12 Warwickshire Mansions.He hasn't written to me recently - perhaps he's lost my address.Please print your name and address in block capitals.A man was detained at an address in Birmingham.\nSMART Vocabulary: related words and phrases\nCommunications - the postal system\naddy\nBFPO\ncare of idiom\ncollection box\nconsignee\ndelivery\ndirect mail\ndispatch\nfirst class\nFreepost\nmail\nmail slot\npigeonhole\npostage\npostbox\npostmark\nself-addressed\nstamp\nwindow\nzip code\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHome\naddress noun [C]\n(COMPUTERS)\nA1 a series of letters and symbols that tell you where to find something on the internet or show where an email is sent to: What's your email address? Do you have their Web address?\ncomputing\n&#160; specialized the place where a piece of information is stored in a computer's memory\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\naddress noun [C]\n(SPEECH)\na formal speech: She gave an address to the Royal Academy.\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nslide\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\naddress verb [T]\n(SPEAK TO)\nC2 formal to speak or write to someone: He addressed a few introductory remarks to the audience. He likes to be addressed as \"Sir\" or \"Mr Partridge\".\nMore examplesFewer examplesShe stood up to address a hushed courtroom.It's incorrect to address people by their first names at these formal events.He stepped out onto the balcony to address the multitude below.Kindly address your remarks to the bench, Mr Smith.All questions should be addressed to the chair.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nslide\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\naddress verb [T]\n(DEAL WITH)\nC1 to give attention to or deal with a matter or problem: The issue of funding has yet to be addressed.\nMore examplesFewer examplesThey are guilty of a cowardly failure to address the problem.Her speech was full of excuses and evasions and never properly addressed the issue.As employers we need to be seen to be addressing these issues sympathetically.The government has to address the rise in violent crime.Airports are trying to address security concerns without causing inconvenience to passengers.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\naddress verb [T]\n(WRITE DETAILS)\nC2 to write a name or address on an envelope or parcel: The parcel was wrongly addressed. So why did you open a letter that was addressed to me?\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\naddress noun [C]\n(PLACE)\nAdd to word list\nAdd to word list\nthe specific place where a person, business, or organization can be found and where mail can be received: What is your street address now? I need your home and your business address.\nAn address is also a group of letters or numbers and an @ symbol used to send electronic mail to someone: My e-mail address is pjh17@cambridge.org.\naddress noun [C]\n(SPEAK TO)\na formal speech: The graduation address was very dull.\naddress verb [T]\n(SPEAK TO)\nto speak or write to someone, or to direct information to someone: The First Lady addressed the meeting briefly. He was generally addressed as “Captain.”\naddress verb [T]\n(DEAL WITH)\nto give attention to or to deal with a matter or problem: We’ll address that question at the next meeting.\naddress verb [T]\n(PLACE)\nto write or print the specific place where a person, business, or organization can be found on something to be sent there: I addressed envelopes all morning.\nAdd to word list\nAdd to word list\na building number, name of the road, etc. where you live, where an organization has an office, or where mail is sent: Please send your application to the address below. What is your full address? a business/home address Taxpayers who have moved should make certain they file a change of address with the U.S. Postal Service. See also\naccommodation address\nforwarding address\n(also email address) the words and symbols that you type in order to send an email to a particular person. It usually consists of a person's name, an @ sign, the name of a company or school, and sometimes an abbreviation for a country: I sent the email to the wrong address. What's your email address?\nINTERNET\n&#160; (also web address) the words and symbols that you type to look at a particular website: How much web information could be captured: just the overall address or a list of each document viewed?\nIT →\nmemory address\nCOMMUNICATIONS a formal speech: in an address to sb/sth 'I can only see continued growth ahead of us,' the Chairman said in an address to analysts and money managers. See also\naccommodation address\nforwarding address\n[ usually passive ] to write an address on an envelope or package so it can be sent to the person who has that address: be addressed to sb/sth Make sure that your package is addressed to the correct department. a stamped addressed envelope\nto speak to a group of people, especially in a meeting or formal event: He addressed a group of forty industrialists and politicians.\nto speak to someone in a particular way or using a particular name: address sb as sth She addressed him as Mr Clifford.\nto deal with a particular problem or need: It is time to address the budget deficit.address a problem/issue How does the organization address the problems identified?address a need He was impressed with the business plan because it addressed a real need."}