{"id":3730,"name":"adenoid","type":"noun","us_sound":"ˈæd.ən.ɔɪd","us_link":"../audio/a/usacqui030.mp3","uk_sound":"ˈæd.ən.ɔɪd","uk_link":"../audio/a/ukadapt025.mp3","content":"Add to word list\nAdd to word list\na mass of tissue high up in the throat behind the nose that is part of the body's lymphatic system, especially when this mass has become too big and causes problems with the ears or with breathing or speaking: Adenoids are sometimes removed surgically to treat chronic ear infections or difficulty breathing. The X-ray shows the enlarged adenoid and the narrowed airway. Related word\nadenoidal\nMore examplesFewer examplesAdenoids are part of the body's immune system.You cannot see a person's adenoids by looking in their mouth.Some controversial reasons for removing adenoids are the presence of snoring, chronic sinus infections, frequent ear infections, and frequent colds.Several previous studies have explored the range of bacteria colonizing the adenoids.\nSMART Vocabulary: related words and phrases\nThe mouth & throat\n-throated\nairway\nalveolar\nalveolar ridge\nbuccal\nbuccinator\ncakehole\nlabiodental\nlaryngeal\nlarynx\nlingual\nmandibular\nmaxillofacial\nsoft palate\ntensor veli palatini muscle\ntrachea\nuvula\nuvular\nvelum\nvocal cords\nSee more results »\nrelating to the adenoid: The child was recovering from adenoid surgery. Nasal intubation may cause dislodgement of adenoid tissue. Synonym\nadenoidal\nMore examplesFewer examplesCatarrh can be a symptom of many diseases and infections such as sinus infection, tonsillitis, ear infections and adenoid infections.No associated factor was evident for this organism in adenoid samples.A lateral neck radiograph was performed to exclude adenoid hypertrophy.\nSMART Vocabulary: related words and phrases\nThe mouth & throat\n-throated\nairway\nalveolar\nalveolar ridge\nbuccal\nbuccinator\ncakehole\nlabiodental\nlaryngeal\nlarynx\nlingual\nmandibular\nmaxillofacial\nsoft palate\ntensor veli palatini muscle\ntrachea\nuvula\nuvular\nvelum\nvocal cords\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body"}