{"id":3994,"name":"adjacent","type":"adjective","us_sound":"əˈdʒeɪ.sənt","us_link":"../audio/a/adjacent.mp3","uk_sound":"əˈdʒeɪ.sənt","uk_link":"../audio/a/ukadher014.mp3","content":"Add to word list\nAdd to word list\nC2 very near, next to, or touching: They work in adjacent buildings. They lived in a house adjacent to the railway. Synonym\nneighbouring UK\nThesaurus: synonyms, antonyms, and examples\nat the side ofbesideCome sit beside me.next toYour glasses are on the table next to my tea.alongCars were parked along the road.alongsideBikes shared the road alongside cars and mopeds.againstWe pushed the bed against the wall.\nSee more results »\nMore examplesFewer examplesThe spillover from the adjacent river flooded the lower fields.She took a knife and fork from an adjacent table.They took a boat trip and toured the southern coastline and adjacent islands.They found a lovely hotel adjacent to the sea front.The bus station is adjacent to the railway station.\nSMART Vocabulary: related words and phrases\nNext to and beside\nabreast\nadjacency\nadjacently\nadjoining\nagainst\nalong\nbeside\nbordering\ncontiguity\ncontiguous\ncontiguously\nnext door\nnext door but one idiom\nnon-contiguous\non\nshoulder\nshoulder to shoulder idiom\nside\nsurrounding\nto\nSee more results »\n-adjacent US\nused in compounds to show that something is not exactly the thing mentioned, but very similar to it: For fans looking for some excellent horror-adjacent movies, I've put together the list below. \"There are an enormous number of science-adjacent and science-related careers for you to choose from,\" he explained.\nMore examplesFewer examplesThere will be private screenings of terror-adjacent short movies. General science and \"science-adjacent\" conferences are rich grounds for building competencies and collaborations in and out of the laboratory.Even if he couldn't live independently as a musician, it doesn't mean he couldn't find satisfying dream-adjacent work as a producer, music teacher, etc.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\naffinity\nakin\nalike\nallied\nalong the lines of something idiom\nballpark\nditto\nequivalently\nevenly\nevery inch idiom\nfamily\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nRelated word\nadjacency\nAdd to word list\nAdd to word list\nvery near, or with nothing in between: They work in adjacent buildings.\ngeometry Two angles are adjacent if they are next to each other and share a line."}