{"id":4003,"name":"adjective","type":"noun","us_sound":"ˈædʒ.ek.tɪv","us_link":"../audio/a/eus70080.mp3","uk_sound":"ˈædʒ.ek.tɪv","uk_link":"../audio/a/ukadher017.mp3","content":"Add to word list\nAdd to word list\nA2 a word that describes a noun or pronoun: \"Big\", \"boring\", \"purple\", and \"obvious\" are all adjectives.\nMore examplesFewer examplesIn the sentence 'She is happy', 'happy' is a predicative adjective.Complete the sentence with one of the adjectives provided.You can change the adjective 'sweet' into a noun by adding the suffix '-ness' to the end of the word.In 'a sudden movement', 'sudden' is an adjective in the attributive position.I don't think I'd call it a beautiful picture - 'interesting' might be a better adjective to use!\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\npart of speech\nprep\npronoun\nrelative pronoun\nSee more results »\nRelated words\nadjectival\nadjectivallyGrammar\nAdjectivesAdjectives are one of the four major word classes, along with nouns, verbs and adverbs. Examples of adjectives are: big, small, blue, old, rich and nice. They give us more information about people, animals or things represented by nouns and pronouns: …\nMeanings of adjectivesAdjectives give us more information. They modify or describe features and qualities of people, animals and things. …\nOppositenessMost common adjectives are members of a pair of opposites (antonyms): …\nGradable and ungradableMany pairs of opposites are gradable, i.e. they have different degrees of the same feature: …\nAdjectives: formsUnlike in many other languages, adjectives in English do not change (agree) with the noun that they modify: …\nIdentifying adjectivesThere is no general rule for making adjectives. We know they are adjectives usually by what they do (their function) in a sentence. However, some word endings (suffixes) are typical of adjectives. …\nForming adjectives from other wordsSome adjectives are made from nouns and verbs by adding suffixes. …\nAdjectives: comparative and superlativeMany one-syllable adjectives have endings to show the comparative and superlative. …\nAdjectives: with -ing and -ed (interesting, interested)We use the -ing and -ed forms of regular and irregular verbs as adjectives: …\nAdjectives: orderWhen more than one adjective comes before a noun, the adjectives are normally in a particular order. Adjectives which describe opinions or attitudes (e.g. amazing) usually come first, before more neutral, factual ones (e.g. red): …\nOrder of adjectivesWhen more than one adjective comes before a noun, the adjectives are normally in a particular order. Adjectives which describe opinions or attitudes (e.g. amazing) usually come first, before more neutral, factual ones (e.g. red): …\nAdjective phrasesAn adjective phrase always has an adjective acting as the head. The adjective phrase may also contain words or phrases before or after the head (modifiers and complements): …\nAdjective phrases: functionsOne of the main functions of adjective phrases is that they go with nouns and change or add to their meaning. …\nAdjective phrases with nounsOne of the main functions of adjective phrases is that they go with nouns and change or add to their meaning. …\nAdjective phrases with verbs (Brenda is happy)The second main function of an adjective phrase is to be a complement to a verb. It completes the meaning of verbs that describe what the subject is, does or experiences. These verbs include be, seem, become, feel, smell, taste (linking verbs). When adjective phrases complement verbs, this is called their predicative function. …\nObject complementsWe also use adjective phrases to give more information about an object (underlined) so as to complete its meaning (object complement): …\nAdjective phrases: positionWhen an adjective is used with a noun, the usual order in English is adjective + noun: …\nAdjectives with nouns and verbsAdjectives can go before the noun (attributive) or after linking verbs such as be, become, seem (predicative): …\nWords and phrases that go before and after adjectivesThe most typical words and phrases that go before adjectives (premodifiers) are adverb phrases expressing degree: …\nGradable adjectives and words and phrases that go before themMost common adjectives can express different degrees of qualities, properties, states, conditions, relations, etc. These are called gradable adjectives: …\nGradable opposites (antonyms)The most common gradable adjectives can be grouped into pairs of opposites (antonyms) which refer to features like height: short – tall; heat: hot – cold, size; big – small, etc. These adjectives are at the upper and lower parts of an open-ended scale (a scale with no maximum or minimum): …\nDifferent meanings of adjectives before the noun and after the verbWe can use some adjectives before the noun or after the verb but the meaning differs. …\nAdjectives before nouns that modify other nounsA noun (n) is sometimes used before another noun to give more information about it. This is called a noun modifier. Adjectives (adj) come before noun modifiers: …\nOrder of adjectives in noun phrases with articles and degree modifiersWhen adjectives are used before the noun (attributive function), there are also sometimes degree adverbs. Different degree adverbs require different positions for the adjective phrase. …\nAdjectives and adjective phrases: typical errorsWe use -ing adjectives to describe an effect and -ed adjectives to describe how a person feels: …\nAdd to word list\nAdd to word list\ngrammar a word that describes a noun or pronoun: \"Big,\" \"purple,\" \"quick,\" \"obvious,\" and \"silvery\" are adjectives. adjectival adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌædʒ·ɪkˈtɑɪ·vəl/\nan adjectival phrase"}