{"id":4078,"name":"adjustment","type":"noun","us_sound":"əˈdʒʌst.mənt","us_link":"../audio/a/adjustment.mp3","uk_sound":"əˈdʒʌst.mənt","uk_link":"../audio/a/ukadjus001.mp3","content":"adjustment noun [C or U]\n(CHANGE)\nAdd to word list\nAdd to word list\nB2 a small change: She made a few minor adjustments to the focus of her camera. Synonyms\nalteration\namendment\nchange (BECOMING DIFFERENT)\nmodification (CHANGE)\nmutation\nMore examplesFewer examplesThe invitations are almost ready, I just need to make a couple of adjustments.It requires a few minor adjustments.Use the on-screen menu to make adjustments to the colour and brightness of your monitor.The bike needed a few adjustments before it was ready to leave the shop.The software allows the artist to make detailed adjustments to the original drawing.\nSMART Vocabulary: related words and phrases\nChange and changes\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\ncampaign finance reform\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\ngyration\nretransformation\nreversal\nreversion\nrevolution\nrhythm\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nadjustment noun [C or U]\n(BECOMING FAMILIAR)\nthe ability to become more familiar with a new situation: He has so far failed to make the adjustment from school to work.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\nflex\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nAdd to word list\nAdd to word list\n[ C or U ] a slight change made to something to make it fit, work better, or be more suitable, or the act of making such a change: A small adjustment at the right place can make a significant difference. If the colour does not appear quite right, check your monitor settings for adjustment.adjustment to sth The final plan will serve as an adjustment to the two-year budget approved last year.\n[ C or U ] a slight change to figures according to inflation, the time of year, etc. so that they can be compared in a useful way with other figures, or the act of making such a change: adjustment to sth The finance minister will again delay the inflation adjustment to excise duty on petrol.adjustment for sth The population has been split into 10 equal groups, ranked by income, after adjustment for family size.\n[ U ] the process of becoming more familiar with a new situation: make an adjustment This is a very, very big adjustment for us to make.\n[ U ]\n&#160; INSURANCE the job of getting information about an accident, theft, etc. in order to decide how much money to pay an insurance customer: There was a breach in the insurance companies' adjustment and payment.\n[ C ]\n&#160; INSURANCE the amount of money that an insurance company pays to a customer who has been involved in an accident, had something stolen, etc.: After calculating what the adjustment should have been, they analyse how the insurance company adjustments deviated from reality. See also\ncost of living adjustment\ndebt adjustment"}