{"id":4067,"name":"adjust","type":"verb","us_sound":"əˈdʒʌst","us_link":"../audio/a/adjust.mp3","uk_sound":"əˈdʒʌst","uk_link":"../audio/a/ukadher028.mp3","content":"adjust verb\n(MAKE CHANGES)\nAdd to word list\nAdd to word list\nB2 [ T ] to change something slightly, especially to make it more correct, effective, or suitable: If the chair is too high you can adjust it to suit you. As a teacher you have to adjust your methods to suit the needs of slower children.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\n[ T ] to arrange your clothing to make yourself look tidy: She adjusted her skirt, took a deep breath, and walked into the room.\nMore examplesFewer examplesTurn/Twiddle the little knob to adjust the volume.With this drill it's possible to adjust the speed of rotation.You don't need to adjust the setting every time you take a photo.There is some interference on the signal - do not adjust your set.My hat was askew so I adjusted it in the mirror.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\nflex\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCleaning & tidying places & things\nadjust verb\n(BECOME FAMILIAR)\nB2 [ I ] to become more familiar with a new situation: I can't adjust to living on my own. Her eyes slowly adjusted to the dark. The lifestyle is so very different - it takes a while to adjust.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\nflex\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nAdd to word list\nAdd to word list\nto change something slightly to make it fit, work better, or be more suitable: [ T ] Adjust the angle of your monitor so you can easily read it. [ I ] You need time to adjust to a new situation. adjustable adjective us\nYour browser doesn't support HTML5 audio\n/əˈdʒʌs·tə·bəl/\nThe height of the steering wheel is adjustable. adjustment noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˈdʒʌst·mənt/\n[ C ] Only a few adjustments were needed to make her dress fit perfectly.\nAdd to word list\nAdd to word list\n[ T ] to change something slightly to make it fit, work better, or be more suitable: You may need to adjust the image on your screen to keep it centered. They fail to update information on an ongoing basis and adjust sales strategies accordingly. Contractors have been slow to adjust their recruiting strategies to take account of these changes.\n[ T ] to change figures slightly according to inflation, the time of year, etc. so that they can be compared in a useful way with other figures: adjust sth for sth Payouts from the fund, when adjusted for inflation, are 20% less today than they were 10 years ago. The region's seasonally adjusted unemployment rate was 8.9% this spring.\n[ I ] to become more familiar with a new situation: adjust to sth Restaurant owners will get additional time to adjust to the new regulations.\n[ T ]\n&#160; INSURANCE to decide how much money will be paid to an insurance customer or to pay them the money: adjust a claim We adjust flood-related claims according to general company and industry standards. See also\ninflation-adjusted"}