{"id":4157,"name":"administrative","type":"adjective","us_sound":"ædˈmɪn.ɪˌstreɪ.t̬ɪv","us_link":"../audio/a/cdo0123usadmi0010.mp3","uk_sound":"ədˈmɪn.ɪ.strə.tɪv","uk_link":"../audio/a/ukadjus008.mp3","content":"administrative adjective\n(OFFICE WORK)\nAdd to word list\nAdd to word list\nC1 relating to the arrangements and work that is needed to control the operation of a plan or organization: administrative work an administrative problem Your responsibilities will be mainly administrative. Related word\nadministratively\nMore examplesFewer examplesKing Darius I is noteworthy for his administrative reforms, military conquests, and religious toleration.an administrative assistantThe cost-cutting measures include streamlining administrative procedures in the company.This software claims to reduce administrative costs.The new study looks at the amount of time police officers spend on administrative tasks.\nSMART Vocabulary: related words and phrases\nOffice practices\nadmin\nadministratively\nbadge in\nbadged\nbadging\nbranch\ndictate\nhygiene factor\nin-house\ninteroffice\nkaizen\nmanage up\nphotostat\npower breakfast\npower lunch\npp\nremit\nremittance\nscrum\ntyping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nadministrative adjective\n(LOCAL GOVERNMENT)\nrelating to the organization and structure of local government: Brittany is a cultural and administrative region in the north-west of France. The villages had been omitted because they fell outside the administrative boundary of the region.\nrelating to the laws that control local government: In several countries, administrative law is distinguished from constitutional law by being concerned purely with matters of public administration. Review by an administrative tribunal is generally to determine whether a decision taken by an executive authority breaches procedural rules.\nMore examplesFewer examplesThis is the islands' main city and financial, governmental, and administrative centre.The county's administrative apparatus ranked among the least effective in the country.Labour law is a collection of precedents, administrative rulings, and laws that tackle the legal rights of organizations and their employees. The auditors recommended that the state take administrative action against the school.\nSMART Vocabulary: related words and phrases\nUK politics: local government & politics\nalderman\nalderwoman\nanti-city\nauthority\nborough\ncity council\ncouncilwoman\ncounty borough\ncounty council\ndevelopment area\nenterprise zone\nfederal district\nmunicipality\nparish\nparish council\nparochial\nprefecture\nprincipal area\nshire\nunitary authority\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRules & laws\nAdd to word list\nAdd to word list\nrelating to the work of managing or organizing a business or business activity: Flexitime work can be an administrative nightmare for management. The study looks at capital, maintenance, and administrative costs. We will provide financial and administrative support to member companies. administrative work/duties administrative staff"}