{"id":4159,"name":"administrator","type":"noun","us_sound":"ədˈmɪn.ə.streɪ.t̬ɚ","us_link":"../audio/a/administrator.mp3","uk_sound":"ədˈmɪn.ɪ.streɪ.tər","uk_link":"../audio/a/ukadjus010.mp3","content":"Add to word list\nAdd to word list\nC1 someone whose job is to control the operation of a business, organization, or plan: From 1969 to 1971, he was administrator of the Illinois state drug abuse program. She works as a school administrator.\n(abbreviation admin) a person who is in charge of the operation of a network of computers, a website, a group of computer users, etc., and is able to make changes to it: It is now possible for network administrators to download educational software to specific computers across the school's network. To set up remote access you have to log on as the administrator.\nMore examplesFewer examplesWe're engaging the services of a professional administrator.Our new administrator seems to be trying to stamp her authority on every aspect of the department.a college/hospital administratorBoth teachers and administrators opposed the proposal to merge the two schools.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nanti-management\nauthority\nbureaucrat\nchairman\ncouncil\ncounter-power\ndean\ndeputy\ndominatrix\nmistress\nmovers and shakers\nmulti-headed\nofficer\nofficialdom\nvice presidency\nvice president\nvicegerency\nvicegerent\nwarden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nAdd to word list\nAdd to word list\nWORKPLACE someone whose job is to manage a business or business activity: A new administrator has taken over at the park, and more stringent business practices are in place. She spent 10 years as a very capable administrator of New York City Opera.\nLAW\n&#160; UK a person chosen by a court to manage a company that cannot pay its debts in order to try to improve its financial situation and to keep it operating: The court-appointed administrator asked a court to declare the firm bankrupt. Compare\nliquidator\nreceiver"}