{"id":4201,"name":"admit","type":"verb","us_sound":"ədˈmɪt","us_link":"../audio/a/admit.mp3","uk_sound":"ədˈmɪt","uk_link":"../audio/a/ukadjus024.mp3","content":"admit verb\n(ACCEPT)\nAdd to word list\nAdd to word list\nB1 [ T or I ] to agree that something is true, especially unwillingly: He admitted his guilt/mistake. [ + (that) ] She admitted (that) she had made a mistake. [ + -ing verb ] She admitted making a mistake. At first he denied stealing the money but he later admitted (to) it. I wasn't entirely honest with him, I admit. [ + to infinitive ] The new law was generally admitted to be difficult to enforce. Synonyms\navow formal\nconfess\nown up\nThesaurus: synonyms, antonyms, and examples\nto say that you are wrongconfessRawlinson finally confessed to the robbery.own upCome on, own up - who's eaten the last sandwich?fess upFess up - you wanted to go to the cinema instead, didn't you?come cleanI decided to come clean about the broken vase.concedeShe did eventually concede that the instructions were not very clear.admitHe admitted that he had been wrong.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accept that something is trueacceptI fully accept that I was wrong.acknowledgeI acknowledge that the project has faced delays, but we will do all we can to make up time.recognizeI do recognize that mistakes were made.admitWhy don't you just admit you got it wrong?\nSee more results »\nadmit defeat\nto accept that you have failed and give up: After several attempts to untie the knot, I admitted defeat and cut through it with a knife.\nSee more\nMore examplesFewer examplesI was too embarrassed to admit that I was scared.He was ashamed to admit to his mistake.She grudgingly admitted that she had been wrong to criticize him.The gang admitted they had committed four recent bank robberies.It may be that the ministers know more than they are admitting at the moment.\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhand\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nadmit verb\n(ALLOW IN)\n[ T ] to allow someone to enter a place: Each ticket admits one member and one guest. Men will not be admitted to the restaurant without a tie.literary A gap between the curtains admitted the faint glimmer of a street lamp.\n[ T ] to allow a person or country to join an organization: Spain was admitted to the European Community in 1986.\n[ T ] to allow someone to enter a hospital because they need medical care: UK She was admitted to hospital suffering from shock.US She was admitted to the hospital suffering from shock.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nPhrasal verb\nadmit of something\nadmit verb\n(ACCEPT)\nAdd to word list\nAdd to word list\nto recognize or accept something as true: [ T ] He admitted his guilt. [ + (that) clause ] She admitted (that) she had made a mistake.\nadmit verb\n(ALLOW IN)\n[ T ] to allow someone or something to enter: Each ticket admits one member and a guest. admittance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ədˈmɪt·əns, æd-/\nHe was refused admittance to the club.\nAdd to word list\nAdd to word list\n[ I or T ] to say that you have done something dishonest or have not succeeded in doing something: \"We need to do more to attract the younger end of the market,\" the Chairman admitted. It can be difficult to admit mistakes in front of colleagues who may be competitors for the next promotion.admit to sth Three suspects admitted to the fraud scheme during a series of interviews with federal agents.admit (that) British Airways admitted last week that the credit market downturn was affecting business travel.admit doing sth In court, she admitted receiving almost $1 million as \"consulting fees\".admit guilt/failure/defeat The company received a discount on its fine because it admitted its guilt.admit a charge/offence/allegation Several firms have been forced to admit charges of paying illegal bonuses to employees.\nadmit liability (for sth)\nLAW to admit that you are legally responsible for something that has harmed someone: As part of the agreement, the chairman and his affiliates do not admit any liability or wrongdoing.\nto officially give permission for a person, company, or country to join a large organization: admit sb to sth Over the next five years, several new countries will be admitted to the EU.\nto officially give permission for someone to attend a meeting or other event: admit sb to sth Newspaper reporters will not be admitted to the hearing.\nadmit evidence\nLAW if a court of law admits evidence or admits something as evidence, it allows something to be used to decide whether someone is guilty of a crime: Prosecutors asked the court to admit the recordings as evidence."}