{"id":4196,"name":"admission","type":"noun","us_sound":"ədˈmɪʃ.ən","us_link":"../audio/a/admission.mp3","uk_sound":"ədˈmɪʃ.ən","uk_link":"../audio/a/ukadjus023.mp3","content":"admission noun\n(ACCEPTING)\nAdd to word list\nAdd to word list\n[ C or U ] the act of agreeing that something is true, especially unwillingly: admission of guilt Her silence was taken as an admission of guilt.by your own admission By his own admission (= as he has said), he has achieved little since he took over the company. [ + that ] I felt he would see my giving up now as an admission that I was wrong. Synonyms\navowal formal\nconfession\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhand\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nadmission noun\n(ALLOWING IN)\nB1 [ U or C ] the money that you pay to enter a place: How much do they charge for admission? The admission charge/fee is €5.\nB2 [ U ] permission to enter a place: Admission to the exhibition will be by invitation only. There's a notice outside the building that says \"No admission before twelve noon\".\n[ C or U ] the act or process of accepting someone as a patient at a hospital or as a student at a school, college, etc.: hospital admission Nearly 15 percent of the patients were sick enough to require hospital admission. She wanted to be a nurse, but was denied admission to nursing school. This was my third admission to hospital in a year. Admissions for respiratory diseases increased significantly. admissions [ plural or U ]\nthe process of accepting people into a university, school, etc. as students, or the part of a university, school, etc. that deals with this: We want to encourage greater age diversity in university admissions.\nSee more\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\nconnection\ndeparture\ndescent\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosts & expenses\nMedical treatment: general words\nSchools in general\nAllowing and permitting\nRelated word\nadmit\nadmission noun [C/U]\n(PERMISSION TO ENTER)\nAdd to word list\nAdd to word list\npermission to study at a school or college, or permission to enter a theater or other building: [ U ] How many students will gain admission to Yale? [ U ] The club refuses admission to those under 18.\nAdmission is also the price paid to enter a place: [ C ] Museum admission is $5.\nadmission noun [C/U]\n(STATEMENT)\na statement accepting the truth about something: [ C ] There was no admission of guilt from anyone.\nAdd to word list\nAdd to word list\n[ C or U ] something that you say or do that shows that you know you have done something dishonest or have not succeeded in doing something: admission that The chairman's statement is the first public admission that the board may be considering breaking up the company.admission of guilt/responsibility/failure Many members of the public view the resignation of the authority's chief executive as an admission of guilt.by sb's own admission By the CEO's own admission, the company's strategy of pursuing global growth has not been a success.\n[ U ] official permission that is given to a person, company, or country to join a large organization: The European Union promises admission to any country that meets the criteria for membership.admission to sth Admission to the World Trade Organization should improve our economic prospects.admission of sb We always welcome the admission of new members.apply for/gain admission (to sth) Over 5,000 students apply for admission to our graduate business program each year.deny/refuse admission (to sth) Despite existing shortages, the number denied admission to nursing schools is high.admission process/requirement/standard Recent changes in the system have led to tougher admission standards.\n[ U ]\n&#160; COMMERCE the price that you pay to go to a public place such as a museum or theatre, or to attend a public event such as a concert or sports game: Tickets are $15 for general admission and $7 for students.admission to sth The government is committed to extending the principle of free admission to our national museums and galleries. admission charge/fee/price\n[ U ]\n&#160; STOCK MARKET official permission that is given to a company to sell its shares on a stock market: admission to sth Shares were heavily traded before and after the company's admission to the index, arousing suspicions of insider dealing."}