{"id":4131,"name":"admin","type":"noun","us_sound":"ˈæd.mɪn","us_link":"../audio/a/usadept019.mp3","uk_sound":"ˈæd.mɪn","uk_link":"../audio/a/ukadjus005.mp3","content":"admin noun\n(ORGANIZING TASKS)\nAdd to word list\nAdd to word list\n[ U ] short for\nadministration : arrangements and tasks needed to control the operation of a plan, an organization, a person's activities, etc.: Let's skip through the boring admin first: we have to fill out this form. Over 100 people are employed by the college as teaching staff or in admin.\nMore examplesFewer examplesI had some personal admin to do, like paying bills and answering messages.The costs of admin account for less than 0.15% of the charges paid by the client.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadminister\nadministration\nanti-bureaucracy\nbronze command\nbureaucracy\nflabbily\nget up\nget your act together idiom\ngold command\nhave/get your shit together idiom\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOffice practices\nTypes of employment\nadmin noun\n(PERSON)\n[ C ]\n&#160; computing\n&#160; specialized short for\nadministrator : a person who is in charge of the operation of a network of computers, a website, a group of computer users, etc., and is able to make changes to it: Only admins can add people to the group chat or change the name of the group. a network/server/site/domain admin I have full admin rights on the network.\nMore examplesFewer examplesI logged on as an admin using the password provided.I think this is an essential resource for every IT admin.Let the network admin know if the system is running slow.Users cannot add records to the database unless they are domain admins.You can log on remotely if you have admin privileges.\nSMART Vocabulary: related words and phrases\nOperating computers\nadministrator\naliasing\nalways-on\nback someone up\nblack hat\ncrack\ndrag\ndrill down\nmalicious\nmaximize\nmiswrite\nmouse over something\nmunging\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nshort for\nadministrative : relating to the arrangements and tasks needed to control the operation of a plan, an organization, a person's activities, etc.: He's an admin assistant at a PR firm. They said the discrepancy in the accounts was simply an admin error. admin staff/jobs/duties/tasks admin costs/expenses/fees\nMore examplesFewer examplesHigher admin costs were offset by higher sales.Tickets cost $15 each plus a small admin fee.I spent the morning doing a few admin tasks.The requirement to register imposes an additional admin burden on members.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\naggravate\nbackslide\nbe (all) downhill idiom\nbe half the dancer, writer, etc. you used to be idiom\ndebase\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\ndownhill\nregress\nregression\nregressive\nregressively\nrelapse\nretrograde\nworse\nworsen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOffice practices\nTypes of employment\nAdd to word list\nAdd to word list\nshort for administration: the activities involved in managing or organizing a business or other organization: I don't want my best salespeople spending all their time doing admin. an admin error an admin fee/charge an admin job\nshort for administration: the part of a business or other organization that manages or organizes its activities: There has been the occasional disagreement between admin and sales. the admin department"}