{"id":4139,"name":"administer","type":"verb","us_sound":"ədˈmɪn.ə.stɚ","us_link":"../audio/a/administer.mp3","uk_sound":"ədˈmɪn.ɪ.stər","uk_link":"../audio/a/ukadjus006.mp3","content":"administer verb\n(MANAGE)\nAdd to word list\nAdd to word list\n[ T often passive ] (also administrate, uk/ədˈmɪn.ɪ.streɪt/ us/ədˈmɪn.ə.streɪt/) to control the operation or arrangement of something: The economy has been badly administered by the present government.\n[ T often passive ] to govern a country, region, etc.: The economy has been badly administered by the present government.\nMore examplesFewer examplesKing Darius I is noteworthy for his administrative reforms, military conquests, and religious toleration.an administrative assistantThe cost-cutting measures include streamlining administrative procedures in the company.This software claims to reduce administrative costs.The new study looks at the amount of time police officers spend on administrative tasks.We're engaging the services of a professional administrator.Our new administrator seems to be trying to stamp her authority on every aspect of the department.The new administrator in accounts is a real stunner.a college/hospital administratorBoth teachers and administrators opposed the proposal to merge the two schools.Reputable charities spend the lion's share of donations on aid and a tiny fraction on administration.Eastern Slavonia is to revert to Croatian government rule next year after a transitional period under U.N. administration.Keeping noise levels low is the bane of airport administration.The new administration is still in the shakedown period.Hard-liners are expected to be purged from the administration.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadministration\nanti-bureaucracy\nbronze command\nbureaucracy\nflabbily\nget up\nget your act together idiom\ngold command\nhave/get your shit together idiom\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nadminister verb\n(GIVE)\n[ T ] formal to cause someone to receive something: to administer medicine/punishment/relief Tests will be administered to schoolchildren at seven and twelve years.figurative The latest opinion polls have administered a severe blow to the party. administer an oath (to someone) formal\nto be present while someone says an oath (= a formal promise) officially: The Court will not administer an oath to a witness who is drunk.\nSee more\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadministration\narm someone with something\nassignment\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nadminister verb [T]\n(MANAGE)\nAdd to word list\nAdd to word list\n(also administrate, us/ədˈmɪn·əˌstreɪt/) to manage or control the operation of something; govern: The British administered Hong Kong for 99 years.\nadminister verb [T]\n(GIVE)\nto be responsible for giving something to someone: Two proctors administered the exam. She administers medicines to patients.\nAdd to word list\nAdd to word list\nto give something to someone: administer drugs/a test The medication was administered by someone in another room.administer justice/a punishment It's up to the courts to administer justice.administer advice/help Training and Enterprise Councils in the rest of Britain are administering a range of help such as youth training.administer sth to sb This drug should not be administered to the very young.\n(also administrate) to manage or deal with a business activity: The cost to administer the program was $70,000. My job is to administer bookings."}