{"id":4277,"name":"adolescent","type":"noun","us_sound":"ˌæd.əˈles.ənt","us_link":"../audio/a/adolescent.mp3","uk_sound":"ˌæd.əˈles.ənt","uk_link":"../audio/a/ukadmon006.mp3","content":"Add to word list\nAdd to word list\nC2 a young person who is developing into an adult Compare\nteenager\nteen noun\nExamples\nHe looked uncomfortable, like a self-conscious adolescent who's gone to the wrong party.I'm looking after six adolescents for a week.She doesn't understand the emotional problems of adolescents.\nSMART Vocabulary: related words and phrases\nYoung people\nadolescence\nboyhood\ndelinquent\nemo\nephebe\nephebic\nladdishness\nlarrikin\nmall rat\nminor\nned\nskinhead\nteen\nteenager\nteenybopper\ntween\ntweenager\nyouth\nyouth culture\nyute\nSee more results »\nbeing or relating to an adolescent: an adolescent boy adolescent concerns/traumas/problems\nused to describe an adult or an adult's behaviour that is silly and like a child's: adolescent humour/behaviour\nMore examplesFewer examplesHe eventually outgrew his adolescent interest in war and guns.The council was hoping to turn a children's home into a residence for adolescent girls.My daughter became quite difficult to deal with during her adolescent years.A lot of adolescent girls suffer from low self-esteem.It's sad to see a grown man acting in such an adolescent way.\nSMART Vocabulary: related words and phrases\nDescribing people who are young\nadolescently\nat your mother's knee idiom\nbe knee-high to a grasshopper idiom\nflower\nfresh-faced\nfreshness\njuvenility\nknee-high\nmother\npre-puberty\nprepubescent\npubescent\ntender\ntweenager\nunderage\nya\nyoof\nyoung\nyoung adult\nyute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStupid and silly\nAdd to word list\nAdd to word list\nbetween the ages of a child and an adult: The two adolescent boys made their mother very tired.\nIf you describe an adult as adolescent, you mean that the person is behaving in a silly way. adolescence noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˌæd·əlˈes·əns/\n[ C ] He had an unhappy adolescence. adolescent noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˌæd·əlˈes·ənt/\nI teach in a middle school, because I like young adolescents."}