{"id":4305,"name":"adopt","type":"verb","us_sound":"əˈdɑːpt","us_link":"../audio/a/adopt.mp3","uk_sound":"əˈdɒpt","uk_link":"../audio/a/ukadmon008.mp3","content":"adopt verb\n(TAKE INTO HOME)\nAdd to word list\nAdd to word list\nB2 [ T or I ] to legally take another person's child into your own family and take care of him or her as your own child: They've adopted a baby girl. She had the child adopted (= she gave her baby to someone else to take care of). They have no children of their own, but they're hoping to adopt. Compare\nfoster verb (TAKE CARE OF)\n[ T ] to take an animal that has been left in a place such as a rescue centre, and keep it as your pet: Only about 20 percent of all dogs and cats that come into the rescue centre will be adopted. She lives in a 3-bedroomed home with five dogs she adopted from an animal shelter.\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadoptable\nadopted\nadoptee\nadoption\nadoptive\ncaretaking\nchild-rearing\nchildless\nchildlessness\nchildmind\nlawnmower parent\nlooked-after\nmothering\nnanny\nnon-custodial\nstay-at-home\nswaddle\nunadoptable\nunadopted\nunweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProtection and protectors\nadopt verb\n(START USING)\nB2 [ T ] to accept or start to use something new: I think it's time to adopt a different strategy in my dealings with him. The new tax would force companies to adopt energy-saving measures. He's adopted a remarkably light-hearted attitude towards the situation.\nMore examplesFewer examplesIt was a most fruitful discussion, with both sides agreeing to adopt a common policy.Since our research so far has not produced any answers to this problem, we need to adopt a different approach to it.We will have to adopt a more scientific approach in the future.Several governments have adopted tough new anti-terrorist legislation in the wake of the attacks.The budget proposal was adopted at the president's behest.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadoption\navail\navail yourself of something\nbe (of) (any/some) use idiom\nbe/go heavy on something idiom\ndraw\nexhaust\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nmine a rich seam of something idiom\nspare\nspent\ntap\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nunderused\nSee more results »\nadopt verb\n(CHOOSE)\n[ T ] to choose someone or something or take something as your own: Dr Kennedy has been adopted as the party's candidate for South Cambridge.\n[ T ] to start behaving in a particular way, especially by choice: Roz has adopted one or two funny mannerisms since she's been away.\nMore examplesFewer examplesShe tends to adopt a falsely cheerful tone when she's upset about something.to adopt a subservient role/positionThere is no English equivalent for 'bon appetit' so we have adopted the French expression.They have adopted local customs and tried to blend in with the community.The prime minister has adopted an inflexible position on immigration.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopted\nadoption\nappoint\nbags I... idiom\nbe between the devil and the deep blue sea idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nadopt verb\n(PAY FOR)\n[ T ] to pay money in order to have your name connected with a particular thing, especially in order to help an organization raise money: For just $25, you can adopt a word for an entire year.\n[ T ] UK to agree to be responsible for a road being maintained (= kept in good condition): The council said the road was never adopted and so it is not obliged to repair it.\nMore examplesFewer examplesWe adopted a red panda at our local wildlife park.Throughout Missouri, 4,600 groups have adopted highways and agreed to pick up trash, mow grass or carry out similar duties.When you design a housing estate, in order to get the roads adopted, you have to satisfy the highway authority.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nback someone up\nbadge\nbailout\nchampion\nkeep the flag flying idiom\npatronage\nred carpet\nreinforce\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nself-affirmation\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads & routes in general\nRoads: urban & residential streets\nadopt verb\n(TAKE CHILD)\nAdd to word list\nAdd to word list\n[ I/T ] to take another person’s child legally into your own family to raise as your own child: [ T ] They adopted Raphael last September.\nadopt verb\n(START)\n[ T ] to accept or begin to use something: The new law means companies will adopt energy-saving measures.\n[ T ] If an organization adopts a rule, it votes to accept it: The motion to increase fees was adopted.\nAdd to word list\nAdd to word list\nto start to use a new method, system, law, etc.: Many European businesses are now adopting a management style closer to that of the US.adopt an approach/strategy/policy According to the inspector-general's report, the airline industry needs to adopt a more consistent approach.adopt a measure/system/plan Companies involved in public takeovers should adopt more stringent measures to investigate information leaks.adopt a resolution/regulation/solution The Security Council adopted a resolution promising economic aid to the region.\nto start to use a new product or service: Large firms lead small firms in terms of adopting e-commerce."}