{"id":4505,"name":"adult","type":"noun","us_sound":"ˈæd.ʌlt","us_link":"../audio/a/adult.mp3","uk_sound":"ˈæd.ʌlt","uk_link":"../audio/a/ukadmon026.mp3","content":"Add to word list\nAdd to word list\nA1 a person or animal that has grown to full size and strength: An adult under English law is someone over 18 years old. Adults pay an admission charge but children get in free. Synonym\ngrown-up\nThesaurus: synonyms, antonyms, and examples\nto become an adultto become an adultHe was a young man on the verge of becoming an adult.grow upWhat do you want to be when you grow up?grow upStop complaining and grow up!matureSome adolescents mature earlier than others.matureFreddie has matured into a responsible adult.\nSee more results »\nMore examplesFewer examplesThe school rules state that no child shall be allowed out of the school during the day, unless accompanied by an adult.The magazine is aimed at teenagers and young adults.There will be two adults travelling, plus three children.Let's stay calm and try to behave like responsible adults.If you think of these children growing into adults who enjoy and appreciate classical music, then that repays our effort.\nA2 grown to full size and strength: an adult male/elephantadult life She spent most of her adult life in Spain.\ntypical of or suitable for adults: Let's try to be adult about this.\nThesaurus: synonyms, antonyms, and examples\nadult activities, behaviour, etc.adultThe victim was an adult male.adultA lot of people have never seen an adult movie.bigWhat do you want to do when you’re big?grown upHer children are all grown up now.full-grownThe website offers both puppies and full-grown dogs for sale.grownI've seen grown men cry when she sings.\nSee more results »\nAdult films, magazines, and books show naked people and sexual acts and are not for children.\nThesaurus: synonyms, antonyms, and examples\nadult activities, behaviour, etc.adultThe victim was an adult male.adultA lot of people have never seen an adult movie.bigWhat do you want to do when you’re big?grown upHer children are all grown up now.full-grownThe website offers both puppies and full-grown dogs for sale.grownI've seen grown men cry when she sings.\nSee more results »\nSMART Vocabulary: related words and phrases\nPhysically and mentally mature & immature\nadulting\nageing\nbabyish\nchildish\nchildishly\nimmature\nimmaturely\nimmaturity\ninfantile\njuvenile\nmaturity\novergrown\npetulance\npetulancy\npetulant\npetulantly\npuerile\npuerility\nsophomoric\nyoung at heart idiom\nSee more results »\nAdd to word list\nAdd to word list\ngrown to full size and strength: More than half of adult Americans are considered overweight.\nAdult also means suitable for grown people and not children: It’s a kids’ show, but they sneak in some adult humor.\nAdult movies, magazines, shows, and books include content that is intended for adults only. adult noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈdʌlt, ˈæd·ʌlt/\nWe invited only adults to the wedding. adulthood noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈdʌltˌhʊd/\nWhen she reached adulthood, she moved away."}