{"id":4564,"name":"advance","type":"verb","us_sound":"ədˈvæns","us_link":"../audio/a/advance.mp3","uk_sound":"ədˈvɑːns","uk_link":"../audio/a/ukadult007.mp3","content":"advance verb\n(MOVE FORWARD)\nAdd to word list\nAdd to word list\n[ I or T ] to go or move something forward, or to develop or improve something: The fire advanced steadily through the forest. We have advanced greatly in our knowledge of the universe. He's just trying to advance (= improve) his own career.advance on The troops advanced on the city (= approached it, ready to attack).advance the cause Her study has considerably advanced (= helped) the cause of equal rights.\nMore examplesFewer examplesThe troops quickly established a beachhead and were preparing to advance.She's the youngest player ever to advance to a semifinal.Enemy planes engaged the troops as they advanced into the mountains.Using smoke as (a) camouflage, the army advanced up the hill.Everyone was disappointed when the team failed to advance to the next round of the competition.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\nboom\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nadvance verb\n(PAY)\n[ T ] to pay someone some money before the regular time: [ + two objects ] Could you advance me £500 until Tuesday?\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBefore, after and already\nadvance verb\n(SUGGEST)\n[ T ] formal to suggest an idea or theory: the theory advanced in this article\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nadvance verb\n(INCREASE)\n[ I ] If something such as a share price advances, it increases in value: On the New York Stock Exchange, 1,228 issues advanced and 1,157 declined.\nadvance noun\n(MOVEMENT)\nB2 [ C or U ] the forward movement of something, or an improvement or development in something: Recent advances in medical science mean that this illness can now be cured. Nothing could stop the advance of the floodwaters.\nSMART Vocabulary: related words and phrases\nAdvancing and moving forward\nadvancing\nballistically\nbeeline\ncome\ncome over\ncome up\ncruise\ngain\nghost\nglide\nhead\nlead\nmake for somewhere/something\nmake towards something/someone\nproceed\nprogress\npull\npush\nrun\nslide\nSee more results »\nadvance noun\n(MONEY)\nmoney paid to someone before the regular time: an advance on She asked for a £300 advance on her salary.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBefore, after and already\nadvance noun\n(SEX)\n[ C usually plural ] an attempt to start a sexual or romantic relationship with someone: sexual advances She claimed that he made sexual advances towards her. She rejected his unwelcome advances.\nadvance noun\n(PRICE)\n[ C ] something such as a share price that increases in value: Declining stocks easily defeated advances 413 to 302. Idioms\nin advance\nin advance of something/someone\nhappening, done, or ready before an event: advance notice We got no advance notice of the changes.advance warning She gave me advance warning that she would visit the next day. advance payment/booking\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nadvance verb [I/T]\n(MOVE FORWARD)\nAdd to word list\nAdd to word list\nto go or move something forward, or to develop or improve something: [ T ] Research has advanced our understanding of the virus. [ I ] Tonight’s winner advances to the semifinals. advancement noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ədˈvæns·mənt, æd-/\nThey did nothing for the advancement of women. Idiom\nin advance\nadvance adjective\n(HAPPENING EARLY)\nhappening before an event: We got no advance warning of the changes.\nadvance noun\n(HAPPENING EARLY)\n[ C ] money paid before something happens: Most authors get an advance on royalties they’ll earn later.\nadvance noun\n(MOVING FORWARD)\n[ C/U ] an act of moving something forward or improving something: [ C ] Technological advances have changed TV news. [ U ] The army’s advance was halted. [ C ] fig. She rejected his unwelcome advances (= attempts to make her interested in him).\nAdd to word list\nAdd to word list\n[ C or U ] an improvement relating to a particular activity or area of knowledge: Doctors believe that the findings represent a major advance in treating heart disease. The government's White Paper embodies the hopes of those who believe in the advance of the digital age.technological/medical/economic advances What has been the impact of technological advances on the securities markets?advances in sth Advances in drilling and production technologies have significantly reduced the risk of a major oil spill.\n[ C ]\n&#160; FINANCE money that is paid to a person or organization before the usual time or before a piece of work is finished: Loans and advances usually represent the single largest asset of most banks. Publishers generally pay an advance once the author finishes the manuscript. The US singer will receive a $17.5m cash advance on signing the 10-year contract.\n[ C ]\n&#160; FINANCE, STOCK MARKET an increase in the price or value of something such as a share or a currency: Declining stocks easily defeated advances 413 to 302.advance in sth Every one yen advance in the Japanese currency's value against the dollar could reduce current profits by as much as five billion yen.\nin advance (of sth)\nbefore something else happens or is done: Ticket prices are cheaper if bought in advance. Rating agencies issued statements of the city's financial condition in advance of this week's sale of $500 million in bonds. See also\nbank advance\n[ I or T ] to develop and become successful, or to make something do this: Biotechnology continues to advance at a rapid pace.advance to sth She eventually advanced to vice-chairman of the bank.advance your career/interests/position Some employees decide to study for an MBA in order to advance their careers.\n[ I ]\n&#160; FINANCE, STOCK MARKET to increase in value: On the New York Stock Exchange 1,128 issues advanced and 1,057 declined .advance 5.5 cents/8p/10.9 points, etc. The general stock index advanced 1.94 points, or 0.04%, to 5291.45.advance against sth The dollar advanced against the Japanese yen.\n[ I ] to increase in number, amount, or value: Overall, consumer prices are advancing at a modest rate. Pre-tax profits advanced 10% to €252m.\nto suggest a new idea or plan to a group of people: Measures advanced by the General Assembly included reducing vehicle carbon-dioxide emissions.advance a plan/proposal/theory Several proposals for reform were advanced by members of Congress.\n[ T ]\n&#160; FINANCE to give someone money before the usual time or before a piece of work is finished: advance sb sth Two weeks ago I hired him, and advanced him $10,000.advance sth to sb Evidence shows that lenders are becoming more discriminating in advancing loans to borrowers.\n[ T ] to change the date or time of an event to an earlier one: No plans were made to advance the board meeting.\ndone or made before something else happens: Critics argue that advance planning would have little impact on final policy decisions.advance knowledge/information Having advance information can be a powerful tool to negotiating a rate on a loan.advance bookings/sales/subscriptions Advance sales are down by about 3%.advance notice/warning Federal laws require companies to provide advance notice when laying off workers. Russell has been offered an advance payment of $450,000 for her next novel."}