{"id":4679,"name":"advertising","type":"noun","us_sound":"ˈæd.vɚ.taɪ.zɪŋ","us_link":"../audio/a/advertising.mp3","uk_sound":"ˈæd.və.taɪ.zɪŋ","uk_link":"../audio/a/ukadver002.mp3","content":"Add to word list\nAdd to word list\nB2 the business of trying to persuade people to buy products or services: Fiona works in advertising. the advertising industry\nMore examplesFewer examplesMany doctors want to see a law banning all tobacco advertising.As marketing manager, her job is to oversee all the company's advertising.The company has launched its new advertising campaign.We've spent a lot of money on advertising and we're beginning to see the results.He has a high-pressure job in advertising.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ndetoxify\ndifferentiator\ndogfooding\nflyer\nfreesheet\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nAdd to word list\nAdd to word list\na business that makes things known generally or in public, esp. in order to sell them: an advertising campaign She works in advertising.\nAdd to word list\nAdd to word list\nthe activity of making products or services known about and persuading people to buy them: TV/online/radio advertising Understand how effective online advertising is and how different users react to different kinds of adverts.cigarette/tobacco/alcohol, etc. advertising They want to ban tobacco advertising on billboards. Around half of its $2.6m revenues last year came from advertising. The company has also halved its advertising budget, the simplest and easiest cost to cut. advertising costs/revenue an advertising strategy\nthe industry involved with making products or services known about and persuading people to buy them: She works in advertising.the advertising business/industry/sector Marketing on social networking sites is a fast-growing part of the online advertising business. an advertising executive/manager an advertising company/group\npictures, signs, pieces of film, etc. that are used to advertise products or services: They stopped using his image in their advertising after his arrest. We spend a lot of money on TV commercials and other advertising. See also\nbrand advertising\nbusiness-to-business advertising\ncomparative advertising\nconsumer advertising\ncorporate advertising\ndirect advertising\ndirect response advertising\ndrip advertising\nimage advertising\ninstitutional advertising\nissue advertising\nmass advertising\noutdoor advertising\nout-of-home advertising\npoint-of-purchase advertising\npoint-of-sale advertising\nprint advertising\nproduct advertising\nspot advertising\nsubliminal advertising"}