{"id":4671,"name":"advertise","type":"verb","us_sound":"ˈæd.vɚ.taɪz","us_link":"../audio/a/eus70100.mp3","uk_sound":"ˈæd.və.taɪz","uk_link":"../audio/a/ukadult029.mp3","content":"Add to word list\nAdd to word list\nB1 to make something known generally or in public, especially in order to sell it: We advertised our car in the local newspaper. He advertises his services on the company notice board. I'm going to advertise for (= put a notice in the newspaper, local shop, etc., asking for) someone to clean my house. advertise the fact\nto make something generally known: There's no harm in applying for other jobs, but if I were you, I wouldn't advertise the fact at work.\nSee more\nMore examplesFewer examplesThey advertise clothes 'for the fuller figure'.It is most expensive to advertise at peak viewing times.The concert was well enough advertised but ticket sales were poor.Teaching posts are advertised in Tuesday's edition of the paper.The market for those dreadful compilation records you see advertised on TV is just another of life's great mysteries.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ndetoxify\ndifferentiator\ndogfooding\nflyer\nfreesheet\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nRelated word\nadvertiser\nAdd to word list\nAdd to word list\nto make something known generally or in public, esp. in order to sell it: [ T ] He advertises his business on the Internet. [ I ] I’m going to advertise for (= put a notice in the newspaper asking for) someone to clean my house. advertiser noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈæd·vərˌtɑɪ·zər/\nCar companies are major TV advertisers.\nAdd to word list\nAdd to word list\nMARKETING to make a product or service known about in order to sell it, for example using the internet, magazines, television, or billboards: Financial companies have changed the way they advertise. The product was heavily advertised in local media.advertise sth as sth The bond was originally advertised as \"no liability to basic rate income tax\". Compare\npromote\npublicize\nWORKPLACE, HR to make it known that a job or work is available, by putting an advertisement in a newspaper or on the internet: advertise for sth The company is advertising for a new commercial manager."}