{"id":4651,"name":"adverse","type":"adjective","us_sound":"ædˈvɝːs","us_link":"../audio/a/adverse.mp3","uk_sound":"ˈæd.vɜːs","uk_link":"../audio/a/ukadult025.mp3","content":"Add to word list\nAdd to word list\nC2 having a negative or harmful effect on something: adverse publicity They received a lot of adverse publicity about the changes.adverse effect So far the drug is thought not to have any adverse effects.adverse reaction I had an adverse reaction to the injection.adverse conditions The match has been cancelled because of adverse conditions.adverse weather The forecasters are expecting adverse weather for the next few days. Synonyms\ndisadvantageous\ninauspicious formal\nunfavourable UK\nMore examplesFewer examplesHe attracted a lot of adverse publicity with his speech about unmarried mothers.Reactions to the proposal so far have been adverse, but we may convince people in time.The world record attempt was postponed due to adverse conditions.He knew there would be an adverse reaction from his friends, so he tried to keep their affair secret.It is clear that these violent films have an adverse effect on children.\nSMART Vocabulary: related words and phrases\nDangerous and harmful\nadverse conditions\nadverse effect\nadverse publicity\nadverse reaction\nadverse weather\ndestructive\ndestructively\ndestructiveness\ndetrimental\ndetrimentally\ninjuriously\ninsidious\ninsidiousness\nkiss of death idiom\nmalicious\nstinking thinking\nsuicidally\ntreacherously\ntroublesome\nunholy\nSee more results »\nRelated word\nadversely\nAdd to word list\nAdd to word list\ngoing against something, or causing harm: Her policies may have adverse effects on the economy.\nAdd to word list\nAdd to word list\nharmful or likely to cause problems: A chain reaction of adverse events in the financial markets has put lenders under severe pressure.adverse effect/impact/change Recent bad publicity has had an adverse effect on sales.adverse conditions/consequences/circumstances Many experts believe it may be too late to prevent adverse consequences to the world's climate system.adverse reaction/side-effect Some people have adverse reactions to additives and preservatives used in many foods."}