{"id":4674,"name":"advertisement","type":"noun","us_sound":"ˌæd.vɚˈtaɪz.mənt","us_link":"../audio/a/advertisement.mp3","uk_sound":"ədˈvɜː.tɪs.mənt","uk_link":"../audio/a/ukadult030.mp3","content":"Add to word list\nAdd to word list\nA2 (informal ad); (UK also informal advert) a picture, short film, song, etc. that tries to persuade people to buy a product or service: I saw an advertisement for the new restaurant that opened in town. Many companies run advertisements in the magazine. The impression given in the advertisement is misleading.\na piece of text that tells people about a job, event, etc: She scanned the job advertisements in the paper. She saw an advertisement asking for volunteers to take part in a study. We've been deluged with replies to our advertisement. be an advertisement for something\nIf someone or something is an advertisement for something, they show its good effects: I'm afraid I'm not a very good advertisement for the diet since I've actually put on weight!\nSee more\nMore examplesFewer examplesThat advertisement is demeaning to women.Both men and women have complained about the advertisement.That's a very effective advertisement - it really jumps out at you.Responses to our advertisement have been disappointing.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ndetoxify\ndifferentiator\ndogfooding\nflyer\nfreesheet\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nApplying for a job\nAdd to word list\nAdd to word list\na paid notice that tells people about a product or service: I saw an advertisement for the job in yesterday’s paper.\nAdd to word list\nAdd to word list\nMARKETING a picture, sign, etc. that is used to make a product or service known and persuade people to buy it: an advertisement for sth Her first modelling job was in an advertisement for baked beans.place/put an advertisement somewhere They have started to place advertisements in popular magazines.run an advertisement Like other blogs, his sites run advertisements for debt-reduction services.an advertisement features/shows sth The advertisement features a father reading a bedtime story to his young daughter. a television/newspaper/internet, etc. advertisement A full-page advertisement costs £600 in her publication.\nWORKPLACE, HR\n&#160; (also job advertisement) a short piece of writing, for example in a newspaper or on the internet, that advertises a job with a particular company or organization: an advertisement for sth He spotted a job advertisement for a reporter on a current affairs TV program.place/run an advertisement The second option was to place an advertisement of the vacancy.reply to/respond to/answer an advertisement When you answer an advertisement, look for words that ask directly about your skills and experience. Compare\nclassified adSee also\nbanner ad\nbutton ad\nclassified advertisement\ndisplay advertisement"}