{"id":4633,"name":"adverb","type":"noun","us_sound":"ˈæd.vɝːb","us_link":"../audio/a/adverb.mp3","uk_sound":"ˈæd.vɜːb","uk_link":"../audio/a/ukadult021.mp3","content":"Add to word list\nAdd to word list\nA2 a word that describes or gives more information about a verb, adjective, adverb, or phrase: In the phrase \"she smiled cheerfully\", the word \"cheerfully\" is an adverb. In the phrase \"the house was spotlessly clean\", the word \"spotlessly\" is an adverb.\nMore examplesFewer examplesIn the sentence 'She ran quickly', the adverb 'quickly' modifies the verb 'ran'.Can you think of any other adverbs with the same meaning as 'slowly'?In English, adverbs are usually formed by adding 'ly' to the end of an adjective.Today we learned about adverbs of manner, time and place.A phrasal verb consists of a verb in combination with a preposition or adverb.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\ndefinite article\npart of speech\nprep\npronoun\nrelative pronoun\nSee more results »\nRelated word\nadverbialGrammar\nAdverbsAdverbs are one of the four major word classes, along with nouns, verbs and adjectives. We use adverbs to add more information about a verb, an adjective, another adverb, a clause or a whole sentence and, less commonly, about a noun phrase. …\nAdverbs: usesAdverbs are one of the four major word classes, along with nouns, verbs and adjectives. We use adverbs to add more information about a verb, an adjective, another adverb, a clause or a whole sentence and, less commonly, about a noun phrase. …\nAdverbs: meanings and functionsAdverbs have many different meanings and functions. They are especially important for indicating the time, manner, place, degree and frequency of something. …\nAdverbs: formsAdverbs have a strong connection with adjectives. Adjectives and adverbs are usually based on the same word. Adverbs often have the form of an adjective + -ly. …\nAdverbs ending in -lyAdverbs have a strong connection with adjectives. Adjectives and adverbs are usually based on the same word. Adverbs often have the form of an adjective + -ly. …\nAdverbs ending in -ward(s) or -wiseThere is a small group of adverbs which end in -ward(s) or -wise. The -ward(s) words can end in either -ward or -wards (inward, inwards). …\nAdverbs with the same form as adjectivesSome adverbs have the same form as adjectives. The most common are: fast (not fastly), left, hard, outside, right, straight, late, well, and time words such as daily, weekly, monthly, yearly. …\nAdjectives ending in -lySome adjectives end in -ly, e.g. lively, lonely, ugly. We don’t form adverbs from these adjectives because they are not easy to pronounce. We usually reword what we want to say instead. …\nAdverbs not related to adjectivesSome adverbs (e.g. just, quite, so, soon, too, very) are not directly related to adjectives: …\nGradable adverbsMost adverbs, like most adjectives, are gradable (they can express different degrees of qualities, properties, states, conditions and relations). We can modify adverbs using other types of adverbs and comparative forms to make longer adverb phrases. …\nAdverbs: functionsAdverbs can modify verbs, adjectives, nouns, other adverbs and whole phrases or sentences: …\nAdverbs: typesTime adverbs tell us about when something happens. …\nTime, place and manner adverbs (early, there, slowly)Time adverbs tell us about when something happens. …\nDegree adverbs (slightly) and focusing adverbs (generally)Degree and focusing adverbs are the most common types of modifiers of adjectives and other adverbs. Degree adverbs express degrees of qualities, properties, states, conditions and relations. Focusing adverbs point to something. …\nEvaluative adverbs (surprisingly) and viewpoint adverbs (personally)We put some adverbs outside the clause. They modify the whole sentence or utterance. Evaluative and viewpoint adverbs are good examples of this: …\nLinking adverbs (then, however)Linking adverbs show a relationship between two clauses or sentences (e.g. a sequence in time, cause and effect, contrast between two things): …\nAdverbs as discourse markers (anyway, finally)Discourse markers organise longer pieces of conversation or text. They can mark the openings or closings of conversations, changes in topics, and other functions connected with organising a conversation or text. Most discourse markers belong to the class of adverbs. …\nAdverbs as short responses (definitely, certainly)We often use some adverbs in speaking as short responses to show attitude or viewpoint: …\nAdverb phrasesAn adverb phrase consists of one or more words. The adverb is the head of the phrase and can appear alone or it can be modified by other words. Adverbs are one of the four major word classes, along with nouns, verbs and adjectives. …\nAdverb phrases: formsAn adverb phrase consists of one or more words. The adverb is the head of the phrase and can appear alone or it can be modified by other words. Adverbs are one of the four major word classes, along with nouns, verbs and adjectives. …\nAdverb phrases: types and meaningsAn adverb phrase can consist of one adverb or an adverb plus other words before it (premodification) or after it (postmodification). Adverb phrases have many different meanings. …\nAdverb phrases: functionsWe use adverb phrases most commonly to modify verbs. In the examples the adverb phrases are in bold. The verbs that they modify are underlined: …\nAdverbs and adverb phrases: positionWe can put adverbs and adverb phrases at the front, in the middle or at the end of a clause. …\nTypes of adverbs and their positionsDifferent types of adverbs go in different places. …\nManner, place and timeAdverbs of manner, place and time usually come in end position: …\nEvaluative and viewpointAdverbs indicating the attitude and point of view of the speaker or writer usually go at the beginning. These adverbs are called sentence adverbs because they refer to the whole sentence or utterance: …\nPosition with here and thereIf the subject is a pronoun (it/he/she/you etc.), it comes directly after the adverbs here and there. If the subject is a noun, it comes directly after the verb: …\nAdverbs and adverb phrases: typical errorsMany errors with adverbs are spelling errors: …\nAdverbs: comparative and superlative formsAdverbs do not normally change in form, but a few have comparative and superlative forms. These are usually short adverbs and so they normally have comparative and superlative forms with -er and -est. …\nAdverbs with more and mostAdverbs with two or more syllables form the comparative and superlative with more and most: …\nWell and badlyThe adverb well has the same comparative and superlative forms as the adjective good (better, best). The adverb badly has the comparative and superlative forms worse, worst: …\nComparative adverbs: using thanWhen we mention the second person or thing in the comparison, we use than. We do not use that or as. If the second person mentioned takes the form of a personal pronoun, we normally use the object form of the pronoun (me, you, him, her, us, them): …\nAdd to word list\nAdd to word list\ngrammar a word that describes or gives more information about another word, esp. a verb, adjective, or other adverb, or about a phrase: In the sentences, \"She smiled cheerfully\" and \"He waited right outside the door,\" \"cheerfully\" and \"right\" are adverbs. adverbial adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ædˈvɜr·bi·əl/\nan adverbial phrase"}