{"id":4688,"name":"advice","type":"noun","us_sound":"ədˈvaɪs","us_link":"../audio/a/advice.mp3","uk_sound":"ədˈvaɪs","uk_link":"../audio/a/ukadver004.mp3","content":"Add to word list\nAdd to word list\nA2 an opinion that someone offers you about what you should do or how you should act in a particular situation: I need some advice on which computer to buy.give someone advice Steven gave me some good advice.piece of advice Can I give you a piece of advice?take someone's advice I think I'll take your advice (= do what you suggest) and get the green dress. [ + to infinitive ] My advice is to go by train.on someone's advice We went to Paris on Sarah's advice.on the advice of On the advice of my doctor, I started riding my bicycle more frequently.\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto give someone advicegive adviceCan you give me some advice about what to wear?adviseThe doctor advised me to get plenty of rest.counselHe counselled the young man to keep his silence.recommendDoctors recommend regular exercise.advocateI would advocate a system that is fair to everyone.\nSee more results »\nMore examplesFewer examplesThe centre provides expert advice for people with financial problems.I decided to follow her advice and go to bed early.The service offers young people practical advice on finding a job.I've always valued her advice.You should get some legal advice before you take any further action.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nagony uncle\nbrain trust\nclinic\nconsultant\ncounselling\nguidance\nMonday-morning quarterback idiom\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\nsteer\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nGrammar\nAdvice or advise?Advice /ədˈvɑɪs/ is a noun and means a suggestion about what someone should do. It is uncountable: …\nAdd to word list\nAdd to word list\nan opinion that someone offers you about what you should do or how you should act in a particular situation: She gave me some good advice. I think I’ll take your advice and go home.\nAdd to word list\nAdd to word list\n[ U ] an opinion that someone gives you about what you should do or how you should behave in a particular situation: advice about sth Some of them give really helpful advice about the job market.advice about/on sth Speak to an independent financial adviser for advice on personal pensions. Managers were asked what one piece of advice they would give to the board to improve the quality of their working lives.give/provide/offer advice He offers advice on rights when buying goods or services.take/follow/seek advice A recent survey found that private investors are two and a half times more likely to follow advice in a newspaper column than from a financial adviser.career/technical advice The website offers career advice for executives.financial/tax/legal advice The firm sought independent legal advice.\n[ C or U ]\n&#160; LAW a formal document telling you about a legal or financial arrangement you have been involved in: advice of sale/dispatch/delivery The new owner was worried after receiving advice of sale from the vendor's lawyer. See also\ncredit advice\nletter of advice\nremittance advice"}