{"id":4723,"name":"advocate","type":"verb","us_sound":"ˈæd.və.keɪt","us_link":"../audio/a/advocate_01_00.mp3","uk_sound":"ˈæd.və.keɪt","uk_link":"../audio/a/ukadver013.mp3","content":"Add to word list\nAdd to word list\nC2 [ I or T ] to publicly support or suggest an idea, development, or way of doing something: [ + -ing verb ] She advocates taking a more long-term view. He advocates the return of capital punishment. We will continue to advocate for a regional, cooperative approach to the construction project.\nThesaurus: synonyms, antonyms, and examples\nto give someone advicegive adviceCan you give me some advice about what to wear?adviseThe doctor advised me to get plenty of rest.counselHe counselled the young man to keep his silence.recommendDoctors recommend regular exercise.advocateI would advocate a system that is fair to everyone.\nSee more results »\n[ I ] to speak for, support, or represent a person or group of people who may need extra help or protection: A lot of people living in desperate poverty are taken advantage of and need someone to advocate for them. The Education Trust advocates on behalf of disadvantaged and minority students.\n[ I ] to speak for or defend someone in a court of law: At least in court a defendant has a lawyer to advocate for him.\nMore examplesFewer examplesHe was part of an extreme political group that advocated the complete overthrow of the political system.Heart disease specialists advocate a diet low in cholesterol.The author denied that his new book advocated violence.Trotsky advocated worldwide revolution.After the death of their son, they devoted themselves to advocating for police reform.Our mission is to advocate for better support and counselling for current and former soldiers.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nRelated word\nadvocacy\na lawyer who speaks for or defends someone in a court of law: She has been the advocate for plaintiffs in many successful libel cases. Candidates for the post need to have at least 5 years experience as a solicitor or advocate.\nsomeone who speaks for, supports, or represents a person or group of people who may need extra help or protection: Advocates and community leaders say that support services for homeless children are inadequate. We work as patient advocates for people living in mental health facilities.\nsomeone who publicly supports or recommends an idea, a policy, etc.: He's a strong advocate of state ownership of the railways. She is known as an advocate for tax cuts. I'm an advocate of drinking plenty of water.\nMore examplesFewer examplesSince regulators laid charges against him, his advocates have filed a flurry of papers.Many autism advocates believe that diagnosis takes too long.Consumer advocates say that the changes will disproportionately affect the poor.Food safety advocates called for a change in the law.The singer became a passionate advocate for breast screening after it led to early detection of her cancer.\nSMART Vocabulary: related words and phrases\nLawyers & legal officials\namicus\narticled\narticled clerk\nattorney\nattorney general\ncounsellor\nDPP\ndraftswoman\nfirm\nI rest my case idiom\nKC\nnotary\nparalegal\nprobation officer\nprocurator\nprocurator fiscal\nsuper-firm\nsuperlawyer\ntake silk idiom\ntribune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who help or serve people professionally\nSupporters, members & defenders\nAdd to word list\nAdd to word list\nto speak in support of an idea or course of action: [ T ] Some people advocate teaching to the test. [ I ] The organization advocates for human rights. advocacy noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈæd·və·kə·si/\nThese groups have been increasing their education advocacy. advocate noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈæd·və·kət/\nShe’s a strong advocate of women’s rights.\nAdd to word list\nAdd to word list\nto publicly support or suggest an idea, plan, or way of doing something: The Food Standards Agency advocated a ban on advertising junk food to children.advocate doing sth We would advocate selling those shares at current levels.\nsomeone who publicly supports something they believe in: an advocate for sth He was an advocate for small businesses around Newark.an advocate of sth She is a passionate advocate of \"organic\" clothes.\nLAW a lawyer who defends someone in a court: Advocates are often asked for their opinion on complex points of law."}