{"id":5140,"name":"aerosol","type":"noun","us_sound":"ˈer.ə.sɑːl","us_link":"../audio/a/aerosol.mp3","uk_sound":"ˈeə.rə.sɒl","uk_link":"../audio/a/ukaerog006.mp3","content":"Add to word list\nAdd to word list\na metal container in which liquids are kept under pressure and forced out in a spray: He's seen fires started by aerosols being sprayed on electrical equipment. Aerosol cans are banned from aircraft cabins.\nMore examplesFewer examplesMore babies suffered diarrhoea in homes where air fresheners - including sticks, sprays and aerosols - were used daily. Finish by misting your curls with an aerosol hair spray.As well as helping clouds form, aerosols absorb or scatter sunlight. An aerosol can travel considerable distances downwind, and still remain infectious to people.\nSMART Vocabulary: related words and phrases\nContainers for liquids and gases\namphora\nbottle\nbucket\ncanister\ncanning jar\nchurn\nflask\nhip flask\nhot-water bottle\nhottie\nhowler\ninkwell\noxygen tank\nsiphon\nsprayer\nstoup\nThermos\ntin can\ntinnie\ntravel mug\nSee more results »\nchemistry, environment\n&#160; specialized a mixture of particles (= extremely small pieces of matter) and the liquid or gas that they are contained in, that can spread through the air: The virus is spread primarily by aerosols, so that could be by sneezing, coughing, or even talking. Aerosols are one type of air pollution - the tiny particles suspended everywhere in our atmosphere.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosolize\nallotrope\namphiprotic\namphoteric\nchemical formula\ndistilled water\nelectrolyte\nendothermic\nepitaxial\nepitaxially\nepitaxy\nexothermic\ninorganic chemistry\nionic bond\nnonreactive\npreatomic\nreactive\nreactivity\nreduction\nSee more results »\nAdd to word list\nAdd to word list\na container in which liquids are kept under pressure and forced out in a spray (= mass of small drops): The gasses used in aerosols were damaging the atmosphere."}