{"id":5293,"name":"affair","type":"noun","us_sound":"əˈfer","us_link":"../audio/a/affair.mp3","uk_sound":"əˈfeər","uk_link":"../audio/a/ukaerog017.mp3","content":"affair noun [C]\n(MATTER)\nAdd to word list\nAdd to word list\nB2 a situation or subject that is being dealt with or considered: foreign affairs As a leader, he's been criticized for his inexperience in foreign affairs.interfere in someone's affairs He's always interfering in (= trying to influence) other people's affairs.financial affairs She organizes her financial affairs very efficiently. What I do in my spare time is my affair (= only involves me).\nB2 a matter or situation that causes strong public feeling, usually of moral disapproval: The arms-dealing affair has severely damaged the reputation of the government. The president's handling of the affair has been criticized.\nMore examplesFewer examplesThe whole affair does not reflect well on the government.He put his affairs in order before he went into hospital.I've never been very money-minded - I leave all my business affairs to my financial adviser.The director has come in for a lot of criticism over his handling of the affair.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nkingdom\nleitmotiv\nprovince\nscene\nscore\nspecialism\nsubject\ntalk\ntheme\nthemed\ntopically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSituations and circumstances\naffair noun [C]\n(RELATIONSHIP)\nB2 a sexual relationship, especially a secret one: extramarital affair She discovered that her husband was having an extramarital affair.have an affair She's having an affair with a married man.love affair The book doesn't make any mention of his love affairs.\nMore examplesFewer examplesShe discovered (that) her husband was having an affair.They have been rather indiscreet about their affair.It's an open secret around the office that they're having an affair.Their love affair began against a backdrop of war.She hired a private detective to find out if her husband was having an affair.\nSMART Vocabulary: related words and phrases\nRelationships: infidelity\nadulterer\nadulterous\nadultery\nbigamous\nbigamously\ncuckold\nextramarital\nextramarital affair\nfaithless\nfaithlessly\ninconstancy\ninfidelity\nmess around with something\non the side idiom\nplay around\nroam\ntwo-timer\nunfaithful\nunfaithfulness\nwander\nSee more results »\naffair noun [C]\n(EVENT)\nan event: The party turned out to be a quiet affair.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\ndevelopment\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nproceedings\nreoccurrence\nspree\nsynchronicity\nthing\nSee more results »\naffair noun [C]\n(THING)\nold-fashioned an object of the type stated: She wore a long black velvet affair.\nSMART Vocabulary: related words and phrases\nObjects - general words\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\nphenomenon\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nthing\nSee more results »\naffair noun [C]\n(SITUATION)\nAdd to word list\nAdd to word list\na situation or subject that is being dealt with or considered; a matter: The meeting was addressed by an expert in South American affairs. What I do in my spare time is my own affair (= a private matter).\naffair noun [C]\n(RELATIONSHIP)\na sexual relationship, esp. a secret one\naffair noun [C]\n(EVENT)\nan event: Their wedding was a pretty boring affair."}