{"id":5300,"name":"affect","type":"verb","us_sound":"əˈfekt","us_link":"../audio/a/affect.mp3","uk_sound":"əˈfekt","uk_link":"../audio/a/ukaerog018.mp3","content":"affect verb [T]\n(INFLUENCE)\nAdd to word list\nAdd to word list\nB2 to have an influence on someone or something, or to cause a change in someone or something: Both buildings were badly affected by the fire. The divorce affected every aspect of her life. It's a disease that affects mainly older people. I was deeply affected by the film (= it caused strong feelings in me).\nThesaurus: synonyms, antonyms, and examples\nto have power to cause a change in someone or somethingaffectLow-income women were disproportionately affected by the legislation. influenceThe jury could have been influenced by all the media coverage surrounding the case.be/fall under someone's influence/spellThe young queen seemed to fall under the spell of her counsellor, believing everything he told her.be under someone's spellWe warned her about him, but all he had to do was turn on the charm and she was under his spell.guideHe is guided by the core beliefs of his religion.impactSevere storms will impact on travel across the region tonight.\nSee more results »\nMore examplesFewer examplesThe new rates will affect all consumers including businesses.Researchers are looking at how a mother's health can affect the baby in the womb.His illness affects almost every aspect of his life.Farmers and market gardeners have been badly affected by the drought.You couldn't fail to be affected by the film.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\ncarry something over\ncolour\nconflict\near\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\njerk\npen\nrail\nspill\nspill over\nsportswashing\nstart (something) off\ntalismanic\nSee more results »\naffect verb [T]\n(PRETEND)\nformal to pretend to feel or think something: To all his problems she affected indifference.\nThesaurus: synonyms, antonyms, and examples\nto act as if something is true when it is notpretendShe pretended not to know about the surprise.make believeHe's just going to make believe that things are fine in spite of the divorce.play at somethingUK The children are playing at cops and robbers.role-playDuring class, we role-played being a customer and a salesperson to learn words related to shopping. fakeShe's only faking being ill.feignThe police questioned him about the break-in, but he feigned ignorance.\nSee more results »\nformal mainly disapproving to start to wear or do something in order to make people admire or respect you: At university he affected an upper-class accent. He's recently affected a hat and cane.\nSMART Vocabulary: related words and phrases\nFaking & pretending\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncharlatan\ncry\nfalse\nfalse modesty\nfalsifiable\nfalsify\nfeign\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nGrammar\nAffect or effect?Affect is a verb meaning ‘influence or cause someone or something to change’: …\naffect verb [T]\n(INFLUENCE)\nAdd to word list\nAdd to word list\nto have an influence on someone or something: The disease only affects cattle. I was deeply affected by the film.\naffect verb [T]\n(PRETEND)\nto pretend to be or have something: Since joining the band he’s affected a ridiculous southern accent."}