{"id":5373,"name":"affiliate","type":"verb","us_sound":"əˈfɪl.i.eɪt","us_link":"../audio/a/affiliate_01_00.mp3","uk_sound":"əˈfɪl.i.eɪt","uk_link":"../audio/a/ukaerog028.mp3","content":"Add to word list\nAdd to word list\nto cause a group to become part of or form a close relationship with another, usually larger, group, or organization: a college affiliated to the University of Mumbai The school is affiliated with a national association of driving schools.\nSMART Vocabulary: related words and phrases\nCreating alliances\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\nintegrate\njoin\nnetwork\npair\npair off\npair up\npairing\nSee more results »\nan organization that is connected with or controlled by another, usually larger, organization: Our college is an affiliate of the university.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nAdd to word list\nAdd to word list\nto become part of or form a close relationship with a group or organization: [ T ] I’m not affiliated with any political party. [ I ] The two schools will affiliate next year. affiliation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˌfɪl·iˈeɪ·ʃən/\n[ C ] The group has affiliations with several organizations abroad.\none part of a larger group or organization: The show is broadcast on most of the network’s affiliates.\nAdd to word list\nAdd to word list\nan organization that is officially connected with or controlled by another, usually larger, organization: The study estimates that the school and its affiliates generate employment of 52,459 workers. The company has sold its affiliate marketing business.\nbe affiliated with/to sth\nto be officially connected with or controlled by another, usually larger, company or organization: The trust is affiliated with another nonprofit group. In Dubai, most of the major hotels are affiliated to one of the several world-class golf courses."}