{"id":5576,"name":"afraid","type":"adjective","us_sound":"əˈfreɪd","us_link":"../audio/a/afraid.mp3","uk_sound":"əˈfreɪd","uk_link":"../audio/a/ukafore002.mp3","content":"afraid adjective\n(FEAR)\nAdd to word list\nAdd to word list\nA2 [ after verb ] feeling fear, or feeling worry about the possible results of a particular situation: afraid for She was afraid for her children (= feared that they might be hurt).afraid of I've always been afraid of flying/heights/spiders. He was/felt suddenly afraid. [ + to infinitive ] Don't be afraid to say what you think. [ + (that) ] She was afraid (that) he might be upset if she told him. Synonyms\nfrightened\npetrified (FRIGHTENED)\nscared\nterrified\nThesaurus: synonyms, antonyms, and examples\nafraidafraidShe was afraid of the dark.frightenedDon't be frightened, my dog is quite friendly.scaredAre you scared of spiders?petrifiedHe got to the top of the tree and was absolutely petrified he'd fall.terrifiedI'm terrified of flying.panic-strickenShe was panic-stricken when her little boy disappeared.\nSee more results »\nMore examplesFewer examplesShe's afraid of being attacked if she walks across the park.He wasn't afraid to stand up to bullies.The government is afraid of further serious rioting today.Being afraid of the dark, she always slept with the light on.Don't go up the tower if you're afraid of heights.\nSMART Vocabulary: related words and phrases\nAfraid\nafraid for someone/something\nafraid of someone/something\nbe in fear of your life phrase\nbe like a deer/rabbit caught in the headlights idiom\nbottle\nfrit\ngoosey\ngun-shy\nhave a horror of something idiom\nhorror-struck\nleaf\npanic\nquake\nshake\nshake like a leaf idiom\nshit a brick idiom\nsquirrelly\nterrified\nterror\nterror-stricken\nSee more results »\nafraid adjective\n(SORRY)\nI'm afraid...\nA2 used to politely introduce bad news or disagreement: This is your room - it's rather small, I'm afraid.\nSee more I'm afraid not (also afraid not)\nused to politely say \"no\": \"Was she impressed with our work?\" \"I'm afraid not.\"\nSee more I'm afraid so\n(also afraid so) used to say \"yes\" or agree with something though you are sad or upset over that thing : \"Does this mean I've got to leave?\" \"I'm afraid so.\"\nSee more Grammar\nAfraidAfraid as an adjective means ‘feeling fear’. We use it with of + noun, of + -ing form, a to-infinitive or a that-clause: …\nafraid adjective\n(FEARFUL)\nAdd to word list\nAdd to word list\nfeeling fear, or feeling anxiety about the possible results of a particular situation: She was afraid, but never thought of quitting. I’ve always been afraid of heights. Dad’s afraid I’ll end up like my cousin. He’s not afraid of losing.\nafraid adjective\n(FEELING REGRET)\n[ not gradable ] feeling regret, esp. because something is not the way you think it should be: A lot of those stores will cheat you, I’m afraid."}