{"id":5620,"name":"after","type":"preposition","us_sound":"ˈæf.tɚ","us_link":"../audio/a/after.mp3","uk_sound":"ˈɑːf.tər","uk_link":"../audio/a/ukafore011.mp3","content":"after preposition\n(FOLLOWING IN TIME OR PLACE)\nAdd to word list\nAdd to word list\nA1 following in time, place, or order: Let's go for a walk after breakfast.life after death Some people believe in life after death. Her name came after mine on the list.the day after tomorrow There's a good film on the day after tomorrow.well after She waited until well after midnight.soon after She went back to work soon after the birth.a quarter after US It's a quarter after four.day after day She just keeps on working, day after day (= continuously).week after week She just keeps on working, week after week (= continuously). We've had meeting after meeting (= many meetings) to discuss this point. Jessie seemed very small after (= in comparison with) Michael's children. The children have to learn to tidy up after themselves (= after they have made things untidy). She slammed the door after (= behind) her. We ran after (= followed) him, but he escaped. Could you lock up after you (= when you leave), please?\nThesaurus: synonyms, antonyms, and examples\nafter somethingafterAfter the show we were invited back to the dressing room.followingThe years following the war were hard. subsequent toSubsequent to her appearance on TV she received many bookings.post-I’m doing post-doctoral research.nextWhat is the next step in your treatment?\nSee more results »\nafter everything (that)\nconsidering all the things that: After everything I've done for you, is this the way you treat me?\nSee more after what\nbecause of what: After what she did to me, I'll never trust her again.\nSee more be after someone/something informal\nto be looking for someone or something or trying to find or get them or it: The police are after him.\nSee more after you\nused to say politely that someone can go ahead of you or do something before you: \"Can I pour you some coffee?\" \"Oh no, after you.\"\nSee more\nMore examplesFewer examplesI'll meet you down at the club after work.The boat sank almost immediately after it had struck the rock.She was amazed at how calm she felt after the accident.Apply the sun cream liberally to exposed areas every three hours and after swimming.If we turn left at the next junction, we should hit the main road after five miles or so.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAfter & behind\nafter preposition\n(SIMILAR TO)\ntypical of or similar to the style of: a painting after Titian a concerto after Mozart\nC2 used when giving someone or something the same name as another person or thing: He was named Mark after his grandfather.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nGrammar\nAfter, afterwardsAfter means ‘later than’ and ‘next in time or place’. …\nAfter as a preposition and conjunctionAfter means ‘later than’ and ‘next in time or place’. …\nAfter or afterwards as an adverbWe can use after as an adverb, but afterwards is more common. When after is used, it is usually as part of an adverb phrase: …\nAfter: typical errorWhen after refers to future time, we use the present simple, not the future with shall or will: …\nIdiom\nafter all\nA2 later than someone or something else: soon after Hilary got here at midday and Nick arrived soon after. I can't go next week - how about the week after (= the following week)?not standard She got back at 4.30 and went to see Emilie after (= after she got back). Synonym\nafterwards mainly UK\nThesaurus: synonyms, antonyms, and examples\nafterwardsafterwardsUK Afterwards I was sorry I'd been so hasty.afterThey met in 1962 and got married not long after.laterWhat are you doing later?later onI'll call you later on.at a later dateWe can add these details at a later date.nextNext, a balloon and stent are used to open the blocked artery.\nSee more results »\nMore examplesFewer examplesHe collapsed at work and died soon after.After nine years in Cambridge, Susannah and Guy moved to Watlington, where they lived happily ever after.Let's feed the kids first and have our dinner after.You have a good cry and you'll feel better after.Mary left the company and I found another job shortly after.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nGrammar\nAfter, afterwardsAfter means ‘later than’ and ‘next in time or place’. …\nAfter as a preposition and conjunctionAfter means ‘later than’ and ‘next in time or place’. …\nAfter or afterwards as an adverbWe can use after as an adverb, but afterwards is more common. When after is used, it is usually as part of an adverb phrase: …\nAfter: typical errorWhen after refers to future time, we use the present simple, not the future with shall or will: …\nB1 at a time that is later than another event: Three months after they moved out, the house was still empty.soon after He was captured in 1940 soon after the fighting began.shortly after Shortly after we set off, the car started to make a strange noise.immediately after I went to the post office immediately after I left you.\nMore examplesFewer examplesSoon after we set off, Molly said she felt sick.He bought a train ticket immediately after talking to her.I'm going home straight after netball practice.Soon after moving to London, she got a new job.A year after leaving his job, he is still unemployed.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nGrammar\nAfter, afterwardsAfter means ‘later than’ and ‘next in time or place’. …\nAfter as a preposition and conjunctionAfter means ‘later than’ and ‘next in time or place’. …\nAfter or afterwards as an adverbWe can use after as an adverb, but afterwards is more common. When after is used, it is usually as part of an adverb phrase: …\nAfter: typical errorWhen after refers to future time, we use the present simple, not the future with shall or will: …\ncoming after: an after-dinner speech an after-hours club after-sales service\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nafter preposition\n(FOLLOWING)\nAdd to word list\nAdd to word list\nfollowing in time, place, or order: What do you want to do after breakfast? I expect to return to work after the baby comes. Repeat these words after me. I’ll see you the day after tomorrow. It’s ten minutes after four. Week after week (= For many weeks), he’s been too busy to help.\nafter preposition\n(BECAUSE)\nas a result of; because: After what she did to me, I’ll never trust her again. She’s named after her aunt (= given the same name in her honor).\nafter preposition\n(DESPITE)\ndespite: Even after everything that’s happened here, his behavior seems odd.\nafter preposition\n(WANTING)\nwanting to find or have: The police are after him. He’s after Jane’s job. after conjunction us\nYour browser doesn't support HTML5 audio\n/ˈæf·tər/\nThe house was empty for three months after they moved out. after adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈæf·tər/\nHilary drove up and Nick arrived soon after. Idiom\nafter all"}