{"id":5794,"name":"afterward","type":"adverb","us_sound":"ˈæf.tɚ.wɚd","us_link":"../audio/a/afterwards_afterward.mp3","uk_sound":"ˈɑːf.tə.wəd","uk_link":"../audio/a/ukafore025.mp3","content":"Add to word list\nAdd to word list\nA2 after the time mentioned: We had tea, and afterward we sat in the garden for a while. They separated, and soon/shortly afterward Jane left the country. Synonyms\nafter\nlater\nThesaurus: synonyms, antonyms, and examples\nafterwardafterwardUS Afterward I was sorry I'd been so hasty.afterThey met in 1962 and got married not long after.laterWhat are you doing later?later onI'll call you later on.at a later dateWe can add these details at a later date.nextNext, a balloon and stent are used to open the blocked artery.\nSee more results »\nMore examplesFewer examplesWe agreed on a price but afterwards they wanted $10 extra.If you're a good boy at the doctor's I'll take you swimming afterwards.Everyone would go into the hall for assembly and then afterwards we'd go to our respective classes.I vote (that) we go to the movies first and eat afterwards.He said he had to go to a meeting now, but that afterwards he'd come and discuss the problem.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nGrammar\nAfter, afterwardsAfter means ‘later than’ and ‘next in time or place’. …\nAfter as a preposition and conjunctionAfter means ‘later than’ and ‘next in time or place’. …\nAfter or afterwards as an adverbWe can use after as an adverb, but afterwards is more common. When after is used, it is usually as part of an adverb phrase: …\nAfter: typical errorWhen after refers to future time, we use the present simple, not the future with shall or will: …\nAdd to word list\nAdd to word list\nafter the time mentioned; later: We had a swim and afterward we lay on the beach for a while."}