{"id":5728,"name":"afternoon","type":"noun","us_sound":"ˌæf.tɚˈnuːn","us_link":"../audio/a/afternoon.mp3","uk_sound":"ˌɑːf.təˈnuːn","uk_link":"../audio/a/ukafore017.mp3","content":"Add to word list\nAdd to word list\nA1 the period that starts at about twelve o'clock or after the meal in the middle of the day and ends at about six o'clock or when the sun goes down: It was a sunny afternoon. She works three afternoons a week at the library. It was on a Saturday afternoon. My baby usually sleeps in the afternoon. Let's go to the park this afternoon. I spoke to her yesterday afternoon. I'll meet you tomorrow afternoon at about 3.30. She's coming round on Wednesday afternoon. He's been in a bad mood all afternoon. She likes to have an afternoon nap. We got an early-/mid-/late-afternoon flight.\nMore examplesFewer examplesIt had been raining hard most of the afternoon.He spent the afternoon doing jobs around the house.The meeting has been scheduled for tomorrow afternoon.She walks the dog for an hour every afternoon.I will have to cancel this afternoon's class - I'm sorry it's such short notice.\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoons\nall day\nam\narvo\nat the crack of dawn idiom\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nlast orders\nnoon\nnoontime\no'clock\noffice hours\nopening time\nthe witching hour\nwhite night\nwine o'clock\nworkday\nworking day\nSee more results »\na friendly way of greeting someone when you meet them in the afternoon: Afternoon, Bob! Compare\ngood afternoon\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nair kiss\naloha\nayup\nbid someone/something adieu\nbuh-bye\nfive\ng'day\ngod\nhello stranger idiom\nhowdy\nlady\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\npump someone's hand idiom\nshalom\nwish\nSee more results »\nAdd to word list\nAdd to word list\nthe period that starts at about twelve o’clock or after the meal in the middle of the day and ends at about six o’clock or when the sun goes down: [ C ] She works three afternoons a week at the library. [ U ] My baby usually sleeps in the afternoon. [ U ] I spoke to her yesterday afternoon."}