{"id":5832,"name":"again","type":"adverb","us_sound":"əˈɡen","us_link":"../audio/a/again.mp3","uk_sound":"əˈɡen","uk_link":"../audio/a/ukafore027.mp3","content":"again adverb\n(ONE MORE TIME)\nAdd to word list\nAdd to word list\nA1 one more time: Could you spell your name again, please? If he does it again I'll have to tell him. Deborah's late again. Throw it away and start again.\nA2 back to the original place or condition: We went to Edinburgh and back again all in one day. Get some rest and you'll soon be well again. once again\nB1 If something happens once again, it has already happened several times before: You are reminded once again of the author's love of the sea.\nSee more never again!\nsaid after an unpleasant experience to show that you do not intend to do it again: He drove me back home last night. Never again!\nSee more yet again\nB2 If something happens yet again, it has already happened many times before: I'm afraid it's been delayed yet again.\nSee more again and again\nB1 repeatedly: I've told you again and again not to do that.\nSee more all over again\nB2 If you do something all over again, you start again from the beginning: It's already taken me two hours - I don't want to have to do it all over again.\nSee more\nMore examplesFewer examplesIf you think it's wrong, cross it out and write it again.\"I never want to see you ever again, \" he shouted as he stormed out of the house.I'm not going to let him repair my bike again because he made a really bad job of it last time.I was very nervous about driving again after the accident.If the phone lines are busy, please try again later.\nSMART Vocabulary: related words and phrases\nContinually & repeatedly\n24/7\nad nauseam\nalway\nalways\nanew\nhour after hour idiom\nhourly\nimmemorial\njag\nmorning\nmorning, noon, and night idiom\nnight\nprevalently\nquick-fire\nrecurrently\nrepeated\nrepeatedly\nrumble\nstreak\nyear in, year out idiom\nSee more results »\nagain adverb\n(IN ADDITION)\nin addition to the amount we know about or have mentioned already: They are paid half as much again as we are.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nalong\nalso\netc.\nexcess\nfiller\nfor good measure idiom\nfor luck idiom\nhand\nrate\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nthrow something in\nSee more results »\nIdiom\nthen again\nAdd to word list\nAdd to word list\nonce more, or as before: Could you spell your name again please? Get some rest and you’ll soon be well again. Don’t be late again (= another time)."}