{"id":5894,"name":"agape","type":"adjective","us_sound":"əˈɡeɪp","us_link":"../audio/a/usaffec026.mp3","uk_sound":"əˈɡeɪp","uk_link":"../audio/a/ukafore029.mp3","content":"Add to word list\nAdd to word list\n(of a person) with the mouth wide open, especially showing surprise or shock; (of the mouth) wide open, especially in surprise or shock: We watched, our mouths agape in excitement. Audience members were staring at each other agape as if to say \"Did you hear what I just heard?\" Synonym\ngaping\nMore examplesFewer examplesThere she sat, mouth agape, as she took in her new surroundings.People wandered around the scene with mouths agape, some in tears, some simply sitting on the street in shock.Children and adults alike watched with jaws agape.His audacious vision left some software developers agape.\nSMART Vocabulary: related words and phrases\nSurprised\naback\naghast\namazed\nappalled\nastonished\nflabbergasted\nflat-footed\ngobsmacked\ngoggle-eyed\nheadlight\nhorror of horrors idiom\njaw\nnot know what hit you idiom\nopen-eyed\nopen-mouthed\npalpitation\npearl-clutching\nsomeone's jaw drops (open) idiom\nstalk\nyou have (got) to be kidding idiom\nSee more results »\na type of love that is not sexual and is not concerned with yourself; used especially in Christianity to refer to Christian love: Agape is a giving love, entirely unselfish. A central lesson of The Marriage Of Figaro is that eros can mature into agape, sexual attraction into mature love. Compare\nEros\nMore examplesFewer examplesThe Greeks separated various facets of love, and those involved in marriage are eros, philia and agape.The word that best describes this kind of love is not “eros\", not “agape\", but yet another Greek word, “philia\", which means “love between friends\".God gives you agape - deep, unconditional, fatherly love.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\nendearment\never-loving\nfall for someone\nfall in love idiom\nfeelings for someone idiom\ngaga\nmadly\nmoon\nmoon over someone/something\npash\npotty\nshine\ntreasure\nworship\nSee more results »"}