{"id":6000,"name":"agenda","type":"noun","us_sound":"əˈdʒen.də","us_link":"../audio/a/eus70118.mp3","uk_sound":"əˈdʒen.də","uk_link":"../audio/a/ukage__009.mp3","content":"Add to word list\nAdd to word list\nC1 a list of matters to be discussed at a meeting: There were several important items on the agenda. The question of security is high on the agenda for this afternoon's meeting.\nC2 a list of aims or possible future achievements: Women's rights have been put back on the agenda (= are being discussed publicly again). The subject of safety needs to be placed high on/at the top of the agenda (= must be discussed because it is very important). Education was placed firmly on the political agenda in the prime minister's weekend speech.\na secret aim or reason for doing something: She felt that some of the group had an agenda. There's no hidden agenda - I'm just trying to help.\nMore examplesFewer examplesPerhaps we could move on to discuss the next item on the agenda.Has everyone received a copy of the agenda for next week's meeting?Let's move on, or we will not have time to cover everything on the agenda.The agenda should include an item headed 'Any other business'.Action to prevent the spread of the disease is high on the government's agenda.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nAOB\nbusiness plan\ncalendar\ndatebook\ndeadline\nHegira\nHejira\nitinerary\njournal\nmake time idiom\npack\nprogramme\nschedule\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nsqueeze someone/something in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLists and catalogues\nIdiom\nset the agenda\nAdd to word list\nAdd to word list\na list of matters to be discussed at a meeting: Among the items on the agenda were next year’s budget and raising the membership dues.\nAn agenda can also refer to any matters that have to be dealt with: Finding a job is at the top of my agenda.\nesp. disapproving An agenda is also a particular program of action, often one that is not directly expressed: She has a political agenda.\nAdd to word list\nAdd to word list\nthe things that a person or organization considers to be important and wants to solve or achieve, or their reasons for wanting to do something: Agendas change with the times, as every CEO knows.economic/environmental/political agenda The Senator's environmental agenda is negative for traditional energy producers, but positive for alternative energy producers.be at the top of/be high on the agenda The plight of poorer countries is high on the WTO's agenda. Like any businessman he has an agenda, and that should not be forgotten.set/lay out/establish an agenda Company directors are attempting to lay out an agenda for reducing future financial risks. I strongly suspect that the author has a hidden agenda.\nMEETINGS a list of things to be discussed during a meeting: If you don't have a structured agenda, people will bring up side issues that aren't relevant to solving the problem. The next item on the agenda is a special report from the Advisory Committee.be at the top of/be high on the agenda At a meeting of finance ministers in St Petersburg, security of energy supply was at the top of the agenda."}