{"id":5997,"name":"agency","type":"noun","us_sound":"ˈeɪ.dʒən.si","us_link":"../audio/a/agency.mp3","uk_sound":"ˈeɪ.dʒən.si","uk_link":"../audio/a/ukage__008.mp3","content":"agency noun\n(ORGANIZATION)\nAdd to word list\nAdd to word list\nB1 [ C ] a business that represents one group of people when dealing with another group: an advertising/employment/estate/travel agency\nC1 [ C ] a government organization: an overseas aid agency the Central Intelligence Agency\nMore examplesFewer examplesThe advertising agency secured the contract on the back of their previous successful campaigns.The holiday was cancelled so the travel agency had to refund everybody the price of the tickets.The duty of the agency is to act in the best interests of the child.For several years she operated a dating agency from her basement flat.The agency was not accredited by the Philippine Consulate to offer contracts to Filipinos abroad.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagribusiness\nanswering service\nanti-conglomerate\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: government departments & organizations\nagency noun\n(ACTIONS)\n[ U ] the ability to take action or to choose what action to take: The protest gave us a sense of agency, a sense of our own power to make a difference. When the legal system acquitted these women on the grounds of insanity it denied their agency. through the agency of someone formal\nbecause of the actions of someone: She was freed from prison through the agency of her doctor.\nSee more\nMore examplesFewer examplesThis kind of neurological disorder should make us question our concepts of agency and free will.The toddler period is a key transition period for the development of independent functioning and a child's sense of agency.The character is a woman who has lost her voice and, with it, her agency.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nat will idiom\nautonomist\nautonomous\nautonomy\nblank cheque\nfree pass\nfree rein idiom\nfree spirit\nfree time\nfree will\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\npaddle\npaddle your own canoe idiom\nthe world is someone's oyster idiom\nwiggle room\nwriggle room\nSee more results »\nagency noun [C]\n(REPRESENTATIVE)\nAdd to word list\nAdd to word list\na business acting for or representing a person, an organization, or another business: an advertising/employment agency a real estate agency\nAn agency is also a government organization: federal agencies the Environmental Protection Agency\nAdd to word list\nAdd to word list\nCOMMERCE a business that provides a service to other people or organizations: Background checks may be done in-house or by an outside agency. She now runs an agency which last year catered for more than 17,000 travellers.\nGOVERNMENT a government department that is responsible for a particular activity: Scottish Natural Heritage, the conservation agency, has finally managed to get approval for the project.security/intelligence/immigration, etc. agency In a lengthy response to the report, the immigration agency stated that it will follow the recommendations. a government/federal/state agency See also\nad agency\nadvertising agency\naid agency\ncollection agency\ncommercial agency\nemployment agency\nestate agency\ncredit rating agency\nreal estate agency\nrecruitment agency\nstaff agency\ntravel agency"}