{"id":6056,"name":"agglomerate","type":"verb","us_sound":"əˈɡlɑː.mɚ.eɪt","us_link":"","uk_sound":"əˈɡlɒm.ər.eɪt","uk_link":"","content":"Add to word list\nAdd to word list\nchemistry\n&#160; formal or specialized to join or stick together to form a larger mass or group, or to cause something to do this: Tiny carbon particles can cause damage in the lungs since they can agglomerate there. Throughout this time, political leaders have been steadily agglomerating powers. Synonyms\naccumulate\ncollect\nbusiness\n&#160; specialized to combine different companies to form one organization: Management experts warn that mergers often do not work well, so why are CEOs so eager to agglomerate? Most of these small companies are in the process of being agglomerated with other financial institutions. Synonym\namalgamate\nMore examplesFewer examplesHer team had succeeded in agglomerating the spores into fine particles suitable for aerosolizing.This interaction causes a small uncharged particle to agglomerate with other small uncharged particles, or to stick to an uncharged surface.Other additives which can be added during processing include agglomerating agents.Remuneration planning is important when companies agglomerate.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\ngarner\nharvest\nput something together\nrake something up\nreassemble\nreconcentrate\nreconcentration\nthe assembled company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nMergers & acquisitions\n[ C or U ]\n&#160; geology, chemistry\n&#160; specialized rock or material consisting of different pieces that are bonded (= joined and held) together: Volcanic agglomerate is one type of pyroclastic rock (rock formed from fragments of lava ejected from a volcano). To meet the increasing demand for detergents to be able to release oxygen at lower temperatures, a totally new agglomerate has been invented.\n[ C ] formal a mass or collection of things: Galaxies are huge agglomerates of stars, gas, and dust. Small businesses are being consolidated into large agglomerates.\nMore examplesFewer examplesThe plant is currently capable of producing 2.6 million tons of ironstone agglomerate annually.The coarsest materials or agglomerates show stratification least distinctly.A much higher proportion of our population will be living in urban agglomerates by 2050.\nSMART Vocabulary: related words and phrases\nGeology: types of rock\narenaceous\narenite\nasthenosphere\nasthenospheric\nbasaltic\nemery\nflinty\ngneiss\nintrusive\nlahar\nlodestone\nmagma\nmarcasite\nmarl\nmarmoreal\nmudstone\nobsidian\nsandstone\nschist\nshale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemicals, chemical compounds & gases\nBuilding materials\nGroups and collections of things"}