{"id":6147,"name":"aggressiveness","type":"noun","us_sound":"əˈɡres.ɪv.nəs","us_link":"../audio/a/cdo0319usaggr0021.mp3","uk_sound":"əˈɡres.ɪv.nəs","uk_link":"../audio/a/cdo0319ukaggr0021.mp3","content":"aggressiveness noun [U]\n(ATTACKING)\nAdd to word list\nAdd to word list\nthe quality of being likely to attack other people or animals, or to behave in a violent or angry way towards them: There were concerns about the child's disruptiveness and aggressiveness. These dogs are bred for aggressiveness.\nMore examplesFewer examplesAn animal's inherited temperament includes traits such as obedience, playfulness, and aggressiveness.Our addiction to oil feeds belligerence, aggressiveness, and war. Wherever oil is drilled, people are killed for profit. Maltreated children display a greater number of negative behaviours (such as aggressiveness, delinquency, self-harm).\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggro\nagonistic\nferocity\nfierce\nfierceness\nfighting words\nflex\noutrage\nproactive aggression\npugnacious\npugnaciously\npugnacity\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\naggressiveness noun [U]\n(DETERMINATION)\ndetermination to win or succeed, and the use of forceful action to do this: Her talent and aggressiveness make her a tennis star of the future.\nMore examplesFewer examplesHis challenge is to impose a new culture of ethics while maintaining the aggressiveness that led the bank to its global dominance.Many people would view the governor's forceful behaviour as commendable aggressiveness in doing his job.The player is widely feared and respected for his aggressiveness.Lawyers need a certain amount of aggressiveness to survive in a very competitive profession.He needs to play with more discipline but without losing the aggressiveness.\nSMART Vocabulary: related words and phrases\nStrength of will and determination\nbitter\nbloody-mindedness\ncharacter\ncharacter-building\ndetermination\ndoggedness\nfibre\ninsusceptible\nintransigence\ninveteracy\nmettle\nmilitancy\nrecalcitrance\nresiliently\nresolution\nresolve\nsingle-mindedness\nstamina\nunsusceptible\nwilfulness\nSee more results »\naggressiveness noun [U]\n(DISEASE)\nmedical\n&#160; specialized the quality in a disease of spreading quickly and being difficult to cure: A biopsy is the most effective means of determining the aggressiveness of the cancer.\nmedical\n&#160; specialized the quality in a treatment of being very strong and possibly harmful, because a condition is serious and difficult to cure: A classification system is essential for making decisions about aggressiveness of treatment.\nMore examplesFewer examplesOesophageal cancer is a disease with a poor prognosis and high aggressiveness.Several dozen genetic variants have been linked to a greater risk of developing prostate cancer, but this is the first to be associated with aggressiveness of the disease.Treatments are given with increasing aggressiveness according to the prognosis and risk of recurrence.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\nCGD\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCancer"}