{"id":6129,"name":"aggregation","type":"noun","us_sound":"ˌæɡ.rəˈɡeɪ.ʃən","us_link":"../audio/a/usagglo004.mp3","uk_sound":"ˌæɡ.rɪˈɡeɪ.ʃən","uk_link":"../audio/a/ukage__020.mp3","content":"Add to word list\nAdd to word list\n[ U ] the process of combining things or amounts into a single group or total: Installation art - the aggregation of objects in a space - has long dominated the visual arts. Some animals avoid being eaten by aggregation in groups, such as schools of fish.\n[ U or C ] the process of collecting information from several different websites, newspapers, databases (= large amounts of information stored in a computer system ), etc. and combining it in one place, or the result of this process: This news aggregation site grabs headlines from over 30 daily news sources and provides a link to the host site. You can view aggregations of polling data at the site.\nMore examplesFewer examplesThe aggregation of wealth by small groups of families caused social unrest.Drinking clarified tomato juice daily significantly reduced platelet aggregation in diabetes patients.They use data aggregation to deliver information products to knowledge professionals. The reviewer was impressed by the look and feel of the newly launched news aggregation site.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconvergence\ncor\ncross-Channel\ncumulate\ndesegregate\njunction\nkludge\nknit\nknock\nknock through something phrase\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCollecting and amassing\nSee\naggregate\nAdd to word list\nAdd to word list\n[ C or U ] a total calculated by adding different amounts, prices, etc.: The single profit figure is an aggregation of many, earned from completely different markets.\n[ C or U ]\n&#160; COMMERCE a combination of products or services that are sold together\n[ U ] the process of collecting and examining detailed information about people or organizations in order to decide how to market a product, who to lend money to, etc.: With our data aggregation service, market research companies and government organizations can rely on a single source for their operations."}