{"id":6145,"name":"aggressive","type":"adjective","us_sound":"əˈɡres.ɪv","us_link":"../audio/a/aggressive.mp3","uk_sound":"əˈɡres.ɪv","uk_link":"../audio/a/ukage__022.mp3","content":"aggressive adjective\n(ANGRY)\nAdd to word list\nAdd to word list\nB2 showing anger and a willingness to attack other people: The stereotype is that men tend to be more aggressive than women. If I criticize him, he gets aggressive and starts shouting. Aggressive behaviour will not be tolerated in the classroom.\nThesaurus: synonyms, antonyms, and examples\nviolentviolentHer ex-boyfriend was violent.aggressiveShe was very aggressive towards the TV reporters.ferociousA ferocious dog guarded the house.fierceThe battle for the stronghold was fierce, with hundreds of soldiers killed.savageIt was a savage attack.brutalHe was jailed for the brutal crime.\nSee more results »\nMore examplesFewer examplesHe is rebellious, aggressive and at times self-destructive.He's slightly aggressive, which a lot of people find a bit off-putting when they first meet him.The mood of the crowd suddenly turned aggressive.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressively\naggressiveness\naggro\nagonistic\nferocity\nfierce\nfierceness\nfighting words\nflex\noutrage\nproactive aggression\npugnacious\npugnaciously\npugnacity\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\naggressive adjective\n(DETERMINED)\nC1 determined to win or succeed and using forceful action to do this: an aggressive election campaign aggressive marketing tactics Both players won their first-round matches in aggressive style.\nMore examplesFewer examplesShe carved out a reputation for herself as an aggressive negotiator.We need our team to be more aggressive.\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressively\ngrittily\ngutsily\ngutsy\ngutty\nhard-boiled\npersistently\npertinacious\npertinaciously\npigheaded\npigheadedly\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nunbending\nSee more results »\naggressive adjective\n(MEDICAL)\nmedical\n&#160; specialized An aggressive condition is one that is serious and quickly spreads in the body or gets worse: The more aggressive the cancer, the further and faster it spreads.\nmedical\n&#160; specialized Aggressive treatment is strong treatment that could itself cause harm, used when someone has a serious condition: Brain cancer requires aggressive treatment such as surgery.\nSMART Vocabulary: related words and phrases\nCancer\nacinic cell carcinoma\nacral lentiginous melanoma\naggressively\naggressiveness\nalveolar rhabdomyosarcoma\nbilateral acoustic neurofibromatosis\nbilateral acoustic schwannoma\nbrachytherapy\nbrain tumour\ncancerous\ncarcinogen\ninoperable\nmalignantly\nmeningioma\nmetastasis\nmetastatic\nmyeloma\nprecancerous\nWaldenstrom macroglobulinaemia\nWilms' tumour\nSee more results »\nRelated word\naggressively\nAdd to word list\nAdd to word list\nusing strong, forceful methods esp. to sell or persuade: The company mounted an aggressive marketing campaign. You have to be aggressive if you want to succeed in this business. aggressively adverb us\nYour browser doesn't support HTML5 audio\n/əˈɡres·ɪv·li/\nThe company is aggressively pursuing new business opportunities.\nAdd to word list\nAdd to word list\ndone in a very forceful and competitive way in order to gain an advantage: aggressive marketing/expansion/recruiting Through aggressive marketing in Europe and Asia, the company pulled in an extra $4.5 billion and doubled its share prices.aggressive campaigns/strategies/tactics Britain’s second largest water company is planning an aggressive campaign to win industrial and business customers from rivals.\nforceful, competitive, and determined to win or get what you want: Many banks have become more aggressive in making loans to boost revenue growth. The company has been losing market share for five years, primarily to aggressive competitors that have undercut the company on price.\nFINANCE used to describe investments that involve some risk or investors that take risks in order to gain the best results: aggressive funds/investments/trades He moved his money into more aggressive investments, including hedge funds and publicly traded stocks. aggressive buyers/sellers\naggressively adverb /əˈɡresɪvli/"}