{"id":6123,"name":"aggregate","type":"noun","us_sound":"ˈæɡ.rə.ɡət","us_link":"../audio/a/aggregate.mp3","uk_sound":"ˈæɡ.rɪ.ɡət","uk_link":"../audio/a/ukage__019.mp3","content":"aggregate noun [C or U]\n(TOTAL)\nAdd to word list\nAdd to word list\nsomething formed by adding together several amounts or things: They purchased an aggregate of 3,000 shares in the company. Snowflakes are loose aggregates of ice crystals. Arsenal lost the second game, but got through to the final on aggregate (= adding together the goals in both matches).\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nroot\nsum\nwork something out\nSee more results »\naggregate noun [C or U]\n(BUILDING STONES)\nsmall stones used in building: Volumes of aggregates, cement, and concrete used in the UK will rise this year.\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\ndrywall\nfibro\nflagged\nflagstone\nflitch\nparticle board\npaving\nprestressed\nputty\nrazor wire\ntwo-by-four\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\ntotal: The seven companies have an aggregate turnover of £5.2 million.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nto combine into a single group or total\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nRelated word\naggregation\nAdd to word list\nAdd to word list\nformed by adding together several amounts or things; total: The seven companies made an aggregate profit of $10.2 million. aggregate noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈæɡ·rɪ·ɡət/\nThe family owned over 2 million shares in the aggregate. aggregation noun [ C/U ] us/ˌæɡ·rɪˈɡeɪˈʃən/\nthe aggregation of the companies into one organization\nto bring different things together: The company aggregates news and information from a number of sources on its website.\nAdd to word list\nAdd to word list\n[ C ] a total that is calculated by adding together different prices, amounts, etc.: an aggregate of sth An aggregate of 18,003 shares of Series B Convertible Preferred Stock will remain outstanding.\n[ C ]\n&#160; ECONOMICS a measurement used in calculating the amount of money in an economy at a particular time: From its peak, the aggregate money supply has declined 18.5%. See also\nmoney supply\n[ C usually plural ] small stones used in building: Volumes of aggregates, cement, and concrete used in Britain will rise this year.\nin (the) aggregate\nin total, after different prices, amounts, etc. have been added together: In aggregate, the top 30 listed companies tend to get more money back from the government than they pay in tax.\nadded together to make a total amount, price, etc.: The report scores each health plan for dozens of individual measures, and makes state and regional aggregate data available to the media.aggregate amount/figure/value Aggregate figures for the euro mask big differences among member states.aggregate demand/supply/sales Pre-tax profits fell 17% on falling aggregate sales.\nto add different prices, amounts, etc. in order to get a total: The company did $15.6 million in business with the federal government last year, according to data aggregated by OMB Watch.\nto combine different products or services and sell them together: Mobile and satellite communications systems aggregate a range of services such as telephony, data transmission, and internet distribution."}