{"id":6450,"name":"agree","type":"verb","us_sound":"əˈɡriː","us_link":"../audio/a/agree.mp3","uk_sound":"əˈɡriː","uk_link":"../audio/a/ukagita021.mp3","content":"agree verb\n(HAVE THE SAME OPINION)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to have the same opinion: Ann and I never seem to agree.agree with I agree with you on this issue.agree about My father and I don't agree about very much.agree on My father and I don't agree on very much. [ + that ] I agree that he should be invited. [ + question word ] Experts seem unable to agree whether the drug is safe or not. [ + speech ] \"You're absolutely right,\" agreed Jake.\nThesaurus: synonyms, antonyms, and examples\nto have the same opinion as someone elseagreeWe agree on most things.be in agreementThe whole family is in agreement with her.concur I completely concur with everything that's been said so far.be of the same mindWe are of the same mind when it comes to prison reform.see eye to eyeWe will never see eye to eye on this matter.\nSee more results »\nMore examplesFewer examplesAll those who agree please hold up their hand .Getting both sides to agree was a notable achievement.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nagree verb\n(SAY YES)\nB1 [ I or T ] to decide something together: They agreed not to tell anyone about what had happened. We couldn't agree on what to buy.UK We finally agreed a deal.\nB2 [ I or T ] to accept a suggestion or idea: I suggested that we should meet, and they agreed (= said yes). [ + to infinitive ] The bank has agreed (= is willing) to lend me £5,000.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nMore examplesFewer examplesShe reluctantly agreed to step down as managing director.The bank agreed to lend him $5000.We finally agreed on the name Luca for our son.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nagree verb\n(BE THE SAME)\nC2 [ I ] If two or more statements, ideas, sets of numbers, etc. agree, they are the same or very similar: We have five accounts of what happened and none of them agree.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\nequalization\neven (something) out\nfavour\nflatlining\nhomologous\nhomologous series\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\nagree verb\n(GRAMMAR)\n[ I ]\n&#160; language\n&#160; specialized When two words agree, or one word agrees with another word, they have the same grammatical form. For example, the words may both be singular or plural, masculine or feminine, etc.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nIdioms\nagree to differ\ncouldn't agree more/less\nnot agree with someonePhrasal verbs\nagree to something\nagree with something\nagree with someone\nAdd to word list\nAdd to word list\nto have the same opinion, or to accept a suggestion or idea: [ I ] I agree with you. [ I ] We all agree on that point. [ + to infinitive ] In settling the dispute, he agreed to pay $60,000 in damages. [ + that clause ] Most economists agree that it would be unwise to cut taxes right now. [ I ] Both sides agreed to the terms of the peace treaty. [ I ] I agree with letting children learn at their own pace.\nIf two sets of information agree, they are generally the same: [ I ] Since their stories did not agree at all, he knew one of them was lying. Phrasal verb\nagree with someone\nAdd to word list\nAdd to word list\nto accept someone else’s plan, suggestion, etc.: agree to do sth Federal regulators and US lenders agreed to freeze interest rates on subprime mortgages for five years.be agreed by/between sb/sth Any change to branch rules must be agreed by two thirds of members at the branch meeting.agree sth UK The union's national executive committee will meet on Thursday to agree the new strategy.\nto have the same opinion, or to approve of someone else’s ideas and opinions: agree that The credit card company agreed that we'd been overcharged and will credit the amount in our next bill.agree with sb on sth Although we like his plan in general, we don't agree with him on every issue. Phrasal verb\nagree to sth"}