{"id":6458,"name":"agreement","type":"noun","us_sound":"əˈɡriː.mənt","us_link":"../audio/a/agreement.mp3","uk_sound":"əˈɡriː.mənt","uk_link":"../audio/a/ukagita024.mp3","content":"agreement noun\n(SAME OPINION)\nAdd to word list\nAdd to word list\nB2 [ U ] the situation in which people have the same opinion, or in which they approve of or accept something: The whole family was in agreement with her about/on what they should do. If the three parties cannot reach agreement now, there will be a civil war. I don't think you'll ever get Tony's agreement to these proposals. [ + that ] There's widespread agreement that the law should be changed. Synonyms\nacquiescence formal\napproval (PERMISSION)\nassent formal\nsay-so (PERMISSION) informal\nThesaurus: synonyms, antonyms, and examples\nto have the same opinion as someone elseagreeWe agree on most things.be in agreementThe whole family is in agreement with her.concur I completely concur with everything that's been said so far.be of the same mindWe are of the same mind when it comes to prison reform.see eye to eyeWe will never see eye to eye on this matter.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nB2 [ C ] a decision or arrangement, often formal and written, between two or more groups or people: The dispute was settled by an agreement that satisfied both sides. The government has entered into/signed an international arms control agreement. They have broken (the terms of) the agreement on human rights. Finally the two sides have reached an agreement. Synonyms\naccord\ncompact (AGREEMENT) formal\nconcordat specialized\ncovenant\npact\ntreaty\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nMore examplesFewer examplesThe two countries signed an agreement to reduce their nuclear armouries.A murmur of agreement came from the crowd.The agreement was reached after a series of difficult negotiations.Russia has just drawn up a trade agreement with Norway.No agreement has yet been reached and the negotiations are still ongoing.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nagreement noun\n(GRAMMAR)\n[ U ]\n&#160; language\n&#160; specialized the situation in which two words have the same grammatical form. For example, the words are both singular or plural, masculine or feminine, etc.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nAdd to word list\nAdd to word list\nthe condition of having the same opinion, or a decision or arrangement between two or more people or groups to do something or to obey the same rules: [ C ] a new trade agreement [ U ] Both sides were in agreement on the basic terms, but many details still had to be worked out. [ C ] Leaders of both countries signed an agreement to exchange diplomats. [ U ] Let us help you to reach agreement.\nAdd to word list\nAdd to word list\n[ C ] a decision or arrangement that has been made and accepted by two or more people, groups, organizations, etc.: agreement between sb and sb Based on the rental agreement between the landlord and the tenant, either party must give 30 days notice to terminate the agreement.agreement with sb The group has licensing agreements with 170 retail customers in the US.an agreement on sth Negotiations will continue for an ambitious agreement on trade and other matters.arrive at/come to/reach an agreement Despite recent discussions between the two companies, they failed to reach an agreement on the terms of a possible merger.enter into/sign an agreement Developers have signed an agreement with the commission and the EPA to use the land for commercial and residential property. a formal/legal/binding agreement a verbal/written/unwritten agreement Compare\narrangement\ncontract\ndeal noun\ndeedSee also\nagreement of sale\nbuy-and-sell agreement\ncollective agreement\nfair trade agreement\nforward rate agreement\nframework agreement\ngentleman's agreement\nheads of agreement\nlabor agreement\nletter of appeal\nnon-disclosure agreement\npurchase agreement\nrepurchase agreement\nsale and purchase agreement\nsale and repurchase agreement\nsales agreement\nservice agreement\nstandstill agreement\ntrade agreement\nvoluntary restraint agreement\n[ U ] the act of approving or accepting something, or the fact of having the same opinion about something: be in agreement with sb/sth Most of the county's lawmakers are in agreement with administration officials on the proposal.complete/total/widespread agreement There is widespread agreement that changes need to be made, but there is disagreement about how it should be conducted.be in agreement that All area superintendents are in agreement that both constitutional reform and tax reform are necessary now."}