{"id":6633,"name":"ahead","type":"adverb","us_sound":"əˈhed","us_link":"../audio/a/ahead.mp3","uk_sound":"əˈhed","uk_link":"../audio/a/ukaha__003.mp3","content":"ahead adverb\n(IN FRONT)\nAdd to word list\nAdd to word list\nB1 in front: The road ahead is very busy. Turn left at the traffic lights, and you'll see the hospital straight ahead.\nB2 having more points, votes, etc. than someone else in a competition, election, etc.: Barcelona was ahead after ten minutes.\nC2 making more progress than someone else: All the children in the class are doing well, but Sophie is way (= far) ahead.\nMore examplesFewer examplesThe path ahead was flat and smooth.In the last few metres of the race, she suddenly zoomed ahead.You two go ahead - Sam and I'll bring up the rear.He kept his eyes on the road ahead, his face taut with concentration.\nSMART Vocabulary: related words and phrases\nAhead, in front and beyond\nahead of\nante\nbe (right) under your nose idiom\nbefore\nbeyond\ndownriver\nfollow\nfollow your nose idiom\nfore\nforward\nfront\nfront end\nfrontally\nhead\nlead\nnose\npara\npast\nup\nyonder\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing the leading position\nMaking progress and advancing\nahead adverb\n(IN THE FUTURE)\nB1 in or into the future: He couldn't bear to think of the lonely year ahead.\nThesaurus: synonyms, antonyms, and examples\nat an earlier timebeforeI was sure I’d seen her face before.beforehandHe knew beforehand that his speech would anger many people.previouslyShe has previously denied the accusations.in advanceYou should prepare your ingredients in advance.ahead of timeUS Try to arrive at the airport ahead of time to minimize the possibility of delays.\nSee more results »\nMore examplesFewer examplesPlanning so far ahead makes no sense - so many things will have changed by next year.Normally, I plan one or two days ahead.Friendless and jobless, he wondered how he would survive the year ahead.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead of\nall in good time idiom\nanon\nASAP\naway\nbe\ndue\ngonna\nhereon\nin\nin for something idiom\nin the course of time phrase\nposterity\npresently\nrun\nshortly\nsomeday\nsometime\nspace\nyet\nSee more results »\nahead adverb\n(BEFORE)\nearlier than or before someone or something: It was already 10 AM in Moscow when the news broke in London that morning, because Moscow is three hours ahead.\nMore examplesFewer examplesThe flight wasn't until 11 but we were asked to check in two hours ahead.Carrots can be roasted up to 4 hours ahead; cover and keep at room temperature.\nSMART Vocabulary: related words and phrases\nEarly\nahead of\nbe up with the lark idiom\nbelatedly\nbetter\nbetter late than never idiom\nearly\nget ahead of yourself idiom\nget out over your skis idiom\nill-timed\nin good time idiom\npostdate\npremature\nprematurely\nprepone\npumpkin\nschedule\nshort\nthe early bird catches the worm idiom\ntimeously\nturn into a pumpkin idiom\nSee more results »\nahead adverb\n(IN FRONT)\nAdd to word list\nAdd to word list\n[ not gradable ] directly in front: She only had a few things in her shopping cart, so I told her she could go ahead of me in the checkout line.\n[ not gradable ] Ahead also means further along in development or achievement: Sophie is way ahead of the rest of her class.\nahead adverb\n(IN THE FUTURE)\nin or into the future: We have a lot of hard work ahead of us. You have to plan ahead when you’re thinking of going to graduate school. Idioms\nahead of time\nahead of your time\nAdd to word list\nAdd to word list\nat a better, higher, or greater level than before: be ahead by sth First-half figures showed that pre-tax profits were ahead by 8% to £94.8m. Full-year profits jumped 25% to £106m pre-tax, which was ahead of expectations.\nmore developed, advanced, or able to succeed: keep/get/stay ahead To get ahead in the industry you need the right tools and the right connections.ahead of sb/sth After showing signs of slowing sales growth, the group cut its prices to stay ahead of its rivals. See also\ngo-ahead"}