{"id":6703,"name":"aid","type":"noun","us_sound":"eɪd","us_link":"../audio/a/aid.mp3","uk_sound":"eɪd","uk_link":"../audio/a/ukaha__008.mp3","content":"Add to word list\nAdd to word list\n[ U ] help or support: He gets about with the aid of a walking stick. She went to the aid of a man trapped in his car. A woman in the street saw that he was in trouble and came to his aid. Synonyms\nassistance\nhelp\nrelief\nsuccour UK literary\nsupport (HELP)\nC1 [ C ] a piece of equipment that helps you to do something: teaching aids, such as books and videos A thesaurus is a useful aid to writing.\nC1 [ U ] help in the form of food, money, medical supplies, or weapons that is given by a richer country to a poorer country: The Vatican has agreed to donate $80,000 in humanitarian/emergency aid to countries affected by the war. About a fifth of the country's income is in the form of foreign/overseas aid. in aid of someone/something C1 UK\nin order to collect money for a group of people who need it: a concert in aid of famine relief\nSee more\nMore examplesFewer examplesThe tunnel was dug with the aid of heavy machinery.Foreign aid is badly needed to ameliorate the effects of the drought.humanitarian aidWe need to look at the logistics of the whole aid operation.Thousands of lives will be at stake if emergency aid does not arrive in the city soon.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTools in general\nGifts in the form of money\nOrganizations - charities\nIdiom\nwhat's something in aid of?\nC1 to help: Huge projects designed to aid poorer countries can sometimes do more harm than good. His excuse for drinking brandy is that it's said to aid digestion.\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\naid and abet someone law\n&#160; specialized or humorous\nto help someone to do something illegal or wrong: Three auditors were accused of aiding and abetting the men charged with fraud.\nSee more\nMore examplesFewer examplesDiscover how eating raw food helps balance your body and aids digestion.Your donation will help aid flood victims.Doctors hoped that moving to a warmer climate would aid his recovery.Police arrested a number of people suspected of aiding the terrorists.Fruit and vegetables contain acids that aid the absorption of calcium into the body.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nSee more results »\nAdd to word list\nAdd to word list\nhelp or support, or something that provides it: [ U ] He gets around with the aid of a cane. [ U ] She went to the aid of a man trapped in his car. [ C ] A good dictionary can be a useful aid to understanding a new language.\nAid is often used to refer to help given in the form of food, money, medical supplies, etc., to a country or group of people that is in need or because of an emergency: [ U ] foreign aid [ U ] Aid for the flood victims was on the way.\nAdd to word list\nAdd to word list\nmoney, food, medicine, or other supplies that are sent to people or countries who need them because of a difficult situation: appeal for/ask for/seek aid The government has already appealed for 800,000 tonnes of food aid to feed its starving population. economic/emergency/humanitarian aidget/receive/accept aid Victims of the flood can receive aid at one of the 19 emergency aid stations set up by the state. foreign/international/overseas aid\nhelp or support: give/provide/send aid to sb Lawmakers say the plan will create 1 million jobs and provide comfort and aid to the poor.come to the aid of sb The Bureau will come to the aid of any homeowners pursuing an insurance claim.government/public/state aid Under the plan, state aid to local businesses would drop by $6.6 million. See also\naid agency\ndevelopment aid\nfinancial aid\nforeign aid\nlegal aid\nto help or support someone or something: Better training policies and new technologies are aiding disabled people in the workplace.aid in (doing) sth An additional team of contractors was hired to aid in the plant's construction.\naid and abet\nLAW to help someone do something that is illegal: Prosecutors argued that he aided and abetted in illegal drug cultivation and sale."}