{"id":6809,"name":"aimed","type":"verb","us_sound":"eɪm","us_link":"../audio/a/aim.mp3","uk_sound":"eɪm","uk_link":"../audio/a/ukaha__015.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\naim\naim verb\n(INTEND)\nB1 [ I ] to intend: [ + to infinitive ] I aim to be a millionaire by the time I'm 35. We are aiming for (= planning to achieve) a 50 percent share of the German market.\nMore examplesFewer examplesWe always aim to give our clients personal attention.Psychoanalysts aim to explore the innermost recesses of the mind.The Pentagon is aiming to cut US forces by over 25 percent in the next five years.We're aiming to expand our customer base.The builders are aiming to get the job done by the end of the month.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\naim verb\n(POINT)\n[ I or T ] to point or direct a weapon towards someone or something that you want to hit: Aim (the arrow) a little above the target. Aim at the yellow circle. There are hundreds of nuclear missiles aimed at the main cities. She aimed (= directed) a kick at my shins. Let's aim for (= go in the direction of) Coventry first, and then we'll have a look at the map.\nMore examplesFewer examplesIn a level voice, he ordered the soldiers to aim and fire.She aimed at the target.The gun turret revolved until the gun was aimed at the advancing soldiers.Video footage clearly shows a police officer aiming a pistol at a demonstrator.She picked up an apple and aimed it at his head.\nSMART Vocabulary: related words and phrases\nAiming and aim\naim\ncrosshairs\ndirect\nhome\nhome in on something/someone\nlevel\nlevel something at someone\nretarget\ntarget\ntrain\nzero\nzero in on something/someone\nPhrasal verbs\naim at something\naim something at someone"}