{"id":7336,"name":"alarm","type":"noun","us_sound":"əˈlɑːrm","us_link":"../audio/a/alarm.mp3","uk_sound":"əˈlɑːm","uk_link":"../audio/a/ukairwo018.mp3","content":"alarm noun\n(WARNING)\nAdd to word list\nAdd to word list\n[ C ] a warning of danger, usually a loud noise or flashing light: If there's any trouble, raise/sound the alarm by pulling the emergency cord. The first two bomb alerts were false alarms, but the third was for real.\nB1 [ C ] a device that makes a loud noise to warn of danger: a burglar/car/fire/smoke alarm\nA2 [ C ] an\nalarm clock\nPaul Bricknell/Dorling Kindersley/GettyImages\nB1 [ C ] If an electronic device such as a watch or computer has an alarm, it can be set to make a noise at a particular time.\nMore examplesFewer examplesIf the alarm sounds, leave the building immediately.The fire alarm goes off accidentally so often that when it's the real thing nobody will take any notice.Quick, sound the alarm - there's a fire in the machine room!Police said the thieves were obviously well acquainted with the alarm system at the department store.I heard his alarm clock bleeping this morning.\nSMART Vocabulary: related words and phrases\nThreats & warnings\n(just) you wait idiom\nadvance warning\nalarm bell\nalarmed\nbeware the ides of March idiom\nbomb scare\nbow\nbrushback pitch\ncanary\ncautionary\ncaveat\ndon't you dare idiom\nhear warning bells idiom\nred flag\nscare quotes\nscreamer\nsend\nsend a signal (to sb) that idiom\nwarning\nyellow card\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWatches & clocks\nalarm noun\n(WORRY)\nC2 [ U ] sudden worry and fear, especially that something dangerous or unpleasant might happen: I didn't tell her that he was late because I didn't want to cause her any alarm. Villagers have reacted with alarm to news of a proposed new road. Synonyms\nconcern (WORRY)\nconsternation\ndistress\npreoccupation\nworry\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\nMore examplesFewer examplesThe birds flew off in alarm when the cat appeared.There was alarm in the stock market today when prices suddenly began to drop.The gun shot made the monkeys chatter in alarm.It's all right, everybody - there's no need for alarm.A bomb threat caused great alarm in the City this morning.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\ncold sweat\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnxiety and worry - general words\nIdiom\nraise the alarm\nC1 to make someone worried or frightened: I didn't want to alarm him by telling him that she was ill.\nSMART Vocabulary: related words and phrases\nCausing anxiety and worry\nagitate\nalarming\nalarmingly\nbite\ncatch up with someone\ncome back to bite someone idiom\ndisturb\nfrighten\nfrighten someone/something away/off\nget/go beyond a joke idiom\ngive someone the jimjams idiom\ngive someone the jitters idiom\noppressive\nrattle\nroost\nstressful\nstressfully\nsuspenseful\nsuspensefully\nsuspensive\nSee more results »\nalarm noun\n(ANXIETY)\nAdd to word list\nAdd to word list\n[ U ] sudden anxiety and fear, esp. that something very bad or dangerous might happen: Nicholas detected a note of alarm in her voice.\nalarm noun\n(WARNING)\n[ C ] a warning signal such as a loud noise or flashing light that gets your immediate attention, or a device that produces such a signal: Firefighters said the tragedy could have been avoided if the house had had smoke alarms.\nto feel or cause sudden anxiety and fear: Guests were sometimes alarmed to learn that we never locked the doors of the house.\nalarming adjective us\nYour browser doesn't support HTML5 audio\n/əˈlɑr·mɪŋ/\nStock prices began to rise at an alarming rate."}