{"id":7897,"name":"alert","type":"adjective","us_sound":"əˈlɝːt","us_link":"../audio/a/alert.mp3","uk_sound":"əˈlɜːt","uk_link":"../audio/a/ukalbin013.mp3","content":"Add to word list\nAdd to word list\nC1 quick to see, understand, and act in a particular situation: I'm not feeling very alert today - not enough sleep last night! A couple of alert readers posted comments on the website pointing out the mistake. Parents should be alert to sudden changes in children's behaviour.\nMore examplesFewer examplesDoing puzzles and crosswords regularly keeps your mind alert and active.Although Granny was frail in her old age, but was mentally very alert.He was normally a bright, alert baby, so she felt sure there was something seriously wrong.A small animal must always remain alert for predators.There have been some thefts recently, so please stay alert and don't leave handbags and valuables around.\nSMART Vocabulary: related words and phrases\nPerceptive\nacute\nacuteness\nantenna\ncatch\neagle-eyed\ngimlet\nhave an eye for something idiom\nhave/keep (all) your wits about you idiom\nhawk-eyed\nhawkish\nobservant\nperceptive\nperceptively\npercipiently\nsensate\nsensately\nsharp\nsharp-eyed\nsharpness\nwit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReacting and responding\nRelated word\nalertness\nC1 [ C or U ] a warning to people to be prepared to deal with something dangerous: a bomb alert The army was put on (full) alert as the peace talks began to fail. The public were warned to be on the alert for (= watching carefully for) suspicious packages.\n[ C ] a message, for example on your mobile phone or on television or radio, that warns you or gives you information about something: You can set location-based alerts so your phone will remind you of something important when you are arriving at or leaving a location. I get text alerts when I have used 80% of my mobile data. Sign up to receive news alerts in your area.\nSMART Vocabulary: related words and phrases\nThreats & warnings\nadvance warning\nalarm\nalarm bell\nalarmed\nbeware the ides of March idiom\nbomb scare\nbow\nbrushback pitch\ncanary\ncautionary\ncaveat\ndon't you dare idiom\nhear warning bells idiom\nred flag\nscare quotes\nscreamer\nsend\nsend a signal (to sb) that idiom\nwarning\nyellow card\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmergency services in general\nCommunications - general words\nC2 to warn someone of a possibly dangerous situation: An anonymous letter alerted police to the possibility of a terrorist attack at the airport.\nMore examplesFewer examplesIf you hear a flood warning, please alert your neighbours and make emergency preparations.Until I saw my statement, there was nothing to alert me that someone else was using my credit card number.We encourage parents to alert the school about any concerns or difficulties at home.We don't want to alarm people unnecessarily, but they should be alerted to potential dangers.A note of formality in his voice alerted her to the fact that others were listening.\nSMART Vocabulary: related words and phrases\nThreats & warnings\nadvance warning\nalarm\nalarm bell\nalarmed\nbeware the ides of March idiom\nbomb scare\nbow\nbrushback pitch\ncanary\ncautionary\ncaveat\ndon't you dare idiom\nhear warning bells idiom\nred flag\nscare quotes\nscreamer\nsend\nsend a signal (to sb) that idiom\nwarning\nyellow card\nSee more results »\nAdd to word list\nAdd to word list\nquick to see, understand, and act in a particular situation: When you’re driving, you must stay alert. We had to be alert to any danger signs in the economy.\na warning to people to get ready to deal with something dangerous: [ U ] The police were on the alert for (= watching carefully for) any sign of trouble. alert verb [ T ] us\nYour browser doesn't support HTML5 audio\n/əˈlɜrt/\nThe auto company mailed letters to owners of that model car, alerting them of safety risks."}