{"id":8262,"name":"align","type":"verb","us_sound":"əˈlaɪn","us_link":"../audio/a/align.mp3","uk_sound":"əˈlaɪn","uk_link":"../audio/a/ukalbin030.mp3","content":"align verb [I or T]\n(STRAIGHT LINE)\nAdd to word list\nAdd to word list\nto put two or more things into a straight line, or to form a straight line: align something and something Align the ruler and the middle of the paper and then cut it straight.align something with something When you've aligned the notch on the gun with the target, fire! Make sure the columns align in the chart. Opposite\nskew\nMore examplesFewer examplesThe left eye of the patient and the right eye of the examiner are aligned.The \"star in the East\", he says, could have been Mars, Jupiter, and Saturn aligned in the constellation Pisces on 20 February 6BC.The mounting rails are to be placed at the 25 percent and 75 percent positions along the length and have to align with the rafter.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\naxisymmetric\nbalance (something) out/up\nbalance of power\nbalanced\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nalign verb [I or T]\n(AGREE)\nto be the same or similar, or to agree with each other; to make two things do this: align with The post was deleted because it did not align with the values of this website.align something with something The job of an IT business analyst is to align IT systems with changing business needs. In the first decade of the union, economic growth among member countries was generally aligned.\nto agree with or support another person, group, organization, or view: be aligned with The country's leading intellectuals tend to be aligned with the opposition. As a musician, he aligned himself with the avant-garde.align against A loose coalition of politicians and students aligned against the government. The superpowers force smaller countries to align behind them in rival blocs.\nMore examplesFewer examplesWe plan to align income tax and national insurance systems for small business.Boys are more self-confident than girls about their maths skills, a finding which aligns with stereotypes of female inferiority in mathematics.A devout Christian, she always compares political policies with what the Bible says and tries to determine if the two align.Schools are ranked on how well they align their educational policies with tough national standards.Should we take existing morality as a given, or should we take skepticism seriously? I align with the latter view.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\nbe two of a kind idiom\ncorrespond\nequal\neven (something) out\nflatlining\nhomologous\nhomologous series\nhomologue\nmatch\nparallel\npassing\nplaceless\nplacelessness\nresemble\nrival\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating alliances\nIdiom\nthe stars align\nAdd to word list\nAdd to word list\nto put two or more things into a straight line: You need to align the numbers properly in a column. fig. Business leaders are aligned with (= agree with) the president on this issue. alignment noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˈlɑɪn·mənt/\n[ U ] You hear that noise because the wheels are out of alignment.\nAdd to word list\nAdd to word list\nto change something so that it has a correct relationship to something else: Later this year, the company will introduce a price platform for its home insurance contracts, and will align all its prices.align sth with sth More scientific methods of aligning boardroom pay with shareholder returns are needed. alignment noun [ U ]\nThe manufacturing processes, whether designed for cost efficiency, speed, or quality are in alignment with company objectives. Phrasal verb\nalign yourself with sth/sb"}