{"id":8527,"name":"all","type":"determiner","us_sound":"ɑːl","us_link":"../audio/a/all.mp3","uk_sound":"ɔːl","uk_link":"../audio/a/ukalign012.mp3","content":"Add to word list\nAdd to word list\nA1 every one (of), or the complete amount or number (of), or the whole (of): all but The judge cleared the court of all but (= everyone except) herself and the witness.all day I've been trying all day to contact you.all of Did you really drink all of the milk?all the time Why do you get so angry with me all the time (= very often)?all the way It's very kind of you to come all the way to meet me.all that matters So long as he's happy - that's all that matters. All animals have to eat in order to live. She has four children, all under the age of five. The cast all lined up on stage to take their bow. Have you drunk it all? All the eggs got broken. We left the grill on and used up all (of) the propane. Now the money's all mine! All my friends agree. She had £2,000 under the bed and the thieves took it all. Remember all that trouble we had with the police last year? I had to use all my powers of persuasion to get her to agree.\nthe only thing: All I need is a roof over my head and a decent meal. all in all\nconsidering all the different parts of the situation together: All in all, I think you've done very well.\nSee more all I'm saying informal\nused when you make a comment or criticism, so that it seems less severe or is less likely to offend someone: All I'm saying is I think the end part could have been a little shorter.\nSee more all the... you have\nthe only and small amount or number of something you have: Her parents died when she was a baby, so I was all the family she ever had.\nSee more\nMore examplesFewer examplesObviously we can't deal with the problem until we know all the circumstances.We all clapped for his performance enthusiastically.I want you to clear all these toys away before bedtime.The suspect said that he had been at home all evening.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nGrammar\nAllAll means ‘every one’, ‘the complete number or amount’ or ‘the whole’. We use it most often as a determiner. We can use a countable noun or an uncountable noun after it: …\nAll as a determinerAll means ‘every one’, ‘the complete number or amount’ or ‘the whole’. We use it most often as a determiner. We can use a countable noun or an uncountable noun after it: …\nAll with no articleWhen all refers to a whole class of people or things, we don’t use the: …\nAll ofWe use all of before personal pronouns (us, them), demonstrative pronouns (this, that, these, those) and relative pronouns (whom, which). The personal pronoun is in the object form: …\nAll without ofWe use all, not all of, before indefinite plural nouns referring to a whole class of people or things: …\nAll with personal pronounsWhen all refers to a personal pronoun which is the object in a clause, we can use pronoun + all or all of + pronoun. The pronoun is in the object form: …\nAll as a pronounWe can use all alone as a pronoun in formal situations: …\nAll as an adverbWhen all refers to the subject of a clause, it usually comes in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nAll meaning ‘completely’ or ‘extremely’We can also use all as an adverb meaning ‘completely’ or ‘extremely’, especially in informal styles: …\nAll: not allWe can make all negative by using not in front of it: …\nAll: after allWe use after all in two main ways. We use it to mean ‘in spite of what happened before’. With this meaning it usually occurs in end position: …\nAll or every?All and every are determiners. …\nAll and every + nounsThe meaning of all and every is very similar but we use them in different ways. We use all with plural and uncountable nouns and every with singular nouns: …\nAll (of) theWe can use all and all of before articles (the, a/an), demonstratives (this, that) and possessives (our, his) but we can’t use every before them: …\nAll day, every dayWe use all day, all week, all month to mean ‘one entire day/week/month’: …\nAll or every: typical errorsWe don’t use every before determiners: …\nAll or whole?All and whole are determiners. …\nAll or whole for single entitiesWe use the whole or the whole of to refer to complete single things and events that are countable and defined: …\nAll the with uncountable nounsWe use all the and not the whole with uncountable nouns: …\nAll and whole with plural nounsWe usually use all the and all of the with plural nouns: …\nAll and whole: typical errorsWe don’t use all before a and an: …\nIdioms\nall day long\nall good things (must) come to an end\nall of something\nbe all (that) you can do\nthat's all I/you/we need!\nA2 completely: all alone The princess lived all alone in the middle of the forest.all by yourself Can you believe he built that house all by himself?all over We had a difficult time but it's all over now. The baby got food all over her dress. The cake was all eaten last night. The downstairs rooms were painted all in greens and blues. Don't let her get you all upset. She's been all over town looking for you. I've been hearing all about your weekend!\nB1 used after a number to mean that both teams or players in a game have equal points: The score at half-time was still four all. all but\nC2 almost: The game was all but over by the time we arrived.\nSee more all round UK (US all around)\nin every way: It was a ghastly business all round.\nSee more all the better, stronger, more exciting, etc.\nC2 even or much better, stronger, more exciting, etc.: She felt all the better for the drink.\nSee more\nMore examplesFewer examplesHis fingerprints were all over the gun.I had a train to catch, so I was watching the clock all through the meeting.When I tried to tell her that I loved her it just came out all wrong.The area where I grew up has been all modernized, and has lost all its old character.I had to read the letter twice before I could take it all in.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: both, all, each & every\nGrammar\nAllAll means ‘every one’, ‘the complete number or amount’ or ‘the whole’. We use it most often as a determiner. We can use a countable noun or an uncountable noun after it: …\nAll as a determinerAll means ‘every one’, ‘the complete number or amount’ or ‘the whole’. We use it most often as a determiner. We can use a countable noun or an uncountable noun after it: …\nAll with no articleWhen all refers to a whole class of people or things, we don’t use the: …\nAll ofWe use all of before personal pronouns (us, them), demonstrative pronouns (this, that, these, those) and relative pronouns (whom, which). The personal pronoun is in the object form: …\nAll without ofWe use all, not all of, before indefinite plural nouns referring to a whole class of people or things: …\nAll with personal pronounsWhen all refers to a personal pronoun which is the object in a clause, we can use pronoun + all or all of + pronoun. The pronoun is in the object form: …\nAll as a pronounWe can use all alone as a pronoun in formal situations: …\nAll as an adverbWhen all refers to the subject of a clause, it usually comes in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nAll meaning ‘completely’ or ‘extremely’We can also use all as an adverb meaning ‘completely’ or ‘extremely’, especially in informal styles: …\nAll: not allWe can make all negative by using not in front of it: …\nAll: after allWe use after all in two main ways. We use it to mean ‘in spite of what happened before’. With this meaning it usually occurs in end position: …\nAll or every?All and every are determiners. …\nAll and every + nounsThe meaning of all and every is very similar but we use them in different ways. We use all with plural and uncountable nouns and every with singular nouns: …\nAll (of) theWe can use all and all of before articles (the, a/an), demonstratives (this, that) and possessives (our, his) but we can’t use every before them: …\nAll day, every dayWe use all day, all week, all month to mean ‘one entire day/week/month’: …\nAll or every: typical errorsWe don’t use every before determiners: …\nAll or whole?All and whole are determiners. …\nAll or whole for single entitiesWe use the whole or the whole of to refer to complete single things and events that are countable and defined: …\nAll the with uncountable nounsWe use all the and not the whole with uncountable nouns: …\nAll and whole with plural nounsWe usually use all the and all of the with plural nouns: …\nAll and whole: typical errorsWe don’t use all before a and an: …\nIdioms\nbe all over it\nbe someone all over\nbe all go\nbe not all there\ngo all out\nused in front of many nouns to form adjectives meaning \"every\", \"every type of\", or \"the whole of\" that particular thing: an all-night bar (= a bar that is open for the whole night)\nused in front of many adjectives and present participles to mean \"everything\" or \"everyone\": an all-inclusive price all-conquering armies\nused in front of many nouns and adjectives to mean \"completely\": all-cotton socks (= socks that are made completely of cotton) When cooking the sauce, don't forget that all-important (= most or very important) ingredient, fresh basil. Do you believe in an all-powerful god (= one with unlimited power)?\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nYou can also find related words, phrases, and synonyms in the topics:\nComplete and whole\nLinguistics: very & extreme\nall adjective\n(EVERY ONE)\nAdd to word list\nAdd to word list\nevery one of, or the complete number of: All four of her children are under six. Not all my friends approved of what I did. All but the weakest plants survived the hot weather.\nall adjective\n(COMPLETELY)\n[ not gradable ] the whole: I’ve been trying all day to contact you. Idioms\nall but\nall manner of\nall of\nall of a sudden\nnot all that\nall the time in the world\nall told\nall too\nall very well\nof all people\nMore idioms\non all fours\nall adverb [not gradable]\n(COMPLETELY)\ncompletely: This coat is all wool. Is the milk all gone? Did you drink it all? Don’t get all upset.\nAll is also used after a number to mean that both teams or players in a game have equal points: The score at halftime was 10 all.\nall over\neverywhere in a place or area: Soon the news was all over town. There were these tiny little blue flowers growing all over. Idiom\nall along\nall pronoun\n(EVERY ONE)\nevery one: All of her children have graduated from high school.\nall pronoun\n(ONE THING)\nthe one thing: Speed is all that matters. All I need is a hot shower.\nbe all go UK\nAdd to word list\nAdd to word list\nif a situation or place is all go, it is extremely busy: It was all go in the office today.\ngo all out\nto put all your energy or enthusiasm into what you are doing: Investors going all out for growth with some risk might be interested in this new unit trust."}