{"id":8583,"name":"allege","type":"verb","us_sound":"əˈledʒ","us_link":"../audio/a/allege.mp3","uk_sound":"əˈledʒ","uk_link":"../audio/a/ukalign017.mp3","content":"Add to word list\nAdd to word list\nC2 to say that someone has done something illegal or wrong without giving proof: [ + (that) ] The two men allege (that) the police forced them to make false confessions. [ + to infinitive ] She is alleged to have been at the centre of an international drug ring. [ + that ] It was alleged that Johnson had struck Mr Rahim on the head.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nMore examplesFewer examplesThe prosecution alleged that he lured the officer to his death by making an emergency call.It has been alleged that the minister received a secret payoff from an arms dealer.The woman alleged rape, but Reeves insisted it was consensual.Campaigners now have compelling documentary evidence of the human rights abuses that they had been alleging for several years.The woman alleges that her employers passed her over for promotion because she was pregnant.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nfinger\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nAdd to word list\nAdd to word list\nto state that something bad is a fact without giving proof: School districts are alleging the state has not continued to finance schools adequately. Note: Usually used to describe legal matters. alleged adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/əˈledʒd/\nthe alleged crime/incident/wrongdoing allegedly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/əˈledʒ·ɪd·li/\nThe company is being investigated for allegedly falsifying sales records.\nAdd to word list\nAdd to word list\nto state that someone has done something illegal or wrong without giving proof: It is alleged that he used his influential position to steal thousands of pounds of company profits."}