{"id":8579,"name":"allegation","type":"noun","us_sound":"ˌæl.əˈɡeɪ.ʃən","us_link":"../audio/a/allegation.mp3","uk_sound":"ˌæl.əˈɡeɪ.ʃən","uk_link":"../audio/a/ukalign016.mp3","content":"Add to word list\nAdd to word list\nC1 a statement, made without giving proof, that someone has done something wrong or illegal: Several of her patients have made allegations of professional misconduct about/against her. [ + that ] Allegations that Mr Dwight was receiving money from known criminals have caused a scandal.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nMore examplesFewer examplesThere is no substance to the allegation.Are you able to verify your allegation?He's demanding a full apology from the newspaper for making untrue allegations about his personal life.These allegations have seriously hurt her reputation.He strenuously denies all the allegations against him.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nfinger\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nAdd to word list\nAdd to word list\na statement, made without giving proof, that someone has done something wrong or illegal: The allegations of corruption were not true. Note: Usually used to describe legal matters.\nAdd to word list\nAdd to word list\na statement that someone has done something wrong or illegal, but which has not been proved to be true: allegation about sth The chief executive of the company resigned last autumn over allegations about his expenses.allegation that She rejected the allegation that she had treated her staff unfairly.make allegations of sth (against sb) He made allegations of unfair dismissal against his former employers."}