{"id":8711,"name":"alliance","type":"noun","us_sound":"əˈlaɪ.əns","us_link":"../audio/a/alliance.mp3","uk_sound":"əˈlaɪ.əns","uk_link":"../audio/a/ukallev005.mp3","content":"Add to word list\nAdd to word list\nC2 a group of countries, political parties, or people who have agreed to work together because of shared interests or aims: a military alliance NATO is sometimes called the Atlantic Alliance.\nC2 an agreement to work with someone else to try to achieve the same thing: The three smaller parties have forged/formed an alliance against the government. Some of us feel that the union is in alliance with management against us.\nMore examplesFewer examplesAll the countries have proclaimed their loyalty to the alliance.Religious fanatics have formed an unholy alliance with right wing groups.A chain can only be as strong as its weakest link, so we must look at the least committed country to see if the alliance will hold.All these different political elements have somehow been yoked together to form a new alliance.The party is a loose alliance of environmentalists and left-wingers.\nSMART Vocabulary: related words and phrases\nGroups of people\nan\nanti-gang\nassemblage\nbaby boomer\nband\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating alliances\nAdd to word list\nAdd to word list\npolitics &amp; government a group of countries, political parties, or people who work together because of shared interests or aims, or the act of forming such a group: [ C ] Switzerland does not belong to any military alliance. [ U ] Alliance against our common enemy is our only hope for survival.\nAdd to word list\nAdd to word list\nan agreement to work with another person, organization, etc. to try to achieve the same thing: a business/economic/marketing allianceforge/form/enter into an alliance with sb/sth The company will forge alliances with other car makers similar to joint manufacturing agreements already established in Europe.alliance between sb (and sb) Many details of the alliance between the two companies have been left unclear.\na group of countries, companies, organizations, etc. who have agreed to work together because of shared interests: a global/an international alliance The most likely outcome would be a project managed by an alliance of contractors with an equal interest in building the carrier.\nin alliance with sb/sth\nworking together with another person, organization, etc.: The company will also be able to promote its service in alliance with broadband suppliers in which it has made investments.\nSee also\nstrategic alliance"}