{"id":8821,"name":"allocution","type":"noun","us_sound":"ˌæl.əˈkjuː.ʃən","us_link":"../audio/a/cdo1121usallo0099.mp3","uk_sound":"ˌæl.əˈkjuː.ʃən","uk_link":"../audio/a/cdo1121ukallo0084.mp3","content":"Add to word list\nAdd to word list\n[ C or U ]\n&#160; law\n&#160; US specialized a formal speech to a court, usually by the accused person or by a victim, as part of deciding the sentence (= punishment), or the act of making a speech like this: He pleaded guilty and during his allocution, admitted other attacks. The right of allocution is a statutory provision permitting crime victims to speak at the sentencing of convicted offenders.\n[ C ]\n&#160; religion\n&#160; specialized a formal speech giving advice, especially by a religious leader: He pointed to Pope John Paul II’s allocution of 2004 that stated feeding tubes were part of normal care. the encyclicals, allocutions and apostolic letters of Pius IX\nMore examplesFewer examplesHer attorneys elected for her to read an allocution, an unsworn statement that is not subject to cross-examination. The version of events he related to a probation officer differed from the allocution he gave during trial.In his allocution, he admitted that he operated a Ponzi scheme through his business. The defendant is entitled to allocution before a sentencing term is imposed. It has been the intent to follow the line indicated by the Holy Father in his Allocution to the Plenary Assembly of the Congregation.In the divine allocution (the Koran) there is the command, Vie ye with each other in hastening.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\nflight risk\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious practices"}