{"id":8793,"name":"allocation","type":"noun","us_sound":"ˌæl.əˈkeɪ.ʃən","us_link":"../audio/a/allocation.mp3","uk_sound":"ˌæl.əˈkeɪ.ʃən","uk_link":"../audio/a/ukallev011.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] the process of giving someone their part of a total amount of something to use in a particular way: the allocation of resources/funds/time Allocation of the grants was handled by a charity that provides support and advocacy for disabled children.\nC2 [ C ] the part of a total amount of something that someone is given to use in a particular way: The university is offering moving allocations to anyone who is being displaced from properties it acquires. Higher budgetary allocations for education mean more teachers can be hired and classes can be smaller. See\nallocate\nMore examplesFewer examplesInitially the problem was in the allocation of seats on the flight.There needs to be more efficient allocation of financial resources.Board members disagree over the budget allocations. The government has made supplementary allocations to food and fuel subsidies.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallot\nallotment\nallotted\napportion\ncollective\ndistribute\ndistribution\ndistributive\ndistributively\ndivide/split (something) down the middle idiom\njoint\nmate\nportion something out\nration\nration something out\nredistribute\nredistribution\nsplit\nspread\nSee more results »\nAdd to word list\nAdd to word list\nthe act or process of giving out parts of a whole, or a part given out in this way: [ U ] The allocation of space in this office is unusual.\nAdd to word list\nAdd to word list\n[ U ] the act of deciding officially which person, company, area of business, etc. something should be given to, or what share of a total amount of something such as money or time should be given to someone to use in a particular way: resource/time allocation The company is holding a review into the optimal allocation of a salesperson's time. allocation of capital/funds/resources The move will lead to more efficient pricing and allocation of capital.\n[ C ] the share of a total amount of something given to a person, company, etc.: The program is financed with a $5 billion annual allocation.\n[ C or U ]\n&#160; STOCK MARKET\n&#160; (also allotment) the number of new shares that are offered to each possible buyer, or the process of offering them: The rules on performance-related share allocations are extremely complex. Each individual investor got an allocation of 294 shares.\n[ C or U ]\n&#160; ACCOUNTING a cost or an amount that is put in a particular place in a company's accounts, or the process of putting it there See also\ncost allocation"}