{"id":9015,"name":"allowance","type":"noun","us_sound":"əˈlaʊ.əns","us_link":"../audio/a/allowance.mp3","uk_sound":"əˈlaʊ.əns","uk_link":"../audio/a/ukallev017.mp3","content":"allowance noun\n(AMOUNT GIVEN)\nAdd to word list\nAdd to word list\nC1 [ C ] money that you are given regularly, especially to pay for a particular thing: The perks of the job include a company pension and a generous travel allowance. I couldn't have managed at college if I hadn't had an allowance from my parents.\n[ C ] an amount of something that you are allowed: The baggage/luggage allowance for most flights is 20 kilos.\n[ C ] mainly US (UK usually pocket money) an amount of money that parents regularly give to their child to spend as they choose\nMore examplesFewer examplesGary's been exploiting the system, getting both a student allowance and unemployment benefit.A family man's earnings rose 5% in real terms after deducting income tax, insurance, child allowances, etc.Paul has to use his car a lot in his new job but he gets a good mileage allowance.He gets a small allowance from his father - just enough to live on until he starts to earn money.The basic calorie allowance is 2000 calories a day for women and 2500 for men.\nSMART Vocabulary: related words and phrases\nGrants & allowances\nanti-subsidy\nbenefit\nbenny\nbursary\ncost-of-living allowance\ndearness allowance\nexpense\nfellowship\nfringe benefit\nparachute payments\npension\npin money\nredundancy payment\nscholarship\nscrappage\nstipend\nsubsidized\nsubsidizer\nunemployment benefit\nweighting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for size and amount\nallowance noun\n(PREPARATION)\nmake allowance for\nto prepare for the possibility of: We should make allowance for bad weather and have plenty of umbrellas available.\nSee more\nallowance noun\n(ACCEPTING)\nmake allowances for\nC2 To make allowances for someone is to think about their characteristics and not judge them too severely: You should make allowances for him - he's been quite ill recently.\nSee more\nAdd to word list\nAdd to word list\nthe amount of something available or needed for a particular purpose: What is the recommended daily allowance of vitamin A?\nAn allowance is also money given by parents to a child every week that the child can spend.\nAdd to word list\nAdd to word list\nmoney that someone is given regularly by their employer or by the government to pay for a particular thing: an accommodation/car/mileage allowancean allowance for sth/to do sth Some companies will even give their telecommuting executives an allowance to buy office furniture for their home. Employees relocating to London receive a maximum allowance of £1000 a year.\nan amount of something that someone is allowed to have, use, produce, etc.: baggage/luggage allowance Baggage allowance is 2 free bags per passenger, and $80 per additional bag. In Europe nearly all of the valuable emission allowances - permits that each allow one ton of emissions - were given away to power companies.\nTAX an amount of goods that you are allowed to buy and take into another country before you have to start paying tax: The Australian Customs Service will not charge you duty or tax on goods you bring in if they are within the duty-free allowance guidelines.\nTAX\n&#160; mainly UK an amount of money that can be taken off your income before the tax owed is calculated: a tax allowance a personal/married couple's/single person's allowance an annual allowance\nACCOUNTING, TAX an amount of money that can be taken off a company's profits before the tax owed is calculated: The purchaser of assets can claim allowances on certain items such as plant and machinery.\nthe fact of planning or paying now for a possible future change in a situation or a possible future cost, or the amount that is planned for: make an allowance for sth It is unlikely that the regulator will make any allowance for falls in customer service caused by a strike. They made a 10% allowance for bad debt. The company will extend existing health-plan contracts and their pricing for eight years, with allowances for inflation. Compare\nprovision noun\nCOMMERCE a special arrangement, such as a lower price, that manufacturers offer to stores which are going to sell their products: When selling a new product, manufacturers sometimes give retailers an allowance, for example a sale or return agreement. See also\ncapital allowance\ncost of living allowance\ndisplay allowance\nentertainment allowance\nhardship allowance\ninvestment allowance\nJobseeker's Allowance\nloan-loss allowance\npersonal allowance\nsubsidiary noun\nView all\nsubsistence allowance\nwriting-down allowance"}