{"id":8705,"name":"ally","type":"noun","us_sound":"ˈæl.aɪ","us_link":"../audio/a/ally_01_00.mp3","uk_sound":"ˈæl.aɪ","uk_link":"../audio/a/ukallev030.mp3","content":"Add to word list\nAdd to word list\nC2 a country that has agreed officially to give help and support to another one, especially during a war: ally of sb During the First World War, Turkey was an ally of Germany. The US is one of Britain's staunchest allies. See also\nthe Allies\nC1 someone who helps and supports someone else: ally of sb She is known to be a longtime ally of the chancellor. He is generally considered to be the prime minister's closest political ally. She consulted someone who had always been a staunch friend and ally.\nsomeone who helps and supports other people who are part of a group that is treated badly or unfairly, although they are not themselves a member of this group: ally to sb He promised to be an ally to women in their fight against abuse. Allies use their power to create a more inclusive workplace where everyone can thrive, and find ways to make their privilege work for others.\nMore examplesFewer examplesCuba became an ally of the Soviet Union in the 1950s.If the violence continues, they risk alienating one of their most powerful allies.NATO allies have decided to send peace-keeping troops to the troubled area.The President and his allies are willing to shut down the federal government unless they get what they want.You have been my ally and my confidant. Students will study African American activists and white allies who put their lives on the line for African American Civil Rights.Here are some tips on how to be an ally at work.\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\nabettor\naccessory\naccomplice\nacolyte\naide\nbackup\nbuddy\ncollaborator\nconfederate\nden mother\nenabler\nlifesaver\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nsponsor\nstrength\nsupport group\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing, being or existing together\nSupporters, members & defenders\nAdd to word list\nAdd to word list\npolitics &amp; government a country that has agreed to give help and support to another, esp. during a war, or a person who helps and supports someone else ally verb [ T always + adv/prep ] us\nYour browser doesn't support HTML5 audio\n/əˈlɑɪ, ˈæl·ɑɪ/\nI refused to ally myself with that mob."}