{"id":9162,"name":"almost","type":"adverb","us_sound":"ˈɑːl.moʊst","us_link":"../audio/a/almost.mp3","uk_sound":"ˈɔːl.məʊst","uk_link":"../audio/a/ukally_007.mp3","content":"Add to word list\nAdd to word list\nA2 nearly: She's almost 30. It was almost six o'clock when he left. I almost wish I hadn't invited him. It'll cost almost as much to repair it as it would to buy a new one. Almost all the passengers on the ferry were French. They'll almost certainly forget to do it. The town was almost entirely destroyed during the war. We were bitten by mosquitoes almost every night. The boat sank almost immediately after it had struck the rock. Most artists find it almost impossible to make a living from art alone. Synonyms\nabout\nnear\nnearly\nnigh old-fashioned or literary\nvirtually\nwell-nigh\nThesaurus: synonyms, antonyms, and examples\nnot completelyalmostWe need to hurry up - it's almost time to go.nearlyIt's nearly midnight.nearHe was near tears (= almost crying).aboutAre you about ready to leave?all butThe concert was all but over by the time we arrived. well-nighIt was well-nigh impossible to get a person on the phone these days.\nSee more results »\nMore examplesFewer examplesIt took us almost a day to get here.The socialist party have been in office for almost ten years.Her paintings are almost photographic in their detail and accuracy.Tyres are almost always made of rubber.A car suddenly appeared from nowhere and almost made me fall off my pony.\nSMART Vocabulary: related words and phrases\nAlmost\na hop, skip, and a jump idiom\nabout\nas good as idiom\nas much as idiom\nbe on the way to something idiom\nintent\nmore\nmore or less idiom\nmuch\nnear\npart\nsub\nthat was close! idiom\nthe best/better part of idiom\nto/for all intents and purposes idiom\nup to (doing) something idiom\nverge\nverge on something\nvirtual\nway\nSee more results »\nGrammar\nAlmost or nearly?We use almost and nearly to refer to the progress of things, especially if we are measuring and counting things. In these examples, almost and nearly can both be used: …\nAdd to word list\nAdd to word list\nnearly but not quite: It’ll cost almost as much to repair your computer as to buy a new one. We were bitten by mosquitoes almost every night."}