{"id":9260,"name":"alone","type":"adjective","us_sound":"əˈloʊn","us_link":"../audio/a/alone.mp3","uk_sound":"əˈləʊn","uk_link":"../audio/a/ukally_013.mp3","content":"Add to word list\nAdd to word list\nA2 without other people: He likes being alone in the house. She decided to climb the mountain alone. Do you like living alone? At last, we're alone together (= there are just the two of us here). The Swedes are not alone in finding their language under pressure from the spread of English. I don't like the man and I'm not alone in that (= other people agree).\nThesaurus: synonyms, antonyms, and examples\nnot with othersaloneYou can tell me your secret - I think we're alone. (all) on your ownI like living on my own. on your lonesomeUK Sure, you can play the game on your lonesome, but it's more fun with friends.on your todUK Ah, your family's gone and left you on your tod, have they?unaccompaniedTo everyone's great surprise, she arrived at the ball unaccompanied.solitaryHe was a solitary child who preferred reading a book to football.\nSee more results »\nMore examplesFewer examplesIt's inexcusable that such young children were left in the house alone.Go away and leave me alone!I got the impression that they'd rather be alone.It appears that she left the party alone.You're mad to walk home alone at this time of night.\nSMART Vocabulary: related words and phrases\nAlone\nabandoned\nalienate\nalienated\napart\nbe cast away idiom\nherself\nlone wolf\nlonely\nloner\nlonesome\nminority\noutsider\nshag\nshut\nshut someone away\nsole\nsolely\nsolitarily\nsolitary\nsolitude\nSee more results »\nGrammar\nAlone, lonely, or lonesome?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nAlone or lonely?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nLonesomeIn American English, lonesome means the same as lonely: …\nC2 without any others: She alone needs to decide what to do (= no one else can do it for her). These facts alone (= even if nothing else is considered) show that he's not to be trusted. He won't get the job through charm alone (= he will need something else). The airfare alone would use up all my money, never mind the hotel bills. Price alone is not a reliable indicator of quality.\nMore examplesFewer examplesWords alone cannot convey the untold misery endured by people in these refugee camps.He truly believes he can cure himself by willpower alone.Is it more democratic to hold a referendum, rather than let the government alone decide?These problems might not be solved by money alone, but they will assuredly not be solved without it.This year alone eight police officers have been killed in the line of duty.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nGrammar\nAlone, lonely, or lonesome?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nAlone or lonely?Alone is an adjective and an adverb meaning that no other person is with you. When we use alone as an adjective, it never comes before the noun (predicative adjective): …\nLonesomeIn American English, lonesome means the same as lonely: …\nalone adjective, adverb\n(WITHOUT PEOPLE)\nAdd to word list\nAdd to word list\nwithout other people: She decided to climb the mountain alone. We can discuss your proposal when we’re alone (= when other people present have left).\nalone adjective [not gradable]\n(ONLY)\nwithout any others, or only: I based my decision on her recommendation alone."}