{"id":9402,"name":"already","type":"adverb","us_sound":"ɑːlˈred.i","us_link":"../audio/a/already.mp3","uk_sound":"ɔːlˈred.i","uk_link":"../audio/a/ukally_028.mp3","content":"Add to word list\nAdd to word list\nA2 before the present time: I asked him to come to the exhibition but he'd already seen it. The concert had already begun by the time we arrived. I've already told him. As I have already mentioned, I doubt that we will be able to raise all the money we need.\nB1 earlier than the time expected: Are you buying Christmas cards already? It's only September! I've only eaten one course and I'm already full.\nMore examplesFewer examplesHe was disappointed to find they'd already gone.I've been waiting an hour already.I knew a lot about the subject already, but her talk was interesting nevertheless.The food is already on the table.I think we've already had the best of the hot weather this summer.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nante\nas it is idiom\nbefore\nbeforehand\nheel\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprior\npriorly\nprologue\nquondam\nsecond-wave\nsecondary\nthe next but one idiom\nwake\nSee more results »\nGrammar\nAlreadyAlready is an adverb. …\nAlready: meaningWe use already to emphasise that something was completed before something else happened. It is often used with the present perfect or past perfect: …\nAlready: positionWe usually put already in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nAlready: typical errorsWe don’t use the past simple with already for something which was completed before something else happened. Instead, we use the past perfect. …\nAlready, still or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready, yet or still?We use still not yet or already to refer to the continuation of a situation: …\nNegatives with already, still, yetNegatives with yet mean that something has not happened up to now: …\nIdiom\n... already!\nAdd to word list\nAdd to word list\nearlier than the time expected, in a short time, or before the present time: Are you planning a summer trip already? It’s only September! I’ve already seen that movie.\nAlready can also mean now: It’s bad enough already – don’t make it any worse."}