{"id":9457,"name":"alteration","type":"noun","us_sound":"ˌɑːl.t̬əˈreɪ.ʃən","us_link":"../audio/a/eus70159.mp3","uk_sound":"ˌɒl.təˈreɪ.ʃən","uk_link":"../audio/a/ukaltar003.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] a change, usually a slight change, in the appearance, character, or structure of something: Several police officers are being questioned about the alteration of the documents. The house needed extensive alterations when we moved in. Some alterations to our original plans might be necessary. Synonyms\nadjustment (CHANGE)\namendment\nchange (BECOMING DIFFERENT)\nmodification (CHANGE)\nmutation\n[ C or U ] a change or changes made to the size or shape of a piece of clothing so that it fits better: She's getting some alterations done to her dress.\nC1 [ U ] the process of changing something: The landscape has undergone considerable alteration.\nMore examplesFewer examplesIt was a long haul , but the alterations to the house are finished at last.Major alterations meant that a large part of the gallery was closed for several years.They underestimated the cost of alterations and repairs and failed to finish the project.Any alterations to the original plan have to be approved by the committee.A network of old tunnels was discovered by workmen making alterations to a property in the old town.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nanti-evolutionism\nbe ahead of the curve idiom\nblip\ncampaign finance reform\nflatten\nflip-flop\nfluctuation\ngradation\ngyrate\ngyration\nretransformation\nreversal\nreversion\nrevolution\nrhythm\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nAdd to word list\nAdd to word list\na change in the appearance, character, or structure of something: an alteration to sth Some alterations to our original plans might be necessary. If you have made any alterations since you last saved the document, a warning message will appear.significant/major alteration The report's recommendations should be adopted without major alteration."}