{"id":9497,"name":"alternatively","type":"adverb","us_sound":"ɑːlˈtɝː.nə.t̬ɪv.li","us_link":"../audio/a/alternatively.mp3","uk_sound":"ɒlˈtɜː.nə.tɪv.li","uk_link":"../audio/a/ukaltar010.mp3","content":"Add to word list\nAdd to word list\nB2 used to suggest another possibility: We could go to the Indian restaurant, or alternatively, we could try that new Italian place. Synonym\ninstead\nMore examplesFewer examplesYou could catch the 18.30 train - alternatively, you could wait for the 19.50 fast train.Mix two tablespoons of sugar, or alternatively honey, into the mixture.Post this order form in the envelope provided. Alternatively, phone our order line or order online from our website.It would be a six-month wait for the operation but, alternatively, you could pay for private treatment.The quickest way is to take the motorway. Alternatively, there is the coastal route, which is much prettier.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nbargain something away\nbehalf\nchange over\nchange places idiom\nname\nnovate\npart exchange\npinch-hit\npre-empt\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitution\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nGrammar\nAlternate(ly), alternative(ly)The adjective alternate and the adverb alternately mean ‘first one thing, then another thing and then the first thing again’. When we refer to time, we can also use the phrase every other day, every other week, etc. …\nAlternate(ly)The adjective alternate and the adverb alternately mean ‘first one thing, then another thing and then the first thing again’. When we refer to time, we can also use the phrase every other day, every other week, etc. …\nAlternative(ly)Alternative(ly) means ‘something that is different and unusual and offers a possible choice’: …\nAdd to word list\nAdd to word list\nin a way that offers a choice between two or more things: We could go to the Mexican restaurant, or alternatively (= instead of that), we could try that new Italian place."}