{"id":9496,"name":"alternative","type":"adjective","us_sound":"ɑːlˈtɝː.nə.t̬ɪv","us_link":"../audio/a/alternative.mp3","uk_sound":"ɒlˈtɜː.nə.tɪv","uk_link":"../audio/a/ukaltar009.mp3","content":"Add to word list\nAdd to word list\nB2 (US also alternate) An alternative plan or method is one that you can use if you do not want to use another one: The opposition parties have so far failed to set out an alternative strategy. An alternative venue for the concert is being sought.\nThesaurus: synonyms, antonyms, and examples\ndifferentdifferentI like her haircut - it's different! dissimilarThe twins may look alike, but they are quite dissimilar when it comes to personality.diverseLondon is a culturally diverse city.heterogeneousThey tested a heterogeneous population.\nSee more results »\nB2 Alternative things are considered to be unusual and often have a small but enthusiastic group of people who support them: alternative comedy\nMore examplesFewer examplesHigh vehicles must take an alternative route because of low clearance under the bridge.Government funding of alternative healthcare is virtually non-existent.Despite all the advances in modern medicine, demand for alternative therapies and faith healing keeps growing.In Los Angeles many companies encourage their employees to use alternative means of transportation, rather than the car.Doctors these days tend to be more open-minded about alternative medicine.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nanomalous\nanother\nanything\nanything like idiom\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnique and unusual\nGrammar\nAlternate(ly), alternative(ly)The adjective alternate and the adverb alternately mean ‘first one thing, then another thing and then the first thing again’. When we refer to time, we can also use the phrase every other day, every other week, etc. …\nAlternate(ly)The adjective alternate and the adverb alternately mean ‘first one thing, then another thing and then the first thing again’. When we refer to time, we can also use the phrase every other day, every other week, etc. …\nAlternative(ly)Alternative(ly) means ‘something that is different and unusual and offers a possible choice’: …\nB2 something that is different from something else, especially from what is usual, and offering the possibility of choice: an alternative to an alternative to coffee There must be an alternative to people sleeping on the streets.no alternative You've given me no alternative. I'm afraid we have to let you go.no alternative but I'm afraid I have no alternative but to ask you to leave (= that is what I have to do). Synonym\noption\nMore examplesFewer examplesCarob is sometimes used in sweet foods as a healthier alternative to chocolate.Solar power is now a viable alternative to oil-fired water heaters.The alternative is to tunnel a route through the mountain.In the absence of any better alternative, we will have to proceed with the original plan.Imposing sanctions is a moderate action when you consider that the alternative is military intervention.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nanomalous\nanother\nanything\nanything like idiom\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nAdd to word list\nAdd to word list\nsomething that is different, esp. from what is usual; a choice: You can make it look good by comparing it to a crummy alternative. I have no alternative but to ask you to leave.\noffering a choice between two or more things: People stay because they don’t have alternative opportunities.\nAlternative medicine is a wide range of treatments for medical conditions that people use instead of, or with, Western medicine."}