{"id":9562,"name":"altogether","type":"adverb","us_sound":"ˌɑːl.təˈɡeð.ɚ","us_link":"../audio/a/altogether.mp3","uk_sound":"ˌɔːl.təˈɡeð.ər","uk_link":"../audio/a/ukaltar016.mp3","content":"Add to word list\nAdd to word list\nB1 in total: That'll be $52.50 altogether, please.\nB2 completely: The government ought to abolish the tax altogether. She wrote less and less often, and eventually she stopped altogether. It's all right working with him, but living with him would be a different matter altogether. I'm not altogether sure I want that (= I have doubts about it). I think Graham will agree, but convincing Mary will be altogether more (= much more) difficult.\nB2 considering everything: He's bad-tempered, selfish, and altogether an unpleasant man.\nMore examplesFewer examplesThe best option would be to cancel the trip altogether.The new systems cut humans out of the picture altogether.The first casualty of the reorganization will be the bus service, which will be stopped altogether.Talking about the world's problems is one thing, but solving them is another matter altogether.Cars are useful, but their impact on the environment is another matter altogether.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-length\nfully\nfully fledged\nglobally\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nGrammar\nAltogether or all together?Altogether means ‘completely’ or ‘in total’: …\nAltogetherAltogether means ‘completely’ or ‘in total’: …\nAll togetherAll together means ‘with each other’, and is similar to together: …\nbe in the altogether old-fashioned\nto be naked: The photos show the princess romping in the altogether in the Caribbean.\nSee more\nAdd to word list\nAdd to word list\ncompletely or in total: The train slowed down and then stopped altogether. He was altogether exhausted. Altogether, she gave away some $60 million in her lifetime."}