{"id":9720,"name":"ama","type":"adverb","us_sound":"ˌeɪ.emˈeɪ","us_link":"../audio/a/cdo0623usama0070.mp3","uk_sound":"ˌeɪ.emˈeɪ","uk_link":"../audio/a/cdo0623ukama0068.mp3","content":"Add to word list\nAdd to word list\nabbreviation for against medical advice: used when someone makes a decision about their medical care, especially a decision to leave a hospital, when a doctor has not advised them to do this, or has advised them not to do it: The patient demanded to be discharged and threatened to leave AMA. Discharge against medical advice (AMA), in which a patient chooses to leave hospital before the treating physician recommends it, can be a problem.\nMore examplesFewer examplesHe told me that he had just signed himself out of hospital \"AMA\", or against medical advice.The available data suggests that patients discharged AMA have a higher risk of readmission to hospital.The patient had been sent to the emergency room, where they left without treatment AMA (against medical advice).My son was hospitalized, but walked out AMA without telling anyone.The treatments only made me more ill so I made a decision AMA, against medical advice, to discontinue them.\nSMART Vocabulary: related words and phrases\nMedical treatment: general words\nallopathic\naspiration\nbiosurgery\nco-administration\ndetoxify\nelective\nmedicalize\nmedically\nmodality\nmuscularly\nmuti\northopaedic\npolypharmacy\npostoperative\nprehab\nprehabilitation\nprimary care\nreconstructive\nrestorative\nstretcher\nSee more results »\nthe AMA\nabbreviation for the American Medical Association: an organization in the US that represents and speaks for doctors and medical groups: The AMA urged that testing be universal but not mandatory. The issue was debated on Sunday in an AMA committee hearing.\nMore examplesFewer examplesThe AMA opposes federal intervention on this issue. The AMA represents 250,000 doctors, out of more than a million in the nation.An informal AMA survey found that 40-50 percent of doctors weren't familiar with the ethics code.\nSMART Vocabulary: related words and phrases\nNamed organizations & societies & their members\nAFC\nbeaver\nBeavers phrase\nBrown Owl\nbrownie\nCND\nFRS\nmafia\nmasonry\nMLB\nMLS\nNAACP\nNASCAR\nOxfam\nparent-teacher association\nrainbow\nthe IOC\nthe IRA\nthe Red Crescent\nthe Red Cross\nSee more results »\nAdd to word list\nAdd to word list\nabbreviation for the American Medical Association: a professional organization in the US that supports doctors and works to improve public health: The AMA urged investors to sell shares in companies that manufacture tobacco."}