{"id":9869,"name":"amateur","type":"adjective","us_sound":"ˈæm.ə.tʃɚ","us_link":"../audio/a/eus70167.mp3","uk_sound":"ˈæm.ə.tər","uk_link":"../audio/a/ukamalg007.mp3","content":"Add to word list\nAdd to word list\nC1 taking part in an activity for pleasure, not as a job: an amateur astronomer/boxer/historian He was an amateur singer until the age of 40, when he turned professional. Compare\nprofessional adjective\nrelating to an activity, especially a sport, where the people taking part do not receive money: amateur athletics\nMore examplesFewer examplesThe firm produces kits for amateur car constructors.an amateur photographeran amateur dramatic societyamateur theatricalsHe's in charge of wardrobe at the local amateur theatre.\nSMART Vocabulary: related words and phrases\nEnthusiasts\n-aholic\n-oholic\naficionado\nanorak\narmchair\naudiophile\nDIYer\neager beaver\nenthusiast\nfaddist\nfan favourite\nlover\nnerd\nnumismatist\notaku\nturophile\nultra\nwatcher\nWhovian\nzealot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting in sport\nC1 a person who takes part in an activity for pleasure, not as a job: This tennis tournament is open to both amateurs and professionals. Compare\nprofessional adjective\nC1 disapproving someone who does not have much skill in what they do: I won't be giving them any more work - they're a bunch of amateurs.\nSMART Vocabulary: related words and phrases\nEnthusiasts\n-aholic\n-oholic\naficionado\nanorak\narmchair\naudiophile\nDIYer\neager beaver\nenthusiast\nfaddist\nfan favourite\nlover\nnerd\nnumismatist\notaku\nturophile\nultra\nwatcher\nWhovian\nzealot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInability and awkwardness\nAdd to word list\nAdd to word list\ntaking part in an activity for pleasure and not as a job, or (of an activity) done for pleasure and not as a job: He was an amateur archaeologist.\nAn amateur is also someone who lacks skill in doing something: Some of the people who show up at practice shooting ranges are real amateurs.\nAdd to word list\nAdd to word list\ntaking part in an activity because you are interested in it or enjoy it, not as a job: an amateur investor an amateur astronomer/actor/historian Compare\nprofessional adjective\na person who takes part in an activity because they are interested in it or enjoy it, not as a job: This conference is open to both amateurs and professionals.\ndisapproving someone who does not have much skill in what they do: I won't be giving them any more work - they're a bunch of amateurs."}