{"id":9898,"name":"amaze","type":"verb","us_sound":"əˈmeɪz","us_link":"../audio/a/amaze.mp3","uk_sound":"əˈmeɪz","uk_link":"../audio/a/ukamalg012.mp3","content":"Add to word list\nAdd to word list\nto cause someone to be extremely surprised: [ + question word ] I was amazed by how well he looked. You've done all your homework in an hour? You amaze me. [ + that ] It amazes me that she's got the energy for all those parties. [ + to infinitive ] It amazes me to think that Anna is now in charge of the company. It amazes me how you can put up with living in such a dirty house. It never ceases to amaze me how he can talk for so long without ever saying anything interesting. Synonyms\nastonish\nastound\nstun (SHOCK)\nMore examplesFewer examplesShe was wide-eyed in amazement.He gave a gasp of amazement.We all watched in amazement as he juggled with three flaming torches.She was rooted to the spot with amazement.She was round-eyed with amazement.If you compare house prices in the two areas, it's quite amazing how different they are.He concocted the most amazing dish from all sorts of unlikely ingredients.Rain forests are filled with amazing creatures.Coming to your screens shortly, the amazing adventures of 'Robin Hood'.What amazing train of thought led you from Napoleon to global warming?I was amazed at the depth of her knowledge.He was amazed that a reputable firm would stoop to selling the names of their clients to other companies.I was amazed at the size of their garden.We were amazed by what she told us.He's always seemed very self-controlled, so I was amazed by his sudden outburst in the office.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namazing\namazingly\nastonish\nastonishing\nblinding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\nearth-shatteringly\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nsensationalize\nstagger\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\nAdd to word list\nAdd to word list\nto cause someone to be extremely surprised: The prices they’re getting for vegetables just amaze me. I’m amazed at how well your little girl can read. amazement noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈmeɪz·mənt/\nMuch to my amazement, she liked the idea."}