{"id":9911,"name":"amazon","type":"noun","us_sound":"ˈæm.ə.zɑːn","us_link":"../audio/a/usamanu007.mp3","uk_sound":"ˈæm.ə.zən","uk_link":"../audio/a/ukamalg017.mp3","content":"Add to word list\nAdd to word list\na tall, strong, or forceful woman\nRelated word\namazonian\na major river in Peru, Colombia, and Brazil, and one of the longest rivers in the world: The source of the Amazon is a stream in the Peruvian Andes. A guide tells us the annual rise in the height of the River Negro, a tributary of the Amazon, had reached 30 metres.\nMore examplesFewer examplesThe expedition of Bolivian, Colombian, and Argentine scientists is part of a year-long census of freshwater dolphins in the Amazon and Orinoco river basin.As quite a young child, I pored over encyclopedias and geography books: was the Mississippi-Missouri really the longest river, or was it the Nile or the Amazon?The Slovenian became the first person to swim the entire 3,000-mile length of the Amazon, having braved crocodiles, piranhas and toothpick fish.So why was I drifting down the Amazon with a wounded guide and no map?\nSMART Vocabulary: related words and phrases\nWatercourses & waterfalls\narroyo\nbeck\nbourne\nbrook\nburn\ncascade\ncataract\nCongo\nEuphrates\nfluvial\nfordable\ngulch\nmaelstrom\nraceway\nrapids\nrill\nriverbed\nriverine\nrunnel\nwaterway\nSee more results »\na tropical region of South America through which the Amazon River flows, including parts of Peru, Colombia, and Brazil: But how will the Amazon respond to future climate change? In the Amazon, water levels vary through the year.\nMore examplesFewer examples Brazil's new environment minister takes office today in the middle of a spat over an apparent recent increase in deforestation in the Amazon region.Sister Dorothy was shot while defending land in the Amazon.They sit right beside the Amazon, the planet's largest tropical rainforest and river basin.As North American farmers plant less soya, South American farmers clear more of the Amazon to fill the demand."}