{"id":9943,"name":"ambassador","type":"noun","us_sound":"æmˈbæs.ə.dɚ","us_link":"../audio/a/ambassador.mp3","uk_sound":"æmˈbæs.ə.dər","uk_link":"../audio/a/ukamalg019.mp3","content":"ambassador noun [C]\n(GOVERNMENT OFFICIAL)\nAdd to word list\nAdd to word list\nB2 an important official who works in a foreign country representing his or her own country there, and who is officially accepted in this position by that country: The UK's ambassador in Moscow has refused to comment. She's a former ambassador to the United States. Late last night, the French ambassador was summoned to the Foreign Office to discuss the crisis. At that time, Sir Jeremy Greenstock was the British UN ambassador (= represented the United Kingdom at the United Nations).\nMore examplesFewer examplesHe accused the ambassador of diplomatic double-talk.The ambassador denied that any missiles had been fired across the border.The ambassador is giving a banquet for the visiting president.The ambassador has offered to act as a go-between for the two countries involved in the conflict.As an ambassador, she enjoys a very privileged status.\nSMART Vocabulary: related words and phrases\nInternational relations: diplomacy & mediation\nambassadorial\nappease\nappeasement\nattaché\nbargaining chip\ndiplomatic bag\ndiplomatic corps\ndiplomatic immunity\ndiplomatic relations\nintercede\nintermediation\ninternationalist\ninterventionism\nlegation\nmediate\nplenipotentiary\nshuttle diplomacy\nthe diplomatic service\nundiplomatic\nundiplomatically\nSee more results »\nambassador noun [C]\n(REPRESENTATIVE)\na person who represents, speaks for, or advertises a particular organization, group of people, activity, or brand (= type of product): As a UNICEF goodwill ambassador, she speaks out on behalf of children's causes. He was really an ambassador for surfing because he was such a gentleman. She is a touring celebrity ambassador for a prestige watch company. See also\nbrand ambassador\nMore examplesFewer examplesHe has visited war-torn areas as a UNICEF ambassador.Mr. Anderson, who is a youth ambassador for Oxfam America, visited the Abu Shouk refugee camp.She spends much of her time serving as an ambassador for organic foods and farming and speaking out against genetically modified foods.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nanti-elite\nanti-elitist\napparatchik\nback seat\nbetters phrase\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nhonorary\nopposite number\nrank\nreach\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nwarranted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nAdd to word list\nAdd to word list\nan official who represents his or her own country in a foreign country: the US ambassador to Sweden"}