{"id":9958,"name":"amber","type":"noun","us_sound":"ˈæm.bɚ","us_link":"../audio/a/usamanu010.mp3","uk_sound":"ˈæm.bər","uk_link":"../audio/a/ukamalg021.mp3","content":"Add to word list\nAdd to word list\na hard, transparent, yellowish-brown substance that was formed in ancient times from resin (= a substance produced by trees) and is used in jewellery: He has a collection of prehistoric insects preserved in amber. Greek philosophers discovered that when amber is rubbed against cloth, lightweight objects will stick to it.\nhumbak/iStock/Getty Images Plus/GettyImages\na yellow-brown colour: She combines strong geometry with subtle colors, from muted sage to pale amber. Favaios is an amber coloured sweet wine from the Pinhao area of Portugal's Douro Valley.\nmainly UK (US usually yellow) the yellowish-orange traffic light that shows between the green and the red to warn drivers that the lights are about to change: The lights turned to amber.\n2ndLookGraphics/E+/GettyImages\nMore examplesFewer examplesNetsuke are miniature sculptures made of ivory, wood, jade or amber. In about eight years time, the steel will change to a dark amber.The lights flashed amber then green.\nSMART Vocabulary: related words and phrases\nGeology: precious & semi-precious stones\nblood diamond\ncarbuncle\ncarnelian\nconflict diamond\ncornelian\ncultured pearl\ngarnet\ngem\ngemmy\njade\njet\nmarcasite\nonyx\nopal\npearl\nprecious stone\nruby\nsemiprecious\ntopaz\nunset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nRoads: lights, signs & markings on roads\nyellow-orange or yellow-brown in colour: an amber light The lights cast an amber glow on the room.\nmade of or containing the substance amber: an amber necklace She stopped at a shop specialising in beautiful amber jewellery.\nMore examplesFewer examplesIn the amber light of late afternoon, he sips his tea.Caramelized sugar should be a medium amber colour. She fingered the amber beads at her neck.He carried a cane and wore an amber signet ring.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ncarmine\ndun\nearth tone\nemerald\npuce\nrust\nsaffron\nsalmon pink\nsanguine\nsapphire\nsky blue\nslaty\ntangerine\ntaupe\nverdure\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeology: precious & semi-precious stones"}