{"id":10027,"name":"ambition","type":"noun","us_sound":"æmˈbɪʃ.ən","us_link":"../audio/a/ambition.mp3","uk_sound":"æmˈbɪʃ.ən","uk_link":"../audio/a/ukamalg029.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a strong wish to achieve something: [ + to infinitive ] His ambition is ultimately to run his own business. He has already achieved his main ambition in life - to become wealthy. political ambitions She doubts whether she'll ever be able to fulfil her ambition. I've always had a burning (= very great) ambition to be a film director. After his heart attack, he abandoned his ambition to become prime minister. Synonyms\naim (INTENTION)\naspiration (HOPE)\ndream (HOPE)\ngoal (AIM)\nhope\nintent formal or specialized\nintention\nobject (PURPOSE)\nobjective\ntarget (AIM)\nB2 [ U ] a strong wish to be successful, powerful, rich, etc.: She has a lot of ambition.\nMore examplesFewer examplesHer ambition and dogged determination ensured that she rose to the top of her profession.We are looking for someone with drive and ambition.Driving ambition is what most great leaders have in common.Being here is the fulfilment of a lifelong ambition.She finally achieved her ambition to visit South America.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\navail\ncause\ndedicated\ndeflect\ndeliverable\ndream\neye\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\npoodle\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »\nAdd to word list\nAdd to word list\na strong desire for success, achievement, power, or wealth: [ C ] His presidential ambitions were frustrated in the 1980s. [ U ] No one ever accused him of lacking ambition.\nAdd to word list\nAdd to word list\n[ C ] a strong wish to achieve a particular thing: ambition to do sth After his heart attack, he abandoned his ambition to become CEO.achieve/fulfil/realize your ambition He has already achieved his main ambition in life - to become rich.ultimate/long-term ambition Her ultimate ambition is to run her own business. career ambitions. political/personal/artistic ambitions\n[ U ] a strong wish to be successful: She's got a lot of ambition. I felt he lacked the ambition to succeed in showbusiness."}