{"id":10034,"name":"ambitious","type":"adjective","us_sound":"æmˈbɪʃ.əs","us_link":"../audio/a/ambitious.mp3","uk_sound":"æmˈbɪʃ.əs","uk_link":"../audio/a/ukamalg030.mp3","content":"Add to word list\nAdd to word list\nB2 having a strong wish to be successful, powerful, or rich: an ambitious young lawyer He's very ambitious for his children (= he wants them to be successful).\nB2 If a plan or idea is ambitious, it needs a great amount of skill and effort to be successful or be achieved: She has some ambitious plans for her business. The government has announced an ambitious plan to modernize the railway network. The original completion date was over-ambitious, so we have had to delay the opening.\nMore examplesFewer examplesShe's very ambitious but I doubt she'll ever make it to the top.He described the plan as ambitious and audacious.The government is persisting with its ambitious public works programme.We're all ambitious - it seems to run in the family.Robert is a self-centred, ambitious, and bigoted man.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitiously\nangle for something\naspirant\ndesperate\nexpense\nfancy\nhunger\nhunger after/for something\nhungrily\nhungry\npine\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nstraw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplicated and difficult to do\nRelated word\nambitiously\nAdd to word list\nAdd to word list\nhaving a strong desire for success, achievement, power, or wealth: Even as a young man he was ambitious and self-assured.\nIf you describe an activity as ambitious, you mean that it involves a lot of effort or expense: It was an ambitious project to restore the public parks.\nAdd to word list\nAdd to word list\nhaving a strong wish to be successful: an ambitious young lawyer I make no secret of the fact that I am very ambitious.\nif a plan or idea is ambitious, it needs a lot of skill and effort to be successful or be achieved: The retailer announced ambitious plans yesterday as it reported profits up 19%. The government has announced an ambitious programme to modernize the railway network. Their goals proved to be a little too ambitious. ambitiously adverb /æmˈbɪʃəsli/\nThe company had expanded ambitiously into Europe."}