{"id":10259,"name":"amendment","type":"noun","us_sound":"əˈmend.mənt","us_link":"../audio/a/amendment.mp3","uk_sound":"əˈmend.mənt","uk_link":"../audio/a/ukambit019.mp3","content":"Add to word list\nAdd to word list\nC2 [ U or C ] a change or changes made to the words of a text: He insisted that the book did not need amendment. I've made a few last-minute amendments to the article. Presidential power was reduced by a constitutional amendment in 1991. Synonyms\nadjustment (CHANGE)\nalteration\nchange (BECOMING DIFFERENT)\nmodification (CHANGE)\nmutation\n[ C ] a change to a law that is not yet in operation and is still being discussed: An amendment to the bill was agreed without a vote.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\nassemblyman\nassemblywoman\nenact\nenforce\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\njurisprudentially\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nprohibit\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdapting and modifying\nAdd to word list\nAdd to word list\nUS history a change or addition to the US constitution: the First/Fifth/Fourteenth amendment a constitutional amendment\nAdd to word list\nAdd to word list\n[ C or U ] a change made to something, especially the words of a text: He insisted that the speech did not need any amendment.make amendments Other countries have based their systems on the Scottish model for selling property, but have made a few amendments.an amendment to sth She asked for several amendments to the contract.\n[ C ]\n&#160; LAW, GOVERNMENT a change to a law, either one that has already been passed or one that is still being discussed: The senator's amendment was voted down 52-40.an amendment to sth The regulation is an amendment to the 1995 Pensions Act.\n[ C ]\n&#160; LAW, GOVERNMENT\n&#160; (also Amendment) a law or change that has been added to the US Constitution (= the set of political principles by which the US is governed) since it was first written: The company claimed that the First Amendment, which guarantees free speech, protects the right to advertise."}