{"id":10303,"name":"american","type":"adjective","us_sound":"əˈmer.ɪ.kən","us_link":"../audio/a/american.mp3","uk_sound":"əˈmer.ɪ.kən","uk_link":"../audio/a/ukambit023.mp3","content":"Add to word list\nAdd to word list\nof or relating to the United States of America: They drive a big American car.\nof or relating to North or South America\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: nationalities\nAfghan\nAlbanian\nAlgerian\nan\nAndorran\nGhanaian\nGibraltarian\nGreenlander\nGreenlandic\nGrenadian\nnon-Hispanic\nnon-Indian\nnon-Russian\nNorth American\nNorth Korean\nthe Vatican\nVenezuelan\nVietnamese\nVincentian\nVirgin Islands\nSee more results »\nGrammar\nBritish and American EnglishMost of the differences between the English of the UK (which we shall call BrE) and the English of North America (which we shall call AmE) are vocabulary differences and differences in pronunciation and spelling. However, there are some differences in the way grammar is used. Almost all of the structures in this book are used in both varieties, but there are often differences in how common a structure is in one variety or the other. There are fewer differences in writing than in speaking. …\nBritish and American English: verbsAmE speakers often use be going to (and the informal short form gonna) when giving street directions, which is not a typical use in BrE. BrE speakers normally use imperatives (with and without you), and present simple or future forms with will: …\nBritish and American English: verb tense formsThe present perfect is less common in AmE than BrE. AmE speakers often use the past simple in situations where BrE speakers use the present perfect, especially with words such as already and yet: …\nBritish and American English: prepositionsBrE prefers at the weekend; AmE prefers on the weekend: …\nAdjectives and adverbsIn informal spoken AmE, speakers often use real instead of really before an adjective. This is considered non-standard by many AmE speakers: …\nTagsQuestion tags are much more common in BrE than in AmE, but a wide range of question tags are used in both varieties: …\nBritish and American English SpellingHere are some common differences between British and American English spelling. A good learner’s dictionary will give information about other spelling differences: …\nsomeone from the United States of America: He said he was proud to be an American.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: nationalities\nAfghan\nAlbanian\nAlgerian\nan\nAndorran\nGhanaian\nGibraltarian\nGreenlander\nGreenlandic\nGrenadian\nnon-Hispanic\nnon-Indian\nnon-Russian\nNorth American\nNorth Korean\nthe Vatican\nVenezuelan\nVietnamese\nVincentian\nVirgin Islands\nSee more results »\nAdd to word list\nAdd to word list\n(a person) of or coming from the United States, or of or coming from North America or South America"}