{"id":10392,"name":"amicable","type":"adjective","us_sound":"ˈæm.ɪ.kə.bəl","us_link":"../audio/a/amicable.mp3","uk_sound":"ˈæm.ɪ.kə.bəl","uk_link":"../audio/a/ukamiab003.mp3","content":"Add to word list\nAdd to word list\nrelating to behaviour between people that is pleasant and friendly, often despite a difficult situation: His manner was perfectly amicable, but I felt uncomfortable.\nThesaurus: synonyms, antonyms, and examples\nmaking you feel happy and comfortablefriendlyThe pub has such a friendly atmosphere.congenialThere are many congenial places to stop on your way through the Lake District.convivialThese seaside inns have a convivial atmosphere.warmThe hostess gave us a warm welcome.\nSee more results »\nrelating to an agreement or decision that is achieved without people arguing or being unpleasant: Few people have amicable divorces. Eventually we reached an amicable settlement.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconvivial\nconviviality\nconvivially\ncordial\ncordiality\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nRelated word\namicably\nAdd to word list\nAdd to word list\nfriendly in attitude, or (of decisions or agreements) achieved with friendly attitudes and without unpleasant argument: Wagner predicted the whole issue would be resolved in an amicable manner. amicably adverb us\nYour browser doesn't support HTML5 audio\n/ˈæm·ɪ·kə·bli/\nThey stayed together almost a year and parted amicably.\nAdd to word list\nAdd to word list\npleasant and friendly, often despite a difficult situation: His manner was perfectly amicable but I felt uncomfortable. an amicable debate\nan amicable agreement is achieved without arguments or anger: an amicable agreement/settlement/solution Eventually we reached an amicable settlement. amicably adverb\nI hope we can settle this amicably."}