{"id":10903,"name":"among","type":"preposition","us_sound":"əˈmʌŋ","us_link":"../audio/a/among.mp3","uk_sound":"əˈmʌŋ","uk_link":"../audio/a/ukamiab023.mp3","content":"Add to word list\nAdd to word list\nB1 in the middle of or surrounded by other things: I saw a few familiar faces among the crowd. Rescue teams searched among the wreckage for survivors.\nA2 happening or being included as part of a group of people or things: a decision that has caused a lot of anger among women Relax, you're amongst friends. Talk about it among yourselves (= talk to each other about it without me) for a while. She has worked as an estate agent among other things (= as well as other things).\nC1 to each one in a group of three or more people or things: He divided the country among his sons. The cost should be shared equally among the three of you.\nMore examplesFewer examplesYou don't have to pretend anymore - you're among friends now.There's a lot of teasing and fighting among the crew.The boy looked uncomfortable and out of place among the adults.These diseases are more common among young children.A small animal was making rustling noises among the leaves.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\nbetween\nbetwixt\nblock\nhalfway\nhalfway mark\nin between phrase\ninter\ninterleave\ninterlinear\nintermediate\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing, being or existing together\nGrammar\nAmong and amongstAmong and amongst are prepositions. …\nBetween or among?Between and among are prepositions. …\nBetween, among: meaning and useWe use between to refer to two things which are clearly separated. We use among to talk about things which are not clearly separated because they are part of a group or crowd or mass of objects: …\nBetween and prepositional phrasesBetween is most often used to introduce a prepositional phrase which contains two singular or plural noun phrases: …\nNouns and verbs followed by betweenThe most common nouns often followed by between are: connection, difference, distinction, link, relationship: …\nAmong meaning ‘surrounding, part of or included in’We use among to suggest a sense of being a part of or surrounded by or included in something else. It is typically followed by a plural noun phrase: …\nAmong others and among other thingsIn the phrases among others and among other things, among means ‘as well as’: …\nAdd to word list\nAdd to word list\nin the middle of or surrounded by: She felt lonely among all these strange people.\nAmong also means as part of a group or in the group of people or things named: They discussed it among themselves. Among the problems we have to deal with, improving education is probably the most difficult."}