{"id":10966,"name":"amortize","type":"verb","us_sound":"ˈæm.ɔːr.taɪz","us_link":"../audio/a/cdo0123usamor0043.mp3","uk_sound":"əˈmɔː.taɪz","uk_link":"../audio/a/ukamort003.mp3","content":"Add to word list\nAdd to word list\nto reduce a debt or cost by paying small regular amounts: They pay monthly loan payments based on a formula that amortizes the debt over 15 years, at 8 percent interest. The economics of a show depend on the number of weeks over which the producer can amortize the start-up costs.\nto take a cost, for example the cost of something bought for a business, away from the amount of tax that is paid, in small amounts over a period of time: The value of the machinery is amortized over its estimated useful life.\nMore examplesFewer examplesEconomics dictate that schedule because it enables clinics to treat patients in shifts to amortize the cost of the equipment, he said. I know how to make a profit, and I know how to amortize the debt.That cost, he said, could be amortized over the life of the revenue stream.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\ncredit limit\nforeclose\nhole\nliquidate\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaxation\nRelated words\namortizable\namortization\nAdd to word list\nAdd to word list\nACCOUNTING, TAX to spread the value or cost of an asset in accounts over a number of years: amortize sth over sth Companies use depreciation to amortize fixed assets over their usable life. The value of the machinery is amortized over its estimated useful life. Compare\ndepreciate\nto reduce a debt by paying small regular amounts: When asked what tolls would be required to amortize the payments under the contracts, he said the figures were astronomical. amortization noun [ U ] ( UK also amortisation) uk/əˌmɔːtɪˈzeɪʃən/ us/æmˌɔːrṱə-/\nCosts before depreciation and amortisation jumped 45% in a single year."}