{"id":10979,"name":"amount","type":"noun","us_sound":"əˈmaʊnt","us_link":"../audio/a/amount.mp3","uk_sound":"əˈmaʊnt","uk_link":"../audio/a/ukamort005.mp3","content":"Add to word list\nAdd to word list\nB1 a collection or mass, especially of something that cannot be counted: amount of They didn't deliver the right amount of sand. Small amounts of land were used for keeping animals. He paid regular amounts of money to a charity. The new tax caused a huge amount of public anger. I had a certain amount of (= some) difficulty finding the house. I didn't expect the bill to come to this amount (= of money). You wouldn't believe the amount of trouble (= what a lot of trouble) I've had with this car.\nMore examplesFewer examplesA dangerous amount of radioactivity was released into the environment last month.Some theatres receive a small amount of funding from the state.They were making a tremendous amount of noise last night.She eats an unbelievable amount of food.The total amount raised so far is approaching $1000.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-grained\n-sized\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquota\nration\nsmall-scale\nso much idiom\nstrength\nSee more results »\nGrammar\nAmount of, number of or quantity of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nAmount of or number of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nA quantity of or quantities of?Quantity is more formal than amount or number. A quantity of or quantities of can be followed by a countable noun or an uncountable noun. They are most commonly used with an adjective such as huge, big, large, small: …\nIdioms\nany amount of\nno amount of\nAdd to word list\nAdd to word list\nthe degree to which something is a lot or a little; how much something is: She’s made a tremendous amount of progress since the accident. He liked to carry a large amount of money around with him. Idiom\nnot amount to much\nAdd to word list\nAdd to word list\nMONEY a quantity of money: a large/small/considerable amount You can make a considerable amount for only a few hours' work.a certain/particular amount Payments are limited to a certain amount.pay/spend/raise an amount If everyone in the company contributed just $10, this would raise the amount needed. She was so disappointed with the service she refused to pay the full amount. I didn't expect the bill to come to this amount.\na quantity of something such as time, space, a substance, or a feeling: an amount of sth They didn't deliver the right amount of sand.large/small amounts Small amounts of land were used for keeping animals.a considerable/significant/huge amount The new tax caused a huge amount of anger among small business owners. Both solutions take about the same amount of time.\nany amount of sth\na very large amount of something: We had any amount of trouble finishing the job.\nSee also\nface amount"}