{"id":11763,"name":"analytic","type":"adjective","us_sound":"ˌæn.əˈlɪt̬.ɪk","us_link":"../audio/a/cdo0123usanal0046.mp3","uk_sound":"ˌæn.əlˈɪt.ɪk","uk_link":"../audio/a/cdo0123ukanal0053.mp3","content":"analytic adjective\n(DETAILED)\nAdd to word list\nAdd to word list\nmainly US examining or liking to examine things in detail, in order to discover more about them: New analytic techniques in biology are allowing scientists to study the cell in more detail. The analytic methods we developed for this project will be useful for our future work. Synonym\nanalytical\nMore examplesFewer examplesThe university is known for its analytic approach to the subject.She was regarded as a highly analytic expert in the field of marketing.The approach the team took was analytic, but other approaches are possible.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nanalytic adjective\n(LOGIC)\nformal relating to or using logic (= a formal scientific method of examining or thinking about ideas): This book is one of the masterpieces of analytic philosophy.\nformal (of a statement) true only because of the meanings of the words, without referring to facts or experience: Analytic truth is only regarded as true because it is independent of experience. All of their claims rely on empirical data and so are not purely analytic.\nMore examplesFewer examplesThis statement is analytic, because it is not judged by reference to facts in the real world.These arguments rely on a distinction between analytic and synthetic statements.\nSMART Vocabulary: related words and phrases\nLogic and reason\na fortiori\na posteriori\na priori\nantinomy\ncerebrally\nhypothetico-deductive\nillogical\nillogicality\nillogically\ninclusive disjunction\nnon sequitur\nnon-logical\nnon-rational\nnon-theoretical\nnon-verbal\ntautologically\nteleological\nteleology\ntheoretical\ntheoretically\nSee more results »\nanalytic adjective\n(LANGUAGE)\nlanguage\n&#160; specialized (of a language) showing grammar through word order rather than by changing the form of words: In analytic languages such as Mandarin, the relationships between words are shown solely by their order. English is more analytic than Spanish. Compare\nagglutinative\nsynthetic\nMore examplesFewer examplesSpeakers of analytic languages may find it difficult to process complex words in a highly synthetic language such as Finnish.This language has two types of verbs: synthetic and analytic.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\n-ative\naffix\naffixation\nagglutinate\nagglutinative\ncontraction\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\nmultisyllabic\nsuffix\nsynthetic\nthat'd\nthat'll\nthat's\nthere'd\nSee more results »"}