{"id":11815,"name":"analogue","type":"adjective","us_sound":"ˈæn.ə.lɑːɡ","us_link":"../audio/a/usanach005.mp3","uk_sound":"ˈæn.ə.lɒɡ","uk_link":"../audio/a/ukamusi021.mp3","content":"analogue adjective\n(RECORDED SIGNALS)\nAdd to word list\nAdd to word list\nAn analogue recording is one that is made by changing the sound waves into electrical signals of the same type. An analogue signal is a signal of this type: I started recording the sounds on analogue reel-to-reel tape. This is the standard method used to convert analogue signals to digital.\nAnalogue television is broadcast using analogue signals, rather than using digital signals: Grants can be given to people who still watch analogue broadcasts on old television sets to help them cover the cost of a digital converter.\nAn analogue camera or analogue photography records images on film, rather than in a form that can be looked at on a computer: Many manufacturers are discontinuing their lines of analogue cameras. If your camera is analogue, you'll need to install a video-capture device that will convert the analogue signal from your camera into digital code. Analogue photography appears to be back in fashion right now. Compare\ndigital\nMore examplesFewer examplesA vinyl record is analogue. A CD is digital, which means that the sound, which starts as analogue, has to be digitally coded.The album was recorded in Paris on analogue equipment.That year the vast majority of television being watched was still on analogue terrestrial channels.The 2,000 households in the area which are still watching analogue have less than four weeks to convert to digital.There's been a real transition from the old analogue security cameras.We are upgrading the existing CCTV cameras from analogue to digital.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nerase\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nAudio & video equipment\nPhotography\nanalogue adjective\n(CLOCK)\nAn analogue clock or watch shows the time using numbers around the edge and hands that point to the numbers: You can choose to have the time display as an analogue or digital clock. She still uses an old-fashioned analogue alarm clock. Opposite\ndigital\nMore examplesFewer examplesAn analogue watch user will just glance at the timepiece and say, \"It's about quarter to five.\" The children are asked to draw a picture of an analogue clock showing a particular time.\nSMART Vocabulary: related words and phrases\nWatches & clocks\n24-hour clock\nagainst the clock idiom\nalarm\nalarm clock\nat/on the stroke of something idiom\natomic clock\nclock\nhorologist\nhorology\nhour hand\nhourglass\njewel\nmilitary time\nstroke\ntick\nticking\ntimekeeper\ntimepiece\nturn the clocks back phrase\ntwenty-four-hour clock\nSee more results »\nsomething that is similar to or can be used instead of something else: He has been studying the European analogues of the British Parliament. An analogue to penguins, the extinct plotopterids, appeared in the North Pacific about 37 million years ago.\nMore examplesFewer examplesThis is the closest analogue we have on Earth to what might exist elsewhere in our solar system.Modern-day Olympic events, such as running, jumping, and discus-throwing, have classical analogues.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nAdd to word list\nAdd to word list\nIT, COMMUNICATIONS using a system in which information, such as sound or images, is stored or sent in a continuously changing form, such as electrical signals, radio waves, or film: analogue TV/radio/phone analogue system/signal/service Viewers would be forced to make the switch from analogue to digital.\nshowing information as a picture rather than using whole numbers: an analogue clock/watch Compare\ndigital"}