{"id":11752,"name":"analyse","type":"verb","us_sound":"ˈæn.əl.aɪz","us_link":"../audio/a/analyze.mp3","uk_sound":"ˈæn.əl.aɪz","uk_link":"../audio/a/ukamusi023.mp3","content":"Add to word list\nAdd to word list\nto study or examine something in detail in order to discover or understand more about it: Researchers analysed the purchases of 6,300 households. The book brilliantly analyses the cultural struggles taking place in America during the 1960s. We are trying to analyse what went wrong.\nB2 to examine a substance, especially by separating it into its parts, in order to discover what it is or contains: Water samples taken from streams were analysed for contamination by chemicals. The powder was sent to the lab to be analysed.\nto examine or treat someone using psychoanalysis (= an attempt to examine a person's unconscious mind to discover the hidden causes of their emotional or mental problems): In this scene we see a patient on the therapist's couch, being analysed. I read Freud and started to analyse my dreams. Synonym\npsychoanalyse Related word\nanalyst\nMore examplesFewer examplesThe data was analysed according to neighbourhoods, but other key variables like credit rating, job history, and marital status were ignored.This software is used to analyse marketing data.We analysed the stock performance of the 10 companies with the highest-paid CEOs over a 7-year period. The author carefully analyses the regime's strengths and failings.We enjoyed discussing the film, analysing the characters and their motives.Forensic scientists are analysing DNA and fingerprints found at the scene.Psychoanalytic training requires that the trainee should themselves be analysed.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyser\nanalyst\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry - general words\nScience of psychology & psychoanalysis\nAdd to word list\nAdd to word list\nto study or examine something in detail, in order to discover more about it: Researchers analysed the purchases of 6300 households.analyse data/results/information Management requires enthusiasm and intuition rather than merely an ability to analyze data and invent strategies.analyse a problem/issue We need to look at what went wrong, analyze the problem, and come up with a solution."}