{"id":11759,"name":"analyst","type":"noun","us_sound":"ˈæn.ə.lɪst","us_link":"../audio/a/analyst.mp3","uk_sound":"ˈæn.ə.lɪst","uk_link":"../audio/a/ukamusi026.mp3","content":"Add to word list\nAdd to word list\nB2 someone whose job is to study or examine something in detail, in order to discover or understand more about it and often to make predictions (= statements about what will happen in the future) relating to it : a financial/political/banking/industry analyst Some business analysts have warned of reduced profit margins. She is a market analyst with a major energy company. See also\nsystems analyst\ncryptanalyst\nsomeone who examines or treats people using psychoanalysis (= an attempt to examine a person's unconscious mind to discover the hidden causes of their emotional or mental problems): The only person I ever talked to about this was my analyst. He sees an analyst four times a week. Synonym\npsychoanalyst\nMore examplesFewer examplesMost financial analysts have been surprised by the persistence of the recession.She is a senior education policy analyst at a Washington think tank.Many analysts are predicting an upswing in the economy.Analysts failed to predict the sudden drop in house prices.A large number of analysts are pessimistic about the future of the economy.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCounselling & psychotherapy\nAdd to word list\nAdd to word list\na person whose job is to study or examine something in an organized way: She is a financial analyst (= someone who studies financial investments).\nAnalyst is also a short form of psychoanalyst.\nAdd to word list\nAdd to word list\nsomeone whose job is to study or examine something in detail: a financial/food/political analyst A large number of analysts are pessimistic about the future of the economy. See also\nbusiness analyst\ncomputer analyst\ncredit analyst\nfinancial analyst\ninvestment analyst\nmarket analyst\nsystems analyst\ntechnical analyst"}