{"id":11811,"name":"analogous","type":"adjective","us_sound":"əˈnæl.ə.ɡəs","us_link":"../audio/a/analogous.mp3","uk_sound":"əˈnæl.ə.ɡəs","uk_link":"../audio/a/ukamusi020.mp3","content":"Add to word list\nAdd to word list\nC2 having similar features to another thing and therefore able to be compared with it: analogous to The experience of a mystic trance is in a sense analogous to sleep or drunkenness. The emergency vehicle for the International Space Station is analogous to a lifeboat. See\nanalogy\nThesaurus: synonyms, antonyms, and examples\nlooking or being almost but not exactly the samesimilarI have a sofa quite similar to yours.likeShe's a lot like her mother.alikeThe girls look alike.closeMy cousin and I are quite close in age.something likeI was worried something like this would happen.\nSee more results »\nart, physics\n&#160; specialized (of colours) next to each other on the colour wheel (= a diagram showing colours in a circle so you can see the relationships between them) and therefore similar: Analagous colours are often found in nature, for example in the changing colours of autumn leaves progressing around the colour wheel. An analagous colour scheme is characterized by a lack of contrast, unlike a complementary colour scheme. Compare\ncomplementary\nnon-complementary\nMore examplesFewer examplesThe two TV programmes - set in different cities - are roughly analogous big-city police dramas.These are two analogous situations.San Francisco's Golden Gate Park is spectacular and not in any way analogous to New York's Central Park.The way a string vibrates is somewhat analogous to the way ripples spread out in water.Analogous colours are harmonious colours which sit side by side on the colours wheel — related colours such as yellow, yellow-orange, orange, orange-red, and red.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalently\nevenly\nevery inch idiom\nfamily\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of colour"}