{"id":11788,"name":"analog","type":"adjective","us_sound":"ˈæn.ə.lɑːɡ","us_link":"../audio/a/usanach005.mp3","uk_sound":"ˈæn.ə.lɒɡ","uk_link":"../audio/a/ukamusi021.mp3","content":"analog adjective\n(RECORDED SIGNALS)\nAdd to word list\nAdd to word list\nAn analog recording is one that is made by changing the sound waves into electrical signals of the same type. An analog signal is a signal of this type: We started talking about digital versus analog recording. The adapter converts the phone's analog signal into a digital one that can travel over the Internet.\nAnalog television is broadcast using analog signals, rather than using digital signals: The Federal Communications Commission started phasing out analog TV transmission in 2006. Customers on a budget might ignore the digital TV deadline and buy an analog set.\nAn analog camera or analog photography records images on film, rather than in a form that can be looked at on a computer: We used to take photographs with an analog camera, then drop the film off at the store to be developed. I am a photographer who adores analog photography. Compare\ndigital\nMore examplesFewer examplesRecording directly to analog tape gave the album a live, unpolished feel.The sound is reminiscent of analog recordings of yesteryear, with a less constricted or \"suffocated\" sound when compared with CDs or MP3 files. If you're getting a new camera, you should definitely consider buying digital rather than analog. The technology even works with old, analog cameras. It was decided that all TV signals should change from analog to digital because the digital images are clearer and faster.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nAV\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nerase\nmix\nmute\nplay something back\npostproduction\nproduction\nre-record\nresynthesis\nresynthesize\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nAudio & video equipment\nPhotography\nanalog adjective\n(CLOCK)\nAn analog clock or watch shows the time using numbers around the edge and hands that point to the numbers: Use standard analog clocks at home to help your child learn how to tell time. Opposite\ndigital\nMore examplesFewer examplesTwenty minutes on an analog clock is one-third of a pie.I told the saleswoman I wanted a normal watch, with hands. \"You mean an analog watch, \" she said crisply.\nSMART Vocabulary: related words and phrases\nWatches & clocks\n24-hour clock\nagainst the clock idiom\nalarm\nalarm clock\nat/on the stroke of something idiom\natomic clock\nclock\nhorology\nhour hand\nhourglass\nlose\nmilitary time\nminute hand\nmovement\nstroke\ntimepiece\nturn the clocks back phrase\ntwenty-four-hour clock\nunsynchronized\nwatchband\nSee more results »\nsomething that is similar to or can be used instead of something else: I'm a vegetarian but I don't like vegetarian sausage, fake bacon and other meat analogs. Memes are the analogs of genes.\nMore examplesFewer examplesThey discuss the long history of judicial enforcement of the Second Amendment and its state analogs.Several factors make animal studies very poor analogs to human health.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nAdd to word list\nAdd to word list\nrepresenting electronic information as a continuously varying signal: Analog broadcasts, the current technology, would continue side by side with digital."}