{"id":12149,"name":"ancestor","type":"noun","us_sound":"ˈæn.ses.tɚ","us_link":"../audio/a/ancestor.mp3","uk_sound":"ˈæn.ses.tər","uk_link":"../audio/a/ukanarc007.mp3","content":"Add to word list\nAdd to word list\nB2 a person related to you who lived a long time ago: There were portraits of his ancestors on the walls of the room. Compare\ndescendant\nThesaurus: synonyms, antonyms, and examples\nyour ancestorsancestorI discovered that one of my ancestors was a member of King Henry VIII's court.forebearMy forebears were enslaved and brought to this country.forefatherI visited the land of my forefathers.ancestryDNA tests tell me that I have Central Asian ancestry.extractionMy family is of Italian extraction.family treeSince many families will be gathering for the holiday, it's a perfect time to create a family tree.\nSee more results »\na plant, animal, or object that is related to one existing at a later point in time: This wooden instrument is the ancestor of the modern metal flute.\nMore examplesFewer examplesTwelve thousand years ago, our ancestors were primitive savages living in caves.Apparently his ancestors came over from France in the 11th century.She claims that Mary Queen of Scots is one of her distant ancestors.These bones come from an animal that is the ancestor of the modern horse.Archaeology can tell us a lot about how our Iron-Age ancestors lived.\nSMART Vocabulary: related words and phrases\nFamily: ancestors & descendants\nancestral\nancestry\nbe in the/someone's blood idiom\nblood\nblood is thicker than water idiom\nbloodline\nfamily tree\nforbear\nforebear\nforefather\nforemother\ngeneration\ngenerationally\nheraldic\nheraldically\nheraldry\nlineage\nrun in the family idiom\nsandwich generation\nsuccessor\nSee more results »\nRelated word\nancestral\nAdd to word list\nAdd to word list\nany member of your family from long ago, for example, the grandparents of your grandparents: He returned to Ecuador, where his mother’s ancestors lived. ancestral adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ænˈses·trəl/\nHe wanted to tour his family's ancestral homeland, Germany. ancestry noun [ C usually sing ] us\nYour browser doesn't support HTML5 audio\n/ˈænˌses·tri, -səs-/\nShe was of Spanish and Iroquois ancestry."}