{"id":12226,"name":"ancient","type":"adjective","us_sound":"ˈeɪn.ʃənt","us_link":"../audio/a/ancient.mp3","uk_sound":"ˈeɪn.ʃənt","uk_link":"../audio/a/ukanarc016.mp3","content":"Add to word list\nAdd to word list\nB1 of or from a long time ago, having lasted for a very long time: ancient civilizations/rights/laws ancient monuments/ruins/woodlands the ancient kingdoms of Mexico People have lived in this valley since ancient times. History, ancient and modern, has taught these people an intense distrust of their neighbours.\nThesaurus: synonyms, antonyms, and examples\ncoming from a time in the pastoldBe careful - that clock is very old.formerHe's a former coworker of mine.ancientWe need to protect ancient monuments.archaic\"Thee\" is an archaic word for \"you\".\nSee more results »\ninformal very old: He's got an ancient laptop.\nB1 used to refer to the period in European history from the earliest known societies to the end of the Roman Empire: the ancient Egyptians/Greeks/Romans The ancient Britons inhabited these parts of England before the Roman invasion.\nMore examplesFewer examplesThe ancient people of this area worshipped a huge bronze idol in the shape of an elephant.In ancient Rome, captured generals were paraded through the streets in chairs.As a consequence of expansionism by some European countries, many ancient cultures have suffered.Mr Graham was amazed to find 46 ancient gold coins inside the pot.The ancient skull of Peking Man has been pieced together from fragments.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nbe going strong idiom\nchangeless\ndateless\ndie hard idiom\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nincorruptibly\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nnondurable goods\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nunslaked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOld or old-fashioned\nAncient history: before 500 AD\nAdd to word list\nAdd to word list\nof or from a very long time ago: Archaeologists study the remains of ancient civilizations.\ninfml Something that is ancient is very old: This computer is ancient – I’ve got to get a new one."}