{"id":12290,"name":"and","type":"conjunction","us_sound":"ænd","us_link":"../audio/a/and.mp3","uk_sound":"ænd","uk_link":"../audio/a/ukanarc018.mp3","content":"and conjunction\n(ALSO)\nAdd to word list\nAdd to word list\nA1 used to join two words, phrases, parts of sentences, or related statements together: Ann and Jim boys and girls knives and forks We were wet and tired. We kissed and hugged each other. Tidy up your room. And don't forget to make your bed! and so on A2 (also and so forth)\ntogether with other similar things: schools, colleges, and so on\nSee more and all\nand everything else: She bought the whole lot - house, farm, horses, and all.\nUK slang too: I'd like some and all.\nSee more and all that informal\nand everything related to the subject mentioned: She likes grammar and all that.\nSee more and/or\nused to mean that either one of two things or both of them is possible: Many pupils have extra classes in the evenings and/or at weekends.\nSee more\nMore examplesFewer examplesThe Australians have won three gold medals and two silvers in the swimming events.It costs a lot to feed and clothe five children.Snakes and lizards are cold-blooded animals.Your shoes will be repaired and ready for you to collect on Thursday.I'm afraid those days are gone and they'll never come again.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nand conjunction\n(THEN)\nA1 used to join two parts of a sentence, one part happening after the other part: I got dressed and had my breakfast.\nas a result: Bring the flowers into a warm room and they'll soon open. Stand over there and you'll be able to see it better.\nA2 With certain verbs, \"and\" can mean \"in order to\": I asked him to go and find my glasses. Come and see me tomorrow. Wait and see (= wait in order to see) what happens.informal Try and get (= try to get) some tickets for tonight's performance.\nMore examplesFewer examplesTake your clothes off and get in the bath.I grabbed the dog by the collar and dragged it out of the room.He drew a heart and coloured it red.A young girl came up to me and asked for money.I found it hard to follow what the teacher was saying, and eventually I lost concentration.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: connecting words which introduce a cause or reason\nand conjunction\n(FOR EMPHASIS)\nB1 If \"and\" is used to join two words that are the same, it makes their meaning stronger: She spends hours and hours (= a very long time) on the phone. The sound grew louder and louder (= very loud). We laughed and laughed (= laughed a lot).\nMore examplesFewer examplesHe just got thinner and thinner.The weather seems to get worse and worse.We're having to wait longer and longer to see a doctor.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nand conjunction\n(BUT)\nused to express surprise: You're a vegetarian and you eat fish?\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nGrammar\nAndAnd is a coordinating conjunction. We use and to connect two words, phrases, clauses or prefixes together: …\nGo and, come andIn informal speaking we often use and after go and come before verbs like ask, buy, check, collect, do, find, get: …\nFixed expressions with andWe often use and in common fixed expressions. The order of the words cannot change: peace and quiet, pick and choose, come and go, knife and fork, black and white. …\nAnd + adjectiveIn informal speaking, when we want to emphasise something positive, we often use and after nice or lovely with another adjective: …\nAnd in numbersWhen we speak or write numbers, we use and to separate hundred, thousand, million from numbers smaller than a hundred: …\nAdding with andOne of the main uses of conjunctions is to add phrases and clauses together. The most common conjunction for adding is and: …\nand conjunction\n(ALSO)\nAdd to word list\nAdd to word list\n(used to join two words, phrases, or parts of sentences) in addition to; also: boys and girls We were tired and hungry.\nAnd can be used when you add numbers: Three and two are five.\nand conjunction\n(THEN)\n(used to join two parts of a sentence, one part happening after or because of the other part) after that; then: I met Jonathan, and we went out for a cup of coffee.\nand conjunction\n(TO)\ninfml (used after some verbs) to, or in order to: Let’s try and get tickets for the hockey game tonight.\nand conjunction\n(VERY)\n(used to join two words, esp. two that are the same, to make their meaning stronger): The sound grew louder and louder. Idiom\nand so on"}