{"id":12715,"name":"anger","type":"noun","us_sound":"ˈæŋ.ɡɚ","us_link":"../audio/a/anger.mp3","uk_sound":"ˈæŋ.ɡər","uk_link":"../audio/a/ukangel006.mp3","content":"Add to word list\nAdd to word list\nB2 a strong feeling that makes you want to hurt someone or be unpleasant because of something unfair or unkind that has happened: I think he feels a lot of anger towards his father, who treated him very badly as a child. There is a danger that anger at the new law may turn into anti-government feeling. The people showed no surprise or anger at their treatment. He found it hard to contain (= control) his anger. She stormed out of the room in anger.\nThesaurus: synonyms, antonyms, and examples\nangerangerHe vented his anger by kicking the door.annoyanceSmoke can cause annoyance by making clothes and hair smell unpleasant.irritationShe expressed irritation with her son's attitude.frustrationA lot of children's behaviour problems are caused by sheer frustration.furyThe speech provoked fury in some parts of the world.rageHe was filled with jealous rage when he saw his girlfriend talking to another man.\nSee more results »\nMore examplesFewer examplesHer cheeks were aflame with anger.We are demonstrating to show our anger and disgust at the treatment of refugees.His apology took the edge off her anger.The new tax caused a huge amount of public anger.Her comments provoked an outburst of anger from the boss.He erupted in anger whenever he was challenged.\nSMART Vocabulary: related words and phrases\nAnger and displeasure\nacrimony\nanimus\nannoyance\nbad feeling\nbenny\nflap\nget the hump idiom\ngorge\ngrit\ngrit your teeth idiom\ngrudge\nhard feelings idiom\nhave a face like thunder idiom\nirritation\nred mist\nreprehension\nresentfulness\nresentment\nroad rage\nslow burn\nSee more results »\nIdiom\nin anger\nto make someone angry: The remark angered him. It always angers me to see so much waste.\nThesaurus: synonyms, antonyms, and examples\nto make someone angryangerIt angers me that governments never do anything to eradicate the problem. infuriateIt infuriates me to hear of drug use in any sport. make your blood boilIt still makes my blood boil to think of all the time we wasted on thisannoyHe asked her to move more quickly, which annoyed her.irritateI'm the only one who talks to him, and that irritates me. frustrateIt really frustrates me that I can't do things for myself.\nSee more results »\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nannoy\nannoyance\nbend\ngo too far idiom\ngoat\ngrate\nhack someone off\nharass\njoke\nnark\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\nset someone's teeth on edge idiom\ntit\ntroll\nSee more results »\nAdd to word list\nAdd to word list\nthe feeling people get when something unfair, painful, or bad happens: You need to control your anger. He yelled at them in anger. anger verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈæŋ·ɡər/\nHis constant complaining only angered her."}