{"id":12663,"name":"angel","type":"noun","us_sound":"ˈeɪn.dʒəl","us_link":"../audio/a/angel.mp3","uk_sound":"ˈeɪn.dʒəl","uk_link":"../audio/a/ukangel001.mp3","content":"Add to word list\nAdd to word list\nB1 a spiritual being in some religions who is believed to be a messenger of God, usually represented as having a human form with wings: According to the Bible, an angel told Mary that she would have God's son, Jesus.\nsomeone who is very good, helpful, or kind: Be an angel and help me with this.\nThesaurus: synonyms, antonyms, and examples\nwell behavedwell behavedOur kids are normally well behaved.goodBe a good girl and sit quietly.as good as goldThe babysitter said Arlo had been as good as gold.angelTeddy is a little angel.obedientHe always tried his best to be an obedient son.\nSee more results »\n[ as form of address ] used when speaking to someone you like very much and know very well: What's the matter, angel? Come along, my angels, time for bed.\n(also angel investor) a rich person who invests in a new company: Wealthy individual investors, known as angels, differ from lenders in that they want a stake in your business.\nMore examplesFewer examplesShe sings like an angel!She has the face of an angel.The central twelve-foot column is surmounted by a bronze angel with outspread wings.She had visions in which the angel Gabriel appeared to her.The angels in the painting have beatific smiles.\nSMART Vocabulary: related words and phrases\nReligious concepts: angels\narchangel\ncherub\nheavenly host\nseraph\nthe Prince of Darkness\nYou can also find related words, phrases, and synonyms in the topics:\nPeople having good qualities\nAffectionate terms of address\nIdioms\nbe no angel\nbe on the side of the angels\nAdd to word list\nAdd to word list\nin some religious traditions, a being in heaven who serves God, often represented in art as a human with wings\nAn angel is also someone who is very good or kind: You’re an angel to bring me this coffee.\nAdd to word list\nAdd to word list\nFINANCE →\nangel investor"}