{"id":13158,"name":"animal","type":"noun","us_sound":"ˈæn.ɪ.məl","us_link":"../audio/a/animal.mp3","uk_sound":"ˈæn.ɪ.məl","uk_link":"../audio/a/ukangel030.mp3","content":"animal noun [C]\n(CREATURE)\nAdd to word list\nAdd to word list\nA1 something that lives and moves but is not a human, bird, fish, or insect: wild/domestic animals Both children are real animal lovers. Surveys show that animal welfare has recently become a major concern for many schoolchildren.\nB2 anything that lives and moves, including people, birds, etc.: Humans, insects, reptiles, birds, and mammals are all animals.\nMore examplesFewer examplesThe panda is becoming an increasingly rare animal.The farmer was accused of cruelty to animals.Some animals hunt at night.These remote islands are inhabited only by birds and small animals.Personally , I don't think animals should be killed for their fur.\nSMART Vocabulary: related words and phrases\nPlants & animals - general words\nanimal kingdom\nanti-parasitic\nautotroph\nbiota\nbiped\nfamily\nfauna\nflora\nflora and fauna\ngreenery\nnatively\nnon-mammalian\nnon-placental\nomnivore\nomnivorous\nscavenger\nsecondary consumer\nsongster\nterrestrially\nundomesticated\nSee more results »\nanimal noun [C]\n(BAD PERSON)\ninformal an unpleasant, cruel person or someone who behaves badly: He's a real animal when he's had too much to drink.\nanimal noun [C]\n(TYPE)\nused to describe what type of person or thing someone or something is: At heart she is a political animal. She is that rare animal (= she is very unusual), a brilliant scientist who can communicate her ideas to ordinary people. Feminism in France and England are rather different animals (= are different).\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nform\nhue\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nanimal adjective\n(FROM ANIMALS)\nmade or obtained from an animal or animals: animal products animal fat/skins\nrelating to, or taking the form of, an animal or animals rather than a plant or human being: The island was devoid of all animal life (= there were no animals on the island).\nSMART Vocabulary: related words and phrases\nPlants & animals - general words\nanimal kingdom\nanti-parasitic\nautotroph\nbiota\nbiped\nfamily\nfauna\nflora\nflora and fauna\ngreenery\nnatively\nnon-mammalian\nnon-placental\nomnivore\nomnivorous\nscavenger\nsecondary consumer\nsongster\nterrestrially\nundomesticated\nSee more results »\nanimal adjective\n(PHYSICAL)\n[ before noun ] relating to physical desires or needs, and not spiritual or mental ones: As an actor, he has a sort of animal magnetism. She knew that Dave wasn't the right man for her but she couldn't deny the animal attraction between them.\nSMART Vocabulary: related words and phrases\nThe body\n-bodied\naxial\nbiodynamics\nbiomechanics\nbod\nbodily\nbody\nbuild\ncorporal\ncorporeal\ncorporeality\nendomorph\nfigure\nflesh\nframe\nhyperphysical\ninternally\nmesomorph\nmind-body\nphysical\nSee more results »\nanimal noun [C]\n(LIVING THING)\nAdd to word list\nAdd to word list\na living thing that can move and eat and react to the world through its senses, esp. of sight and hearing: Mammals, insects, reptiles, and birds are all animals.\nIn ordinary use, animal means all living beings except humans: A lion is a wild animal, and a dog is a domestic animal. Tests of the drug were done on laboratory animals.\nAn animal is also a person who likes something or does something more than most people do: a party animal He’s the most political animal on the city council.\nanimal noun [C]\n(GROUP)\n[ U ]\n&#160; biology us\nYour browser doesn't support HTML5 audio\n/ˈæn·ə·məl/ one of five kingdoms (= groups) into which living things are divided, the members of which have many cells, have the ability to control their own movement, and get their energy from eating rather than from the light of the sun\nanimal adjective [not gradable]\n(PHYSICAL)\nrelating to physical needs or desires, such as to eat or reproduce: Animal instincts apply to all animals, including humans."}