{"id":13572,"name":"annoyance","type":"noun","us_sound":"əˈnɔɪ.əns","us_link":"../audio/a/annoyance.mp3","uk_sound":"əˈnɔɪ.əns","uk_link":"../audio/a/ukannou003.mp3","content":"Add to word list\nAdd to word list\nC1 [ U ] the feeling or state of being annoyed: I can understand your annoyance - I'd be furious if she ever treated me like that. (Much) to our annoyance, (= we were very annoyed that) we couldn't see anything from the back row of the theatre.\nThesaurus: synonyms, antonyms, and examples\nangerangerHe vented his anger by kicking the door.annoyanceSmoke can cause annoyance by making clothes and hair smell unpleasant.irritationShe expressed irritation with her son's attitude.frustrationA lot of children's behaviour problems are caused by sheer frustration.furyThe speech provoked fury in some parts of the world.rageHe was filled with jealous rage when he saw his girlfriend talking to another man.\nSee more results »\n[ C ] something that makes you annoyed: One of the greatest annoyances was being bitten by mosquitoes every night. Synonyms\nbore (ANNOYING) informal\nbother (ANNOYING) UK\ninconvenience\nirritant (MAKING ANGRY)\nnuisance\na pain (in the neck) informal\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that annoys youannoyanceThe café was cash only, which was a minor annoyance as I only had my credit card with me. nuisanceIt's a nuisance to have to drive to the nearest shop.inconvenienceThank you for holding - we apologize for the inconvenience.irritationThe CEO's poor communication skills became a source of irritation to the company's investors.irritantThe noise of the building work is a constant irritant.boreIt's such a bore to have to pack everything up again.\nSee more results »\nMore examplesFewer examplesShe couldn't suppress her annoyance when the food was returned to the kitchen uneaten.There's clearly some annoyance among the workforce at the way the changes were introduced.My aunt snorted in annoyance and marched off to find the manager.Then, to our great annoyance, the train stopped outside the station for ten minutes.A group of youths have been causing annoyance in the neighbourhood.\nSMART Vocabulary: related words and phrases\nAnger and displeasure\nacrimony\nanger\nanimus\nbad feeling\nbenny\nflap\nget the hump idiom\ngorge\ngrit\ngrit your teeth idiom\ngrudge\nhard feelings idiom\nhave a face like thunder idiom\nirritation\nred mist\nreprehension\nresentfulness\nresentment\nroad rage\nslow burn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing feelings of anger and displeasure"}