{"id":13571,"name":"annoy","type":"verb","us_sound":"əˈnɔɪ","us_link":"../audio/a/annoy.mp3","uk_sound":"əˈnɔɪ","uk_link":"../audio/a/ukannou002.mp3","content":"Add to word list\nAdd to word list\nB1 to make someone angry: Tina really annoyed me in the meeting this morning. I'm sorry - is my cough annoying you? [ + that ] It annoys me that she just expects us to help. It really annoys me when people expect me to tip as well as pay a service charge in a restaurant. Synonyms\nbother\nirritate\nnark (ANNOY) UK slang old-fashioned\nnettle mainly UK\nrile informal\nvex old-fashioned\nThesaurus: synonyms, antonyms, and examples\nto annoy someoneannoyIt annoys me that you're always late.botherIt bothers me that you don't help with the washing up.irritateAfter a while her behaviour really began to irritate me.peeveWhat peeved her most was that he hadn't even called her.bugHe's been bugging me all morning.aggravateIt really aggravates me the way he never thanks me for what I've done.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto make someone angryangerIt angers me that governments never do anything to eradicate the problem. infuriateIt infuriates me to hear of drug use in any sport. make your blood boilIt still makes my blood boil to think of all the time we wasted on thisannoyHe asked her to move more quickly, which annoyed her.irritateI'm the only one who talks to him, and that irritates me. frustrateIt really frustrates me that I can't do things for myself.\nSee more results »\nMore examplesFewer examplesI'm sure he says these things deliberately to annoy you.It really annoys me when people push in front of me like that.They were afraid to complain about the noise in case they annoyed the neighbours.The film portrayed the artist as a complete drunk, which has annoyed a lot of people.After a while her coughing really began to annoy me.\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoyance\nbend\ngo too far idiom\ngoat\ngrate\nhack someone off\nharass\njoke\nnark\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\nset someone's teeth on edge idiom\ntit\ntroll\nSee more results »\nAdd to word list\nAdd to word list\nto make someone slightly angry or upset: I know you’re doing this only to annoy me. annoyance noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˈnɔɪ·əns/\n[ U ] As soon as he saw me, a look of annoyance crossed his face. annoyed adjective us\nYour browser doesn't support HTML5 audio\n/əˈnɔɪd/\nHe gave me an annoyed look and left without speaking. annoying adjective us\nYour browser doesn't support HTML5 audio\n/əˈnɔɪ·ɪŋ/\nIt’s annoying to have to explain this a second time. annoyingly adverb us\nYour browser doesn't support HTML5 audio\n/əˈnɔɪ·ɪŋ·li/\nAds annoyingly interrupted the TV movie."}