{"id":13593,"name":"annotate","type":"verb","us_sound":"ˈæn.ə.teɪt","us_link":"../audio/a/usanglo017.mp3","uk_sound":"ˈæn.ə.teɪt","uk_link":"../audio/a/ukanima027.mp3","content":"Add to word list\nAdd to word list\n[ often passive ] to add a short explanation or opinion to a text or image: Annotated editions of Shakespeare's plays help readers to understand old words. an annotated bibliography/manuscript/edition His great-granddaughter has painstakingly transcribed and annotated his wartime diaries. The students annotate their photos, saying why they are relevant.\ncomputing, language\n&#160; specialized to add a description or piece of information to data, for example a label saying whether a word is a noun, a verb, etc.: After the corpus was collected we annotated it. Textual or numerical data can be copied into databases, annotated, and linked to other data.\nMore examplesFewer examplesThe book's annotated bibliography fills 45 pages.You are allowed to bring annotated copies of the novel you have been studying into the exam.Any attached documentation should be annotated with explanatory notes for clarification.Students arrive at the lecture equipped with printed notes: all they have to do is to annotate these printouts.He annotates and indexes a page in his notebook.Typically I use this program to annotate a document with my own structured content.Annotated data has facilitated recent advances in part of speech tagging, parsing, and other language processing issues.\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotation\nannotator\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nlast word\nline\nmalediction\nmention\nmot juste\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nComputer concepts\nDefining & explaining\nRelated words\nannotation\nannotator\nAdd to word list\nAdd to word list\nwriting to add notes or remarks on a piece of writing annotated bibliography\nAn annotated bibliography is a list of books or articles with notes giving additional information about each item."}