{"id":13735,"name":"anointment","type":"noun","us_sound":"əˈnɔɪnt.mənt","us_link":"../audio/a/usanglo026.mp3","uk_sound":"əˈnɔɪnt.mənt","uk_link":"../audio/a/ukannou020.mp3","content":"anointment noun [C or U]\n(CEREMONY)\nAdd to word list\nAdd to word list\na religious ceremony of putting holy water or oil on someone to make the person holy: Anointment is an ancient tradition. Sailors lined up for a blessing and anointment by a Navy chaplain. See\nanoint\nthe act of making someone king or queen, especially as part of a religious ceremony: The ceremony is a reference to the anointment of the ancient kings as a symbol of their authority. The film of the Queen’s coronation doesn’t include her anointment. See\nanoint\nMore examplesFewer examplesAnointment with water, salt, and spirits was part of the naming ceremony.An anointment with holy oil took place.Coronation was a religious rite which began with the anointment of the ruler with holy oil.\nSMART Vocabulary: related words and phrases\nReligious ceremonies & prayers\nalleluia\namen\nanoint\nanointed\nbaptism\nconfirm\nconfirmation\nconsecrate\nconsecration\ndedicate\nliturgical\nliturgically\nliturgy\nordain\nthe Lord's Prayer\nthe Lord's Supper\nunchristened\nunction\nunprogrammed\nvespers\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious practices\nanointment noun [C or U]\n(JOB)\nthe choice of someone to do a job, usually by a person in authority: No one was surprised by his anointment as chief executive. Her anointment as a chair of the committee was unexpected.\nMore examplesFewer examplesHis expected anointment as the presidential nominee will take place during the convention.The job will be his, and anointment is expected next week.The succession was planned in advance and her anointment was not a surprise.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nascend\nascension\ncareer-limiting\ndemote\nelevation\nfast track\nfree transfer\nglass cliff\nhand off\nhandoff\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nsticky floor\nsubordinate\nvault\nwilderness\nSee more results »"}