{"id":13904,"name":"another","type":"determiner","us_sound":"əˈnʌð.ɚ","us_link":"../audio/a/another.mp3","uk_sound":"əˈnʌð.ər","uk_link":"../audio/a/ukanore004.mp3","content":"another determiner, pronoun\n(ADDITIONAL)\nAdd to word list\nAdd to word list\nA2 one more person or thing or an extra amount: I'm going to have another piece of cake. \"Would you get me a bar of chocolate from the kitchen?\" \"Another one?\" We can fit another person in my car. Danny's had yet another car accident. For another £30 (= for £30 more) you can buy the model with a touchscreen. Just think, in another three months (= three months from now) it'll be summer again. one... after another\na lot of things, one after the other: I'm not surprised he's feeling ill - he was eating one ice cream after another!\nSee more\nMore examplesFewer examplesWould you like another cup of tea?I don't think another desk will fit into this classroom.This wall needs another coat of paint.We can't afford another trip abroad this year.My passport is valid for another two years.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\netc.\nexcess\nfiller\nfor good measure idiom\nfor luck idiom\nhand\nrate\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nthrow something in\nSee more results »\nanother determiner, pronoun\n(DIFFERENT)\nA2 a different person or thing: She's finished with that boyfriend and found herself another (one). Do you want to exchange this toaster for another (one) or do you want your money back? one another\nB1 each other: They gave one another presents when they met at the airport.\nSee more one way or another\nin some way that is not known yet: We'll get out of this mess one way or another.\nSee more\nMore examplesFewer examplesWould you mind waiting? I'm tending to another customer at the moment.She's worried that she might not be able to find another job.Apparently she's gone off to live with another man.This pen's scratchy. Have you got another one?I'm going move my account to another bank.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanything\nanything like idiom\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nGrammar\nOrOr is a conjunction that connects two or more possibilities or alternatives. It connects words, phrases and clauses which are the same grammatical type: …\nOther, others, the other or another?Other means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nOtherOther means ‘additional or extra’, or ‘alternative’, or ‘different types of’. …\nThe otherThe other with a singular noun means the second of two things or people, or the opposite of a set of two: …\nEach other, one anotherWe use each other and one another to show that each person in a group of two or more people does something to the others. There is very little difference between each other and one another and we can normally use them in the same places. Each other is more common than one another: …\nIdioms\nbe another matter/thing\nbe another story\nanother adjective, pronoun\n(ADDITIONAL)\nAdd to word list\nAdd to word list\none more (person or thing) or an additional (amount): We have two tickets and need another (one). Summer will be here in another three months (= three months in the future). We have room in the car for another if we all sit close together.\nanother adjective, pronoun\n(DIFFERENT)\na different (person or thing): Do you want to exchange this dress for another (one), or do you want your money back? It’s raining today, so we’ll have to have the picnic another day."}