{"id":13967,"name":"answer","type":"noun","us_sound":"ˈæn.sɚ","us_link":"../audio/a/answer.mp3","uk_sound":"ˈɑːn.sər","uk_link":"../audio/a/ukanore006.mp3","content":"answer noun [C]\n(REACTION)\nAdd to word list\nAdd to word list\nA1 a reaction to a question, letter, phone call, etc.: in answer to In answer to your letter of 30 May, I am writing to accept your offer of £3,575 in compensation. The minister promised to give a written answer to the MP's detailed question. We've emailed him asking him if he's free on that date but we haven't had an answer yet. I've just called him but there was no answer. I didn't realize we had to write each answer on a new sheet of paper. I got eight correct answers and two wrong ones in last week's exam.\nThesaurus: synonyms, antonyms, and examples\nan answeranswerWe're still waiting for an answer.reply \"How far?\" asked Nigel. \"Not far,\" was the mumbled reply.answer105 is the correct answer.responseThank you for your swift response.reactionWhat was her reaction when she was asked for her resignation?retortAlan snapped back with a witty retort.\nSee more results »\nMore examplesFewer examplesWe need a definite answer by tomorrow.Can you figure out the answer to question 5?I'd like you to give me an honest answer.I'll think it over and give you an answer next week.The public has a right to expect truthful answers from politicians.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensively\nfield\ninterview\nnon-responder\nnon-response\nnon-responsive\nrejoin\nrespondent\nresponse\nRSVP\nthank you\nwhataboutism\nSee more results »\nanswer noun [C]\n(SOLUTION)\nB1 a solution to a problem: It's a difficult situation and I don't know what the answer is. There's no easy answer to the problem.\nThesaurus: synonyms, antonyms, and examples\nan answeranswerWe're still waiting for an answer.reply \"How far?\" asked Nigel. \"Not far,\" was the mumbled reply.answer105 is the correct answer.responseThank you for your swift response.reactionWhat was her reaction when she was asked for her resignation?retortAlan snapped back with a witty retort.\nSee more results »\nMore examplesFewer examplesI spent hours doing that calculation and I still got the answer wrong.Surely the answer's obvious - or are you being deliberately obtuse?You got 20 percent of the answers right - that means one in every five.You'll never guess the answer - do you give in?His nimble mind calculated the answer before I could key the numbers into my computer.\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfix\nholding operation\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill\nresolution\nsolvable\nsolve\nsurmountable\ntalk something out\nunsolvable\nSee more results »\nIdiom\nsomeone's answer to someone/something\nanswer verb\n(REACT)\nA1 [ I or T ] to say, write, or do something as a reaction to a question, letter, etc.: answer a question You still haven't answered my question: why do you need to borrow my car? I can't answer (you) without more detailed information. I texted asking whether he'd be coming to the party but he hasn't answered yet. [ + speech ] \"I'd love to have dinner with you, but I won't be able to get there before nine o'clock,\" she answered. [ + that ] She answered that she wouldn't be able to come before nine o'clock.\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nanswer to the name (of)\nformal to be called: Does anyone here answer to the name of Wallis?\nSee more\nA2 [ I or T ] to open the door to someone or pick up the phone: Someone's at the door - would you answer it, please? I phoned last night but nobody answered.\nMore examplesFewer examplesI went downstairs to answer the phone.Candidates must answer two questions from each paper.Students are advised to answer all questions as fully as possible.When no one answered the door, she peered through the window to see if anyone was there.She spent the morning reading and answering her mail.\nSMART Vocabulary: related words and phrases\nAnswering & responding\nacknowledgment\naffirmative\naffirmatively\nclap back\nclapback\ncounter\ncounterattack\ncrickets idiom\ndefensively\nfield\ninterview\nnon-responder\nnon-response\nnon-responsive\nrejoin\nrespondent\nresponse\nRSVP\nthank you\nwhataboutism\nSee more results »\nanswer verb\n(BE SUITABLE FOR)\n[ T ] to be suitable for and satisfy someone's needs: He showed me some software that answered my requirements exactly. I've got some furniture in the attic that I think might answer your needs.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ncompatibly\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nfit\nlevel\nmisdirection\norder\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nSee more results »\nanswer verb\n(MATCH)\n[ I or T ] (also answer to) to match a description: A woman who answers to the suspect's description was seen in the area on the night of the crime.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\nequalization\neven (something) out\nfavour\nflatlining\nhomologous\nhomologous series\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\nPhrasal verbs\nanswer (someone) back\nanswer back\nanswer for something\nanswer for someone/something\nanswer to someone\nanswer noun [C]\n(REACTION)\nAdd to word list\nAdd to word list\nsomething said or written in reaction to a question or statement: If you are asking me if I want to go into business with you, the answer is no. I called several times, but there was no answer.\nAn answer is also a reaction to a question asked as part of a test: I think I got most of the answers right on the exam.\nanswer noun [C]\n(SOLUTION)\na solution to a problem: There is no easy answer to the problem."}