{"id":14270,"name":"anterograde","type":"adjective","us_sound":"ˈæn.tə.roʊ.ɡreɪd","us_link":"../audio/a/cdo1121usante0148.mp3","uk_sound":"ˈæn.tə.rəʊ.ɡreɪd","uk_link":"../audio/a/cdo1121ukante0127.mp3","content":"Add to word list\nAdd to word list\nmedical, biology\n&#160; specialized (also antegrade) used to describe a forward movement, for example the normal flow of blood in the body, or a movement of nerve signals away from the body of the cell to the synapse (= the point at which the signal moves to another cell): The right transverse sinus showed slow anterograde flow. In neuroscience, anterograde tracing is used to trace neural connections from their source (the cell body) to their point of termination (the synapse).\nmedical\n&#160; specialized used to describe the fact that someone is unable to remember things that happen after a particular event: There is evidence to show that ECT can cause both retrograde (i.e. before treatment) and anterograde (i.e. after treatment) memory loss. See also\nanterograde amnesia\nMore examplesFewer examplesWe randomized the subjects into two groups. Group one underwent anterograde isolated left lung perfusion.The study used biocytin as an anterograde tracer. Specific pathways may target the trophic or pathogenic cargo for transcytosis after either retrograde or anterograde transport along axons.Retrograde amnesia is what you often see portrayed in literature and film. A more common type is anterograde, where the patient is unable to remember events subsequent to the injury or ailment.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanti-platelet\nantigen test\nblood donor\nblood vessel\ncapillary\nerectile\nintravascular\nintravenously\njugular\njugular vein\nleucocyte\nplatelet\nvasoconstriction\nvasodilation\nVEGF\nveined\nvena\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe brain & nervous system\nForgetting and forgetfulness\nDisorders of muscles & the nervous system"}