{"id":15037,"name":"anticonvulsant","type":"noun","us_sound":"æn.taɪ.kənˈvʌl.sənt","us_link":"../audio/a/cdo0123usanti0064.mp3","uk_sound":"ˌæn.ti.kənˈvʌl.sənt","uk_link":"../audio/a/cdo0123ukanti0101.mp3","content":"Add to word list\nAdd to word list\na substance that prevents or improves a medical condition in which someone's body shakes violently with sudden uncontrolled movements: Anticonvulsants are used in the treatment of epilepsy. She believes she should have been told to come off the anti-convulsant before pregnancy.\nMore examplesFewer examplesThe drug is an anti-convulsant normally given to people with epilepsy.Antidepressants and anticonvulsants can be administered for some types of nerve pain.Patients differ greatly in their tolerance of the side-effects of anticonvulsants.\nSMART Vocabulary: related words and phrases\nSpecific types of drug\nalprazolam\namnesiac\namyl nitrite\nanaphrodisiac\nanti-AIDS\nanti-aphrodisiac\naphrodisiac\nbarbiturate\ncaffeine\ndesigner drug\ngas and air\nGHB\nkhat\nlegal high\nLSD\nMDMA\npopper\npsychedelic\nroach\nsmack\nSee more results »\nwith the effect of preventing or improving a medical condition in which someone's body shakes violently with sudden uncontrolled movements: Anticonvulsant medication may need to be adjusted if seizures increase. The anticonvulsant action of B12 allows it to reduce or prevent seizures in some patients. Many patients were put on anti-convulsant drugs.\nMore examplesFewer examplesHe underwent surgery twice and had been prescribed anti-convulsant medication.A person might take anticonvulsant drugs to stop seizures, or have surgery to remove a damaged portion of the brain.Most drugs in this class of substances are anticonvulsant.\nSMART Vocabulary: related words and phrases\nSpecific types of drug\nalprazolam\namnesiac\namyl nitrite\nanaphrodisiac\nanti-AIDS\nanti-aphrodisiac\naphrodisiac\nbarbiturate\ncaffeine\ndesigner drug\ngas and air\nGHB\nkhat\nlegal high\nLSD\nMDMA\npopper\npsychedelic\nroach\nsmack\nSee more results »"}