{"id":16013,"name":"antique","type":"noun","us_sound":"ænˈtiːk","us_link":"../audio/a/antique.mp3","uk_sound":"ænˈtiːk","uk_link":"../audio/a/ukantic025.mp3","content":"Add to word list\nAdd to word list\nB1 something made in an earlier period that is collected and considered to have value because it is beautiful, rare, old, or of high quality: You can't give away Granny's old bookcase - it's a valuable antique. My mother collects antiques.\nhumorous someone or something very old or old-fashioned: These kids make me feel like an antique. This is a recipe from my childhood, which I guess makes it an antique.\nMore examplesFewer examplesAn antique dealer had dated the vase at 1734.We thought the chair was an antique worth a lot of money, but it turned out to be a valueless replica.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistorical\nhistorically\nhistoricity\nhistory\nlegacy\nmodern\nnon-historical\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOld or old-fashioned\nB1 made in an earlier period and considered to have value because of being beautiful, rare, old, or of high quality: antique silver/jewellery/lace/furniture\nThesaurus: synonyms, antonyms, and examples\ncoming from a time in the pastoldBe careful - that clock is very old.formerHe's a former coworker of mine.ancientWe need to protect ancient monuments.archaic\"Thee\" is an archaic word for \"you\".\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ntypical of the past; not modernold-fashionedHe's very old-fashioned and thinks that women should not work outside the home.antiquatedThe school wants to update its antiquated computer system.datedThe hotel's decor is starting to look dated.outdatedMany hospitals struggle with outdated equipment and facilities.quaintThe area is full of quaint little villages.antiqueShe gave me an antique bedcover her great aunt made.\nSee more results »\ntrading or relating to antiques: an antique dealer antique shops/markets/fairs/auctions\noften humorous very old or old-fashioned: I just can't let go of the antique idea of reading actual books. This quaint love story seems almost absurdly antique now.\nMore examplesFewer examplesWe have an antique clock on our mantelpiece.We went to a sale of antique furniture and bought an oak chest.So when did you start collecting antique glass?The museum houses the biggest collection of antique toys in Europe.We thought these were valuable antique chairs, but they turned out to be replicas.Some of us still have a few antique notions stashed away in our heads.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistorical\nhistorically\nhistoricity\nhistory\nlegacy\nmodern\nnon-historical\nrevisionist\nthe Agrarian Revolution\ntime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOld or old-fashioned\nAdd to word list\nAdd to word list\nsomething made in an earlier period and valued because it is old, rare, or of high quality: He sold antiques for a while. antique adjective us\nYour browser doesn't support HTML5 audio\n/ænˈtik/\nan antique dealer/show"}