{"id":16331,"name":"antithetical","type":"adjective","us_sound":"ˌæn.t̬əˈθet̬.ɪ.kəl","us_link":"../audio/a/usanthr027.mp3","uk_sound":"ˌæn.tɪˈθet.ɪ.kəl","uk_link":"../audio/a/ukantis005.mp3","content":"Add to word list\nAdd to word list\nexactly the opposite of someone or something or of each other: The idea that science is antithetical to the arts is wrong. Birth and death are antithetical.\nThesaurus: synonyms, antonyms, and examples\ncompletely differentoppositeTheir two daughters may look alike, but they are completely opposite to one another. polar oppositesLove and hate are polar opposites.identicalHis opinions are identical to his spouse's.antitheticalHis actions were absolutely antithetical to our code of conduct.converseIf we ask what a citizen must sacrifice for the good of the nation, we must ask the converse question: what will the nation sacrifice for the good of its citizens?\nSee more results »\nvery different from and in opposition to someone or something or each other: In her view, elite sports are actually antithetical to healthy living. It's fascinating to wonder what connects these seemingly antithetical characters. They don't support the idea that religion and democracy are antithetical. See\nantithesis\nMore examplesFewer examples\"Torture is antithetical to everything this country stands for,\" he said.This down-to-earth, simple place is antithetical to the usual coffee shop experience.He claimed they were pursuing policies antithetical to the national interest.I do get offended when donors' money gets used to pursue policies antithetic to their morals.These are two antithetical world-views: the world of the believer and the world of the nonbeliever.The paragraph contains two antithetic ideas.It appears from this example that the two of them are antithetical and forever locked in combat.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantonymous\nanything\nanything but idiom\nconverse\ndiametric\ndiametrical\ndichotomist\ndichotomous\ndichotomy\nflip side\nopposite\nor otherwise idiom\notherwise\npolar\npolarity\npole\npoles apart idiom\nreverse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpposing & against"}