{"id":16562,"name":"anxiety","type":"noun","us_sound":"æŋˈzaɪ.ə.t̬i","us_link":"../audio/a/anxiety.mp3","uk_sound":"æŋˈzaɪ.ə.ti","uk_link":"../audio/a/ukantis011.mp3","content":"anxiety noun\n(WORRY)\nAdd to word list\nAdd to word list\nB2 [ U ] an uncomfortable feeling of nervousness or worry about something that is happening or might happen in the future: Children normally feel a lot of anxiety about their first day at school. That explains his anxiety over his health. Her son is a source of considerable anxiety.\n[ C ] something that causes a feeling of fear and worry: job anxieties\nMore examplesFewer examplesI regret any anxiety or concern that I may, unwittingly, have caused.Jack observed a look of anxiety on his brother's face.She felt acute anxiety at his behaviour.Women tend to internalize all their anxiety and distress - men hit out.Years of anxiety have lined her brow with deep furrows.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nalarm\nangst\nanti-stress\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nanxiety noun\n(EAGERNESS)\n[ U + to infinitive ] eagerness to do something: Peter's leaving at the end of this week - hence his anxiety to get his work finished.\nMore examplesFewer examplesShe eased the key into the lock, anxious not to wake anyone.The mayor and the city council are anxious to avoid getting entangled in the controversy.The universities are anxious to preserve their autonomy from central government.I'm anxious to avoid the motorway at rush hour.We left early, anxious to make it back to Florence before sundown.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzealously\nzestful\nzestfully\nSee more results »\nanxiety noun\n(MEDICAL CONDITION)\n[ U ] a medical condition in which you always feel frightened and worried: He has helped patients suffering from anxiety, depression, and eating disorders. an anxiety disorder/attack\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nmanic depression\nobsessive-compulsive disorder\npsychosis\nsad\nscarred\nself-alienation\nsenility\nsociopathic\nSee more results »\nAdd to word list\nAdd to word list\nan uncomfortable feeling of worry about something that is happening or might happen, or a cause of this: [ U ] For many children, every new school year causes anxiety. [ C ] Don’t you have any fears or anxieties about middle age?"}