{"id":16566,"name":"anxious","type":"adjective","us_sound":"ˈæŋk.ʃəs","us_link":"../audio/a/anxious.mp3","uk_sound":"ˈæŋk.ʃəs","uk_link":"../audio/a/ukantis012.mp3","content":"anxious adjective\n(WORRIED)\nAdd to word list\nAdd to word list\nB1 worried and nervous: My mother always gets a bit anxious if we don't arrive when we say we will. I saw my sister's anxious face at the window. The drought has made farmers anxious about the harvest.\nThesaurus: synonyms, antonyms, and examples\nworriedworriedI'm worried that he's not going to graduate.concernedAren't you concerned that she might tell someone?perturbedHe didn't seem unduly perturbed by the news.fretfulShe got a fretful night's sleep after the dreadful news.anxiousAll this waiting is making me anxious.apprehensiveHe's a bit apprehensive about leaving home.\nSee more results »\nMore examplesFewer examplesThere was nothing in his demeanour that suggested he was anxious.Knots of anxious people stood waiting in the hall.I've never seen her worried or anxious in any way - she's so laid-back.It's natural that you should feel anxious when you first leave home.As the date of his operation drew near, he became more and more anxious.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxiously\nfuss\nget in a sweat idiom\ngoosey\ngrim\ngrimly\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nqueasiness\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nanxious adjective\n(EAGER)\nB2 eager to do something: Developing countries that are anxious for hard currency can rarely afford to protect the environment. [ + to infinitive ] I'm anxious to get home to open my presents. [ + that ] I'm anxious that we get there on time because I don't think there'll be many seats left.\nMore examplesFewer examplesShe eased the key into the lock, anxious not to wake anyone.The mayor and the city council are anxious to avoid getting entangled in the controversy.The universities are anxious to preserve their autonomy from central government.I'm anxious to avoid the motorway at rush hour.We left early, anxious to make it back to Florence before sundown.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nevangelical\nevangelistic\nevangelistically\nexcited\nexcitedly\nfevered\ngo ahead\nmood\nnuts\nomnivorous\nomnivorously\non the edge of your seat idiom\nzestful\nzestfully\nSee more results »\nRelated word\nanxiously\nAdd to word list\nAdd to word list\nwanting very much for something to happen; eager: [ + to infinitive ] I’ve been anxious to meet you. [ + to infinitive ] It was getting late, and I was anxious to get home. anxiously adverb us\nYour browser doesn't support HTML5 audio\n/ˈæŋ·ʃəs·li/\nWe waited anxiously by the phone."}