{"id":13091,"name":"any","type":"determiner","us_sound":"ˈen.i","us_link":"../audio/a/any.mp3","uk_sound":"ˈen.i","uk_link":"../audio/a/ukantis014.mp3","content":"any determiner, pronoun\n(SOME)\nAdd to word list\nAdd to word list\nA1 some, or even the smallest amount or number of: Is there any of that lemon cake left? There was hardly any food left by the time we got there. \"Is there some butter I could use?\" \"No, there's some margarine but there isn't any butter.\" \"Is there any more soup?\" \"No, I'm afraid there isn't any left.\" I haven't seen any of his movies. I don't expect we'll have any more trouble from him. I go to church for weddings but not for any other reason. Are you sure there isn't any way of solving this problem?\nMore examplesFewer examplesI don't have any cash on me, so could I pay with by cheque?All the shops were closed, so we couldn't buy any food.\"Can I buy stamps here?\" \"Well, we do sell them, but we haven't got any at the moment.\"I tried taking tablets for the headache but they didn't have any effect.He hardly ever washes the dishes and he rarely, if ever, does any cleaning.\nSMART Vocabulary: related words and phrases\nSome and quite\n(a) sort of idiom\na piece/slice/share of the pie idiom\nbit\ncertain\ndegree\nfaintly\nfairly\nha'porth\nhalfway\nmildly\npie\npretty\nquite\nrather\nremotely\nseveral\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nany determiner, pronoun\n(NOT IMPORTANT WHICH)\nA1 one of or each of a particular type of person or thing when it is not important which: Any food would be better than nothing at all. \"Which of these cakes may I eat?\" \"Any.\" The offer was that you could have any three items of clothing you liked for $30.informal On Sundays I just wear any old thing (= anything) that I happen to find lying around. Any of you should be able to answer this question. Any idiot with a basic knowledge of French should be able to book a hotel room in Paris. Any advice (= whatever advice) that you can give me would be greatly appreciated. Any minute/day/time now (= very soon) there's going to be a massive quarrel between those two. There were a lot of computers at the exhibition, any (one) of which would have suited me perfectly.\nMore examplesFewer examplesOn Sundays I just wear any old thing that I happen to find lying around.He wanted success at any price.The virus can reactivate at any time.If ever there was any sort of argument, she'd always side with my father against me.We standardize parts such as rear-view mirrors, so that one type will fit any model of car we make.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\napiece\nboth\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nGrammar\nAnyAny is a determiner and a pronoun. …\nAny as a determinerWe use any before nouns to refer to indefinite or unknown quantities or an unlimited entity: …\nAny as a pronounAny can be used as a pronoun (without a noun following) when the noun is understood. …\nAny ofWe use any with of before articles (a/an, the), demonstratives (this, these), pronouns (you, us) or possessives (his, their): …\nNot any and noAny doesn’t have a negative meaning on its own. It must be used with a negative word to mean the same as no. …\nAny or every?We use any and every to talk about the total numbers of things in a group. Their meanings are not exactly the same: …\nAny and comparativesWe use any with comparative adjectives and adverbs: …\nAny: typical errorsWe don’t use ‘weak form’ any with singular countable nouns: …\nSome and anyWe use some and any in different types of clauses. …\nB1 at all or in the least: Can't you run any faster? Those trousers don't look any different from the others. Are you feeling any better after your illness? Houses in this area used to be a real bargain, but they're not cheap any more (= now). This radio isn't any good (= it's useless) - I'll have to buy another. I used to walk to work every day, but not any longer (= not now).US informal I tried talking him out of it, but that didn't help any - he still left home.\nMore examplesFewer examplesIs your cold getting any better?\"Don't come any closer, \" she said darkly.\"Halt!\" called the guard. \"You can't go any further without a permit.\"I don't like to think what might have happened if he'd been driving any faster.She doesn't work here any longer.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nAnyAny is a determiner and a pronoun. …\nAny as a determinerWe use any before nouns to refer to indefinite or unknown quantities or an unlimited entity: …\nAny as a pronounAny can be used as a pronoun (without a noun following) when the noun is understood. …\nAny ofWe use any with of before articles (a/an, the), demonstratives (this, these), pronouns (you, us) or possessives (his, their): …\nNot any and noAny doesn’t have a negative meaning on its own. It must be used with a negative word to mean the same as no. …\nAny or every?We use any and every to talk about the total numbers of things in a group. Their meanings are not exactly the same: …\nAny and comparativesWe use any with comparative adjectives and adverbs: …\nAny: typical errorsWe don’t use ‘weak form’ any with singular countable nouns: …\nSome and anyWe use some and any in different types of clauses. …\nany adjective, pronoun\n(SOME)\nAdd to word list\nAdd to word list\n(used in negative statements and questions) some, or even the smallest amount (of): We didn’t have any idea what the airfare would be. There was hardly any snow this winter. Is there any hope that he will recover? Are any of the concerts on a Saturday night?\nany adjective, pronoun\n(NOT IMPORTANT WHICH)\none of or each of, or a stated amount of (something that is more than one or has a number of parts), without saying which particular part is meant: You can have any three items of clothing you like for $30. Any advice that you can give me would be greatly appreciated. They should be here any minute (= soon). Any way you look at it, the investment was a bad idea. I saw some beautiful cars at the auto show, any of which I’d like to have. Idioms\nat any rate\nin any case\nany adverb [not gradable]\n(AT ALL)\nat all or in the least: I can’t say any more. He wasn’t any smarter than I was. If she comes any later, we’ll miss the show."}