{"id":13238,"name":"anymore","type":"adverb","us_sound":"ˌen.iˈmɔːr","us_link":"../audio/a/anymore.mp3","uk_sound":"ˌen.iˈmɔːr","uk_link":"../audio/a/ukantis017.mp3","content":"Add to word list\nAdd to word list\nA2 If you do not do something or something does not happen anymore, you have stopped doing it or it does not now happen: I don't do yoga anymore.\nMore examplesFewer examplesI don't want to talk about it anymore - let's drop the subject.You don't have to pretend anymore - you're among friends now.Nobody wants this type of heater anymore - I can't even give it away!The old hospital isn't used anymore.She used to love cats but one attacked her and she doesn't like them anymore.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nback in the day idiom\nback then idiom\nbefore\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nof late idiom\nsometime\nstep\nstep back (in time) idiom\nthe status quo ante\nuse\nSee more results »\nGrammar\nAny more or anymore?We use any more as a determiner to describe ‘an indefinite quantity of something’. Any more is similar to some more. Some more is more common in affirmative statements; any more is more common in questions, in clauses with if and in sentences with negative words such as hardly, never, scarcely: …\nAny more as a determinerWe use any more as a determiner to describe ‘an indefinite quantity of something’. Any more is similar to some more. Some more is more common in affirmative statements; any more is more common in questions, in clauses with if and in sentences with negative words such as hardly, never, scarcely: …\nAny more as an adverbAny more is also an adverb and has the meaning of ‘no longer’ or ‘in the past but not now.’ In this meaning, we use it in end position: …\nAdd to word list\nAdd to word list\n(used esp. in negative statements) any longer: I don’t know who to trust anymore. She doesn’t work here anymore.\nAnymore also means now or from now on, often even in positive statements: We never go out – all we do anymore is watch TV. I’m scared to be alone anymore."}