{"id":13375,"name":"anything","type":"pronoun","us_sound":"ˈen.i.θɪŋ","us_link":"../audio/a/anything.mp3","uk_sound":"ˈen.i.θɪŋ","uk_link":"../audio/a/ukantis021.mp3","content":"anything pronoun\n(SOMETHING)\nAdd to word list\nAdd to word list\nA1 used in questions and negatives to mean \"something\": Is there anything I can do to help? Was there anything else you wanted to say or is that it? Do you have anything less expensive? Let me know if anything happens, won't you? I didn't know anything about computers till I started this job. I was looking for a birthday present for my mother but I didn't find anything suitable. Did you notice anything strange about him? Spending Christmas with him and his brother - I can't imagine anything worse! If he eats anything with wheat in it he's very sick. \"What did you do over the weekend?\" \"I don't think we did anything much.\"\nMore examplesFewer examplesThere was so much cloud, we couldn't see anything.Did anything come of all those job applications?You didn't do anything wrong, - you should have a clear conscience .\nSMART Vocabulary: related words and phrases\nSomething, anything, nothing, and everything\nacross-the-board\naught\nbazillion\nbupkis\ncaboodle\nfresh\nmatter\nnone\nnot a dicky bird idiom\nnot a sausage idiom\nnot/nothing much idiom\nnothing\nnowt\nsweet\nsweet fanny adams idiom\nthe whole bit idiom\nwhat with one thing and another idiom\nwhatevs\nwhit\nzip\nSee more results »\nanything pronoun\n(ANY OBJECT/SITUATION)\nA1 any event, act, object, or situation: He said I could order anything on the menu. She could be anything (= any age) between 30 and 40.\nMore examplesFewer examplesWe christened him 'Slowcoach' because he took so long to do anything.They're not fabulously rich or anything, but they're quite comfortable.\nSMART Vocabulary: related words and phrases\nSomething, anything, nothing, and everything\nacross-the-board\naught\nbazillion\nbupkis\ncaboodle\nfresh\nmatter\nnone\nnot a dicky bird idiom\nnot a sausage idiom\nnot/nothing much idiom\nnothing\nnowt\nsweet\nsweet fanny adams idiom\nthe whole bit idiom\nwhat with one thing and another idiom\nwhatevs\nwhit\nzip\nSee more results »\nGrammar\nAnyone, anybody or anything?Anyone, anybody and anything are indefinite pronouns. We use anyone, anybody and anything to refer to both an open, unlimited set of things or people and specific things or people. We use them with a singular verb: …\nAnyone and anybodyAnyone and anybody have no difference in meaning. Anybody is a little less formal than anyone. Anyone is used more in writing than anybody: …\nIdioms\nanything but\nanything like\nas... as anything\nfor anything (in the world)\nAdd to word list\nAdd to word list\nany event, act, or object whatever, or (esp. in negative statements or questions) something: Is there anything I can do to help? I didn’t know anything about computers till I started this job. I don’t want to say anything to upset her. infml It was a fantastic party – I wouldn’t have missed it for anything (= for any reason). Idioms\nanything but\nanything like"}