{"id":13387,"name":"anywhere","type":"adverb","us_sound":"ˈen.i.wer","us_link":"../audio/a/anywhere.mp3","uk_sound":"ˈen.i.weər","uk_link":"../audio/a/ukantis025.mp3","content":"Add to word list\nAdd to word list\nA2 in, to, or at any place: You won't find a better plumber anywhere in England. Go anywhere in the world and you'll find some sort of hamburger restaurant. I was wondering if there was anywhere I could go to get this repaired. There are quite a few words that they use in that part of the country that you don't hear anywhere else. They live in some tiny little village miles from anywhere (= a very long way from any towns).\nA2 used in questions or negatives to mean \"a place\": I can't find my keys anywhere. Is there anywhere in particular you wanted to go to eat tonight? Did you go anywhere interesting this summer? Is there anywhere to eat around here?\nused to say that a number or amount is in a certain range but that you cannot say exactly what it is: He charges anywhere from $20 to $50 for a haircut. As a teacher you could expect to be paid anywhere (= any amount) between £25 and £50 per hour.\nMore examplesFewer examplesSmoking is not permitted anywhere in this theatre.I've lost my glasses and I can't find them anywhere.We studied the report thoroughly but the information we wanted wasn't given anywhere.We were caught in a thunderstorm, without anywhere to shelter.Have you seen the remote control for the TV anywhere?\nSMART Vocabulary: related words and phrases\nSomewhere, anywhere, nowhere, or everywhere\nacross\nall over\nanyplace\nat every turn idiom\nbilocation\ncoast\nevery\nfrom top to toe idiom\nhunt/search high and low idiom\nlength\nnon-universal\nnook\nround\nsomewhere\nthe length and breadth of somewhere idiom\nthroughout\nturn\nubiquitous\nubiquitously\nubiquity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRange and limits\nIdioms\nanywhere near\nnot anywhere near\nnot anywhere to be found\nnot get/go anywhere\nAdd to word list\nAdd to word list\nin, to, or at any place whatever or (esp. in negative statements and questions) a place, but without saying which place: I can’t find my scarf anywhere. There are plants in this desert that you won’t find anywhere else. There are no reserved seats – just sit anywhere you like.\nAnywhere also means within the range of or approximately: The turkey can weigh anywhere from ten to twenty pounds."}