{"id":16667,"name":"apart","type":"adverb","us_sound":"əˈpɑːrt","us_link":"../audio/a/apart.mp3","uk_sound":"əˈpɑːt","uk_link":"../audio/a/ukantis030.mp3","content":"apart adverb\n(SEPARATED)\nAdd to word list\nAdd to word list\nB1 separated by a distance or by time: Stand with your feet wide apart. How far apart should the speakers be? We were asked to stand in two lines three metres apart. The two lines of children moved slowly apart. The garage, large enough for two cars, is set apart from (= not joined to) the house. I forget the exact age difference between Mark and his brother - they're two or three years apart.\nB2 into smaller pieces: My jacket is so old it's falling apart. I took the motor apart (= separated it into pieces) to see how it worked.\nMore examplesFewer examplesWe made a deliberate decision to live apart for a while.They went for each other with their fists and had to be pulled apart.They moved the goal posts wider apart.My children's birthdays are only three days apart.The new two houses have been built quite far apart.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napartheid\natomistic\natomized\nbitty\ncloistered\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\ninterzone\nloose\nresegregation\nsecluded\nsecludedly\nseclusive\nseclusively\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTearing and breaking into pieces\napart adverb\n(EXCEPT)\napart from\nB1 except for or not considering: He works until nine o'clock every evening, and that's quite apart from the work he does over the weekend.\nSee more Grammar\nApart from or except for?Apart from and except for are multi-word prepositions. Apart from can mean either ‘including’ or ‘excluding’: …\nB2 living or staying in a different place from the person that you are married to or have a close relationship with: When you're apart you rely so heavily on the phone.\nMore examplesFewer examplesThey wrote each other letters every day when they were apart.My brother and his wife have been apart for three months now.They are a devoted couple who cannot bear to be apart even for one day.Because Sally's husband works at sea, they are often apart.Every moment we are apart, I'll be thinking of you.\nSMART Vocabulary: related words and phrases\nAlone\nabandoned\nalienate\nalienated\nbe cast away idiom\nbe in a minority of one idiom\nherself\nhimself\nlonely\nloner\nlonesome\nminority\noutcast\nshut\nshut someone away\nsole\nsolely\nsolitarily\nsolitary\nsolitude\nsolo\nSee more results »\nAdd to word list\nAdd to word list\nseparated by a distance: Stand with your feet wide apart and bend from the waist. How far apart should I put my stereo speakers? We both travel a lot, but when we’re apart we keep in touch by phone. fig. The strike continued, and both sides remained very far apart.\n(esp. of a machine) Apart can also mean separated into its parts: He had to take the hot-water pump apart to repair it.\nApart can also mean separated in time: Our two kids were born just eighteen months apart. Idiom\napart from"}