{"id":16669,"name":"apartheid","type":"noun","us_sound":"əˈpɑːr.taɪt","us_link":"../audio/a/apartheid.mp3","uk_sound":"əˈpɑː.taɪt","uk_link":"../audio/a/ukapart001.mp3","content":"Add to word list\nAdd to word list\nin the past in South Africa, a system under which people of different races were kept separate by law, and white people were given more political rights and educational and other advantages: South Africa finally began to dismantle (= end) apartheid. Archbishop Tutu said that when South Africans were fighting apartheid, they were supported by people worldwide. He was an important leader in the struggle against the apartheid regime.\na system of keeping groups of people separate and treating them differently, especially when this results in disadvantage for one group: She is a long-time critic of what she calls \"gender apartheid\" in her country. Opponents of special schools see them as educational apartheid.\nMore examplesFewer examplesDuring the late 1980s and 1990s, South Africa was undergoing its dramatic transition from apartheid to black majority rule. The Winds of Change is a fascinating collection of songs associated with the struggle against apartheid.He describes Gaelic-only laws, which mean people have to pass an Irish test before buying a house in the area, as \"linguistic apartheid\".She claims there is a kind of tourism apartheid operating on the island.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeparateness and isolation in space\nDifferent and difference\nAdd to word list\nAdd to word list\n(in the past) a political system in South Africa that legally separated people of different races"}