{"id":16823,"name":"apheresis","type":"noun","us_sound":"ˌeɪ.fə'ri.sɪs","us_link":"../audio/a/cdo0123usaphe0201.mp3","uk_sound":"ˌeɪ.fə'ri.sɪs","uk_link":"../audio/a/cdo0123ukaphe0391.mp3","content":"apheresis noun\n(MEDICINE)\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; medical\n&#160; specialized plural aphereses or aphaereses uk/æfˈɪə.rə.siːz/ a process in which a particular substance or part of someone's blood is removed from the blood and the rest returned to their body: The stem cells are filtered out in a process called apheresis. Platelets can derived by aphaeresis, a technique that collects one component of the blood and returns the rest to the donor. A total of 356 aphereses were performed on 125 patients.\nMore examplesFewer examplesLDL apheresis is used to reduce the amount of LDL cholesterol in the blood as much as possible.When aphaeresis is used as opposed to conventional blood donation, a full adult therapeutic dose of platelets can be taken from one donor.Unfortunately, there are not enough aphaeresis machines in our hospitals.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanterograde\nanti-platelet\nblood donor\nblood vessel\ncapillary\nerectile\nintravascular\nintravenously\njugular\njugular vein\nleucocyte\nplatelet\nvasoconstriction\nvasodilation\nVEGF\nveined\nvena\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeparating and dividing\napheresis noun\n(LANGUAGE)\n[ U ]\n&#160; phonetics\n&#160; specialized the act of not pronouncing the first sound in a word, for example saying \"specially\" instead of \"especially\": A striking feature of many of these nicknames is aphaeresis (initial syllabic deletion), as in \"Bastien\" for \"Sebastien\" or \"Toinette\" for \"Antoinette\". In apheresis, words lose their initial syllable. Compare\naphesis\nMore examplesFewer examplesWhen an unstressed initial vowel is lost, this is a particular type of aphaeresis also known as aphesis.Apheresis is especially common in the set of high-frequency verbs shown in Table 5.When apheresis applies, these verbs lose the word-initial front vowel.\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\naphesis\naphetic\nassonance\ndiphthong\nhomonym\nintrusive\nlabial\nlabialize\nlabiodental\nlateral\npostalveolar\npostconsonantal\nretroflex\nrhotic\nrhyme\nunpronounceable\nunrepeatable\nSee more results »"}