{"id":17266,"name":"apology","type":"noun","us_sound":"əˈpɑː.lə.dʒi","us_link":"../audio/a/apology.mp3","uk_sound":"əˈpɒl.ə.dʒi","uk_link":"../audio/a/ukapolo002.mp3","content":"apology noun\n(SAYING SORRY)\nAdd to word list\nAdd to word list\nB1 [ C or U ] an act of saying that you are sorry for something wrong you have done: I have an apology to make to you - I'm afraid I opened your letter by mistake. He's demanding a full apology from the newspaper for making untrue allegations about his personal life. \"Was he at all sorry for what he'd done?\" \"Oh he was full of apologies (= extremely sorry).\" She complained to the company and they sent her a written apology. I owe you an apology - I'm afraid I forgot to send that report. a letter of apology\nThesaurus: synonyms, antonyms, and examples\nto apologize for somethingapologizeUK I apologise for the error.say sorryHe didn't even say sorry.sorryI forgot your name, sorry.make an apologyThe president made an apology to the people of Japan in a public speech.express regretHe later expressed regret for portraying sharks as creatures that target human beings.\nSee more results »\nMore examplesFewer examplesShe wouldn't give in until she received a full apology.I didn't think his grudging remarks really counted as an apology.I offered her an apology, but she wouldn't accept it.He sent me some flowers by way of an apology.I think you owe me an apology.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\napology noun\n(MESSAGE)\n(your) apologies B1 [ plural ] formal\na message politely telling someone that you cannot be present at their meeting or party: The vice chair has sent his apologies - he's abroad at present.\nSee more\napology noun\n(EXPLANATION)\n[ C ] formal a formal explanation or defence of a belief or system, especially one that is unpopular\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ncase\ndefinition\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\nIdioms\nbe an apology for something\nmake no apologies\nAdd to word list\nAdd to word list\nan act of saying that you are sorry: I have an apology to make to you – I opened your letter by mistake. He owes me an apology (= He should say he is sorry). My apologies (= I am sorry) for not writing you sooner.\nAdd to word list\nAdd to word list\n[ C or U ] the act of saying sorry or a message that says sorry: An apology and a refund are being sent to the customer.issue/make an apology The hotel has issued an apology for its mistake. a letter of apology formal Please accept my apologies.\napologies [ plural ]\nMEETINGS the act of telling the person in charge of a meeting that you are not able to come, or the list of people who have done this: Ms Kamen sends her apologies. First on the agenda we have apologies, then the treasurer's report."}