{"id":17465,"name":"apostrophe","type":"noun","us_sound":"əˈpɑː.strə.fi","us_link":"../audio/a/apostrophe.mp3","uk_sound":"əˈpɒs.trə.fi","uk_link":"../audio/a/ukapolo009.mp3","content":"Add to word list\nAdd to word list\nB2 the symbol ’ used in writing to show when a letter or a number has been left out, as in I'm (= I am) or '85 (= 1985), or that is used before or after s to show possession, as in Helen's house or babies' hands: \"It's\" with an apostrophe means \"it is\" or \"it has\".\nsometimes used before s to show the plural of a number or a letter: There are two p's in \"supper\".\nMore examplesFewer examplesWe spent Christmas Day with Ben's parents.This book is the fruit of 15 years' research.Simon has a clear-sighted vision of the company's future.Our neighbour's baby cries morning, noon and night.I'm sure my views on marriage are coloured by my parents' divorce.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\nat sign\nblock capitals\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\nsquare brackets\nstroke\ntilde\nunbracketed\nuncapitalized\nSee more results »\nGrammar\nApostrophe (’)We sometimes connect two words to make one shorter word. We use an apostrophe to show that we have left out one or more letters: …\nApostrophe to show two words have been connected (contraction)We sometimes connect two words to make one shorter word. We use an apostrophe to show that we have left out one or more letters: …\nApostrophe + s to show possessionWhen we show who owns something or has a close relationship with something, we use an apostrophe + s after the name or the noun. When the noun is plural, we put the apostrophe after the s: …\nApostrophe with timeWe can use an apostrophe + s to show duration. When the time noun is plural, the apostrophe comes after the s: …\nApostrophe: typical errorWe use an apostrophe to contract it is to it’s. We don’t use an apostrophe with possessive its: …\nPossessive ’sWe use apostrophe s (’s), also called possessive ’s, as a determiner to show that something belongs to someone or something: …\nPossessives with ofWe can talk about possession using the pattern: noun phrase + of + possessive pronoun: …\n’s or of or either?There are some general rules about when to use ’s and when to use of but there are many cases where both are possible: …\nPossession: typical errorsWe don’t use ’s with plural nouns: …\nAdd to word list\nAdd to word list\ngrammar a mark (’) used in writing to show that a letter or a number has been omitted, or before or after s to show possession"}