{"id":17535,"name":"app","type":"noun","us_sound":"æp","us_link":"../audio/a/cbedus00327.mp3","uk_sound":"æp","uk_link":"../audio/a/cbeduk00327.mp3","content":"app noun [C]\n(COMPUTING)\nAdd to word list\nAdd to word list\nabbreviation for application: a computer program that is designed for a particular purpose: You can run an app on your PC that will find the files and burn them to a CD.\nabbreviation for application: a computer program or piece of software designed for a particular purpose that you can download onto a mobile phone or other mobile device: There are apps for everything, from learning a language to booking cinema tickets.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ngarbage collector\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nCommunications - general words\napp noun [C]\n(FOOD)\nUS informal abbreviation for appetizer: a small dish served as the first part of a meal: Chicken souvlaki makes a nice, refreshing app.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nfinger food\nplate meal\nploughman's lunch\npostprandial\npot luck\npower breakfast\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nAdd to word list\nAdd to word list\nIT abbreviation for application or application program: a computer program that is designed for a particular purpose: After plugging the unit into your wired network, you run a little app on your PC that searches the network to locate the camera. See also\nkiller app\nIT, COMMUNICATIONS abbreviation for application or application program: a small computer program that you can download onto a mobile phone: There are apps for everything, from learning Swedish to booking cinema tickets."}