{"id":17540,"name":"appalachian","type":"adjective","us_sound":"ˌæp.əˈleɪ.tʃən","us_link":"","uk_sound":"ˌæp.əˈleɪ.ʃən","uk_link":"","content":"Add to word list\nAdd to word list\nfrom or relating to the mountain region of Appalachia in the eastern United States, that includes parts of many different states and that is regarded as having its own culture: I am Appalachian and bean soup was a staple food in our family. His family has worked in the Appalachian coal industry for generations. She is fascinated by the links between traditional Appalachian music and the folk songs of Ireland and Scotland. Related word\nAppalachiaCompare\nAffrilachian\nMore examplesFewer examplesThe network has 14 clinics that offer medical and dental services in the Appalachian region.He had grown up in a traditional Appalachian culture that was rapidly disappearing.As a local historian, he knew that telling stories was the Appalachian way of connecting the past and the present.This is Dorothea Lange's famous photograph of an Appalachian woman during Depression times. When I was growing up, people seemed to be ashamed of the idea of being Appalachian.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEssex\nfife\nfl.\nFlintshire\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\na person who comes from the mountain region of Appalachia in the eastern United States, that includes parts of many different states and that is regarded as having its own culture: They used to use the term \"Highlander\" to refer to an Appalachian. How do you consider Appalachians or mountain people different from rural Southerners in general? Related word\nAppalachiaCompare\nAffrilachian\nMore examplesFewer examplesThere are stereotypes about southern sharecroppers, Appalachians, urban poor.African-Americans in the area are twice as likely to face unemployment, and Hispanics and Appalachians also have lower per-capita incomes.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEssex\nfife\nfl.\nFlintshire\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »"}