{"id":17582,"name":"apparent","type":"adjective","us_sound":"əˈper.ənt","us_link":"../audio/a/apparent.mp3","uk_sound":"əˈpær.ənt","uk_link":"../audio/a/ukapolo020.mp3","content":"Add to word list\nAdd to word list\nB2 able to be seen or understood: Her unhappiness was apparent to everyone. [ + that ] It was becoming increasingly apparent that he could no longer take care of himself. I was on the metro this morning when, for no apparent reason, the man opposite me suddenly screamed.\nThesaurus: synonyms, antonyms, and examples\neasy to see, recognize, or understandobviousIt's obvious that she's upset.clearIt was clear that he was unhappy.apparentHer joy was apparent to everyone.plainHis disappointment was plain to see.evidentThe company president was impressed by her evident ambition.manifestHis manifest lack of interest has provoked severe criticism.\nSee more results »\nC1 [ before noun ] seeming to exist or be true: There are one or two apparent discrepancies between the two reports. She has this apparent innocence which, I suspect, she uses to her advantage.\nMore examplesFewer examplesVarious reasons are given for the apparent glass ceiling women hit in many professions.Criminal gangs are terrorizing the city with apparent impunity.At school she was a late developer, and it wasn't until she went to university that her talents became apparent.In the middle of the meeting she suddenly laid into him for no apparent reason.A small worry in the back of your mind can for no apparent reason take on massive proportions in the middle of the night.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nblatancy\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nin plain sight idiom\nobtrude\npalpable\npalpably\nparallax\npatently\nperceivable\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeeming and purporting to be\nAdd to word list\nAdd to word list\nable to be seen or understood: [ + that clause ] It was becoming increasingly apparent that he could no longer look after himself.\nApparent also means seeming to be true: The apparent cause of death was drowning, but further tests were needed."}