{"id":17604,"name":"appeal","type":"noun","us_sound":"əˈpiːl","us_link":"../audio/a/appeal.mp3","uk_sound":"əˈpiːl","uk_link":"../audio/a/ukapolo023.mp3","content":"appeal noun\n(REQUEST)\nAdd to word list\nAdd to word list\nC1 [ C ] a request to the public for money, information, or help: They're launching (= starting) an appeal to raise money for famine victims. [ + to infinitive ] The police have issued an appeal to the public to stay away from the area over the weekend. Synonyms\nentreaty\nplea (REQUEST) formal\nprayer\nrequest\nThesaurus: synonyms, antonyms, and examples\nthe act of asking for somethingrequestHer request for information was denied.applicationHis application for bail was granted.appealThe leader made an appeal for unity.callWith calls for action mounting, policymakers are beginning to pay attention.demandWe will never give in to terrorists’ demands.\nSee more results »\nMore examplesFewer examplesNo witnesses to the accident have come forward yet, despite the police's appeal.The missing child's distraught parents made an emotional appeal for information on TV.The appeal for people to donate blood was very successful.She made an eloquent appeal for action before it was too late.The campaign has been gaining momentum ever since the television appeal.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nappeal noun\n(LEGAL)\n[ C or U ] a request made to a court of law or to someone in authority to change a previous decision: The case went to the court of appeal/the appeal court. He won his appeal and the sentence was halved. She has lodged (= made) an appeal against the severity of the fine.\nMore examplesFewer examplesLee's solicitor said last night that they would be lodging an appeal against the sentence.The district attorney said if McVeigh is given the death penalty and his conviction is upheld on appeal, the state prosecution would become moot.The appeal was rejected by the High Court.The judge ordered that he post a $10 000 bond pending his appeal of the verdict.She took her case to an immigration appeals tribunal.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nappeal noun\n(QUALITY)\nB2 [ U ] the quality in someone or something that makes him, her, or it attractive or interesting: sex appeal Spielberg's movies have a wide appeal. This used to be a marvellous hotel but it has lost its appeal in recent years.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizing\ntantalizingly\ntempt\ntemptation\ntemptingly\nSee more results »\nappeal verb\n(REQUEST)\nC1 [ I ] to make a serious or formal request, especially to the public, for money, information, or help: They're appealing for clothes and blankets to send to the devastated region. The police are appealing to the public for any information about the missing girl. I tried to appeal to (= ask for support based on) his sense of loyalty, stressing how good the company had been to him. [ + to infinitive ] Church leaders have appealed to the government to halt the war. Synonyms\nadjure formal\nbeg\nbeseech old use or literary\nentreat\nplead (REQUEST)\nThesaurus: synonyms, antonyms, and examples\nto beg for something or beg someone to do something begHe begged her to stay, but she wouldn't listen.imploreI implore you to change your mind.plead withHe pleaded with the guards to be allowed to see his daughter.appeal toI appeal to the public to remain calm.entreatThe banners entreated the government to release the prisoners.adjureThe gospel adjures us to love one another.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nMore examplesFewer examplesPolice are appealing for witnesses to the accident to come forward.After a night of violence, police are appealing for calm.The parents of the missing girl appeared on television appealing for witnesses.Charity workers are appealing for cash to help provide relief for the disaster victims.Both sets of parents appealed to the kidnappers to release their son and daughter.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nappeal verb\n(LEGAL)\n[ I ] to request a higher court of law to consider again a decision made by a lower court, especially in order to reduce or prevent a punishment: The teenager has been given leave (= allowed) by the High Court to appeal against her two-year sentence. They're appealing to the court to reduce the sentence to a fine.\n[ I ] to formally request that a legal or official decision be changed: The parents appealed against the school's decision not to admit the child. The players appealed to the referee for a free kick.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\nappeal verb\n(ATTRACT)\nB2 [ I not continuous ] to interest or attract someone: It's a programme designed to appeal mainly to 16 to 25-year-olds. I think what appeals to me about his painting is his use of colour.UK I haven't been skiing - it's never really appealed.\nThesaurus: synonyms, antonyms, and examples\nto draw your attention and interest youattractWe were attracted to the high street, with its variety of shops and cafés.drawThe game drew a crowd of 30,000.enticeThe smell of coffee enticed people to enter the shop.lureI was lured into the store by the smell of fresh bread.temptI was tempted by the offer of a free phone.seduceI wouldn't normally have bought this but I was seduced by the low price.\nSee more results »\nMore examplesFewer examplesTo win the election he needs to appeal to the typical man in the street.The party has watered down its socialist ideals in order to appeal to the centre ground.Her latest book should appeal to a large audience.It was one of the first avant-garde works to appeal to a wide audience.This policy may appeal to the party faithful, but will it gain the support of uncommitted voters?\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizing\ntantalizingly\ntempt\ntemptation\ntemptingly\nSee more results »\nappeal verb\n(ATTRACT)\nAdd to word list\nAdd to word list\n[ I ] to be interesting or attractive: Such music managed to appeal to the tastes of both young and old.\nappeal verb\n(ARGUE)\n[ I/T ] to request formally that a decision, esp. a legal or official one, be changed: [ T ] The verdict was appealed to a higher court.\nappeal verb\n(REQUEST)\n[ I ] to make a serious or formal request for help, esp. in an emergency: Blood supplies are running low, and the Red Cross is appealing for blood donations.\nappeal noun\n(ATTRACTIVENESS)\n[ U ] the quality of being interesting or attractive: Eating out has lost much of its appeal.\nappeal noun\n(LEGAL ARGUMENT)\n[ C ] a formal request that a decision, esp. a legal or official one, be changed: [ U ] The decision was reversed on appeal.\nappeal noun\n(REQUEST)\n[ C ] a serious or formal request for help, esp. in a public emergency: Many charities issued an appeal for contributions to help victims of the earthquake.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW a request to a law court or other official organization to change a previous decision: lodge/launch/make an appeal He has 28 days to lodge an appeal in the High Court.an appeal against sth Her appeal against the dismissal was rejected. We feel we have plenty of grounds for appeal. an employment/income tax appeal an appeal hearing/tribunal the appeals procedure/process\n[ C ] a request for something, especially money, information, or help: launch/make an appeal The Red Cross launched an appeal after a huge earthquake hit Haiti.an appeal for sth The Society made an appeal for funds to purchase the building and grounds. The development and modernization work is being funded from a successful capital appeal launched last year.\n[ U ]\n&#160; MARKETING a quality that makes people like something or want to buy it: A well-chosen set of photographs gives the book added appeal.market/customer appeal The products have all been researched and tested for market appeal. have wide/broad/universal appeal\n[ I or T ]\n&#160; LAW to ask a higher law court to consider again a decision made by a lower court, especially in order to reduce or prevent a punishment: appeal to sth They're appealing to the High Court to reduce the fine.appeal against sth The trust appealed against the injunction, but a High Court has yet to rule. appeal a decision/ruling/verdict\n[ I ] to formally ask for an official decision to be changed: appeal to sth Any woman who believes she is the subject of discrimination over pension rights can appeal to an industrial tribunal.appeal against sth A group of radio stations is to appeal against the decision to charge huge royalties for internet radio. Our formal complaints system sets out clearly how to make complaints and how you can appeal decisions.\n[ I ] to ask the public for something such as money, information, or help: appeal for sth How could we appeal for more resources?appeal to sb for sth We are appealing to the public for information.appeal for/to sb to do sth Detectives are appealing for witnesses to come forward.\n[ I ] to interest or attract someone: Our partner company has local knowledge and will know which products appeal.appeal to sb The new phone is designed to appeal to consumers who find normal phone tariffs confusing."}