{"id":17615,"name":"appearance","type":"noun","us_sound":"əˈpɪr.əns","us_link":"../audio/a/appearance.mp3","uk_sound":"əˈpɪə.rəns","uk_link":"../audio/a/ukapolo026.mp3","content":"appearance noun\n(BEING PRESENT)\nAdd to word list\nAdd to word list\nB2 [ C ] an occasion when someone appears in public: It was his first appearance on television/television appearance as president. She will be making a public appearance, signing copies of her latest novel.\n[ C ] an occasion when someone goes to court to be officially involved in a trial: This was the defendant's third court appearance for the same offence.\nB2 [ C ] a public performance by an entertainer: He made his first stage/TV appearance at the age of six. put in/make an appearance\nto be present somewhere for a short time: I didn't really want to go to the party, but I thought I'd better put in an appearance.\nSee more\nMore examplesFewer examplesMadonna made a guest appearance at the concert.The health minister made a personal appearance at the hospital.Top footballers make regular appearances on TV.The endless public appearances are an inevitable part of an election campaign.Her last concert appearance in Britain was no ordinary performance.\nSMART Vocabulary: related words and phrases\nAppearing & disappearing\nact\nBermuda Triangle\nbubble up\ncreep\ncreep in/creep into something\ndeliquesce\ndissolve\nfilter\nmelt away\npass\nre-emergence\nreappear\nreappearance\nrematerialize\nspring\nsprout\nvanish\nvanish/go up/disappear in a puff of smoke idiom\nvanishing\nwind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople appearing in court\nCinema & theatre: acting, rehearsing & performing\nappearance noun\n(WAY YOU LOOK)\nB1 [ C or U ] the way a person or thing looks to other people: a middle-aged man of smart appearance You can alter/change the whole appearance of a room just by lighting it in a certain way. There was nothing unusual about/in her physical appearance. The large car outside the house gave the appearance of wealth (= suggested wealthy people lived there). Appearances can be deceptive. appearances [ plural ]\nwhat things look like or seem to be rather than what they actually are: He was a far more complicated man than outward appearances suggested.\nSee more to/from all appearances (also mainly US by all appearances)\njudging from what can be seen: To all appearances their marriage is fine, but I think she gives him a bad time in private.\nSee more\nMore examplesFewer examplesDon't be fooled by his appearance.She had a decidedly down-at-heel appearance.You really need to smarten up your appearance, Chris - and the same goes for the rest of you.I bought these shoes for their practicality not their appearance.The outward appearance of the building has not changed at all in 200 years.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\naspect\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nappearance noun\n(HOW IT SEEMS)\nAdd to word list\nAdd to word list\n[ U ] the way a person or thing looks or seems to other people: The most striking feature of his appearance was his long hair.\nappearance noun\n(PERFORMANCE)\n[ C ] a public performance in a play, movie, dance, or other similar event: Her only screen appearances were in two made-for-television movies.\nappearance noun\n(BEING PRESENT)\n[ C ] the act of becoming noticeable or the fact of being present: It was his first television appearance.\nIdiom\nput in/make an appearance"}