{"id":17621,"name":"appearing","type":"verb","us_sound":"əˈpɪr","us_link":"../audio/a/appear.mp3","uk_sound":"əˈpɪər","uk_link":"../audio/a/ukapolo025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nappear\nappear verb\n(BE PRESENT)\nB1 [ I ] to start to be seen or to be present: He suddenly appeared in the doorway. We'd been in the house a month when dark stains started appearing on the wall. His name appears in the film credits for lighting.\nThesaurus: synonyms, antonyms, and examples\nto appearappearOne or two clouds appeared in the sky.be/become visibleAs the beach gets darker, the glow of city lights becomes more visible.show itselfHe believes the impact is showing itself clearly already. emergeA slender figure is seen emerging from the darkness.loomClouds of volcanic ash loomed menacingly overhead.\nSee more results »\n[ I ] If you appear in court, you are there officially because you are involved in a trial: Both women will be appearing before magistrates later this week.\nMore examplesFewer examplesHe will appear before the magistrates tomorrow.Comets appear at predictable times.Robins mostly appear in the winter and are commonly pictured on Christmas cards.Two weeks after we'd planted the seeds, little green shoots started to appear.His colleagues became suspicious when he did not appear at work, since he was always punctual.\nSMART Vocabulary: related words and phrases\nAppearing & disappearing\nappear\nBermuda Triangle\nbubble up\ncreep\ncreep in/creep into something\ndeliquesce\ndissolve\nfilter\nmelt away\npass\nre-emergence\nreappear\nreappearance\nrematerialize\nspring\nsprout\nvanish\nvanish/go up/disappear in a puff of smoke idiom\nvanishing\nwind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExisting and being\nTaking legal action\nappear verb\n(SEEM)\nB1 [ L or I, not continuous ] to seem: You've got to appear (to be) calm in an interview even if you're terrified underneath. To people who don't know him he probably appears (to be) rather unfriendly. Things aren't always what they appear to be. [ + to infinitive ] She appears to actually like the man, which I find incredible. There appears to be some mistake. [ + (that) ] It appears (that) she left the party alone. It appears to me (that) (= I think that) we need to make some changes.formal It would appear (that) (= it seems that) nobody on board the aircraft actually had a licence to fly it. [ + adv/prep ] It appears as if/as though I was wrong. Everything was not as it appeared - secret deals had been done. I know how it must appear, but it's not really as bad as it looks. \"Has he left?\" \"It appears not/so.\" [ after so ] \"I think we're late.\" \"So it appears.\"\nMore examplesFewer examplesI hope I didn't appear rude - it's just that I was in such a hurry.She likes to appear as if she knows all about the latest films and art exhibitions, but it's all a pose .The most important rule in life is always to appear confident.Are you as unconcerned about the situation as you appear?To a casual observer, everything might appear normal.\nSMART Vocabulary: related words and phrases\nSeeming and purporting to be\napparent\nappear\nappearance\nas if/though idiom\nby the look(s) of things idiom\ncome across\ncome off\nformal\njudge\noutward\noutwardly\noutwardness\nparallax\npass for sb/sth\nseemingly\nsemblance\nsuperficial\nsuperficiality\nsuperficially\nsurface\nSee more results »\nappear verb\n(PERFORM)\nB1 [ I usually + adv/prep ] to perform publicly in a play, film, or show: She will be appearing in the latest adaptation of \"Bleak House\". She appears briefly in the new Bond film.\nMore examplesFewer examplesMost of the bands that appear on the show just mime to a recording of their songs.She got eight million dollars for appearing in that movie.They're appearing twice nightly at the Playhouse Theatre.She loves appearing on television and is no shrinking violet when it comes to expressing her views.She was appearing in concert at Carnegie Hall.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nblocking\ncamp\nchew\nchew the scenery idiom\ndumb show\nimprovisation\ninterpreter\nmethod acting\nre-enactment\nrecreation\ntread\nunderstudy\nvariety\nvoice acting\nwalk\nwalk through something\nwalkthrough\nSee more results »\nappear verb\n(BECOME AVAILABLE)\nB2 [ I ] to start to exist or become available: I've noticed that smaller cars are starting to appear (= be produced or sold) again. The film, currently showing in the States, will be appearing on our screens (= we will be able to see it) later this year.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nappear verb\n(ARRIVE)\n[ I ] to arrive: If she hasn't appeared by ten o'clock I'm going without her.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nGrammar\nAppearWe use appear to say how something looks or seems to look. We usually follow it by an adjective or by a to-infinitive: …\nAppear: how something looksWe use appear to say how something looks or seems to look. We usually follow it by an adjective or by a to-infinitive: …\nAppear meaning ‘come into sight’Appear also means ‘become noticeable’: …\nAppear or seem?We mostly use appear to talk about facts and events. We use seem to talk about facts, but also to talk about personal feelings and ideas. Seem is often used with a noun: …\nPhrasal verb\nappear for someone"}