{"id":17818,"name":"applicative","type":"adjective","us_sound":"əˈplɪk.ə.t̬ɪv","us_link":"","uk_sound":"əˈplɪk.ə.tɪv","uk_link":"","content":"applicative adjective\n(IN LANGUAGE)\nAdd to word list\nAdd to word list\nlanguage\n&#160; specialized using or showing a grammatical voice (= a form of a word that shows the relationship between the action described by a verb and its subject) that exists in some languages and that relates to transitivity (= the relationship between a verb and any of its objects): They studied Sesotho double object applicative constructions. In this sentence, the verb is suffixed by -pii, the applicative marker.\nMore examplesFewer examplesThe applicative voice is often found in agglutinative languages, such as the Bantu and Austronesian languages.Their research was on children's spontaneous use of Sesotho applicative constructions.Applicative constructions allow languages to express what otherwise would be expressed as an oblique participant as a core object participant.In the case of a transitive verb, adding the applicative morpheme renders the verb ditransitive.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonym\nantonymous\nbuzzword\ncognate\ncoinage\nhomography\nhomonymic\nhomonymy\nhomophonic\nhomophony\nproductive\nproductively\nreceptive\nreceptively\nreferent\nSee more results »\napplicative adjective\n(PRACTICAL)\nrelating to a subject of study, especially a science, that has a practical use: Machine learning is an applicative science that has optimized algorithms and models for data analysis. Synonyms\napplied\npracticalRelated word\napply\nMore examplesFewer examplesIn our opinion, the system was successful both from a scientific point of view and from an applicative point of view.\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\nAfrocentrism\nandragogy\nAP\napplied\narea studies\nfuturology\nGermanist\nglaciology\nhard science\nhistoriography\nology\nontology\noology\norientalist\nPE\nstem\nsubscience\nsuicidology\ntechnical\ntechnically\nSee more results »\nlanguage\n&#160; specialized a grammatical voice (= a form of a word that shows the relationship between the action described by a verb and its subject) that exists in some languages and that relates to transitivity (= the relationship between a verb and any of its objects): A language may have multiple applicatives. common Sesotho verbs used in the applicative\nMore examplesFewer examplesThis research on applicatives focuses on aspects of their synchronic morphosyntax. Applicatives have some overlap with causatives, and in some languages, the two have identical forms.Many analyses have focused on the status of the object that appears in the applicative.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonym\nantonymous\nbuzzword\ncognate\ncoinage\nhomography\nhomonymic\nhomonymy\nhomophonic\nhomophony\nproductive\nproductively\nreceptive\nreceptively\nreferent\nSee more results »"}