{"id":17800,"name":"apply","type":"verb","us_sound":"əˈplaɪ","us_link":"../audio/a/apply.mp3","uk_sound":"əˈplaɪ","uk_link":"../audio/a/ukappen024.mp3","content":"apply verb\n(REQUEST)\nAdd to word list\nAdd to word list\nB1 [ I ] to request something, usually officially, especially in writing or by sending in a form: apply for We've applied for a grant to get funding for the project.apply to Please apply in writing to the address below. By the time I saw the job advertised it was already too late to apply. I've applied for a new job with the local newspaper. [ + to infinitive ] Mandy applied to join the police.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nMore examplesFewer examplesHe had an inspiration - why not apply for some government money?People who apply for housing benefit must be means-tested.We could apply for a loan to buy a car.She's applied for a job with an insurance company.We've applied to a charitable organization for a grant for the project.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\napply verb\n(RELATE TO)\nB2 [ I ] (especially of rules or laws) to have a connection or be important: apply to That part of the form is for UK citizens - it doesn't apply to you. Those were old regulations - they don't apply any more.\nMore examplesFewer examplesPlease strike out whichever option does not apply to you.The law will apply equally to men and women except in the case of maternity leave.The discount applies only to children under the age of ten.The legislation must be applied irrespective of someone's ethnic origins.It is intended that these guidelines should be applied flexibly and pragmatically.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\napply verb\n(USE)\nC1 [ T ] to make use of something or use it for a practical purpose: He wants a job in which he can apply his foreign languages. The court heard how the driver had failed to apply his brakes in time. If you apply pressure to a cut it's meant to stop the bleeding.\nMore examplesFewer examplesIf it continues to bleed, you may have to apply a tourniquet to the limb.If he still refuses we could always apply a little pressure, as it were.It's important to apply research in a practical way and not leave it on the shelf.It is intended that these guidelines should be applied flexibly and pragmatically.The taxi driver suddenly applied his brakes.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\napply verb\n(PUT ON)\n[ T ] to spread or rub a substance such as cream or paint on a surface: Apply the cream liberally to exposed areas every three hours and after swimming. The paint should be applied thinly and evenly.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\napply verb\n(WORK HARD)\napply yourself C2\nIf you apply yourself to something, you work hard at it, directing your abilities and efforts in a determined way so that you succeed: You can solve any problem if you apply yourself. If I had applied myself, I think I could have passed those exams. If your players aren't applying themselves, you're never going to win anything. People assumed he was simply not applying himself to his studies. I'm sure the business will thrive if we apply ourselves and work together.\nSMART Vocabulary: related words and phrases\nEffort and expending energy\nassiduity\nassiduous\nassiduously\nassiduousness\nbe running on empty idiom\nburn\neffort\neffortful\neffortfully\nelbow grease\nhamster wheel\nkill\nperseverance\nplough\nplough through something\npush\nput something in/put something into something\nrearguard action\nstruggle\nswing\nSee more results »\napply verb\n(REQUEST)\nAdd to word list\nAdd to word list\n[ I ] to request something, usually officially, esp. by writing or by sending in a form: to apply for a job/loan She applied for admission to law school.\napply verb\n(HAVE TO DO WITH)\n[ I ] (esp. of rules or laws) to have to do with someone or something; relate: The same rules apply to everybody.\napply verb\n(PUT ON)\n[ T ] to spread or rub cream, paint, etc., on a surface: She applied the lotion gently to her sunburned arms.\napply verb\n(USE)\n[ T ] to make use of something for a particular purpose: As a translator, he was able to apply his knowledge of foreign languages. The driver failed to apply his brakes in time.\n[ T ] If you apply yourself to something, you work hard at it. applicable adjective us\nYour browser doesn't support HTML5 audio\n/ˈæp·lɪ·kə·bəl, əˈplɪk·ə-/\nThis law is only applicable to nonprofit organizations.\nAdd to word list\nAdd to word list\n[ I ]\n&#160; HR, FINANCE to officially ask for something such as a job, a place on a course, or a loan, usually by completing a special form or writing a letter: Please apply before April 4th.apply for sth I'm applying for a new job.apply to do sth How do you apply to extend your visa?apply to sb/sth (for sth) We've applied to a charitable organization for a grant for the project.\n[ I ] if something such as a rule, condition, or tax applies, it affects a particular person or situation: Whether you are a shoe store or an internet company, consumer protection laws apply.apply to sb/sth The tax would only apply to meals in restaurants.\n[ T ] to make use of something for a practical purpose or in a real situation: apply knowledge/techniques/theory Applicants should be willing to learn and apply new techniques.apply sth to sth He applied the knowledge he gained at university to his new job.\nCompare\napplicable\napplicant"}