{"id":17864,"name":"apportion","type":"verb","us_sound":"əˈpɔːr.ʃən","us_link":"../audio/a/apportion.mp3","uk_sound":"əˈpɔː.ʃən","uk_link":"../audio/a/ukappen029.mp3","content":"Add to word list\nAdd to word list\nto give or share out something, especially blame or money, among several people or things: When we know how much is profit, then we can apportion the money among/between us. The investigation into the air crash would inevitably apportion blame to certain members of the crew. Synonym\nallocate\nThesaurus: synonyms, antonyms, and examples\nto blame someone for somethingblameHe blamed his wife for the error.lay the blame onThe bridge's architect was quick to lay the blame on the engineers.pin the blame onNo one should be looking to pin the blame on others.apportion blameWhen a company fails it isn't always possible to apportion blame.hold someone responsibleIf anything goes wrong, I will hold you responsible.take the blameIf we fail, I'll take the blame.\nSee more results »\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ndistribute\ndistribution\ndistributive\ndistributively\ndivide/split (something) down the middle idiom\njoint\nmate\nportion something out\nration\nration something out\nredistribute\nredistribution\nsplit\nspread\nSee more results »\nAdd to word list\nAdd to word list\nto give or share something among several people or things: How should medical care be funded and apportioned?\nAdd to word list\nAdd to word list\nto share something between several people or organizations: apportion sth between sb/sth The costs will be apportioned between the buyer and the seller.apportion sth to sb/sth She apportioned 25% of her estate to her grandchildren.apportion sth among sb/sth International agreements apportioning flights among airlines will soon be a thing of the past.\nINSURANCE, LAW to decide who is responsible for an accident or event, especially when deciding how much of the costs each person, insurance company, etc. should pay: I'm not here to apportion blame, but only to try and resolve the problem. Liability was apportioned 80-20 in his favour.\nACCOUNTING, TAX to divide costs between different accounts or uses: apportion sth between sb/sth Items such as gas and electricity bills can be apportioned between home and work use."}