{"id":17845,"name":"appoint","type":"verb","us_sound":"əˈpɔɪnt","us_link":"../audio/a/appoint.mp3","uk_sound":"əˈpɔɪnt","uk_link":"../audio/a/ukappen025.mp3","content":"appoint verb\n(PERSON)\nAdd to word list\nAdd to word list\nC1 [ T ] to choose someone officially for a job or responsibility: We've appointed three new teachers this year. He's just been appointed (as) director of the publishing division. [ + to infinitive ] A commission has just been appointed to investigate fraud claims.\nMore examplesFewer examplesThe truth is that they appoint no more than a token number of women to managerial jobs.He'll be the acting director until they can appoint a permanent one.The police have appointed a liaison officer to work with the local community.The government has appointed a drugs tsar to co-ordinate the fight against drug abuse.A top German engineer has been appointed to troubleshoot the cause of the accident.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nappoint verb\n(DATE)\n[ T usually passive ] formal to arrange a date or time when a meeting or other event will happen: A date has been appointed for the election.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nbags I... idiom\nbe between the devil and the deep blue sea idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nAdd to word list\nAdd to word list\nto choose someone officially for a job or responsibility: Commissioner Curtis was appointed by President Bush.\nAdd to word list\nAdd to word list\nHR to choose someone officially for a job or responsibility: They still have not appointed his replacement.appoint sb sth She was appointed Chief Executive about 3 years ago.appoint sb as sth KPMG were appointed as administrators.appoint sb to do sth A commission has just been appointed to investigate fraud claims.\nformal to arrange a date or time when a meeting or other event will happen: Start the meeting at the appointed time and stick to the agenda."}