{"id":17856,"name":"appointment","type":"noun","us_sound":"əˈpɔɪnt.mənt","us_link":"../audio/a/appointment.mp3","uk_sound":"əˈpɔɪnt.mənt","uk_link":"../audio/a/ukappen028.mp3","content":"appointment noun\n(ARRANGEMENT)\nAdd to word list\nAdd to word list\nA2 [ C ] a formal arrangement to meet or visit someone at a particular time and place: I'd like to make an appointment with Dr Evans, please. She had to cancel her dental appointment. [ + to infinitive ] I've got an appointment to see Ms Edwards at two o'clock. I've got a two o'clock appointment with Ms Edwards. If he didn't have a secretary to remind him, he wouldn't keep (= remember to be present at) any of his appointments. That's the second appointment he's missed.\nThesaurus: synonyms, antonyms, and examples\nan appointmentappointmentI made a dentist's appointment for Monday morning.reservationI have a reservation for 8 pm.bookingUK I have a booking in the name of Smith.commitmentI have no commitments tomorrow, so let’s meet up in the morning.\nSee more results »\nby appointment\nat a previously arranged time: House for sale, two bedrooms. Viewing by appointment only.\nSee more\nMore examplesFewer examplesI have a four o'clock appointment at the hairdresser's.I'm a patient of Dr Stephens, please could I make an appointment to see her?Would a ten o'clock appointment be more convenient for you?The manager has no free appointments this week, I'm afraid.Please cancel my appointments for tomorrow afternoon - I have to go to a funeral.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nmake yourself known idiom\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nappointment noun\n(JOB)\nC2 [ C or U ] the act of officially choosing someone for a job, or the job itself: his appointment as senior lecturer We would like to announce the appointment of Julia Lewis as head of sales. Our department expects to make five new appointments (= appoint five new people) this year alone. Synonyms\njob (EMPLOYMENT)\nposition (RANK)\npost (JOB)\nsituation old useCompare\nemployment (WORK)\nwork noun (ACTIVITY)\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\nby appointment\nin the UK, used by businesses to show that their goods and services are sold to a member of the royal family: Carter's Ltd, confectioners by appointment to the Queen\nSee more\nMore examplesFewer examplesHe was eventually prevailed upon to accept the appointment.The appointment of a female director is a quantum leap for women's equality.The new appointment has been widely welcomed.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nAdd to word list\nAdd to word list\na formal arrangement to meet or visit someone at a particular time and place: [ C ] I have a doctor’s appointment tomorrow. Idiom\nby appointment\nAdd to word list\nAdd to word list\n[ C ] a formal arrangement to meet or visit someone at a particular time and place: an appointment with sb What time is your appointment with the bank manager?an appointment to do sth We have appointments to see several properties.make/arrange/schedule an appointment If they want to see me, tell them to make an appointment.doctor's/dentist's/medical appointment She's had a lot of time off work for medical appointments.\n[ C or U ]\n&#160; HR the act or process of choosing someone for a job: The appointment of a new CEO is the next step in the evolution of the company.sb's appointment as sth His appointment as chairman is likely to be announced this week.sb's appointment to sth Her appointment to the company triggered a wholesale shake-up of the board. The department needs to make several new appointments.\n[ C ]\n&#160; HR someone who is chosen for a job: Some staff believe that Mr King was an unsuitable appointment.\nby appointment\nused to say that something can only be done at an agreed time that must be arranged first: Personal shoppers are available by appointment. Viewings are by appointment only.\nCOMMERCE in the UK, used by businesses to show that their goods and services are sold to the Royal Family, and that they are therefore of good quality: Their packaging identified them as suppliers of meat products \"by appointment to Her Majesty the Queen\". See also\nletter of appointment"}