{"id":17895,"name":"appraise","type":"verb","us_sound":"əˈpreɪz","us_link":"../audio/a/appraise.mp3","uk_sound":"əˈpreɪz","uk_link":"../audio/a/ukappra002.mp3","content":"Add to word list\nAdd to word list\nto examine someone or something in order to judge their qualities, success, or needs: At the end of each teaching practice, trainee teachers are asked to appraise their own performance. In cooperation with other professionals, social workers will appraise the individual's needs. He coolly appraised the situation, deciding which person would be most likely to succeed.\nUS (Uk value) to give a judgment about how much money something might be sold for: The ring was appraised at $40,000.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEstimating value\nRelated word\nappraisee\nAdd to word list\nAdd to word list\nto judge the quality, success, or needs of someone or something: Social workers appraise the needs of each family.\nAppraise also means to judge the worth of something: A professional appraised my jewelry. appraisal noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/əˈpreɪ·zəl/\nI was pleased with the appraisal of my work.\nAdd to word list\nAdd to word list\nto estimate the value, condition, quality, etc. of someone or something after a careful examination: The banks need to develop the skills required to appraise and monitor borrowers in a market economy.appraise sth at/for sth The entire property is appraised at $7.2 million.appraise sth for sth The artwork was appraised for $10 million. The price was more than twice the land's appraised value.\nHR, MANAGEMENT to meet with an employee to discuss their progress, aims, and needs at work: Senior staff appraise their day-to-day work, while mentors are on hand to offer general career advice."}