{"id":18019,"name":"approval","type":"noun","us_sound":"əˈpruː.vəl","us_link":"../audio/a/approval.mp3","uk_sound":"əˈpruː.vəl","uk_link":"../audio/a/ukappra027.mp3","content":"approval noun [U]\n(GOOD OPINION)\nAdd to word list\nAdd to word list\nB2 the feeling of having a positive opinion of someone or something: He showed his approval by smiling broadly. Alan is someone who always needs the approval of other people. Sam always tried hard to win his father's approval.formal Does the wine meet with your approval? (= Do you like the wine?) on approval\nIf you buy something on approval, you can return it without payment if it is not satisfactory: The new manager introduced the practice of shipping items on approval.\nSee more\nMore examplesFewer examplesThe new reforms have not met with considerable public approval.Unfortunately the arrangements did not meet with Lady Margaret's approval.When he came back on stage, the delighted audience were quick to show their approval.She is an anxious little child who is always looking for approval from those around her.It's an impressive design, but it probably won't receive much popular approval.\nSMART Vocabulary: related words and phrases\nApproving & approval\naccepting\naffirmation\napprobate\napprobation\nbe here for someone idiom\nblessing\nbody positive\ncountenance\nhere\nnice\nnice one! idiom\nrelegitimize\nroyal assent\nseal\nseal of approval idiom\nself-affirmation\nthumb\nthumbs up idiom\nvote\nvote something up or down idiom\nSee more results »\napproval noun [U]\n(PERMISSION)\nB2 official permission: The project has now received approval from the government. The teacher gave the student a nod of approval. Synonyms\nacquiescence formal\nagreement (SAME OPINION)\nassent formal\nsay-so (PERMISSION) informal\nMore examplesFewer examplesWe plan to go on Wednesday, subject to your approval.The developers submitted building plans to the council for approval.My plans are ripening - now all I need is official approval.The government has given the proposal its seal of approval.I trust the arrangements will meet with the committee's approval.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\napproval noun [U]\n(AGREEMENT)\nAdd to word list\nAdd to word list\nthe state or condition of having a good opinion of someone or something: She craves the approval of her classmates.\napproval noun [U]\n(PERMISSION)\nan act of officially accepting or allowing something: You’ll need your parents’ approval to take this field trip.\nAdd to word list\nAdd to word list\nofficial permission or agreement for something: get/secure/win approval They want to raise rates, but it will be difficult to secure approval.gain/receive approval The new strategy has yet to receive approval from the board. give (your) approval The IMF is unlikely to give its approval.approval of sth Approval of the loan came after several hours of discussion by the executive board.approval for sth Recent management upheaval and delayed approval for key products have damaged the company.approval from sb The Hong Kong-based businessman needed 75% approval from minority shareholders for his proposed scheme.final/preliminary approval The measure still needs final approval.\non approval\nCOMMERCE if you buy something on approval, you can return it without payment if it is not satisfactory: You can have the goods on approval for 28 days."}