{"id":17974,"name":"approach","type":"verb","us_sound":"əˈproʊtʃ","us_link":"../audio/a/approach.mp3","uk_sound":"əˈprəʊtʃ","uk_link":"../audio/a/ukappra018.mp3","content":"approach verb\n(COME NEAR)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to come near or nearer to something or someone in space, time, quality, or amount: We could just see the train approaching in the distance. If you look out of the window on the left, you'll see that we're now approaching the Eiffel Tower. I see it's approaching lunchtime, so let's take a break. In my opinion, no other composers even begin to approach (= come near in quality to) Mozart. The total amount raised so far is approaching (= almost) $1,000. He's very active for a man approaching 80 (= who is almost 80 years old).\nThesaurus: synonyms, antonyms, and examples\nto come closer in space or timeapproachA stranger approached and asked to have her picture taken with him.come/get closerThe swarm of bees was coming closer and closer. come/get nearerAs she came nearer the building the movement of the crowd became slower.draw closer/nearerThe holidays are drawing closer.come upA stranger came up to me and shook my hand.walk, go, etc. upI went up to him and asked him who he was.\nSee more results »\nMore examplesFewer examplesSlow down as you approach the corner.Under no circumstances should you approach the man.The traffic lights turned green as we approached the junction.With exams approaching, it's a good idea to review your class notes.Sports teaching at the college doesn't even approach the required standard.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\napproach verb\n(DEAL WITH)\nB2 [ T ] to deal with something: I'm not sure how to approach the problem.\nMore examplesFewer examplesWe really ought to approach the problem in a more scientific manner.He approached the task in a very mature and systematic way.It's difficult to know how to approach such a complex situation.The new boss approaches staff discipline much more strictly.My two children have very different ways of approaching things.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nweather\nSee more results »\napproach verb\n(COMMUNICATE)\n[ T ] to speak to, write to, or visit someone in order to do something such as make a request or business agreement: We've just approached the bank for/about a loan. She's been approached by a modelling agency.\nMore examplesFewer examplesThe whole system was corrupt - every official she approached wanted money before helping her.Be careful how you approach her - she's very temperamental.PJH Corporation said it had been approached by two possible suitors who had submitted bids to buy the company.At first, they refused to sign the agreement, but they caved in when they heard another firm was being approached.He was in a snit this morning and I didn't dare approach him.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\napproach noun\n(DEALING WITH)\nB2 [ C ] a way of considering or doing something: Since our research so far has not produced any answers to this problem, we need to adopt a different approach to it. I've just read an interesting book which has a new approach to Shakespeare. Michael is always very logical in his approach.\nThesaurus: synonyms, antonyms, and examples\na feeling or opinion about something or someoneattitudeHis attitude towards authority has often got him into trouble.outlookI wish I could share your positive outlook on life.frame of mindI need to be in the right frame of mind to talk about this.approachIt's time to try a different approach to the problem.viewpointHis viewpoint is his own and does not affect how I think about the issue.point of viewFrom a strictly financial point of view it looks like a positive change.\nSee more results »\nMore examplesFewer examplesThe pilot was asked to slow his approach to the runway.Violent squalls signalled the approach of the hurricane.All approaches to the capital are now under the control of the insurgents.We stood and watched the slow approach of the funeral procession.At the approach of the teacher, she quickly hid her magazine under the desk.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\napproach noun\n(COMING NEAR)\nB2 [ C or U ] the fact of getting nearer in distance or time: The siren signalled the approach of an ambulance. Many kinds of birds fly south at the approach of winter. Please fasten your seat belts, the plane is now making its final approach (in)to (= is coming near to and preparing to land at) Heathrow.\na route that leads to a place: There is a very steep approach to the house.UK We got stuck in a traffic jam on the approach road. the closest/nearest approach to something\nthe most similar thing to something else that is mentioned: That's the nearest approach to an apology you're going to get from Paula.\nSee more\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\narr.\narrival\nbourne\ncheck\nconnection\ndeparture\ndescent\ndestination\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads & routes in general\napproach noun\n(COMMUNICATION)\n[ C ] an act of communicating with another person or group in order to ask for something: The hospital is making approaches to local businesses (= asking them to help) in their bid to raise money. I hear that Everton have made an approach to (= an attempt to make a business arrangement with) Arsenal to buy one of their players.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\napproach verb\n(COME NEAR)\nAdd to word list\nAdd to word list\n[ I/T ] to come nearer to something or someone: [ I ] We could see the train approaching from a distance.\n[ I/T ] If you approach someone, you meet or communicate directly with that person: [ T ] We approached the bank manager about a loan.\napproach verb\n(DEAL WITH)\n[ T ] to deal with something: We should approach this problem logically. approach noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈproʊtʃ/\napproach noun\n(COMING NEAR OR SOON)\n[ C/U ] (of a person or object) the act of coming near to someone or something, or (of an event) the state of being about to happen soon: [ U ] The approach of winter sends many birds flying south.\napproach noun\n(DEALING WITH)\n[ C ] a way of dealing with something: We need to adopt a different approach to the problem.\nAdd to word list\nAdd to word list\na way of doing something: an approach to sth Their positive approach to absence management played a large part in helping the organization return to profitability.a cautious/hands-on/practical approach He is respected for his hands-on approach in recruiting and a tireless work ethic.management/marketing approaches They changed their marketing approaches to include the principles and practices of green marketing.\nan act of communicating with another person or group in order to ask for something: The company said it has already had several approaches that \"may or may not lead to an offer\".receive an approach He had received a very attractive job approach to become group chief executive of a major company.a bid/takeover approach He confirmed that the firm had received takeover approaches from rival investment banks."}