{"id":17909,"name":"appreciated","type":"verb","us_sound":"əˈpriː.ʃi.eɪt","us_link":"../audio/a/appreciate.mp3","uk_sound":"əˈpriː.ʃi.eɪt","uk_link":"../audio/a/ukappra007.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nappreciate\nappreciate verb\n(VALUE)\nB2 to recognize how good someone or something is and to value him, her, or it: There's no point buying him expensive wines - he doesn't appreciate them.\nC2 [ T ] to understand a situation and realize that it is important: We appreciate the need for immediate action. [ + that ] I appreciate that it's a difficult decision for you to make. [ + question word ] I don't think you appreciate how much time I spent preparing this meal. I/we appreciate...\nB2 used when you are thanking someone or showing that you are grateful: We really appreciate all the help you gave us last weekend. [ + -ing verb ] I appreciate your making the effort to come.\nThesaurus: synonyms, antonyms, and examples\nshowing or expressing thanks to someonegratefulI'm grateful for your kindness.appreciativeI'm really appreciative of all the help you've given me.I/we appreciateI really appreciate all the help you've given me.glad ofWe were very glad of some extra help.indebted toI'm indebted to my parents for all their love and support.\nSee more results »\nwould appreciate\nB2 used when you are politely asking for something: I would appreciate it if you could let me know (= please let me know) in advance whether or not you will be coming.\nMore examplesFewer examplesI don't think you quite appreciate the delicacy of the situation.I don't want everyone to know, so if you could keep it to yourself I'd appreciate it.I appreciate your honesty.Any advice that you can give me would be greatly appreciated.She said how much she appreciated the overwhelming generosity of the public in responding to the appeal.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelieved and thankful\nMaking appeals & requests\nappreciate verb\n(INCREASE)\n[ I ] to increase in value: The value of our house has appreciated by 50 percent in the last two years. Our house has appreciated (in value) by 50 percent in the last two years. Opposite\ndepreciate\nSMART Vocabulary: related words and phrases\nPrice increases\naccrual\nadded value\nanti-inflation\nanti-inflationary\nappreciate\nappreciate by something\nappreciate in value\nbull market\ndead cat bounce\ngo through the roof idiom\nhyperinflation\ninflationary\ninflationary spiral\nput something up\nrack\nrack something up\nrebound\nreinflate\nreinflation\nroof\nSee more results »"}