{"id":18003,"name":"appropriate","type":"adjective","us_sound":"əˈproʊ.pri.ət","us_link":"../audio/a/appropriate_01_00.mp3","uk_sound":"əˈprəʊ.pri.ət","uk_link":"../audio/a/ukappra022.mp3","content":"Add to word list\nAdd to word list\nB2 suitable or right for a particular situation or occasion: appropriate footwear for the countryappropriate for Is this film appropriate for small children? I didn't think his comments were very appropriate at the time. Is this an appropriate occasion to discuss finance? Please complete the appropriate parts of this form (= the parts that are right or necessary for your particular situation) and return it as soon as possible. Opposite\ninappropriate\nThesaurus: synonyms, antonyms, and examples\nsuitablesuitableThis film contains language that is not suitable for children.appropriateIs this film appropriate for young children?apt\"Unusual\", yes, that's a very apt description.fittingThe promotion was a fitting reward for all his hard work.\nSee more results »\nMore examplesFewer examplesYou would be well-advised to have the appropriate vaccinations before you go abroad.What would be an appropriate course of action in such a situation?We will provide help whenever you deem it appropriate.Here is a list of possible answers. Please delete as appropriate.The EU has issued guidelines on appropriate levels of pay for part-time manual workers.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\ncorrectly\ncorrectness\ndecent\ndecently\neligibility\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nRelated words\nappropriately\nappropriateness\nappropriate verb [T]\n(TAKE)\nto take something for your own use, usually without permission: He lost his job when he was found to have appropriated some of the company's money.\ndisapproving to take something from a culture and use it as part of your own: As the empire expanded, they eagerly appropriated the artistic styles of neigbouring provinces.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhot-wire\nhousebreaking\njemmy\njimmy\njob\nkleptomania\npiratical\npiratically\nplunder\npoach\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nappropriate verb [T]\n(KEEP MONEY)\nto keep an amount of money to use for a particular purpose: The government have appropriated millions of pounds for the project.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\naside\nbank\nbogart\ncapacitance\ncling\ncling (on) to something\ndump\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nmaintain\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nappropriate adjective\n(CORRECT)\nAdd to word list\nAdd to word list\ncorrect or right for a particular situation or occasion: Punishment should be appropriate to the crime. I don’t have any appropriate clothes. appropriately adverb us\nYour browser doesn't support HTML5 audio\n/əˈproʊ·pri·ət·li/\nThose kids aren’t appropriately dressed for the cold. appropriateness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈproʊ·pri·ət·nəs/\nI wonder about the appropriateness of borrowing money from my brother.\nappropriate verb [T]\n(TAKE)\nto take and use for a purpose: The state appropriated funds for more clinics.\nAppropriate also means to steal: He lost his job after he appropriated some of the company’s money."}