{"id":18009,"name":"appropriation","type":"noun","us_sound":"əˌproʊ.priˈeɪ.ʃən","us_link":"../audio/a/appropriation.mp3","uk_sound":"əˌprəʊ.priˈeɪ.ʃən","uk_link":"../audio/a/ukappra025.mp3","content":"appropriation noun [C or U]\n(TAKING)\nAdd to word list\nAdd to word list\nthe act of taking something for your own use, usually without permission: The author objected to the appropriation of his story by an amateur filmmaker.\nusually disapproving the act of taking something such as an idea, custom, or style from a group or culture that you are not a member of and using it yourself: The emergence of a global culture of hip hop raises issues of racial and cultural appropriation.\nMore examplesFewer examplesTheft is the dishonest appropriation of another person's property.Some argued that the British appropriation of ancient Greek sculptures secured them against neglect and dispersal.The movie was brazen in its appropriation of techniques, situations and set pieces from great older films.The photograph of a blond, blue-eyed woman in a traditional Mexican huipil has drawn the ire of some who see it as an example of cultural appropriation.Questions of authenticity and appropriation have dogged him since he released an album of Gypsy music.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\njoyriding\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoach\nsnaffle\nsnarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nappropriation noun [C or U]\n(SUM OF MONEY)\nformal an amount of money to be used for a particular purpose: The committee approved an appropriation of £10,000. [ often plural ] The foundation was promised a seven percent increase to bring its appropriations to $2.07 billion.\nSMART Vocabulary: related words and phrases\nAmounts of money\nbank\nbounty\nbuck\ncapital\ncircumstance\ncoin\nfisc\nfloat\nholdback\nliving wage\nmeans\nmoney supply\npayout\npool\nsub\nsum\nsurplus\ntrough\nwherewithal\nyour daily bread idiom\nSee more results »\nAdd to word list\nAdd to word list\nan amount of money kept separate to use for a particular purpose, esp. by a government: The city council approved an appropriation of $10,000 to plant trees.\nAdd to word list\nAdd to word list\nFINANCE\n&#160; (also capital appropriation) a sum of money to be used for a particular purpose: an appropriation of $1 million/€5000/£20,000, etc. Campus leaders are seeking an emergency appropriation of roughly $25 million, mostly for repairs to neglected buildings.an appropriation for sth New appropriations for the military would grow only modestly.\nthe act of taking something that belongs to someone else: The demonstrators called on the government to speed up the appropriation of land from large estate owners and hand it over to the poor. The Securities and Futures Authority yesterday expelled a former director of the brokerage for \"dishonest appropriation of client assets\". Compare\nmisappropriation"}