{"id":17979,"name":"approached","type":"verb","us_sound":"əˈproʊtʃ","us_link":"../audio/a/approach.mp3","uk_sound":"əˈprəʊtʃ","uk_link":"../audio/a/ukappra018.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\napproach\napproach verb\n(COME NEAR)\nB1 [ I or T ] to come near or nearer to something or someone in space, time, quality, or amount: We could just see the train approaching in the distance. If you look out of the window on the left, you'll see that we're now approaching the Eiffel Tower. I see it's approaching lunchtime, so let's take a break. In my opinion, no other composers even begin to approach (= come near in quality to) Mozart. The total amount raised so far is approaching (= almost) $1,000. He's very active for a man approaching 80 (= who is almost 80 years old).\nThesaurus: synonyms, antonyms, and examples\nto come closer in space or timeapproachA stranger approached and asked to have her picture taken with him.come/get closerThe swarm of bees was coming closer and closer. come/get nearerAs she came nearer the building the movement of the crowd became slower.draw closer/nearerThe holidays are drawing closer.come upA stranger came up to me and shook my hand.walk, go, etc. upI went up to him and asked him who he was.\nSee more results »\nMore examplesFewer examplesSlow down as you approach the corner.Under no circumstances should you approach the man.The traffic lights turned green as we approached the junction.With exams approaching, it's a good idea to review your class notes.Sports teaching at the college doesn't even approach the required standard.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\napproach verb\n(DEAL WITH)\nB2 [ T ] to deal with something: I'm not sure how to approach the problem.\nMore examplesFewer examplesWe really ought to approach the problem in a more scientific manner.He approached the task in a very mature and systematic way.It's difficult to know how to approach such a complex situation.The new boss approaches staff discipline much more strictly.My two children have very different ways of approaching things.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\napproach verb\n(COMMUNICATE)\n[ T ] to speak to, write to, or visit someone in order to do something such as make a request or business agreement: We've just approached the bank for/about a loan. She's been approached by a modelling agency.\nMore examplesFewer examplesThe whole system was corrupt - every official she approached wanted money before helping her.Be careful how you approach her - she's very temperamental.PJH Corporation said it had been approached by two possible suitors who had submitted bids to buy the company.At first, they refused to sign the agreement, but they caved in when they heard another firm was being approached.He was in a snit this morning and I didn't dare approach him.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nimply\nmake noises idiom\nmaybe\nmove\nmover\nnomination\non the table idiom\nproposition\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nresubmission\ntable\nSee more results »"}