{"id":18037,"name":"approximate","type":"adjective","us_sound":"əˈprɑːk.sə.mət","us_link":"../audio/a/approximate_01_00.mp3","uk_sound":"əˈprɒk.sɪ.mət","uk_link":"../audio/a/ukappro004.mp3","content":"Add to word list\nAdd to word list\nB2 not completely accurate but close: The train's approximate time of arrival is 10.30. The approximate cost will be about $600. Can you give me an approximate idea of the numbers involved?\nThesaurus: synonyms, antonyms, and examples\napproximateapproximateWe can only give an approximate number for dinner until all the invited guests have responded.roughThe number of unregistered voters is 13,000, according to rough estimates.inexactHistorical comparisons are always inexact and often misleading.impreciseSuch estimates are inherently imprecise.\nSee more results »\nMore examplesFewer examplesThe way that the trunk of a tree divides into smaller and smaller branches and twigs is an approximate fractal pattern.You only need to submit a plan with approximate dimensions at this stage.The recipe only gives an approximate cooking time.The following costings for the project are only an approximate guide.We can only give an approximate idea of cost at this stage.\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximately\naround\nat a guess idiom\nexact\nguess\ninexactly\nish\nloosely\nloosey-goosey\nmore\nround\nrule\nsense\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nto be almost the same as: The newspaper reports of the discussion only roughly approximated to (= were not exactly the same as) what was actually said. Student numbers this year are expected to approximate 5,000 (= to be about 5,000).\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\nas much idiom\nconjecture\nconsider\ndeem\ndelusional\ndraw\nfall\nguess\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npluck\npresumptively\npresuppose\nsupposably\nsurmise\nthink of something\nSee more results »\nAdd to word list\nAdd to word list\nalmost exact: Can you tell me the approximate value of this watch? approximately adverb us\nYour browser doesn't support HTML5 audio\n/əˈprɑk·sə·mət·li/\nThe job will take approximately three weeks to do.\nto come near in quality, amount, value, or character: The painting only approximated the mountain landscape. approximation noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˌprɑk·səˈmeɪ·ʃən/\nI only have an approximation of the size of the room.\nAdd to word list\nAdd to word list\nclose to a particular number or time but not exactly that number or time: All numbers are approximate.the approximate amount/cost/number The final resulting figure is the approximate amount for which the home should be insured.\nto be close to a particular number or time but not exactly that number or time: Compound annual earnings growth has approximated 90%.approximate to sth To secure the company, it is having to pay a price approximating to half its present market capitalization."}