{"id":17935,"name":"apprehension","type":"noun","us_sound":"ˌæp.rəˈhen.ʃən","us_link":"../audio/a/apprehension.mp3","uk_sound":"ˌæp.rɪˈhen.ʃən","uk_link":"../audio/a/ukappra012.mp3","content":"apprehension noun [C or U]\n(WORRY)\nAdd to word list\nAdd to word list\nworry about the future, or a fear that something unpleasant is going to happen: It's normal to feel a little apprehension before starting a new job. One or two people have expressed apprehension about the changes. Despite her apprehensions, she accepted the offer.\nMore examplesFewer examplesAs it turned out, my apprehension was groundless.There is apprehension that there may be an adverse effect on the number of patients treated.There was great apprehension among experts over the space mission.Despite progress in assuaging public apprehensions, some uncertainty still hangs over the future of wind power.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nalarm\nangst\nanti-stress\nanxiety\nconsternation\njitters\nnervousness\noppression\noverwork\npanic attack\nperturbation\nstrain\nthe collywobbles\ntizzy\ntrepidation\nuneasiness\nvexation\nyip\nSee more results »\napprehension noun [C or U]\n(CATCHING)\nformal an act of catching and arresting someone who has not obeyed the law: Both the army and the police were involved in the apprehension of the terrorists. The border patrol made over 1 million apprehensions last year.\nMore examplesFewer examplesSeveral organisations cooperated in his apprehension.As to the apprehension of offenders there are two important but sometimes contrasting public interest points.When an individual crosses illegally four times and is apprehended four times, the border patrol records this as four apprehensions.\nSMART Vocabulary: related words and phrases\nArresting & charging\napprehend\narrest\nassist\nattach\nattachment\nbust\nbusted\ncharge sheet\ncollar\nhandcuff\nhandcuffs\nhouse arrest\nknock\nnail\npick someone/something up\npolice action\npost-arrest\nprobable cause\npull\nthe knock at/on the door idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCapturing or taking possession of things\napprehension noun [C or U]\n(UNDERSTANDING)\nformal the act of understanding something, or the way that something is understood: A full apprehension of all that is involved is utterly beyond us.\nMore examplesFewer examplesThe poems are not “about” anything except the intuitive apprehension of how we actually “feel” language. Popular apprehensions of anthropology and anthropologists are interwoven with ideas about the Other.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\nastutely\nat your fingertips idiom\nbear\ncolour\nhandle\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nlatch on\nscale\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nuncomprehending\nunderstanding\nSee more results »\napprehension noun [U]\n(WORRY)\nAdd to word list\nAdd to word list\nanxiety about the future; fear of something unpleasant happening: I felt great apprehension over my first day at work.\napprehension noun [U]\n(TAKING HOLD)\nthe act of catching and putting a person under police control: There’s an $8000 reward for the apprehension of the perpetrators."}