{"id":18022,"name":"approve","type":"verb","us_sound":"əˈpruːv","us_link":"../audio/a/approve.mp3","uk_sound":"əˈpruːv","uk_link":"../audio/a/ukappra028.mp3","content":"approve verb\n(HAVE A GOOD OPINION)\nAdd to word list\nAdd to word list\nB2 [ I ] to have a positive opinion of someone or something: approve of She doesn't approve of my friends. He doesn't approve of smoking. I thoroughly approve of what the government is doing. Opposite\ndisapprove\nMore examplesFewer examplesThey think I'm an old fuddy-duddy because I don't approve of tattoos.The survey showed that 32% of respondents approve, 54% disapprove and the rest are undecided.We are a moral, ethical people and therefore we do not approve of their activities.\"I don't approve of that kind of language, \" she said, pursing her lips.You may not approve of what he did, but he's still your brother.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\napprove verb\n(AGREE)\nB1 [ T ] to accept, allow, or officially agree to something: We had to wait months for the council to approve our plans to extend the house. The court approved the sale of the property.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nMore examplesFewer examplesWhen the time came to approve the proposal, there were one or two voices of dissent.He agreed to the interview, but asked to be allowed to approve the final article.I must tell you in all honesty that there is little chance of the scheme being approved.The suggestion was approved, with 25 votes in favour, and 7 against.The minutes of the last meeting were approved unanimously .\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\napprove verb\n(AGREE WITH)\nAdd to word list\nAdd to word list\n[ I ] to have a good opinion of someone or something: I wish my mother approved of my friends.\napprove verb\n(PERMIT)\n[ T ] to accept or allow something officially: Finally the court approved the sale of the property.\nAdd to word list\nAdd to word list\n[ T ] to accept, allow, or officially agree to something: The measure was approved by the Senate Committee on Local and Municipal Affairs. The aluminum producer could begin recalling workers on Tuesday if the union membership approves the offer.approve the bill/deal/settlement, etc. If shareholders approve the deal, it would be the biggest acquisition by a Mexican company.\napprove of sb/sth\nto have a good opinion of someone or something: Close to 90% of people approve of his handling of the crisis."}