{"id":17913,"name":"appreciation","type":"noun","us_sound":"əˌpriː.ʃiˈeɪ.ʃən","us_link":"../audio/a/appreciation.mp3","uk_sound":"əˌpriː.ʃiˈeɪ.ʃən","uk_link":"../audio/a/ukappra008.mp3","content":"appreciation noun [U]\n(VALUE)\nAdd to word list\nAdd to word list\nB2 the act of recognizing or understanding that something is valuable, important, or as described: in appreciation The crowd cheered in appreciation. Max has no appreciation of the finer things in life.appreciation for Children rarely show any appreciation for what their parents do for them. These flowers are a token of my appreciation for all your help.\nMore examplesFewer examplesI'd like to give this bottle of wine as a mark of appreciation for all the work you've done for us.A line of male dancers gyrated to the music while the audience screamed their appreciation.She was grateful for the help and baked them a cake as a token of her appreciation.He took them to a restaurant to show his appreciation for letting him stay.When O'Connor scored the winner, the home fans roared in appreciation.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nscale\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nappreciation noun [U]\n(INCREASE)\nincrease in price, value, etc.: There has been little appreciation in the value of property recently.\nSMART Vocabulary: related words and phrases\nPrice increases\naccrual\nadded value\nanti-inflation\nanti-inflationary\nappreciate\nappreciate by something\nappreciate in value\nbull market\ndead cat bounce\ngo through the roof idiom\nhyperinflation\ninflationary\ninflationary spiral\nput something up\nrack something up\nrebound\nreinflate\nreinflation\nroof\nshooting\nSee more results »\nappreciation noun [U]\n(VALUE)\nAdd to word list\nAdd to word list\nthe act of recognizing someone's worth as a person or showing that you are grateful for something that person has done: \"I’d just like a little appreciation,\" she sobbed.\nappreciation noun [U]\n(INCREASE)\nan increase in the value of something: New funds are generated by the appreciation of our assets.\nAdd to word list\nAdd to word list\nan increase in value: At 17.55%, the state's house-price appreciation was nearly triple the national rate.appreciation in sth potential appreciation in share price See also\ncapital appreciation"}