{"id":18311,"name":"arabian","type":"adjective","us_sound":"əˈreɪ.bi.ən","us_link":"../audio/a/cdo0123usarab0217.mp3","uk_sound":"əˈreɪ.bi.ən","uk_link":"../audio/a/cdo0123ukarab0407.mp3","content":"Add to word list\nAdd to word list\nfrom or relating to Arabia, a large area of land in West Asia that includes Saudi Arabia, Yemen, Oman, Bahrain, Kuwait, Qatar, and the United Arab Emirates: The desert moon shone in a beautiful Arabian sky. The publisher specializes in Arabian history, travel, and literature. See also\nArabia\nMore examplesFewer examplesThe hotel was was like a fantasy of an Arabian village.They named her Alya, after an Arabian princess.This exhibition of South Arabian art, which is largely unknown in the West, offers many delightful surprises.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: continents & regions of the world\nAfrocentric\nAfrocentrism\namazonian\nAntarctica\nAntipodean\nblack Africa\nCaribbean\nLATAM\nLatin America\nlatitudinal\nlatitudinally\nLevantine\nlongitude\nmeridian\nparallel\npole\nthe Antipodes\nthe prime meridian\nthe South Pole\nthe Tropic of Cancer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCountries, nationalities & continents: nationalities\n(also Arabian horse) a horse from a breed originally from Arabia, with a high tail and a particular shape of head: The famous warriors Alexander the Great, Napoleon, and Genghis Khan are all said to have ridden Arabians. She had in her stables some of the best Arabian horses. Synonym\nArab\nold-fashioned a person from Arabia: Surviving inscriptions show that Roman soldiers posted to Hadrian's wall included Germans, Spaniards, Gauls, Africans, Syrians, and Arabians. His writing has dated badly, as he often portrayed Africans, Arabians, and Asians as evil or comic.\nMore examplesFewer examplesThousands of people watched the Arabians and their riders compete.Of approximately 450,000 horses in the country, 1,000 are Arabians.He raised and trained purebred Arabian horses.\nSMART Vocabulary: related words and phrases\nHorses & similar animals\nArab\nbeast\nbeast of burden idiom\nbronco\nbrood mare\ndonkey\nequine\nfilly\ngelding\nhock\nhoof\nhorse-drawn\nhunter\npalomino\nsire\nstallion\nsteed\nthoroughbred\nwithers\nworking horse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHorse racing\nCountries, nationalities & continents: nationalities"}