{"id":18525,"name":"arbitrary","type":"adjective","us_sound":"ˈɑːr.bə.trer.i","us_link":"../audio/a/eus70301.mp3","uk_sound":"ˈɑː.bɪ.trər.i","uk_link":"../audio/a/ukaquat018.mp3","content":"arbitrary adjective\n(CHANCE)\nAdd to word list\nAdd to word list\nC2 based on chance rather than being planned or based on reason: arbitrary decision-making Did you have a reason for choosing your destination or was it arbitrary?\nThesaurus: synonyms, antonyms, and examples\nhappening by chance with no cause or reasonrandomIt was a random encounter between two long-lost friends.chanceA chance meeting brought them back together.arbitraryIt seems like the decision to cancel such a successful TV programme was completely arbitrary.haphazardHer cabinets were stuffed with a haphazard jumble of books, clothes, tins of soup, and papers.coincidentalAny similarity between the characters in this book and real people, living or dead, is purely coincidental.inadvertentA good editor will catch and correct all inadvertent typos in a text.\nSee more results »\nMore examplesFewer examplesWhy did they cut your job and not mine? It seems to have been purely arbitrary.He played a few arbitrary notes on the piano, to try it out.I thought it was just an arbitrary arrangement of chairs - I didn't realize it was an art exhibit!The garden isn't planned at all - we tend to just plant things in an arbitrary way.The refugees were found during an arbitrary vehicle check at the ferry port.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\neven-money\nfluke\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\narbitrary adjective\n(UNFAIR)\ndisapproving using unlimited personal power without considering other people's rights or wishes: an arbitrary ruler The company has been the subject of an arbitrary take-over.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\nelitism\none-sided\none-sidedly\none-sidedness\none-way\nthe old school tie\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nRelated words\narbitrarily\narbitrariness\nAdd to word list\nAdd to word list\nbased on a desire or idea or chance rather than reason: Her outfit was an arbitrary choice but was just perfect. arbitrarily adverb us\nYour browser doesn't support HTML5 audio\n/ˌɑr·bəˈtreər·ə·li/\nWe didn’t think much about it, just arbitrarily decided to go to Italy. arbitrariness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɑr·bəˈtreər·i·nəs/\ndisapproving The arbitrariness of human nature infuriates me."}