{"id":19037,"name":"archive","type":"noun","us_sound":"ˈɑːr.kaɪv","us_link":"../audio/a/archive.mp3","uk_sound":"ˈɑː.kaɪv","uk_link":"../audio/a/ukarcha030.mp3","content":"Add to word list\nAdd to word list\n(also archives [ plural ]) a collection of historical records relating to a place, organization, or family: archive film/footage/material These old photographs should go in the family archives.\n(also archives [ plural ]) a place where historical records are kept: I've been studying village records in the local archive.\na computer file used to store electronic information or documents that you no longer need to use regularly\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLists and catalogues\nComputer concepts\nto store historical records or documents in an archive\nin computer technology, to store electronic information that you no longer need to use regularly: This software helps firms archive and retrieve emails.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nRelated word\narchival\nAdd to word list\nAdd to word list\nthe documents showing the history of a place, organization, or family, or the place where these are kept: The author’s manuscripts are in the college archives. archival adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɑrˈkɑɪ·vəl/\nI’m doing some archival research on my family’s history.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a collection of records that are no longer used: an archive of financial statements\n[ C ]\n&#160; IT a computer file used to store electronic information or documents that you no longer need to use regularly: Use your e-mail application's archive feature to transfer messages that are older than six months to an archive file.\n[ C ]\n&#160; INTERNET a set of documents and files that are available on the internet for people to look at: An online archive exists with all of those reviews.\nto store old records or documents so that you can access them again in the future: The file was archived about a year ago after a worker wrongly labeled it as inactive.\nIT to store electronic information that you no longer need to use regularly in a special file that uses less space on your computer: In all, 31,000 archived e-mails thought to have been deleted were later uncovered. archiving noun [ U ]\nThe fragility of the discs means they aren't reliable enough for long-term archiving."}