{"id":19023,"name":"architecture","type":"noun","us_sound":"ˈɑːr.kə.tek.tʃɚ","us_link":"../audio/a/architecture.mp3","uk_sound":"ˈɑː.kɪ.tek.tʃər","uk_link":"../audio/a/ukarcha028.mp3","content":"Add to word list\nAdd to word list\nB1 the art and practice of designing and making buildings: to study architecture\nB1 the style in which buildings are made: Roman architecture\nMore examplesFewer examplesModernist architecture tries to conquer nature instead of working with it.This is a prime example of 1930s architecture.Almost every visitor to Edinburgh is seduced by its splendid architecture.The town's modern architecture is very well integrated with the old.I like the clean-cut shapes of classical architecture.\nSMART Vocabulary: related words and phrases\nArchitecture\nanti-modernism\nanti-modernist\narchitect\narchitectural\narchitecturally\ncolonial\ndefensive architecture\ndesign\necotecture\nfloor plan\nLatinization\nLatinize\nLatinized\nmid-century modern\nmodernism\nrococo\nRomanesque\nsympathetically\ntrefoil\nunbuildable\nSee more results »\nAdd to word list\nAdd to word list\nthe art and science of designing and making buildings, or the style of a building: modern/classical/Gothic architecture He studied architecture with Gropius. architectural adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌɑr·kɪˈtek·tʃər·əl/\nFramed architectural drawings hung on the walls of his office.\nAdd to word list\nAdd to word list\nPROPERTY the job or activity of designing buildings: He earned a master's degree in architecture.\nPROPERTY a particular type of building: environmentally sustainable architecture\nIT the design and structure of a computer system, which controls what equipment can be connected to it and what software can operate on it: hardware/software architecture Their software architecture is good and they continue to show good growth.\nthe structure of an organization, which influences the relationship between its parts and employees: He regards this as an opportunity to deliver a radical new departmental architecture. See also\ninformation architecture"}