{"id":19303,"name":"area","type":"noun","us_sound":"ˈer.i.ə","us_link":"../audio/a/area.mp3","uk_sound":"ˈeə.ri.ə","uk_link":"../audio/a/ukarchi015.mp3","content":"area noun\n(PLACE)\nAdd to word list\nAdd to word list\nB1 [ C ] a particular part of a place, piece of land, or country: all areas All areas of the country will have some rain tonight. The area of New York to the south of Houston Street is known as Soho. Houses in the London area (= in and around London) are very expensive.remote area It can be difficult getting supplies to more remote areas. urban/rural areas He's an area manager (= is responsible for business in a particular area) for a computer company. This is a very poor area. Dogs are not allowed in the children's play area. in the area\nnearby: Do you know of any Thai restaurants in the area? I went online to check on house prices in the area.\n[ C ] a particular part of a surface or object: This area of the brain has been linked to making decisions. Click on any blank area of the screen. We apply the cream gently to any painful areas.\nMore examplesFewer examplesThe area depends on agriculture for most of its income.Debris from the aircraft was scattered over a large area.This area of the park has been specially designated for children.Some species exist in this small area of forest and nowhere else on earth.There was more rainfall than usual this summer in the mountain areas.The mouth is one of the areas of the body with the most bacteria.They measured blood flow in the affected area.The floor is very uneven in some areas.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\ndry land\necoregion\nenclosure\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntransect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nWords meaning parts of things\narea noun\n(SUBJECT)\nB2 [ C ] a subject or activity, or a part of it: area of expertise Software is not really my area of expertise.in all areas She's improved her game in all areas. Marketing is Paul's area.\nMore examplesFewer examplesMatters of discipline fall outside my area of responsibility.Electronic publishing is a growth area.The law in this area is very strict and doesn't allow us much room for manoeuvre.OK, this seems to be an area of disagreement, so let's vote on it.The book will encourage research in this very important area.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\narea noun\n(MEASURE)\n[ C or U ] the size of a flat surface calculated by multiplying its length by its width: the area of a rectanglein area Meadow Farm is 50 square kilometres in area.\nSMART Vocabulary: related words and phrases\nMass, area, weight & volume in general\nA3\nA4\nA5\nballast\ndead weight\ndensity\ndisplacement\nexpansivity\nheft\nlegal\nletter\nmass\nnon-dimensional\nspecific gravity\nsquare\ntare\nvolumetric\nweight\nSee more results »\narea noun\n(FOOTBALL)\n[ C usually singular ] →\npenalty area\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurfaces on which sports take place\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdiom\nin the area of\narea noun\n(PLACE)\nAdd to word list\nAdd to word list\n[ C ] a part of the earth’s surface of land and water, or a particular part of a country, city, town, etc.: an industrial/suburban/mountainous area\n[ C ] An area is also a particular part of anything that takes space: This area of the brain is called the cerebral cortex.\narea noun\n(SUBJECT)\n[ C ] a particular subject or activity: His area of expertise includes learning disorders.\narea noun\n(MEASURE)\n[ C/U ]\n&#160; geometry the measure of a flat space or surface: [ C ] You get the area of a rectangle by multiplying its length by its width.\nAdd to word list\nAdd to word list\na particular part of a place, piece of land, or country: This is an area of the city where 48% of the properties are rental properties. Our goal is to grow the total number of jobs in the metropolitan area and to provide the environment for companies to grow and prosper. the reception/kitchen/parking area the packaging/trading area\na subject or activity, or a part of it: Principal growth in the past year has been in the area of new technology in manufacturing and medical settings. He looked continually for ways to expand his startup firm's area of expertise See also\nassisted area\ncatchment area\ndevelopment area\ndollar area\nthe euro area\ngrowth area\nsales area\nwilderness area"}