{"id":19598,"name":"argument","type":"noun","us_sound":"ˈɑːrɡ.jə.mənt","us_link":"../audio/a/argument.mp3","uk_sound":"ˈɑːɡ.jə.mənt","uk_link":"../audio/a/ukarchi027.mp3","content":"argument noun [C or U]\n(DISAGREEMENT)\nAdd to word list\nAdd to word list\nB1 a disagreement, or the process of disagreeing: The children had an argument about/over what game to play. He got into an argument with Jeff in the pub last night. A decision was finally made after some heated argument.\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nMore examplesFewer examplesDon't drag me into your argument! It's nothing to do with me.We were having a friendly argument about Green politics.It was a really nice day, spoilt only by a little argument in the car on the way home.We had a dreadful argument in the restaurant, but he phoned me the next day to apologize.We had an argument with our neighbours, and now they won't even talk to us.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nargument noun [C or U]\n(REASON)\nB2 a reason or reasons why you support or oppose an idea or suggestion, or the process of explaining these reasons: Now that we've heard all the arguments for and against the proposal, let's vote on it. [ + that ] Her husband was not convinced by her argument that they needed a bigger house. I don't think that's a very strong/convincing/powerful argument. The central argument (= main point) of the book is that some of the plays were not written by Shakespeare.\nMore examplesFewer examplesThe essence of his argument was that education should continue throughout life.Could you go over the main points of your argument again, Professor?He is impervious to criticism and rational argument.Students need the ability to construct a logical argument.I'll just summarize the main points of the argument in a few words if I may.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ncase\ndefinition\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\nargument noun [C]\n(IDEAS)\nAdd to word list\nAdd to word list\nliterature the subject matter of a written work and the development of the ideas in it\nAn argument is also a brief summary of a written work\nargument noun [C]\n(REASONS)\nthe reasons for your opinion about the truth of something or an explanation of why you believe something should be done: A good argument can be made for providing health insurance for all children.\nlaw An argument is a lawyer’s representation of a case in a court of law.\nargument noun [C]\n(DISAGREEMENT)\na strong and sometimes angry disagreement in talking or discussing something: I had an argument with my boss."}