{"id":19736,"name":"arise","type":"verb","us_sound":"əˈraɪz","us_link":"../audio/a/arise.mp3","uk_sound":"əˈraɪz","uk_link":"../audio/a/ukargyb006.mp3","content":"arise verb [I]\n(HAPPEN)\nAdd to word list\nAdd to word list\nC1 formal to start to happen or exist: opportunity arise If the opportunity arises, I'd love to go to China. Problems arise when the payment is late. He died of complications arising from heart surgery.\nThesaurus: synonyms, antonyms, and examples\nto begin to (make something) happenstartHurry up – the film has already started.beginThe ceremony is about to begin.commenceThe meeting commenced with a moment of silence.openThe meeting opened with a short word of welcome to new members.originateThe idea for the business originated with my grandmother's recipes.\nSee more results »\nshould the need arise\n(also if the need arises) if it is necessary: Could you work on Saturday, should the need arise? We can always rent a car, should the need arise. I will help you should the need arise. They are prepared to make a higher bid if the need arises. Production can be increased quickly if the need arises. See also\nmatters arising formal\nMore examplesFewer examplesThe question soon arises: who is to blame for all this?An occasion may arise when you can use your knowledge of French.An unforeseen difficulty has arisen.His reputation for carelessness was established long before the latest problems arose.If a conflict arose between his faith and his constitutional duty, he should resign.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattendant\nbe at work idiom\neventuate\nfall\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEssential or necessary\narise verb [I]\n(GET UP)\nliterary to get out of bed: We arose early on Christmas morning.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nshinny\nunscalable\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: not sleeping & not unconscious\nGrammar\nArise or rise?Arise means ‘happen’ or ‘occur’. We use it with abstract nouns (e.g. problem). The three forms of arise are arise, arose, arisen. It is used in formal contexts: …\narise verb [I]\n(HAPPEN)\nAdd to word list\nAdd to word list\nto come into existence or begin to be noticed; happen: Problems arise when kids leave school. When the opportunity arose, he decided to take it.\narise verb [I]\n(GET UP)\nfml to get up, esp. from bed after sleeping: We arose early on Saturday morning."}