{"id":19867,"name":"arm","type":"noun","us_sound":"ɑːrm","us_link":"../audio/a/arm.mp3","uk_sound":"ɑːm","uk_link":"../audio/a/ukargyb018.mp3","content":"arm noun\n(BODY PART)\nAdd to word list\nAdd to word list\nA1 [ C ] either of the two long parts of the upper body that are attached to the shoulders and have the hands at the end: hold sb in your arms He held her in his arms (= held her closely).throw your arms around She threw her arms around me and gave me a hug. My arms ache from carrying this bag.\nmheim3011/iStock/Getty Images Plus/GettyImages\nC2 [ C ] The arm of a piece of clothing or furniture is a part of it that you put your arm in or on: the arm of a jacket the arm of a chair arm in arm\nC2 When two people are arm in arm, they both have one arm bent at the elbow and passing around and supporting, or being supported by, the arm of the other person: We walked arm in arm along the river bank.\nSee more on your arm\nIf you have someone on your arm at an event, they go to the event with you as your friend or romantic partner: Bill arrived at the party with his new girlfriend on his arm.\nSee more\nMore examplesFewer examplesHer arm was bandaged from the elbow to the fingers.Without saying a word, she took hold of my arm and marched me off to the headmaster's office.He put his arm around her shoulder protectively.He ran up to her, his arms outstretched.She sat back in her chair and wrapped her arms around her knees.\nSMART Vocabulary: related words and phrases\nThe arm\nacromial\nacromioclavicular\nacromion\nalar\nanconeus\nappendage\ncubital\nelbow\nglenohumeral\nglenoid\ninfraglenoid\ninfraspinatous\nsupraclavicular\nsupraglenoid\nsuprascapular\nsupraspinatous\nsupraspinatus\ntriceps\nulna\nunderarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of clothes\nChairs & seats\narm noun\n(WEAPONS)\narms [ plural ]\nweapons and equipment used to kill and injure people: They have been charged with supplying arms to the guerrillas.\nSee more lay down your arms (also lay down arms)\nto stop fighting: The minister has called on the terrorists to lay down their arms.\nSee more take up arms formal or literary\nto prepare to fight or to start fighting: They are willing to take up arms if they have to.\nSee more\narm noun\n(MACHINE PART)\n[ C ] a long, moving part of a machine or piece of equipment: In both videodisc players and record players an arm moves back and forth across the disc. a robotic/robot arm\nMore examplesFewer examplesThey use large X-ray machines on radial arms that can be positioned easily over the animal's body.When a compulsive gambler pulls the slot machine arm, he or she experiences a rush of endorphins that give a feeling of pleasure.The fuel filler door is opened by a robotic arm.They built the robot arms for the space shuttle.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nSee more results »\narm noun\n(OF LAND/WATER)\n[ C ] An arm of land or water is a long, thin part of it that is joined to a larger area.\nSMART Vocabulary: related words and phrases\nBays & gulfs\nbasin\nbay\nchannel\ncove\ngulf\nHudson Bay\ninlet\nlagoon\nnarrows\nsea coast\nsound\nstrait\nthe Bay of Bengal\nthe Bay of Fundy\nthe Gulf of Mexico\nthe Persian Gulf\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: promontories & peninsulas\narm noun\n(OF ORGANIZATION)\n[ C ] An arm of an organization is a part of it that is responsible for a particular activity or place: The British company is one arm of a large multinational.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\narm noun\n(THROWING ABILITY)\nIf you say that a sports player has a good arm, you mean that they can throw the ball very hard or throw it a very long way: A lot of our fielders have great arms. This guy has one of the best arms in baseball.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nThrowing\nIdioms\nan arm and a leg\nkeep someone at arm's length\nunder arms\nbe up in arms\n[ I or T ] to provide yourself or others with a weapon or weapons: Nobody knows who is arming the terrorists.arm sb with sth I armed myself with a baseball bat and went to investigate the noise. They are currently arming for war. Opposite\ndisarm\nC2 [ T ] to provide yourself or others with equipment or knowledge in order to complete a particular task: arm someone with something I went to the meeting armed with the relevant facts and figures. She armed herself for the interview by finding out all she could about the company in advance.\nMore examplesFewer examplesThe police have to arm themselves against attack.In arming the dictator, the US was creating a Frankenstein who would threaten their influence in the region.Rioters armed with firebombs set light to police barricades.If he's not armed, don't shoot.War seemed inevitable and both sides were arming in preparation.\nSMART Vocabulary: related words and phrases\nProviding weapons or taking weapons away\nair bridge\nair corridor\narm someone with something\narmament\narmed\ndenuclearization\ndenuclearize\ndisarm\ndisarmament\ngun control\npeace dividend\nrearm\nrearmament\nrecommission\nreinforce\nreinforced\nremilitarization\nunarmed\nunder arms idiom\nwith your bare hands idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\narm noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\neither of the two long parts of the upper body that are joined to the shoulders and have hands at the end: Her arm was bandaged from elbow to wrist. He held his young son in his arms (= closely).\nThe arm of a piece of clothing or furniture is a part of it that you put your arm in or on: the arm of a jacket/chair\nAn arm of an organization is a part of it with particular responsibilities: the company's investment banking arm Idioms\narm in arm\nat arm’s length\narm verb [T]\n(PROVIDE WEAPONS)\nto provide yourself or others with a weapon or weapons: He armed himself with a baseball bat before going outside.\nAdd to word list\nAdd to word list\nadjustable rate mortgage: a loan for buying a house in which the interest rate can change: ARM loans\na part of a large company or organization that is responsible for a particular activity or place: A loss on the sale of its outdoor advertising arm pre-tax profits. The German arm accounted for about 40% of materials handling. The new constitution has strengthened the legislative arm of government."}