{"id":19928,"name":"army","type":"noun","us_sound":"ˈɑːr.mi","us_link":"../audio/a/army.mp3","uk_sound":"ˈɑː.mi","uk_link":"../audio/a/ukarmho008.mp3","content":"the army [ + sing/pl verb ]\nAdd to word list\nAdd to word list\nB1 a particular country's fighting force: When did you join the army? He has decided on a career in the British Army. The army was/were called out to enforce the curfew.\nMore examplesFewer examplesThe army recaptured the town from the rebels.He served in the army in India for 20 years.They're calling on all men and boys over the age of 14 to join the army.\"Have you been in the army for a long time?\" \"I joined up as soon as I'd left school.\"They fought fearlessly against the invading armies.\nB1 [ C ] a military force that has the training and equipment to fight on land: Both the armies suffered heavy losses in the battle. The minister is believed to have been killed by the rebel army.\nC2 [ C usually singular ] a large group of people who are involved in a particular activity: She brought an army of supporters with her.\n[ C usually singular ] informal the supporters of a football team, especially ones who travel to games in different towns, cities, or countries: Scotland's 1 - 0 victory over France gave the Tartan Army something to celebrate.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmilitary\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nFootball/soccer\nAdd to word list\nAdd to word list\na military force, usually belonging to a country, that has the training and equipment to fight on land: She decided to join the army.\nAn army is also any large group: An army of bystanders watched the film crew work."}