{"id":20109,"name":"around","type":"preposition","us_sound":"əˈraʊnd","us_link":"../audio/a/around.mp3","uk_sound":"əˈraʊnd","uk_link":"../audio/a/ukarmho014.mp3","content":"around preposition, adverb\n(SURROUNDING OR TURNING)\nAdd to word list\nAdd to word list\nA2 in a position or direction surrounding, or in a direction going along the edge of or from one part to another (of): We sat around the table. He put his arm around her. A crowd had gathered around the scene of the accident. She had a scarf around her neck. The moon goes around the earth. I walked around the side of the building. The children were dancing around the room. I spent a year travelling around Africa and Asia. The museum's collection includes works of art from all around the world. She passed a plate of biscuits around (= from one person to another). This virus has been going around (= from one person to another).\nin order to face in the opposite direction: As the bus left, she turned around and waved goodbye to us. I spun around to see who was behind me.\nMore examplesFewer examplesThe snake coiled itself tightly around the deer.People clustered around the noticeboard to read the exam results.She drew her coat tightly around her shoulders.She flung her arms around his neck.The cathedral dominates the landscape for miles around.He turned his chair around to face the screen.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRevolving, rotating and spinning\naround preposition, adverb\n(IN THIS PLACE)\nA2 positioned or moving in or near a place, often without a clear direction, purpose, or order: He always leaves his clothes lying around (on the floor). She went into town and spent two hours just walking around. Let's take the children to the park so they can run around for a while.\nin the place where you are; near where you are: I used to live around here. She's never around when you need her. Will you be around next week? She likes to sing loudly to herself when there's no one around.\nexisting or available in a place: There's a lot of flu going around my office at the moment. Smartphones have been around for quite a while.\nMore examplesFewer examplesWhile she waited, she walked aimlessly around the car park.A wasp came towards us and Howard started waving his arms around.She gathered up the newspapers that were scattered around the floor.If your sister's around, bring her too.Don't walk around outside in your bare feet.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\nback onto something\ndirection\nfar\nforward\nhind\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\norientated\nposition\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nActing, being or existing together\naround preposition, adverb\n(RELATING TO)\nrelating to something: The conference was dominated by issues around national security. The goal is to create some serious discussion around a very serious problem.\nMore examplesFewer examplesIssues around race, ethnicity and empire have developed as an important strand of thinking about history.This blog features some of my thoughts around food and the city's restaurant scene.There seems to be a moral panic around swearing and so-called bad language.The manager said he was confident that the strong feelings around the incident would soon die down.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\nas\nas to idiom\ncover\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nre\nrelate\nsay\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinking and relating\nGrammar\nAround or round?Around and round are prepositions or adverbs. We use around and round when we refer to movements in circles or from one place to another. Around and round can both be used. Around is more common in American English. Round is a little more common in speaking: …\nIdioms\naround and around\nthe right/wrong/other way around\nthe other way around\naround adverb\n(APPROXIMATELY)\nA2 approximately: around six feet tall around two months ago around four o'clock She earns around $40,000 a year. Synonyms\nabout (APPROXIMATELY)\napproximately\nThesaurus: synonyms, antonyms, and examples\napproximatelyapproximatelyHe makes approximately $60,000 a year. aboutThe job will take about three months.aroundI will be there around four o'clock.roughlyThere were roughly 200 people at the meeting.or soThey raised £200 or so for charity.\nSee more results »\nMore examplesFewer examplesThe first election results are expected around 1 a.m.The temperature is usually around 20 degrees C at this time of year.This dish only takes around 15 minutes to prepare.He said that he had seen the man leaving the building around the time of the murder.Tickets for such events will typically cost around 30 dollars.\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximate\napproximately\nat a guess idiom\nexact\nguess\ninexactly\nish\nloosely\nloosey-goosey\nmore\nround\nrule\nsense\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nGrammar\nApproximations (around four o’clock)When we speak, we often try not to be too exact or factual because it can sound very direct. As a result, we add expressions to make what we say more approximate or vague. …\nAround or round?Around and round are prepositions or adverbs. We use around and round when we refer to movements in circles or from one place to another. Around and round can both be used. Around is more common in American English. Round is a little more common in speaking: …\naround preposition, adverb [not gradable]\n(IN THIS DIRECTION)\nAdd to word list\nAdd to word list\nin a position or direction surrounding, along the outside of, or from one part of to another: We sat around the table. Go around to the back of the house and come in through the kitchen. We drove around town for a while, looking for a place to park. She turned around (= so that she was facing in the opposite direction) and waved goodbye. fig. He built his story around the theme of spiritual loneliness.\naround preposition, adverb [not gradable]\n(TO ALL PARTS)\nin or to many parts of or all directions: Car phones are common all around the country. People came from miles around. Idioms\naround and around\naround the clock\n(right/just) around the corner\naround adjective, adverb\n(HERE/NEAR)\npositioned or moving in or near a place: I used to live around here. Will you guys be around next week?\naround adverb\n(APPROXIMATELY)\nabout; approximately: Around 40 people showed up. He arrived in Kansas City around 1984."}