{"id":20181,"name":"arranging","type":"verb","us_sound":"əˈreɪndʒ","us_link":"../audio/a/arrange.mp3","uk_sound":"əˈreɪndʒ","uk_link":"../audio/a/ukarmho023.mp3","content":"Add to word list\nAdd to word list\npresent participle of\narrange\narrange verb\n(PLAN)\nB1 [ I or T ] to plan, prepare for, or organize something: I'm trying to arrange my work so that I can have a couple of days off next week. The meeting has been arranged for Wednesday. [ + to infinitive ] They arranged to have dinner the following month. I've already arranged with him to meet at the cinema. She's arranged for her son to have swimming lessons. [ + that ] I'd deliberately arranged that they should arrive at the same time. [ + question word ] We haven't yet arranged when to meet.\nMore examplesFewer examplesMy secretary will phone you to arrange a meeting.The company will arrange transport from the airport.I've specially arranged my trip so that I'll be home on Friday evening.We've arranged to stay overnight at my sister's house.They tried to arrange a ceremony with as little fuss as possible.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\narrange verb\n(PUT IN POSITION)\nB2 [ T ] to put a group of objects in a particular order: She arranged her birthday cards along the shelf. Who arranged these flowers so beautifully? His books are neatly arranged in alphabetical order.\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesI'll have to do some thinking about how best to arrange the books.The desks were arranged in rows of ten.I've arranged the pictures of the animals alphabetically from aardvark to zebra.I've arranged the books alphabetically so don't muddle them up.We arranged the chairs in a semicircle.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\narrange verb\n(MUSIC)\n[ T ] to make changes to a piece of music so that it can be played in a different way, for example by a particular instrument: Beethoven's fifth symphony has been arranged for the piano.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nRelated word\narranger"}