{"id":20176,"name":"arrangement","type":"noun","us_sound":"əˈreɪndʒ.mənt","us_link":"../audio/a/eus70314.mp3","uk_sound":"əˈreɪndʒ.mənt","uk_link":"../audio/a/ukarmho024.mp3","content":"arrangement noun\n(PLAN)\nAdd to word list\nAdd to word list\nB1 [ C usually plural ] a plan for how something will happen: make arrangements They'd made all the arrangements for the party. [ + to infinitive ] Arrangements were made to move the prisoners to another jail. What are your current childcare arrangements?\nB2 [ C or U ] an agreement between two people or groups about how something happens or will happen: come to an arrangement I'm sure we can come to an arrangement (= reach an agreement).have an arrangement We had an arrangement - he would clean the house and I would cook. You can only withdraw money from this account by prior arrangement (= after making plans to do so) with the bank.\nMore examplesFewer examplesHe has some special arrangement with his supplier, which means he's able to sell his goods more cheaply.The organizers failed to make the necessary arrangements for dealing with so many people.Seeing that he wasn't happy with the arrangements, I tried to book a different hotel.I'm a bit confused about the arrangements for tonight.All the travel arrangements have been taken care of.\nSMART Vocabulary: related words and phrases\nPlans and arrangements\naccommodation\nappointed\narranger\nbackstop\nblueprint\nbook something in\ncounter-tactic\ndesign\ndone\nexit strategy\nformulation\nnon-programme\npackage deal\nparty line\nplan of action\nplanning\npolicy\npolicy-maker\npreparation\nwalk-in\nSee more results »\narrangement noun\n(POSITION)\nB2 [ C ] a group of objects that have been put in a particular order or position: There was a striking arrangement of dried flowers on the table.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narranger\nbinomial\nbracket\nconcordance\nmacrocosm\nmisclassification\nmisclassify\nmiscode\nmislabel\nmisorder\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\narrangement noun\n(MUSIC)\n[ C ] a piece of music that has had changes made to it so that it can be played in a different way, especially by different instruments: This new arrangement of the piece is for saxophone and piano.\nSMART Vocabulary: related words and phrases\nMusical pieces\nballade\nbolero\nbossa nova\nBritannia\ncantata\nchorus\nfantasia\nhook\nmedley\nmelody\nmulti-part\nnocturne\noctet\nopus\nreel\nsextet\nsignature tune\nsolo\nsong form\nstreetscape\nSee more results »\narrangement noun [C]\n(WRITING MUSIC)\nAdd to word list\nAdd to word list\na plan for how the parts of a piece of music can be played by a particular instrument or instruments: an arrangement for trumpet and cello\narrangement noun [C]\n(POSITION)\na particular way in which things are put together or placed: a flower arrangement\narrangement noun [C]\n(PLAN)\na plan or preparation for something, esp. for something to happen in a particular way: She had an arrangement to work at home two days a week. Since the hotel was full, we had to make other arrangements.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a plan or preparation for how something will happen: make an arrangement There wasn't enough time for him to make alternative arrangements.arrangement (for sb) to do sth Some people have very complicated arrangements to avoid paying tax. funeral/travel arrangements\n[ C or U ]\n&#160; COMMERCE a formal agreement between two companies, groups, or people, which provides an advantage to each: This is a mutually beneficial arrangement for both companies. distribution/marketing/purchasing/supply arrangementarrangement with sb In the company's attempts to cut costs it has ended its arrangement with its biggest supplier.\n[ C, usually singular ]\n&#160; FINANCE a formal agreement that allows someone who is having difficulty paying a debt to pay it back over a longer period of time or to pay back only a part of the total amount See also\ndeed of arrangement\nscheme of arrangement\nvoluntary arrangement"}