{"id":20173,"name":"arrange","type":"verb","us_sound":"əˈreɪndʒ","us_link":"../audio/a/arrange.mp3","uk_sound":"əˈreɪndʒ","uk_link":"../audio/a/ukarmho023.mp3","content":"arrange verb\n(PLAN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to plan, prepare for, or organize something: I'm trying to arrange my work so that I can have a couple of days off next week.arrange something for something The meeting has been arranged for Wednesday.arrange for She's arranged for her son to have swimming lessons.arrange with I've already arranged with him to meet at the cinema. [ + to infinitive ] They arranged to have dinner the following month. [ + that ] I'd deliberately arranged that they should arrive at the same time. [ + question word ] We haven't yet arranged when to meet.\nMore examplesFewer examplesMy secretary will phone you to arrange a meeting.The company will arrange transport from the airport.I've specially arranged my trip so that I'll be home on Friday evening.We've arranged to stay overnight at my sister's house.They tried to arrange a ceremony with as little fuss as possible.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nin someone's crosshairs idiom\nplanner\nprovision\npurpose\npurposefully\npurposely\nput the cart before the horse idiom\nput their heads together idiom\nsettle\nsleeve\nSee more results »\narrange verb\n(PUT IN POSITION)\nB2 [ T ] to put a group of objects in a particular order: She arranged her birthday cards along the shelf. Who arranged these flowers so beautifully? His books are neatly arranged in alphabetical order.\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesI'll have to do some thinking about how best to arrange the books.The desks were arranged in rows of ten.I've arranged the pictures of the animals alphabetically from aardvark to zebra.I've arranged the books alphabetically so don't muddle them up.We arranged the chairs in a semicircle.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrangement\narranger\nbinomial\nbracket\nconcordance\nmacrocosm\nmisclassification\nmisclassify\nmiscode\nmislabel\nmisorder\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\narrange verb\n(MUSIC)\n[ T ] to make changes to a piece of music so that it can be played in a different way, for example by a particular instrument: Beethoven's fifth symphony has been arranged for the piano.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nRelated word\narranger\narrange verb\n(PLAN)\nAdd to word list\nAdd to word list\n[ I/T ] to plan or make preparations for something or for something to happen: [ T ] He arranged a meeting between the two leaders. [ + to infinitive ] My friends arranged to eat with me. [ I ] Shelly arranged for the publication of her thesis.\narrange verb\n(PUT IN POSITION)\n[ T ] to put something in a particular order: We arranged the chairs in a circle. Books should be arranged alphabetically by author.\narrange verb\n(WRITE MUSIC)\n[ T ] to write the parts of a piece of music so that it can be played by a particular instrument or instruments\narranger noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈreɪn·dʒər/\nEllington was a composer, arranger, and pianist.\nAdd to word list\nAdd to word list\nto plan, prepare, or organize something: The outing was arranged by the firm as part of a team-building exercise.arrange an appointment/loan/meeting, etc. Industry leaders hastily arranged a meeting with city officials.arrange for sth The bank arranged for the sale of $1.2 billion of consumer loans.arrange for sb to do sth We can also arrange for you to receive specialist tax advice.arrange to do sth Clients can arrange to discuss their finances at any time."}