{"id":20281,"name":"arrive","type":"verb","us_sound":"əˈraɪv","us_link":"../audio/a/arrive.mp3","uk_sound":"əˈraɪv","uk_link":"../audio/a/ukarriv002.mp3","content":"arrive verb [I]\n(REACH)\nAdd to word list\nAdd to word list\nA2 to reach a place, especially at the end of a journey: What time will your train arrive? It was dark by the time we arrived at the station. We arrived in Prague later that day. I arrived back to find that my room had been burgled. What time does the mail usually arrive (= is it delivered)? I ordered some CDs over a month ago, but they still haven't arrived (= I have not received them).\nThesaurus: synonyms, antonyms, and examples\nto arrive at a placearriveAfter a long day's travel, we finally arrived.get What time did you get there?reachWe won't reach Miami until evening.makeWe made it to the airport just in time for our flight.get inThe train gets in at 6:40 p.m.turn upShe turned up at my house late one night.\nSee more results »\nMore examplesFewer examplesWe didn't arrive at our hotel until after midnight.An excited crowd waited for the singer to arrive.Try and get some sleep on the plane, then you'll arrive feeling fresh.What time does the flight from Amsterdam arrive?She's not a very organized person and she always arrives late at meetings.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\narrive verb [I]\n(BEGIN)\nto happen or start to exist: The leaves starting to turn brown is a sign that autumn has arrived.\nThesaurus: synonyms, antonyms, and examples\nto begin to (make something) happenstartHurry up – the film has already started.beginThe ceremony is about to begin.commenceThe meeting commenced with a moment of silence.openThe meeting opened with a short word of welcome to new members.originateThe idea for the business originated with my grandmother's recipes.\nSee more results »\nIf a baby arrives, it is born: Their baby Olivia arrived on the date she was expected.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStages of life\nObstetrics: birth\nGrammar\nArriveWe use the verb arrive with at or in to talk about ‘coming to’, ‘getting to’ or ‘reaching’ a place where a journey ends. If we see the destination as a point, we say arrive at. If we see it as a larger area, we say arrive in: …\nIdiom\nto have arrivedPhrasal verb\narrive at something\nAdd to word list\nAdd to word list\nto come to a place, esp. after traveling: What time is their plane scheduled to arrive?\nIf someone or something arrives, it appears: Sausages suddenly arrived on our table.\ninfml Someone who has arrived has become successful: When they sent a limo for us, I knew we’d arrived. Phrasal verb\narrive at something"}