{"id":20278,"name":"arrival","type":"noun","us_sound":"əˈraɪ.vəl","us_link":"../audio/a/arrival.mp3","uk_sound":"əˈraɪ.vəl","uk_link":"../audio/a/ukarriv001.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] the fact of arriving somewhere: Hundreds gathered to await the boxer's arrival at the airport. On arrival at the police station, they were taken to an interview room. We regret the late arrival of Flight 237. New arrivals (= people who have just come to a place) were being housed in refugee camps. Sue and Michael are delighted to announce the arrival (= birth) of Emily, born on 21 August. The arrival (= introduction) of satellite television changed the face of broadcasting.\n[ C ] informal a baby that has recently been born: Their new arrival was keeping them busy.\nMore examplesFewer examplesHis arrival caused quite a commotion.The motorcyclist was dead on arrival at the hospital.After the arrival of the United Nations soldiers, tension in the area began to ease.The usual hoopla surrounded the arrival of the pop star.The train's approximate time of arrival is 10.30.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\nbourne\ncheck\ncheck in\nconnection\ndescent\nentry\neta\ngain admittance\ngoing\ngold rush\ninvasion\nlandfall\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChildren & babies\nAdd to word list\nAdd to word list\nthe act of someone or something that reaches a place or comes into existence, or a person or thing that reaches a place: [ U ] The arrival of the railroad changed the western US. [ U ] The arrival of the new year was greeted with joy. [ C ] There were so many refugees that tents were needed to house new arrivals.\nAdd to word list\nAdd to word list\n[ C or U ] the act of coming to a place: Two hours after the arrival of 500,000 newspapers, they are sorted into bundles for 2,000 newsagents.\n[ C ] a person or thing that comes to a place: For the month of July, the airport ranked 27th among 32 nationally in on-time arrivals. An older student was chosen to show the new arrivals around.\n[ S ]\n&#160; WORKPLACE an occasion when someone starts a new job: With the arrival of a new chief executive in July, there will be a refocusing of the business into a more cohesive unit.\n[ S ]\n&#160; MARKETING the introduction of something new such as a product or service: With moves towards the Internet-on-TV model and the arrival of universal broadband access, things are changing.\narrivals\nTRANSPORT the area of an airport that deals with passengers that have just arrived: You will need to show your passport when you get to arrivals."}