{"id":20450,"name":"art","type":"noun","us_sound":"ɑːrt","us_link":"../audio/a/art.mp3","uk_sound":"ɑːt","uk_link":"../audio/a/ukarriv017.mp3","content":"art noun\n(EXPRESSION)\nAdd to word list\nAdd to word list\nA2 [ U ] the making of objects, images, music, etc. that are beautiful or that express feelings: Can television and pop music really be considered art? I enjoyed the ballet, but it wasn't really great art.\nThesaurus: synonyms, antonyms, and examples\nartartI took a course on art in the 20th centurythe artsThe arts are vitally important to our city.fine artsDesign and fine arts are inextricably linked.fine artFine art can fetch quite a lot of money at auction.craftKnitting and weaving are popular crafts.arts and craftsThere are numerous evening classes where you can study arts and crafts.\nSee more results »\nA2 [ U ] the activity of painting, drawing, and making sculpture: Art and English were my best subjects at school. an art teacher\nA2 [ U ] paintings, drawings, and sculptures: The gallery has an excellent collection of modern art. an exhibition of Native American art Peggy Guggenheim was one of the 20th century's great art collectors. The Frick is an art gallery in New York.\nB2 [ C ] an activity through which people express particular ideas: Drama is an art that is traditionally performed in a theatre. Do you regard film as entertainment or as an art? She is doing a course in the performing arts. the arts\nthe making or showing or performance of painting, acting, dancing, and music: More government money is needed for the arts.\nSee more\nMore examplesFewer examplesI know enough about art to recognize a masterpiece when I see one.We went to a lecture on Italian art.He gave a talk on the representation of women in 19th-century art.He's an expert on 15th-century Italian art.He is skilled in the art of public debate.\nSMART Vocabulary: related words and phrases\nThe visual arts in general\nartist\nartistic\nartistically\ncanon\ncanonical\nfine art\ngolden ratio\ngraphic\ngraphic design\nland art\nmixed media\nnon-photographic\nopus\noriginal\npictorial\npictorially\nthe visual arts\ntreasure\nuncanonical\nwork of art\nSee more results »\nart noun\n(NOT SCIENCE)\narts C1 [ plural ]\nsubjects, such as history, languages, and literature, that are not scientific subjects: At school I was quite good at arts, but hopeless at science.\nSee more\nart noun\n(SKILL)\nC1 [ C ] a skill or special ability: the art of conversation Getting him to go out is quite an art (= needs special skill).\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nforte\nfunctional skills\nfunctioning\ngenius\ngift\npolish\nprestidigitation\nproficiency\nprowess\npyrotechnic\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nin the past, the second person singular of the present tense of \"be\": thou art (= you are)\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nbare infinitive\nbent\ncontinuous\ndangling participle\ngerund\ninfinitive\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npluperfect\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForms of the English language\nAdd to word list\nAdd to word list\nthe making or doing of something whose purpose is to bring pleasure to people through their enjoyment of what is beautiful and interesting, or things often made for this purpose, such as paintings, drawings, or sculptures: ancient/modern art American/French/Japanese art an art museum/gallery\nAn art is also a skill or ability: He never learned the art of saying \"Thank you.\""}