{"id":20755,"name":"artist","type":"noun","us_sound":"ˈɑːr.t̬ɪst","us_link":"../audio/a/artist.mp3","uk_sound":"ˈɑː.tɪst","uk_link":"../audio/a/ukartic015.mp3","content":"Add to word list\nAdd to word list\nA2 someone who paints, draws, or makes sculptures: Monet is one of my favourite artists. The artist painted this picture using tiny brushstrokes.\nThesaurus: synonyms, antonyms, and examples\nan artistartistMost attention has been given to male artists and writers.craftsmanThis rug was woven by a local craftsman.craftswomanI like buying pottery from the craftswomen at the fair.artisanLocal artisans sell their pottery and blankets on the street.\nSee more results »\nsomeone who performs music: The festival has an amazing line-up of both new and established artists. She is a musical artist who has sold millions of records.\nsomeone who creates things with great skill and imagination: He described her as one of the greatest film artists of the 20th century. In the kitchen, he is an artist.\nMore examplesFewer examplesIn 15th-century Italy, artists rediscovered the rules of perspective.A good artist can produce a very realistic effect using only light and shade.All these pictures were painted by local artists.I am grateful for artists like Gwen for putting out such great dance music.Even if you thought he might have gone too mainstream, he remains one of the most provocative pop artists on the planet. She won Best New Artist at the American Music Awards.\"I would be honoured to work with such an artist,\" she said of the director.She is more than a designer, she is an artist.\nSMART Vocabulary: related words and phrases\nArtists\nagent\nanti-modernist\ncalligrapher\ncaricaturist\ndraughtsman\ndraughtswoman\netcher\nexpressionist\ngraphic designer\nmaximalist\nminimalist\nmodernist\nmosaicist\npainter\nsidewalk artist\nsketcher\nstructuralist\nsuperagent\nsurrealist\nthe avant-garde\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe visual arts in general\nMusicians\nTraders & entrepreneurs\nExperts and specialists\nAdd to word list\nAdd to word list\na person who paints, draws, or makes sculptures\nAn artist is also an actor, musician, dancer, or other performer."}