{"id":20679,"name":"article","type":"noun","us_sound":"ˈɑːr.t̬ɪ.kəl","us_link":"../audio/a/eus70319.mp3","uk_sound":"ˈɑː.tɪ.kəl","uk_link":"../audio/a/ukarriv030.mp3","content":"article noun [C]\n(NEWSPAPER)\nAdd to word list\nAdd to word list\nB1 a piece of writing on a particular subject in a newspaper or magazine, or on the internet: There was an interesting article on vegetarianism in the paper yesterday.\nMore examplesFewer examplesThe article appeared on the front page of the Guardian.If you spot any mistakes in the article just mark them with a pencil.Her article on diet startled many people into changing their eating habits.The newspaper published a toughly worded article about racist behaviour.She has written articles for several women's magazines.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony aunt\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\nleader\nmasthead\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\nsplash\nspread\nSee more results »\narticle noun [C]\n(GRAMMAR)\nB1 language\n&#160; specialized any of the English words \"a\", \"an\", and \"the\", or words in other languages that do the same job as these See also\ndefinite article specialized\nindefinite article\nExamples\nWhen I say \"I'm a dentist\", I am using the indefinite article \"a\".It is not correct to include the article 'a' before a plural noun.Uncountable nouns should not have an indefinite article in front of them.The sentence 'Paris is the capital city of France' uses the definite article.With French nouns, like 'la maison', it's important to learn the article that goes with the noun.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\npart of speech\nprep\npronoun\nrelative pronoun\nverb\nSee more results »\narticle noun [C]\n(OBJECT)\na particular thing, especially one that is one of several things of a similar type or in the same place: article of clothing An article of clothing was found near the river. Guests are advised not to leave any articles of value in their hotel rooms. articles of furniture\nSMART Vocabulary: related words and phrases\nObjects - general words\naffair\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\nphenomenon\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nSee more results »\narticle noun [C]\n(LAW)\na separate part in a written document such as a legal agreement: East and West Germany united under article 23 of the Bonn constitution. articles UK\nwork done in a law office while training to be a lawyer: do your articles I'm doing my articles in a small firm in Oxford.\nSee more\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nsanction\nwrit\nSee more results »\nGrammar\nPiece words and group wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nPiece wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\narticle noun [C]\n(PIECE OF WRITING)\nAdd to word list\nAdd to word list\nwriting a piece of writing on a particular subject in a newspaper or magazine: an article on Chinese art\narticle noun [C]\n(OBJECT)\na particular thing or item: The police want a description of each missing article.\narticle noun [C]\n(SMALL WORD)\ngrammar any of the English words \"a,\" \"an,\" and \"the,\" or words in other languages that are used in a similar way as these\nAdd to word list\nAdd to word list\n[ C ] a piece of writing on a particular subject in a newspaper or magazine: The article appeared in the Feb. 1 issue of Economics and Portfolio Strategy, a newsletter for institutional investors.\n[ C ]\n&#160; LAW\n&#160; (also Article) a separate part in a written document such as a law or legal agreement: The Commission has power to impose fines on parties in breach of Article 85(1).\narticles\nLAW\n&#160; UK work in a law office as part of someone's training to be a lawyer: I received a fairly general grounding while in articles, including the opportunity to undertake some commercial work."}