{"id":20842,"name":"as","type":"adverb","us_sound":"æz","us_link":"../audio/a/as.mp3","uk_sound":"æz","uk_link":"../audio/a/ukartic029.mp3","content":"Add to word list\nAdd to word list\nA2 used in comparisons to refer to the degree of something: She'll soon be as tall as her mother. I can't run as fast as you. skin as soft as a baby's It's not as good as it used to be.\nMore examplesFewer examplesFeel my toes - they're as cold as ice.Country life isn't always as peaceful as city-dwellers think.I don't think he's been watering these plants - the soil is as dry as a bone.She can't run as fast as she used to.The apple pie was as good as the one my grandmother used to make.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nGrammar\nAs … asWe use as + adjective/adverb + as to make comparisons when the things we are comparing are equal in some way: …\nNot as … asWe use not as … as to make comparisons between things which aren’t equal: …\nAs … as + possibilityWe often use expressions of possibility or ability after as … as: …\nAs much as, as many asWhen we want to make comparisons referring to quantity, we use as much as with uncountable nouns and as many as with plural nouns: …\nComparison: comparisons of equality (as tall as his father) …\nA1 used to describe the purpose or quality of someone or something: use as The people in the crowd rolled up their programs and used them as bullhorns. work as She works as a waitress. It could be used as evidence against him. The news came as quite a shock to us. I meant it as a joke.\nMore examplesFewer examplesHe wouldn't be my choice as a friend.Yesterday the selectors chose Dales as the team's new captain.Chris has an evening job as an office cleaner.If we clear out the spare room, you can use it as a study.His latest film is described as a 'romantic comedy'.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nGrammar\nAsAs is a preposition or a conjunction. …\nAs as a prepositionWe use as with a noun to refer to the role or purpose of a person or thing: …\nAs as a conjunctionThe conjunction as has several different meanings. We use as when one event happens while another is in progress (‘during the time that’). In this case the verb after is often in the continuous form: …\nThe same asWe use as with the same to talk about identical things: …\nAs: simultaneous changesWe use as to introduce two events happening at the same time. After as with this meaning, we usually use a simple (rather than continuous) form of the verb: …\nAs or like?As and like are prepositions or conjunctions. The prepositions as and like have different meanings. As + noun means ‘in the role of’, like + noun means ‘similar to’ or ‘in the same way as’. …\nas conjunction\n(BECAUSE)\nA2 because: As it was getting late, I decided to book into a hotel. You can go first as you're the oldest.\nMore examplesFewer examplesI'd frayed the edges of my jeans as that was the fashion in those days.I asked the teacher if I could be excused from football practice as my knee still hurt.The ceasefire treaty was meaningless, as neither side ever had any intention of keeping to it.Improved safety measures in cars can be counterproductive as they encourage people to drive faster.This man is desperate and should not be approached as he may have a gun.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nas conjunction\n(WHILE)\nB1 during the time that: I saw him as I was coming into the building. He gets more attractive as he gets older.\nMore examplesFewer examplesHe checked off their names on the list as they got on the coach.Everyone cheered as the winners received their medals.Just as I was sitting down to watch TV, the phone rang.The flames grew larger as the fire spread.I tripped as I got off the bus.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nas conjunction\n(LIKE)\nB1 in the same way: as I was saying As I was just saying, I think the proposal needs further consideration.as is the case As is often the case with children, Amy was completely better by the time the doctor arrived. He got divorced, just as his parents had done years before. This year, as in previous years, tickets sold very quickly. Knowing him as I do, I can't believe he would do such a thing.\nMore examplesFewer examplesThe town centre looks exactly as it did when it was built in 1877.She told me not to ask any questions, just to do as she did.Sound and pictures can be stored digitally, as on a CD.My grandmother died a natural death , as she would have wanted.They face a hard task, as yesterday's discussions amply demonstrated.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nas conjunction\n(ALTHOUGH)\nalthough: Angry as he was, he couldn't help smiling.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nGrammar\nAsAs is a preposition or a conjunction. …\nAs as a prepositionWe use as with a noun to refer to the role or purpose of a person or thing: …\nAs as a conjunctionThe conjunction as has several different meanings. We use as when one event happens while another is in progress (‘during the time that’). In this case the verb after is often in the continuous form: …\nThe same asWe use as with the same to talk about identical things: …\nAs: simultaneous changesWe use as to introduce two events happening at the same time. After as with this meaning, we usually use a simple (rather than continuous) form of the verb: …\nAs, because or since?As, because and since are conjunctions. As, because and since all introduce subordinate clauses. They connect the result of something with its reason. …\nBecauseBecause is more common than as and since, both in writing and speaking. When we use because, we are focusing on the reason: …\nAs and sinceWe often use as and since when we want to focus more on the result than the reason. As and since are more formal than because. We usually put a comma before since after the main clause: …\nAs, when or while?As, when and while are conjunctions. In some uses as, when and while can mean the same, but they can also have slightly different meanings. We use them to introduce subordinate clauses. …\nAsWe can use as to introduce two events happening at the same time. After as, we can use a simple or continuous form of the verb. The continous form emphasises an action that interrupts or occurs during the progress of another action: …\nWhenWe can use when to introduce a single completed event that takes place in the middle of a longer activity or event. In these cases, we usually use a continuous verb in the main clause to describe the background event: …\nWhile and asWe can use while or as to talk about two longer events or activities happening at the same time. We can use either simple or continuous verb forms: …\nWhen and while without a subjectWe can use when and while without a verb, or without a subject + auxiliary verb be: …\nAs or like?As and like are prepositions or conjunctions. The prepositions as and like have different meanings. As + noun means ‘in the role of’, like + noun means ‘similar to’ or ‘in the same way as’. …\nAs if and as thoughAs if and as though are conjunctions. …\nIdioms\nas and when\nas for someone/something\nas if!\nas if/though\nas is\nas it is\nas it were\nas of/from\nas to\nas to/for\nMore idioms\nas with\nas you wish/like\nas preposition, conjunction, adverb [not gradable]\n(COMPARISON)\nAdd to word list\nAdd to word list\nused in expressions that compare two things, persons, groups, or qualities: This jacket costs twice as much as that one. They live in the same town as my parents. She’ll soon be as tall as her mother. Idioms\nas a matter of fact\nas a (general) rule\nas American as apple pie\nas follows\nas for\nas if\nas if/as though\nas is\nas it is\nas long as\nMore idioms\nas of\nas old as the hills\nas opposed to\nas regards\nas soon as\nas such\nas to\nas usual\nas well\nas well as\nas preposition\n(BEING)\nappearing to be, or being: He went to the costume party dressed as a banana. As a child, Miriam had lived in India. The news came as no surprise.\nas conjunction\n(BECAUSE)\nbecause: As it was getting late, I decided to stop at a motel.\nas conjunction\n(WHEN)\nwhile; during the time that: As I was getting out of the car, my heel caught on something and I fell.\nas conjunction\n(ALTHOUGH)\nalthough: Angry as he was, he had to smile.\nas conjunction\n(THE SAME WAY)\nin the way that; like: Do exactly as I say. As is often the case with children, Aimee was completely better by the time the doctor arrived. Just as I thought, Derrick was to blame. Use your coat as a blanket.\nas at\nAdd to word list\nAdd to word list\nACCOUNTING at a particular date or time: All rates correct as at March 1 2011.\nas from\nfrom a particular date or time: As from April 6, your pension payments will increase.\nas is (UK also as seen)\nCOMMERCE used to state that something is being sold in its present condition, and to say that the person selling it is not responsible for anything that might be wrong with it: This guarantee does not cover products sold \"as is\".\nas is, where is\nCOMMERCE used to state that something is being sold in its present condition and at the place where it is at present, and to say that the person selling it is not responsible for anything that might be wrong with it: This item is being sold as is, where is, with no warranty, written or implied.\nas of\nat a particular date or time: The data is correct as of May 13. This issue may need attention later but, as of now, we are happy with the decision that we have taken.\nACCOUNTING from a particular date or time: The tax consequences of this sort of transaction will change as of October 1.\nas per\naccording to what has been agreed or stated: They made payments of $1,000 a year, as per agreement. We shall proceed as per your instructions.\nas seen\nUK also →\nas is : We sold the car with a receipt saying 'sold as seen'."}