{"id":20935,"name":"ascension","type":"noun","us_sound":"əˈsen.ʃən","us_link":"../audio/a/cdo1121usasce0388.mp3","uk_sound":"əˈsen.ʃən","uk_link":"../audio/a/cdo1121ukasce0514.mp3","content":"ascension noun [C usually singular]\n(RISE)\nAdd to word list\nAdd to word list\nformal the process of rising to a position of higher importance, rank, or success: After his time in the US Army, Ashe continued his ascension in the world of tennis. His daughter's ascension to the speakership, a first for a woman, is a matter of great pride for him.\nformal the action of climbing or moving upwards: Fibrosis of the fallopian tube can prevent the ascension of sperm through the canal. He never managed to cross the Atlantic via balloon, but he made hundreds of ascensions. Synonym\nascent\nMore examplesFewer examplesWith the ascension of Mary Tudor to the English throne in 1553, the 1552 Book of Common Prayer was abolished.The Executive Committee put the brakes on Jones' ascension to the top job.Krause said Cartwright possesses all the qualities he desires in a coach, which is why his ascension came so rapidly.The ascension of technology, specifically anemometers, led to a major change in the methods of scientific research, with less focus on personal observation.There have been a series of ascensions from the office of secretary of state in Arizona to the Governor's Office.Reading about Petrarch's ascension of Mount Ventoux leaves me breathless.The stairwell-like ascension of strips of coloured fabric in the quilt patterns are referred to as \"courthouse steps.\"\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascent\nattainment\nbelt\nboom\nfeat\nfruition\nhave something under your belt idiom\nhe who laughs last, laughs longest/best idiom\nlaugh\nprospect\nsecret sauce\nsellout\nsense of achievement\nstratosphere\ntear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPromoting staff\nMoving upwards\nascension noun [C usually singular]\n(TO HEAVEN)\nreligion\n&#160; specialized (also Ascension) the process of going up from earth to heaven, especially the process of Jesus Christ going up to heaven after his death and resurrection (= return to life): The Ascension of Christ is depicted in this stained-glass window.\nMore examplesFewer examplesActs 13:33 cites the passage and applies it to Christ’s resurrection from the dead and His ascension into heaven.The section concludes with the ascension of Basilissa's nuns to heaven.He had a vision of his mother's resurrection and ascension and her welcome into the company of the saints.There is no waiting period for those in the second harvest; their ascensions will occur at the very the same moment they discard their physical bodies.\nSMART Vocabulary: related words and phrases\nReligious festivals\nadvent\nAll Saints' Day\nAll Souls' Day\nAscension Day\nAsh Wednesday\nDivali\nDiwali\nEaster\nEaster Day\nEaster Sunday\nHejira\nholy day\nHoly Week\nlent\nRamadan\nRosh Hashanah\nsaint's day\nShrove Tuesday\nSukkot\nthe holiday season\nSee more results »"}