{"id":21057,"name":"ascription","type":"noun","us_sound":"əˈskrɪp.ʃən","us_link":"../audio/a/cdo0318usascr0284.mp3","uk_sound":"əˈskrɪp.ʃən","uk_link":"../audio/a/cdo0318ukascr0091.mp3","content":"ascription noun [U]\n(OF QUALITY, FEATURE)\nAdd to word list\nAdd to word list\na belief or decision that a particular quality or feature belongs to or is typical of someone or something: Most teachers would reject the ascription of particular traits to whole groups of children on the basis of social class.\nsocial science\n&#160; specialized the fact of having a particular social position because you are a member of a particular social group, rather than because of your actions or achievements: People can acquire status through achievement, by chance, or by ascription. The theory predicted that employers would increasingly recruit their personnel according to the individual’s merits or achievements rather than to that individual’s parents (ascription).\nMore examplesFewer examplesAnimism is the ascription of a spiritual life to all of creation.Her tendency to sweeping generalizations and ascription of motivation is clear. We've learned something that might be relevant to the legal ascription of responsibility. the ascription of traditional domestic and non-domestic roles to the female and male characters in the book Ethnic descriptions such as \"Spaniard\" and \"mestizo\" were definitions of social and fiscal status rather than of genetic ascription.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nattitude\nbubble\ncreed\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\nsomeone's idea of something idiom\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDecisions and deciding\nChance and randomness\nascription noun [U]\n(TO WRITER, ETC.)\na belief or claim that something was said, written, or created by a particular person: The ascription of the text to Gerves du Bus is questionable.\nMore examplesFewer examplesThe general likeness of this poem to Barbour's accepted work in verse-length, dialect and style made the ascription plausible.The ascription to Sir William Coventry arose because the printer used a manuscript found among Coventry’s papers.The author accepts the ascription of all these treatises to Khayyam.The ascription of this argument to Alexander seems reasonable.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nbadged\nbadging\nband\nbiometric\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nid\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBelieving\nascription noun [U]\n(OF CAUSE)\na belief or claim that something is caused by something else: the ascription of our successes to our own merit\nMore examplesFewer examplesthe ascription of natural phenomena to a divine causeIn any scientific ascription of cause, we must carefully regard the facts.the ascription of these acts to evil powers\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\namplification\nargumentation\nascribe something to something\nascriptive\ncase\nculprit\ndefinition\nexplication\nexposition\nextenuating\nextenuation\nflack\nidea\nkey\nreason\ntalk\nwarrantable\nwarrantably\nwherefores\nSee more results »\nSee\nascribe"}