{"id":21126,"name":"ashamed","type":"adjective","us_sound":"əˈʃeɪmd","us_link":"../audio/a/ashamed.mp3","uk_sound":"əˈʃeɪmd","uk_link":"../audio/a/ukasbes021.mp3","content":"Add to word list\nAdd to word list\nB1 feeling guilty or embarrassed about something you have done or about a quality in your character: You've got nothing to be ashamed of. She ought to be thoroughly ashamed of herself - talking to her mother like that! [ + to infinitive ] He was ashamed to admit to his mistake. [ + that ] I was ashamed that I'd made so little effort. I'm ashamed to be seen with you when you behave so badly! I felt so ashamed of myself for making such a fuss. I'm so ashamed of you (= embarrassed to be connected with you)! Opposite\nunashamed\nThesaurus: synonyms, antonyms, and examples\nashamedashamedHe was ashamed that he had been caught stealing.embarrassedI was too embarrassed to admit I was wrong.abashedShe looked at the floor, abashed.shamefacedHe stood shamefaced at the door, looking at the vase he had just knocked to the ground.sheepishShe startled, then gave him a sheepish smile as she picked up her dropped papers.\nSee more results »\nMore examplesFewer examplesI'm ashamed of you. You're big enough to know better.Whoever uprooted that tree ought to be ashamed of themselves.You should be ashamed of yourselves.I've never been ashamed of my homosexuality.I haven't finished my essay, I'm ashamed to say.\nSMART Vocabulary: related words and phrases\nAshamed and embarrassed\nabash\nabashed\nawkward\nawkwardly\nawkwardness\negg\nguiltiness\nhangdog\nhave egg on your face idiom\nhumbling\nhumblingly\nmortify\nmortifying\nnot know where to put yourself idiom\npride\nshamefaced\nsilly\nsmallness\nsquirm\nswallow your pride idiom\nSee more results »\nAdd to word list\nAdd to word list\nfeeling bad because you are aware that others know that you or someone connected with you has done something wrong or embarrassing: [ + to infinitive ] Pedro was never ashamed to admit his mistakes. I felt deeply ashamed for my father’s impoliteness. You have nothing to be ashamed of. [ + to infinitive ] She was ashamed to ask her brother for money."}