{"id":21162,"name":"ashkenazi","type":"noun","us_sound":"ˌɑːʃ.kəˈnɑː.zi","us_link":"","uk_sound":"ˌæʃ.kəˈnɑː.zi","uk_link":"","content":"Add to word list\nAdd to word list\nsomeone who belongs to the group of Jewish people whose families came from central or eastern Europe and traditionally spoke Yiddish: Albert Einstein was an Ashkenazi. Sephardim serve rice for Passover, while Ashkenazim do not.\nMore examplesFewer examplesYiddish-speaking Ashkenazis transformed Manhattan's Lower East Side.Many of the residents were Ashkenazis, mostly Polish.There is genetic evidence suggesting that the Ashkenazim descend from a population of around 10,000 people living in Poland at the beginning of the 16th century.\nSMART Vocabulary: related words and phrases\nJudaism\nbar mitzvah\nbat mitzvah\ncantor\nChanukah\nHanukkah\nJew\nJewish\nJewishness\nJewry\nOrthodox Judaism\npaschal\nPassover\nPentecost\nPharisee\nsynagogue\ntallit\nTalmudic\nTalmudist\nthe ark\nthe Talmud\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: followers of religious groups\nbelonging or relating to the group of Jewish people whose families came from central or eastern Europe: Born in Boston, he was an Ashkenazi Jew, with family roots in Eastern Europe. Passover foods vary in Sephardi and Ashkenazi communities. 80% of those calling themselves Jews today are Ashkenazi. Synonym\nAshkenazic Compare\nSephardic\nMore examplesFewer examplesMany Ashkenazi Jews have the practice of wearing sheitels, while some wear a covering on top of the sheitel.There are many variations of cholent, a dish which is commonly found in both Ashkenazi and Sephardi kitchens.Barbecue is not part of the Ashkenazi (Eastern European) tradition.I have students who can't say whether they are Ashkenazi or Sephardi because they have grandparents from different countries.When Israel was founded, the majority of its restaurants were classically Ashkenazi.\nSMART Vocabulary: related words and phrases\nJudaism\nbar mitzvah\nbat mitzvah\ncantor\nChanukah\nHanukkah\nJew\nJewish\nJewishness\nJewry\nOrthodox Judaism\npaschal\nPassover\nPentecost\nPharisee\nsynagogue\ntallit\nTalmudic\nTalmudist\nthe ark\nthe Talmud\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: followers of religious groups"}