{"id":21150,"name":"ashy","type":"adjective","us_sound":"ˈæʃ.i","us_link":"../audio/a/cdo1119usashy0043.mp3","uk_sound":"ˈæʃ.i","uk_link":"../audio/a/cdo1119ukashy0033.mp3","content":"ashy adjective\n(BURNED)\nAdd to word list\nAdd to word list\nconsisting of or like ash (= the soft grey or black powder that is left after a substance has burned): They found fruit thrived in the ashy soil at the feet of volcanoes.\nMore examplesFewer examplesAn estimated 300 firefighters remained missing in the ashy ruins in Lower Manhattan.An almost featureless, ashy mud coats the island.In all the houses, a burned, ashy sediment had been piled up around some of the cooking-holes.\nSMART Vocabulary: related words and phrases\nProducts of fire\nash\nbelch\ncinder\nclinker\nember\nfumes\nhaze\nsmoke\nsmokeless\nsmokily\nsmoky\nsmut\nsoot\nsooty\nashy adjective\n(COLOUR)\nlight grey in colour: Her ashy face was anxious, pallid with lack of sleep.\nMore examplesFewer examplesIf your hair is ashy, a golden colour-depositing shampoo can warm it up, says colourist Giselle.He came listlessly back to work, with the curious ashy colour of a man who has been sick.His face was ashy, and his eyes staring, fixed, like those of a blind man or a corpse.The adult bird has a black back and crown, ashy grey wings, white underparts, yellow legs and red eyes.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nbloodless\nblush\ncolouring\ncraggily\ncraggy\ncrimson\ncutaneous\ncutis\nmole\npallor\npore\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbathing\nsunbed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair colour\nLess common colours\nashy adjective\n(SKIN)\n(of skin) feeling dry, and having areas of white on it: Moisturizers relieve the dry or \"ashy\" skin that is common among dark-skinned people.\nThesaurus: synonyms, antonyms, and examples\nhaving the liquid removeddryIs the washing dry yet, or should we leave it in the tumble dryer a bit longer?bone-dryThe dog's water dish was bone dry.as dry as a boneThe houseplant's soil was dry as a bone.driedI love snacking on dried apples and apricots. desiccatedAdd 100g of desiccated unsweetened coconut to the mixture.\nSee more results »\nMore examplesFewer examplesAlthough it shows up more on darker skin, ashy skin can affect people of all ethnicities. The doctor noticed the boy's arms appeared ashy and suspected he had a skin condition.\"Us brown-skinned girls get ashy if we don't moisturize,\" she said, as she rubbed lotion on the girl's arm.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nbloodless\nblush\ncolouring\ncraggily\ncraggy\ncrimson\ncutaneous\ncutis\nmole\npallor\npore\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbathing\nsunbed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkin complaints & blemishes"}