{"id":21217,"name":"aside","type":"adverb","us_sound":"əˈsaɪd","us_link":"../audio/a/aside.mp3","uk_sound":"əˈsaɪd","uk_link":"../audio/a/ukaside001.mp3","content":"aside adverb\n(TO ONE SIDE)\nAdd to word list\nAdd to word list\nB2 on or to one side: Stand aside, please, and let these people pass. He pulled the curtain aside. I gave her a plate of food but she pushed it aside. I've forgotten my wallet, so could you put this book aside (= keep this book) for me and I'll come back later on. She took me aside (= took me away from the other people) to tell me the news. put/set aside money\nB2 (or put/set money aside) If you put or set aside money, you save it for a particular purpose: Every week I put aside some money for a new TV.\nSee more leave/put/set something aside\nIf you leave, put, or set something aside, you do not talk about or deal with it at the present time: Let's leave that matter aside for now and talk about the more urgent problem facing us.\nSee more\nMore examplesFewer examplesThe crowd watched as the referee drew the player aside and spoke to him.They elbowed the onlookers aside.Stand aside, please, so the doctor can get through.In all seriousness now - joking aside - I do think there's a problem here that we've got to get sorted.She laid aside her book and went to answer the phone.\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nreverse\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nwrong\nSee more results »\naside adverb\n(EXCEPT)\naside from\nB2 except for: Money continues to be a problem but aside from that we're all well.\nSee more\na remark that someone makes in a quiet voice because they do not want everyone to hear it: a whispered aside\na remark or story in a speech or text that is not part of the main subject: The informative asides about rural life make this wine guide rather special.\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nlast word\nline\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nAdd to word list\nAdd to word list\non or to one side: I pushed aside the curtain and looked out the window. I took her aside (= out of hearing distance of other people) to tell her to behave herself. The governor wants to set aside (= keep separate and not spend) $50 million for emergencies. Idiom\naside from"}