{"id":21733,"name":"asset","type":"noun","us_sound":"ˈæs.et","us_link":"../audio/a/asset.mp3","uk_sound":"ˈæs.et","uk_link":"../audio/a/ukassau017.mp3","content":"asset noun\n(GOOD QUALITY)\nAdd to word list\nAdd to word list\nC1 [ C ] a useful or valuable quality, skill, or person: He'll be a great asset to the team. Knowledge of languages is a real asset in this sort of work. His eyes are his best asset (= most attractive feature).\nMore examplesFewer examplesAs a footballer his great asset was his calm, phlegmatic manner.Her knowledge and experience would make her a priceless asset to the team.\nSMART Vocabulary: related words and phrases\nUseful or advantageous\nadvantageous\nadvantageously\nall-singing\namiss\nbe worth your/its weight in gold idiom\nfecund\nfoil\nfruitfully\nfruitfulness\ngainfully\ngeneral\npracticality\npreferential\nproductive\nproductively\nprofitable\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nasset noun\n(IN BUSINESS)\nC1 [ C usually plural ] something valuable belonging to a person or organization that can be used for the payment of debts: liquid asset A lot of his wealth is in the form of stock, but he has little in liquid assets (= money or things that can easily be changed into money). A company's assets can consist of cash, investments, specialist knowledge, or copyright material. Compare\nliabilities (liability) specialized\nMore examplesFewer examplesThe company's assets are periodically revalued.When it was obvious the company was going bankrupt, the government ordered all their assets to be frozen.\nSMART Vocabulary: related words and phrases\nBelongings and possessions\naccoutrements\nbelongings\ncapital assets\nchattel\ncommunity property\nestate\nfor\nlost property\nlost property office\nlost-and-found\nmaterially\nname\npersonalty\npossession\nproperty\nresource\nstuff\nswag\nthing\ntoxic asset\nSee more results »\nasset noun\n(SPY)\n[ C ] someone who provides secret information to a government or intelligence organization about what another government or organization is doing: He was a South American military officer who served as a CIA asset. There was a suggestion that a Western intelligence asset may have been involved.\nMore examplesFewer examplesMost assets are knowing agents, but some are \"useful idiots\" who provide a foreign agent with information through failures in information safety.\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\ncounter-espionage\ninsider\nintel\nintelligence\nMI5\nMI6\noperative\nscout\nsleuthing\nsnoop\nsnoopy\nspook\nspy\nspy on someone/something\ntail\ntap\nthe CIA\nSee more results »\nAdd to word list\nAdd to word list\nsomething having value, such as a possession or property, that is owned by a person, business, or organization\nAn asset is also any positive feature that gives you an advantage: Her knowledge of Spanish and French is a real asset in her work.\nAdd to word list\nAdd to word list\nACCOUNTING, FINANCE something that is owned by a person, company, or organization, such as money, property, or land: The company reported total assets worth $1.9 million.have/hold/own assets You can hold assets offshore, such as bank accounts or property.acquire/buy/increase assets The parties will decide whether to buy assets or shares.dispose of/reduce/sell assets The company's board could dispose of assets once they decide to sell the company.freeze/release/unfreeze assets The courts can order a financial institution to freeze assets.record/show sth as an asset This figure will need to be shown in the accounts as an asset. the sale/disposal/transfer of assets\na person or thing that is very useful or valuable: be an asset to sb/sth Thank you for your contribution - you are an asset to the company.great/important/valuable asset Our customer service team is our most important asset. See also\ncapital asset\nchargeable asset\ncharge on assets\ncirculating asset\ncurrent asset\nfinancial asset\nfrozen asset\nhard asset\nintangible asset\nintellectual asset\nView all\nknowledge asset\nliquid asset\nnet assets\nnet current assets\noperating assets\nreturn on assets\ntangible asset\nunderlying assets\nverification of assets\nwasting asset"}