{"id":21717,"name":"assess","type":"verb","us_sound":"əˈses","us_link":"../audio/a/assess.mp3","uk_sound":"əˈses","uk_link":"../audio/a/ukassau013.mp3","content":"Add to word list\nAdd to word list\nB2 to judge or decide the amount, value, quality, or importance of something: The insurers will need to assess the flood damage. They assessed the cost of the flood damage at £2,500. Exams are not the only means of assessing a student's ability. It's too early to assess the long-term consequences of the two countries' union. [ + question word ] We need to assess whether the project is worth doing.\nMore examplesFewer examplesUnder the tutelage of Professor Roberts, the 900 delegates assessed and discussed the social market economy.The rate of breakdown of muscle protein was assessed.We expect the new scheme for assessing claims to come into operation early next year.Authorities are assessing damage caused by last night's stormy weather.They couldn't agree the best way to assess their students.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nassess verb [T]\n(JUDGE)\nAdd to word list\nAdd to word list\nto decide the quality or importance of something: A college is going to assess a student’s ability based on grades.\nTo assess is also to judge the cost or value of something: Government officials assessed the flood damage in the millions of dollars.\nassess verb [T]\n(ASK FOR MONEY)\nto charge someone an amount of money as a special payment: In order to complete the new clubhouse, all members will be assessed an additional $200 a year. assessment noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈses·mənt/\nThis is an interesting assessment of Mark Twain’s importance in American literature. assessment noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈses·mənt/\nCo-op owners had to pay an assessment to cover the cost of the roof repair.\nAdd to word list\nAdd to word list\nto make a decision about a person or situation after considering all the information: The consultant was hired to assess the impact of the buyout on consumers.assess that/whether A lender must be able to assess that the borrower is able to pay back the loan. The appraisal system is designed to help you assess your strengths and weaknesses.assess sb on sth You will be assessed on your ability to take decisions quickly.\nto judge or decide the amount or value of something: assess sth at sth The cost of repairs to the equipment was assessed at £2,000.\nACCOUNTING, TAX to decide how much tax someone must pay on something: assess sb/sth for sth Currently, 38 states require counties to assess properties for taxation. If you are self-employed, you will be required to submit a tax declaration so that you can be assessed for income tax.assess sb/sth on sth You will be assessed on all your income, including any interest you have earned."}