{"id":21651,"name":"assemble","type":"verb","us_sound":"əˈsem.bəl","us_link":"../audio/a/assemble.mp3","uk_sound":"əˈsem.bəl","uk_link":"../audio/a/ukassau004.mp3","content":"assemble verb\n(GATHER)\nAdd to word list\nAdd to word list\nC2 [ I or T ] to come together in a single place or bring parts together in a single group: We assembled in the meeting room after lunch. to assemble datathe assembled company At the staff meeting, the manager told the assembled company (= everyone there) that no one would lose their job.\nMore examplesFewer examplesWithin hours of the tragedy happening, an emergency rescue team had been assembled.He gazed once more around the room, where his entire family were assembled.Over 50,000 people assembled in the main square.He came out onto the balcony to speak to the crowd that had assembled outside.Everyone is assembling outside the cathedral, ready for the Remembrance Day parade.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\ncompile\ncompiler\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\ngarner\nharvest\nput something together\nrake something up\nreassemble\nreconcentrate\nreconcentration\nthe assembled company\nSee more results »\nassemble verb\n(JOIN)\nC2 [ T ] to make something by joining separate parts: furniture that is easy to assemble\nThesaurus: synonyms, antonyms, and examples\nto build somethingbuildThe house was built in the 1950s.constructThe company wants to construct a 175-mile pipeline.put something upPutting up a wall will not solve the problem.erectIt's unlawful to erect a building until you get approval.assembleHe has a job assembling furniture in a warehouse.put togetherWithout the instruction sheet, I've got no idea how to put all these parts together.\nSee more results »\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconvergence\ncor\ncross-Channel\ncumulate\ndesegregate\njunction\nkludge\nknit\nknock\nknock through something phrase\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nAdd to word list\nAdd to word list\nto bring or come together in a single group or place, or to put together the parts of something: [ I ] When the fire alarm rings, everyone is supposed to leave the building and assemble in the schoolyard. [ T ] Workers were earning $20 an hour assembling cars.\nAdd to word list\nAdd to word list\n[ I or T ] to come together in a single place, or bring people or things together in a single group: We assembled in the meeting room for the announcement. Since she took over the department, she has assembled a talented team with a varied selection of skills. We can help you assemble all the paperwork that is necessary to make the application.\n[ T ]\n&#160; PRODUCTION to make something by joining separate parts together: This is where the car engines are assembled. flatpack furniture that is easy to assemble\n[ I ]\n&#160; MEETINGS if an organization assembles, it meets officially: The UNESCO International Education Conference assembled in Geneva in September.\n[ T ]\n&#160; FINANCE to collect together money, for example a loan, from different people, companies, or organizations: The consortium has already assembled a loan of €400m-€500m from the banks."}