{"id":21658,"name":"assembly","type":"noun","us_sound":"əˈsem.bli","us_link":"../audio/a/assembly.mp3","uk_sound":"əˈsem.bli","uk_link":"../audio/a/ukassau006.mp3","content":"assembly noun\n(MEETING)\nAdd to word list\nAdd to word list\nC2 [ C ] a group of people, especially one that meets regularly for a particular purpose, such as government, or, more generally, the process of coming together, or the state of being together: the United Nations General Assembly She has been tipped as a future member of the Welsh Assembly. Assembly US\none of the two parts of the government that makes laws in many US States: the New York Assembly The Senate and the Assembly put aside political differences to pass the aid package. See also\nlegislative assembly\n[ C or U ] a meeting in a school of several classes, usually at the beginning of the school day, to give information or to say prayers together: All pupils are expected to attend school assembly. There's a religious assembly every morning.\nMore examplesFewer examplesEveryone would go into the hall for assembly and then afterwards we'd go to our respective classes.He is an elected member of the Northern Ireland Assembly.Are you in favour of setting up regional assemblies to legislate on local matters?If you don't organize the demonstration properly the police will say it's an illegal assembly.We have an assembly for the whole college three times a term, with class and group assemblies once a week.\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconference\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nscrum\nsession\nspeaking engagement\nsymposium\nteleconference\nteleconferencing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nSchools in general\nassembly noun\n(JOINING)\nC2 [ U ] the process of putting together the parts of a machine or structure\n[ C ]\n&#160; engineering\n&#160; specialized the structure produced by this process: The frame needs to be strong enough to support the engine assembly.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFrames & structures\nassembly noun [C/U]\n(GATHERING)\nAdd to word list\nAdd to word list\na group of people, esp. one gathered together regularly for a particular purpose\nIn the US, an assembly is one of the two parts of the government in many states that makes laws: [ C ] The state assembly will vote on a death penalty bill next week.\nAn assembly in a school is a gathering of several classes for a group activity that is usually educational.\nassembly noun [C/U]\n(JOINING)\nthe process of putting together the parts of a machine or structure, or the thing produced by this process\nAdd to word list\nAdd to word list\n[ U ]\n&#160; PRODUCTION the process of putting together the parts of a machine or structure: Full assembly instructions are provided with these easy-to-build desk units. car assembly The assembly of the circuit boards is done in China. See also\nself-assembly adjective\n[ C ]\n&#160; MEETINGS, GOVERNMENT, POLITICS\n&#160; plural assemblies (often Assembly) a group of people that meets for a particular purpose, especially to govern, make laws, or discuss political questions: The mayor's powers are deliberately designed to outweigh those of the London Assembly. The United Nations General Assembly meets later this week.\n[ C ]\n&#160; LAW, GOVERNMENT\n&#160; plural assemblies (also Assembly) one of the two parts of the government that makes laws in many US states: The existing measure needs Assembly approval before it becomes law."}