{"id":21665,"name":"assent","type":"noun","us_sound":"əˈsent","us_link":"../audio/a/ascent.mp3","uk_sound":"əˈsent","uk_link":"../audio/a/ukasbes006.mp3","content":"Add to word list\nAdd to word list\nofficial agreement to or approval of an idea, plan, or request: She nodded her assent to the proposal.UK Before an Act of Parliament can become law, it needs to receive Royal Assent (= an official signature) from the monarch.give your assent Once the directors have given their assent to the proposal we can begin. Synonyms\nacquiescence formal\nagreement (SAME OPINION)\napproval (PERMISSION)\nsay-so (PERMISSION) informalCompare\ndissent noun formal\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nto agree to or give official approval to something: assent to Have they assented to the terms of the contract? \"Do you assent to a search of your vehicle?\" \"Yes, I assent.\" Synonyms\nacquiesce formal\nagree (SAY YES)\napprove (AGREE)\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nAdd to word list\nAdd to word list\nagreement to an idea, plan, or request, esp. after serious consideration: He gave a nod of assent, and we knew we had a deal at last. assent verb [ I ] us\nYour browser doesn't support HTML5 audio\n/əˈsent/\nfml At long last, the general assented to a halt in the bombing.\nAdd to word list\nAdd to word list\n[ U ] official agreement to an idea, plan, or request: with the assent of sb The government, with the assent of the two smaller opposition parties, pushed through the bill this week.give your assent to sth Once the directors have given their assent to the proposal, work can start almost immediately.\n[ C ]\n&#160; LAW a document that states that someone is the new legal owner of the property of someone who has died: The transfer of a property to the beneficiary after someone has died is done by means of an assent.\nto agree to or give official approval to something: assent to sth Have they assented to the terms of the contract?"}