{"id":21698,"name":"assertive","type":"adjective","us_sound":"əˈsɝː.t̬ɪv","us_link":"../audio/a/eus70348.mp3","uk_sound":"əˈsɜː.tɪv","uk_link":"../audio/a/ukassau010.mp3","content":"Add to word list\nAdd to word list\nC2 Someone who is assertive behaves confidently and is not frightened to say what they want or believe: If you really want the promotion, you'll have to be more assertive. Synonyms\nassured (CONFIDENT)\nconfident\nself-assured approving\nself-confident approvingSee also\nself-assertive\nThesaurus: synonyms, antonyms, and examples\ncertain of your abilities or valueconfidentHe was confident that his approach would work best.assuredShe gave an assured performance to a packed concert hall.self-assuredThe interview showed her as a very self-assured woman.self-confidentHe was self-confident and sure he'd get the job. assertiveYou'll have to be more assertive if you want to be promoted.boldHe was a bold and defiant little boy.\nSee more results »\nMore examplesFewer examplesI've had to train myself to be more assertive at work.Don't let him boss you around like that - try to be a bit more assertive!In difficult situations like that, it's important to be assertive without getting angry or aggressive.I've become a lot more assertive as I've got older, and will no longer put up with bad service.He taught his children to be assertive and to stand up to the bullies.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertively\nassertiveness\nassertiveness training\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nRelated words\nassertively\nassertiveness\nAdd to word list\nAdd to word list\nbehaving confidently and able to say in a direct way what you want or believe: If you really want the promotion, you’ll have to be more assertive.\nAdd to word list\nAdd to word list\nbehaving confidently and not being frightened to say what you want or believe: It's that assertive and confident attitude that helps business grow. She's not afraid of being assertive with her staff. assertively adverb\nThey will be watching to see if the candidates behave assertively during the job interview. assertiveness noun [ U ]\nTraining packages include courses on assertiveness and managerial skills."}