{"id":21832,"name":"assistant","type":"noun","us_sound":"əˈsɪs.tənt","us_link":"../audio/a/assistant.mp3","uk_sound":"əˈsɪs.tənt","uk_link":"../audio/a/ukassau030.mp3","content":"Add to word list\nAdd to word list\nB1 someone who helps someone else to do a job: an administrative/office assistant an assistant editor/manager Synonym\nhelperCompare\nabettor\nA2 UK someone who works in a shop, selling goods to customers and giving advice about the goods sold in the shop: a sales/shop assistant\nThesaurus: synonyms, antonyms, and examples\na person who sells thingssellerWe'll need to talk to the seller and see if they'll accept your bid on the house.salespersonThe shop was so busy that it took me ages to get the salesperson's attention.salesmanHe was a used-car salesman.saleswomanShe was the company's top saleswoman.sales assistantUK Can you wave over a sales assistant? I have a question about this bracelet.\nSee more results »\nMore examplesFewer examplesShe's a personal assistant as distinct from a secretary.Can't we employ someone as an assistant to help with all this paperwork?She can't accept she made a mistake and now she's trying to lay the blame on her assistant.Did you want to talk to the chairman himself, or could his personal assistant help you?She is looking for a personal assistant with good organizational skills.\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\na tower of strength idiom\nabettor\naccessory\naccomplice\nacolyte\naide\nbackup\ncollaborator\nconfederate\nden mother\nenabler\nfacilitator\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nsponsor\nstrength\nsupport group\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who sell things\nAdd to word list\nAdd to word list\na person who helps someone else to do a job or who holds a less important position in an organization: an assistant coach/professor My assistant will show you around the factory.\nAdd to word list\nAdd to word list\nHR, WORKPLACE an employee who helps someone in a more senior position to do their job: assistant to sb assistant to the director of the Institute of Science\nCOMMERCE\n&#160; UK (also shop assistant); (also sales assistant); (US sales clerk) someone who serves customers in a store: She worked as an assistant in a local bookshop. See also\nadministrative assistant\nbank assistant\nclerical assistant\nexecutive assistant\npersonal assistant\nPDA\nHR, WORKPLACE used as part of someone's job title to show that their job is below the level of a more senior person, and that they help that person to do their job: assistant director/manager, etc. She had previously served as assistant vice-president for finance at MIT."}