{"id":21788,"name":"assignment","type":"noun","us_sound":"əˈsaɪn.mənt","us_link":"../audio/a/assignment.mp3","uk_sound":"əˈsaɪn.mənt","uk_link":"../audio/a/ukassau024.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a piece of work given to someone, typically as part of their studies or job: a freelance/photo assignment I have a lot of reading assignments to complete before the end of term.\n[ C ] a job that someone is sent somewhere to do: a foreign/diplomatic assignment on assignment\nSomeone who is on assignment is doing a particular job or piece of work, usually in a particular place where they have been sent for a period of time: Both journalists were killed while on assignment in the region.\nSee more\n[ U ] the process of giving a particular job or piece of work to someone, or of sending someone to a chosen place to do a job: assignment of the various tasks\nMore examplesFewer examplesIt was a jammy assignment - more of a holiday really.He took this award-winning photograph while on assignment in the Middle East.His two-year assignment to the Mexico office starts in September.She first visited Norway on assignment for the winter Olympics ten years ago.He fell in love with the area after being there on assignment for National Geographic in the 1950s.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nbandh\nbe at work idiom\nbe in work idiom\ngrind\nhoop\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\njob\nlabour\nslave\nslog\nslouch\nspadework\nsubtask\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\nAdd to word list\nAdd to word list\na particular job or responsibility given to you: [ C ] The homework assignment was to read Chapter 2 in our history book. Idiom\non assignment\nAdd to word list\nAdd to word list\n[ C ] a task or a piece of work that is given to someone to do, often for a limited period of time: a six-month assignment Solving the industry's infrastructure problems while satisfying shareholders is going to be a tough assignment.give sb an assignment Our team was given an assignment to find the gaps in the market. accept/refuse/take on an assignment carry out/complete/finish an assignmentglobal/international/overseas, etc. assignment One of his first overseas assignments was as a junior in a delegation to Moscow. Assessment for the course will be based on four written assignments and a final examination.\n[ U ] the process of giving someone a particular job, task, or responsibility: The restructuring will require changing the assignment of responsibilities and reporting relationships.\n[ C or U ]\n&#160; LAW the act of giving something that belongs to you, such as a property or a financial agreement, to somebody else: The Agreement will terminate automatically in the event of its assignment. The assignment of a legal lease must be in the form of a deed to be effective.\non assignment\nsomeone who is on assignment is doing a job in a particular place, usually for an agreed amount of time: The photographer died while on assignment in the war zone. See also\ndeed of assignment\nwage assignment"}