{"id":21830,"name":"assistance","type":"noun","us_sound":"əˈsɪs.təns","us_link":"../audio/a/assistance.mp3","uk_sound":"əˈsɪs.təns","uk_link":"../audio/a/ukassau029.mp3","content":"Add to word list\nAdd to word list\nB2 help: financial assistance The company needs more financial assistance from the government.give assistance The tow truck driver gave assistance to the stranded motorist.be of assistance Can I be of any assistance (= can I help), madam? A £1 billion investment would be of considerable assistance to the local economy. Teachers can't give pupils any assistance in exams. Synonyms\nto someone's aid\nhelp\nrelief\nsuccour UK literary\nsupport (HELP) come to someone's assistance\nto help someone: I had several acquaintances in the area but not one of them came to my assistance.\nSee more\nMore examplesFewer examplesShe clasped her hands, and glancing upward, seemed to implore divine assistance.We always try to accommodate our clients with financial assistance if necessary.If you need any assistance, press the buzzer.The conference was aimed at boosting economic assistance to post-Taliban Afghanistan.You might be entitled to receive financial assistance from the university.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\ngo a long way toward(s) doing something idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nAdd to word list\nAdd to word list\nhelp, especially money or resources that are given to people, countries, etc. when they have experienced a difficult situation: need/seek assistance The minister revealed that the banking industry needed assistance from the taxpayer to survive.offer/provide/receive assistance The first teams sent to provide assistance after the earthquake began arriving in the affected region yesterday.be of assistance (to sb) (in doing sth) The grant was of great assistance to us in setting up the organization. financial/economic assistance federal/state/government assistance food/humanitarian/disaster assistance technical/legal assistance"}