{"id":21773,"name":"assign","type":"verb","us_sound":"əˈsaɪn","us_link":"../audio/a/assign.mp3","uk_sound":"əˈsaɪn","uk_link":"../audio/a/ukassau022.mp3","content":"assign verb [T]\n(CHOOSE)\nAdd to word list\nAdd to word list\nC1 [ often passive ] to give a particular job or piece of work to someone: [ + two objects ] UN troops were assigned the task of rebuilding the hospital. The case has been assigned to our most senior officer.\nIf you assign a time for a job or activity, you decide it will be done during that time: Have you assigned a day for the interviews yet?\nIf you assign a characteristic or value to something, you say that it has it: Each visitor to the site chooses an online alter ego, which is assigned a name.\nto decide a reason for something: Detectives have been unable to assign a motive for the murder.assign blame The report assigned the blame for the accident to inadequate safety regulations.\nMore examplesFewer examplesEvery available officer will be assigned to the investigation.The textbooks were assigned by the course director.Part of the group were assigned to clear land mines.Each trainee is assigned a mentor who will help them learn more about the job.We were assigned an interpreter for the duration of our stay.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDecisions and deciding\nAnalysing and evaluating\nDefining & explaining\nassign verb [T]\n(SEND)\nC2 to send someone somewhere to do a job: She was assigned to the newspaper's Berlin office.\nMore examplesFewer examplesShe was assigned to the Paris office.All the team were assigned to Poland.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nassign verb [T]\n(COMPUTING)\ncomputing\n&#160; specialized to put a value in a particular position in the memory of a computer\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nassign verb [T]\n(GIVE LEGALLY)\nlaw\n&#160; specialized to give property, money, or rights using a legal process: Her property was assigned to her grandchildren.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInheriting & bequeathing\nPhrasal verb\nassign someone to something\nAdd to word list\nAdd to word list\nto give to someone a job or responsibility, or to decide on a person for a particular job or responsibility: We assigned Alberto the task of watching the children.\nSomeone who is assigned to a place is sent there to do a job: Judith was assigned to the office in Washington, D.C.\nIf you assign things to people, you give them out in an organized way: We’re assigning seats on a first-come, first-serve basis.\nAdd to word list\nAdd to word list\nto give a particular job or piece of work to someone: assign tasks/responsibilities/objectives, etc. (to sb) The document outlines how the organization will be run and how research tasks will be assigned.assign sb to do sth They assigned him to analyse computer records to look for signs of fraud.\nHR to send someone to work in a particular place or do a particular job: assign sb to sth Each individual was assigned to a team representing a major stakeholder.be assigned to sth I've been assigned to the finance department on a temporary basis. Over the past decade, the organization has doubled its number of managers assigned abroad.\nto give something, for example a particular amount of time or money, for a particular purpose: assign sth to sth They assigned a large sum of money to research and development. Locals are frustrated that of the $110bn assigned by Congress in relief aid, only $53bn has actually been spent.assign sth to sb Each employee will be assigned an individual work area, with a desk and shelving.\nFINANCE to decide that something has a particular value or level: assign sth to sth Because most of the companies in which the fund has invested are private, the fund's managers have had to assign them a market value. Buyers are being trained to use a spreadsheet to assign a cost to every step of completing a sale.\nFINANCE, LAW to give your rights to a property, etc. to someone else, either by selling them or preparing a legal document as an agreement: Assigning ownership rights to employees can help keep certain costs down.\nIT if a computer, website, etc. assigns something, it gives a value to it so that a connection can be made between the data and the user: Internet Service Providers automatically assign IP addresses to their customers.\nCompare\nsecond verb\npost verb"}