{"id":21829,"name":"assist","type":"verb","us_sound":"əˈsɪst","us_link":"../audio/a/assist.mp3","uk_sound":"əˈsɪst","uk_link":"../audio/a/ukassau028.mp3","content":"Add to word list\nAdd to word list\nB2 to help: You will be expected to assist the editor with the selection of illustrations for the book.assist in The army arrived to assist in the search.assist with They are looking for volunteers to assist with passing out meals.\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\nassist the police with/in their inquiries UK\nIf someone is assisting the police with their inquiries, it usually means they have been taken to the police station to be asked questions about a crime: I have cooperated fully with the police and am simply assisting them with their inquiries.\nSee more\nMore examplesFewer examplesMigrating birds make use of airstreams to assist them on their long journey south.Yasmin assisted in the preparation of this article.Emergency crews, assisted by the army, are searching for survivors.The doctor performed a small operation to assist the patient's breathing.The photographers could face charges of manslaughter and failure to assist the victims of the crash.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist with something\nassistance\nbridge\ncarry\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\ngo a long way toward(s) doing something idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nin ball sports, an occasion when a player touches the ball and this leads to another player on the same team scoring a goal or point: He has the most assists in the Premier League this season. He set an NBA record for most assists by a rookie.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nback pass\nbackspin\nball game\nballplayer\nblast\ndump\nlay someone off\nlayoff\nlong ball\nman on! idiom\npace\npassing\nstroke\nthe long ball game idiom\nunderhand\nunderspin\nunhittable\nuppish\nuppishly\nSee more results »\nAdd to word list\nAdd to word list\nto take action to help someone or support something: [ T ] The company said it would assist workers in finding new jobs. [ I ] No one knew where my grandfather was, and many came to assist in the search. assistance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈsɪs·təns/\nWith some financial assistance, we’ll be able to start our own business.\nAdd to word list\nAdd to word list\n[ I or T ] to help somebody or help with something: assist (sb) with sth The coordinator will assist the director with all aspects of event-planning.assist (sb) in doing sth The prospectus provides detailed information that will assist investors in making informed decisions. The accused denies the charge of assisting an offender. Investment in transport will assist growth in the economy. The fees will assist in paying off the 260m pounds debt accrued.\n[ T ] to help something develop or happen by providing money, support, etc.: be assisted by sth Redevelopment of the new facility has been assisted by 2.5 million dollars of public funding.\nassist the police with their inquiries\nan expression that is used to refer to the fact that someone has been taken to a police station to be asked questions about a crime, but that they have not yet been accused of the crime: Two men have been detained in connection with the suspected fraud and are at present assisting police with their inquiries."}