{"id":21801,"name":"assimilationist","type":"noun","us_sound":"əˌsɪm.əˈleɪ.ʃən.ɪst","us_link":"../audio/a/cdo0123usassi0233.mp3","uk_sound":"əˌsɪm.ɪˈleɪ.ʃən.ɪst","uk_link":"../audio/a/cdo0123ukassi0424.mp3","content":"Add to word list\nAdd to word list\na person who supports the idea that different cultural groups or races in a country, society, etc. should become a part of the country, society, etc. in which they live: He was an ardent assimilationist. They were assimilationists, but remained sensitive to how the process of assimilation should happen.\nMore examplesFewer examplesAssimilationists believe that cultural identity must be submerged for the good of the country.The main character in the novel is described as an assimilationist.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncustodian\ndefender\nnew/fresh blood idiom\nnon-membership\npartisan\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nvotary\nSee more results »\nrelating to the idea that different cultural groups or races in a country, society, etc. should become a part of the country, society, etc. in which they live: The government's assimilationist policies assumed that there would eventually be no distinctive indigenous culture. One part of their assimilationist strategy was to participate actively in politics at all levels. Synonym\nassimilatory\nMore examplesFewer examplesThere has been a move away from the assimilationist views of the past towards a more multicultural approach.She wrote a critique of the country's assimilationist and nationalist politics.The report expressed concern about the assimilationist policy.We have to decide whether we want to be an assimilationist society or a multicultural society.\nSMART Vocabulary: related words and phrases\nOrganizations - joining & leaving\naddition\nanti-assimilation\nassimilation\nassimilative\nassimilatory\nband\nblackball\nenrol\nenrolment\nentrant\nentry\nentryway\nexit\ninitiation ceremony\njoiner\nnon-joiner\non the books idiom\nonto\noverenrolled\nsit\nSee more results »\nRelated words\nassimilation\nassimilate"}