{"id":21873,"name":"association","type":"noun","us_sound":"əˌsoʊ.siˈeɪ.ʃən","us_link":"../audio/a/association.mp3","uk_sound":"əˌsəʊ.siˈeɪ.ʃən","uk_link":"../audio/a/ukassiz006.mp3","content":"association noun\n(GROUP)\nAdd to word list\nAdd to word list\nB2 [ C, + sing/pl verb ] a group of people who work together in a single organization for a particular purpose: The Football Association The British Medical Association is/are campaigning for a complete ban on tobacco advertising.\nMore examplesFewer examplesThe school is affiliated with a national association of driving schools.It falls to me to thank you for all you have done for the association.The association needs to win back former members who have allowed their subscriptions to lapse.As chairman of the association, he held office for over 20 years.The aim of the association is to perpetuate the skills of traditional furniture design.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nassociation noun\n(INVOLVEMENT)\nC1 [ U ] the fact of being involved with or connected to someone or something: her association with the university This event was organized in association with a local school.\n[ C or U ] a feeling or thought that relates to someone or something: The beach has positive associations for me as I used to spend my holidays there.\nMore examplesFewer examplesHis wife's association with a former criminal was a constant source of embarrassment for the prime minister.He began his long association with the New York City Opera in 1943.The book was published in association with a local charity.This part of the country held many pleasant associations for her.People were suspicious of his past association with right-wing groups.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nthick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings - general words\nassociation noun\n(GROUP SPENDING TIME)\nAdd to word list\nAdd to word list\n[ C ] a group of people united in an organization because of their common interests: The AARP, the American Association of Retired Persons, is a huge organization with millions of members.\nAdd to word list\nAdd to word list\n[ C ] (written abbreviation especially US assn, written abbreviation especially US Assn, written abbreviation Assoc) a group of people or organizations who work together for a particular purpose, often used in the names of particular organizations: The creation of more part-time jobs is supported by the employers' association. a business/professional/national association president of the American Bar Association\n[ C or U ] the fact of being involved with other people or organizations that have the same purpose as you: association with sb/sth We have had a very long and productive association with the firm. Manchester Business School, in association with the Chartered Institute of Marketing, offers a top marketing qualification for professionals. See also\narticles of association\nbrand association\nbuilding and loan association\nconsumer association\nfreedom of association\nhousing association\nindustry association\nmemorandum of association\nsavings and loan association\nstaff association\ntrade association"}