{"id":21867,"name":"associate","type":"verb","us_sound":"əˈsoʊ.ʃi.eɪt","us_link":"../audio/a/associate_01_00.mp3","uk_sound":"əˈsəʊ.si.eɪt","uk_link":"../audio/a/ukassiz004.mp3","content":"Add to word list\nAdd to word list\nC1 to connect someone or something in your mind with someone or something else: associate sth with Most people associate this brand with good quality.\nMore examplesFewer examplesMost people associate troglodytes with prehistoric times, but troglodyte communities still exist in Tunisia and China.Both politicians have been closely associated with the movement for some time.He has been associated with some dubious characters.I am happy, indeed proud, to be associated with this project.One or two of the earlier photos reveal an intriguing androgyny not normally associated with the actress.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nPhrasal verbs\nbe associated with something\nassociate with someone\nassociate noun [C]\n(FRIEND)\nsomeone who is closely connected to another person as a companion, friend, or business partner: A close associate of the author denied reports that she had cancer.business associate Mr. Shelton had a meeting that afternoon with a business associate.\nMore examplesFewer examplesWe entertain a lot of people, mainly business associates of my wife's.Only close friends and associates were invited.The book, written by a former associate, attacked the president's style of government.I'd like you to meet a business associate of mine.Former associates of the dictator were forced to testify against him.\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintance\nacquaintanceship\nacquainted\nacquainted with someone\namigo\ncompatriot\ncomrade\ncrony\ncrowd\nfair-weather friend\nfam\nflatmate\nintimate\nneighbour\noppo\npal\npeeps\npeer group\npen pal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmployees & colleagues\nassociate noun [C]\n(QUALIFICATION)\nUS someone who holds an associate's degree: an associate of arts\nSMART Vocabulary: related words and phrases\nQualifications: university & college\nAB\nassociate's degree\nBA\nbaccalaureate\nbachelor's degree\ndouble major\nDPhil\nemerita\nemeritus\ngraduation\nhonorary\nMaster's degree\nMB\nMBA\nMPhil\nMSc\npostgraduate\nPostgraduate Certificate in Education\nsumma cum laude\ntripos\nSee more results »\nused in the title of a person whose rank is slightly lower or less complete than the full official position described: an associate member of an organization associate director/producer\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nassociate verb\n(SPEND TIME)\nAdd to word list\nAdd to word list\n[ I always + adv/prep ] to spend time with someone or have some connection with someone or something: I don’t want you associating with that wild crowd anymore.\nassociate verb\n(CONNECT MENTALLY)\n[ T ] to think about something as being connected to something else: He always associated that perfume with Lila.\nsomeone who is connected to another person as a business partner or companion: Claire invited several business associates to dinner.\nAn associate is also a person who has a position in a job or type of work that is just below the top position: an associate director/professor\nAdd to word list\nAdd to word list\nWORKPLACE a business partner, or someone that you work with: He considered the possibility of a buy-out of the company with the help of business associates. a former/close/senior associate\nAssociates [ plural ]\nWORKPLACE\n&#160; (written abbreviation Assoc) used in the names of some companies that are run by a group of people: Brown &amp; Associates Inc. are a Chicago-based investment firm.\na person who does a similar job to someone else but does not have all the responsibilities of the main position, or a member of an organization who does not have all the rights of a full member: Associates are entitled to use the facilities, but are not entitled to vote.\nWORKPLACE used in some job titles where someone does the job described but does not have all the responsibilities of the main position: associate editor/director/lawyer\nused to describe a person, country, company, etc. that is a member of an organization but does not have all the rights given to a normal member: The firm's application for associate membership of the FSA was approved.\nassociate member\na member of an organization who does not have all the rights given to normal members: The board elected 18 foreign associate members who hold no voting rights."}