{"id":21938,"name":"assume","type":"verb","us_sound":"əˈsuːm","us_link":"../audio/a/assume.mp3","uk_sound":"əˈsjuːm","uk_link":"../audio/a/ukassiz012.mp3","content":"assume verb [T]\n(ACCEPT)\nAdd to word list\nAdd to word list\nB2 to accept something to be true without question or proof: We mustn't assume the suspects' guilt. [ + (that) ] I assumed (that) you knew each other because you went to the same school. Let's assume that they're coming and make plans on that basis. [ + to infinitive ] We can't assume the suspects to be guilty simply because they've decided to remain silent.\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\nMore examplesFewer examplesIf you haven't heard by Friday, assume I'm not coming.She was young and she was wearing student-type clothes so I assumed she was studying here.There was a knock at the door. Now Jan knew her mother had promised to visit, so she assumed it was her.They were chatting quite amiably on the phone last night so I assumed everything was okay.I assumed things had gone well for him as he had a big grin on his face.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nconceptualization\nguess\nimagine\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nmanifesting\nreach\nrevisualization\nriot\nrun riot idiom\ntheorize\nthink of something\nthrow\nvision\nSee more results »\nassume verb [T]\n(PRETEND TO HAVE)\nto pretend to have a different name or be someone you are not, or to express a feeling falsely: Moving to a different town, he assumed a false name. He assumed a look of indifference but I knew how he felt.assume an identity During the investigation, two detectives assumed the identities of antiques dealers.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nbelieve\nbluff someone into something/doing something\nchangeling\ncharlatan\ncry\nfalse\nfalse modesty\nfalsifiable\nfalsify\nfeign\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nassume verb [T]\n(TAKE CONTROL)\nC2 to take or begin to have responsibility or control, sometimes without the right to do so, or to begin to have a characteristic: She is likely to assume the position of team captain next season. I didn't want to assume the risk of trying to fix the car myself. The new president assumes office at midnight tonight. The issue has assumed considerable political proportions (= has become a big political problem).assume control The terrorists assumed control of the plane and forced it to land in the desert.assume responsibility If you leave your belongings here, we cannot assume responsibility for what happens to them.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassumption\nauthoritative\nauthoritatively\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\ngovern\nguiding principle\nharness\npaternalistically\nperemptorily\nperemptory\nplay God idiom\nplenipotentiary\ntame\nwrangle\nwrangler\nSee more results »\nassume verb [T]\n(ACCEPT)\nAdd to word list\nAdd to word list\nto accept something as true without question or proof: [ + (that) clause ] We can’t assume (that) he’s innocent simply because he says he is. [ + (that) clause ] I assumed (that) nobody was home because the car wasn’t in the driveway.\nassume verb [T]\n(PRETEND)\nto pretend to be someone you are not, or to express a feeling falsely: During the investigation, two detectives assumed the identities of antique dealers. Jim assumed a look of indifference.\nassume verb [T]\n(TAKE CONTROL)\nto take control or claim authority, sometimes without the right to do so: The new president assumes office in January.\nIf you assume responsibility for something, you become responsible for it.\nAdd to word list\nAdd to word list\nto begin to take control of something: assume control/office/a role Europe has assumed a leadership role in the prevention of future global crises.assume responsibility for sth The FSA said mortgages would not be affected when it assumed responsibility for the regulation of mortgage sales.assume a debt/mortgage/risk In addition to paying $3 billion in cash, the newspaper group will assume $600 million of the company’s debt.\nto accept that something is true without being sure about it: We are assuming a 6% growth in sales.assume that We can safely assume that we are ahead of the competition with this product. Assuming that all goes well, how long is the project expected to take?\nto be based on a particular idea: These figures assume that inflation will rise no higher than 2%."}