{"id":21951,"name":"assumption","type":"noun","us_sound":"əˈsʌmp.ʃən","us_link":"../audio/a/assumption.mp3","uk_sound":"əˈsʌmp.ʃən","uk_link":"../audio/a/ukassiz014.mp3","content":"assumption noun\n(BELIEF)\nAdd to word list\nAdd to word list\nC1 [ C ] something that you accept as true without question or proof: People tend to make assumptions about you when you have a disability. These calculations are based on the assumption that prices will continue to rise.\nMore examplesFewer examplesThey make the naive assumption that because it's popular it must be good.The sales forecast is predicated on the assumption that the economy will grow by four percent this year.There's an unspoken assumption in the department that Sue will take over the post when Ian leaves.He premised his argument on several incorrect assumptions.The assumptions made about the economy's rate of growth proved to be incorrect.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nbet\nconjecturally\nconjecture\ncounterfactual\neducated guess\nestimate\nmisestimation\noverestimate\noverestimation\npreception\npreconception\nproposition\nre-estimate\nsneaking\nspeculation\nspeculatively\nsupposition\nsuspicion\nSee more results »\nassumption of power, responsibility, etc. [ U ]\nthe act of taking a position of power, responsibility, etc.: The revolutionaries' assumption of power took the army by surprise.\nSee more\nassumption noun\n(ACCEPTING AS TRUE)\nAdd to word list\nAdd to word list\n[ C ] a willingness to accept something as true without question or proof: [ + that clause ] The plan was based on the assumption that the schedule could be substantially speeded up by adding more people.\nassumption noun\n(CONTROL)\n[ U ] the act of taking control or claiming authority: Her assumption of the post of ambassador was a significant development.\nAdd to word list\nAdd to word list\n[ S ] something that you accept as true, although you have no proof: make an assumption about sb/sth We tend to make assumptions about our staff's ability based on very little evidence.on the assumption that They decided to go ahead on the assumption that the figures they had been given were accurate. These calculations are based on the assumption that sales will continue to rise.\n[ U ] the act of taking control of something: the assumption of power by the army The offer includes $1 billion in cash and the assumption of $3.5 billion in debt for TWA's aircraft leases."}