{"id":21966,"name":"assured","type":"adjective","us_sound":"əˈʃʊrd","us_link":"../audio/a/usaspid024.mp3","uk_sound":"əˈʃɔːd","uk_link":"../audio/a/ukassiz017.mp3","content":"assured adjective\n(CONFIDENT)\nAdd to word list\nAdd to word list\nshowing skill and confidence: an assured performance Synonyms\nassertive\nconfident\nself-assertive\nself-confident approvingSee also\nself-assured approving\nThesaurus: synonyms, antonyms, and examples\ncertain of your abilities or valueconfidentHe was confident that his approach would work best.assuredShe gave an assured performance to a packed concert hall.self-assuredThe interview showed her as a very self-assured woman.self-confidentHe was self-confident and sure he'd get the job. assertiveYou'll have to be more assertive if you want to be promoted.boldHe was a bold and defiant little boy.\nSee more results »\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nassured adjective\n(CERTAIN)\ncertain to be achieved or obtained: Now that the financing has been secured, the production of the film is assured.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassuredly\ndeffo\ndefinite\ndefinitely\ndefinitive\ndefinitively\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nnatch\nsolidity\nsolidly\nsquarely\nwould\nyou can bet your life idiom\nSee more results »\nAdd to word list\nAdd to word list\ncertain to happen or be achieved: The agreement required South Korea to provide an assured market for American products. assured income/profit\nINSURANCE that is referred to in an assurance agreement: The \"sum assured\" is normally the amount that will be paid out on a policy when the policy matures, or if you die before the term. This person will collect the benefit if the life assured (person named in the assurance policy) dies before the policy matures.\n-assured\nused in compound words to refer to products that meet certain quality standards: farm-assured meat quality-assured processes/standards\nthe assured\nINSURANCE a person who is named in an insurance agreement , especially for a type of insurance that will pay them money at the end of an agreed period, or the person who has the right to receive the money when the person named in the insurance agreement dies"}