{"id":21965,"name":"assure","type":"verb","us_sound":"əˈʃʊr","us_link":"../audio/a/ashore.mp3","uk_sound":"əˈʃɔːr","uk_link":"../audio/a/epd31240.mp3","content":"assure verb [T]\n(SAY WITH CERTAINTY)\nAdd to word list\nAdd to word list\nB2 to tell someone confidently that something is true, especially so that they do not worry: assure sb of sth The unions assured the new owners of the workers' loyalty to the company.rest assured You can rest assured (= feel confident) that I shall be there as promised. [ + speech ] \"Don't worry, your car will be ready tomorrow,\" the mechanic assured him. [ + (that) ] She assured him (that) the car would be ready the next day. The prime minister assured the electorate taxes would not be increased after the election.\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nMore examplesFewer examplesThe police have assured the public that the escaped prisoners will not evade recapture for long.The Foreign Secretary assured anti-federalist MPs that he would not agree to anything which limited British sovereignty.She assured me that my fears were baseless.\"Rest assured, Mrs. Cooper\" said the police officer. \"We will find your son for you.\"Breaking your leg isn't funny , I can assure you.\nSMART Vocabulary: related words and phrases\nReassuring\nassure someone of something\nbe/take a weight off your mind idiom\nblandishments\ncalm (someone) down\ncomforting\nconsolation\nconsole\nconsoling\nconsolingly\nlighten\nmind\nreassurance\nreassure\nreassuring\nset/put someone's mind at rest/ease idiom\nsettle down\nshould\nthey should worry! idiom\nweight\nyou do you idiom\nSee more results »\nassure verb [T]\n(MAKE CERTAIN)\nC1 to cause something to be certain: The play's popularity has been assured by the critics' rave reviews.\nMore examplesFewer examplesJournalists may enter the danger zone but unfortunately we cannot assure their safety.A last-minute deal assured the company's future.A second goal moments from the end assured us of a place in the final.Excellent exam results meant that she was assured of a place at university.An anonymous donation assured the museum's long-term future.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsquarely\nwatertight\nwould\nyou can bet your life idiom\nSee more results »\nassure verb [T]\n(PROTECT)\nUK (of an organization) to promise to pay an amount of money to a person or their family if that person becomes ill, gets injured, or dies, in return for small regular payments\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nassessor\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nassure verb [T]\n(PROMISE)\nAdd to word list\nAdd to word list\nto promise or tell something to someone confidently or firmly, or to cause someone to feel certain by removing doubt: She assured him (that) the check was in the mail. The governor assured the voters (that) taxes would not be raised.\nassure verb [T]\n(MAKE CERTAIN)\nto cause something to be certain: Her future was assured when her performance drew rave reviews from all the critics."}