{"id":21945,"name":"assuming","type":"verb","us_sound":"əˈsuːm","us_link":"../audio/a/assume.mp3","uk_sound":"əˈsjuːm","uk_link":"../audio/a/ukassiz012.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nassume\nassume verb [T]\n(ACCEPT)\nB2 to accept something to be true without question or proof: [ + (that) ] I assumed (that) you knew each other because you went to the same school. Let's assume (that) they're coming and make plans on that basis. [ + to infinitive ] We can't assume the suspects to be guilty simply because they've decided to remain silent. We mustn't assume the suspects' guilt.\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\nMore examplesFewer examplesIf you haven't heard by Friday, assume I'm not coming.She was young and she was wearing student-type clothes so I assumed she was studying here.There was a knock at the door. Now Jan knew her mother had promised to visit, so she assumed it was her.They were chatting quite amiably on the phone last night so I assumed everything was okay.I assumed things had gone well for him as he had a big grin on his face.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nassume verb [T]\n(PRETEND TO HAVE)\nto pretend to have a different name or be someone you are not, or to express a feeling falsely: Moving to a different town, he assumed a false name. During the investigation, two detectives assumed the identities of antiques dealers. He assumed a look of indifference but I knew how he felt.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse\nfalse modesty\nfalsifiable\nfalsify\nmountebank\nout-bluff\npass something off as something\nphoney\nphony-baloney\nprofessed\npurport\nquackery\nSee more results »\nassume verb [T]\n(TAKE CONTROL)\nC2 to take or begin to have responsibility or control, sometimes without the right to do so, or to begin to have a characteristic: The new president assumes office at midnight tonight. The terrorists assumed control of the plane and forced it to land in the desert. The issue has assumed considerable political proportions (= has become a big political problem).\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »"}