{"id":21246,"name":"asymmetric","type":"adjective","us_sound":"ˌeɪ.sɪˈmet.rɪk","us_link":"../audio/a/usastir025.mp3","uk_sound":"ˌeɪ.sɪˈmet.rɪk","uk_link":"../audio/a/ukasund003.mp3","content":"Add to word list\nAdd to word list\nwith two halves, sides, or parts that are not exactly the same in shape and size: Lisette came back from New York with a trendy asymmetric haircut. Some of the rugs have regular geometric designs and others are decorated with asymmetric shapes. His slightly asymmetrical features make his face more interesting.\ninvolving actions or parts that are not similar or not balanced, especially because one is much bigger or more powerful than the other: He spoke about the asymmetric nature of many of the conflicts in the world today. Though both sides have responsibilities under the agreement, their relationship is asymmetrical. See also\nasymmetric warfare\nmathematics\n&#160; specialized An asymmetric distribution (= the number of times each value of a variable is found in a set of data, shown as a graph, chart, etc.) is not balanced, so that there are more values at either the higher or lower end: We anticipated this asymmetric score distribution.\nMore examplesFewer examplesThe craze for asymmetric styles has produced a lot of one-shoulder tops this summer.Some patients develop back problems due to asymmetric weakness.The shape of the curve is asymmetric.Asymmetric information is when each side in the negotation is in possession of a slightly different set of facts. Economic development and political development in the country proved to be asymmetrical.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometrical shapes\nBalance and imbalance\nStatistics\nOpposite\nsymmetricalRelated words\nsymmetry\nasymmetry\nasymmetrically"}