{"id":22377,"name":"at","type":"preposition","us_sound":"æt","us_link":"../audio/a/at.mp3","uk_sound":"æt","uk_link":"../audio/a/ukasund007.mp3","content":"at preposition\n(PLACE)\nAdd to word list\nAdd to word list\nA1 used to show an exact position or particular place: We'll meet you at the entrance. That bit at the beginning of the film was brilliant. She's sitting at the table in the corner. She was standing at the top of the stairs. The dog came and lay down at (= next to) my feet. There's someone at the door (= someone is outside and wants to come in). We spent the afternoon at a football match. I enjoyed my three years at university. I called her but she was at lunch (= away, eating her lunch).\nMore examplesFewer examplesSecurity checks have become really strict at the airport.She works on the checkout at the local supermarket.The two vans collided at the crossroads.Why wasn't Stephen at the meeting, then?Turn left at the traffic lights, and you'll see the hospital straight ahead.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\nintra-\ninward\nmidst\non a dime idiom\ntherein\nthick\ntrack\nSee more results »\nat preposition\n(TIME)\nA1 used to show an exact or a particular time: There's a meeting at 2.30 this afternoon. Are you free at lunchtime? In theory, women can still have children at the age of 50. The bells ring at regular intervals through the day. At no time/point did the company do anything illegal. I'm busy at the moment (= now) - can you call back later? It's a shame I wasn't here to meet you - I was overseas at the time (= then).\nMore examplesFewer examplesPeople in Britain legally reach adulthood at 18.Rioters hurled rocks and petrol bombs in clashes with police at the weekend.My last class ends at 4 o'clock.I always like to leave my desk clear at the end of the day.I was married with four children at your age.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\nat preposition\n(DIRECTION)\nA1 in the direction of: She smiled at me. They waved at us as we drove by. She aimed at the target. \"Look at me! Look at me!\" called the little girl. He's always shouting at the children.\nMore examplesFewer examplesThe old man clenched his fist and waved it angrily at us.She could no longer contain her anger and shouted at him uncontrollably.The talks are aimed at finding a mutually agreeable solution.She darted an angry look at me and I shut up.He fired six shots at the target, but his aim was terrible, and he missed all of them.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nup\nward\nway\nwise\nSee more results »\nat preposition\n(CAUSE)\nA2 used to show the cause of something, especially a feeling: We were surprised at the news. I was quite excited at the prospect. Why does no one ever laugh at my jokes?\nMore examplesFewer examplesThere was a chorus of disapproval at his words.It was a courageous decision to resign in protest at the company's pollution record.He looked very disappointed at their decision, but did not argue.I cringed at the sight of my dad dancing.We were all delighted at the news.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nat preposition\n(ACTIVITY)\nB1 used to show the activity in which someone's ability is being judged: I was never very good at sports. He's very good at getting on with people. She's hopeless at organizing things.\nMore examplesFewer examplesI'm not much good at knitting .Dave is normally very bad at remembering birthdays.I expected her to be better at French after studying it for so many years.Your mother's really brilliant at Scrabble.You're even worse at maths than I am!\nat preposition\n(EMAIL ADDRESS)\nA1 the @ symbol that joins the name of a person or a department in an organization to a domain name to make an email address: \"What's your email address?\" \"It's dictionary at cambridge dot org.\"\nMore examplesFewer examplesGranddad wrote 'at' in the address instead of the @ symbol - that's why it didn't work.Where is the key for 'at' on this keyboard?You missed out the @ in your email address.Hold down the shift key, otherwise you will type an inverted comma instead of an 'at' sign.Alternatively, you can email your order to directcustserve@cambridge.org.\nSMART Vocabulary: related words and phrases\nInternet, email and texting conventions\na/s/l\nafaik\nafk\nbak\nBC\nf2f\nhth\nICYMI\nidk\niirc\nikr\nOOO\notoh\npersonalization\npita\npmji\nttfn\nunfollow\nunmute\nYOLO\nSee more results »\nat preposition\n(AMOUNT)\nB2 used to show a price, temperature, rate, speed, etc.: I'm not going to buy those shoes at $150! Inflation is running at 5 percent. He was driving at 120 mph when the police spotted him.\n(usually @) used in financial records to show the price, rate, etc. of a particular thing or of each of a number of things on a list: 50 units @ £4.75\nMore examplesFewer examplesThe costs of cleaning up the bay are estimated at $1 billion.We sell a wide range of cosmetics and toiletries at a very reasonable price.When you buy a new computer, you usually get software included at no extra cost .With inflation at 500%, the country faces a crisis of confidence.Water boils at 212° Fahrenheit and 100° Celsius/Centigrade.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecific signs and symbols\nat preposition\n(CONDITION)\nused to show a state, condition, or continuous activity: a country at war children at play\nMore examplesFewer examplesHe felt completely at ease.He says he's at peace when he's walking in the mountains.Your father is hard at work in his study.They've been at war for the last five years.Of the ten men who escaped this morning from Dartmoor Prison, only two are still at liberty .\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nSee also\nwhile sb is at it informalGrammar\nAtAt is a preposition. We use at to refer to time or place. We also use it to refer to activities. …\nAt: timeWe use at to talk about points in time, ages and some periods of time: …\nAt: placeWe use at to describe a position or location seen as a point: …\nAt: group activitiesWe use at to refer to activities which involve a group of people: …\nGood at, bad atWe use adjective + at to talk about things that we do well or badly: …\nAt: numbersIn specific contexts, we use at with numbers. …\nAt: directionWe use at after a verb when we are talking about directing something towards another person or thing, often with verbs of perception and communication (smile at, shout at, wave at): …\nAt or at theWhen we talk about buildings, we often use at the to refer to the building itself. When we refer to the activity that happens in the building, we don’t use the after at or in: …\nAt: typical errorsWhen we talk about how well or badly we do something, we say good/bad at, not in: …\nAt, in and to (movement)We use to when we are talking about movement in the direction of a point, place, or position: …\nAt, on and in (place)We use at: …\nAt, on and in (time)We use at: …\nOther uses of in with timeWe use in to say how long it takes someone to do something: …\nTime expressions without at, on, inWe don’t normally use at, on or in before time expressions beginning with each, every, next, last, some, this, that, one, any, all: …\nAt, on and in (time): typical errorsWe use on not at to talk about a particular day: …\nIdioms\nbe at it\nbe at it again\nat preposition\n(PLACE/TIME)\nAdd to word list\nAdd to word list\nused to show a particular place or a particular time: I’ll meet you at the theater at 7:45 tonight. Call me at work. There’s someone at the door (= outside the door). I wasn’t here to meet you because I was in Detroit at the time (= then).\nat preposition\n(DIRECTION)\nin the direction of: They waved at us as we drove by. She aimed at the target, but missed.\nat preposition\n(CAUSE)\nused to show the cause of something, esp. a feeling: I was so happy at the news.\nat preposition\n(CONDITION)\nused to show a state, condition, or continuous activity: The country was at peace/war. I love watching the children at play. She was hard at work (= working hard).\nat preposition\n(AMOUNT)\nused to show a price, temperature, rate, speed, etc.: They’re selling these coats at 30% off this week.\nat preposition\n(JUDGMENT)\nused to show the activity in which someone’s ability is being judged: I’m really not very good at math. Sheila is really terrible at getting to places on time.\nat preposition\n(THE MOST)\nused before a superlative: I’m afraid we can only pay you $12 an hour at (the) most. At best you’ll get to speak to some assistant – you’ll never reach anyone important."}