{"id":22936,"name":"attachment","type":"noun","us_sound":"əˈtætʃ.mənt","us_link":"../audio/a/attachment.mp3","uk_sound":"əˈtætʃ.mənt","uk_link":"../audio/a/ukatomi016.mp3","content":"attachment noun\n(PART)\nAdd to word list\nAdd to word list\nB2 [ C ] an extra piece of equipment that can be added to a machine: This food processor has a special attachment for grinding coffee.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nMore examplesFewer examplesMany British homes have a shower attachment fixed to the bath taps.This little attachment allows you take photographs using your mobile phone.The hairdryer comes with a special attachment which enables you to dry your hair gently.This attachment makes it easier to vacuum stairs.You can buy an attachment that turns your drill into a screwdriver.\nSMART Vocabulary: related words and phrases\nThings added or attached to other things\naccessory\nadd on something\nadded value\naddition\nadjunct\nadmixture\nappurtenance\nbelay\nfashion accessory\nfrill\nfrippery\nhereto\njacked up\nmounted\nnew addition\nnon-detachable\nonto\nshim\nsuperaddition\ntrimming\nattachment noun\n(COMPUTING)\nB2 [ C ] a computer file that is sent together with an email message: I'll email my report to you as an attachment. I wasn't able to open that attachment.\nMore examplesFewer examplesThe paperclip symbol next to the email's subject line shows that there is an attachment.If it's possible that the attachment might be infected, don't open it, just delete it.I'll send you the full document as an attachment.Her email has several attachments that you should look at.Clicking on this button allows you to make attachments to your email.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nattachment noun\n(FEELING OF LOVE)\nC2 [ C or U ] a feeling of love or strong connection to someone or something: At university I formed a strong attachment to one of my tutors. She is unlikely to give up her lifelong attachment to feminist ideas.\n[ C or U ]\n&#160; psychology\n&#160; specialized a feeling of love and need for another person, for example for a mother by her child: Secure attachment is believed to be important for healthy development. Infants can form attachments to any caregiver.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealth in general\nattachment noun\n(TAKING GOODS)\n[ C or U ]\n&#160; law\n&#160; UK specialized the act of arresting a person for failing to obey the order of a court, or of officially taking their property because they have failed to pay money that they owe\nSMART Vocabulary: related words and phrases\nArresting & charging\napprehend\napprehension\narrest\nassist\nattach\nbust\nbusted\ncollar\nfed\nhandcuff\nhandcuffs\nhouse arrest\nknock\nnail\npick\npick someone/something up\npolice action\npost-arrest\nprobable cause\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nAdd to word list\nAdd to word list\na strong feeling of being emotionally close to someone or something: [ C ] She had a special attachment to these students.\nAn attachment is an extra piece of equipment that can be added to a machine: [ C ] computer attachments\nAdd to word list\nAdd to word list\n[ C ]\n&#160; IT, COMMUNICATIONS, INTERNET a computer file that is sent together with an email: Do not click on an email attachment unless it is from a reliable source.\n[ C ]\n&#160; LAW a document joined to an agreement which gives extra details, often a list of things that are allowed or not, and forms part of the agreement\n[ C ]\n&#160; IT a small piece of equipment that you can attach to a computer, machine, etc. to do a particular task: A simple attachment allows pictures to be emailed directly from the camera.\n[ C or U ]\n&#160; HR the act of working in a department or company temporarily for a particular purpose: Five students are on attachment to the Finance Department.\n[ C or U ]\n&#160; LAW a court order for money or property to be taken from someone in order to pay their debts: An application for an attachment of debt must be made to a court.\nattachment of earnings\n[ C or U ]\n&#160; LAW a court order that makes employers pay the court some of the money you earn directly so that your debts can be paid over a period: The court issued him with an attachment of earnings order to repay his creditors over a period of 18 months."}