{"id":23031,"name":"attention","type":"noun","us_sound":"əˈten.ʃən","us_link":"../audio/a/eus70362.mp3","uk_sound":"əˈten.ʃən","uk_link":"../audio/a/ukatomi026.mp3","content":"attention noun [U]\n(NOTICE)\nAdd to word list\nAdd to word list\nB1 notice, thought, or interest: Ladies and gentlemen, could I have your attention, please? They're organizing a campaign to draw people's attention to the environmentally harmful effects of using their cars. Wait a moment and I'll give you my full/undivided attention (= I'll listen to and think about only you). After an hour, my attention started to wander (= I stopped taking notice). get/attract/catch someone's attention\nB2 to make someone notice you: I knocked on the window to get her attention.\nSee more pay attention (to something/someone)\nB1 to watch, listen to, or think about something or someone carefully or with interest: If you don't pay attention now, you'll get it all wrong later.\nSee more the centre of attention\nthe thing or person that a lot of people notice: He likes telling jokes and being the centre of attention at parties.\nSee more attentions [ plural ]\ninterest, often sexual interest, that someone directs towards a particular person or thing: She attracted the attentions of a variety of suitors. He was flattered by her attentions, but did not take them seriously. I suffered the unwanted attentions of bullies. turn your attention to something/someone (also turn your attentions to something/someone)\nto start to think about or consider a particular thing or person: Many countries are starting to turn their attention to new forms of energy.\nSee more\nMore examplesFewer examplesThe war has diverted attention away from the country's economic problems.Please excuse me from the rest of the meeting - I've just received a phone call that requires my immediate attention.He neglects that poor dog - he never takes him for walks or gives him any attention.I prodded her in the back to get her attention.Pay attention to what she's saying because she won't explain it a second time.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nExcitement, interest, energy and enthusiasm\nattention noun [U]\n(CARE)\n[ U ] special care or treatment: The paintwork will need a little attention. If symptoms persist, seek medical attention.\nSMART Vocabulary: related words and phrases\nMedical treatment: treating & caring for people\naggressively\nbed blocker\nbed-blocking\nbring\nbring someone around\nclinic\nhealth tourism\nkeep your/an eye on something/someone idiom\nlogroll\nlogrolling\nlook after someone/something\nnurse\npatch\nprep\nrehospitalization\nrehospitalize\nrespite care\nself-care\nset something up\ntend\nSee more results »\nattention noun [U]\n(WAY OF STANDING)\n[ U ] (especially in the armed forces) a way of standing, with the feet together, arms by your sides, head up, and shoulders back, and not moving: soldiers standing at/to attention\nSMART Vocabulary: related words and phrases\nMilitary training & ceremonies\nassault course\ncivil defence\ndrumhead\nease\nfall\nfall in\nguard\nmanoeuvre\nmilitary honours\nmilitary service\nnational service\nobstacle course\npass\npassing-out\nrecon\nreveille\ntattoo\ntour\ntroop\nwar game\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSitting and standing\nmilitary\n&#160; specialized in the armed forces, an instruction to stand to attention (= not moving, with your feet together, arms by your sides, head up, and shoulders back): The command comes: \"Attention!\" The men fire their rifles. The flag is folded.\nan instruction for people to listen or look carefully because they need to know something important: Attention please! Luggage must not be left unattended! There was a sign at the ticket desk: \"Attention! Visitors are informed that there is video surveillance in the building.\"\nSMART Vocabulary: related words and phrases\nMilitary training & ceremonies\nassault course\ncivil defence\ndrumhead\nease\nfall\nfall in\nguard\nmanoeuvre\nmilitary honours\nmilitary service\nnational service\nobstacle course\npass\npassing-out\nrecon\nreveille\ntattoo\ntour\ntroop\nwar game\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying attention and being careful\nattention noun [U]\n(NOTICE)\nAdd to word list\nAdd to word list\nthe act of directing the mind to listen, see, or understand; notice: In order to learn anything, you have to pay attention. It’s hard to command the attention of 23 eight-year-olds. Let me finish this, then I’ll give you my undivided attention.\nattention noun [U]\n(CARE)\ntime or effort that you are willing to give to help someone or something because you care about that person or thing: It’s an old house, and it needs a lot of attention.\nattention exclamation, noun [U]\n(WAY OF STANDING)\n(in the armed forces) an order to stand straight and not move, with your feet together, arms by your sides, and head facing to the front, or this way of standing: Each cadet stood at attention for inspection.\nfor the attention of sb ( written abbreviation FAO); ( written abbreviation attn)\nAdd to word list\nAdd to word list\nwritten on an envelope or at the top of a letter to show who should read it: Letters should be marked for the attention of Jane Mills."}