{"id":23061,"name":"attest","type":"verb","us_sound":"əˈtest","us_link":"../audio/a/attest.mp3","uk_sound":"əˈtest","uk_link":"../audio/a/ukatten004.mp3","content":"Add to word list\nAdd to word list\nto show, say, or prove that something exists or is true: Thousands of people came out onto the streets to attest their support for the democratic opposition party.attest to The number of old German cars still on the road attests to the excellence of their manufacture. As his career attests, he is a world-class tennis player.\n[ often passive ]\n&#160; law\n&#160; specialized to say officially, for example by signing your name, that a document such as a will (= a document in which a person says what should be done with their money and property after they die) has been written and signed correctly: be attested The will needs to be attested by three witnesses. A notary public is an individual authorized by the state to certify documents and attest to their authenticity. Generally, the testimony of at least one attesting witness is required to probate a will.\nMore examplesFewer examplesThe thing is — and my wife will attest to this — I am so insensitive I probably didn't notice.As any serious gamer will attest, online experiences can have real-life consequences.The exporter's signature may need to be attested by a witness.Any deletion or alteration made before the affidavit is sworn shall be attested by the commissioner.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nbespeak\nbreastbeating\nbring\nbring something forward\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProving and disproving\nOfficial documents\nAdd to word list\nAdd to word list\n(of a person) to state with authority that something is true, or (of a situation or event) to show that something is likely to be true: [ + that clause ] As one who worked there for years, I can attest that applications are carefully reviewed. [ I ] Her wealth was attested to by her fur coat and designer shoes.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; LAW to sign a document to show that you were present when it was signed by someone else: The will must be attested by two witnesses. The statement was signed and attested by a high court judge.\n[ I ]\n&#160; LAW to say officially that something is true or accurate: attest to doing sth Couples must attest to being in a committed relationship.attest to sth The commission demands that Chief Financial Officers personally attest to the accuracy of their financial statements.\n[ I ] to show that something is true: attest to sth The decline in sales attests to the fact that the product is out of date.\nattestation noun [ C or U ]\nThe report contains an auditor's attestation."}