{"id":23011,"name":"attendance","type":"noun","us_sound":"əˈten.dəns","us_link":"../audio/a/attendance.mp3","uk_sound":"əˈten.dəns","uk_link":"../audio/a/ukatomi024.mp3","content":"attendance noun\n(BEING PRESENT)\nAdd to word list\nAdd to word list\nC1 [ U or C ] the fact of going somewhere such as a church, school, etc. regularly: Attendance at lectures is compulsory.\nC1 [ C or U ] the number of people who go to an event, meeting, etc.: Attendances at church are falling.\nMore examplesFewer examplesAs the course becomes more difficult, there's usually a corresponding drop in attendance.At last month's meeting, attendance was poor.Attendance at the meeting was rather thin.Ticket prices were lowered in an attempt to increase attendance at home games.He failed the course because of his poor record of attendance.\nSMART Vocabulary: related words and phrases\nPresent\nall over\nappearance\nattend\nattendant\nbe in at the kill idiom\nbulk\nbulk large idiom\nfront\nimmanently\nin the flesh idiom\nkick\nkick around\nkill\nknock\npresent\nseropositive\nsit\nsit through something\nsynchronic\nsynchronically\nSee more results »\nattendance noun\n(PROVIDING HELP)\nin attendance\nC2 present with someone and helping or taking care of them : He never goes out without his security men in attendance.\nSee more\nAdd to word list\nAdd to word list\nthe fact of being at an event or going to a place: Attendance at rehearsals is required.\nAttendance is also the number of people present: Annual attendance at the museum is nearly 100,000.\nAdd to word list\nAdd to word list\nthe number of people who are present at a place or an event: average/poor/record attendance Average attendance has dropped noticeably since the ticket price increase. a decline/drop/increase in attendances\nHR the act of being present at something, especially work: attendance rate/figures The Royal Mail introduced a scheme in which employees with a 100% attendance rate would be entered into a prize draw. Attendance at this meeting is compulsory.\nin attendance\nwith someone and helping them or taking care of them: He never goes out without his personal assistant in attendance.\npresent at a place or event: Delegates in attendance at the conference included a number from blue-chip companies.\nSee also\ncertificate of attendance"}