{"id":23103,"name":"attitude","type":"noun","us_sound":"ˈæt̬.ə.tuːd","us_link":"../audio/a/attitude.mp3","uk_sound":"ˈæt.ɪ.tʃuːd","uk_link":"../audio/a/ukatten009.mp3","content":"attitude noun\n(OPINION)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a feeling or opinion about something or someone, or a way of behaving that is caused by this: It's often very difficult to change people's attitudes. [ + that ] She takes the attitude that children should be allowed to learn at their own pace. He has a very bad attitude to/towards work. He seems to have undergone a change in/of attitude recently, and has become much more cooperative. I don't like your attitude (= the way you are behaving). That boy has a real attitude problem (= behaves in a way that makes it difficult for other people to have a relationship with him or work with him).\nThesaurus: synonyms, antonyms, and examples\na feeling or opinion about something or someoneattitudeHis attitude towards authority has often got him into trouble.outlookI wish I could share your positive outlook on life.frame of mindI need to be in the right frame of mind to talk about this.approachIt's time to try a different approach to the problem.viewpointHis viewpoint is his own and does not affect how I think about the issue.point of viewFrom a strictly financial point of view it looks like a positive change.\nSee more results »\nMore examplesFewer examplesHer attitude has definitely changed for the better since she started this new job.The bishop criticized the government for its \"callous, uncaring attitude\" to the homeless and the unemployed.My relationship with my father played a major part in shaping my attitude towards men.Middle age can be the prime of life if you have the right attitude.He's often been accused of cynicism in his attitude towards politics.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\nsomeone's idea of something idiom\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving, interacting and behaviour\nattitude noun\n(CONFIDENCE)\n[ U ] If you say that someone has attitude, you mean that they are very confident and want people to notice them.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nattitude noun\n(POSITION)\n[ C ] literary a position of the body: She lay sprawled across the sofa, in an attitude of complete abandon.\nSMART Vocabulary: related words and phrases\nPosture\nbearing\ncarriage\ncarry\ncrossed\ndeportment\northostatic\npose\nposition\npostural\nposture\npower pose\npower posing\nsoldierly\nstrike\nstrike an attitude idiom\nsuck\nsuck something in\nIdiom\nstrike an attitude\nAdd to word list\nAdd to word list\nthe way you feel about something or someone, or a particular feeling or opinion: [ U ] Start each day with a positive attitude. [ C ] People’s attitudes toward family are set very early in life.\ninfml If you say that someone has an attitude, you mean that the person seems unwilling to be helpful or polite.\nAdd to word list\nAdd to word list\na feeling or opinion about something, especially when this shows in your behaviour: attitude towards sb/sth We need team players with a positive attitude towards work. What is your employer's attitude to equal opportunities?"}