{"id":23149,"name":"attracting","type":"verb","us_sound":"əˈtrækt","us_link":"../audio/a/attract.mp3","uk_sound":"əˈtrækt","uk_link":"../audio/a/ukatten011.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nattract\nB1 [ T ] (of people, things, places, etc.) to pull or draw someone or something towards them, by the qualities they have, especially good ones: These flowers are brightly coloured in order to attract butterflies. The circus is attracting huge crowds/audiences. The government is trying to attract industry to the area (= to persuade people to place their industry there). Her ideas have attracted a lot of attention/criticism in the scientific community.\nB2 [ T usually passive ] If you are attracted by or to someone, you like them, often finding them sexually interesting: He tends to be attracted to strong women. I like him, but I'm not physically/sexually attracted to him.\n[ T usually passive ] If something attracts you, or you are attracted by it, you like it and find it interesting: The idea of becoming a journalist attracted her. My parents were attracted by the school's curriculum, which puts equal emphasis on artistic, practical, and intellectual subjects. What attracted you to this role?\nThesaurus: synonyms, antonyms, and examples\nto draw your attention and interest youattractWe were attracted to the high street, with its variety of shops and cafés.drawThe game drew a crowd of 30,000.enticeThe smell of coffee enticed people to enter the shop.lureI was lured into the store by the smell of fresh bread.temptI was tempted by the offer of a free phone.seduceI wouldn't normally have bought this but I was seduced by the low price.\nSee more results »\nphysics\n&#160; specialized When something such as a magnet attracts something else, it pulls it towards it: Magnets attract iron filings. Since light has no mass, Newton's equation predicts that it will not be attracted by gravity towards anything.\nMore examplesFewer examplesThe mud flats attract large numbers of birds.The hotel is making a major push to attract customers.This film is unlikely to attract large audiences.The project has attracted considerable criticism from the scientific community .With its varied climate, the country attracts both winter and summer sports enthusiasts.I tend to be attracted to complicated, sometimes unsympathetic characters.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nclickbait\nhoney trap\nincentive\njump out at someone\nlure\nmagnetism\nmodesty\ntemptation\ntemptingly\ntickle someone's fancy idiom\nva-va-voom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: energy, force & power"}