{"id":23151,"name":"attraction","type":"noun","us_sound":"əˈtræk.ʃən","us_link":"../audio/a/attraction.mp3","uk_sound":"əˈtræk.ʃən","uk_link":"../audio/a/ukatten012.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] something that makes people want to go to a place or do a particular thing: Life in Los Angeles has so many attractions - nightclubs, good restaurants, and so on. tourist attractions The opportunity to travel is one of the main attractions of this job. Skiing holds no attraction for me.\nC2 [ U ] the feeling of liking someone, especially sexually, because of the way they look or behave: She felt an immediate physical attraction to him.\n[ U ]\n&#160; physics\n&#160; specialized a force by which things are pulled towards each other: gravitational attraction\nMore examplesFewer examplesThis building, once derided by critics, is now a major tourist attraction.He's not exactly good-looking, but he has a certain attraction.Life in London has so many attractions - nightclubs, good restaurants and so on.Major tourist attractions are a soft target for pickpockets.Disneyworld is one of Florida's major tourist attractions.\nSMART Vocabulary: related words and phrases\nVisiting\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncheck out\ncome round\nexchange\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\nlook around (somewhere/something)\npay\npop\nstop\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nswing by/past (something)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nAttracting and tempting\nPhysics: energy, force & power\nAdd to word list\nAdd to word list\na quality or force of someone or something that tends to pull others in or create interest in the person or thing: [ C ] The company’s excellent employee benefits package is a major attraction. [ U ] Sports hold little attraction for me.\nAn attraction is also something that makes people want to go to a place: [ C ] Florida has numerous tourist attractions.\nphysics Attraction is also the force of gravity (= force that makes objects fall toward earth), or the force of a magnet that pulls things toward it.\nAdd to word list\nAdd to word list\nsomething that people come to see because they are interested in it: The historic centre is one of the major visitor attractions of the city. See also\ntourist attraction"}