{"id":23251,"name":"auction","type":"noun","us_sound":"ˈɑːk.ʃən","us_link":"../audio/a/eus75479.mp3","uk_sound":"ˈɔːk.ʃən","uk_link":"../audio/a/ukatten027.mp3","content":"Add to word list\nAdd to word list\nC1 a usually public sale of goods or property, where people make higher and higher bids (= offers of money) for each thing, until the thing is sold to the person who will pay most: a furniture auction They're holding an auction of jewellery on Thursday. The painting will be sold at auction next week. The house and its contents are being put up for auction.\nMore examplesFewer examplesTwo senior officials have been entrusted with organizing the auction.Amongst other pop ephemera, the auction will be selling off rock stars' stage clothes.A rare Stradivarius violin failed to reach its reserve price when put up for auction on Tuesday.In an auction, goods or property are sold to the highest bidder.She bought the bed for a song at an auction.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction house\ncraft shop\ncreamery\ndeli\ndelicatessen\ndepartment store\nmart\nmeat market\nmedical hall\nmegastore\nmilk bar\nsupermarket\nsuperstore\nswap meet\nsweet shop\ntabletop sale\nSee more results »\nto sell something in a public auction: The stamps will be auctioned tomorrow. The family is auctioning (off) its art collection.\nThesaurus: synonyms, antonyms, and examples\nto sell somethingsellAre you selling your car?retailThe company makes and retails moderately priced sportswear.deal inThey mainly deal in rare books.divestUS The investors divested themselves of the company's stock.sell offThe company is selling off the less profitable parts of its business.\nSee more results »\nSMART Vocabulary: related words and phrases\nSelling\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\ncustomer service\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nPOS\nsell out\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nsupersize\nSee more results »\nAdd to word list\nAdd to word list\na usually public sale of goods or property, where people make higher and higher bids (= offers of money) for each item, until there are no higher bids and it is sold for the most money offered: [ C ] an auction of early American furniture [ U ] bulls sold at auction auction verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈɔk·ʃən/\nThe artwork is being auctioned to benefit UNICEF.\nAdd to word list\nAdd to word list\na public sale in which goods or property are sold to the person who offers the most money: sell sth at auction The painting was sold at auction for €12 million.hold an auction We held a charity auction in aid of the local hospital.be up/come up/go up/be put up for auction One of the prints recently came up for auction in the United States.an internet/online/public auction You can bid for it in an online auction. See also\nabsolute auction\ncall auction\nDutch auction\nopen-cry auction\nreverse auction\nsealed-bid auction\nuniform price auction\nto sell something in a public auction: The stamps will be auctioned tomorrow. The family is auctioning off its art collection."}