{"id":23324,"name":"audition","type":"noun","us_sound":"ɑːˈdɪʃ.ən","us_link":"../audio/a/eus75485.mp3","uk_sound":"ɔːˈdɪʃ.ən","uk_link":"../audio/a/ukaudac008.mp3","content":"Add to word list\nAdd to word list\nC1 a short performance that an actor, musician, dancer, etc. gives in order to show they are suitable for a particular play, film, show, etc.: His audition went well and he's fairly hopeful about getting the part. The director is holding auditions next week for the major parts.\nMore examplesFewer examplesShe was terribly nervous before the audition, but once she started singing she was fine.The director made some positive comments about my audition but I couldn't tell if he was genuinely impressed.Why don't you go along to the auditions for the school play? You're a good actor.They have already held the auditions for the main parts in the series.She sang really badly at her audition, so she didn't get into the choir.\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\nauteur\ncanister\ncomputer-animated\ndolly\nfilmmaking\nfog machine\nframing\nframing device\ngreen screen\nlinear\nprop\nrecut\nreshoot\nrestage\nrun through something\nscreen test\nspecial effect\nSee more results »\nto give a short performance in order to show that you are suitable for a part in a film, play, show, etc., or to make someone do this: I'm auditioning for the part of Lady Macbeth. We're auditioning local rock bands for the music festival.\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\nauteur\ncanister\ncomputer-animated\ndolly\nfilmmaking\nfog machine\nframing\nframing device\ngreen screen\nlinear\nprop\nrecut\nreshoot\nrestage\nrun through something\nscreen test\nspecial effect\nSee more results »\nAdd to word list\nAdd to word list\na short performance given by an actor, dancer, musician, or other performer that tests whether that person's skills are suitable for a particular event or group: The boys’ choir held rigorous auditions before each new member was admitted.\nto give, watch, or listen to a short performance that tests whether a performer’s skills are suitable for a particular event or group: [ I ] You’ll have to audition for the role. [ T ] They auditioned 125 dancers before choosing ten."}