{"id":23282,"name":"audience","type":"noun","us_sound":"ˈɑː.di.əns","us_link":"../audio/a/eus75482.mp3","uk_sound":"ˈɔː.di.əns","uk_link":"../audio/a/ukaudac005.mp3","content":"audience noun [C]\n(GROUP OF PEOPLE)\nAdd to word list\nAdd to word list\nB1 [ + sing/pl verb ] the group of people together in one place to watch or listen to a play, film, someone speaking, etc.: She lectures to audiences all over the world. The secret to public speaking is to get the audience on your side. The audience was/were clearly delighted with the performance. The magic show had a lot of audience participation, with people shouting things to the performers and going up on stage.\nThesaurus: synonyms, antonyms, and examples\nan audienceaudienceThe audience went wild after every song she sang.viewerThe show attracts millions of viewers every week.listenerListeners tune in regularly for his cheery banter.crowdThose New Yorkers can be a tough crowd to please.houseIt's a full house tonight.spectatorThe spectators cheered when the balloon went up.\nSee more results »\nB2 [ + sing/pl verb ] the (number of) people watching or listening to a particular television or radio programme, reading a particular book, or visiting a particular website: The television company has lost a large part of its audience since it changed its programming. Her latest book should appeal to a large audience (= many people will want to read it).\nMore examplesFewer examplesThe audience clapped and cheered when she stood up to speak.She announced the winner of the competition to an excited audience.She is a confident and practised speaker who always impresses her audience.The candidates engaged in a lively debate, witnessed by a huge television audience.The play shocked audiences when it was first performed.\nSMART Vocabulary: related words and phrases\nAudiences and spectators\nbehind closed doors idiom\nbums on seats idiom\nbystander\ncaptive audience\nclosed\nconsumption\nevangelistically\nfan park\nfly on the wall idiom\nflâneur\ngoer\nlooker-on\nnon-viewer\nobserver\nonlooker\npep rally\nspectator\nsupporter\nviewership\nwatcher\nSee more results »\naudience noun [C]\n(FORMAL MEETING)\na formal meeting that you have with an important person: She had a private audience with the king.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nmake yourself known idiom\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nAdd to word list\nAdd to word list\nthe people, considered as a group, who watch or listen to a performance, movie, public event, etc., either together in one place or separately: a live/television audience The magazine is trying to reach a younger audience.\nliterature The audience of a work of literature is the type of people the writer intended to read it.\nAn audience is also a formal meeting that you have with an important person: an audience with the president\nAdd to word list\nAdd to word list\nthe people who watch a particular television programme or film, read a particular book, etc.: to attract/reach/engage an audience The internet enables you to reach a global audience.target/address an audience Advertisers use these strategies to target specific audiences.a large/wide/mass audience The film will attract a wide audience.audience for sth The intended audience for the book are lawyers and students. Channel 9 has seen its audience share decline over the last 12 months. See also\ncore audience\ncumulative audience\nsecondary audience\ntarget audience"}