{"id":23813,"name":"author","type":"noun","us_sound":"ˈɑː.θɚ","us_link":"../audio/a/eus75489.mp3","uk_sound":"ˈɔː.θər","uk_link":"../audio/a/ukauror020.mp3","content":"Add to word list\nAdd to word list\nB1 the writer of a book, article, play, etc.: He is the author of two books on French history.\nformal a person who begins or creates something: She's the author of the company's recent success/of all our troubles.\nMore examplesFewer examplesThe author has tried to deal with a very difficult subject.In his preface, the author says that he took eight years to write the book.She's a best-selling author .He's the author of several hugely successful children's books .There was a biographical note about the author on the back of the book.\nSMART Vocabulary: related words and phrases\nPeople who write for work or pleasure\nautobiographer\nbelletrist\nblogger\nBraillist\nchronicler\ncolumnist\ncub reporter\nhumorist\nnovelist\npoet laureate\nsatirist\nscribbler\nscribe\nscriptwriter\nscrivener\nShakespeare\nsongwriter\nspeechwriter\nstylist\ntweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nformal to write a book, article, etc.: He has authored more than 30 books.\nmainly US to create something: The deal is being authored by a Greek diplomat.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nInventing, designing and innovation\nAdd to word list\nAdd to word list\na writer of a book, article, etc., or a person whose main job is writing books: a talented young author He is the author of seven books. author verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈɔ·θər/\nMurphy authored the new legislation.\nAdd to word list\nAdd to word list\nthe writer of a book, article, etc.: He is a best-selling author. The author of the report said his findings were very worrying.\na person who begins or creates something: The authors of the proposal want it to be adopted immediately.\nto write a book, article, etc.: She has authored a series of reports on the global energy crisis. The study was jointly authored by Smith and Wilks.\nto create something or formally suggest it: The Republican Congressman agreed to author the bill."}