{"id":23837,"name":"authority","type":"noun","us_sound":"əˈθɔːr.ə.t̬i","us_link":"../audio/a/eus70382.mp3","uk_sound":"ɔːˈθɒr.ə.ti","uk_link":"../audio/a/ukauror027.mp3","content":"authority noun\n(POWER)\nAdd to word list\nAdd to word list\nB2 [ U ] the moral or legal right or ability to control: The United Nations has used/exerted/exercised its authority to restore peace in the area. We need to get the support of someone in authority (= an important or high-ranking person). They've been acting illegally and without authority (= permission) from the council. [ + to infinitive ] I'll give my lawyers authority (= permission) to act on my behalf. He has no authority over (= ability to control) his students. She spoke with authority (= as if she was in control or had special knowledge).\nC1 [ C ] a group of people with official responsibility for a particular area of activity: the health authority the local housing authority the authorities [ plural ]\nthe group of people with official legal power to make decisions or make people obey the laws in a particular area, such as the police or a local government department: I'm going to report these potholes to the authorities.\nSee more\nMore examplesFewer examplesA good teacher has an easy authority over a class.Our new administrator seems to be trying to stamp her authority on every aspect of the department.The prime minister succeeded in surviving the challenge to his authority.He has no respect for authority whatsoever.Children challenge their parents' authority far more nowadays than they did in the past.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nbureaucrat\nchairman\ncouncil\ncounter-power\ndean\ndeputy\ndominatrix\nmistress\nmovers and shakers\nmulti-headed\nofficer\nofficialdom\nvice presidency\nvice president\nvicegerency\nvicegerent\nwarden\nSee more results »\nauthority noun\n(EXPERT)\nC2 [ C ] an expert on a subject: She's a world authority on 19th-century Irish history.\nSMART Vocabulary: related words and phrases\nExperts and specialists\nacademician\nartist\nboffin\nchild prodigy\nclimatologist\ndoyenne\nknow something inside out idiom\nlapidary\nLatin Americanist\nliterati\nmaven\npyrotechnician\nRenaissance man\nsavant\nsemiotician\nskilled\nwhizz\nwizard\nwonder\nwunderkind\nSee more results »\nIdiom\nhave something on good authority\nAdd to word list\nAdd to word list\nthe power to control or demand obedience from others: [ U ] The police have no legal authority in these disputes. [ U ] We have to find someone in authority (= a position of power).\nAn authority is someone with official responsibility for a particular area of activity: [ C ] government/church authorities\nThe authorities are the police or other government officials: No attacks were reported to the authorities.\nAn authority on a subject is an expert on it: [ C ] an authority on immigration law\nAdd to word list\nAdd to word list\n[ U ] the official power to make decisions for other people or to tell them what they must do: The Executive Committee can delegate authority to the Chairperson. He did not have enough authority within the company to make the decision.the authority to do sth The federal government has the authority to regulate phone service provided over the internet.authority over sb The accrediting board is the legal body with authority over the institution.\n[ U ] official permission or the legal right to do something: grant/give sb authority to do sth Under the new plan, counties would be given the authority to raise sales tax levels.the authority to do sth The company had the owner's authority to contract on his behalf.\n[ usually plural ]\n&#160; GOVERNMENT an official organization, often created by the government, which is responsible for managing a particular duty or service: the authorities All staff who work at the school must be registered and checked by the authorities.the housing/transit/tax authority The city's housing authority provides assisted housing for more than 130,000 residents.\n[ U ] the ability to influence other people and make them respect you, especially because you are confident or have a lot of knowledge: When answering questions at a job interview, be sure to speak clearly and with authority. As a manager he lacks authority.\n[ C ] someone who is an expert on a particular subject, and whose opinions influence other people: an authority on sth Today's speaker is one of the nation's leading authorities on fund-raising for non-profit groups. See also\ncertificate authority\nclassification authority\nthe Financial Services Authority\nhealth authority\nline authority\nlocal authority\nport authority\nthe Securities and Futures Authority"}