{"id":23842,"name":"authorize","type":"verb","us_sound":"ˈɑː.θɚ.aɪz","us_link":"../audio/a/authorize.mp3","uk_sound":"ˈɔː.θər.aɪz","uk_link":"../audio/a/ukauror029.mp3","content":"Add to word list\nAdd to word list\nC1 to give official permission for something to happen, or to give someone official permission to do something: Who authorized this expenditure? [ + to infinitive ] I authorized my bank to pay her £3,000.\nThesaurus: synonyms, antonyms, and examples\nto allow someone to do somethingallowAm I allowed to go to the park?letShe wanted to go but her parents wouldn't let her.permitSmoking is not permitted in any part of the building.have your permissionYou have my permission to stay out past midnight on Friday.authorizeWho authorized this expenditure?give something the go-aheadThe government has given the go-ahead for a multi-billion pound road-building project.\nSee more results »\nMore examplesFewer examplesThey have authorized awards of £900 to each of the victims.The prime minister authorized a pre-emptive air strike against the rebels.The government has authorized the army to sell its surplus weapons.Several unreliable dealers have been struck off our list of authorized suppliers.The United Nations has authorized the use of air strikes.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorized\nclearance\nconsent\nentrance\ngreen-light\nhall pass\nhospital admission\nimprimatur\nleft\nliberty\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nsufferance\nSee more results »\nRelated word\nauthorized\nAdd to word list\nAdd to word list\nto give official permission for something to happen, or to give someone official permission to do something: The board authorized a new contract. authorization noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˌɔ·θər·əˈzeɪ·ʃən/\n[ U ] I can’t issue a check without authorization.\nAdd to word list\nAdd to word list\nto give official permission for something to happen, or to give someone official permission to do something: The Board of Directors has authorized a share buy-back program for up to 60 million shares of the company.authorize sb to do sth Their technologies division has been authorised to sell, support, and train customers on the new mobile system. authorized adjective ( UK also authorised)\nauthorized retailers and wholesalers"}