{"id":23830,"name":"authoritarian","type":"adjective","us_sound":"əˌθɔːr.əˈter.i.ən","us_link":"../audio/a/authoritarian.mp3","uk_sound":"ˌɔː.θɒr.ɪˈteə.ri.ən","uk_link":"../audio/a/ukauror022.mp3","content":"Add to word list\nAdd to word list\ndemanding that people obey completely and refusing to allow them freedom to act as they wish: an authoritarian regime/government/ruler His manner is extremely authoritarian.\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nMore examplesFewer examplesHer management style is too authoritarian.The country's authoritarian regime maintains tight control over the media.He was the country's first democratically chosen leader after four decades of authoritarian rule.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPowerful people & dictators\nRelated word\nauthoritarianism\nsomeone who demands that people obey completely and refuses to allow them freedom to act as they wish: My father was a real authoritarian so we were brought up very strictly. Authoritarians demand rigid adherence to rules and an uncritical acceptance of authority.\nMore examplesFewer examplesHis critics attacked him as an authoritarian, and indeed he has a bullying streak.In the past, presidents with close ties to the military were authoritarians who used troops to quash dissent.His statement managed to please authoritarians while being just about reassuring enough to civil libertarians.\nSMART Vocabulary: related words and phrases\nSevere\nan iron hand/fist in a velvet glove idiom\naustere\nausterely\nbe heavy on someone idiom\nbrutally\ndisciplinarian\nflaming\nharsh\nnonsense\nnot stand any nonsense idiom\npitiless\nrigorously\nseverity\nsharp\nsharply\nsharpness\nstern\nsternly\nsternness\nstiffly\nSee more results »\nAdd to word list\nAdd to word list\ndemanding total obedience to those in positions of authority: an authoritarian ruler/parent"}