{"id":24198,"name":"automatically","type":"adverb","us_sound":"ˌɑː.t̬əˈmæt̬.ɪ.kəl.i","us_link":"../audio/a/automatically.mp3","uk_sound":"ˌɔː.təˈmæt.ɪ.kəl.i","uk_link":"../audio/a/ukautis025.mp3","content":"automatically adverb\n(INDEPENDENTLY)\nAdd to word list\nAdd to word list\nB2 If a machine or device does something automatically, it does it independently, without human control: The camera adjusts the shutter speed automatically.\nMore examplesFewer examplesIf you are continuing on an onward flight, your bags will be transferred automatically.The clock automatically readjusts when you enter a new time zone.The data is validated automatically by the computer after it has been entered.Does this camera wind on automatically?If the cabin depressurizes, oxygen masks will automatically drop down.\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nautomatically adverb\n(NOT CONSCIOUSLY)\nB2 If you do something automatically, you do it without thinking about it: I automatically put my hand out to catch it.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunscripted\nunstarry\nunsuspected\nuntimely\nuntoward\nSee more results »\nautomatically adverb\n(CERTAINLY)\nIf something happens automatically, it happens as part of the normal process or system: Employees who steal are dismissed automatically.\nSMART Vocabulary: related words and phrases\nInevitable\nall roads lead to Rome idiom\nbe (only) a matter of time idiom\nbe damned if you do and damned if you don't idiom\nbe nothing for it idiom\nbe part and parcel of something idiom\nimplacability\nimplacable\nimplacably\ninalienable\ninalienably\ninexorable\ninexorably\ninsuppressible\nit can't be helped idiom\nrelentless\nseal\nunavoidable\nunavoidably\nunstoppable\nunstoppably\nSee more results »\nautomatically adverb\n(INDEPENDENTLY)\nAdd to word list\nAdd to word list\nwithout human control; independently: The camera focuses automatically.\nautomatically adverb\n(CERTAINLY)\naccording to rules or schedules that are certain to be followed: You get a pay increase automatically after six months.\nAdd to word list\nAdd to word list\ndone by a machine, system, or process that is designed to complete a task without a person having to control it: Paychecks are automatically deposited into your account on the 26th of each month. The program automatically downloads and installs new updates.\nhappening or reacting without the need to consider or do anything extra: Any employee who is found guilty of sexual harassment will be automatically discharged. Once you have used the system for a while you will find you save your work automatically, without thinking about it."}