{"id":24196,"name":"automatic","type":"adjective","us_sound":"ˌɑː.t̬əˈmæt̬.ɪk","us_link":"../audio/a/automatic.mp3","uk_sound":"ˌɔː.təˈmæt.ɪk","uk_link":"../audio/a/ukautis023.mp3","content":"automatic adjective\n(INDEPENDENT)\nAdd to word list\nAdd to word list\nB2 An automatic machine or device is able to operate independently of human control: automatic doors automatic focus on a camera\nAn automatic gun is able to keep loading (= adding bullets) and shooting continuously for as long as the trigger is pressed: The state banned the sale of automatic weapons. an automatic rifle The weapon is capable of firing in either an automatic or a semiautomatic mode. a burst of automatic fire Compare\nsemiautomatic\nAn automatic vehicle or gearbox is one in which the driver does not have to change the gears: I was thinking of buying an automatic car because my wife has arthritis. Both 5-speed manual and 4-speed automatic transmissions are available. For the UK, it will have a four-speed automatic gearbox only. Compare\nmanual\nMore examplesFewer examplesThese automatic cameras have a special focusing mechanism.The \"voice verification\" system involves ringing an automatic call machine which is programmed to recognise your voice. There is a cable-tow facility, where water-skiers are pulled around the lake by an automatic cable.Hotels above a certain size must have an automatic fire detection system.\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuns\nMachines - general words\nautomatic adjective\n(NOT CONSCIOUS)\nC2 done without thinking about it: Over time, driving just becomes automatic. My automatic response was to pull my hand away.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunscripted\nunstarry\nunsuspected\nuntimely\nuntoward\nSee more results »\nautomatic adjective\n(CERTAIN)\nC2 certain to happen as part of the normal process or system: Citizenship is automatic for children born in this country. You get an automatic promotion after two years.\nSMART Vocabulary: related words and phrases\nInevitable\nall roads lead to Rome idiom\nbe (only) a matter of time idiom\nbe damned if you do and damned if you don't idiom\nbe nothing for it idiom\nbe part and parcel of something idiom\nimplacability\nimplacable\nimplacably\ninalienable\ninalienably\ninexorable\ninexorably\ninsuppressible\nit can't be helped idiom\nrelentless\nseal\nunavoidable\nunavoidably\nunstoppable\nunstoppably\nSee more results »\na vehicle in which you do not have to change the gears: Kate drives an automatic. In the US, most cars are automatics, while in the UK they are still mostly manual. Compare\nmanual\na gun that is able to keep loading (= adding bullets) and shooting continuously for as long as the trigger is pressed: The gunman opened fire with an automatic. Compare\nsemiautomatic\nMore examplesFewer examplesHe stepped on the wrong pedal, putting it down to the car being an automatic, where his own car is a manual.It's an automatic, with 52,000 miles on the clock and a full service history. The gangster had an automatic in each hand.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuns\nautomatic adjective\n(INDEPENDENT)\nAdd to word list\nAdd to word list\nable to operate independently of human control: The car has a five-speed automatic transmission.\nautomatic adjective\n(NOT CONSCIOUS)\n(of an action) done without thinking about it: Soon enough, taking her pill every morning became automatic.\nautomatic adjective\n(CERTAIN)\nhappening according to rules that are certain to be followed, and therefore not needing a decision: Citizenship is automatic for children born in the US. People on Social Security get automatic cost-of-living increases each year.\nAdd to word list\nAdd to word list\nan automatic machine, process, or system is able to operate, complete a task, or move by itself without being controlled by a person: Tick the 'automatic update' box and the date and time will be updated for you. automatic sliding doors automatic payment/transfer/withdrawal\nhappening as a usual result, without the need for extra permission, approval, proof, etc.: EU nationals have the automatic right to apply for jobs in other countries within the European Union."}