{"id":24010,"name":"autodial","type":"verb","us_sound":"ˈɑː.t̬oʊ.daɪ.əl","us_link":"../audio/a/cdo0319usauto0097.mp3","uk_sound":"ˈɔː.təʊ.daɪ.əl","uk_link":"../audio/a/cdo0319ukauto0086.mp3","content":"Add to word list\nAdd to word list\nto automatically call a telephone number or make a connection with a computer: The program can autodial emergency instructions to phone numbers in areas affected by terrorist attacks. Constituents were autodialled by a computer. When the user makes an internet request it triggers the proxy to autodial and establish a connection. We may contact you at the mobile phone number that you provide to us by way of direct dial calls or autodialled calls.\nMore examplesFewer examplesThe campaign used a tool that helped autodial voters. \"I am firmly against all autodialled, prerecorded calls for any purpose,\" he said.Candidates hire robo call services that use autodialling technology capable of sending hundreds of calls immediately.Connection can be made over TCP/IP or autodialled links.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodialler\nbuzz\ncaller ID\ndialling tone\nDirectory Enquiries\noff the hook idiom\npick someone/something up\npocket dial\nprank call\nprank caller\nprepay\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\na feature of a telephone or computer that makes it able to automatically call a number or connect with a computer: Additional features include autodial and onscreen help commands. an autodial service\nMore examplesFewer examplesYou can select the hours that autodial is in operation.Try restarting all services that use autodial.I have all the autodial numbers in one file.Some operators offer an autodial box.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodialler\nbuzz\ncaller ID\ndialling tone\nDirectory Enquiries\noff the hook idiom\npick someone/something up\npocket dial\nprank call\nprank caller\nprepay\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words"}