{"id":24572,"name":"availability","type":"noun","us_sound":"əˌveɪ.ləˈbɪl.ə.t̬i","us_link":"../audio/a/eus70394.mp3","uk_sound":"əˌveɪ.ləˈbɪl.ə.ti","uk_link":"../audio/a/ukauton013.mp3","content":"Add to word list\nAdd to word list\nB2 the fact that something can be bought, used, or reached, or how much it can be: They suggested that the ready availability of junk food has encouraged poor eating habits. There is limited ticket availability, so book early to avoid disappointment.\nB2 the fact of someone being free to speak on the phone, work, etc.: I shall check the availability of my staff for that date.\nMore examplesFewer examplesShe is studying the impact local companies have on housing availability in the region.She wants to increase the availability and affordability of childcare for working parents.All of our special offers are subject to availability.Having a flexible job allows me to increase or decrease my hours depending on my availability.He has now missed two consecutive practice sessions, which does not bode well for his availability for the upcoming game.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailable\ndrop\nnothing\nobtainable\noffer\non call idiom\non demand idiom\non hand idiom\non/about your person idiom\nrelease\nseason\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nvacant\nSee more results »\nAdd to word list\nAdd to word list\nthe fact or possibility that you can buy, get, or have something: availability of sth Many companies choose to produce abroad because of the low labour costs and the availability of skilled labour. limited/widespread/growing availability Prices were driven up due to the limited availability of key raw materials.lack of availability Customers complained about the increased insurance premiums and the lack of availability of quality coverage.\nthe fact that you have time free for doing something, or the amount of time that you have: sb's availability We could meet next week - what's your availability?availability for sth Union workers were asked about their attitudes toward a strike and their availability for picket-line duty. Compare\nunavailability"}