{"id":24672,"name":"average","type":"noun","us_sound":"ˈæv.ɚ.ɪdʒ","us_link":"../audio/a/average.mp3","uk_sound":"ˈæv.ər.ɪdʒ","uk_link":"../audio/a/ukauton025.mp3","content":"average noun\n(AMOUNT)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the result you get by adding two or more amounts together and dividing the total by the number of amounts: The average of the three numbers 7, 12, and 20 is 13, because the total of 7, 12, and 20 is 39, and 39 divided by 3 is 13. Prices have risen by an average of four percent over the past year. My income's rather variable, but I earn £175 a day on average.\nMore examplesFewer examplesCountywide, exam results have improved by an average of eight percent.Rates of pay are above average.The number of spectators at football matches was lower than average last season.The number of soldiers killed this week is much higher than the weekly average.On average, I earn about one and a half thousand pounds a month.\nSMART Vocabulary: related words and phrases\nAverages\naverage out at something\naverage something out\nhappy medium\nlaw\nmean\nmedian\nmedium\nmiddle\npar\nthe law of averages idiom\naverage noun\n(USUAL STANDARD)\nB1 [ S or U ] a standard or level that is considered to be typical or usual: The audience figures were lower than average for this sort of film. In western Europe, a seven to eight-hour working day is about the average. On average, people who don't smoke are healthier than people who do. The quality of candidates was (well) below/above average. I expect to spend an average of $50 to $60 on a meal in a restaurant.\nMore examplesFewer examplesHis marks in English have been below average for some time now.Tickets for such events will cost around $30 on average.On average, people seem to go away on holiday twice a year.I'm afraid his latest piece of work was well below average.This chocolate cake is superb - much better that the average.\nSMART Vocabulary: related words and phrases\nPlain and ordinary\nas it comes idiom\naustere\nausterely\nausterity\naverage Joe\ngeneralized\nhomeliness\nhomely\nhomespun\nhomey\nrun-of-the-mill\nsevere\nseverely\nsimple\nsomething/nothing to shout about idiom\nunoriginal\nunostentatiously\nunremarkable\nunremarkably\nwell trodden\nSee more results »\nto reach a particular amount as an average: Enquiries to our office average 1,000 calls a month. Many doctors average (= work an average of) 70 hours a week. Trainee accountants average (= earn an average of) £32,000 per year.\nMore examplesFewer examplesHe averaged 14 strikeouts per game last season.Ticket prices for the concert average at $45.Towards the end of the season, the team averaged three goals a game.The show averages a weekly audience of eight million.Hotels in the region are expensive, averaging £100 a night.\nSMART Vocabulary: related words and phrases\nAverages\naverage out at something\naverage something out\nhappy medium\nlaw\nmean\nmedian\nmedium\nmiddle\npar\nthe law of averages idiom\nPhrasal verbs\naverage something out\naverage out\naverage out at something\naverage adjective\n(AMOUNT)\nB1 [ before noun ] An average number is the number you get by adding two or more amounts together and dividing the total by the number of amounts: average earnings/income/rainfall The average age of the US soldiers who fought in the Vietnam War was 19.\nMore examplesFewer examplesThe average temperature worldwide has risen by about one degree Fahrenheit in the past 100 years.The average cost of a new house has gone up by 5% to £76,500.The average human lifespan in the developed countries has increased over the last hundred years.The average annual rainfall in this region: 750 mm.There will be an increase in tax for those earning in excess of twice the national average wage.\nSMART Vocabulary: related words and phrases\nMedium-sized\nM, m\nmedium\nmiddle\nmidi\nmidsize\nmildness\nmoderate\nmoderately\nYou can also find related words, phrases, and synonyms in the topics:\nAverages\naverage adjective\n(USUAL)\nA2 typical and usual: The average person on the street is a lot better off than they were 40 years ago. a student of average ability The food was fairly average (= not excellent, although not bad).\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbeing part of normal life and not specialordinaryHe took ordinary household objects and transformed them into pieces of art. everydayComputers are now just a part of everyday life.quotidianWe longed for the quotidian rituals, like shopping and tea, that the end of the war would bring.day-to-dayDay-to-day operations of the team would be handled by the assistant coach.dailyI'm looking for a good daily shampoo that won't damage my hair.\nSee more results »\nSMART Vocabulary: related words and phrases\nQuite good, or not very good\nacceptable\nacceptably\nadequacy\nadequate\nadequately\nhalf decent\niffy\nimpure\nindifferent\nindifferently\npassably\npatchily\npatchiness\npatchy\npresentably\nspotty\nthe/your average bear idiom\nunspectacular\nup to scratch idiom\nweedy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStandard and routine\nRelated word\naveragelyIdiom\nthe/your average bear\naverage noun\n(USUAL STANDARD)\nAdd to word list\nAdd to word list\n[ U ] a standard or level that is considered to be typical or usual: The quality of her work is well above average.\naverage noun\n(AMOUNT)\n[ C ]\n&#160; mathematics the result obtained by adding two or more amounts together and dividing the total by the number of amounts, or by another total: I’m 35 and my brothers are 32 and 26, so the average of our ages is 31. In his third season on the team, he raised his batting average to .270. Interest rates rose on average to 10.05% in January. Idiom\non average\nAdd to word list\nAdd to word list\n[ C ] the result that you get by adding two or more amounts together and dividing this total by the number of amounts: daily/monthly/quarterly average Trading was 297 million shares, down from the three-month daily average of 313 million shares. The state's unemployment rate remained well below the national average of 5.7 percent.an average of Its economy has grown at an annual average of 3.6% for the past seven years. Regulators are careful to stress that the performance figures are only averages - some companies performed better. Compare\nmean\nmedian\nmode\n[ C or U ] a level or standard that is considered to be typical for a particular place, group of people, type of business, etc.: above/below (the) average Our companies' profitability is above the sector average. Most of these businesses match industry averages in job creation.\n[ U ]\n&#160; INSURANCE →\npartial loss\nSTOCK MARKET an average that is based on a particular group of companies' shares, which is used to represent changes in the stock market or to show which types of businesses are getting the most investors: the industrial average\non average\ntypically or usually: On average, only about half of the consumers who qualify for a rebate actually collect it. See also\nthe Dow Jones Averages\nthe Dow Jones Industrial Average\nthe Dow Jones Transportation Average\nfree of particular average\ngeneral average\nmarket average\nmoving average\nparticular average\nweighted average\nused to describe an amount that you get by adding two or more amounts together and then dividing by the number of amounts: average price/cost/value Price rises were strong in Wales, where the average cost of a property jumped by 31.8%.average age/speed/rate The average age of the 'Times' reader is fairly low at 42.\ntypical and usual: The cost of health insurance has risen above the means of the average worker.\nnot bad, but not excellent either: Despite high expectations, sales levels last quarter were only average.\nto equal a particular rate or amount as an average: Traffic on its free website averages about 10,000 visitors a month.\nto calculate the average amount of something by adding all the amounts together and then dividing this by the number of amounts: Each quarter, the magazine polls a group of forecasters and averages their predictions for economic growth. Phrasal verb\naverage out"}