{"id":24833,"name":"avocado","type":"noun","us_sound":"ˌɑː.vəˈkɑː.doʊ","us_link":"../audio/a/uscld00050.mp3","uk_sound":"ˌæv.əˈkɑː.dəʊ","uk_link":"../audio/a/ukcld00050.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] plural avocados (UK also avocado pear) a tropical fruit with thick, dark green or purple skin, a large, round seed, and soft, pale green flesh that can be eaten: Half an avocado contains about 160 calories. Guacamole is a dip, spread or salad made with mashed avocado.\nTobias Titz/GettyImages\n[ U ] (also avocado green) a pale green colour like the flesh of an avocado: The walls are painted a pale avocado. I tried the linen trousers in a shade of avocado green.\nTi_ser/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThey grow avocados which taste sensational.I like to add some diced avocado to the dish.Avocado farmers say the freeze was devastating to their crop.The kitchen units are done in the avocado green that was popular in the 1970s.An en-suite bathroom in avocado led off the master bedroom.\nSMART Vocabulary: related words and phrases\nTypes of fruit\nackee\nalligator pear\nalpine strawberry\namla\naçaí\ncooking apple\ncopra\ncrab apple\ncranberry\ncucumber\nloquat\nlychee\nmajhool date\nmandarin\nmango\nsalmonberry\nsaskatoon\nsatsuma\nsatsuma plum\nscuppernong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nof a pale green colour like the flesh of an avocado: The Brussels sprouts turn bright green and then start to fade to a more avocado colour. The appliances were all avocado green.\nMore examplesFewer examplesThe place clearly has not been touched since the Seventies judging from the groovy avocado bathroom suite. The bath was avocado.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\nbisque\nblood red\ndun\nearth tone\nemerald\npeach\npuce\nsaffron\nsanguine\nsapphire\nsepia\nsky blue\nslaty\ntangerine\ntaupe\ntea rose\nverdure\nSee more results »\nAdd to word list\nAdd to word list\na fruit with thick green or black skin, a large round seed at the center, and oily green or yellow flesh, which is often eaten as a vegetable in salads"}