{"id":24858,"name":"avoided","type":"verb","us_sound":"əˈvɔɪd","us_link":"../audio/a/avoid.mp3","uk_sound":"əˈvɔɪd","uk_link":"../audio/a/ukaviat009.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\navoid\nB1 to stay away from someone or something: I try to avoid supermarkets on Saturdays - they're always so busy. I'm anxious to avoid the motorway at rush hour. Do you think Lukas is avoiding me? I haven't seen him all day.\nThesaurus: synonyms, antonyms, and examples\nto avoid someone or somethingavoidHave you been trying to avoid me?steer clear ofI suggest steering clear of yellow snow.keep/stay clear ofKeep clear of her - she’s got flu.stay away fromThe experience was so bad that she stayed away from men for two years.shunThe best companies are run by people who shun the limelight.shunYou'll be shunned and totally isolated if you don't join in.\nSee more results »\nB2 to prevent something from happening or to not allow yourself to do something: [ + -ing verb ] I try to avoid going shopping on Saturdays. The report studiously avoided any mention of the controversial plan. The plane narrowly avoided disaster when one of the engines cut out on take-off. I left the pub to avoid a fight (= prevent a fight from happening). Unnecessary paperwork should be avoided (= prevented) at all costs.\nThesaurus: synonyms, antonyms, and examples\nto avoid doing somethingavoidAvoid swimming in areas where sharks are known to congregate.evadePlease don’t think I’m trying to evade my responsibility.dodgeHe tried to dodge his military service.run away fromI didn't often run away from difficult decisions.shrink fromI've never been one to shrink from a challenge.sidestepThis is not a responsibility you can sidestep.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto prevent something from happeningpreventVaccination will prevent the spread of the disease.avoidLabel the boxes to avoid confusion.stopThis should stop any further trouble.avertWe had to act quickly to avert disaster.prohibitBehavioural problems in the classroom prohibit learning.checkChildren are being vaccinated in an attempt to check the spread of the disease.\nSee more results »\nMore examplesFewer examplesIf we set off early tomorrow morning we'll avoid most of the traffic.The bus driver swerved to avoid hitting the cyclists.We need to examine how an accident like this can be avoided in the future.Try to avoid foods which contain a lot of fat.He took a different route which avoids the city centre.\nSMART Vocabulary: related words and phrases\nMoving in order to avoid contact\navoid\navoid something like the plague idiom\navoidance\nbypass\ncircumnavigate\nclear\ndodge\nduck and dodge (something) idiom\nduck and weave idiom\nevasively\nevasiveness\nfall\nfall back\njump\nshrug away\nsidestep\nskirt\nsteer\nsteer clear of someone/something idiom\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvoiding action\nPreventing and impeding\nIdiom\navoid something like the plague"}