{"id":24940,"name":"awake","type":"adjective","us_sound":"əˈweɪk","us_link":"../audio/a/awake.mp3","uk_sound":"əˈweɪk","uk_link":"../audio/a/ukaviat020.mp3","content":"Add to word list\nAdd to word list\nB1 not sleeping: \"Is Oliver awake yet?\" \"Yes, he's wide (= completely) awake and running around his bedroom.\" I find it so difficult to stay awake during history lessons. I drink a lot of coffee to keep me awake. She used to lie awake at night worrying about how to pay the bills. be awake to something mainly UK\nIf you are awake to something, you know about it: Businesses need to be awake to the advantages of European integration.\nSee more\nMore examplesFewer examplesThe noise from their party kept me awake half the night.It was 3 a.m. and we were still wide awake.I'm surprised to see you awake - ten minutes ago you were sound asleep.She lay awake listening to her sister's steady breathing.Go and see if Tim's awake - it's time he was getting ready for school.\nSMART Vocabulary: related words and phrases\nAnimal physiology: not sleeping & not unconscious\nanti-sleep\nbe in the land of the living idiom\ncome round\nget up\ninsomnia\nkeep someone up\nknock\nknock up\nland\nnight owl\nsit (someone) up\ntoss\nwait up\nwakeful\nwakefulness\nwaken\nwakey-wakey\nwaking\nwhite night\nwoke\nSee more results »\nliterary to stop sleeping or to make someone stop sleeping: I awoke at seven o'clock. She awoke me at seven. Synonyms\nawaken literary\nbestir yourself formal or humorous\nrouse\nwake\nwake (someone) up (STOP SLEEPING)\nto start to understand or feel something or to make someone start to understand or feel something: The chance meeting awoke the old passion between them. Young people need to awake to the risks involved in casual sex. Synonyms\narouse\nawaken (something) in someone\nignite\nkindle (FEELING) literary\nstir (CAUSE EMOTION)\nSMART Vocabulary: related words and phrases\nAnimal physiology: not sleeping & not unconscious\nanti-sleep\nbe in the land of the living idiom\ncome round\nget up\ninsomnia\nkeep someone up\nknock\nknock up\nland\nnight owl\nsit (someone) up\ntoss\nwait up\nwakeful\nwakefulness\nwaken\nwakey-wakey\nwaking\nwhite night\nwoke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnouncing, informing & stating\nGrammar\nWake, wake up or awaken?Wake and wake up are verbs which mean ‘stop sleeping or end someone else’s sleep’. They are used in everyday language. …\nAdd to word list\nAdd to word list\nnot sleeping: If I drink coffee late in the day, I can’t sleep and stay awake all night.\nto stop sleeping, or to cause someone to stop sleeping: [ I ] I awoke at 7, as usual."}