{"id":24974,"name":"aware","type":"adjective","us_sound":"əˈwer","us_link":"../audio/a/aware.mp3","uk_sound":"əˈweər","uk_link":"../audio/a/ukaviat025.mp3","content":"Add to word list\nAdd to word list\nB2 knowing that something exists, or having knowledge or experience of a particular thing: [ + that ] I wasn't even aware that he was ill. Were you aware of the risks at the time? She was well (= very) aware that he was married. \"Has Claude paid the phone bill?\" \"Not as far as I'm aware.\" (= I don't think so) I suddenly became aware of (= started to notice) him looking at me. Synonyms\ncognizant formal\nconscious (NOTICING)\nwittingOpposites\nunaware\nunwitting formal\nThesaurus: synonyms, antonyms, and examples\naware of somethingawareWe are aware that some people are getting frustrated.consciousI am conscious of the need for greater scrutiny of these matters.cognizantMost people are cognizant of the fact that some pollsters ask leading questions.knowWe know that people who are stressed out look haggard.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto know factsknowI know you've been hiding something from me.be familiar withI'm very familiar with various accountancy software packages.informedit's important to keep the public informed about the steps they're taking.be apprised ofThe suspect will be apprised of their rights.realizeI realized that it was too late to stop them from finding out. have heard ofMost Americans have never heard of the California Air Resources Board.\nSee more results »\nhaving special interest in or experience of something and so knowing what is happening in that subject at the present time: to be ecologically/politically aware sexually aware\nMore examplesFewer examplesPeople are becoming far more aware of environmental issues.I'm very much aware of the problem.\"Were you aware of the speed you were driving at, madam?\" \"No, officer.\"She's well aware of her strengths and weaknesses as an artist.If I'd been aware that things were so serious, I'd have told the police.\nSMART Vocabulary: related words and phrases\nAware\nabreast\nacquainted\nalive\nalive to something idiom\nawake\nawakening\nconscious\nhave/keep your finger on the pulse idiom\nhyper-aware\nhyper-awareness\nhyper-conscious\ninformed\nomnisciently\non the inside idiom\novereducated\nperceive\npicture\npreliterate\nprofound\npulse\nSee more results »\nAdd to word list\nAdd to word list\nknowing that something exists, or having knowledge or experience of a particular thing: [ + (that) clause ] We were just not aware (that) garbage would be a problem, that we ever would need to recycle. Are you aware of any reason why you cannot act fairly as a juror in this trial? awareness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/əˈweər·nəs/\nHis tragedy has brought a heightened awareness to the conditions surrounding heatstroke."}