{"id":24964,"name":"award","type":"verb","us_sound":"əˈwɔːrd","us_link":"../audio/a/award.mp3","uk_sound":"əˈwɔːd","uk_link":"../audio/a/ukaviat024.mp3","content":"Add to word list\nAdd to word list\nB2 to give money or a prize following an official decision: Carlos was awarded first prize in the essay competition. The jury awarded libel damages of £100,000. [ + two objects ] The university has awarded her a $500 travel grant.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesThe report criticized boardroom fat cats who award themselves huge pay increases.The referee awarded a penalty kick.His parents saw him awarded the winner's medal.She was awarded a medal for showing supreme courage/bravery.The court awarded her an unspecified amount of money.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nB2 a prize or an amount of money that is given to someone following an official decision: They have authorized awards of £900 to each of the victims. the Academy Award for Best Director\nMore examplesFewer examplesWho did the award for Best Actress go to?She was in London to accept an award for her latest novel.The film won an award for its photography.They won the award for the most promising new band of the year.She felt a great sense of pride as she watched him accept the award.\nSMART Vocabulary: related words and phrases\nGifts in the form of money\naid\nbenefaction\nbequest\nbonus\nbounty\ncharity box\nChristmas box\ndebt relief\ndonation\ndonation box\ndowry\nforeign aid\ngift card\ngift certificate\ngratuity\nhonorarium\nMaundy\nreward\ntip\ntronc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nAdd to word list\nAdd to word list\nto give something valuable, such as money or a prize following an official decision: Her poodle was awarded first prize in the dog show. Their company was awarded a contract worth $40 million by the federal government. award noun [ C ] us\nYour browser doesn't support HTML5 audio\n/əˈwɔrd/\nMarion Jones won the Jesse Owens award as the outstanding athlete of the year.\nAdd to word list\nAdd to word list\na prize or a sum of money that a person or organization is given for an achievement: A new digital innovation award is aimed at media that uses the latest technology to make an improvement in delivery of news services.an award for sth A recently launched advertising agency got an award for best marketing campaign of 2009. Four finalists shared the top cash award of $160,000.accept/receive/win an award The airline received an environmental award for work relating to carbon-emissions reduction.give/make/present an award We have no hesitation in giving an award to this interesting example of large-scale urban regeneration.\nLAW a sum of money that a court of law decides is owed by a company, organization, or person to someone they have treated unfairly, injured in an accident, etc.: Justice Andrew Reid confirmed that the award would total $15.5m.an award of sth The jury made an award of £380,000 in damages.make/uphold/grant an award An award for continuing cost of care for survivors of the crash was upheld by the Court of Appeal.compensation/compensatory/damage(s) award The rail company challenged the compensation payout, claiming that the damages award was excessive.\nHR, MANAGEMENT an amount of money paid by a company to an employee as an increase in income or as a special payment for success: an award for sth Awards for all 600 executives have been ruled out as the group struggles to recover from a catastrophic 12-month period. As head of the bank's US credit business, she got an award of £2.18m.\na sum of money, work, etc. that is officially given to a company or organization: Including the Port Authority's $3 million award, the company got a total of $3.93 million in grants.\nHR →\naward wage\nto officially give work, a sum of money, etc. to a company or organization: Firms making big campaign contributions are often awarded lucrative government grants.award a grant/contract (to sb) The Pentagon has awarded a $520 million contract to the construction company.award sb sth The company awarded them the concrete subcontract on the five-story parking structure.\nLAW if a court awards a sum of money to someone who has been unfairly treated, injured in an accident at work, etc., it orders the person, company, or organization that is responsible to pay it: be awarded $1 million/£250,000, etc. She was awarded £600,000 in damages as part of a libel action.award sth to sb/award sb sth The jury will award $1.78 million in compensation and more than $99 million in punitive damages to victims. award sth in damages/compensation/costs\nHR, MANAGEMENT to give an employee an increase in income or a special payment as a reward for success: award sth to sb/award sb sth The Association has just announced that it will be awarding more than $14 million in annual pay rises to staff.be awarded sth Many of the investment bank's employees have been awarded much smaller performance bonuses than they were led to expect.\nto give a prize or a sum of money to a person, company, or organization who has been very successful: be awarded sth The restaurant was one of only three to be awarded four Michelin stars this year. Nearly $72,000 in scholarships were awarded by about 30 companies."}