{"id":24976,"name":"awareness","type":"noun","us_sound":"əˈwer.nəs","us_link":"../audio/a/awareness.mp3","uk_sound":"əˈweə.nəs","uk_link":"../audio/a/ukaviat026.mp3","content":"Add to word list\nAdd to word list\nC1 knowledge that something exists, or understanding of a situation or subject at the present time based on information or experience: Public awareness of the problem will make politicians take it seriously. Environmental awareness has increased dramatically over the past decade.\nMore examplesFewer examplesThe leaflet has been produced with the aim of increasing public awareness of the disease.There is a growing awareness of the seriousness of this disease.Greenpeace works to promote awareness of the dangers that threaten our planet today.This task is designed to test the child's spatial awareness.The campaign has certainly succeeded in raising public awareness of the issue.\nSMART Vocabulary: related words and phrases\nKnowledge and awareness\nacquaintance\nalertness\nas every schoolboy/schoolchild knows idiom\nastuteness\nat/in the back of your mind idiom\nfirsthand\ngeneral knowledge\ngnostic\ngrounding\nhave a nodding acquaintance with someone/something idiom\nmetacognition\nnescience\nnescient\noff someone's radar idiom\nomniscience\nsensibility\nstreet smarts\ntheory of mind\nvisual literacy\nwitting\nSee more results »\nAdd to word list\nAdd to word list\nknowledge and understanding of a particular activity, subject, etc.: customer/public/consumer awareness Assessment procedures reveal how effectively the brand translates customer awareness into purchases and retention.awareness of sth Recent campaigns have led to a dramatic increase in awareness of environmental issues.build/increase/raise awareness The guidelines are an important tool for raising awareness about current management thinking.increasing/growing/heightened awareness Employees are using a heightened awareness of work flow and demand to cut waste, eliminate cost, and boost quality. See also\nbrand awareness"}