{"id":24928,"name":"away","type":"adverb","us_sound":"əˈweɪ","us_link":"../audio/a/away.mp3","uk_sound":"əˈweɪ","uk_link":"../audio/a/ukaviat028.mp3","content":"away adverb\n(SOMEWHERE ELSE)\nAdd to word list\nAdd to word list\nA2 somewhere else, or to or in a different place, position, or situation: Ms Watson is away on holiday until the end of the week. Keep/Stay away from him. Just go away and leave me alone! The sight was so horrible that I had to look/turn away. The recent flood has swept away the footbridge. I've given away all my old clothes to charity.UK Would you like your burger to eat in or take away?\nMore examplesFewer examplesThe police went after him but he got away.The couple next door moved away last year.He made a sudden movement and frightened the bird away.He looked away from the computer screen to rest his eyes.The letter blew away and I had to run after it.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nunattached\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\naway adverb\n(DISTANT)\nA2 at a distance (of or from here): How far away is the station? The office is a half-hour drive away. We live five kilometres away from each other. Life's so much quieter away from the city.informal Oh, it's miles away (= a long distance from here).\nMore examplesFewer examplesI don't like the idea of living so far away from my family.The explosion was of such intensity that it was heard five miles away.The nearest town is ten miles away.The museum is just six blocks away.Is the station far away?\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\naway adverb\n(INTO PLACE)\nB1 in or into the usual or a suitable place, especially one that can be closed: Would you put the ice cream away in the freezer? My grandparents had £800 hidden away in an old shoe box.\nMore examplesFewer examplesI told the children to put their toys and games away.Put that knife away before someone gets hurt.All the folders have been carefully numbered and filed away.The diamonds are shut away in a bank vault somewhere.At a word from their teacher, the children started to tidy away their books.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nunattached\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\naway adverb\n(GONE)\nB2 gradually until mostly or completely gone: All the snow had melted away. The music faded away as the procession moved slowly up the street. We used to while away (= spend) the weekends at my aunt's house in the country. We danced the night away (= until the night was over).\nMore examplesFewer examplesHaitian strongman Duvalier could feel his power slipping away.The sound of his footsteps gradually died away.He could feel his strength ebbing away.As the years passed, the memories faded away.He gambled away all of our savings.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nworm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplete and whole\naway adverb\n(IN THE FUTURE)\nB1 in the future: My English exam's only a week away and I haven't even started to prepare.\nMore examplesFewer examplesWe're having a holiday in August, but that seems a long way away.Christmas is only two months away.The announcement of the winner is just a few minutes away now.Don't worry about your driving test yet - it's weeks away.With the concert only a few days away, the band are practising hard.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\ndue\nfuture\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nyet\nSee more results »\naway adverb\n(CONTINUOUSLY)\nC2 continuously or repeatedly, or in a busy way: I was still writing away when the exam finished. Chris has been working away in the garden all day. We were chatting away at the back and didn't hear what he said.\nMore examplesFewer examplesShe was singing away to herself as she worked.They were hammering away at the door.They were just chatting away while the fire raged around them.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nhere to stay idiom\nimmanence\nimmanent\nimmanently\nimperishable\nnon-stop\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\nuninterruptedly\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nSee more results »\nGrammar\nAway and away fromAway is an adverb. Away from is a multi-word preposition. …\nC1 An away match or game is played at an opposing team's sports ground: We lost the away game but won both home games.UK Everton unveiled their new yellow-and-blue away strip (= clothing worn by a team at away games).\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nsquare\nweigh\nSee more results »\naway adjective, adverb [not gradable]\n(SOMEWHERE ELSE)\nAdd to word list\nAdd to word list\nsomewhere else, or to or in a different place, position, or situation: Barbara is away on vacation until the end of the week. The Jeffersons went away for the weekend, but they’ll be back on Monday.\naway adverb [not gradable]\n(DISTANT)\nat a distance (from this place): How far away is the station?\naway adverb [not gradable]\n(IN THE FUTURE)\nin the future; from now: The wedding is still six months away.\naway adverb [not gradable]\n(INTO PLACE)\nin or into the usual or a suitable place, esp. one that is enclosed: Put the groceries away before you go out again.\naway adverb [not gradable]\n(GRADUALLY)\ngradually until mostly or completely gone: The music faded away.\naway adverb [not gradable]\n(CONTINUOUSLY)\ncontinuously or repeatedly, or actively: Chris has been working away on the car all day."}