{"id":24988,"name":"awe","type":"noun","us_sound":"ɑː","us_link":"../audio/a/eus70398.mp3","uk_sound":"ɔː","uk_link":"../audio/a/ukaviat029.mp3","content":"Add to word list\nAdd to word list\nC2 a feeling of great respect sometimes mixed with fear or surprise: I've always held musicians in awe. As children we were rather in awe of our grandfather. You can't help but stand in awe of (= respect greatly and fear slightly) powerful people.\nThesaurus: synonyms, antonyms, and examples\nto admire someone or somethingadmireI've always admired her for her generous spirit.respectI respect her for what she has achieved, but I would have approached it very differently.think highly ofEveryone thinks highly of him.hold someone in high esteemHer colleagues in Washington hold her in very high esteem.hold someone in high regardHe contributed much to the life of York, and was held in high regard there.look up toShe was my older sister and I looked up to her.\nSee more results »\nMore examplesFewer examplesHe's such an important man that I'm rather in awe of him.We looked on in awe as the gymnast performed her routine.The scenery was absolutely stunning - I remember gazing in a state of awe over the landscape.We listened in awe because her voice was remarkable for someone so young.As the champion played his shots, spectators looked on in awe.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\nhallow\nhomage\npay your respects idiom\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nrevere\nworshipful\nSee more results »\nto cause someone to feel awe: I was awed but not frightened by the huge gorilla. Her paintings have awed and amazed the public for half a century. The audience was awed into silence by her stunning performance.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namaze\namazing\namazingly\nastonish\nblinding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\nearth-shatteringly\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nsensationalize\nstagger\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\nRelated word\nawed\nAdd to word list\nAdd to word list\na feeling of great respect, usually mixed with fear or surprise: I was too much in awe of him to address him directly. awe-inspiring\nIf something is awe-inspiring, it causes you to admire or respect it a lot: Niagara Falls is an awe-inspiring sight. awe verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ɔ/ present participle awing\nThe school kids were awed when Doug Flutie, the football star, entered the room."}