{"id":25014,"name":"awful","type":"adjective","us_sound":"ˈɑː.fəl","us_link":"../audio/a/awful.mp3","uk_sound":"ˈɔː.fəl","uk_link":"../audio/a/ukawein005.mp3","content":"awful adjective\n(BAD)\nAdd to word list\nAdd to word list\nA2 extremely bad or unpleasant: He suffered awful injuries in the crash. We had awful weather. She has an awful boss. What an awful thing to say! Would life be so awful without a car? The food was awful. She'd been ill and she looked awful. Synonyms\nabominable\nabysmal (BAD)\natrocious (VERY BAD)\ndire mainly UK informal\ndreadful (LOW QUALITY) mainly UK\nfrightful old-fashioned informal\ngrim (WITHOUT HOPE)\nhorrendous\nhorrible\nhorrid old-fashioned informal\nterrible (UNPLEASANT)\nThesaurus: synonyms, antonyms, and examples\nbad weather, conditions, situations, etc.badIf the weather is bad, we'll have to find something else to do.poorShe's 87 and in poor health.direThe predictions for the economy are dire.grimShe was quickly brought back to the grim reality of her life.awfulThe smell from the bins was awful.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na bad person, action, etc.badA very bad man is getting what he deserves.evilHe was an evil dictator who murdered his own people.wickedRapunzel was trapped inside a tower by a wicked witch.awfulShe was truly awful to him through their entire marriage.terribleHe was a terrible husband.\nSee more results »\nMore examplesFewer examplesIf the party is awful, we can always leave .The hotel was awful! To begin with, our room was far too small.The awful spectre of civil war looms over the country.It's a good job they didn't go camping last weekend - the weather was awful.They live downwind of a pig-farm and sometimes the smell is awful.\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ncheesy\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\nsort\ntawdrily\ntawdriness\ntawdry\nthinness\ntrinket\nwretched\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSerious and unpleasant\nawful adjective\n(VERY GREAT)\nB2 [ before noun ] very great: I don't know an awful lot (= very much) about art, but I'm learning. Fortunately it won't make an awful lot of difference if I don't pass the test. It was an awful risk to take.\nMore examplesFewer examplesThere's an awful lot of smut on television these days.There's an awful lot of work to be done.It's an awful bore cooking a meal every night.It takes an awful long time to travel across the city on public transport.I'm feeling an awful lot better, thanks.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nRelated word\nawfulness\nAdd to word list\nAdd to word list\nvery bad, unpleasant, or of low quality: The weather was awful the whole time – cold and wet. Fox TV has canceled the truly awful sitcom \"Monty\" after a short tryout.\nAwful also means very great or large: We're spending an awful amount of money! Idiom\nan awful lot"}