{"id":25036,"name":"awkward","type":"adjective","us_sound":"ˈɑː.kwɚd","us_link":"../audio/a/awkward.mp3","uk_sound":"ˈɔː.kwəd","uk_link":"../audio/a/ukawein010.mp3","content":"awkward adjective\n(DIFFICULT)\nAdd to word list\nAdd to word list\nB2 difficult to use, do, or deal with: It's an awkward corner, so take it slowly. Some of the questions were rather awkward. It was an awkward ascent, but we reached the top eventually. [ + to infinitive ] My car's quite awkward to drive. He's an awkward customer (= a difficult person to deal with).\nThesaurus: synonyms, antonyms, and examples\nnot easy to deal with or understanddifficultIt's very difficult to find a job in this city. hardThe exam was really hard.complicatedThe instructions were so complicated I just couldn't follow them.complexDesigning a house is a complex process.trickyIt's quite tricky getting the puzzle pieces to fit together.\nSee more results »\nMore examplesFewer examplesIf he persists in asking awkward questions, then send him to the boss.When two of your best friends argue it puts you in a very awkward position.He fielded some awkward questions very skilfully.If they ask any awkward questions, just let me do the talking.It's going to be awkward, to say the least.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\ngruellingly\nonerously\noverdemanding\npainstaking\npicnic\nproblematic\ntricky\ntuff\nultra-sensitive\nunintuitive\nunresolvable\nSee more results »\nawkward adjective\n(EMBARRASSING)\nB2 causing problems, worry, or embarrassment: an awkward position/situation There followed an awkward silence while we all tried to think of something to say. They'd chosen an awkward time to call as I'd just got into the bath. The police asked some awkward questions about where the money had come from.\nC2 embarrassed or nervous: I always feel awkward when I'm with Chris - he's so difficult to talk to. He seemed a little awkward when I first met him.\nMore examplesFewer examplesHe's very deft at handling awkward situations.Somehow she managed to fend off the awkward questions.It's always awkward when you meet someone you know, but you can't remember their name.Her remarks produced an awkward silence.After a long, awkward pause someone asked a question.\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nbore\nbother\nbulky\nburden\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmbarrassing\nAnxious and worried\nAshamed and embarrassed\nawkward adjective\n(NOT HELPFUL)\nmainly UK intentionally not helpful: Just stop being so awkward and help me push the car, will you! Synonym\nuncooperative\nSMART Vocabulary: related words and phrases\nUnhelpful and Uncooperative\nawkwardly\nawkwardness\nbalky\ndeterrent\nfoot\nhang\nnon-cooperation\nnon-cooperative\nobstructionism\nobstructionist\nobstructive\npre-emptive\nstifling\nstiflingly\nstultifying\nstultifyingly\nunaccommodating\nunder your feet idiom\nunforthcoming\nunhelpful\nSee more results »\nawkward adjective\n(MOVEMENT)\nmoving in a way that is not natural, relaxed, or attractive: His movements were slow and awkward.\nSMART Vocabulary: related words and phrases\nInability and awkwardness\naccident-prone\nadorkable\nall thumbs idiom\namateurish\namateurishly\nfunctional illiteracy\ngauche\ngauchely\ngawkily\ngeek\njack-of-all-trades\njack-of-all-trades, master of none idiom\nklutzy\nlike a bull in a china shop idiom\nlost\nuneducable\nunenterprising\nunequal\nungainly\nunskilful\nSee more results »\nRelated word\nawkwardnessIdiom\nthe awkward gang\nawkward adjective\n(DIFFICULT)\nAdd to word list\nAdd to word list\ndifficult to use, do, or deal with: The computer came in a big box that was awkward to carry.\nawkward adjective\n(ANXIOUS)\ncausing inconvenience, anxiety, or embarrassment: It was an awkward situation, because the restaurant was too expensive for us but we didn’t want to just get up and walk out.\nSomeone who feels awkward feels embarrassed or nervous: We were the first to arrive at the party and felt a little awkward.\nawkward adjective\n(LACKING GRACE)\nlacking grace or skill when moving: He’s too awkward – he’ll never be a good dancer.\nawkwardness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɔ·kwərd·nəs/\nHis awkwardness with girls disappeared once he got to college."}