{"id":25080,"name":"axe","type":"noun","us_sound":"æks","us_link":"../audio/a/ax.mp3","uk_sound":"æks","uk_link":"../audio/a/ukawein019.mp3","content":"Add to word list\nAdd to word list\na tool that has a heavy iron or steel blade at the end of a long wooden handle, used for cutting wood: Julian used an axe to chop down the old apple tree.\nkoya79/iStock / Getty Images Plus/GettyImages the axe (US also the ax)\nthe situation in which someone loses their job: Over 500 staff are facing the axe. get the axe (US also get the ax)\nWhen a service, plan, etc. gets the axe, it is stopped or prevented from happening: Religious programmes will be the first to get the axe if she's put in charge of the station.\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\nexcavator\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\nhacksaw\nplunger\nrasp\nrazor knife\nreamer\nsander\nsandpaper\ntrowel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFiring staff\nSuccess & failure in business\nIdiom\nhave an axe to grind\nto reduce services, jobs, payments, etc. a lot or completely without warning or in a single action: Because of the recession the company is to axe 350 jobs. The TV series will be axed owing to a decline in popularity.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nforeshortened\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nAdd to word list\nAdd to word list\nHR, WORKPLACE, MANAGEMENT to get rid of large numbers of employees, especially in order to reduce costs: axe jobs/posts/staff One of the UK's biggest retailers yesterday unveiled plans to axe up to 1,000 jobs in an attempt to kickstart its recovery.\nto stop providing a particular service because it is no longer profitable: Increased competition has forced several low-cost airlines to axe flights on major routes.\nget/be given the axe\nif employees, services, etc. get the axe or are given the axe, a decision is made to get rid of them: A planned expansion of Wyoming health programs could get the ax next year.\nface the axe\nHR, WORKPLACE, MANAGEMENT if employees face the axe, they may lose their jobs, especially because their employer needs to reduce costs: Hundreds of construction workers are facing the axe after a fall in demand for new housing.\ntake an axe to sth/wield the axe\nHR, WORKPLACE, MANAGEMENT to decide to get rid of a large number of employees or to no longer provide particular services: Legislators are considering taking an ax to the latest spending plans. Companies have to know how to wield the axe when market conditions demand it.\nthe axe falls\nHR, WORKPLACE, MANAGEMENT if the axe falls, a company needs to get rid of a large number of employees or can no longer afford to provide particular services: The axe fell after the successful conclusion of merger talks between two of Germany's biggest banks.\nhave an axe to grind\nto have a strong opinion about something that you want other people to accept: Most shareholders have no ax to grind other than keeping company management honest."}