{"id":25397,"name":"aztec","type":"noun","us_sound":"ˈæz.tek","us_link":"../audio/a/cdo0622usazte0166.mp3","uk_sound":"ˈæz.tek","uk_link":"../audio/a/cdo0622ukazte0333.mp3","content":"Add to word list\nAdd to word list\n[ C ] a member of an indigenous group of people (= people living originally in a place rather than coming there from somewhere else) from Mexico: Guacamole dates back to the Aztecs, who called it ahuaca-mulli. He was very knowledgeable about the Aztecs and other ancient Mexican cultures.\n[ U ] the language spoken by Aztecs: Aztec or Nahuatl is still spoken in Mexico by over a million speakers. The word \"mole\", meaning a mixture or sauce, comes from a word in Aztec for chilli sauce.\nMore examplesFewer examplesThe Aztecs were curious about cultures that had preceded them, such as the Olmec, Toltec and Teotihuacán, and they conducted archeological digs. We believe that the Aztecs drank chocolate with chilli peppers, not sugar or anything sweet.\nSMART Vocabulary: related words and phrases\nNames of groups of people who lived in the past\nAnglo-Saxon\nAryan\nBactrian\nCelt\nCeltic\nGreco-\nHebrew\nhun\nIndo-European\nIsraelite\nMayan\nMayanist\nnative\nNorseman\nPict\npie\nroman\nRomano\nSaxon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLanguage names\nbelonging or relating to the Aztec people or their language: I want to learn about my ancestors, the Aztec people. The Aztec religion in pre-Columbian Mexico was based on the sun god as the source of life. The name \"avocado\" comes from an Aztec word. the Aztec Empire\nMore examplesFewer examplesThe exhibition features the most comprehensive collection of Aztec art and culture ever assembled.Aztec social organization was highly complex.The state capital was founded five hundred years ago as an Aztec garrison.It is rare to find such abundant archeological evidence in a single Aztec site. Spaniards were drawn to the area by Aztec stories of great mineral deposits.\nSMART Vocabulary: related words and phrases\nNames of groups of people who lived in the past\nAnglo-Saxon\nAryan\nBactrian\nCelt\nCeltic\nGreco-\nHebrew\nhun\nIndo-European\nIsraelite\nMayan\nMayanist\nnative\nNorseman\nPict\npie\nroman\nRomano\nSaxon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLanguage names"}