{"id":185748,"name":"i","type":"noun","us_sound":"aɪ","us_link":"../audio/i/aye.mp3","uk_sound":"aɪ","uk_link":"../audio/i/ukawein027.mp3","content":"I, i noun [C or U]\n(LETTER)\nAdd to word list\nAdd to word list\nthe ninth letter of the English alphabet\nSMART Vocabulary: related words and phrases\nLetters of alphabets\nalphabet\nalphabetic\nalphabetical\nalphabetically\nalphabetization\nalphanumeric\nalphanumerically\nB, b\ndelta\ngamma\niota\nJ, j\nK, k\nkappa\nL, l\nrho\nS, s\nsigma\nT, t\ntau\nSee more results »\nI, i noun [C or U]\n(NUMBER)\n(also i) the sign used in the Roman system for the number 1 and as part of the numbers 2 (ii), 3 (iii), 4 (iv), 6 (vi), 7 (vii), 8 (viii), and 9 (ix)\nSMART Vocabulary: related words and phrases\nNumbers generally\nbinary number\nC, c\ncardinal\ncontextual variable\ncontinuous variable\ncontrol variable\ncrore\nD, d\ndigit\nlog\nmode\nnos.\nnumber\noutcome variable\nplace value\nprimality\nquantitative\nquantitatively\nscientific notation\nwhole number\nSee more results »\nA1 used as the subject of a verb to refer to the person speaking or writing: I love you. Am I invited? I'm not mistaken, am I? I'd like a coffee, please.\nMore examplesFewer examplesShe was ill so I sent her some flowers to cheer her up.When I was a child I had a dog.I'm sorry that I wasn't able to phone you yesterday.My dad gets cross with me if I leave the kitchen in a mess.I'm sorry you're ill - I hope you get well soon.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nit\nnumber one\npersonally\nS, s\ns/he\nthee\nthem\nthemself\nthey\nthou\nus\nyou\nyou-all\nyours\nYours truly phrase\nyous\nze\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nI noun [C]\n(LETTER)\nAdd to word list\nAdd to word list\nthe ninth letter of the English alphabet\nI pronoun\n(PERSON)\nthe person speaking: I can see her car.\nI number\n(NUMBER)\nthe Roman numeral for the number 1"}