{"id":186477,"name":"iconic","type":"adjective","us_sound":"aɪˈkɑː.nɪk","us_link":"../audio/i/usicela005.mp3","uk_sound":"aɪˈkɒn.ɪk","uk_link":"../audio/i/ukhypot029.mp3","content":"Add to word list\nAdd to word list\nvery famous or popular, especially being considered to represent particular opinions or a particular time: iconic status John Lennon gained iconic status following his death.iconic image The gunfight is the single most iconic image of the Wild West. The film Casablanca won three Academy Awards, and its characters, dialogue, and music have become iconic.\nlanguage\n&#160; specialized showing a relationship between the form of a sign, such as a word or a symbol, and its meaning: Iconic gestures mimic the forms of the things they stand for, such as outlining shapes, or moving your hands multiple times to show repetition. An iconic sign is one whose form resembles its meaning in some way, as opposed to an arbitrary sign. Related word\niconicity\nMore examplesFewer examplesYou must have seen the iconic image of two men standing with black-gloved fists raised in protest.The yellow jersey of the Tour de France is one of sport's most enduring and iconic symbols.Edward Hopper's painting \"Nighthawks\" has since become iconic.Thelma and Louise was an instantly iconic feminist road movie.The Ford Taurus was one of the automotive industry's truly iconic brands. I think his work was so iconic.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstantiate\nmirror\nMr\nMrs\non-brand\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistic terms & linguistic style\nAdd to word list\nAdd to word list\nrelating to or characteristic of a famous person or thing that represents something of importance: Scenes of Parisians dancing in the streets remain iconic images from World War II."}