{"id":186573,"name":"id","type":"noun","us_sound":"ɪd","us_link":"../audio/i/eus72303.mp3","uk_sound":"ɪd","uk_link":"../audio/i/ukicono005.mp3","content":"Add to word list\nAdd to word list\nin psychoanalysis, the deepest part of the unconscious mind that represents the most basic natural human needs and emotions such as hunger, anger, and the wish for pleasure\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nFreudian\nJungian\npreconscious\nprofiler\nprojective\nprojectively\npsych\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMind and personality\nID noun\n(DOCUMENT)\nA2 [ U ] informal abbreviation for identification: any official card or document with your name and photograph or other information on it that you use to prove who you are: Do you have any ID? A driving licence or cheque card will do.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\ndriving licence\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nproceedings\npt\nPTO\nrecertification\nrecertify\nrecharter\nrenewable\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdentifying\nID noun\n(ADDRESS)\nwritten abbreviation for the US state of Idaho: used in addresses\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\nmainly US to look at a person or a body and say who that person is to someone in authority: He had to go to the morgue to ID the body.\n(US usually ID card) to ask someone for identification to prove who or how old they are : They IDed me when I tried to buy a beer.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nAdd to word list\nAdd to word list\nany official card or document with your name and other information on it that you use to prove who you are: [ U ] You need two pieces of ID to cash a check.\nAdd to word list\nAdd to word list\n[ U or C ] an official card or document with your name and photograph or other information on it, used for proving who you are. '\"ID\" is a short form for \"identity\" or \"identification\": For legal immigrants, a primary ID includes a green card, authorization of employment from the Department of Justice or certificate of naturalization. Voters without ID may cast provisional ballots, but then must appear before their county clerk or board of elections within 10 days.carry/show/check ID You will need to show your ID before you can be admitted. See also\nidentification\n[ C ]\n&#160; IT\n&#160; (also identifier) a set of numbers, letters, or symbols that is used to represent a piece of data or a process in a computer program: The Vendor ID and Device ID registers identify the device, and are commonly called the PCI ID. See also\nuser ID\nto officially state or prove who someone is, or to ask someone to show you an official card or document proving who they are: The defense attorney maintains that the defendant was wrongly ID'd by witnesses. If you look too young to buy alcohol, you will almost certainly be ID'd."}