{"id":186591,"name":"idea","type":"noun","us_sound":"aɪˈdiː.ə","us_link":"../audio/i/idea.mp3","uk_sound":"aɪˈdɪə","uk_link":"../audio/i/ukicono008.mp3","content":"idea noun\n(SUGGESTION)\nAdd to word list\nAdd to word list\nA2 [ C ] a suggestion or plan for doing something: have an idea I've had an idea - why don't we go to the coast?good idea \"Let's go swimming.\" \"That's a good idea!\"idea for If you have any ideas for what I could buy Jack, let me know.the idea of That's when I first had the idea of starting (= planned to start) my own business. I like the idea of living in the countryside but I'm not sure I'd like the reality.bright idea She's full of bright (= good) ideas. [ + to infinitive ] It was Kate's idea to hire bikes.it is a good/bad idea to It's not a good idea to drive for hours without a rest.\nThesaurus: synonyms, antonyms, and examples\nan ideaideaI've got an idea - why don't we ask John for help?planThe plan is to hire a car when we get there.thoughtHave you had any thoughts on presents for your mother?suggestionHave you got any suggestions for improvements?brainwaveUK I wasn't sure what to do and then I had brainwave - I could ask Anna for help.brainstormUS She was stuck until she had a brainstorm and the solution came to her.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nMore examplesFewer examplesIt was such a brilliant idea - a real stroke of genius.I'll mention your ideas to Jacinta.She has a lot of interesting ideas, but they're not very practical.He had some crazy idea about turning waste paper into animal food.It's a good idea to read up on a company before going for an interview.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nexceptionalism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nidea noun\n(KNOWLEDGE)\nB2 [ S or U ] an understanding, thought, or picture in your mind: have any idea of Do you have any idea of what he looks like?give someone an idea of something Can you give me an idea of the cost (= can you tell me approximately how it costs)?the idea of I don't like the idea of living so far away from my family. [ + question word ] I haven't the slightest/faintest idea where they've gone.pretty good idea why I've got a pretty good idea why they left early. Synonyms\nconcept\nconception\nconstruct formal\nnotion\nthought have no idea\nB1 informal to not know something: \"Where's Serge?\" \"I've no idea.\"\nSee more\nMore examplesFewer examplesI hadn't the slightest idea what he was talking about.I've got a pretty good idea of how to get there.I've no idea how to set about changing a tyre on a car.Is that the time? I'd no idea it was so late.She has a romantic idea of what it's like to be a struggling young artist.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nexceptionalism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnowledge and awareness\nidea noun\n(BELIEF)\nB1 [ C ] a belief or opinion: idea about We have very different ideas about disciplining children. [ + that ] Dr Leach puts forward the idea that it is impossible to spoil a child. I'm not married - where did you get that idea (= what made you believe that)?\nMore examplesFewer examplesSome people have the idea that national identity will be lost as a result of European integration.I'm very much against the idea that it is the woman's job to bring up the child.Do you agree with the idea that violence on television has a harmful effect on children?Everyone has their own ideas about the best way to bring up children.Lenin carried Marx's ideas a stage further by putting them into practice.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\nsomeone's idea of something idiom\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdeas, concepts and theories\nidea noun\n(PURPOSE)\nC1 [ S ] a purpose or reason for doing something: idea of The idea of the game is to get rid of all your cards as soon as you can.whole idea of The whole idea (= only purpose) of advertising is to make people buy things.idea behind The idea behind the lottery is to raise money for good causes.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\npoodle\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReasons and explanations\nIdioms\ngood idea\nsomeone's idea of something\nput ideas into someone's head\nwhat an idea!\nyou have no idea\nidea noun\n(SUGGESTION)\nAdd to word list\nAdd to word list\n[ C ] a suggestion, thought, or plan: \"Let’s go swimming.\" \"Good idea!\" She’s full of bright ideas.\nidea noun\n(KNOWLEDGE)\n[ C/U ] knowledge or understanding about something: [ C ] Can you give me a rough idea of the cost (= tell me approximately how much it will cost)? [ U ] You have no idea what I just said, do you?\nidea noun\n(BELIEF)\n[ C ] a belief about something: They have some unusual ideas about parenting.\nidea noun\n(PURPOSE)\n[ C usually sing ] a purpose or reason for doing something: The idea behind the law is to raise money for education.\nAdd to word list\nAdd to word list\n[ C ] a suggestion or plan for doing something: idea about sth The CTO should have ideas about where the company needs to be heading in terms of technology.come up with/have an idea He came up with the idea of promoting the two products together. new/fresh/innovative ideas They had great ideas but lacked the business know-how to turn an idea into a successful product.\n[ S ] the purpose of, or reason for, doing something: The whole idea of budgeting is to control costs."}