{"id":186661,"name":"identify","type":"verb","us_sound":"aɪˈden.t̬ə.faɪ","us_link":"../audio/i/identify.mp3","uk_sound":"aɪˈden.tɪ.faɪ","uk_link":"../audio/i/ukicono022.mp3","content":"identify verb\n(RECOGNIZE)\nAdd to word list\nAdd to word list\nB2 [ T ] to recognize someone or something and say or prove who or what that person or thing is: Even the smallest baby can identify its mother by her voice. The gunman in Wednesday's attack has been identified as Lee Giggs, an unemployed truck driver. The police officer identified himself (= gave his name or proved who he was) and asked for our help.\nB2 [ T ] to recognize a problem, need, fact, etc. and to show that it exists: The research will be used to identify training needs. You need to identify your priorities.\nMore examplesFewer examplesA robin is easy to identify because of its red breast.After she had identified the body of her husband, the police asked her to collect his personal effects.Aircraft are required by law to carry special electronic devices, called transponders, so that they can be identified.The press has identified several people they think are likely to be appointed to government posts in the autumn.How many different trees can you identify?\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nidentify verb\n(FEEL)\n[ I + adv/prep ] to feel and say that you belong to a particular group of people: identify as Someone who is assigned male at birth may identify as female. Voters identifying as Republicans dropped by 2 percent. Although race is a social construction, it's a big part of how you identify.\nMore examplesFewer examplesI identify as straight, but I have had gay experiences.I identify as a New Yorker much more than anything else.She identifies as a cultural Jew but not as a religious Jew.When you aren't comfortable with who you are, regardless of how you identify sexually, it's hard to meet a partner.A biracial person who was raised by, let's say, a white mom and a white stepdad might identify differently.Nowadays people might identify in fluid and changing ways.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\njib\nneurotypicality\nnoddle\nnoetic\nnoggin\nnon-identity\npsychoanalysis\npsychoanalytic\nsubconscious\nSee more results »\nPhrasal verbs\nidentify with someone\nidentify someone/something with something\nAdd to word list\nAdd to word list\nto recognize or be able to name someone or something, or to prove who or what someone or something is: Small babies can identify their mothers. The police officer refused to identify himself. Phrasal verbs\nidentify someone with something\nidentify with someone\nAdd to word list\nAdd to word list\nto find and be able to describe someone or something: identify what/which/who To create an effective advertising campaign you must first identify who your target market is. A good business recovery service should include an initial risk assessment to identify which essential processes are at risk and how the risk can be reduced.\nto say or prove who or what someone or something is: The document must identify you by name and bear your signature or a readily recognizable photograph of you. You will be asked to identify yourself at the reception desk when you arrive. Phrasal verb\nidentify with sth"}