{"id":186667,"name":"identification","type":"noun","us_sound":"aɪˌden.t̬ə.fəˈkeɪ.ʃən","us_link":"../audio/i/identification.mp3","uk_sound":"aɪˌden.tɪ.fɪˈkeɪ.ʃən","uk_link":"../audio/i/ukicono021.mp3","content":"Add to word list\nAdd to word list\nB2 the act of recognizing and naming someone or something: Most of the bodies were badly burned, making identification almost impossible.\nA2 (also ID) an official document that shows or proves who you are: We were asked to show some identification before the security guards would let us in.\nMore examplesFewer examplesThe security guards gave me the once-over, but they didn't ask me for any identification.Wellington Barracks is a restricted area and anyone who enters should have identification.Please see to it that no-one comes in without identification.Identity cards for football supporters could be the thin end of the wedge - soon everyone might have to carry identification.Please may I see some identification?\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOfficial documents\nAdd to word list\nAdd to word list\nthe ability to name or recognize someone or something: Identification of the victims of the plane crash still is not complete.\nIdentification is also proof of who someone or something is, usually in the form of documents: We were asked to show identification at the airport check-in.\nAdd to word list\nAdd to word list\n[ U ] an official card or document with your name and photograph or other information on it, used for proving who you are: provide/show identification To open a new account, the bank will require you to show four pieces of identification. Please can I see some identification? identification card/number/papers See also\nID noun\n[ C or U ] the process of recognizing someone or something, and stating or proving who or what they are: A strict legal injunction was issued banning the publication of any material that might lead to the identification of the witnesses.form/means/proof of identification You will be asked to show your passport as proof of identification. See also\nemployer identification number\nPIN"}