{"id":186676,"name":"identity","type":"noun","us_sound":"aɪˈden.t̬ə.t̬i","us_link":"../audio/i/eus72306.mp3","uk_sound":"aɪˈden.tə.ti","uk_link":"../audio/i/ukicono024.mp3","content":"identity noun\n(WHO YOU ARE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a person's name and other facts about who they are: The man's identity was being kept secret while he was helping police with their enquiries. I cannot reveal the identity of my source. The informant was given a new identity (= a different name and new official documents) for protection.mistaken identity The newspaper photo apparently showed him in Rome but it was a case of mistaken identity (= it was the wrong person). See also\nidentity parade\nidentity theft\n[ C or U ] the fact of being, or feeling that you are, a particular type of person, organization, etc.; the qualities that make a person, organization, etc. different from others: a loss of identity In prison people often suffer from a loss of identity.a sense of identity I think my job gives me a sense of identity. It was important for me to carve out an identity separate from my husband's. cultural/national/ethnic identity See also\nbrand identity\ngender identity\nidentity crisis\nidentity politics\nMore examplesFewer examplesHe was quite certain about his attacker's identity.At the border, agents take scans and photos which are used to confirm the travellers' identities. He assumed a false identity in order to escape from the police.To conceal his identity, the man's words are being read by an actor.Through a process of deduction , the detectives discovered the identity of the killer.Australia has its own cultural identity, which is very different from that of Britain.The idea of a united Europe is based on shared cultural and political identities.Her professional identity is fluid: how she describes her role depends on the situation and the needs of her clients.These long ago events were truly instrumental in shaping the identity of their faith.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNames and titles\nMind and personality\nidentity noun\n(BEING THE SAME)\n[ S or U ] formal the fact of being or feeling the same: identity between Here, there is a complete identity between his theology and his practice. identity with We begin with the image of a boy gazing into a pool and feeling an identity with what he sees.\nMore examplesFewer examplesIt's quite surprising that you have perfect identity in many parts of the genome between human, mouse and rat.The writer notes a curious identity between the pursuer and the pursued.Karl Jung said that his compassion for animals stemmed from a primitive attitude of mind, an unconscious identity with animals.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nshowing or proving who someone is: You will need to show identity documents. Anyone can create an account with no identity verification. See also\nidentity card\nMore examplesFewer examplesHe was charged with possession of false identity papers. The newborn babies are all given identity bracelets. Please wear your identity badge throughout the conference.Each soldier wore an identity disc with his name and service number.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\npick\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNames and titles\nidentity noun [C]\n(person)\nAdd to word list\nAdd to word list\nwho a person is, or the qualities of a person or group that make them different from others: [ U ] As a journalist she refuses to reveal the identity of her source.\nidentity noun [C]\n(mathematical statement)\nalgebra an equation (= mathematical statement) that is true for every value given to a variable (= number that can change)\nAdd to word list\nAdd to word list\nthe reputation, characteristics, etc. of a person or organization that makes the public think about them in a particular way: Companies often spend a fortune on branding in their attempts to communicate their identity.\nwho a person is, or information that proves who a person is, for example, their name and date of birth: When applying for a driver license or identification card, you must provide proof of your identity. confirm/prove your identity You may be asked to confirm your identity by phone. See also\nbrand identity\ncorporate identity"}