{"id":186654,"name":"identical","type":"adjective","us_sound":"aɪˈden.t̬ə.kəl","us_link":"../audio/i/identical.mp3","uk_sound":"aɪˈden.tɪ.kəl","uk_link":"../audio/i/ukicono018.mp3","content":"Add to word list\nAdd to word list\nB2 exactly the same, or very similar: I've got three identical blue suits. The two rooms were virtually identical. The interests of both parties may not be identical, but they do overlap considerably.identical to The tests are identical to those carried out last year. Compare\nselfsame\nThesaurus: synonyms, antonyms, and examples\nexactly like each otherthe sameI have the same dress as her.identicalThe employees all wore identical blue shirts.indistinguishableThe counterfeit certificate was so good it was indistinguishable from the real thing.equalFour groups of ten is equal to two groups of twenty.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ncompletely differentoppositeTheir two daughters may look alike, but they are completely opposite to one another. polar oppositesLove and hate are polar opposites.identicalHis opinions are identical to his spouse's.antitheticalHis actions were absolutely antithetical to our code of conduct.converseIf we ask what a citizen must sacrifice for the good of the nation, we must ask the converse question: what will the nation sacrifice for the good of its citizens?\nSee more results »\nMore examplesFewer examplesHospitals always seem such impersonal places - rows of identical beds in dull grey rooms.The measurements of both rooms were identical.We flew over the city with its serried ranks of identical grey houses.Their twins are virtually identical.She had shut out two of her first four Wimbledon opponents by identical 6-0, 6-0 scores.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nRelated word\nidenticallyGrammar\nSame, similar, identicalSame means that two or more things are exactly like one another. We can use same as an adjective before a noun or as a pronoun. When we use same to compare people or things, we must use it with the: …\nAdd to word list\nAdd to word list\nexactly the same, or very similar: The test is identical to the one you took last year. identically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɑɪˈdent·ɪk·li/\nThe two sisters dressed identically."}