{"id":186876,"name":"idle","type":"adjective","us_sound":"ˈaɪ.dəl","us_link":"../audio/i/idle.mp3","uk_sound":"ˈaɪ.dəl","uk_link":"../audio/i/ukidioc009.mp3","content":"idle adjective\n(NOT WORKING)\nAdd to word list\nAdd to word list\nC1 not working or being used: stand idle Half these factories now stand idle.sit idle It's crazy to have £7,000 sitting idle in the bank.\nThesaurus: synonyms, antonyms, and examples\nnot active or workinginactiveIf you haven’t voted in the last two elections, we consider you inactive and remove you from the electoral roll.dormantThe plants will stay dormant throughout the winter.latentMany people in the region have latent tuberculosis.quiescentThe extremist group was politically quiescent but very socially active.moribundThe family business is now moribund.\nSee more results »\nAn idle moment or period of time is one in which there is no work or activity: If you have an idle moment, call me.\nwithout work: Almost half of the workforce are now idle. Synonym\nunemployed\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak\nbreak down\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassive and not working\nUnemployment\nidle adjective\n(NO PURPOSE)\nC2 [ before noun ] without any particular purpose: idle chatter/gossip/speculation an idle glance This is no idle threat.\nThesaurus: synonyms, antonyms, and examples\nhaving no clear plan or purposeaimlessHe was just aimless and confused after being let go from his position.directionlessThe party was plagued with weak and directionless leaders who had no clue how to govern.purposelessThe job left him feeling unfulfiled and purposeless.adriftHis son has just been utterly adrift since leaving university.emptyAfter losing him, I just feel empty inside.\nSee more results »\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitless\nfruitlessly\nfruitlessness\nfutile\nfutilely\nmotiveless\nnegate\nnegation\nno good idiom\nunrealistically\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nSee more results »\nidle adjective\n(LAZY)\nC2 UK lazy and not willing to work: bone idle He's a very able student, he's just bone idle (= very lazy).\nThesaurus: synonyms, antonyms, and examples\nnot willing to work or use effortlazyHe's one of the laziest people I've ever met.indolentSome of my classmates are indolent in their health habits.slothfulTelevision and video games have bred a generation of slothful teens.work-shyUK I don't want your work-shy cousin living with us indefinitely!idleUK He's an able student, just idle.\nSee more results »\nSMART Vocabulary: related words and phrases\nLaziness and lazy people\nbludger\nbone idle idiom\nbum around\nCBA\nclock-watcher\nindolent\nindolently\nlayabout\nlazily\nlaziness\nphone in\nshiftless\nshirker\nskiver\nslacker\nsluttishly\ntime-server\ntime-serving\nunambitious\nvegetable\nSee more results »\nRelated word\nidleness\nIf an engine or machine idles, it runs slowly but does not move or do any work: He left the engine idling and ran into the shop.\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\nstrip\ntick over\ntune (something) up\nunmechanized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe engine & engine parts\nPhrasal verb\nidle something away\nAdd to word list\nAdd to word list\nnot working, not active, or doing nothing: idle factories The machines are standing idle because there are no spare parts.\nIdle also means not useful or not based on fact: idle speculation idleness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɑɪ·dəl·nəs/idly adverb us\nYour browser doesn't support HTML5 audio\n/ˈɑɪd·li, -əl·i/\nI will not stand idly by while my business is being destroyed.\nIf an engine idles, it is operating but not doing any work: Let the engine idle for a minute before you put the car in gear.\nAdd to word list\nAdd to word list\nPRODUCTION, WORKPLACE not operating or not being used: stand/lie/remain idle As more factories in the city stood idle, workers started leaving.\nFINANCE used to describe assets that are not earning money or interest, or not earning enough: If you've got a few thousand pounds lying idle in a savings account, think about paying off part of your mortgage or credit card debts.idle cash/capital/funds These idle funds can be invested on the money market.\nHR, WORKPLACE unemployed, or not working on a job: More than 22,913 assembly workers remained idle because of continued shortages of imported parts.\nPRODUCTION, HR to stop using your employees, factory, machines etc., for example because you do not have enough work for them to do: Lack of demand forced the automaker to idle two more plants on Monday."}