{"id":187273,"name":"if","type":"conjunction","us_sound":"ɪf","us_link":"../audio/i/if.mp3","uk_sound":"ɪf","uk_link":"../audio/i/ukidioc017.mp3","content":"if conjunction\n(IN THAT SITUATION)\nAdd to word list\nAdd to word list\nA2 used to say that a particular thing can or will happen only after something else happens or becomes true: I'll pay you double if you get the work finished by Friday.if not We'll have the party in the garden if the weather's good. If not (= if the weather is not good), it'll have to be inside. If anyone calls, just say I'll be back in the office at four o'clock. If she hadn't called, I wouldn't have known.(even) if I wouldn't work for them (even) if they paid me twice my current salary.if and when We'll deal with that problem if and when it arises. If disturbed, the bird may abandon the nest, leaving the chicks to die.\nalthough: even if They're great kids, even if they can be demanding.literary It was a hot, if windy day.\nB1 every time: If water is heated to 100°C it turns to steam. If I don't get enough sleep I get a headache.\nused to mean \"if it is true that\": I'm very sorry if I've offended you.\nMore examplesFewer examplesYou'll feel cold if you don't wear a coat.You have to go to college for a lot of years if you want to be a doctor.Try to act confidently, even if you feel nervous.The TV won't work if the aerial's not connected.Biscuits will stay crisp if you keep them in an airtight container.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: connecting words which express a contrast\nif conjunction\n(WHETHER)\nB1 used to introduce a clause, often in indirect speech, that shows two or more possibilities: Mrs Kramer called half an hour ago to ask if her cake was ready. I don't care if he likes it or not - I'm coming! I was wondering if you'd like to come to the cinema with me this evening? Compare\nwhether\nMore examplesFewer examplesI must see if my flatmate has paid those bills yet.We asked if the computer could access the internet.You could always call Susie and see if she might babysit.I asked if she'd like to come out with us tonight.I couldn't find the station, so I asked someone if they could direct me.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nif conjunction\n(REQUEST)\nused when you want to make a polite request or remark: If you'd like to take a seat, Mr Chang will be with you in a moment. Would you mind if I open/opened (= can I open) the window? There are, if you don't mind me saying so, one or two problems with this plan.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nwhether\nGrammar\nShould you (Should with inversion)In formal situations, we can use should + subject (s) + verb (v) instead of if: …\nHad you (Had with inversion)In formal situations, we can use had + subject + verb instead of if in third conditional sentences: …\nIf + were toIn formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nAs long as, so long as, providing, etc.Sometimes we need to impose specific conditions or set limits on a situation. In these cases, conditional clauses can begin with phrases such as as long as, so long as, only if, on condition that, providing (that), provided (that). …\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nConditionals: typical errorsWe don’t use will and would in the conditional clause: …\nConditionalsConditional sentences consider imagined or uncertain situations and the possible results of these situations. The most common types of conditional sentences involve if: …\nConditionals: imagined situationsConditional sentences consider imagined or uncertain situations and the possible results of these situations. The most common types of conditional sentences involve if: …\nConditional sentencesConditional sentences consist of a conditional clause and a main clause: …\nOrder of clausesConditional clauses usually come before main clauses but they may also come after them: …\nVerb forms in the conditional clauseThe verb in the conditional clause may be in the simple form or the continuous form, depending on the meaning: …\nConditionals: ifThere are different types of conditions. Some are possible or likely, others are unlikely, and others are impossible: …\nImagined conditionsThere are different types of conditions. Some are possible or likely, others are unlikely, and others are impossible: …\nImagined conditions: the first conditionalWe use the first conditional to talk about the result of an imagined future situation, when we believe the imagined situation is quite likely: …\nImagined conditions: the second conditionalWe use the second conditional to talk about the possible result of an imagined situation in the present or future. We say what the conditions must be for the present or future situation to be different. …\nFirst and second conditional comparedWhen we use the first conditional, we think the imagined situation is more likely to happen than when we use the second conditional. …\nImagined conditions: the third conditionalWe use the third conditional when we imagine a different past, where something did or did not happen, and we imagine a different result: …\nReal conditionalsSome conditions seem more real to us than others. Real conditionals refer to things that are true, that have happened, or are very likely to happen: …\nTypes of conditional: summaryThe table shows how the main types of conditionals relate to one another. …\nIf + shouldWe can use if with should to refer to events which might happen by chance or by accident: …\nConditional clauses with will or wouldWill and would can be used in conditional clauses, either with the meaning of ‘being willing to do something’, or to refer to later results: …\nMixed conditionalsOften, things that did or did not happen in the past have results which continue or are still important in the present. We can emphasise this by using if with a past perfect verb, and would in the main clause. …\nConditionals in speakingIn speaking, we often use if-clauses without main clauses, especially when asking people politely to do things. If is usually followed by will, would, can or could when it is used to be polite: …\nConditionals: other expressions (unless, should, as long as)Conditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessConditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nIfIf is a conjunction. …\nIf or when?We use if to introduce a possible or unreal situation or condition. We use when to refer to the time of a future situation or condition that we are certain of: …\nIf: conditionsWe often use if to introduce possible or impossible situations or conditions and their results. The situations or conditions can be real, imagined or uncertain: …\nIf possible, if necessaryWe can sometimes leave words out after if to form fixed expressions: …\nIf so, if notWe use so or not after if when it is obvious what we are referring to: …\nEven ifWe can use even if to mean if when talking about surprising or extreme situations: …\nIf: reporting questionsWe use if to introduce reported yes-no questions and questions with or. …\nIf and politenessIn speaking, we often use if to introduce a polite request. If is usually followed by modal verbs will, would, can or could when it is used to be polite: …\nWhen or if?We use when to refer to a future situation or condition that we are certain of, whereas we use if to introduce a possible or unreal situation. …\nWhether not ifWe use whether and not if after prepositions: …\nI doubt if, I don’t know whetherWe use if or whether to introduce clauses after verbs of doubting: …\nIf, whether: typical errorsWe use whether, not if, before to-infinitives: …\nIf or whether? …\nIf and whether: indirect questionsWe can use if or whether to report indirect yes-no questions and questions with or. If is more common than whether: …\nIdioms\nif and when\nif anything\nif I were you\nif need be\nif you will\nsomething that is not certain or not yet decided: big if There's a big if hanging over the project (= it is uncertain whether the project will happen).\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nIdiom\nno ifs or buts\nif conjunction\n(IN THAT SITUATION)\nAdd to word list\nAdd to word list\nused to say that a particular thing can or will happen when, only when, or after something else happens or becomes true: We’ll have the party in the backyard if the weather’s good. If anyone calls for me, just say I’ll be back at 4 o’clock. Would you mind if I opened the window (= May I open it)?\nIf is also used to talk about the amount or degree of something: This time of year we get little, if any, rain (= almost none).\nIf can mean when: If I don’t have a cup of coffee in the morning, I’m useless.\nIf can also mean in case it is true that: I’m sorry if I’ve offended you. if it weren't for\nWhen you say if it weren't for or (also if it hadn't been for)something, you mean if it were not true or had not happened, the situation would be different: If it weren’t for your help, we would never have finished in time.\nif conjunction\n(WHETHER)\n(used to introduce a clause, often when reporting what someone else said) whether: Mrs. Kramer called to ask if her cake was ready. Idioms\nif all else fails\nif and when\nif I were you\nif need be\nif only\nif the worst comes to the worst\nif you will\nif noun [C]\n(UNCERTAIN SITUATION)\nsomething that is not yet certain or not yet decided: The plan contains a lot of ifs."}