{"id":187380,"name":"ignore","type":"verb","us_sound":"ɪɡˈnɔːr","us_link":"../audio/i/ignore.mp3","uk_sound":"ɪɡˈnɔːr","uk_link":"../audio/i/ukignor002.mp3","content":"Add to word list\nAdd to word list\nB2 to intentionally not listen or give attention to: She can be really irritating but I try to ignore her. Safety regulations are being ignored by company managers in the drive to increase profits. How can the government ignore the wishes of the majority? I smiled at her but she just ignored me.\nThesaurus: synonyms, antonyms, and examples\nto intentionally not give someone or something any attentionignoreThe buzzing is irritating, but try to ignore it.disregardHe disregarded the advice of his doctor and went back to work.turn a blind eye toUntil now, the mayor has turned a blind eye to the city's homelessness problem.close your eyes toThe administration closed its eyes to human-rights abuses by its soldiers.\nSee more results »\nMore examplesFewer examplesThe management's decision to ignore the safety warnings demonstrated a remarkable lapse of judgment.I didn't ignore her intentionally - I just didn't recognize her.They feel angry that their complaints were ignored.Many people feel that the prime minister spends too much time on foreign trips and is ignoring domestic problems.Most shops are ignoring the government's edict against Sunday trading.\nSMART Vocabulary: related words and phrases\nNeglecting and ignoring\naside\nbeneath the/someone's radar idiom\nblock something out\nbrush someone/something off\nbury/have your head in the sand idiom\near\nlay\nlet sleeping dogs lie idiom\nlet something go/pass idiom\nlet something ride idiom\nlook straight/right through someone idiom\nlose the dressing room idiom\nnose\nshut\nshut someone/something out\nshut your eyes to something idiom\nsleeping beauty\nsomeone's back is turned idiom\nthe silent treatment idiom\nwink\nSee more results »\nAdd to word list\nAdd to word list\nto give no attention to something or someone: They ignored our warnings. The mayor ignored the hecklers and went on with her speech."}