{"id":187527,"name":"ilex","type":"noun","us_sound":"ˈaɪ.ləks","us_link":"../audio/i/cdo0623usilex1920.mp3","uk_sound":"ˈaɪ.ləks","uk_link":"../audio/i/cdo0623ukilex1917.mp3","content":"ilex noun [C]\n(OAK)\nAdd to word list\nAdd to word list\nan evergreen oak tree (= one that never loses its leaves) that grows in Southern Europe: We walked up through the ilexes to the tower. You will cross a bridge and see a large ilex tree on your right.\nMore examplesFewer examplesThe broad promenade is lined with plane, lime, ilex, and chestnut.The path led gently downhill into the deep shadow of a grove of ilex trees.It's possible to walk across the bridge, with obvious paths on the other side leading left into lovely ilex woods.An avenue of ilex trees leads to the heart of the original garden.\nSMART Vocabulary: related words and phrases\nTypes of evergreen & coniferous tree\naraucaria\narborvitae\narbutus\nareca\nAtlantic white cedar\nEastern white pine\neucalyptus\nficus\nfir\nFraser fir\nmountain laurel\nNorfolk Island pine\nNorway spruce\noleander\npalmetto\nsilver fir\nSitka spruce\nstrawberry tree\nsubalpine fir\ntamarack\nSee more results »\nilex noun [C]\n(HOLLY)\nany evergreen tree or bush (= one that never loses its leaves) of a genus (= family of related plants) that includes holly (= a small tree or bush with shiny, sharp leaves and small, round, red fruit) : The native British holly, Ilex aquifolium, has numerous cultivars. He is an enthusiast for certain tree genera, such as acer and ilex, and sells rarer and more unusual hollies.\nMore examplesFewer examplesHolly, Ilex aquifolium, is an excellent evergreen hedge, but is especially slow to establish.Hollies with fewer prickles include Ilex Balearica and Ilex Camelliifolia.\nSMART Vocabulary: related words and phrases\nCommon plants\nAfrican violet\nagave\naloe\naloe vera\nalpine strawberry\ndianthus\ndichondra\ndieffenbachia\ndill weed\ndracaena\nloganberry\nmaidenhair fern\nmaize\nmandrake\nmare's tail\nsorrel\nsotol\nsow thistle\nSpanish moss\nspearmint\nSee more results »"}