{"id":187636,"name":"illegitimacy","type":"noun","us_sound":"ˌɪl.ɪˈdʒɪt̬.ə.mə.si","us_link":"../audio/i/usignom005.mp3","uk_sound":"ˌɪl.ɪˈdʒɪt.ə.mə.si","uk_link":"../audio/i/ukignor012.mp3","content":"illegitimacy noun [U]\n(OF ACTION)\nAdd to word list\nAdd to word list\nformal the condition of being not legal or fair: The illegitimacy of this Bill must be clear to everyone. The country’s problem has been the illegitimacy of its own government.\nMore examplesFewer examplesA whistleblower alleged the illegitimacy of the claimed “marketing” payments.Today's antics highlighted the illegitimacy of a hastily crafted process without established precedent or established rules.By the 1980s, the illegitimacy of this presumption had become widely recognised. I have feelings about the illegitimacy of the presidency.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\none-way\nthe old school tie\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLegal & illegal\nillegitimacy noun [U]\n(OF BIRTH)\nthe state of being born of parents not married to each other: He was born out of wedlock at a time when there was huge stigma around illegitimacy. The 30-year rise in illegitimacy came to a halt and has remained flat. See\nillegitimate\nMore examplesFewer examplesSealing adoptees' birth certificates was seen as a way to protect children born outside of marriage from the stigma of illegitimacy.It is unclear why illegitimacy rates began rising rapidly four decades ago.You might be alerted to illegitimacy by a blank space where a father's name should be on a birth certificate.The stigma of illegitimacy was harsh and the usual practice, where possible, was for the mother to go away to have her child.\nSMART Vocabulary: related words and phrases\nParents & children\nbabyhood\nbabymoon\nbastard\nbrat\nchild abuse\nfraternal twin\nguardianship\nidentical twin\nillegitimately\norphan\nparent\nparentage\nparental\nparentally\nsingleton\nsoccer mom\nstep-parent\nthe generation gap\ntriplet\ntug of love\nSee more results »"}