{"id":187619,"name":"illegal","type":"adjective","us_sound":"ɪˈliː.ɡəl","us_link":"../audio/i/illegal.mp3","uk_sound":"ɪˈliː.ɡəl","uk_link":"../audio/i/ukignor007.mp3","content":"Add to word list\nAdd to word list\nB2 not allowed by law: a campaign to stop the illegal sale of cigarettes to children under 16 Prostitution is illegal in some countries.it is illegal to It is illegal to drive a car that is not registered and insured.illegal drug/substance Cocaine, LSD, and heroin are all illegal drugs/substances. Synonym\nillicitOpposites\nlawful formal\nlegal\nlicit formal\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\nnot allowed by the rules of a sport: There were two illegal passes in the first 13 minutes of the game, and several more followed. The team received two warnings for illegal play. His tackle was illegal, and his sending-off changed the course of the game.\nMore examplesFewer examplesIt is illegal to do a U-turn on a motorway.The proposed change in the law would make abortion illegal except for strictly defined medical reasons.It's illegal to discriminate against people on the basis of their sex.For a teacher to hit a child is not just morally wrong but also illegal.Several athletes tested positive for illegal performance-enhancing drugs.The referee missed the illegal shot and continued the count.Illegal blocks include the use of any part of the arm below the elbow, which results in a penalty.\nSMART Vocabulary: related words and phrases\nLegal & illegal\nbang to rights idiom\nbootleg\nchargeable\nconcealed carry idiom\ncontroverted election\ncriminally\nillegality\nimproper\nlegality\nlegitimately\nlicensed\nlicit\nlicitly\nnon-criminal\nshady\ntreasonable\nunlawful\nunsanctioned\nvalidity\nvalidly\nSee more results »\nRelated word\nillegally\nan offensive word for someone who lives or works in another country when they do not have the legal right to do this: He said ID cards would make it easier to deport illegals. Synonym\nillegal immigrant\nSMART Vocabulary: related words and phrases\nPeople who live or settle somewhere\nasylum seeker\nboarder\nbrain drain\ncity slicker\nco-resident\nfrontiersman\nGeorgian\nguest worker\nhabitant\nillegal alien\nlodger\noccupier\nOrcadian\noutflow\noverspill\nrepeople\ntroglodyte\nvillager\nwelcome wagon\nyear-rounder\nSee more results »\nAdd to word list\nAdd to word list\nagainst the law: Fireworks are illegal in many places. illegal immigrant/alien\nAn illegal immigrant/alien is a person who has entered a country without government permission. illegally adverb us\nYour browser doesn't support HTML5 audio\n/ɪˈli·ɡə·li/\nillegally obtained passports\nAdd to word list\nAdd to word list\nLAW not allowed by law: According to state law, smoking is illegal in all public buildings.illegal (for sb) to do sth It is illegal for a company to force an employee into early retirement.make sth illegal The new law will make it illegal to record phone conversations without consent. illegal sales/profits/trades Compare\nlegal\nIT used to describe a character (= letter, number, or symbol) that you cannot use in a particular place on a computer, because it may create problems: The colon is the only illegal character for file and folder names. illegally adverb\nApproximately 500,000 workers enter the country illegally each year."}