{"id":187820,"name":"illustration","type":"noun","us_sound":"ˌɪl.əˈstreɪ.ʃən","us_link":"../audio/i/illustration.mp3","uk_sound":"ˌɪl.əˈstreɪ.ʃən","uk_link":"../audio/i/ukillus004.mp3","content":"illustration noun [C or U]\n(PICTURE)\nAdd to word list\nAdd to word list\nC1 a picture in a book, magazine, etc. or the process of illustrating something: a full-page illustration colour/black and white illustrations Synonyms\nimage (PICTURE)\npicture (IMAGE)\nMore examplesFewer examplesThe illustrations show monstrous beasts with bodies like bears and heads like tigers.You will be expected to assist the editor with the selection of illustrations for the book.Encyclopedias on CD-ROM include sound, illustrations and simple animations.The book contains 25 colour illustrations.The description was accompanied by a wonderful illustration.\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\nfloral\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npencil\nraster\nrehang\nscreen print\nseascape\nshade\nsketch\nSee more results »\nillustration noun [C or U]\n(EXAMPLE)\nC2 an example that explains or proves something: illustration of This delay is a perfect illustration of why we need a new computer system.by way of illustration A couple of examples are included, by way of illustration (= to show the meaning more clearly).\nMore examplesFewer examplesThe president's budget is a vivid illustration of how much the political landscape has changed over the past two years.One illustration of how severe the problem is, in this clinic an estimated two out of every five pregnant women are HIV positive.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\ninstance\njob\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\nAdd to word list\nAdd to word list\na picture: [ C ] Look at the illustration on page 37.\nAn illustration is also an example that makes something easier to understand, or the giving of such examples: [ C ] That’s a perfect illustration of the problem.\nAdd to word list\nAdd to word list\nan example that shows something: In our illustration of how much your initial investment might be worth at term, we are assuming an 8% rate of return."}