{"id":187859,"name":"im","type":"verb","us_sound":"ˌaɪˈem","us_link":"../audio/i/cespus000537.mp3","uk_sound":"ˌaɪˈem","uk_link":"../audio/i/cespuk000537.mp3","content":"Add to word list\nAdd to word list\nabbreviation for instant messaging\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninterweb\nIP\nkeyboard warrior\nlanding page\nleet\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nmedical\n&#160; specialized abbreviation for intramuscular: An IM injection is chosen when reasonably rapid systemic uptake of the drug is needed by the body.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\norigin\noxytocin\npapilla\npapillary\nparietal\nventriculus\nvesica\nvesical\nvesicle\nvestibular\nSee more results »\nAdd to word list\nAdd to word list\nto communicate with someone over the Internet using a program that sends and receives messages without delay: I finish my homework, take out the garbage, and then IM my friends.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS, INTERNET abbreviation for instant messaging: a service available on the internet that allows you to exchange written messages very quickly with someone who is using the internet at the same time: Some businesses use IM for quick updates on project status or meeting times. See also\nchat noun\nemail noun\ntexting\nTweet\nCOMMUNICATIONS, INTERNET abbreviation for instant message: a written message that can be sent over the internet to someone who is using the internet at the same time: Thanks to the internet, students say that if they get stuck on a math problem, help is only an IM away.\nIT abbreviation for\ninformation management\nCOMMUNICATIONS, INTERNET abbreviation for instant message: to use the internet to exchange written messages very quickly with someone who is using the internet at the same time: IM with sb By setting up internal IM services, you can more easily IM with your corporate clients. The app lets you IM your friends directly from your mobile phone."}