{"id":187862,"name":"image","type":"noun","us_sound":"ˈɪm.ɪdʒ","us_link":"../audio/i/image.mp3","uk_sound":"ˈɪm.ɪdʒ","uk_link":"../audio/i/ukillus008.mp3","content":"image noun\n(MENTAL PICTURE)\nAdd to word list\nAdd to word list\nC2 [ C ] a picture in your mind or an idea of how someone or something is: I have an image in my mind of how I want the garden to be.fit your image He doesn't fit (= he is different to) my image of how an actor should look.\nB2 [ C or U ] the way that something or someone is thought of by other people: public image The aim is to improve the public image of the police. The company has made strenuous attempts to improve its image in recent years.image-conscious He's terribly image-conscious (= tries to dress and behave in a way that other people will admire).\n[ C ]\n&#160; literature\n&#160; specialized a mental picture or idea that forms in a reader's or listener's mind from the words that they read or hear: The poem is full of images of birth and new life.\nMore examplesFewer examplesI can't get that dreadful image out of my mind.Recently the president has sought to project a much tougher image.For some people, the word 'England' may still conjure up images of pretty gardens and tea parties.The city is trying to shrug off its industrial image and promote itself as a tourist centre.Water, a symbol of life, recurs as an image throughout her poems.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nIdeas, concepts and theories\nimage noun\n(PICTURE)\nB2 [ C ] any picture, especially one formed by a mirror or a lens: television images of starving children The image you see in the mirror. Synonyms\nillustration (PICTURE)\npicture (IMAGE)\nMore examplesFewer examplesTelevision confronts the viewer with a succession of glittering and seductive images.Their pilots are guided by an infrared optical system that shows images clearly even at night.You can use the device to scan the image and reproduce it on-screen in an electronic format.One of the film's many unsettling images is of a child playing with her father's gun.Can you improve the sharpness of the image at all?\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nIdiom\nbe the (living/spitting) image of someone\nimage noun [C]\n(IDEA)\nAdd to word list\nAdd to word list\nan idea, esp. a mental picture, of what something or someone is like: I had an image of Texas in my head that was totally different from how it really is.\nSomeone’s image is the idea that other people have of that person, esp. an idea created by advertising and by newspaper and television stories: He’s trying to project a more presidential image.\nAn image is also a description of something or someone: The book presented an image of life on a farm in the 19th century.\nimage noun [C]\n(PICTURE)\na picture, esp. one seen in a mirror or through a camera: moving images on a TV screen\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; MARKETING the reputation that a person, organization, product, etc. has, including the characteristics, appearance, etc. that they are known for: create/project/build an image The logo change is part of an ongoing effort to project a new image that will attract younger customers.change/improve/protect sb's image Developers discussed how the impoverished town could improve its image and boost its redevelopment potential. tarnish/hurt/destroy sb's image Staff upheavals and clashes with European regulators have tarnished the image of the world's top soft-drinks business. good/positive/strong image When working in sales, it is important that you present a positive image. a bad/poor/negative imagesb's public/private/professional image These events give delegates the chance to network and improve their professional image. People's choice of product is often more influenced by image than by quality.\n[ C ] a picture or photograph, especially one shown on a computer or television screen: You can rotate the image, resize it, zoom in, zoom out, or adjust its color. The new scanner delivers exceptional image quality and reliability. a computer/digital/photographic image black and white/greyscale/color image See also\nbrand image\ncorporate image"}