{"id":187887,"name":"imagination","type":"noun","us_sound":"ɪˌmædʒ.əˈneɪ.ʃən","us_link":"../audio/i/imagination.mp3","uk_sound":"ɪˌmædʒ.ɪˈneɪ.ʃən","uk_link":"../audio/i/ukillus012.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] the ability to form pictures in the mind: vivid imagination My younger son has a very vivid (= active) imagination. I can never make up stories - I have absolutely no imagination.capture/catch the imagination of For some reason the story captured/caught the imagination of the public (= made them very interested).by any stretch of the imagination It couldn't by any stretch of the imagination be described as a (= it is certainly not a) beautiful city.leave nothing to the imagination There's a sex scene in the film which apparently leaves nothing to the imagination (= shows sexual parts of the body very clearly).\nThesaurus: synonyms, antonyms, and examples\nimaginationimaginationYou’ve always had a very vivid imagination.creativityThe aim of the award is to encourage creativity and innovation.visionHe was a man of great vision.inventivenessHis domestic designs display an unending inventiveness and account for his best work.ingenuityThis housewife's ingenuity led to the creation of a number of great new household products.originalityHer photographic portraits can hardly be accused of lacking originality.\nSee more results »\n[ U ] something that you think exists or is true, although in fact it is not real or true: Was she paying him a lot of attention or was it just my imagination? Is it my imagination or is David behaving strangely at the moment?\nB1 [ U ] the ability to think of new ideas: It's a job that needs someone with a bit of imagination.\nMore examplesFewer examplesWas it just my imagination or did I hear John's voice in the other room?He's one of those people with a very vivid imagination - every time he hears a noise he's convinced it's someone breaking in.The American drive to land a man on the Moon captured the imagination of the whole world.Her imagination was kindled by the exciting stories her grandmother told her.One of poetry's functions is to somehow unlock the imagination.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nmanifesting\nreach\nrevisualization\nriot\nrun riot idiom\ntheorize\nthink of something\nthrow\nvision\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDreaming\nAdd to word list\nAdd to word list\nthe ability to form mental pictures of people or things, or to have new ideas: Rafael has a very active imagination (= has many ideas)."}