{"id":187896,"name":"imagined","type":"verb","us_sound":"ɪˈmædʒ.ɪn","us_link":"../audio/i/imagine.mp3","uk_sound":"ɪˈmædʒ.ɪn","uk_link":"../audio/i/ukillus015.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nimagine\nB1 to form or have a mental picture or idea of something: Imagine Robert Redford when he was young - that's what John looks like. [ + (that) ] Imagine (that) you're eating ice cream - try to feel how cold it is. [ + question word ] Can you imagine how it feels to be blind? [ + -ing verb ] She imagined herself sitting in her favourite chair back home. They hadn't imagined (= expected) (that) it would be so difficult. I can't imagine (= I really don't know) what he wants from us.\nThesaurus: synonyms, antonyms, and examples\nto imagine somethingimagineYou can just imagine her storing up these anecdotes for her dinner parties.think ofI want you to think of a time when you felt happy.pictureCan you picture yourself at the age of 60 doing what you do now?pictureWhen I say 'your car' you have a picture of that in your head.in your mind's eyeIn my mind's eye, I'm still a uni student and not a middle-aged worker.conceiveI can't conceive why anyone would want to hurt her.\nSee more results »\nB2 to believe that something is probably true: [ + (that) ] I imagine (that) he's under a lot of pressure at the moment. I don't imagine (that) they have much money. \"Will they change it?\" \"I imagine so.\"\nB1 to think that something exists or is true, although in fact it is not real or true: \"Did you hear a noise?\" \"No, you're imagining things/No, you must have imagined it.\" I've never heard her criticize you - I think you imagine it.\nused to express shock or surprise, often at someone else's behaviour: She got married at 16! Imagine that! [ + -ing verb ] Imagine spending all that money on a coat! you can't imagine\nused to emphasize a statement: You can't imagine what a mess the house was in after the party.\nMore examplesFewer examplesSpending Christmas with him and his brother - I can't imagine anything worse!Try to imagine what life must have been like for Neolithic man 10 000 years ago.\"Did you hear a noise?\" \"No, you're imagining things.\"You can't imagine what it would be like to have your child die - it's quite unthinkable.He has the most awful taste so you can probably imagine what his house looks like.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuessing, supposing and suspecting\nExpressions of surprise\nLinguistics: very & extreme"}