{"id":188200,"name":"immediate","type":"adjective","us_sound":"ɪˈmiː.di.ət","us_link":"../audio/i/immediate.mp3","uk_sound":"ɪˈmiː.di.ət","uk_link":"../audio/i/ukimmac009.mp3","content":"Add to word list\nAdd to word list\nB2 happening or done without delay: We must make an immediate response. Dioxin is a poison that takes immediate effect.\nC1 used to refer to something or someone that is close to, or is a cause of or an effect of, something or someone else: There are few facilities in the immediate area.immediate result/effect An immediate result/effect of the war was a breakdown of law and order.\nB2 in the present or as soon as possible: We have no immediate plans. The public has demanded his immediate resignation.\ncoming just before or just after someone or something: Her leadership style is completely different from that of her immediate predecessor. Inspectors reported several malfunctions at the power plant in the immediate aftermath of the earthquake.\nclosely related to you, for example as a parent, child, husband, or wife: Employees are allowed time off to care for members of their immediate family. He lived with friends as he had no immediate family in the country. When samples cannot be found, immediate relatives give their own DNA samples. the immediate future\nthe period of time that is coming next: We need serious plans to reduce carbon emissions in the immediate future.\nSee more\nMore examplesFewer examplesShe felt an immediate physical attraction to him.Please excuse me from the rest of the meeting - I've just received a phone call that requires my immediate attention.We demand the immediate and unconditional release of all political prisoners.The president called for an immediate ceasefire and a resumption of negotiations between the two sides.The customer has only to bring the goods in to any branch and an immediate, no-questions-asked refund or replacement will be provided.\nSMART Vocabulary: related words and phrases\nImmediately\n(right) off the bat idiom\na stitch in time (saves nine) idiom\nado\nat/in one fell swoop idiom\nbat\ncuff\ndeferrable\ndirectly\nfell\nglance\ninstantaneous\ninstantaneously\ninstantly\nno sooner said than done idiom\nnon-deferrable\nsoon\nstraight\nswiftly\nswiftness\nwaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nNow\nBefore, after and already\nFamily: relations in general\nimmediate adjective\n(NO DELAY)\nAdd to word list\nAdd to word list\nhappening or done without delay or very soon after something else: She made an immediate impact when she arrived to coach the team. Emotional outbursts followed in the immediate aftermath of Stewart’s death.\nimmediate adjective\n(NEAREST)\nnearest in space or relationship: There are three schools in the immediate area. immediate family\nYour immediate family includes your closest family members, such as your parents, children, husband or wife, and brothers and sisters."}