{"id":188201,"name":"immediately","type":"adverb","us_sound":"ɪˈmiː.di.ət.li","us_link":"../audio/i/immediately.mp3","uk_sound":"ɪˈmiː.di.ət.li","uk_link":"../audio/i/ukimmac010.mp3","content":"Add to word list\nAdd to word list\nA2 now or without waiting or thinking: We really ought to leave immediately. The purpose of the meeting wasn't immediately obvious.\nThesaurus: synonyms, antonyms, and examples\nwithout delay or waitingimmediatelyPlease report to the office immediately.nowI need you to get me that report now. right nowYou put that back right now.right awayIf you're going to call the doctor, you'd better do it right away - the office is closing in two minutes.straight awayI called them back straight away.\nSee more results »\nC1 close to something or someone in distance or time: immediately after Milton Street is on the left, immediately after the bank. They moved in immediately before Christmas. We heard a loud crash from the room immediately above us.\nclosely or directly: The people most immediately affected by the drought are the farmers themselves.\nSMART Vocabulary: related words and phrases\nImmediately\n(right) off the bat idiom\na stitch in time (saves nine) idiom\nado\nat/in one fell swoop idiom\nbat\ncuff\ndeferrable\ndirectly\nfell\nglance\ninstantaneous\ninstantaneously\ninstantly\nno sooner said than done idiom\nnon-deferrable\nsoon\nstraight\nswiftly\nswiftness\nwaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCloseness in distance and time\nas soon as: Immediately she'd gone, the boys started to mess about. I'll call you immediately I hear anything.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\nlast\nlater\nmidstream\nmidway\nmoment\noccasion\none\nposterior\nthe last minute idiom\ntime\nunder the wire idiom\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing when something happened or will happen\nimmediately adverb\n(NOW)\nAdd to word list\nAdd to word list\nnow or without waiting or thinking: The plane began to turn to the left almost immediately after takeoff.\nimmediately adverb\n(CLOSE)\nclose to something or someone: Turn left, and the bathroom is immediately on the right."}