{"id":188275,"name":"immigration","type":"noun","us_sound":"ˌɪm.əˈɡreɪ.ʃən","us_link":"../audio/i/eus75794.mp3","uk_sound":"ˌɪm.ɪˈɡreɪ.ʃən","uk_link":"../audio/i/ukimmac021.mp3","content":"Add to word list\nAdd to word list\nB2 the act of someone coming to live in a different country: immigration (into) There are strict limits on immigration (into the country). Compare\nemigration\nmigration ( TRAVELLING/MOVING)\nB1 the process of examining your passport and other documents to make certain that you can be allowed to enter the country, or the place where this is done: immigration (control) After you've been through immigration (control), you can go and get your luggage. immigration policy immigration officers\nMore examplesFewer examplesThe prime minister denied that the new visa requirements were part of a hidden agenda to reduce immigration.The prime minister has adopted an inflexible position on immigration.What is your party's policy on immigration?A new immigration law means the US will be dusting off the welcome mat for famous people who want to live in the country.She took her case to an immigration appeals tribunal.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\n(furniture) remover phrase\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndiaspora\ngreener pastures idiom\nimmigrant\nmigrant\nmigrate\nmigration\nmover\npasture\nrelocation\nremoval\nremovalist\nremover\nresettle\nsettle\nstake\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies the process by which people come in to a foreign country to live there, or the number of people coming in: Immigration increased by 25% last year.\nAdd to word list\nAdd to word list\nthe process of coming to a country in order to live in it permanently: Current immigration levels are driving the U.S. population to double this century. immigration law/lawyer/attorney An immigration lawyer can help guide you through the immigration process. Compare\nemigration\n(also immigration control) the process of having your passport and other documents officially checked to make certain that you are allowed to enter the country, or the place where this is done: In the United Arab Emirates, identity cards can be used to go through passport control at entry and exit points so that passengers can pass more smoothly through immigration. See also\nnet immigration"}