{"id":188412,"name":"immune","type":"adjective","us_sound":"ɪˈmjuːn","us_link":"../audio/i/immune.mp3","uk_sound":"ɪˈmjuːn","uk_link":"../audio/i/ukimmod011.mp3","content":"Add to word list\nAdd to word list\nprotected against a particular disease by particular substances in the blood: immune to Most people who've had chickenpox once are immune to it for the rest of their lives. He seems to be immune to colds - he just never gets them.\nC2 [ after verb ] not affected or upset by a particular type of behaviour or emotion: immune (to) The press had criticized her so often that in the end she had become immune (to it).\n[ after verb ] not able to be punished or damaged by something: immune from Journalists, he insisted, must be immune (= protected) from prosecution.\nMore examplesFewer examplesThe president claimed he was immune from prosecution.She was immune to my charms.The mice seemed to be immune to the effects of the drug.She's an experienced politician, but she's not immune to criticism.I'm not immune to suggestions, but they must be reasonable.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunosuppressed\ninoculation\nlymph\nunvaccinated\nvaccinate\nvaccinated\nvaccination\nvax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot showing or feeling emotions\nSafe and secure\nAdd to word list\nAdd to word list\nbiology protected against a particular disease or illness by particular substances in the blood: The vaccine would make infants immune to bacteria that can cause middle ear infections.\nImmune also means protected from or unable to be influenced by something, esp. something bad: She says her mother is immune to criticism from strangers. immunization noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪm·jə·nəˈzeɪ·ʃən/\nimmunization against polio"}