{"id":188652,"name":"impatient","type":"adjective","us_sound":"ɪmˈpeɪ.ʃənt","us_link":"../audio/i/impatient.mp3","uk_sound":"ɪmˈpeɪ.ʃənt","uk_link":"../audio/i/ukimpar012.mp3","content":"Add to word list\nAdd to word list\nB2 easily annoyed by someone's mistakes or because you have to wait: impatient with He's a good teacher, but inclined to be a bit impatient with slow learners. You'd be hopeless taking care of children - you're far too impatient!\nThesaurus: synonyms, antonyms, and examples\ngetting angry easilybad-temperedHe's so bad-tempered! He never should have become a teacher.irritableBe careful what you say; he's very irritable today.grumpyI'm just a little tired and grumpy today.crankyUS She's very cranky because she has a toothache.impatientI'm too impatient for fishing.\nSee more results »\nB2 wanting something to happen as soon as possible: impatient to He's got a lot of exciting ideas and he's impatient to get started.impatient for People are increasingly impatient for change in this country.\nMore examplesFewer examplesRon's trouble is that he's too impatient.He's very impatient and always interrupts me mid-sentence.He was trying to explain but she became impatient and sent him away .She used to be very impatient, but she's mellowed over time.She can be a bit impatient with the slow learners.\nSMART Vocabulary: related words and phrases\nBad-tempered\nargumentative\nbad-tempered\nbe hell on wheels idiom\nbe like a bear with a sore head idiom\nbe spoiling for a fight idiom\ngrouchiness\ngrouchy\ngrumpily\ngrumpiness\ngrumpy\npettishly\npetulance\npetulancy\npetulant\npetulantly\nstroppy\nsurlily\nsurliness\ntestily\ntestiness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWanting things\nRelated word\nimpatiently\nAdd to word list\nAdd to word list\nnot willing to wait for something to happen and becoming annoyed at delays: Don’t be impatient, you’ll get your turn. She grew impatient with the others.\nImpatient can also mean eager for something to happen: [ + to infinitive ] He was impatient to become the new boss. impatience noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪmˈpeɪ·ʃəns/\nThe horse snorted with impatience. impatiently adverb us\nYour browser doesn't support HTML5 audio\n/ɪmˈpeɪ·ʃənt·li/\nUnable to sleep, he waited impatiently for the dawn to arrive."}