{"id":188500,"name":"impact","type":"noun","us_sound":"ˈɪm.pækt","us_link":"../audio/i/impact.mp3","uk_sound":"ˈɪm.pækt","uk_link":"../audio/i/ukimmod023.mp3","content":"Add to word list\nAdd to word list\nC2 the force or action of one object hitting another: The impact of the crash reduced the car to a third of its original length.on impact The bullet explodes on impact (= when it hits another object).\nB2 a powerful effect that something, especially something new, has on a situation or person: have/make an impact on The anti-smoking campaign had had/made quite an impact on young people.soften the impact The new proposals were intended to soften the impact of the reformed tax system.\nMore examplesFewer examplesThe increase in the number of young people leaving to work in the cities has had a dramatic impact on the demography of the villages.This decision will have a disastrous impact on foreign policy.The report concluded that business pressure on the government had muffled the impact of the legislation.The tax on fuel will not have a serious impact on the better-off.The book discusses the impact of Christian thinking on western society.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOutcomes and consequences\nC1 to have an influence on something: impact (on) Falling export rates have impacted (on) the country's economy quite considerably.\nThesaurus: synonyms, antonyms, and examples\nto have power to cause a change in someone or somethingaffectLow-income women were disproportionately affected by the legislation. influenceThe jury could have been influenced by all the media coverage surrounding the case.be/fall under someone's influence/spellThe young queen seemed to fall under the spell of her counsellor, believing everything he told her.be under someone's spellWe warned her about him, but all he had to do was turn on the charm and she was under his spell.guideHe is guided by the core beliefs of his religion.impactSevere storms will impact on travel across the region tonight.\nSee more results »\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nimpact noun [U]\n(FORCE)\nAdd to word list\nAdd to word list\nthe force with which one thing hits another or with which two things hit each other: The impact of the crash destroyed the car. The bullet explodes on impact (= at the moment when it hits something).\nimpact noun [U]\n(EFFECT)\nthe strong effect or influence that something has on a situation or person: These charges will have a damaging impact on the army’s reputation. The environmental impact of this project will be enormous.\nimpact\n(HAVE EFFECT)\nto have a strong effect or influence on a situation or person: [ I/T ] A big decline in exports will impact (on) the country’s economy.\nAdd to word list\nAdd to word list\na powerful effect that something, especially something new, has on someone or something: a big/huge impact Social networks are making a huge impact on sales, with fans recommending brands to hundreds of their friends. We judge that these developments will have little impact on our business.have an impact on/upon sb/sth Microenterprises can have a negative or positive impact on the environment. See also\nenvironmental impact\nto have an influence on something: Local businesses were heavily impacted by the new zoning regulations.impact on sth Engineers say the new engine could impact on the way future cars are designed."}