{"id":189082,"name":"implication","type":"noun","us_sound":"ˌɪm.pləˈkeɪ.ʃən","us_link":"../audio/i/implication.mp3","uk_sound":"ˌɪm.plɪˈkeɪ.ʃən","uk_link":"../audio/i/ukimpet023.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] an occasion when you seem to suggest something without saying it directly: [ + that ] From what she said, the implication was that they were splitting up.by implication She accused the party and, by implication, its leader too. Synonyms\nhint (INDIRECT STATEMENT)\nimputation formal\nindication (SIGN)\ninnuendo\ninsinuation\nintimation formal\nsuggestion\nC1 [ C usually plural ] the effect that an action or decision will have on something else in the future: implication for The company is cutting back its spending and I wonder what the implications will be for our department.implication of What are the implications of the new law?\nC2 [ U ] an occasion when you suggest or show that someone is involved in a crime: The case depended upon his implication of his co-workers in the fraud.\nMore examplesFewer examplesBecause of security implications the officers were tried in secret.What are the implications of his report?The implication of her claim is that the Minister lied to Parliament.The incident has serious security implications.It's not yet clear what the implications of the new legislation will be for small businesses.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nproposition\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOutcomes and consequences\nBlaming & accusing\nAdd to word list\nAdd to word list\n[ C/U ] a suggestion of something that is made without saying it directly: [ U ] The implication was that the workers and management had already reached an agreement. [ C ] What are the implications (= possible effects) of the new regulations?"}