{"id":189051,"name":"implement","type":"verb","us_sound":"ˈɪm.plə.ment","us_link":"../audio/i/eus72341.mp3","uk_sound":"ˈɪm.plɪ.ment","uk_link":"../audio/i/ukimpet019.mp3","content":"Add to word list\nAdd to word list\nB2 to start using a plan or system: The changes to the national health system will be implemented next year.\nMore examplesFewer examplesThe determination of policy is not your business - your job is to implement it.Local councils will be given some leeway as to how they implement the legislation.He has been vested with the power/authority to implement whatever changes he sees fit.Consultants found the experience frustrating - their reports were only partly implemented, or, worse still, just pigeonholed.The country had been slow to implement the new European directive.\nSMART Vocabulary: related words and phrases\nCausing things to happen\n-induced\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nRelated word\nimplementation\na tool that works by being moved by hand or by being pulled across a surface: garden/household/agricultural implements Shopkeepers are not supposed to sell knives and other sharp implements to children.\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\nfan\ngadget\ngrabber\nhardware\npower tool\nprecision instrument\nratchet\nspacer\nspreader\nstuffer\ntoolkit\nutensil\nutility belt\nSee more results »\nAdd to word list\nAdd to word list\nto put a plan or system into operation: Congress refused to pass the bill that would implement tax reforms. implementation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪm·plə·mənˈteɪ·ʃən, -menˈteɪ-/\nThey've involved their workers in the development and implementation of the new program.\na tool or other piece of equipment for doing work: farm implements\nAdd to word list\nAdd to word list\nto put a plan into action: to implement a plan/policy/measure The corporation has implemented a new compensation plan for its sales force. to implement a change/program/recommendation\nIT to begin to use a new system: The purchased package or the new IT infrastructure is implemented by specialists in that technology."}