{"id":189069,"name":"imply","type":"verb","us_sound":"ɪmˈplaɪ","us_link":"../audio/i/imply.mp3","uk_sound":"ɪmˈplaɪ","uk_link":"../audio/i/ukimplo002.mp3","content":"Add to word list\nAdd to word list\nC2 to communicate an idea or feeling without saying it directly: [ + (that) ] Are you implying (that) I'm fat? I'm not implying anything about your cooking, but could we eat out tonight?imply criticism I detected an implied criticism of the way he was treated. as something implies\nC2 used to show that the name, explanation, etc. of something tells you something else about it: Variable rate loans, as the name implies, have a variable interest rate.\nSee more\nC2 formal to involve something or make it necessary: Socialism implies equality.\nMore examplesFewer examplesThe report, which is viewed as a bellwether for economic trends, implied that the national economy could be slowing down.Her statement implies a lack of confidence in the management of the company.What are you implying?A connection between the events has been implied in several news reports.The relationship implied a high degree of trust between the two parties.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEssential or necessary\nGrammar\nImply or infer?We imply something by what we say. We infer something from what somebody else says. The main difference between these two words is that a speaker can imply, but a listener can only infer. …\nAdd to word list\nAdd to word list\nto suggest something without saying it directly, or to involve something as a necessary part or condition: [ + (that) clause ] He implied (that) the error was mine. Democracy implies free elections."}