{"id":189089,"name":"implicit","type":"adjective","us_sound":"ɪmˈplɪs.ɪt","us_link":"../audio/i/implicit.mp3","uk_sound":"ɪmˈplɪs.ɪt","uk_link":"../audio/i/ukimpet024.mp3","content":"implicit adjective\n(NOT DIRECT)\nAdd to word list\nAdd to word list\nC2 suggested but not communicated directly: implicit criticism He interpreted her comments as an implicit criticism of the government.implicit in Implicit in the poem's closing lines are the poet's own religious doubts.\nfelt by someone or influencing them without them being aware of it: The experiment was designed to measure implicit racial bias. Egalitarian intentions are not enough to protect against the effect of implicit attitudes. Compare\nexplicit\nMore examplesFewer examplesThe assumption implicit in this complaint is that if police departments had more money, they would be able to cut crime. This was seen by investors as an implicit guarantee of support.There are cultural values that drive our behaviour in an implicit, subliminal, unconscious way.\nSMART Vocabulary: related words and phrases\nDigressing and being indirect or evasive\nbury the lede idiom\ncandy coat\ncandy coating\ncandy-coated\ncircumlocution\ncircumlocutory\nequivocate\nglancingly\ngloss over something\ngo off on a tangent idiom\nhedge\nhedging\nimplicitly\nmealy-mouthed\nobfuscate\nobscure\nparry\nprevaricate\nstray\nveil\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnaware\nimplicit adjective\n(COMPLETE)\ncomplete and without any doubts: implicit faith All her life she had implicit faith in socialism.implicit trust We had implicit trust in him.implicit obedience She is accustomed to implicit obedience from her staff.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nRelated word\nimplicitly\nimplicit adjective\n(SUGGESTED)\nAdd to word list\nAdd to word list\nsuggested but not communicated directly: We interpreted his silence as implicit agreement. Some reporters thought there was an implicit threat in the president’s speech.\nimplicit adjective\n(COMPLETE)\n[ not gradable ] (esp. of trust and belief) complete and without any doubts: implicit faith"}