{"id":189204,"name":"impose","type":"verb","us_sound":"ɪmˈpoʊz","us_link":"../audio/i/impose.mp3","uk_sound":"ɪmˈpəʊz","uk_link":"../audio/i/ukimplo017.mp3","content":"impose verb\n(FORCE)\nAdd to word list\nAdd to word list\nC1 [ T ] to officially force a rule, tax, punishment, etc. to be obeyed or received: be imposed on Very high taxes have recently been imposed on cigarettes. Judges are imposing increasingly heavy fines for minor driving offences.impose something on something The council has imposed a ban on alcohol in the city parks.\nC1 [ T ] to force someone to accept something, especially a belief or way of living: impose something on someone I don't want them to impose their religious beliefs on my children. We must impose some kind of order on the way this office is run.\nMore examplesFewer examplesHe wants the government to impose strict controls on dog ownership.In view of the quantity of drugs involved, 16 years was the most lenient sentence the judge could impose.The government has failed to impose its will upon regional communities.Central government has imposed a cap on local tax increases.Some people like the sense of structure that a military lifestyle imposes.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\njolt\nrailroad\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nreimpose\nslap\nsqueeze\nSee more results »\nimpose verb\n(EXPECT)\n[ I ] to expect someone to do something for you or spend time with you when they do not want to or when it is not convenient for them: Are you sure it's all right for me to come tonight? I don't want to impose.impose on She's always imposing on people - asking favours and getting everyone to do things for her.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\ninflict\npick on someone\nprey\nprey on something\nput someone through something\nput upon\ntyranny\nuncared for\nuse\nvictimization\nvictimize\nSee more results »\nimpose verb\n(MAKE RULES)\nAdd to word list\nAdd to word list\n[ T ] to establish something as a rule to be obeyed, or to force the acceptance of something: Settlers often imposed their culture on the peoples of the countries they conquered.\nimpose verb\n(INCONVENIENCE)\n[ I ] to cause inconvenience to someone or to try to spend time with them when they do not want you to: She’s always imposing on people for favors. I hope I’m not imposing by staying another night.\nAdd to word list\nAdd to word list\nto introduce a new law, tax, rule, or punishment: impose a ban/restriction/penalty on sb/sth They are calling for the regulatory body to impose a ban on television ads aimed at the under-12s. to impose a fine/tariff/tax"}