{"id":189170,"name":"important","type":"adjective","us_sound":"ɪmˈpɔːr.tənt","us_link":"../audio/i/important.mp3","uk_sound":"ɪmˈpɔː.tənt","uk_link":"../audio/i/ukimplo011.mp3","content":"Add to word list\nAdd to word list\nA1 necessary or of great value: important to I think his career is more important to him than I am. It's important for children to learn to get on with each other.the important thing The important thing is to keep the heat low or the sugar will burn. He's not amazingly handsome, but he's nice and that's more important. Opposite\nunimportant\nB1 having great effect or influence: He was one of the most important writers of that period. an important person/decision\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nMore examplesFewer examplesI've lost a file containing a lot of important documents.It's important for children to get a good education.He always leaves important decisions to his wife.I have to be in London on Friday for an important meeting.Fresh fruit and vegetables form an important part of a healthy diet.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nlife-altering\nlife-and-death\nlife-changing\nmainly\nmajor league\noverriding\nprime\nprincipally\nprior\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\nRelated word\nimportantly\nAdd to word list\nAdd to word list\nof great value, meaning, or effect: an important discovery [ + that clause ] It’s important that you tell the doctor all your symptoms.\nImportant also means having great influence: an important modern artist importance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪmˈpɔr·təns/\nHe stressed the importance of fruits and vegetables in the diet. importantly adverb us\nYour browser doesn't support HTML5 audio\n/ɪmˈpɔr·tənt·li/\nShe has a pleasant personality, but more importantly, she is well qualified for the job."}