{"id":189163,"name":"import","type":"verb","us_sound":"ɪmˈpɔːrt","us_link":"../audio/i/import_01_00.mp3","uk_sound":"ɪmˈpɔːt","uk_link":"../audio/i/ukimplo009.mp3","content":"Add to word list\nAdd to word list\nB2 to buy or bring in products from another country: import something from somewhere We import a large number of cars from Japan. Compare\nexport verb\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\nto introduce new goods, customs, or ideas to one country from another: (be) imported from Jazz is an American modification of musical conventions imported from Europe. the spelling of imported words\ncomputing\n&#160; specialized to copy information from one computer or computer program to another: I need to import data from the database into this spreadsheet. imported files\nMore examplesFewer examplesIn some countries, importing drugs is a capital offence.The business imports rugs from India.The fruit had been imported from Spain.The country is importing energy from foreign suppliers.How do I import these files onto the hard disk?\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nsplurge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTransferring and transporting objects\nOperating computers\nRelated word\nimportation\nimport noun\n(BRINGING IN)\nC1 [ C ] goods bought by one country from another: restrictions on foreign imports\nC2 [ U ] (also importation) the action of bringing goods or fashions into a country: the illegal importation of drugs an import licence import duties\nMore examplesFewer examplesFurther increases in imports could destabilize the economy.They have put an embargo on imports of clothing.Continued rapid growth in consumer spending will suck in more imports.The programme aims to make the country self-sufficient in food production and to cut energy imports.The tobacco industry loses millions every year due to parallel imports.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nsplurge\nSee more results »\nimport noun\n(IMPORTANCE)\n[ U ] formal importance or meaning: little/no import Whether it is to be a \"working\" visit or an \"official\" visit is of little/no import.\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nweight\nworth\nSee more results »\nimport verb [T]\n(BRING IN)\nAdd to word list\nAdd to word list\nto bring in products, goods, etc. from another country for sale or use: We import a large number of cars from Japan.\nTo import information into a program or computer is to copy it from another program or form of storage. importation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪm·pɔrˈteɪ·ʃən, -poʊr-/\nHe opposed efforts to allow the importation of prescription drugs from other countries.\nimport noun\n(IMPORTANCE)\n[ U ] fml the importance given to something: It is still too early to judge the political import of his speech.\nimport noun\n(PRODUCT)\n[ C ] something bought and taken into a country from another: Imports of foreign cars are at an all-time high.\nAdd to word list\nAdd to word list\n[ C, usually plural ] a product that is made in one country and brought into another, especially in order to sell it: Oil is our most important import by far. cheap/expensive/imports\n[ C or U ] the activity or business of bringing goods into a country from another country: The authorities imposed a ban on imports of hormone-treated beef. Trade (the sum of exports and imports) was equivalent to 44% of GDP. The officials were accused of evading tariffs on the import of cars and other luxury goods.\nimports [ plural ]\nthe quantity of goods brought into one country from another during a particular period of time, or the value of these goods: US imports of vehicles from Japan rose to $2.23 billion in March. growth/increase/decline in imports See also\ndirect import\nparallel import\nvisible importsCompare\nexport verb\n[ I or T ]\n&#160; COMMERCE to bring a product into a country from another country, especially in order to sell it: In some large chains, more than 80% of all produce is imported. For four consecutive quarters, the country has exported more than it has imported.import sth from/into sth We can undercut British showroom prices by up to 30% by importing cars from cheaper European markets. Some of the Chinese cars being imported into European countries use electrical components from Germany. Machinery products must comply with the safety regulations of the importing countries.\n[ T ] to introduce new goods, customs, or ideas to one country from another: The Brazilian-owned steel company has become one of the two biggest employers in town, importing a new management style and fresh capital to the area.\n[ T ]\n&#160; IT to copy information from one computer or computer program to another: The images can be imported directly into the page layout. Compare\nexport verb\nimportable adjective\n20 industrial fabrics were moved on to the list of freely importable goods in 2005."}