{"id":189224,"name":"impossible","type":"adjective","us_sound":"ɪmˈpɑː.sə.bəl","us_link":"../audio/i/impossible.mp3","uk_sound":"ɪmˈpɒs.ə.bəl","uk_link":"../audio/i/ukimplo021.mp3","content":"Add to word list\nAdd to word list\nB1 If an action or event is impossible, it cannot happen or be achieved: impossible to It was impossible to sleep because of the noise.impossible that It seems impossible that I could have walked by without noticing her. He made it impossible for me to say no. She ate three plates of spaghetti and a dessert? That's impossible. I don't believe it!\nThesaurus: synonyms, antonyms, and examples\nnot able to be achievedimpossibleThere's no way we'll be able to get the paperwork done in time – it's impossible. unachievableThere is no point in setting unachievable goals for yourself.unattainableThese bodybuilders are chasing an unattainable ideal – they'll never be as muscular as they want.unfeasibleIt would be unfeasible to try to ban all petrol vehicles at the moment.infeasibleThe company has promised a fully self-driving car in a year, but engineers say it is technically infeasible.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nnot able to happen, exist, or be trueimpossibleYou can't be at my party and at work at the same time – it's impossible!be out of the questionGoing on holiday under these circumstances is out of the question.no wayThere is absolutely no way your mother will allow that.inconceivableIt's inconceivable that the president didn't know about the military attack.unthinkableA wide-scale nuclear attack is unthinkable.\nSee more results »\nC2 An impossible situation is extremely difficult to deal with or solve: It's an impossible situation - she's got to leave him but she can't bear losing her children.\nC2 An impossible person behaves very badly or is extremely difficult to deal with: I had to leave the job because my boss was impossible. My niece is impossible when she's tired - you can't do anything to please her.\nMore examplesFewer examplesIt's broken into so many pieces, it'll be impossible to put it back together again .The signature was smudged and impossible to read.The ground was frozen hard and was impossible to dig.Finding somewhere cheap to live in the city centre is an impossible task.No one could have climbed that wall - it's physically impossible.\nSMART Vocabulary: related words and phrases\nUnachievable\nbe (a) no go idiom\nbe on a hiding to nothing idiom\nbe out of your league idiom\ncat\nchase\nghost\ngoodbye\nimpossibility\nimpracticable\nimpracticably\nin/out of the running idiom\ninfeasible\nleague\nsilk\nunattainable\nunfeasible\nunfeasibly\nunicorn\nunrealizable\nunscalable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImpossible and improbable\nComplicated and difficult to do\nBad and wrong behaviour\nRelated word\nimpossibility\nthe impossible\nsomething that cannot be expected to happen or exist: ask the impossible She wants a man who is attractive and funny as well, which is asking the impossible in my opinion.\nSMART Vocabulary: related words and phrases\nImpossible and improbable\napt\naptness\nbe out of the question idiom\nbe pissing in the wind idiom\nbeggar\ndoubt\nfat chance idiom\nflimsily\nflimsiness\ngoodbye\ngoodbye to something idiom\nimpenetrably\nnail\nnailing jelly to the wall idiom\nnohow\nnot have a snowball's chance in hell idiom\none in a million idiom\npig\nsnowball\nunicorn\nSee more results »\nimpossible adjective\n(NOT POSSIBLE)\nAdd to word list\nAdd to word list\n[ not gradable ] unable to exist, happen, or be achieved; not possible: an impossible goal [ + to infinitive ] It’s almost impossible to get them to agree on anything.\nimpossible adjective\n(VERY DIFFICULT)\nvery difficult to deal with: Traffic at rush hour is just impossible."}