{"id":189454,"name":"improperly","type":"adverb","us_sound":"ɪmˈprɑː.pɚ.li","us_link":"../audio/i/improperly.mp3","uk_sound":"ɪmˈprɒp.ə.li","uk_link":"../audio/i/ukimpra028.mp3","content":"improperly adverb\n(NOT ALLOWED)\nAdd to word list\nAdd to word list\nin a way that is dishonest or against a law or a rule: Authorities say the two men had improperly obtained driving licences. According to the prosecutor, he had improperly shared classified information.\nMore examplesFewer examplesThe legislators had acted improperly by making the law retroactive.He said that he has never acted improperly during committee meetings. He had improperly tried to influence another person's vote.There are two to four complaints a year about instructors behaving improperly and getting too close to students.\nSMART Vocabulary: related words and phrases\nDishonest\nartificiality\nbad faith\nbe rotten to the core idiom\nbent\ncowboy\ndubiously\nfalse\nfinagle\nfishy\nfly-by-night\nmendacious\nmendaciously\nmisleading\nmisleadingly\nperjured\nunder false pretences phrase\nunderhand\nunreliability\nunreliable\nunscrupulous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLegal & illegal\nimproperly adverb\n(INCORRECT)\nin a way that is unsuitable or not correct for a particular use or occasion: Carrying a backpack improperly can lead to a serious sprain. Botulism is a form of food poisoning that occurs after eating improperly canned foods.\nMore examplesFewer examplesContent for the newsletter frequently comes through improperly formatted.We didn’t realize until we arrived that it was a formal event and we were improperly dressed.The virus may cause websites to display improperly.\nSMART Vocabulary: related words and phrases\nUnsuitable and unacceptable\namiss\nbe in bad, poor, the worst possible, etc. taste idiom\nbeneath your dignity idiom\nbeyond\nbeyond the pale idiom\nincorrectly\nindecent\nineligibility\nineligible\ninfelicitous\nraffish\nraffishly\nraffishness\nroom\nsilly\nunsuitably\nunsuited\nunsupportable\nunwarrantable\nunwarrantably\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWrong"}