{"id":189361,"name":"impression","type":"noun","us_sound":"ɪmˈpreʃ.ən","us_link":"../audio/i/impression.mp3","uk_sound":"ɪmˈpreʃ.ən","uk_link":"../audio/i/ukimpra011.mp3","content":"impression noun\n(OPINION)\nAdd to word list\nAdd to word list\nB2 [ C ] an idea or opinion of what something or someone is like: impression of I didn't get much of an impression of the place because it was dark when we drove through it. What was your impression of Charlotte's husband?first impression I don't tend to trust first impressions (= the opinion you form when you meet someone or see something for the first time). [ + that ] When I first met him I got/had the impression that he was a shy sort of person. be under the impression\nB2 to think that something is true, especially when it is not: I was under the impression (that) you didn't get on too well.\nSee more\nMore examplesFewer examplesYou'll get a false impression of the town if you only visit the university.My general impression of the place was good.His helpfulness today has made me revise my original impression of him.You don't want to convey the impression that we're not interested.I was under the erroneous impression that they were married.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\ntick\nSee more results »\nimpression noun\n(EFFECT)\nB2 [ S ] the way that something seems, looks, or feels to a particular person: make/give/create an impression It makes/gives/creates a very bad impression if you're late for an interview. [ + (that) ] He likes to give the impression (that) he's terribly popular and has lots of friends.\nMore examplesFewer examplesIt's important to create a good impression when you meet a new client.She made a very favourable impression on us.In his 20 years working for the company, Joe Pearson made an indelible impression on it.Did any of your teachers make a lasting impression on you?Paul is Mister Big in our department, so it's important to make a good impression on him.\nSMART Vocabulary: related words and phrases\nSeeming and purporting to be\napparent\nappear\nappearance\nas if/though idiom\nby the look(s) of things idiom\ncome across\ncome off\nformal\noutwardly\noutwardness\nparallax\npass\npass for sb/sth\npersona\nsemblance\nsuperficial\nsuperficiality\nsuperficially\nsupposably\nsurface\nSee more results »\nimpression noun\n(COPY)\n[ C ] an attempt at copying another person's manner and speech, etc., especially in order to make people laugh: do an impression of She does a really good impression of the president.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nimpression noun\n(MARK)\n[ C ] a mark made on the surface of something by pressing an object onto it: There were impressions around her ankles made by the tops of her socks.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\nescape hatch\ngouge\nhollow\nimprint\ninterstice\nladder\nleak\nleaky\nnook\nnooks and crannies idiom\npiercing\npinprick\nshaft\nvoid\nSee more results »\nimpression noun\n(BOOKS)\n[ C usually singular ] UK (US printing) all the copies of a book that have been printed at the same time without any changes being made: This is the second impression of the encyclopedia.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimprint\nindent\nindentation\ninline\nintaglio printing\nprint run\nprint something out\nprinted\nprinting\nprinting press\nrubber stamp\ntypography\nunpublished\nxerography\nSee more results »\nimpression noun\n(VIEW)\n[ C ]\n&#160; internet &amp; telecoms\n&#160; specialized an occasion when someone visits or sees a particular page on the internet: page impression The company pointed to a 15 per cent rise in page impressions on its website.\nMore examplesFewer examplesA typical cost for a targetted banner ad is around £25 per thousand page impressions, so if you want your ad seen 200,000 times, you'll pay £5,000. The number of users leapt to nearly 1m, and page impressions are running at more than 90m a month.I will concede that my criticism may generate more impressions for the ad.A website that uses Cost Per Clicks would bill by the number of times a visitor clicks on a banner instead of by the number of impressions.\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninterweb\nIP\nkeyboard warrior\nlanding page\nleet\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nIdiom\nmake an impression on someone\nimpression noun\n(OPINION)\nAdd to word list\nAdd to word list\n[ C ] an idea or opinion of what someone or something is like: It makes a bad impression if you’re late for an interview. [ + that clause ] I get the impression that she’s rather shy. [ + that clause ] I was under the impression that you didn’t like your job (= I was wrong to think that you did not like your job).\nimpression noun\n(EFFECT)\n[ U ] effect or influence on the way someone feels or thinks: All our warnings made little impression on him.\nimpression noun\n(MARK)\n[ C ] a mark made on the surface of something by pressing an object into it: The bookcase had left an impression in the rug.\nAdd to word list\nAdd to word list\nMARKETING, E-COMMERCE\n&#160; (also ad view) a single time that an internet advertisement is seen by a user: They market a company's product for a fixed rate per 1,000 impressions. See also\ncost per impression\npage view\nPRODUCTION all the copies of a book that have been printed at the same time without any changes being made: This is the second impression of the encyclopedia."}