{"id":189606,"name":"in","type":"preposition","us_sound":"ɪn","us_link":"../audio/i/in.mp3","uk_sound":"ɪn","uk_link":"../audio/i/ukimpro019.mp3","content":"in preposition\n(INSIDE)\nAdd to word list\nAdd to word list\nA1 inside a container, place, or area, or surrounded or closed off by something: Is Mark still in bed? I got stuck in a traffic jam for half an hour. They live in a charming old house. How much is that coat on display in the window (= in the space behind the window of the shop)? I've got a pain in my back. What's that in your hand? I've got something in (= on the surface of) my eye. They used to live in Paris, but now they're somewhere in Austria. He's always looking at himself in the mirror (= at the image of his face produced by the mirror). I never know what's going on in her head (= what she's thinking about). My daughter's in hospital (US in the hospital) having her tonsils out.US Is Erika still in school (= does she still go to school)?\nMore examplesFewer examplesI go to the cheapest hairdresser's in town.\"I can't find my keys.\" \"Have another check in your jacket pockets.\"He is one of the top chefs in Britain.She sat in the dentist's waiting room, nervously chewing at her nails.The chlorine in the pool makes my eyes sore.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin preposition\n(INTO)\ninto something: Come on, we're late - get in the car. Put the milk back in the fridge when you've finished with it. They threw him in the swimming pool.\nSMART Vocabulary: related words and phrases\nInserting and forcing things into other things\nbed\ncram\ndig\ndig (something) into someone/something\nembed\nembedded\ngouging\ninset\ninterlace\ninterpolation\ninterposition\nintersperse\nlodge\nreinsertion\nrethread\nshoehorn\nsquash\nstick\nstuck\nwedge\nSee more results »\nin preposition\n(PART)\nA2 forming a part of something: He used to be the lead singer in a rock band. There are too many spelling mistakes in this essay. I've been waiting in this queue for ages. What do you look for in a relationship? I can see a future champion in Joely (= I think that Joely might become a champion). Talent like hers is rare in someone so young.\nMore examplesFewer examplesHe sings in the church choir.After years of chasing her dreams, she finally got a part in a film.Centre all the headings in this document.The camera work in some of these animal documentaries is fantastic.There's some wonderful calligraphy in these old manuscripts.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin preposition\n(DURING)\nA1 during part or all of a period of time: We're going to Italy in April. Some trees lose their leaves in (the) autumn. I started working here in 2009. Life in the 19th century was very different from what it is now. Bye, see you in the morning (= tomorrow morning). She was a brilliant gymnast in her youth (= when she was young). How many civilians died in the Vietnam War? This is the first cigarette I've had in three years. I haven't had a decent night's sleep in years/ages (= for a long time). in between\nbetween the two times mentioned: I have breakfast at 7.30, lunch at 1.00, and sometimes a snack in between.\nSee more\nMore examplesFewer examplesThe bathroom gets chilly in the winter.I was told off for talking in class.I don't think we should expand our business in the current economic climate.Our costs have climbed rapidly in the last few years.Spain was admitted to the European Community in 1986.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\nspace\ntime signature\ntimestamp\nup\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn & at\nin preposition\n(NO MORE THAN)\nA2 needing or using no more time than a particular amount of time: Can you finish the job in two weeks? She could get that essay done in a couple of hours if she really tried. They completed the journey in record time (= faster than ever done before).\nMore examplesFewer examplesI can run a mile in 5 minutes.There's no way I can type up this whole report in one morning!He explained the whole system in about 30 seconds - he doesn't waste words, does he?I didn't think they would get all the bedrooms redecorated in just one day.My letter arrived in two days, Mum said.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\nday\nfar\nhitherto\ninside\ninterim\nmeantime\nnow\npending\nthus\ntill\ntime\nto\nto date idiom\nuntil\nup to (doing) something idiom\nwait\nyet\nSee more results »\nin preposition\n(BEFORE THE END)\nA2 before or at the end of a particular period: Dinner will be ready in ten minutes. We'll all be dead in a hundred years so there's no point worrying about it. I'm just setting off, so I should be with you in half an hour.\nMore examplesFewer examplesWe've got two clear weeks to finish the decorating.Jim's car has clocked (up) 40 000 miles in less than two years.Anyone who's late for work three times in one week gets a written warning from the boss.He managed to pay off his debts in two years.I'll be seeing Pat in a few days/in a few days' time.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuturistically\ngonna\nhereon\nin for something idiom\nin the course of time phrase\nposterity\npresently\nrun\nshortly\nsomeday\nsometime\nspace\nyet\nSee more results »\nin preposition\n(EXPERIENCING)\nB1 experiencing a situation or condition, or feeling an emotion: We watched in horror as they pulled the bodies from the wreckage. He's living in luxury in the south of France. She left in a bit of a hurry. You're in great danger. Could I have a word with you in private? Have you ever been in love? Your car's in very good condition, considering how old it is.\nMore examplesFewer examplesThey were desperately in love to begin with, but I think it's starting to cool off now.He drove so fast that I really felt my life was in danger.Although I support the project in public, my private opinion is that it will fail.They clung together in terror as the screams grew louder.She watched in amazement as the fireworks exploded.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\nin preposition\n(EXPRESSED)\nB1 expressed or written in a particular way: Cheques should be written in ink. She usually paints in watercolour. They spoke in Russian the whole time. He always talks in a whisper.\nMore examplesFewer examplesThe document is written in plain English.All the lectures were in French.Please write your name in block capitals.He made his views known in no uncertain terms.The leaflet is available in a variety of languages.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin preposition\n(RESULT)\nB2 used when referring to something that is done as a result of something else: in return/exchange I'd like to do something for you in return/exchange for everything you've done for me.in response The changes are in response to demand from our customers.in reply He refused to say anything in reply to the journalists' questions.\nMore examplesFewer examplesIt is illegal for public officials to solicit gifts or money in exchange for favours.I'd like to do something for you in exchange for everything you've done for me.Management have granted a 10% pay rise in response to union pressure.The changes are in response to demand from our customers.In reply to their questions, she just shrugged.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\ncorollary\nend result\nfallout\nfirst fruit\nfruit\nimplication\nironically\nrepercussion\nresultant\nresultantly\nresulting\nreverberation\nsequel\nside effect\néclat\nSee more results »\nin preposition\n(ARRANGEMENT)\nB1 used to show how things or people are arranged or divided: We all sat down in a circle. The desks were arranged in rows of ten. Discounts are available to people travelling in large groups. Sometimes customers buy books in twos and threes, but rarely in larger quantities than that. Cut the potatoes in two. People are dying in their thousands from cold and starvation.\nMore examplesFewer examplesKim's birthday cake was in the shape of a train.Luckily, help arrived in the shape of a police officer.The events came in quick succession.Most of Manhattan is laid out in a grid pattern with avenues going north-south and streets east-west.The replies came back in ones and twos.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin preposition\n(AGE/TEMPERATURE)\nused when referring approximately to someone's age or the weather temperature: in your twenties/thirties/etc. Nowadays many women are in their late thirties when they have their first child.in the twenties/thirties/etc. Temperatures will be in the mid-twenties (= about 25 degrees).\nMore examplesFewer examplesHe's probably in his late twenties.The temperature is expected to be in the twenties tomorrow.Her career only began to pick up when she was in her forties.My dad's in his fifties.She was well into her 90s when she died.\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximate\napproximately\naround\nexact\nguess\ninexactly\nish\nloosely\nloosey-goosey\nmore\nround\nrule\nsense\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nin preposition\n(INVOLVED)\nB1 involved or connected with a particular subject or activity: I never knew you were in publishing. a degree in philosophy advances in medical science\nMore examplesFewer examplesShe's hoping to get a job in advertising.The troops receive training in a number of different types of warfare.She has a degree in French from Manchester University.Changes in atmospheric pressure are producing these strange weather conditions.There has been a lot of research done in that particular field.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\ncatch\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nre-engagement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncluding and containing\nin preposition\n(WEARING)\nB1 wearing: Do you recognize that man in the grey suit? Pat can't resist men in uniform. You look nice in green (= green clothes).\nMore examplesFewer examplesYou look strange in that outfit.You'll be too hot in that jacket.The children were dressed in identical uniforms.You are expected to arrive in the appropriate attire.The photograph showed local people in national costume.\nSMART Vocabulary: related words and phrases\nWearing clothes\nattired\ncaped\nclad\nclothe\nclothed\nFrench tuck\ngarbed\ngrow\ngrow into someone/something\nhave (got) something on\nhoodie\nnine\nshop your closet idiom\nstylish\nstylishly\nsuit\nthing\ntog\ntracksuited\nwear\nSee more results »\nin preposition\n(COMPARING AMOUNTS)\nused to compare one part of an amount of something with the total amount of it: Apparently one in ten people/one person in ten has problems with reading.UK The basic rate of income tax is 25 pence in (US on) the pound.\nMore examplesFewer examplesOne in five products was found to be defective.The gradient of the hill increases to one in ten.Only one in every 50 shoppers questioned had heard of the new proposals.The project only has a one in 20 chance of success.The chances of that happening must be one in a million!\nSMART Vocabulary: related words and phrases\nFractions\ncomplex fraction\ncompound fraction\ndeci-\ndecimal place\ndenominator\neighteenth\neighth\nfifth\nfiftieth\nfortieth\nfraction\nmillionth\nmixed fraction\nproper fraction\nquartile\nseventh\nsixteenth\nsixth\nsixtieth\nthirtieth\nSee more results »\nin preposition\n(CHARACTERISTIC)\nused to show which characteristic or part of a person or thing is being described: The new version is worse in every respect - I much preferred the original. Are the two bags equal in weight? She's deaf in her left ear.\nMore examplesFewer examplesIn some ways, I preferred the old version.In terms of value for money, it's a good deal.The two teams are evenly matched in ability.The bag was green in colour.What's the difference in cost between the two cars?\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrappings\nunaffiliated\nundercurrent\nvibe\nvibe check\nSee more results »\nin preposition\n(CAUSE)\n[ + -ing verb ] used to show when doing one thing is the cause of another thing happening: In refusing (= because she refused) to work abroad, she missed an excellent job opportunity.in doing so The government banned tobacco advertising and, in doing so (= because of this), contributed greatly to the nation's health. in that formal\nbecause: This research is important in that it confirms the link between aggression and alcohol.\nSee more\nMore examplesFewer examplesIn helping others, I'm indirectly helping myself.Man introduced the grey squirrel to these parts and in doing so effectively wiped out the red squirrel.In stepping up your exercise, you are also stepping up your calorie requirement.In a sense you are helping her but in doing so, you are also preventing her from helping herself.In attracting insects to your garden, you are also attracting birds.\nSMART Vocabulary: related words and phrases\nCausing things to happen\n-induced\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nGrammar\nAt, on and in (place)We use at: …\nIn, intoIn and into are prepositions. …\nIn, into: position and directionWe use in to talk about where something is in relation to a larger area around it: …\nInto: enthusiasm, interestWe use be into to express enthusiasm or strong interest for something: …\nChange into, turn intoWe use into after verbs describing change: …\nIn: phrasal verbsWe use in to make a number of phrasal verbs: …\nAt, in and to (movement)We use to when we are talking about movement in the direction of a point, place, or position: …\nAt, on and in (time)We use at: …\nOther uses of in with timeWe use in to say how long it takes someone to do something: …\nTime expressions without at, on, inWe don’t normally use at, on or in before time expressions beginning with each, every, next, last, some, this, that, one, any, all: …\nAt, on and in (time): typical errorsWe use on not at to talk about a particular day: …\nIdioms\nbe nothing/not much/very little in it\nin all\nin all honesty/seriousness/truthfulness\nin adverb\n(FROM OUTSIDE)\nA2 from outside, or towards the centre: Could you bring the clothes in for me? The roof of their house caved in during a hurricane. Cut the pastry into a square and turn in the corners. be in and out of somewhere informal\nto often be staying in a particular place especially to receive treatment or for legal reasons: She's been in and out of hospitals ever since the accident.\nSee more\nMore examplesFewer examplesPush the clutch in, put the car into gear, rev the engine and then gently let the clutch out.The goalkeeper was caught napping and the ball went straight in.We went in by the front door.Suddenly the door burst open and police officers carrying guns rushed in.You have to take the needle and push it right in.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin adverb\n(AT PLACE)\nB1 at home or at work: When did you get home? I never heard you come in. Mr Ellis isn't in this week.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmakerspace\nMecca\nmulti-location\nmulti-site\nnatal\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nWorld Heritage Site\nSee more results »\nin adverb\n(INSIDE)\nwithin an object, area, or substance: We've been shut in all day.UK Has the soup got any salt in?\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nin adverb\n(TRANSPORT)\nB2 having arrived at the place where people can get on or off: What time is Roz's flight due in?\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ninterloper\nintrude\nintrusion\ninvade\nirrupt\njump\nland\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nturn out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoarding and alighting from modes of transport\nin adverb\n(GIVEN)\nB2 given or sent to someone official in order to be read: When does your essay have to be in? Remember to get your application in by the end of the week.\nMore examplesFewer examplesThe report has to be in by the end of the week.It's important that you get your application in on time.You should get your insurance claim in as soon as possible.All essays must be in by Friday 14 March.When does your tax return have to be in?\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nin adverb\n(COAST)\ntowards the coast, beach, or harbour: The tide comes in very quickly here and you can soon find yourself stranded. We stood watching the ship come in.\nMore examplesFewer examplesWe'll have to wait until the tide comes in.Be careful not to get trapped when the tide come in.Is the tide coming in or going out?If the tide comes in, we'll be stranded on these rocks.The tug towed the damaged ship back in.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\non\noncoming\nonward\nonwards\nround\nthither\nto\ntowards\nup\nward\nwise\nSee more results »\nin adverb\n(COMPLETION)\nused to refer to an activity that makes something complete: pencil something in Just pencil in the answer unless you're sure it's correct. The text is finished, but the pictures will have to be pasted in later.fill something in UK Would you mind filling in a questionnaire about what you watch on television?\nMore examplesFewer examplesYou can claim back the overpaid tax by filling in this form.I got on with the business of filling in the form.The children had to colour in the pictures.Fill in the gaps with the correct answer.Have you filled in the application form for your passport yet?\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nin adverb\n(SPORT)\nIf the ball is in during a game of tennis or a similar sport, it has not gone outside the edges of the area on which the game is played: I won that point, I'm telling you! The ball was definitely in!\ntaking your turn to play, especially taking your turn to hit the ball: Who's in next for our team? It started to rain just as our team was going in to bat.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin-house\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninteriority\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nWinning, losing & scoring in sport\nGrammar\nIn, intoIn and into are prepositions. …\nIn, into: position and directionWe use in to talk about where something is in relation to a larger area around it: …\nInto: enthusiasm, interestWe use be into to express enthusiasm or strong interest for something: …\nChange into, turn intoWe use into after verbs describing change: …\nIn: phrasal verbsWe use in to make a number of phrasal verbs: …\nIdioms\nbe/get in with someone\nin for something\nin on something\nbe well in there\nfashionable or popular: High heels are in this season. The new jazz club seems to be the in place to go at the moment.\nThesaurus: synonyms, antonyms, and examples\nfashionablefashionableShe's so fashionable.in fashionTighter trousers for men are back in fashion.inShort jackets are in this season.coolHe was wearing a pair of cool sunglasses.hipWe went to the hip new club in town.trendyHe likes trendy clothes and modern furniture.\nSee more results »\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\nshabby chic\nsleekly\nsleekness\nsmartly\nsmartness\nthe avant-garde\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nup-to-the-minute idiom\nà la mode\nSee more results »\nwritten abbreviation for\ninch\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nfooter\nft\nkilometre\nkm\nmetre\nmicrometre\nmicron\nmile\nmm\nmpg\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nused to add the meaning \"not\", \"lacking\", or \"the opposite of\" to adjectives and to words formed from adjectives: incomplete/incompletely illegal/illegally impossible/impossibly irregular/irregularly Compare\ndis-\nnon-\nun-\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndis\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nno way idiom\nnot that idiom\nslight\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nwouldn't dream of something/doing something idiom\nyes\nSee more results »\nabbreviation for intranasal: through the nose: IN drug delivery offers advantages such as ease of administration and rapid onset of action.\nSMART Vocabulary: related words and phrases\nThe nose\naquiline\nconk\nhook-nosed\nhooked\nnasalis\nnasalization\nnasi\nnaso-\nng\nnostril\npug nose\nrhino\nrhinoplasty\nRoman nose\nschnozz\nschnozzle\nsnoot\nsnout\nsnub nose\nsnub-nosed\nSee more results »\nwritten abbreviation for the US state of Indiana: used in addresses\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEnglish Canadian\nEssex\nfife\nfl.\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\nused to form a noun which describes an activity in which many people take part: a sit-in/phone-in\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\ncontraction\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\nmultisyllabic\nsuffix\nsynthetic\nthat'd\nthat'll\nthat's\nthere'd\nSee more results »\nin preposition, adverb [not gradable]\n(WITHIN)\nAdd to word list\nAdd to word list\npositioned inside or within the limits of something, or contained, surrounded, or enclosed by something: There’s a cup in the cabinet. Anne is still in bed. Don’t stand in the driveway. He’s always looking at himself in the mirror. Clarice lives in Orlando. He was in prison (= a prisoner). Erika is still in school (= still a student). He has a pain in his shoulder. in and out\nIf you are in and out of a place, you go there and leave, often repeatedly: Since the accident, she’s been in and out of the hospital several times.\nin preposition, adverb [not gradable]\n(INCLUSION)\nbeing a member or forming a part of something: Who’s the woman in that painting? Mr. Harper is in a meeting. I’ve been waiting in line for two hours. Do you take milk in your coffee?\nin preposition, adverb [not gradable]\n(SITUATION)\nexperiencing a situation, condition, or feeling: We watched in horror as the cars crashed. I’d like to talk to you in private. He left in a hurry. Have you ever been in love? He’s always in a bad mood on Monday mornings. Temperatures tomorrow will be in the 70s (= between 70 and 79 degrees).\nIdioms\nin for something\nin on something\nin preposition\n(moving toward)\ninto or toward: Get in the car. She stepped in the batter’s box. He looked in my direction.\nin preposition\n(connected with)\ninvolved or connected with something, esp. with a job or subject: I never knew you were in publishing. I’m taking a course in economics next semester.\nin preposition\n(WEARING)\nwearing, covering, or decorated with: Do you recognize that man in the gray suit? The living room is done in blue and green.\nin preposition\n(USING)\nsaid, made, or done using something: Fill out the application in ink. They spoke in Russian the whole time.\nin preposition\n(DURING)\nduring part or all of a period of time or an event: We’re going to Arizona in April. What was it like to be a student in 1968? See you in the morning. How many people died in the war? She’s in her forties (= between 40 and 49 years old).\nIn can also mean no longer than a particular period of time: Can you finish the job in two weeks?\nIn can also mean at the end of a particular period of time: I should be there in half an hour.\nin preposition\n(ARRANGEMENT)\nused to show how something is arranged or divided: We sat in a circle around the campfire. The potatoes will bake faster if you cut them in half.\nin preposition\n(comparing amounts)\nused to compare a part of an amount of something with the total amount of it; out of: The survey found that one person in ten has a reading problem. The chance of that happening is one in a million.\nin preposition\n(CHARACTERISTIC)\nused to show which characteristic of a person or thing is being described: She’s deaf in her left ear. Canned vegetables are not very rich in vitamins. I wasn’t using the word \"guarantee\" in its strict legal sense.\nin preposition\n(CAUSE)\nused to show that doing one thing is the cause of another thing happening: I leaned out of the canoe and in doing so tipped it over. It might be made of plastic, in which case it will be light enough to carry.\nin adverb\n(from outside)\n[ not gradable ] from outside, or toward the center: Could you bring the clothes in for me? The roof of their house caved in during a hurricane.\nin adverb\n(at place)\nat a place, esp. at home or a place of work: Why is it that whenever I call, you are never in? Danielle was out sick last week – do you know if she’ll be in today?\nin adverb\n(PLACE)\n[ not gradable ] used to show that a space or place exists where something can be put or added: Just pencil in your answers on the attached sheet. The text is finished, but the pictures need to be pasted in.\n[ not gradable ] For many sports, if a ball is in, it has not gone outside the edges of the area on which the game is played.\nin adverb\n(POLITICS)\ninto an elected position or office: She’s been voted in for a second term as treasurer.\nin adjective, adverb\n(FASHIONABLE)\nfashionable or popular: That new jazz club is the in place to go. High heels came in again this season.\nin noun [C]\n(ADVANTAGE)\nan advantage resulting from a good relationship with someone powerful: Sal has an in with someone at the theater.\nabbreviation for inch\nused to add the meaning not, lacking, or the opposite of to adjectives and to words formed from adjectives: incomplete/incompletely\nAdd to word list\nAdd to word list\nwritten abbreviation for inch"}