{"id":189648,"name":"inactive","type":"adjective","us_sound":"ɪnˈæk.tɪv","us_link":"../audio/i/inactive.mp3","uk_sound":"ɪnˈæk.tɪv","uk_link":"../audio/i/ukimpro028.mp3","content":"Add to word list\nAdd to word list\ndoing nothing: It's bad for your health to be physically inactive. The property market remains largely inactive. Opposite\nactive (BUSY)Compare\nmotionless\nThesaurus: synonyms, antonyms, and examples\nnot active or workinginactiveIf you haven’t voted in the last two elections, we consider you inactive and remove you from the electoral roll.dormantThe plants will stay dormant throughout the winter.latentMany people in the region have latent tuberculosis.quiescentThe extremist group was politically quiescent but very socially active.moribundThe family business is now moribund.\nSee more results »\nSMART Vocabulary: related words and phrases\nPassive and not working\nanywhere\nbreather\nbreathing space\nbum\nbum around\ndormancy\nidle\nleave someone be idiom\nlie around\nmoribund\nnavel\nnon-physical\nnon-practising\npassive\nrecharge\nsit round\nslob\nslob around (something)\nslop around (something)\nstew\nSee more results »\nRelated word\ninactivity\nAdd to word list\nAdd to word list\ndoing nothing: Knee surgery will keep him physically inactive for two months. About half of the club members are inactive. inactivity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪn·ækˈtɪv·ɪ·t̬i/\nThe journey was long, and he found the inactivity boring.\nAdd to word list\nAdd to word list\ndoing nothing or not doing what you have usually done: an inactive member of an advisory board Voters who have not participated in an election in three years are considered inactive. People are classed as economically inactive if they are not seeking work or not available to work.\nSTOCK MARKET not buying or selling very much: Many Tokyo investors were inactive ahead of Friday's special quotation.\nnot operating or being used: The company is inactive rather than insolvent. an inactive company/entity an inactive quarry/oil rig"}