{"id":189849,"name":"inaugurate","type":"verb","us_sound":"ɪˈnɑː.ɡjə.reɪt","us_link":"../audio/i/inaugurate.mp3","uk_sound":"ɪˈnɔː.ɡjə.reɪt","uk_link":"../audio/i/ukinaug002.mp3","content":"Add to word list\nAdd to word list\nto put someone into an official position with a ceremony: American presidents are always inaugurated on 20 January .\nto put something into use or action officially: The European Community inaugurated the Single European Market in 1993.\nto mark the beginning of a new period, style, or activity: The change of government inaugurated a new era of economic prosperity.\nSMART Vocabulary: related words and phrases\nCeremonies\nanti-ritualism\ncavalcade\nceremonial\nceremonially\nceremony\nguard of honour\nhara-kiri\ninitiation ceremony\ninstallation\ninvestiture\nknight\nmaster of ceremonies\nmemorial service\npageant\nrequiem\nribbon cutting\nrite of passage\nritual\nritualistic\ntroop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nStarting and beginning\nRelated word\ninauguration\nAdd to word list\nAdd to word list\nto put something into use or action, or to put a person into an official position with a ceremony: He wants to inaugurate his museum with elaborate opening ceremonies. The nation prepares to inaugurate its new president. inaugural adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪˈnɔɡ·jər·əl/\nWhat was the theme of her inaugural address? inauguration noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ɪˌnɔɡ·jəˈreɪ·ʃən/\n[ C ] She’s a journalist who has covered six presidential inaugurations.\nAdd to word list\nAdd to word list\nto put something such as a service, system, etc. into action officially: On Monday, the company inaugurated a $20 million plant that will triple their output of road-paving material known as bitumen. to inaugurate a campaign/programme/scheme\nto put someone into an official position with a ceremony: American presidents are always inaugurated in January."}