{"id":189946,"name":"incandescence","type":"noun","us_sound":"ˌɪn.kænˈdes.əns","us_link":"../audio/i/eus72363.mp3","uk_sound":"ˌɪn.kænˈdes.əns","uk_link":"../audio/i/ukinaug014.mp3","content":"incandescence noun [U]\n(LIGHT)\nAdd to word list\nAdd to word list\nthe act of producing a bright light from a heated part: Meteors and comets entering the earth's atmosphere compress the air and heat it to incandescence. The association seeks to reduce light pollution, the incandescence caused by outdoor night lighting.\nliterary the state of being extremely bright: Floodlighted, the white marble gleamed with a snowy incandescence. Glass cases of memorabilia glowed with an otherworldly incandescence.\nMore examplesFewer examplesThe animals hunt at night when steam plumes from power plants streak the sky with phosphorous incandescence. Quicklime burns with peculiar incandescence. Waves of incandescence sprayed across the night sky.\nSMART Vocabulary: related words and phrases\nLight\nbeam\nbrilliance\ncandlelight\ncoruscation\nfirelight\nfluorescence\nhelio-\nillumination\nincident light\nincident ray\ninfrared\nlamplight\nmonochromatic\nphosphorescence\nphoto\nshininess\nstarlight\nsunlight\nsunshine\ntorchlight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of light\nincandescence noun [U]\n(QUALITY)\na very extreme emotion, especially anger or happiness: The interview revealed the incandescence of his anger over the war. His joyous incandescence brightened everyone around him.\nthe fact of being extremely good, special, or skilled: She lacks the starry incandescence other actors brought to the role. The box office is the ultimate measure of a superstar's incandescence. See\nincandescent\nMore examplesFewer examplesShe was a phenomenon of impossible incandescence. He met Ginsberg and formed the core of the Beats, whose incandescence lit up the skies. Her performance is pure, kinetic incandescence.The incandescence of his characters was a reflection of his own internal fire.\nSMART Vocabulary: related words and phrases\nExceptional qualities, things and people\na gift from the gods idiom\nbe a one idiom\ncharacter\ncuriosity\ndistinction\ndistinctiveness\nexoticism\nfavoured\ngift\nhave-a-go hero\nindividual\nnational treasure\nnonpareil\npersonal touch\nrare breed\nright\nthe chosen few idiom\nthe right stuff idiom\nthe X factor\nuniqueness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong feelings\nExtremely good"}