{"id":190071,"name":"incentive","type":"noun","us_sound":"ɪnˈsen.t̬ɪv","us_link":"../audio/i/eus72367.mp3","uk_sound":"ɪnˈsen.tɪv","uk_link":"../audio/i/ukincen002.mp3","content":"Add to word list\nAdd to word list\nC2 something that encourages a person to do something: tax incentive Tax incentives have been very effective in encouraging people to save and invest more of their income. [ + to infinitive ] There is little incentive for people to leave their cars at home when public transport remains so expensive.incentive to Bonus payments provide an incentive to work harder. Compare\nmotivation (REASON)Opposite\ndisincentive\nMore examplesFewer examplesIndexation of pay rises to productivity will give people an incentive to work harder.The incentive to sell more is large - and it plainly works.The management have introduced a productivity incentive scheme for members of staff.Tax incentives have been offered to attract industry to the region.The new law provides incentives for businesses to invest in recycling equipment.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\njump out at someone\nlure\ntantalizingly\ntempt\ntemptation\ntemptingly\ntickle someone's fancy idiom\nSee more results »\nAdd to word list\nAdd to word list\nsomething that encourages a person to do something: [ C ] Tax incentives are sometimes effective in encouraging people to save money. [ U ] These kids have no incentive to learn.\nAdd to word list\nAdd to word list\nsomething, especially money, that encourages a person or organization to do something: financial/fiscal/monetary incentive Cash grants were part of the financial incentives given to developers of new solar power technology. a big/great/generous incentive incentive to do sth Executives had a strong incentive to destroy papers they knew would incriminate them in court.be/have little/no incentive There will be little incentive to consolidate before new tax laws take effect. incentive for sb to do sth There's no incentive for the unions to make concessions now, since they've always been given what they asked for. incentive package/plan/system create/offer/provide an incentive See also\ndisincentive\neconomic incentive\ngroup incentive\nsales incentive\nshare incentive plan\ntax incentive"}