{"id":190104,"name":"inch","type":"noun","us_sound":"ɪntʃ","us_link":"../audio/i/inch.mp3","uk_sound":"ɪntʃ","uk_link":"../audio/i/ukincen010.mp3","content":"Add to word list\nAdd to word list\nB1 a unit used for measuring length, approximately equal to 2.54 centimetres, sometimes shown by the symbol ″: Twelve inches are equal to one foot. He had a cut an inch long above his left eye. The snow was six inches deep in some places. a piece of wood 2″ by 2″\nMore examplesFewer examplesAs you grow older, your spine shortens by about an inch.She is five foot three inches tall.It says on the packet you should plant the bulbs 4 inches deep.At least an inch of rain fell overnight.Can you remember how to convert centimetres into inches?\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nIdioms\nby inches\ncome within an inch of something\nevery inch\nevery inch of something/somewhere\ninch by inch\nnot give/budge/move an inch\ngive someone an inch and they'll take a mile\nto move very slowly or in a lot of short stages: inch towards We are inching towards an agreement.inch up/higher Share prices inched up/higher during the day.inch closer Residents watched the flames inch closer and closer. Synonym\nedge (MOVE)\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nworm\nSee more results »\ninch noun [C]\n(MEASUREMENT)\nAdd to word list\nAdd to word list\na unit of measurement of length equal to 1/12 foot or 2.54 centimeters\ninch verb [always + adv/prep]\n(MOVE)\nto move very slowly, or in a lot of short stages: [ I ] Stock prices inched higher throughout the afternoon. [ T ] Mike inched the bookcase into position.\nAdd to word list\nAdd to word list\nMEASURES a unit of measure equal to one-twelfth of a foot or 2.54 centimetres: Eighteen inches of snow disrupted deliveries across the Midwest. The tablet computer's screen measures 9.4 inches diagonally. Sheet metal cladding costs more per square inch than reinforced plastic. See also\ncolumn inch\nto move very slowly or in a lot of short stages: inch ahead/along/forward Crates inched along the conveyor belt on their way out of the warehouse. Legislators inched closer to closing a loophole in the law.inch up/upward Stocks slowly inched upward in March."}