{"id":190139,"name":"incidental","type":"adjective","us_sound":"ˌɪn.sɪˈden.t̬əl","us_link":"../audio/i/eus72369.mp3","uk_sound":"ˌɪn.sɪˈden.təl","uk_link":"../audio/i/ukincen014.mp3","content":"Add to word list\nAdd to word list\nless important than the thing something is connected with or part of: Try not to be distracted by incidental details.incidental to The points you make are true, but they're incidental to the main problem.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\nmere\npicture\npiddling\npiddly\npiffling\nplay second fiddle idiom\nunseriousness\nvenial\nvestigial\nvestigially\nwho needs...? idiom\nSee more results »\nAdd to word list\nAdd to word list\nhappening by chance, or in connection with something of greater importance: His influence on younger employees was incidental, not intentional. Will I be reimbursed for incidental expenses at the conference?\nAdd to word list\nAdd to word list\nhappening by chance, or in connection with something else that is more important: it is incidental that It is purely incidental that payroll savings were realized after the consolidation, because more employees chose to quit their jobs rather than follow them to the new headquarters. It is not incidental that the financial industry is one of the last remaining consumers of mainframe computers.incidental to sth Whether one is 25 or 75, age is incidental to how well the job is done.\nACCOUNTING incidental costs are amounts of money, usually small, that someone has to spend while trying to achieve something: incidental costs/expenses\nsomething that is connected, often by chance, to something more important: An incidental like a snowstorm can leave a large hole in your shipping schedule.\n[ usually plural ]\n&#160; ACCOUNTING small amounts of money spent while trying to achieve something: The company's expenses policy limits what people can spend on incidentals."}