{"id":190136,"name":"incidence","type":"noun","us_sound":"ˈɪn.sɪ.dəns","us_link":"../audio/i/incidence.mp3","uk_sound":"ˈɪn.sɪ.dəns","uk_link":"../audio/i/ukincen012.mp3","content":"Add to word list\nAdd to word list\nan event, or the rate at which something happens: There have been quite a few incidences of bullying in the school this year.incidence of an increased incidence of cancer near nuclear power stations\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularly\nlike clockwork idiom\nmany\nmany a time idiom\non-off\nperiodic\nperiodically\nprevalence\nregularity\nreligiously\nunsynchronized\nwould\nSee more results »\nincidence noun\n(RATE)\nAdd to word list\nAdd to word list\n[ U ] us\nYour browser doesn't support HTML5 audio\n/ˈɪn·sə·dəns, -ˌdens/ the rate at which something happens: There’s been an increased incidence of cancer in the area.\nincidence noun\n(SURFACE)\n[ C ] us/ˈɪn·səd·əns, -səˌdens/ the falling or hitting of an object or beam of energy, such as light, on a surface angle of incidence physics\nThe angle of incidence is the angle that a beam of light or other energy hitting a surface makes with a line vertical to that surface.\nAdd to word list\nAdd to word list\nthe rate at which something happens: increase/decrease/reduce the incidence of sth We intend to reduce the incidence of loan defaults by restructuring payments. The incidence of financial fraud among companies having an audit decreased threefold in the last ten years.\nTAX\n&#160; (also incidence of taxation) the financial effect of taxes on people or companies, especially taxes not directly paid by them: High business property taxes added to the tax incidence on consumers by increasing the costs of goods and services. Although mean incomes increased by 3.5% when the incidence of taxation is accounted for it leads to a 2.4% fall in mean income."}