{"id":190268,"name":"include","type":"verb","us_sound":"ɪnˈkluːd","us_link":"../audio/i/include.mp3","uk_sound":"ɪnˈkluːd","uk_link":"../audio/i/ukincle005.mp3","content":"Add to word list\nAdd to word list\nA2 to contain something as a part of something else, or to make something part of something else: The bill includes tax and service.be included in sth Tax and service are included in the bill. [ + -ing verb ] Your responsibilities will include making appointments on my behalf. Compare\nexclude\nMore examplesFewer examplesMozart's musical compositions include symphonies and operas.Symptoms of the illness include a high temperature and a persistent dry cough.This dictionary includes both British and American spellings of words.The museum's collection includes works of art from all around the world.Additional benefits include a company car and free health insurance.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\npepper\nplug\nSee more results »\nRelated word\nincluded\nAdd to word list\nAdd to word list\n(of something) to have something smaller as a part of it, or to make something smaller part of it: The hotel room charge includes breakfast. The encyclopedia includes the names of all Nobel Prize winners. Sheila asked to be included among the people going on the tour. including preposition us\nYour browser doesn't support HTML5 audio\n/ɪnˈklu·dɪŋ/\nThe book has 360 pages, including the index.\nAdd to word list\nAdd to word list\nto contain something as a part of something else, or to make something part of something else: The report includes detailed financial information for the past five years.include sth in/on/with sth Examples included in the showcase did not appear in the final release. Please include a photograph with your application.\nto invite another person or company to be a part of something, such as a job or project: We'll include one client on the board because of his connections to the oil industry.include sb in sth Fourteen manufacturers were included in the primary development of the new aircraft. included adjective [ after noun ] /ɪnˈkluːdɪd/\nAn installation CD is included with the unit. Batteries not included ."}