{"id":190280,"name":"inclusive","type":"adjective","us_sound":"ɪnˈkluː.sɪv","us_link":"../audio/i/usinane030.mp3","uk_sound":"ɪnˈkluː.sɪv","uk_link":"../audio/i/ukincle009.mp3","content":"Add to word list\nAdd to word list\nC1 An inclusive price or amount includes everything: inclusive (of) My rent is $700 a month inclusive (of bills).\n[ after noun ] including the first and last date or number stated: I'll be away from 20 to 31 May inclusive.\nAn inclusive group or organization tries to include many different types of people and treat them all fairly and equally: Our aim is to create a fairer, more inclusive society.\nThesaurus: synonyms, antonyms, and examples\nwilling to consider new or different ideasopen-mindedThe campaign attracts progressive, open-minded people.tolerantThey are very tolerant of different religions in that country.broad-mindedTravel helps you become more broad-minded.receptiveHe was very receptive to the idea.\nSee more results »\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpen-minded\nAdd to word list\nAdd to word list\nincluding everything or all types of people : The governments want to reach a settlement that is as inclusive as possible.\nAdd to word list\nAdd to word list\ncontaining or including a particular thing: inclusive of sth The house and grounds, inclusive of all outbuildings, belong to my client. Although you were given an estimate inclusive of fees, the actual repair could be much higher.\nCOMMERCE an inclusive price includes everything: Two weeks in one of the harbourside studios is £620 per person (inclusive). We can organize the entire wedding for one inclusive price. See also\nall-inclusive\n[ after noun ] UK including the first and last date or number stated: The consultation period runs from December 2011 to April 2012 inclusive. Children from age 13 to 17 inclusive are allowed to participate.\nSOCIAL RESPONSIBILITY including many different types of people, who are treated fairly and equally: Company retreats were socially inclusive, with janitors and board members sharing cabins. We made sure the discussions were fully inclusive by inviting the community to participate."}