{"id":190337,"name":"income","type":"noun","us_sound":"ˈɪn.kʌm","us_link":"../audio/i/income.mp3","uk_sound":"ˈɪŋ.kʌm","uk_link":"../audio/i/ukincle014.mp3","content":"Add to word list\nAdd to word list\nB2 money that is earned from doing work or received from investments: Average incomes have risen by 4.5 percent over the past year.low income More help is needed for people on low incomes. I haven't had much income from my stocks and shares this year.\na company's profit in a particular period of time: The company's income has greatly improved: profit rose more than 50 percent last year.\nMore examplesFewer examplesThe report shows that poor families spend a larger proportion of their income on food.The money I get from teaching evening classes provides a supplement to my main income.It's an organization that offers free legal advice to people on low incomes.St Lucia depends on its clean coastal waters because fishing and tourism provide much of its income.There are severe penalties for failing to declare all your income to the tax authorities.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nAdd to word list\nAdd to word list\nmoney that is earned from doing work or received from investments\nAdd to word list\nAdd to word list\nmoney earned by a person, company, government, etc. over particular period of time: an income of To qualify, you must have an income of $24,000 or less.earn/have/receive (an) income Your hobby could become a part-time way of earning income.generate/provide (an) income Some 40,000 farm families generate income from apple growing.income from/on sth More than 35% of personal revenue came from income on earned interest-bearing accounts. family/household income annual/monthly/quarterly incomeafter-tax/pre-tax/post-tax income We were pleased to see revenues and pre-tax income improve for the second consecutive quarter. a high/low income additional/extra income current/future income a regular/steady income pension/retirement income She received rental income of about £12,000 a year from the property. For many students, summer jobs are their source of income for the upcoming school year. See also\naccrued income\nadjusted gross income\naverage income\ncorporate income tax\ndeferred income\ndiscretionary income\ndisposable income\ndividend income\nearned income\nexpendable income\nView all\nfederal income tax\nfederal taxable income\nfixed-income\ngross income\nhigh-income\nindividual income tax\ninvestment income\nlow-income\nmiddle income country\nmoney income\nnational income\nnegative income tax\nnet income\nnet operating income\noperating income\npersonal income\npersonal income tax\npremium income\nprivate income\npsychic income\nreal income\nresidual income\nsales income\nstate income tax\ntaxable income\ntax-exempt income\ntransfer income\nunearned income\nunreported income"}