{"id":190662,"name":"incorporating","type":"verb","us_sound":"ɪnˈkɔːr.pɚ.eɪt","us_link":"../audio/i/incorporate.mp3","uk_sound":"ɪnˈkɔː.pər.eɪt","uk_link":"../audio/i/ukincor001.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nincorporate\nincorporate verb\n(INCLUDE)\nC2 [ T ] to include something as part of something larger: Suggestions from the survey have been incorporated into/in the final design. This aircraft incorporates several new safety features.\nMore examplesFewer examplesHe has become more venturesome this season with dress designs that incorporate a variety of ethnic influences.The film incorporates elements of fantasy and science fiction.The program incorporates a powerful graphics tool.The act incorporates the European Convention on Human Rights into English law.His later work incorporates elements of popular culture.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nincorporate verb\n(COMPANY)\n[ I or T usually passive ]\n&#160; business, law\n&#160; specialized to legally make a company into a corporation or part of a corporation (= a large company or group of companies that is controlled together as a single organization), or (of a company) to become a corporation: The company was incorporated in 2008 and is privately owned. It was an offshore company incorporated in Nicosia, Cyprus. He set up a jewellery design business and incorporated it five years later. When a company incorporates, the articles of incorporation state how many shares are authorized and can be issued\nMore examplesFewer examplesSome countries have legal provisions allowing key officials from offshore companies incorporated in these countries to remain anonymous.He incorporated his company in the Turks and Caicos Islands to avoid many US laws and taxes. The Act extends to companies registered or incorporated in Northern Ireland.If you own your business and it is not incorporated, your company may contribute additional self-employment income.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\ncitadel\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\nmultinational\npacker\npartner up\npartnership\nplc\nprivate company\nprivate practice\nSee more results »\nRelated word\nincorporation"}