{"id":190393,"name":"incompatibility","type":"noun","us_sound":"ˌɪn.kəmˌpæt̬.əˈbɪl.ə.t̬i","us_link":"../audio/i/eus72375.mp3","uk_sound":"ˌɪn.kəmˌpæt.əˈbɪl.ə.ti","uk_link":"../audio/i/ukincle019.mp3","content":"Add to word list\nAdd to word list\nthe state of not being able to exist or work with another person or thing because of basic differences: An incompatibility problem prevents the two pieces of software from being used together. They stopped dating due to basic incompatibility. See\nincompatible\nMore examplesFewer examplesTechnological incompatibility can render devices like your phone useless overseas.They were agreed on only one thing: their incompatibility. The problem was a basic incompatibility of Canadian and American regulations.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nAdd to word list\nAdd to word list\nthe fact that two things are so different that they cannot both happen, be correct, or be accepted at the same time: incompatibility between sth (and sth) In design, there seems to be an inherent incompatibility between speed and durability.incompatibility with sth A closer look at the plans reveals their complete incompatibility with environmental concerns.\nIT the fact that two pieces of equipment, software, etc. cannot work together: incompatibility with sth The most serious problem is incompatibility with existing drives.incompatibility between sth (and sth) An incompatibility between the two pieces of software prevents them from being used together. Be sure to buy certified products to avoid incompatibilities.\nHR the fact that two people are not able to work well together, or that a person cannot work well within a company: Here are some warning signs of incompatibility that companies look for during interviews.incompatibility between sb (and sb) problems caused by perceived incompatibilities between team members"}