{"id":190663,"name":"incorporation","type":"noun","us_sound":"ɪnˌkɔːr.pəˈreɪ.ʃən","us_link":"../audio/i/usincog027.mp3","uk_sound":"ɪnˌkɔː.pərˈeɪ.ʃən","uk_link":"../audio/i/ukincor002.mp3","content":"incorporation noun\n(INCLUDING)\nAdd to word list\nAdd to word list\n[ U ] the act of including something as part of something larger: incorporation of the regular incorporation of organic material into garden soil The bread dough will rise through the incorporation of air.\nMore examplesFewer examplesThe banks of the rivers have been purchased for incorporation into a city park.The aim of the flexible battery is for incorporation into wearable electronic devices. Except for the final incorporation of the egg yolks, this recipe can be made well ahead of time.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\npepper\nplug\nSee more results »\nincorporation noun\n(COMPANY)\n[ C or U ]\n&#160; business, law\n&#160; specialized the process or fact of legally making a company into a corporation or part of a corporation (= a large company or group of companies that is controlled together as a single organization): The company has been through many changes to its structure since its incorporation. What was the share capital of the company at its incorporation date? New business incorporations have increased substantially this year. See also\narticles of incorporation\nMore examplesFewer examplesHe said that legal paperwork required for incorporation of the business would be filed this month.He filed incorporation papers for the company with the State.The company was incorporated in March, but still isn't listed with the state's Division of Incorporations.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nRelated word\nincorporate\nincorporation noun [U]\n(INCLUDING SOMETHING)\nAdd to word list\nAdd to word list\nthe act of including something within something else\nincorporation noun [U]\n(MAKING A COMPANY)\nthe process of making a business into a corporation (= business protected by specific laws): the incorporation of the family business\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW the act of making a company or organization into a legal corporation (= a particular type of company): a certificate of incorporation of a limited liability partnership The number of incorporations registered in the state this year reached its highest level.\n[ U ] the act of including something within something else: the incorporation of sth into sth The incorporation of biology into industrial processes will become routine."}