{"id":190724,"name":"increase","type":"verb","us_sound":"ɪnˈkriːs","us_link":"../audio/i/increase_01_00.mp3","uk_sound":"ɪnˈkriːs","uk_link":"../audio/i/ukincor012.mp3","content":"Add to word list\nAdd to word list\nB1 to (make something) become larger in amount or size: Incidents of armed robbery have increased over the last few years.increase dramatically/significantly The cost of the project has increased dramatically/significantly since it began.increase something to something Gradually increase the temperature to boiling point. Increased/Increasing efforts are being made to end the dispute. Compare\ndecrease verb\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\nMore examplesFewer examplesWe need to increase public awareness of the disease.Our main aim is to increase sales by 12% this year.Studies show that if a working environment is pleasant, productivity increases.Students do find that their workload increases throughout the course.Life expectancy in Europe has increased greatly in the 20th century.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nB2 a rise in the amount or size of something: price/tax increase Recent price/tax increases are costing the average household £150 a month.increase of There were 39,000 new cases last year - an increase of six percent.increase in Any increase in production would be helpful.\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\non the increase\nC1 increasing: Homelessness is on the increase in many cities.\nSee more\nMore examplesFewer examplesThe tax increase will add 4p to a litre of petrol.I've managed to negotiate a five percent pay increase with my boss.The Opposition has condemned the government's proposed tax increases.Some people blame television for the increase in crime.An increase in average temperature by only a few degrees could cause environmental problems worldwide.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nAdd to word list\nAdd to word list\nto become or make something larger or greater: [ T ] They’ve increased the price of gas by two cents a gallon. [ I ] Pressure is increasing to make health insurance more widely available.\nthe act of becoming larger or greater or of making something larger or greater: [ C ] There was a slight increase in unemployment last month. Homelessness is on the increase (= increasing) in many cities.\nAdd to word list\nAdd to word list\nto become larger in amount or size, or to make something do this: increase by sth Sales have increased by 10%.increase to sth Our gross margin increased to 24%.increase in price/size/value Over the past two years the department has increased in size.the number/rate/level increases Staffing numbers increase during the summer months.increase gradually/slowly/steadily Bookings are increasing steadily. Interest rates have increased slightly. increase dramatically/rapidly/significantly The volume of work has increased dramatically. increase efficiency/production/productivity The new measures are intended to increase efficiency. to increase costs/prices/sales This process greatly increases manufacturing speeds. increasing adjective\nAn increasing number of customers shop online. increasingly adverb\nBorrowers are becoming increasingly aware of their options, and tend to shop around.\na situation in which the number, size, or amount of something gets bigger: a pay/price/tax increase Customers stocked up, anticipating a January price increase.an increase in sth Businesses are facing a 12% increase in energy costs.an increase of sth Revenue last year was $347 million, an increase of 26%. a dramatic/significant/substantial increase a small/slight/steady increase See also\nrise noun\non the increase\nincreasing: Credit card fraud is on the increase."}