{"id":190813,"name":"incubation","type":"noun","us_sound":"ˌɪŋ.kjəˈbeɪ.ʃən","us_link":"../audio/i/usincor007.mp3","uk_sound":"ˌɪŋ.kjəˈbeɪ.ʃən","uk_link":"../audio/i/ukincor026.mp3","content":"incubation noun [U]\n(OF EGG)\nAdd to word list\nAdd to word list\nthe process in which a bird, etc. keeps its eggs warm until the young come out, or the process in which an egg develops until the stage at which the young come out: incubation period The incubation period varies depending on the time of year when the eggs were laid. The chemical makes eggshells so thin and porous that they break during incubation. See\nincubate\nMore examplesFewer examplesWe would remove the eggs for incubation.The sex of the young depends on the temperature during incubation.The buildings have a negative effect on turtle nests because they shield the sand from the sun and increase the incubation time.\nSMART Vocabulary: related words and phrases\nZoology: ornithology & bird-watching\naerie\nbirdsong\nbirdwatcher\nbirdwatching\neggshell\nfeeding station\nflightless\nflyer\nhide\nhover\nincubate\nincubator\nornithological\nornithologist\nornithology\ntwitcher\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal reproduction\nincubation noun [U]\n(OF DISEASE)\nthe process or period of time in which harmful bacteria or viruses increase in size or number in a person's or animal's body but do not yet produce the effects of disease: incubation period In smallpox, there is an incubation period of 8–18 days between initial infection and first symptoms. After about two weeks of incubation, symptoms begin.\nMore examplesFewer examplesThe incubation period for the disease can last for several weeks.The incubation for hepatitis A is 15 to 50 days.There had been no movements of birds off the farm since the incubation of the disease started.\nSMART Vocabulary: related words and phrases\nBacteria, moulds, germs & viruses\nadenovirus\naerobe\namoeba\namoebic\nanti-HIV\nantimicrobial\ngnotobiotic\nGram-negative\nGram-positive\nGram-variable\nhen of the woods\nmicrobe\nMRSA\nprobiotic\nroot rot\nrotavirus\nRSV\nsaprozoic\nshigella\nstrep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassing on illness & causing disease"}