{"id":190863,"name":"incumbent","type":"adjective","us_sound":"ɪnˈkʌm.bənt","us_link":"../audio/i/incumbent.mp3","uk_sound":"ɪnˈkʌm.bənt","uk_link":"../audio/i/ukincum001.mp3","content":"Add to word list\nAdd to word list\n[ before noun ] officially having the named position: The incumbent president faces problems which began many years before he took office.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobless\njoblessness\njobseeker\nlabour-intensive\nlackey\nrecertify\nredundancy\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nbe incumbent on/upon someone formal\nto be necessary for someone: be incumbent on/upon someone to do something She felt it incumbent upon/on her to raise the subject at their meeting.\nSee more\nthe person who has or had a particular official position: the first/last/previous incumbentpresent incumbent (of) The present incumbent (of the post) is due to retire next month.\nSMART Vocabulary: related words and phrases\nEmployees & colleagues\nalum\nalumna\nalumnae\nalumni\nalumnus\ncompatriot\ncontractor\nemployee\ngirl\ngoonda\nhireling\nnominee\nnon-managerial\noffice politics\noffice spouse\noppo\npeon\nworker\nworking man/woman/person\nworkmate\nSee more results »\nincumbent noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\npolitics &amp; government (referring to the present time) a person who has a particular office or position, esp. an elected one: Senator Smith, the incumbent, faces a tough fight for reelection next year.\nincumbent adjective\n(NECESSARY)\nnecessary: [ + to infinitive ] It is incumbent upon (= necessary for) all of us to create a safe community.\nAdd to word list\nAdd to word list\na person or business that holds a particular position in a company, market, industry, etc. at the present time: The incumbent has been awarded the airline's new advertising contract, despite stiff competition from other agencies.\nPOLITICS the person who holds a particular elected position at the present time: Three new mayoral candidates intend to challenge the incumbent.\n[ before noun ] holding a particular position in a company, industry, etc. at the present time: the incumbent management/director/supplier\n[ before noun ]\n&#160; POLITICS holding a particular elected position at the present time: the incumbent mayor/president/vice-president\nit is incumbent on sb to do sth\nsomeone has a duty or responsibility to do something: \"I think it is incumbent on us to provide a good environment for business,\" he said."}