{"id":191095,"name":"independence","type":"noun","us_sound":"ˌɪn.dɪˈpen.dəns","us_link":"../audio/i/independence.mp3","uk_sound":"ˌɪn.dɪˈpen.dəns","uk_link":"../audio/i/ukindel008.mp3","content":"Add to word list\nAdd to word list\nB2 freedom from being governed or ruled by another country: gain independence from Mexico gained its independence from Spain in 1821. Synonyms\nautonomy\nhome rule\nself-determination\nself-government\nself-rule\nsovereignty\nB1 the ability to live your life without being helped or influenced by other people: It's important that parents should allow their children some independence.\nMore examplesFewer examplesBritain conceded independence to India in 1948.The country declared independence in 1952.Mexico gained its independence from Spain in l821.The country has been able to celebrate the return of its independence so brutally snuffed out in 1940.They were the only country to argue for even token recognition of the Baltic states' independence.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nAdd to word list\nAdd to word list\nPOLITICS freedom to make laws or decisions without being governed or controlled by another country, organization, etc.: gain/win/declare independence The country gained its independence in 1991. grant/give/guarantee independence The new government will break up state-owned monopolies and guarantee the central bank's independence.independence from sth/sb The island won independence from France in 1960. economic/political/professional independence The constitution ensures the independence of the judiciary.\nthe state of wanting or being able to do things for yourself and make your own decisions, without help or influence from other people: As a manager he is known for his independence of mind. financial/personal independence"}