{"id":191098,"name":"independent","type":"adjective","us_sound":"ˌɪn.dɪˈpen.dənt","us_link":"../audio/i/independent.mp3","uk_sound":"ˌɪn.dɪˈpen.dənt","uk_link":"../audio/i/ukindel009.mp3","content":"independent adjective\n(NOT INFLUENCED)\nAdd to word list\nAdd to word list\nB2 not influenced or controlled in any way by other people, events, or things: independent enquiry An independent enquiry will determine whether the case should move forward.independent organization The audit will be done by an independent organization.independent of They all made the same comment, quite independent of each other (= without deciding together to do so).\nAn independent politician does not agree or vote with any particular political party.\nMore examplesFewer examplesAn independent adviser has been brought in to conciliate between the two sides involved in the conflict.It's hard to obtain truly independent financial advice.We make use of available research facilities and license technology from independent sources.The industry has not commented on the results of an independent study into the safety of mobile phones.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitics - general words\nindependent adjective\n(NOT RULED)\nB2 An independent country is not governed or ruled by another country: independent from Belize became fully independent from Britain in 1981. The 2014 referendum in Scotland focused on a simple \"yes\" or \"no\" question: Should Scotland be an independent country? Synonyms\nautonomous\nself-governing\nsovereign (GOVERNMENT)\nMore examplesFewer examplesThe province is nominally independent.A bloody civil war followed the proclamation of an independent state.The international community has refused to recognize the newly independent nation state.The creation of independent states has led to a resurgence of nationalism.After India became independent, she chose to be a member of the Commonwealth.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nindependence\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nsecede\nsecession\nself-determination\nself-governing\nself-government\nSee more results »\nindependent adjective\n(NOT HELPED)\nB1 not taking help or money from other people: Grandma's very independent and does all her own shopping and cooking.financially independent I've always been financially independent.\nnot supported by or part of a larger organization: As an independent filmmaker, the best advice I got was to take risks, because nobody will tell you what you can and can't do. When you start working as an independent contractor, you give up your entitlement to a pension or any benefits.\nMore examplesFewer examplesShe's fiercely independent.She attaches great value to being financially independent.She wanted to be independent and beholden to no one.She's very mature and independent for her age.I wish you'd be a bit more independent.Despite the many challenges, some independent retailers are still seeing strong sales.Linda is an independent consultant specializing in digital educational materials.Hundreds of small independent shops will be forced to close by the opening of this superstore.\nSMART Vocabulary: related words and phrases\nUnaided and working alone\nfair\nfend for yourself\ngo it alone idiom\nhigh and dry\nindependently\nown\nself-help\nself-sufficient\nself-taught\nsingle-handed\nsingle-handedly\nstand\nstand on your own (two) feet idiom\nstand-alone\nunassisted\nunder your own steam idiom\nunforced\nunserved\nunsupported\nyourself\nSee more results »\nindependent adjective\n(GRAMMAR)\nlanguage\n&#160; specialized An independent grammatical clause forms part of a sentence but can also form a separate sentence.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nRelated word\nindependently\nindependent noun [C]\n(POLITICS)\na politician who does not represent a political party: He left the Conservatives and stood as an independent.\nUS a voter who does not belong to a political party: She is gaining support among independents who have no political preference or who lean Democratic.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVoters & candidates in elections\nindependent noun [C]\n(BUSINESS)\na shop, small business, etc. that is not part of a large company: The band would rather sign to an independent than a major record label.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShops & auctions\nEnterprises\nAdd to word list\nAdd to word list\nnot influenced or controlled by other people but free to make your own decisions: an independent thinker Congress called for the appointment of an independent counsel to investigate the president. Now that Jean’s got a job, she’s financially independent (= she does not need money from other people).\nsocial studies If a country becomes independent, it is no longer governed or ruled by another country. independent contractor\nAn independent contractor is a person who agrees to do a particular job for someone else for an agreed amount of money but who is not an employee: She used to be on staff, but now she’s an independent contractor. independently adverb us\nYour browser doesn't support HTML5 audio\n/ˌɪn·dɪˈpen·dənt·li/\nThe telephone was actually invented independently by two different people at almost the same time.\npolitics &amp; government a voter or politician who does not belong to a political party: She is gaining support among independents who have no political preference or who lean Democratic.\nAdd to word list\nAdd to word list\nnot influenced or controlled by the government or another organization: independent of sth/sb The commission must remain independent of political control.completely/fully/totally independent The charity is completely independent of government. The agency is an independent body which monitors standards in the industry. an independent adviser/auditor/expert independent report/study/research\nPOLITICS not governed or ruled by another country: an independent nation/state/countryindependent from sth/sb Mexico became independent from Spain in 1821.\nCOMMERCE not part of a larger group of companies: The association represents independent retailers. an independent business/firm/store The band signed with an independent label. a leading independent producer of television programmes\nprivately financed and not receiving money from the government: pupils from state and independent schools\nnot taking help or money from other people: financially/economically independent\nnot involved in a situation so able to judge it fairly: It's important to seek independent advice.\nCOMMERCE a business that does not belong to a larger company or group: The industry ranges from large retailers to small independents."}