{"id":191100,"name":"independently","type":"adverb","us_sound":"ˌɪn.dɪˈpen.dənt.li","us_link":"../audio/i/independently.mp3","uk_sound":"ˌɪn.dɪˈpen.dənt.li","uk_link":"../audio/i/ukindel010.mp3","content":"Add to word list\nAdd to word list\nB2 without being influenced or controlled in any way by other people, events, or things: The two scientists both made the same discovery independently, at roughly the same time.independently of Each part of the organization operates independently of the others.\nwithout taking help or money from other people: She is proud of the fact that at the age of 90, she still lives independently.\nThesaurus: synonyms, antonyms, and examples\nwithout help(all) by yourselfI don't think I can fix the car alone - can you help?(all) on your ownUK I learnt the song all on my own. single-handedlyShe single-handedly saved the company from bankruptcy.unassistedAfter years of using a cane, intensive physio enabled her to walk unassisted.unaidedAfter six months of treatment I can finally walk unaided.independentlyThe charity helps people to live independently.\nSee more results »\nSee\nindependent\nMore examplesFewer examplesHusbands and wives may be taxed independently.If you've already got experience in word-processing and databases, you can take the spreadsheets module of the course independently.Several different students came to me independently with the same concern, so I am taking the matter very seriously.We were concerned that these animals, kept in captivity for so long, might not be able to survive independently in the wild.For most young people, going to university is their first experience of living independently.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\npaddle\npaddle your own canoe idiom\nthe world is someone's oyster idiom\nwiggle room\nwriggle room\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnaided and working alone\nAdd to word list\nAdd to word list\nwithout being controlled or influenced by the government or another organization: independently of sb/sth The person appointed shall act independently of the Board. independently examined/verified/tested\ndone by a small company or organization that is not part of a larger group of companies: The company operates completely independently.independently produced/owned/run independently owned bookstores\nwithout being helped or influenced by other people: work/think independently The survey found that many graduates had difficulty working independently. He has lived independently since the age of 17.\nseparately from other things: Each problem requires different strategies and should be viewed independently."}