{"id":190992,"name":"indeed","type":"adverb","us_sound":"ɪnˈdiːd","us_link":"../audio/i/indeed.mp3","uk_sound":"ɪnˈdiːd","uk_link":"../audio/i/ukincum019.mp3","content":"Add to word list\nAdd to word list\nB1 really or certainly, often used to emphasize something: Indeed, it could be the worst environmental disaster in Europe this century. Evidence suggests that errors may indeed be occurring. We live in strange times indeed.mainly UK Many people are very poor indeed.\nused to express that something is correct: \"Is this your dog?\" \"It is indeed.\"/\"Indeed it is.\" Yes, I did indeed say that.\nC2 used to add some extra information that develops or supports something you have just said: For such creatures, speed is not important - indeed it is counterproductive. I am happy, indeed proud, to be associated with this project.\nMore examplesFewer examples\"Have I met him?\" \"You have indeed - and I can remember what you said about him.\"The tests showed that your son does indeed have a hearing problem.\"Can you really play the trumpet?\" \"I can indeed.\"If you are indeed a poet, let's hear one of your poems.\"That's very strange, isn't it?\" \"Yes, indeed - I can't explain it.\"\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsquarely\nwatertight\nwould\nyou can bet your life idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nWords & phrases expressing agreement & acceptance\nLinguistics: connecting words joining words or phrases with similar or related meanings\nused to express surprise, anger, or lack of belief or interest: \"She said she won't come back until Monday.\" \"Won't she, indeed?\" \"When will we get a pay rise?\" \"When indeed?\"\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nsmall wonder idiom\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nAdd to word list\nAdd to word list\n(used to emphasize something said or about to be said) really; truly: If he has indeed quit his job, I asked myself, why is he still here? From a medical standpoint, the discovery may turn out to be very big news indeed. Indeed (= When you really think about it), why should you follow a doctor’s advice to the letter when you feel like Superman?\nIndeed is also used to make something clear or add to something you have just said: It was impossible to find work and, indeed, it became increasingly hard to keep looking for a job."}