{"id":191459,"name":"individual","type":"noun","us_sound":"ˌɪn.dəˈvɪdʒ.u.əl","us_link":"../audio/i/individual.mp3","uk_sound":"ˌɪn.dɪˈvɪdʒ.u.əl","uk_link":"../audio/i/ukindis006.mp3","content":"individual noun [C]\n(SINGLE)\nAdd to word list\nAdd to word list\nB2 a single person or thing, especially when compared to the group or set to which they belong: Every individual has rights which must never be taken away. Like many creative individuals, she can be very bad-tempered. We try to treat our students as individuals.\nMore examplesFewer examplesThe new tax system would be calculated on the value of property owned by an individual.It's a global problem - what can individuals do about it?He's an extremely unattractive individual, don't you think?The complexity and costliness of the judicial system militate against justice for the individual.The government has been encouraging individuals to opt out of the state pension scheme.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nindividual noun [C]\n(DIFFERENT)\nC2 a person who thinks or behaves in their own original way: If nothing else, the school will turn her into an individual.\nSMART Vocabulary: related words and phrases\nExceptional qualities, things and people\na gift from the gods idiom\nbe a one idiom\ncharacter\ncuriosity\ndistinction\ndistinctiveness\nexoticism\nfavoured\ngift\nhave-a-go hero\nmagic\nnational treasure\nnonpareil\npersonal touch\nrare breed\nright\nsuperwoman\nthe chosen few idiom\nthe X factor\nuniqueness\nSee more results »\nindividual adjective\n(SINGLE)\nB1 [ before noun ] existing and considered separately from the other things or people in a group: Each individual table is finished by hand.\nB1 [ before noun ] given to or relating to a single, separate person or thing: We deal with each case on an individual basis.\nMore examplesFewer examplesTheir youngest child is at the stage where she can say individual words but not full sentences.The United States is a federation of 50 individual states.The local education authorities have devolved financial control to individual schools.She thinks that young people today are too concerned with individual happiness and gratification.This party stands for low taxes and individual freedom.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumbers: single, double & multiple\nindividual adjective\n(DIFFERENT)\nbelonging or relating to, or suitable for, people or things that are different or particular in some way: children with individual needs Marion has a very individual writing style.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nAdd to word list\nAdd to word list\na single person or thing, esp. when compared to the group or set to which it belongs: We will remember him as an individual who always tried to make people happy. individual adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌɪn·dəˈvɪdʒ·u·əl/\nEvery company has its own individual style. individually adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌɪn·dəˈvɪdʒ·u·ə·li/\nThe children will first sing individually and then as a group.\nAdd to word list\nAdd to word list\nconsidered separately from the other things in a group: In some individual cases, travel and related payments constitute gifts. We deal with each case on an individual basis. We represent businesses, not an individual business. Lumping all the brands together could weaken the individual brand identities.\nrelating to a single, separate person: Do you require family or individual health insurance? It is up to the individual investor to decide where they are going to invest. individually adverb\nEach employee's claim will be considered individually.\na single person, especially when compared to the group or set to which they belong: The new tax would be calculated on the value of property owned by an individual."}