{"id":191239,"name":"indictment","type":"noun","us_sound":"ɪnˈdaɪt̬.mənt","us_link":"../audio/i/indictment.mp3","uk_sound":"ɪnˈdaɪt.mənt","uk_link":"../audio/i/ukindel029.mp3","content":"Add to word list\nAdd to word list\n[ usually singular ] something that shows a policy, system, society, etc. is bad or wrong: damning indictment of It seems to me to be a damning indictment of the government's education policy.sad indictment This blog is a sad indictment of our vacuous celebrity obsession.\n[ C ] a statement that criticizes someone or something strongly for being bad or wrong: searing indictment He made searing indictments of the Iraq war.scathing indictment I can't remember the last time I read a more scathing indictment of marriage.\n[ C ]\n&#160; law\n&#160; specialized a formal statement of accusing someone of something: The charges on the indictment include murder and attempted murder. The indictment alleges that she did no work for some of these payments.\n[ U ]\n&#160; law\n&#160; specialized the act of making a formal statement accusing someone of something: The indictment of an officer in connection with a police chase is extremely rare. Some criminal cases are negotiated prior to indictment .\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nfinger\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisapproving & criticizing\nTaking legal action\nAdd to word list\nAdd to word list\na formal statement of accusation\nAn indictment is also a reason for giving blame: The high level of adult illiteracy is seen as an indictment of the country’s education policy.\nAdd to word list\nAdd to word list\n[ U ] the act of formally accusing someone of a serious crime: under indictment for sth He's currently under indictment for embezzlement.on indictment The defendent was tried on indictment.\n[ C ] a written statement that formally accuses someone of a crime: on an indictment She was held to appear for trial on two indictments."}