{"id":191338,"name":"indirect","type":"adjective","us_sound":"ˌɪn.dɪˈrekt","us_link":"../audio/i/indirect.mp3","uk_sound":"ˌɪn.daɪˈrekt","uk_link":"../audio/i/ukindif014.mp3","content":"indirect adjective\n(NOT OBVIOUS)\nAdd to word list\nAdd to word list\nC2 happening in addition to an intended result, often in a way that is complicated or not obvious: The benefits from pure research are often indirect. Indirect effects of the fighting include disease and food shortages.\navoiding clearly mentioning or saying something: indirect criticism\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\nfancily\nfinicky\nhigh-tech\nindirectly\ninsolubility\nmultilayer\nonerousness\nornate\nornately\nover-elaborate\ntortuous\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigressing and being indirect or evasive\nindirect adjective\n(NOT STRAIGHT)\nC1 not following a straight line, or not directly or simply connected: to take an indirect route/flight\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nRelated word\nindirectly\nindirect adjective\n(ADDITIONAL)\nAdd to word list\nAdd to word list\nhappening in addition to an intended result: Several other people were hurt as an indirect result of his carelessness.\nindirect adjective\n(NOT STRAIGHT)\nnot following a straight line, or not connected in a simple way: an indirect route Ransom thought the best approach in defending truth is the indirect one.\nAdd to word list\nAdd to word list\nnot done or communicated in a direct way: We decided to take an indirect approach to tackling the problem of absenteeism. He made only an indirect reference to what had happened at the meeting.\nhappening in addition to an intended result, often in a way that is complicated or not obvious: This is the indirect effect of a bad business climate that discourages companies from expanding here. Incentives can pay for themselves through jobs and indirect benefits to the local economy. Here the deregulation affected the environment, but in a more indirect way. indirectly adverb /ˌɪndɪˈrektli/\nBosses were indirectly blamed for a stressful environment."}