{"id":191274,"name":"indigenous","type":"adjective","us_sound":"ɪnˈdɪdʒ.ə.nəs","us_link":"../audio/i/indigenous.mp3","uk_sound":"ɪnˈdɪdʒ.ɪ.nəs","uk_link":"../audio/i/ukindif004.mp3","content":"Add to word list\nAdd to word list\nused to refer to, or relating to, the people who originally lived in a place, rather than people who moved there from somewhere else : So who are the indigenous people of this land? The indigenous population has long suffered exclusion and profound injustice. He studied Mixtec, an indigenous language of Mexico.\nused to refer to plants and animals that grow or live naturally in a place, and have not been brought there from somewhere else: indigenous to Are there any species of frog indigenous to the area? The snakes are a serious threat to indigenous wildlife owing to their big appetites.\nnot foreign or from outside an area: The rise of indigenous Chinese enterprises has posed a threat to Hong Kong companies. They are doing this by the import of arms from Western sources and by the development of indigenous industries.\nMore examplesFewer examplesBritish attitudes towards indigenous societies are also integral to imperial history.But the conflict seems to have brought the plight of indigenous people to the forefront of Mexican political life.Sturgeon is also indigenous to the US and was plentiful in the 19th century.Some of this was a natural collateral benefit of developing indigenous chemical production infrastructure.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\ninside\nnon-indigenous\nopen-air\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutta\nthence\ntherefrom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCountries, nationalities & continents: country & nation\nAdd to word list\nAdd to word list\nexisting naturally or having always lived in a place; native: The Navajos are among the indigenous people of North America. Are there any species of frog indigenous to the area?\nAdd to word list\nAdd to word list\noperating or happening in the local area, not in other countries: indigenous firms The most profitable indigenous business is cocoa growing. indigenous tourism"}