{"id":191705,"name":"industrial","type":"adjective","us_sound":"ɪnˈdʌs.tri.əl","us_link":"../audio/i/industrial.mp3","uk_sound":"ɪnˈdʌs.tri.əl","uk_link":"../audio/i/ukinduc011.mp3","content":"Add to word list\nAdd to word list\nB2 in or related to industry, or having a lot of industry and factories, etc.: industrial output industrial expansion an industrial landscape/nation He has an industrial background (= he has worked in industry).\nhumorous (of a size or an amount) very large: We would drink industrial quantities of coffee at every meeting. I never used to go out without wearing industrial amounts of black eyeliner. I came home to find the dog munching its way through an industrial-sized pack of dog biscuits. The concert features flashing lights and industrial levels of noise.\nMore examplesFewer examplesThe fund provides money to clean up chemically polluted industrial sites.The developers dealt with the problem in the time-honoured way, burying the industrial waste in landfill sites.Houses near industrial sites often do not sell so quickly because they are regarded as undesirable.There's a long history of industrial disputes at the factory.It's the unrelieved drabness of big industrial cities that depresses me.\nSMART Vocabulary: related words and phrases\nIndustry & industrial processes\nadditive manufacturing\nbiomanufacturing\ncarding\ncleantech\ncompression moulding\nindustry-wide\ninjection moulding\ninter-industry\njust-in-time\nlight industry\nnon-industry\nnon-technical\nprebuilt\nprefabricated\nprefabrication\nsunrise industry\nsunset industry\nsynthetic\nsynthetically\nvitrification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnormous\nRelated word\nindustrially\n[ C ] a company whose main business is producing goods: He owns a series of industrials across the US and beyond. industrials [ plural noun ]\nshares in industrial companies: On Thursday the industrials moved up more than 50 points.\nSee more\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nAdd to word list\nAdd to word list\nof or related to industry, or having a lot of industry and factories: industrial output It’s an industrial city.\nAn industrial park is a special area for factories and businesses.\nAdd to word list\nAdd to word list\nrelating to industry: Building ships has ranked for years as one of the more dangerous industrial jobs. Industrial output fell in April. an industrial company\nused in industry: Orders for industrial equipment have increased. industrial chemicals/cleaners industrial goods/products\nhaving a lot of industry and factories: These workers have some of the best wages in industrial America. an industrial city/country\nrelating to businesses in general, not people: The rate cuts affect everything from home mortgages to commercial and industrial loans. industrial customers\nHR relating to someone's work or job: He lost his hand in an industrial accident in 2008. industrial injury See also\npost-industrial industrially adverb /ɪnˈdʌstriəli/\na chemical that is used industrially advanced economies industrially produced carbon dioxide\n[ C ] a company whose main business is producing goods: Earnings reports from key companies in banking, technology and the industrials have been released.\nindustrials\n[ plural ]\n&#160; STOCK MARKET shares in industrial companies: The trust invests in industrials. See also\nDow Jones industrials"}