{"id":192155,"name":"infected","type":"adjective","us_sound":".ɪnˈfek.t̬ɪd","us_link":"../audio/i/infected.mp3","uk_sound":"ɪnˈfek.tɪd","uk_link":"../audio/i/ukinexp029.mp3","content":"infected adjective\n(DISEASE)\nAdd to word list\nAdd to word list\n(of a person or animal) affected by an organism that can cause disease: Scientists believe people died after eating meat from infected cattle. 20 million Americans became infected with the influenza and more than 500,000 died.\n(of a substance, object, etc.) containing bacteria or other organisms that can cause disease: The virus can be spread through sexual contact and infected needles. After the operation the wound became infected.\nMore examplesFewer examplesRabies is a viral disease that spreads when an infected animal bites another animal or a human.The parasites enter the bloodstream when an infected mosquito bites a human.75 people became infected with Campylobacter bacteria from drinking unpasteurized milk.Some medical personnel contracted hepatitis C from infected blood.The plague had been raging in the city and the rivers were still infected.\nSMART Vocabulary: related words and phrases\nFevers & infectious diseases\nague\nanti-malaria\nanti-malarial\nanti-plague\nanti-typhoid\ndelirious\nglandular fever\nheatstroke\nhelicobacter pylori\nHPV\nLassa fever\nleishmaniasis\nmeasles\nmumps\nnotifiable\nscarlatina\nscarlet fever\nsleeping sickness\nsunstroke\nyeast infection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassing on illness & causing disease\ninfected adjective\n(COMPUTER)\nAn infected computer or file contains a computer virus (= a program that can harm computers and their files): The virus installs a program that records the keystrokes of a person using an infected computer. The virus scanner notifies the user that a file is infected.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ninstaller\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »"}