{"id":192330,"name":"infinitive","type":"noun","us_sound":"ɪnˈfɪn.ə.t̬ɪv","us_link":"../audio/i/uszzzzd027.mp3","uk_sound":"ɪnˈfɪn.ɪ.tɪv","uk_link":"../audio/i/ukzzzze027.mp3","content":"Add to word list\nAdd to word list\nB1 the basic form of a verb that usually follows \"to\": In the sentences \"I had to go\" and \"I must go\", \"go\" is an infinitive.infinitive form \"Go\" is the infinitive form.\nMore examplesFewer examplesMost people start by learning the infinitive of a verb.'To quickly decide' is an example of a split infinitive.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nGrammar\nInfinitive: active or passive?Most verbs have an active infinitive form (with or without to): (to) catch, (to) do, (to) help, (to) leave, (to) wash. …\nInfinitives with and without toThe infinitive of a verb has two forms: the to-infinitive and the infinitive without to. The to-form consists of to plus the base form of the verb: …\nFormThe infinitive of a verb has two forms: the to-infinitive and the infinitive without to. The to-form consists of to plus the base form of the verb: …\nTo-infinitiveWe use the to-infinitive after a number of common main verbs. These include: …\nInfinitive without toWe use the infinitive without to after modal verbs can, could, may, might, will, shall, would, should, must: …\nPerfect infinitive with to (to have worked)We form the perfect infinitive with to have + the -ed form of a verb. We use the perfect infinitive after verbs such as claim, expect, hate, hope, like, love, prefer, pretend: …\nVerb patterns: verb + infinitive or verb + -ing?Some verbs can be followed immediately by a to-infinitive: …\nVerbs followed by a to-infinitiveSome verbs can be followed immediately by a to-infinitive: …\nVerbs followed by -ingSome verbs are normally followed by the -ing form, not the to-infinitive: …\nVerbs followed by a to-infinitive or -ingHate, like, love and prefer can be followed either by -ing or a to-infinitive. The difference in meaning is often small. The -ing form emphasises the verb itself. The to-infinitive puts the emphasis more on the preference for, or the results of, the action. …\nVerbs followed by an infinitive without toLet and make are followed by an infinitive without to in active voice sentences. They always have an object (underlined) before the infinitive: …\nVerbs followed by -ing or an infinitive without toA group of verbs connected with feeling, hearing and seeing can be used with -ing or with an infinitive without to: …\nVerbs followed by a direct object and a to-infinitiveSome verbs are used with a direct object (underlined) followed by a to-infinitive. These verbs include: …\nAdd to word list\nAdd to word list\ngrammar the basic form of a verb, usually following \"to\" or another verb form: In the sentences \"I had to go\" and \"I must go,\" \"go\" is an infinitive."}