{"id":192370,"name":"inflame","type":"verb","us_sound":"ɪnˈfleɪm","us_link":"../audio/i/inflame.mp3","uk_sound":"ɪnˈfleɪm","uk_link":"../audio/i/ukinfir002.mp3","content":"inflame verb [T or I]\n(CAUSE STRONG FEELINGS)\nAdd to word list\nAdd to word list\nto cause or increase very strong feelings such as anger or excitement: Reducing the number of staff is certain to inflame the already angry medical profession.inflame passions Pictures of the bombed and burning city inflamed passions further. The image was used to inflame rather than instruct or reveal truth.\nMore examplesFewer examplesYou can understand how he inflames these kinds of passions.Going in guns blazing just inflames these situations.It will also serve to act as a check against using comments and phrases that inflame rather than educate.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiring feelings in others\ninflame verb [T or I]\n(MAKE SWOLLEN)\nto make a part of the body become red, painful, and swollen; to become red, painful, and swollen: Asthma is a chronic condition that inflames the inside walls of the airways. It triggers antibodies which cause the lining of the gut to inflame, causing abdominal pain.\nMore examplesFewer examplesAcid can enter the lungs and inflame them, causing a secondary pneumonia.Inflaming a knee while putting out the rubbish - that has to be the most ridiculous football injury of all time.Blister agents attack body tissues, blistering the skin and inflaming the eyes.Ozone and other chemicals in smog further inflame the airway linings in people with respiratory diseases.\nSMART Vocabulary: related words and phrases\nSwellings & lumps\nacoustic neuroma\nadenoma hyperplastic nodules\nangioma\nangrily\nanti-tumour\nbloated\nexcrescence\nfibroid\ngranuloma\nhaematoma\ninflammatory\nleiomyoma\nlump\nlymphoedema\nprotuberance\npuffy\ntumid\ntumour\nturgidity\nwen\nSee more results »\nAdd to word list\nAdd to word list\nto excite someone’s strong feelings or make them stronger: The defense objected to the graphic pictures, claiming they were meant merely to inflame the jury."}