{"id":192400,"name":"inflation","type":"noun","us_sound":"ɪnˈfleɪ.ʃən","us_link":"../audio/i/inflation.mp3","uk_sound":"ɪnˈfleɪ.ʃən","uk_link":"../audio/i/ukinfir010.mp3","content":"inflation noun [U]\n(INCREASE)\nAdd to word list\nAdd to word list\nB2 a general, continuous increase in prices: high/low inflation the rate of inflation 13 percent inflation Compare\ndeflation (MONEY)\na continuous increase in the level or amount of something: wage inflation Excess demand eventually led to wage inflation.inflation of There has been a lot of discussion about inflation of grades in higher education recently. See also\ngrade inflation\nthe act of making something larger or more important, or of making it seem larger or more important than it really is: I suspected that there had been some inflation of the claims for political purposes. You have to admire the inflation of the original production into such a mammoth spectacle.\nMore examplesFewer examplesThe control of inflation is a key component of the government's economic policy.There has been an alarming rise in the rate of inflation.Unemployment, inflation and greater inequality are often the downside of a market economy.Managing the economy is a complex equation of controlling inflation and reducing unemployment.The government's overriding concern is to reduce inflation.Inflation of the money supply always leads to inflation in the long term.\nSMART Vocabulary: related words and phrases\nPrice increases\naccrual\nadded value\nanti-inflation\nanti-inflationary\nappreciate\nappreciate by something\nappreciate in value\nbull market\ndead cat bounce\ngo through the roof idiom\nhyperinflation\ninflationary\ninflationary spiral\nput something up\nrack something up\nrebound\nreinflate\nreinflation\nroof\nshooting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nIncreasing and intensifying\nExaggerating & playing down\ninflation noun [U]\n(FILLING WITH AIR)\nthe act of filling something with air, or of being filled with air: His hot air balloon tore during inflation, ending his bid to be first to fly solo round the world. A large herniation can restrict the inflation of a lung.\nMore examplesFewer examplesProper inflation of air in vehicle tyres would save a lot of oil.Air is inserted at three points on the shoe by use of the CO2 inflation device.Inflation of the air packs on the suit during close manoeuvres could cause the pilot to jerk the stick, causing a mid-air collision.\nSMART Vocabulary: related words and phrases\nEnlarging and inflating\naugmentation\nballoon\nbloat\nbroaden\nbuild (someone/something) up\nbulk\nexpand\nexplosively\nflare\nfluff something up\nimplacably\ninflatable\nlengthen\npuff\npump someone up\nreinflate\nreinflation\nscale something up\nstretch\nwiden\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies a continuing rise in prices caused by an increase in the money supply and demand for goods inflationary adjective us\nYour browser doesn't support HTML5 audio\n/ɪnˈfleɪ·ʃəˌner·i/\nInflationary pressures seem to be building in the economy.\nAdd to word list\nAdd to word list\nan increase in prices over time, causing a reduction in the value of money: high/low/moderate inflation Higher inflation threatens to force interest rates higher.falling/rising inflation Two decades of falling inflation and falling interest rates provided an exceptional, probably unique, boost to equities. accelerating/runaway/galloping inflationa surge/increase/rise in inflation The rise in inflation will be seen as a major set-back for the chancellor. a decline/fall/reduction in inflation to control/curb/reduce inflationpush up/fuel inflation The government raised prices to encourage production, further fuelling inflation. the overall rate of inflationabove/below inflation He is planning to increase public spending by 3.3% above inflation for the next three years. The rankings are based on the banks' return on equity, which is then adjusted for inflation.keep pace with/outstrip inflation The agency's budget has not kept pace with inflation and the staff has been cut. Compare\ndeflation\ndisinflation\nreflationSee also\nanti-inflation\nasset inflation\nconsumer price inflation\ncore inflation\ncost inflation\ncost-push inflation\ncreep noun\ndemand inflation\ndemand-pull inflation\ndouble-digit inflation\nheadline inflation\nhyperinflation\nrunaway\nunderlying inflation\nwage inflation\nwage-push inflation\nzero inflation"}