{"id":192457,"name":"influence","type":"noun","us_sound":"ˈɪn.flu.əns","us_link":"../audio/i/influence.mp3","uk_sound":"ˈɪn.flu.əns","uk_link":"../audio/i/ukinfir019.mp3","content":"Add to word list\nAdd to word list\nB2 the power to have an effect on people or things, or a person or thing that is able to do this: bad/good influence on Helen's a bad/good influence on him.have influence over He has a huge amount of influence over the city council.exert influence Christopher hoped to exert his influence to make them change their minds.under the influence of At the time she was under the influence of her father.\nMore examplesFewer examplesMy grandmother had a strong influence on my early childhood.We live in an increasingly secular society, in which religion has less and less influence on our daily lives.She fell under the influence of an older student.His teacher described him as a noisy, disruptive influence in class.The country's great influence in the world is disproportionate to its relatively small size.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\nIdiom\nunder the influence\nB2 to affect or change how someone or something develops, behaves, or thinks: She's very good at making friends and influencing people. [ + obj + to infinitive ] What influenced you to choose a career in nursing?\nThesaurus: synonyms, antonyms, and examples\nto have power to cause a change in someone or somethingaffectLow-income women were disproportionately affected by the legislation. influenceThe jury could have been influenced by all the media coverage surrounding the case.be/fall under someone's influence/spellThe young queen seemed to fall under the spell of her counsellor, believing everything he told her.be under someone's spellWe warned her about him, but all he had to do was turn on the charm and she was under his spell.guideHe is guided by the core beliefs of his religion.impactSevere storms will impact on travel across the region tonight.\nSee more results »\nMore examplesFewer examplesSome people believe your biorhythms can influence your moods and behaviour.She had her own style and was not influenced by the vagaries of fashion.People's voting habits are influenced by political, social and economic factors.What influenced you to choose a career in nursing?The government's campaign is aimed at influencing public opinion.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\ncolour\nconflict\near\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\njerk\npen\nrail\nspill\nspill over\nsportswashing\nstart (something) off\ntalismanic\nSee more results »\nAdd to word list\nAdd to word list\nto cause someone to change a behavior, belief, or opinion, or to cause something to be changed: Businesses make large contributions to members of Congress, hoping to influence their votes on key issues. She was influenced by the common-sense views of her grandparents. That speech influenced the course of American history.\nthe power to have an effect on people or things, or someone or something having such power: [ C ] The kid next door is a bad/good influence on Kevin. [ U ] She used her influence to get her son a summer job.\nAdd to word list\nAdd to word list\n[ C or U ] the ability to have an effect on people or events: exert/have/exercise (an) influence He is close enough to the President to exert influence.(an) influence on sth Bloggers are expanding their influence on American politics.(an) influence over sth Consumer groups act as champions and have critical influence over industry.considerable/profound/growing influence He called on the industry to use its considerable influence to help resolve the situation.\n[ C ] a person or thing that is able to have an effect on other people or on events: International influences in the form of technology, systems and capital have historically been a feature of industrialization and economic growth.be an influence on sb/sth She has been a big influence on me in my career. considerable/great/major influence See also\nundue influence\nto affect or change how someone or something develops, behaves, or thinks: Many analysts regard the state of the U.S. job market as a major factor influencing consumer confidence.influence how/what/when An organization's values have been shown to influence how employees interact with each other."}