{"id":192498,"name":"informal","type":"adjective","us_sound":"ɪnˈfɔːr.məl","us_link":"../audio/i/informal.mp3","uk_sound":"ɪnˈfɔː.məl","uk_link":"../audio/i/ukinfir026.mp3","content":"Add to word list\nAdd to word list\nB2 not formal or official: The two groups agreed to hold an informal meeting. Alliances among small businesses are often informal arrangements, such as two companies teaming up for a marketing event.\n(of clothing, behaviour, speech) suitable when you are with friends and family but not for official occasions: \"Hi\" is an informal way of greeting people. He's the ideal sort of teacher - direct, friendly, and informal.\nMore examplesFewer examplesWhat was once an informal event has now become institutionalized.People chatting at a party will usually be talking in an informal register.Many informal expressions are gaining currency in serious newspapers.The party itself was a fairly informal affair.They started as informal gatherings but they have become increasingly formalized in the last few years.\nSMART Vocabulary: related words and phrases\nManners & levels of formality\nbutton-down\nbuttoned-up\ncasualization\nceremonious\nceremoniously\nformality\ngenteel\ngenteelly\ngenteelness\ngentility\nmind your p's and q's idiom\nnon-formal\nnon-U\nnot the done thing idiom\nover-familiar\nsolemnity\nunbuttoned\nunstuffy\nvalediction\nvaledictory\nSee more results »\nRelated words\ninformally\ninformalityGrammar\nFormal and informal languageWe use formal language in situations that are serious or that involve people we don’t know well. Informal language is more commonly used in situations that are more relaxed and involve people we know well. …\nRegisterWe use the term ‘register’ to refer to particular varieties or styles of speaking and writing. Registers vary because the language is used for different purposes, in different contexts and for different audiences. For example, there is a legal register, a register of advertising, registers of banking and a register of weather forecasting. We commonly recognise registers because of their specialised vocabulary but also because of particular uses of grammar. We also use the term register to refer to whether language is being used formally or informally: …\nAdd to word list\nAdd to word list\nnot formal or official, or not suitable for official or special occasions: an informal gathering Informal talks resumed today in an attempt to end the strike. informality noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪn·fɔrˈmæl··t̬i/informally adverb us\nYour browser doesn't support HTML5 audio\n/ɪnˈfɔr·mə·li/\nIt’s OK to dress informally for the dinner party."}