{"id":192509,"name":"information","type":"noun","us_sound":"ˌɪn.fɚˈmeɪ.ʃən","us_link":"../audio/i/eus75806.mp3","uk_sound":"ˌɪn.fəˈmeɪ.ʃən","uk_link":"../audio/i/ukinfir030.mp3","content":"Add to word list\nAdd to word list\nA2 facts about a situation, person, event, etc.: information about/on Do you have any information about/on train times?bit/piece of information I read an interesting bit/piece of information in the newspaper.for further information For further information (= if you want to know more), please contact your local library. [ + that ] We have reliable information that a strike is planned next month.\nThesaurus: synonyms, antonyms, and examples\ninformationinformationCan I get some information on uni courses?detailsPlease send me details of your training courses.directionsJust follow the directions on the label.instructionsHave you read the instructions all the way through?directionsWe had to stop and ask for directions.guidelinesThe government has issued new guidelines on health and safety at work.\nSee more results »\nMore examplesFewer examplesPlease contact our agent in Spain for further information.I went to several libraries to gather information about the scheme.The police are appealing to the public for any information about the missing girl.\"Hello, I'd like some information about your flights to the USA, please.\"Modern computers can hold huge amounts of information.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nGrammar\nInformationInformation is an uncountable noun meaning ‘facts about someone or something’. It is often followed by about: …\nIdiom\ntoo much information\nAdd to word list\nAdd to word list\nnews, facts, or knowledge: an important piece of information Can you give us some information on tours to Alaska? Information about upcoming local events is printed in the newspaper.\nAdd to word list\nAdd to word list\nfacts or details about a person, company, product, etc.: gather/get/obtain information Can you tell me where I can obtain further information?ask for/request/demand information I wrote requesting information on how revenue statistics were compiled.give/provide/share information The investment research company provides information in a timely way.information on sth The questionnaire asks for detailed information on family and medical history.information about sth Regulators are demanding that firms release more and more information about their performance.additional/more/further information Anyone requiring further information should contact this office. classified/confidential/proprietary information accurate/detailed/reliable information financial/personal/business information It was a very interesting piece of information.\nfor information only\nused in an announcement, email, document, etc. that contains information that someone needs but that they do not have to deal with: All comments, rates, and dates are provided for information only.\nfor more information (also formal for further information)\nMARKETING used in advertisements, news articles, etc. when giving something such as a website or phone number where someone can find more information about something: For more information visit www.cambridge.org.\nfor your information\n(also FYI) used to say that you are telling or giving someone something because they might not know or have it and it could be useful for them: A copy of the document is enclosed for your information. See also\ncredit information\ninsider information"}