{"id":192865,"name":"ingredient","type":"noun","us_sound":"ɪnˈɡriː.di.ənt","us_link":"../audio/i/eus72426.mp3","uk_sound":"ɪnˈɡriː.di.ənt","uk_link":"../audio/i/ukingra004.mp3","content":"Add to word list\nAdd to word list\nB1 a food that is used with other foods in the preparation of a particular dish: list of ingredients The list of ingredients included 250 g of almonds.\nB2 one of the parts of something successful: Trust is a vital ingredient in a successful marriage. Synonyms\nangle (WAY OF THINKING)\naspect (FEATURE)\nfacet\nfeature (QUALITY)\npoint (CHARACTERISTIC)\nside (PART OF SITUATION)\nstrand (PART)\nMore examplesFewer examplesWhen cooking the sauce, don't forget that all-important ingredient, fresh basil.You mix all the dry ingredients together before you add the milk.He created a wonderful meal from very few ingredients.This tiny capsule contains two types of effective painkilling ingredients.The exact ingredients of Coca Cola are a trade secret.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nbind\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\njerk\njulienne\nrecipe\nrehydrate\nrestuff\nrice\nrustle something up\ntoss\nzap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning parts of things\nAdd to word list\nAdd to word list\none of the parts in a mixture: Combine all the ingredients for the stew. fig. She viewed color as an essential ingredient of good design.\nAdd to word list\nAdd to word list\none of the parts of something that is needed in order for a particular job, business, etc. to succeed: basic/key/main ingredient Policymakers see capital investment as a key ingredient in an economic recovery. People are the essential ingredient in creativity.\na substance that forms part of something else: Commodities, such as steel, are important ingredients in building wind turbines.harmful/hazardous/unsafe ingredient A high percentage of the products were found to contain unsafe ingredients. China exported $2.5 billion of food ingredients to the United States and the rest of the world in 2006."}