{"id":193083,"name":"initial","type":"adjective","us_sound":"ɪˈnɪʃ.əl","us_link":"../audio/i/initial.mp3","uk_sound":"ɪˈnɪʃ.əl","uk_link":"../audio/i/ukingra029.mp3","content":"Add to word list\nAdd to word list\nB2 of or at the beginning: My initial surprise was soon replaced by delight. Initial reports say that seven people have died, though this has not yet been confirmed.\nMore examplesFewer examplesThe initial earthquake was followed by a series of aftershocks.The doctor has made an initial diagnosis, but there'll be an additional examination by a specialist.The project is only in the initial phase as yet, but it's looking quite promising.As the plot unfolds, you gradually realize that all your initial assumptions were wrong.The final technical report into the accident reinforces the findings of initial investigations.\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\ndebut\nfirst come, first served idiom\nfrom the word go idiom\nfront end\nin the first/second place idiom\ninaugural\ninitially\nplace\nprefatory\nprimary\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\nword\nSee more results »\nB1 the first letter of a name, especially when used to represent the whole name: your initials He wrote his initials, P.M.R., at the bottom of the page.initial stands for Paul M. Reynolds refused to say what the initial \"M\" stood for.middle initial Fill in your first name, middle initial and last name. They carved their initials into a tree.\nMore examplesFewer examplesHis initials were engraved on the back of his watch.Doesn't it cause problems, having the same initials as your father?She always includes her middle initial in her signature.There's an 'S. Smith' on the list, but you and Simon share the same initial, so I'm not sure who they mean.The author C. S. Lewis is better known by his initials than by his full name, Clive Staples Lewis.\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nall caps\nalphabet\nalphabetical\nalphabetically\nascender\nBraillist\ncamel case\nhieroglyph\nideogram\nIPA\nLatinize\nLatinized\nmulti-character\nnon-phonetic\nnotation\npaleographical\nroman\nsentence case\nstenography\ntitle case\nSee more results »\nGrammar\nInitialsAn initial is the first letter of a word. We often use initials to refer to the names of countries and organisations: …\nAcronymsAcronyms are words which are formed from the first letters of other words, and which are pronounced as full words. Examples of acronyms: …\nAbbreviations, initials and acronymsWhen we abbreviate a word or phrase, we shorten it. Abbreviations can be formed from the first letters of the word or phrase. In such cases, we normally say them by spelling out each letter: …\nAbbreviations and lettersWhen we abbreviate a word or phrase, we shorten it. Abbreviations can be formed from the first letters of the word or phrase. In such cases, we normally say them by spelling out each letter: …\nto write your initials on something: If you make any changes to the document, please initial them.\nSMART Vocabulary: related words and phrases\nSigning & signatures\nanon\nautographically\nco-sign\nco-signatory\nco-signer\ncountersign\nJohn Hancock\nnotarize\nsign\nsign (something) off\nsign for something\nsign for/with someone\nsign in\nsign on\nsign something away\nsignature\nsigning\ntag\nthe undersigned\nunsigned\nSee more results »\ninitial adjective [not gradable]\n(BEGINNING)\nAdd to word list\nAdd to word list\nof or at the beginning; first: She failed her driving test on the initial try, but passed the next time. The president’s initial popularity soon disappeared. initially adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪˈnɪʃ·ə·li/\nThe ceremony, initially planned for this month, was postponed.\ninitial noun [C]\n(FIRST LETTER)\nthe first letter of a name, esp. when used to represent a name\nYour initials are the first letters of each of your names: They will put your initials on the luggage for another $15.\ninitial verb [T]\n(WRITE FIRST LETTERS)\nto write your initials on something: Please initial each document.\nAdd to word list\nAdd to word list\nhappening at the beginning: initial estimate/forecast Economists had expected GDP growth to be revised upwards from last month's initial estimate of 0.6%.initial charge/cost/fee The fund has an initial charge of 5.25%. Investors may not get back the full value of their initial investment.\nto write the first letters of each of your names on an official document to show that you have read it and agree with it: Initial and date each page of the contract.\nto discuss and agree to an arrangement with another organization, country, etc.: The two nations used the summit to initial a deal on energy cooperation.\nthe first letter of each of your names: He was dismissed for forging his manager's initials on the invoices.\none of the letters by which an organization may be known, which are usually the first letters of each of the words in its name: The insurance giant AIG's initials stand for American International Group."}