{"id":193114,"name":"initiative","type":"noun","us_sound":"ɪˈnɪʃ.ə.t̬ɪv","us_link":"../audio/i/eus72432.mp3","uk_sound":"ɪˈnɪʃ.ə.tɪv","uk_link":"../audio/i/ukiniti004.mp3","content":"initiative noun\n(NEW PLAN)\nAdd to word list\nAdd to word list\nC1 [ C ] a new plan or process to achieve something or solve a problem: peace initiative The peace initiative was welcomed by both sides.\nMore examplesFewer examplesThe German leadership lauded the Russian initiative.The UN called on all parties in the conflict to take a positive stance towards the new peace initiative.Joe Walker will be spearheading our new marketing initiative.The initiative has across-the-board support.He began his lecture by talking down the initiatives of a rival company.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nmove\nresponsibility\nrole-play\nrot\nstep\nstep up\nstuff\ntalk\nSee more results »\ninitiative noun\n(JUDGMENT)\nC1 [ U ] the ability to use your judgment to make decisions and do things without needing to be told what to do: show initiative Although she was quite young, she showed a lot of initiative and was promoted to manager after a year.use initiative I shouldn't always have to tell you what to do, use your initiative (= use your own judgment to decide what to do)! on your own initiative\nIf you do something on your own initiative, you plan it and decide to do it yourself without anyone telling you what to do: Some states acted under threat of litigation, and others on their own initiative.\nSee more\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\ninitiative noun\n(ADVANTAGE)\nthe initiative C1 [ S ]\nthe power or opportunity to win an advantage: seize/take the initiative Leaders must seize/take the initiative rather than following public opinion.lose the initiative The team were leading in the first half of the game, but lost the initiative in the second half. The ideal candidate for this position will take the initiative to proactively find solutions to problems. Legislators have seized the initiative to codify the right into law. Rebels seized the initiative and pressed deeper into occupied territory. I'm waiting for our team to take the initiative and start scoring, instead of constantly playing defence.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npredominance\npuissance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\ninitiative noun\n(ABILITY TO TAKE ACTION)\nAdd to word list\nAdd to word list\n[ U ] the ability to judge what needs to be done and take action, esp. without suggestion from other people: Lisa showed initiative on the job and was soon promoted.\ninitiative noun\n(NEW BEGINNING)\n[ C ] a new attempt to achieve a goal or solve a problem, or a new method for doing this: The defense secretary announced a major initiative to upgrade our military preparedness.\nAdd to word list\nAdd to word list\n[ C ] a new plan or action to improve something or solve a problem: a marketing/cost-cutting initiative a diplomatic/peace initiative an education/environmental/economic initiative\n[ U ] the ability to use your own judgment to make decisions without asking another person's advice: take/seize/lose the initiative The group's legal advisers said they were taking the initiative to tackle online privacy issues. Candidates for the job must be capable of working on their own initiative."}