{"id":193156,"name":"injure","type":"verb","us_sound":"ˈɪn.dʒɚ","us_link":"../audio/i/injure.mp3","uk_sound":"ˈɪn.dʒər","uk_link":"../audio/i/ukiniti009.mp3","content":"Add to word list\nAdd to word list\nB1 to hurt or cause physical harm to a person or animal: A bomb exploded at the embassy, injuring several people. She fell and injured her shoulder. He was badly injured in the crash. He claimed that working too hard was injuring his health. Compare\nwound verb (INJURE)\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nMore examplesFewer examplesThe troops bombarded the city, killing and injuring hundreds.If you don't warm up before taking exercise, you risk injuring yourself.They were only slightly injured in the crash.I fell down the stairs and injured my back.He had injured his left hand and was typing one-handed.\nSMART Vocabulary: related words and phrases\nInjuring and injuries\nat-risk\nbe in the wars idiom\nbite\nboo-boo\nbrain damage\ndisable\nharm\ninjury\nlesion\nlesional\nmaim\nreinjury\nscarred\nscathe\nsprain\nstrain\ntrample\ntrauma\ntwist\nvictim\nSee more results »\nAdd to word list\nAdd to word list\nto hurt a living creature, esp. to cause physical harm to someone: The bus careened out of control, injuring several people.\nAdd to word list\nAdd to word list\nto harm someone or yourself: Part of the roof collapsed, seriously injuring six employees.be badly/critically/seriously injured The insurance pays out if you have been seriously injured at work.\nto do damage to a business or its reputation: The market leader claims it has been injured by false advertising."}