{"id":193384,"name":"innovative","type":"adjective","us_sound":"ˈɪn.ə.veɪ.t̬ɪv","us_link":"../audio/i/eus72437.mp3","uk_sound":"ˈɪn.ə.və.tɪv","uk_link":"../audio/i/ukinnin013.mp3","content":"Add to word list\nAdd to word list\nC1 using new methods or ideas: innovative ideas/methods She was an imaginative and innovative manager. Synonym\ngroundbreaking\nThesaurus: synonyms, antonyms, and examples\nrecently appeared, arrived, or developednewI bought a new suit for my interview.brand newThe company unveiled a brand new product this week.novelThat's a novel way of approaching the problem.novelThe bank has introduced a novel way of detecting fraud.innovativeThe project uses innovative ideas for recycling.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nimaginativeimaginativeShe is often brilliantly imaginative in filling out the details of the writer's life.creativeThe designer is either a creative genius or completely bonkers.inventiveThe company was known for hiring inventive people who could dream up new products.innovativeShe was an innovative, entrepreneurial thinker.visionaryAn organization doesn't grow if you don't have a visionary leader to take you into the future.\nSee more results »\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovatively\nlatest\nlatter-day\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nAdd to word list\nAdd to word list\n(of ideas and methods) new and different: Gwen introduced a number of innovative solutions.\nAdd to word list\nAdd to word list\nusing new ideas or methods: In recent years, the company has relied more on creative repackaging than on innovative design.innovative ideas/products/programmes Big companies are always looking for innovative products that can't be easily copied. an innovative approach/practice/strategy The group aims to reduce the risks and increase the chances of innovatory, technology-based start-ups making it in the big commercial world. innovatively adverb\nto think innovatively"}