{"id":193380,"name":"innovation","type":"noun","us_sound":"ˌɪn.əˈveɪ.ʃən","us_link":"../audio/i/innovation.mp3","uk_sound":"ˌɪn.əˈveɪ.ʃən","uk_link":"../audio/i/ukinnin012.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] a new idea or method: Another innovation for the Olympics was sprint suits for runners. Technological innovations have allowed for drilling with less disturbance to the environment. the latest innovations in computer technology\n[ U ] the creating and use of new ideas or methods: He says he wants to stimulate creativity and innovation. Business leaders are blaming high taxes for stifling economic success and innovation.\nMore examplesFewer examplesInnovations in design are making artificial limbs more like human arms and legs.Innovations are suppressed in times of geopolitical and economic stress.How can the industry foster innovation?The rate of product innovation in many industries declined significantly.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nmodularization\nnanotechnology\nnon-imitative\noperational research\noriginator\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nAdd to word list\nAdd to word list\na new idea or method, or the use of new ideas and methods: [ U ] The recording industry is driven by constant innovation. [ C ] His latest innovation is a theater company that will perform for schools.\nAdd to word list\nAdd to word list\n[ C ] a new idea, design, product, etc.: innovations in sth recent innovations in technology Product innovations lead to an increase in effective demand which encourages an increase in investment and employment.\n[ U ] the development of new products, designs, or ideas: He says universities should work with the private sector to foster innovation and entrepreneurship. financial/organizational/technological innovation Their success lies in combining an effective innovation process with superior product concept. See also\nproduct innovation"}