{"id":193449,"name":"inoculation","type":"noun","us_sound":"ɪˌnɑː.kjəˈleɪ.ʃən","us_link":"../audio/i/inoculation.mp3","uk_sound":"ɪˌnɒk.jəˈleɪ.ʃən","uk_link":"../audio/i/ukinnin023.mp3","content":"Add to word list\nAdd to word list\nthe action of inoculating someone (= giving them a weak form of a disease as protection against it), or something such as an injection that is given for this reason: inoculation with After inoculation with the 2nd vaccine the animals' temperature will go up. He received a cholera inoculation. A doctor visits the clinic monthly to give inoculations.\nthe action of introducing something such as bacteria, a virus, or a fungus into an animal or plant as part of an experiment or to encourage it to grow there: inoculation with The Petri dishes were half filled with agar before inoculation with the fungus. Inoculations with spores of the pathogen are made in order to learn about how it germinates and infects the plant.\nsomething that protects someone from being affected by something, often by giving them some experience of it: inoculation against As a poet, you have early inoculation against an obsession with success. We need inoculations against our own potential for evil. Related word\ninoculate\nMore examplesFewer examplesEdward Jenner proved that inoculation with cowpox protected against smallpox. She wants as many people as possible to receive inoculations.The new vaccine will appear on the list of required school inoculations.We studied the mice 16 hours after parasite inoculation. \"Affluence is not an inoculation against child abuse,\" he writes.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunology\nimmunosuppressed\ninoculate\njag\nvaccinate\nvaccinated\nvaccination\nvax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTesting, checking and experimenting\nDefending and protecting"}