{"id":193446,"name":"inoculated","type":"verb","us_sound":"ɪˈnɑː.kjə.leɪt","us_link":"../audio/i/inoculate.mp3","uk_sound":"ɪˈnɒk.jə.leɪt","uk_link":"../audio/i/ukinnin022.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ninoculate\n[ T ] to give a weak form of a disease to a person or animal, usually by injection, as a protection against that disease: My children have been inoculated against polio. Louis Pasteur inoculated an 8-year-old boy with cowpox and then exposed him to smallpox to test his theory. There may be a shortage of flu vaccine to inoculate the elderly and other vulnerable groups. Compare\nvaccinate\n[ T ] to introduce something such as bacteria, a virus, or a fungus into an animal or plant as part of an experiment or to encourage it to grow there: Researchers inoculated some rabbits with the antigen and measured the amount of antibodies the animals produced. Shiitake mushroom logs are wooden logs inoculated with spores for growing your own crop of mushrooms.\n[ I or T ] to protect someone from being badly affected by something, usually by giving them some experience of it: Psychologists recognize that stressful life events may inoculate an individal against trauma. Unfortunately, age does not inoculate against a broken heart.\nMore examplesFewer examplesThe president ordered the U. S. Armed Forces to be inoculated against smallpox.The squirrels are trapped, inoculated and tagged for monitoring, then released.They proposed the idea of inoculating babies with healthy gut bacteria.Sometimes fresh cheese is inoculated with pieces of blue cheese to catch the mould by contact.Set aside the inoculated starter for 2-3 days or until the moulds start to grow in the starter.What they read about the Holocaust inoculated them against fascism and extremism for ever.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunosuppressed\ninoculation\nlymph\nunvaccinated\nvaccinate\nvaccinated\nvaccination\nvax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedicines & drugs: preventing infection\nTesting, checking and experimenting\nDefending and protecting\nRelated word\ninoculation"}