{"id":193574,"name":"input","type":"noun","us_sound":"ˈɪn.pʊt","us_link":"../audio/i/input.mp3","uk_sound":"ˈɪn.pʊt","uk_link":"../audio/i/ukinorg002.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] something such as energy, money, or information that is put into a system, organization, or machine so that it can operate: input into I didn't have much input into the project (= the help I gave was small). The power input will come largely from hydroelectricity.\n[ C ]\n&#160; electronics\n&#160; specialized the part that carries information to a machine, or the place where this is connected: The inputs for the CD-ROM are at the back of the computer. an input device\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nMachines - parts\nto put information into a computer or other piece of electronic equipment: input something into something I've spent the morning inputting data into the computer.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nAdd to word list\nAdd to word list\ninformation, money, or energy that is put into a system, organization, or machine so it can operate: [ U ] The city plans to get input from local community groups. [ C ] This unit has three audio inputs (= places to connect other devices). input verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈɪn·pʊt/ present participle inputting | past tense and past participle input or inputted\nkeyboard operators inputting data\nAdd to word list\nAdd to word list\n[ U ] help, ideas, or knowledge that someone gives to a project, organization, etc.: input from sb/sth We had a very productive meeting with a lot of good input from the technical department. input on sth We want input on product development from employees and potential customers.\n[ C or U ]\n&#160; ECONOMICS a resource such as materials or labour that is involved in producing something and has a cost that affects profits: The majority of input costs are related to the cost of the workforce.\n[ U ]\n&#160; IT the information that you put into a computer: Words in the input that are not spelled correctly will be highlighted.\n[ U ]\n&#160; IT the act of putting information into a computer: fields used for data input\n[ C ]\n&#160; IT a part that carries information to a machine, or the place where this is connected: a digital video input Compare\noutput noun\nIT to put data into a computer: input data/details/information His account details had been input incorrectly."}