{"id":193614,"name":"inquiry","type":"noun","us_sound":"ˈɪŋ.kwɚ.i","us_link":"../audio/i/inquiry.mp3","uk_sound":"ɪnˈkwaɪə.ri","uk_link":"../audio/i/ukenliv017.mp3","content":"inquiry noun\n(QUESTION)\nAdd to word list\nAdd to word list\nB1 [ C or U ] (the process of asking) a question: make an inquiry about/into I've been making inquiries about/into the cost of a round-the-world ticket.inquiry into formal Inquiry into the matter is pointless - no one will tell you anything.\nMore examplesFewer examplesWho will be leading the inquiry into the accident?The inquiry found evidence of serious misapplication of funds.The nomination of Judge Watkins as head of the inquiry was a surprise.There is to be an official inquiry into the incident.A new team of detectives were called in to conduct a fresh inquiry.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\ninquiry noun\n(PROCESS)\nC2 [ C ] an official process to discover the facts about something bad that has happened: a judicial inquiryinquiry into Citizens have demanded a full inquiry into the government's handling of the epidemic.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nthe act of asking for information: [ C ] I’ve made inquiries about the cost of a ticket.\nAn inquiry is also an official attempt to discover the facts about something.\nAdd to word list\nAdd to word list\n[ C ] a question or request for information about someone or something: receive/get an inquiry The company has received more than 1,000 inquiries since they launched the insurance policy last month.make an inquiry about sth We have received hundreds of calls from people making inquiries about availability of the product.inquiries from sb A customer-relations service answers 2,000 inquiries from the public each week.customer/media inquiry Please note that this number is for media inquiries only. to answer/deal with/handle inquiries a telephone/email inquiry initial/preliminary/further inquiries general/specific inquiries\n[ U ] the process of asking a question or asking for information about someone or something: On further inquiry, the company was told that the contracts had been cancelled.\n[ C ]\n&#160; GOVERNMENT an official process to discover the facts about something, especially something bad that has happened: hold/launch/open an inquiry into sth The Competitions Commission will hold an inquiry into the incident. The Council has set up an independent inquiry which will show the effect of closure of the plant.\n[ C or U ]\n&#160; IT an attempt to find information that is kept electronically: The database management system offers a facility for on-line update and inquiry.\nline of inquiry plural lines of inquiry\na way of finding out information: The company is pursuing its own lines of inquiry into the fraud."}