{"id":193607,"name":"inquire","type":"verb","us_sound":"ɪnˈkwaɪr","us_link":"../audio/i/inquire.mp3","uk_sound":"ɪnˈkwaɪər","uk_link":"../audio/i/ukenliv013.mp3","content":"Add to word list\nAdd to word list\nB2 to ask for information: inquire about Shall I inquire about the price of tickets? [ + question word ] She called to inquire when her car would be ready. [ + speech ] \"Where are we going?\" he inquired politely.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\nMore examplesFewer examples\"How is your wife now, Charles?\" \"She's improving, thank you. It's kind of you to inquire.\"Mrs Tuck called half an hour ago to inquire whether her order was ready.I thought it might be rude to inquire about her ex-husband.I have a customer on the phone inquiring about the publication date.\"Are you the manager of this establishment?\", he inquired sternly.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\ncross-examine\ninquire within idiom\ninterviewer\nply someone with something\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nIdiom\ninquire withinPhrasal verbs\ninquire after someone\ninquire into something\nAdd to word list\nAdd to word list\nto ask for information: [ I ] Officials from around the country have called to inquire about the program. [ + question word ] Phil inquired whether I wanted to meet his roommate. inquiring adjective (also enquiring) us\nYour browser doesn't support HTML5 audio\n/ɪnˈkwɑɪər·ɪŋ/\nYou have a very inquiring mind. Phrasal verb\ninquire into something\nAdd to word list\nAdd to word list\nto ask for information: inquire about sth Most callers are inquiring about train times and ticket prices.inquire what/whether/why Somebody might inquire whether other opportunities are available.\ninquire within\nwritten on a notice on a building, especially in a shop window, meaning that information can be found inside: Part-time chef required. Inquire within. Phrasal verb\ninquire into sth"}