{"id":193845,"name":"insert","type":"verb","us_sound":"ɪnˈsɝːt","us_link":"../audio/i/insert_01_00.mp3","uk_sound":"ɪnˈsɜːt","uk_link":"../audio/i/ukinsec013.mp3","content":"Add to word list\nAdd to word list\nC1 to put something inside something else: Insert the key in/into the lock.\nC1 to add writing to a text, form, etc.: I've filled in the form, but you still need to insert (= add) your bank details and date of birth.\nSMART Vocabulary: related words and phrases\nInserting and forcing things into other things\nbed\ncram\ndig\ndig (something) into someone/something\nembed\nembedded\ngouging\ninset\ninterlace\ninterpolation\ninterposition\nintersperse\nlodge\nreinsertion\nrethread\nshoehorn\nsquash\nstick\nstuck\nwedge\nSee more results »\nsomething that is made to go inside or into something else: These magazines have too many annoying inserts (= extra loose pages) advertising various products.\nSMART Vocabulary: related words and phrases\nInserting and forcing things into other things\nbed\ncram\ndig\ndig (something) into someone/something\nembed\nembedded\ngouging\ninset\ninterlace\ninterpolation\ninterposition\nintersperse\nlodge\nreinsertion\nrethread\nshoehorn\nsquash\nstick\nstuck\nwedge\nSee more results »\nAdd to word list\nAdd to word list\nto put something in something else: Insert your ATM card in the slot to begin your transaction. insertion noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈsɜr·ʃən/\nSoftware can automate the insertion of SGML codes in texts.\nsomething that is made to go into or inside something else: newspaper advertising inserts (= extra pieces placed inside)\nAdd to word list\nAdd to word list\nto put something inside or into something else: insert sth into sth Please insert your card into the slot to make a payment.insert sth in sth You can pay to have advertising flyers inserted in magazines.insert sth between sth The leaflet can be inserted between the pages of the book.\nto add something to something else: insert sth in sth The camera enables users to take pictures, then use a personal computer to insert them in items like calendars and emails.insert sth into sth They want to insert two new clauses into the contract.insert sth between sth How can I insert a comma between the addresses in a spreadsheet?\nMARKETING something that is made to go inside or into something else, for example a sheet of paper with advertising in a magazine, newspaper, or book: a newspaper/magazine insert The bureau will also distribute a 16-page glossy insert in five Ontario newspapers beginning next month.\nSee also\nfree-standing insert"}