{"id":193888,"name":"inside","type":"noun","us_sound":"ˈɪn.saɪd","us_link":"../audio/i/cdo0623usinsi2113.mp3","uk_sound":"ɪnˈsaɪd","uk_link":"../audio/i/ukinsec019.mp3","content":"Add to word list\nAdd to word list\nB2 [ C usually singular ] the part, space, or side of something that is inside: inside of Did you clean the inside of the car?on the inside The hotel looked shabby from the street, but it was fine on the inside. the insides of people's houses Compare\noutside noun (OUTER PART)\nsomeone's mind, thoughts, or feelings; someone's private self: on the inside Nobody knows how I really feel on the inside.\n[ C usually singular ] The inside of a part of the body such as the arm or leg is the part facing in towards the rest of the body: She dabbed perfume on the inside of her wrist. insides [ plural ] informal\na person's or animal's internal organs, especially the stomach or bowels: The dead seal's insides were spread all over the snow.\nSee more\nMore examplesFewer examplesThe inside of the house is in good condition, but externally it's in need of repair.The door bolts on the inside.There's a lovely soft furry lining on the inside of this jacket.I can't send her a birthday card that has a rude message printed on the inside.The inside of the shed was absolutely covered in cobwebs.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninterior\nintra-\ninward\nmidst\non a dime idiom\nthere\ntherein\nthick\ntrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCentres of objects\nFeelings - general words\nGrammar\nInsideInside is an adjective, noun, adverb or preposition. We use inside when we refer to the inner part of something. …\nIdiom\non the inside\nA1 in or into a room, building, container, or something similar: \"Is Anna in the garden?\" \"No, she's inside (= in the house).\" She grabbed the bag and looked inside.\nin someone's mind, thoughts, or feelings: She couldn't cope with the grief she felt inside. He was outwardly calm, but inside he was in turmoil.\ninformal in prison: inside for Her husband's inside for armed robbery.\nIn baseball, if a ball that is thrown to a batter is inside, it is thrown towards the side of home plate that is nearest to the batter: The fastball was low and inside. Pitchers will throw inside sometimes to stop the hitters from getting too comfortable. inside out\nB2 If something is inside out, it has the usual inside part on the outside and the usual outside part on the inside: She had her sweater on inside out.\nSee more\nMore examplesFewer examplesLakisha sat inside, in fear of her life, until the police came.The front door was open so she walked inside and called out, \"Hello! Is there anybody in?\"If the weather's bad, we'll have to hold the party inside.Wipe your feet on the mat before you come inside.Her curiosity got the better of her and she opened the door and peeped inside.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninterior\nintra-\ninward\nmidst\non a dime idiom\nthere\ntherein\nthick\ntrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings - general words\nPutting people in prison\nBaseball & rounders\nGrammar\nInsideInside is an adjective, noun, adverb or preposition. We use inside when we refer to the inner part of something. …\nIdioms\nknow something inside out\nturn a place inside out\nin a room, building, container, or something similar: What's inside the box? Luckily, no one was inside the building when it collapsed.\nin someone's mind, thoughts, or feelings: Who can tell what goes on inside his head? Rage was building up inside her.\nwithin the limits of what is allowed by something, for example the law or a set of rules: Investment banks are struggling to find a way of doing business that stays inside the rules. We have to work from inside the system to improve outcomes.\nC2 (also inside of) in less than a particular amount of time or under a particular limit: The new faster trains can do the journey inside two hours. He finished it inside of two hours.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninterior\nintra-\ninward\nmidst\non a dime idiom\nthere\ntherein\nthick\ntrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings - general words\nUntil a particular moment\nGrammar\nInsideInside is an adjective, noun, adverb or preposition. We use inside when we refer to the inner part of something. …\non or in the inner part of something such as a container or building: inside pocket He put the documents carefully in his inside pocket. Butter the inside surface of the tin. Moisture can get trapped on the inside layer of glass.\nC2 (of information) obtained by someone in a group, organization, or company and therefore involving special or secret knowledge: inside information/knowledgethe inside story I'll call up Clare and get the inside story (= a true report of the facts).\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninterior\nintra-\ninward\nmidst\non a dime idiom\nthere\ntherein\nthick\ntrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nGrammar\nInsideInside is an adjective, noun, adverb or preposition. We use inside when we refer to the inner part of something. …\nIdiom\nhave the inside track\ninside noun\n(INNER PART)\nAdd to word list\nAdd to word list\nthe inner part, space, or side of (something): [ U ] the inside of a car [ U ] the inside of your wrist\ninfml Your insides are your stomach and other digestive organs. Idiom\ninside out\ninside preposition, adjective, adverb [not gradable]\n(IN INNER PART)\nin or into a room, building, container, or something similar: What’s inside the big box? I’ll work inside and you work outside. People inside (= working for) the White House get an us versus them mentality.\nIf you get inside an idea or someone’s mind, you understand the idea or the person: He tried to get inside her mind. inside of\nIf you do something inside of a particular time, you do it using slightly less than that amout of time: I should be back inside of two hours.\n(of information) known only by people in a group, organization, or company; secret: Maloney had inside information about the investigation.\nAdd to word list\nAdd to word list\nwithin or working for a company or organization: They had been helped by someone working inside the firm.\n(also inside of) if you do something or something happens inside (of) a particular time or limit, you do it or it happens in less than that amount of time: The work should be finished inside a week.\nobtained by someone in a group, organization, or company and therefore involving special or secret knowledge: He was able to give me inside knowledge on the company's finances.\nin or employed by a company or organization: As expected, the inside candidate was appointed.\nhave the inside track\nto have a special position within an organization, or a special relationship with a person, that gives you advantages or information that other people do not have : She is said by analysts to have the inside track on how the industry works."}