{"id":194046,"name":"inspect","type":"verb","us_sound":"ɪnˈspekt","us_link":"../audio/i/inspect.mp3","uk_sound":"ɪnˈspekt","uk_link":"../audio/i/ukinsin029.mp3","content":"Add to word list\nAdd to word list\nC1 to look at something or someone carefully in order to discover information, especially about their quality or condition: After the crash both drivers got out and inspected their cars for damage.inspect something carefully She held the bank note up to the light and inspected it carefully. Synonyms\ncheck (EXAMINE)\ncheck something out (EXAMINE) informal\nexamine (LOOK AT CAREFULLY)\nperuse formal\nscan (LOOK)\nstudy (EXAMINE)\nsurvey (LOOK AT) formal\nThesaurus: synonyms, antonyms, and examples\nto look at someone or somethinglookLook over there! A rainbow!watchI sat by the window and watched people walking past.glanceShe glanced around the room to see who was there.peepShe peeped through the curtains to see what was happening.peekHe peeked inside the box.stareDon't stare at people like that - it's rude.\nSee more results »\nto officially visit a place or a group of people in order to check that everything is correct and legal: An official from the Department of Health will be inspecting the restaurant this afternoon. The King inspected the troops.\n[ T often passive ] US (UK survey) If a building is inspected, it is examined carefully by a specially trained person, in order to discover if there is anything wrong with its structure.\nMore examplesFewer examplesTwo official-looking men came to inspect the house.She gave a little whimper as the vet inspected her paw.Stewards will be inspecting the race track at 9.00.She seemed to be inspecting my face for any sign that I was tricking her.The police experts inspected the crime scene thoroughly before leaving.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTesting, checking and experimenting\nAdd to word list\nAdd to word list\nto look at something or someone carefully in order to discover information, esp. about quality or condition: After the accident both drivers got out and inspected their cars for damage.\nIf an official person inspects a thing, place, or a group of people, the official looks carefully in order to make certain the thing, place, or group is in good condition and that rules are being obeyed: Someone from the Health Department will inspect the restaurant this afternoon.\nAdd to word list\nAdd to word list\nto look at something carefully in order to check its quality or condition: Inspect the goods carefully before you accept delivery of them.inspect (sth) for sth There is a process to force gas companies to inspect for leaks more frequently.\nHR, WORKPLACE to officially visit a building or organization in order to check that everything is correct and legal: They did a two-day, on-site survey to inspect the facility. The premises are inspected twice a year by the Trading Standards Officer."}