{"id":194052,"name":"inspection","type":"noun","us_sound":"ɪnˈspek.ʃən","us_link":"../audio/i/inspection.mp3","uk_sound":"ɪnˈspek.ʃən","uk_link":"../audio/i/ukinsin030.mp3","content":"Add to word list\nAdd to word list\nC1 the act of looking at something carefully, or an official visit to a building or organization to check that everything is correct and legal: on closer inspection Her passport seemed legitimate, but on closer inspection, it was found to have been altered.carry out/make an inspection She arrived to carry out/make a health and safety inspection of the building.\nUS and Australian English (UK survey) an examination of the structure of a building by a specially trained person See also\nsurvey noun (EXAMINING) UK\nMore examplesFewer examplesThe customs officials made us go through the whole rigmarole of opening up our bags for inspection.A close inspection revealed minute cracks in the aircraft's fuselage and wings.A pitch inspection will determine whether or not the match will be played.There will be a full investigation into the cause of the crash.A routine inspection revealed several faults with the engine.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTesting, checking and experimenting\nAdd to word list\nAdd to word list\nthe act of looking at something carefully in order to discover information: [ U ] At first she suspected that the letter was a forgery, but on closer inspection (= looked at more carefully), it appeared to be genuine.\nAn inspection is also a careful examination by an official to make certain that something is in good condition, or that rules are being obeyed: [ C ] He made an inspection of the elevators in the building.\nAdd to word list\nAdd to word list\nthe act of looking at something carefully to check its quality or condition: carry out/make an inspection Normally you will carry out an inspection of the goods as soon as possible after delivery. a close/detailed/thorough inspectionon closer/close inspection The goods looked fine, but, on closer inspection, several items were found to be faulty. Please present your ID for inspection when entering the building.\nHR, WORKPLACE an official visit to a building or organization to check that everything is correct and legal: carry out/make/conduct an inspection The architect proposes to carry out an inspection of the building.a routine/regular/surprise inspection They found contamination on some equipment during a routine inspection in October. The premises are subject to a full inspection by Council officers each year.fail/pass an inspection The hospital must first pass an inspection. a health and safety inspection When you're buying a house, you need to get a house inspection done first, to make sure the house is in good condition."}