{"id":194089,"name":"inspire","type":"verb","us_sound":"ɪnˈspaɪr","us_link":"../audio/i/eus72451.mp3","uk_sound":"ɪnˈspaɪər","uk_link":"../audio/i/ukinspe005.mp3","content":"inspire verb\n(GIVE AN IDEA OR FEELING)\nAdd to word list\nAdd to word list\nB2 [ T ] to make someone feel that they want to do something and can do it: His confident leadership inspired his followers. [ + to infinitive ] After her trip to Venezuela, she felt inspired to learn Spanish.\nB2 [ T ] to make someone have a particular strong feeling or reaction: She inspires great loyalty among her followers.inspire someone with something The captain's heroic effort inspired them with determination.\nB2 [ T ] to give someone an idea for a book, film, product, etc.: a piece of music inspired by dolphin sounds The design of the car has inspired many imitations.\nMore examplesFewer examplesAn austere man of unquestioned moral rectitude, Nava inspired deep devotion in those who worked for him.The fire in her speech inspired everyone.He inspired respect and devotion from his pupils.She has a faculty for inspiring confidence in people.His speech was intended to inspire party members.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\ncheer\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave the way idiom\npep talk\npermit\nprepare\nprepare the ground idiom\nspur\nstimulus\nurge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiring feelings in others\nInspiration and inspiring\ninspire verb\n(BREATHE IN)\n[ I or T ]\n&#160; medical, biology\n&#160; specialized to breathe in: When you inspire, you draw air into your lungs. The concentration of oxygen in inspired anesthetic gases should never be less than 21%.\nSMART Vocabulary: related words and phrases\nAnimal physiology: breathing & stopping breathing\naerobic\nanaerobic respiration\nasphyxia\nasphyxiation\nbreathable\nbreathlessly\ndraw breath phrase\nheave\npuff\nshallow\nshortness\nsigh\nsleep apnoea\nsmother\nsnuffly\nstrangle\nstrangulate\nsuffocatingly\nthrottle\nwinded\nSee more results »\nRelated word\ninspirer\nAdd to word list\nAdd to word list\nto fill someone with confidence and desire to do something: She inspired her students to do the best they could.\nIf something or someone inspires something else, it causes or leads to it: A successful TV program inspires many imitations."}