{"id":194134,"name":"instance","type":"noun","us_sound":"ˈɪn.stəns","us_link":"../audio/i/instance.mp3","uk_sound":"ˈɪn.stəns","uk_link":"../audio/i/ukinspe012.mp3","content":"Add to word list\nAdd to word list\nC1 a particular situation, event, or fact, especially an example of something that happens generally: instance of There have been several instances of violence at the school.in this instance I don't usually side with the management, but in this instance I agree with what they're saying.\nMore examplesFewer examplesThere have already been several instances of deadly violence in the past few weeks involving returning refugees.He noted that there have been instances in earthquakes when survivors were found after days of looking.Over a third of women who replied to the questionnaire cited instances of sexual harassment in the workplace.These companies don't have the people resources; in certain instances, they don't have the expertise.Over 20 instances of sexual misconduct are currently being investigated.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\njob\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\nIdiom\nfor instance\nto give something as an example: She argued the need for legal reform and instanced several recent cases with grossly unfair verdicts. Synonyms\nexemplify\nillustrate\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ninstantiate\nmirror\nMr\nMrs\non-brand\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymbolize\nsymptom\nterritory\ntoken\ntranslate\nSee more results »\nAdd to word list\nAdd to word list\na particular situation, event, or fact: There were several instances of computer failure before we got the system to work properly. Usually this kind of skin condition is caused by a food allergy, but in this instance it may be caused by the medicine you are taking. Can you tell us a little about your background? For instance (= As an example), where were you born?"}