{"id":194141,"name":"instant","type":"adjective","us_sound":"ˈɪn.stənt","us_link":"../audio/i/instant.mp3","uk_sound":"ˈɪn.stənt","uk_link":"../audio/i/ukinspe013.mp3","content":"Add to word list\nAdd to word list\nB2 happening immediately, without any delay: instant access This type of account offers you instant access to your money.instant success Contrary to expectations, the film was an instant success.\nInstant food or drink is dried, usually in the form of a powder, and can be prepared very quickly by adding hot water: instant coffee/soup\nMore examplesFewer examplesI'm afraid Dad took an instant dislike to this new boyfriend of yours.Some people expect instant gratification .I felt an instant aversion to his parents.There's no instant way of finding a cure - it's just a process of trial and error.I can't stand instant coffee.\nSMART Vocabulary: related words and phrases\nImmediately\n(right) off the bat idiom\na stitch in time (saves nine) idiom\nado\nat/in one fell swoop idiom\nbat\ncuff\ndeferrable\ndirectly\nfell\nglance\ninstantaneous\ninstantaneously\ninstantly\nno sooner said than done idiom\nnon-deferrable\nsoon\nstraight\nswiftly\nswiftness\nwaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\nan extremely short period of time: in an instant In an instant her mood had changed.for an instant The startled boy froze for an instant, then fled.this instant \"Stop that noise this instant (= now)!\"the instant I'll call you the instant (= as soon as) I get home. Synonyms\njiffy informal\nmoment (SHORT TIME)\nsplit secondCompare\nin a trice mainly UK informal\nSMART Vocabulary: related words and phrases\nShort in time\nabbreviated\nat a moment's/two hours'/three weeks', etc. notice idiom\nawhile\nbe short notice idiom\nbite-sized\nblink\nbout\nbrief\nbriefly\ndose\nin abbreviated form\nin small doses idiom\nin the blink of an eye idiom\njiffy\nmicro-moment\nshortness\nsnatched\nsplit second\ntransient\ntransiently\nSee more results »\nAdd to word list\nAdd to word list\na very short moment of time, or a particular point in time: At that instant, someone knocked on the door. Call me the instant you get home (= as soon as you get to your home).\nhappening immediately: I took an instant liking to him.\nAn instant food or drink is one, usually in dried or powdered form, that can be prepared easily and quickly, esp. by adding hot water: instant coffee\nAdd to word list\nAdd to word list\nhappening immediately, without any delay: This type of bank account gives you instant access to your money. Following a need for instant results, more health care providers are starting to offer online access."}