{"id":194283,"name":"instrument","type":"noun","us_sound":"ˈɪn.strə.mənt","us_link":"../audio/i/instrument.mp3","uk_sound":"ˈɪn.strə.mənt","uk_link":"../audio/i/ukinstr006.mp3","content":"instrument noun [C]\n(MUSIC)\nAdd to word list\nAdd to word list\nA2 (also musical instrument) an object, such as a piano, guitar, or drum, that is played to produce musical sounds: play an instrument Which instrument do you play?\nMore examplesFewer examplesWhen a piece of music is recorded, each instrument is recorded separately on a 24- or 48-track tape.If you want to learn to play a musical instrument, it might be a good idea to begin on something simple.This wooden instrument is the ancestor of the modern metal flute.The family all play instruments - they're all very musical.The trumpet and trombone are brass instruments.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning fork\ntuning peg\nukulele\nunpitched\nunplugged\nSee more results »\ninstrument noun [C]\n(TOOL)\nC1 a tool or other device, especially one without electrical power, used for performing a particular piece of work: surgical instruments instruments of torture The man's injuries had obviously been caused by a blunt instrument.\na device used for measuring speed, height, etc. in vehicles, especially aircraft: the instrument panel The lightning had damaged the plane's instruments, and they weren't giving any readings.\nC2 formal a way of achieving or causing something: instrument of He saw the theatre as an instrument of change - a way of forcing people to consider social and political issues.\nMore examplesFewer examplesThe main instruments are in the centre of the control panel.The doctor used a sharp instrument to dig a piece of glass out of my finger.Lewis estimates that 40 to 80 percent of dentists actually autoclave their instruments as they should.The museum has a large collection of vicious medieval torture instruments.The instrument panel was brightly illuminated.\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\nfan\ngadget\ngrabber\nhardware\nmachine tool\npower tool\nprecision instrument\nspacer\nspreader\ntoolbox\ntoolkit\nutensil\nutility belt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe interior of vehicles\nMeasuring, weighing, & counting devices\nWays of achieving things\ninstrument noun [C]\n(FINANCE)\na type of investment in a company or in government debt that can be traded on the financial markets: debt instrument They trade in the debt instruments of developing countries.financial instrument increasingly complex financial instruments\ninstrument noun [C]\n(MUSIC)\nAdd to word list\nAdd to word list\nan object, such as a piano, guitar, or flute, which is played to produce musical sounds: He plays saxophone, trumpet, and several other instruments.\ninstrument noun [C]\n(TOOL)\na tool or other device used for doing a particular piece of work: surgical instruments\nAdd to word list\nAdd to word list\nFINANCE a financial asset that can be bought or sold, such as a bond, share, or other security : Fixed-income instruments include bonds, Treasury bills, and notes. This will still leave sufficient funds in low-risk instruments such as the debt market. Hedging instruments such as futures contracts are priced in dollars.\na tool, especially one without electrical power, used for performing a particular piece of work: surgical/precision/optical instrument The first optical instruments were telescopes.\na piece of equipment used for measuring speed, height, etc. in vehicles, especially aircraft: flight instruments\na way of achieving or causing something: The main instrument of change was the bank credit card.\nLAW a legal document: This is a legal instrument and both claims will have to be decided by the English High Court. See also\ndebt instrument\nequity instrument\nmoney-market instrument\nnegotiable instrument\nstatutory instrument\ntrust instrument"}