{"id":194219,"name":"institute","type":"noun","us_sound":"ˈɪn.stə.tuːt","us_link":"../audio/i/eus75808.mp3","uk_sound":"ˈɪn.stɪ.tʃuːt","uk_link":"../audio/i/ukinspe026.mp3","content":"Add to word list\nAdd to word list\nB2 an organization where people do a particular type of scientific, educational, or social work, or the buildings that it uses: the Massachusetts Institute of Technology\nMore examplesFewer examplesThe institute derives all its money from foreign investments.The institute will invest 5 million in the project.The state of Michigan has endowed three institutes to do research for industry.The research institute is based in Cambridge.The institute awards three research fellowships each year.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nto start or cause a system, rule, legal action, etc. to exist: She is threatening to institute legal proceedings against the hospital. Opposite\nabolish\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwaste\nwheel\nSee more results »\ninstitute verb [T]\n(START)\nAdd to word list\nAdd to word list\nto put into effect; cause to be used: These are some of the safety guidelines we’ve instituted in our hotels.\ninstitute noun [C]\n(ORGANIZATION)\nan organization whose purpose is to advance the study of a particular subject: The National Institutes of Health fund medical research in many areas.\nAdd to word list\nAdd to word list\nan organization where people do a particular kind of scientific, educational, etc. work, or the buildings which it uses : the Massachusetts Institute of Technology\nan organization of people who all do the same kind of work: the Institute of Directors\nto start or introduce a system, rule, legal action, etc.: They promised to institute new guidelines in the wake of the scandal."}