{"id":194235,"name":"institutionalization","type":"noun","us_sound":"ˌɪn.stɪˌtuː.ʃən.ə.ləˈzeɪ.ʃən","us_link":"../audio/i/cdo0318usinst2499.mp3","uk_sound":"ˌɪn.stɪˌtjuː.ʃən.ə.laɪˈzeɪ.ʃən","uk_link":"../audio/i/epd15249.mp3","content":"institutionalization noun [U]\n(OF PERSON)\nAdd to word list\nAdd to word list\nthe act of sending someone to live in an institution (= a place such as a hospital): the unjustified institutionalization of people with disabilities\nthe process of someone becoming institutionalized (= unable to live independently because they are used to living in an institution): The pathology of institutionalization has been acknowledged for decades.\nMore examplesFewer examples Prompt clinical intervention can delay the need for institutionalization.He had an altercation with the police that led to institutionalization in the Nevada Mental Health Institute.These patients may require high-level care or institutionalization through their adult years. What I see happening to him is institutionalization, as opposed to giving him the support he needs for the real world.\nSMART Vocabulary: related words and phrases\nAccommodating people\naccommodate\nbillet\nboard and lodging\nboarding and lodging\ncamp\ndeinstitutionalize\nfull board\nmodified American plan\nnon-residential\nnoninstitutionalized\nplacement\nput\nput something away\nresettle\nresettlement\nroom and board\nseat\nself-catering\nsettle\nsleep\nSee more results »\ninstitutionalization noun [U]\n(OF CUSTOM)\nthe process of becoming a permanent or respected part of a society, system, or organization: the institutionalization of education as a national system overseen by the state\nMore examplesFewer examplesthe institutionalization of paranoia and conspiracy thinking in the collective mindThe institutionalization of pop and rock drives me crazy. It was supposed to be disposable.the institutionalization of a more systemic approach to leadership\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\nmainline\northodox\nquotidian\nregularity\nregularization\nregularize\nround\nroutinely\nstd\nstock\nthe/your average bear idiom\nunspectacular\nSee more results »\nSee\ninstitutionalize"}