{"id":194405,"name":"insurance","type":"noun","us_sound":"ɪnˈʃɝː.əns","us_link":"../audio/i/insurance.mp3","uk_sound":"ɪnˈʃɔː.rəns","uk_link":"../audio/i/ukinsur001.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] an agreement in which you pay a company money and they pay your costs if you have an accident, injury, etc.: car/travel insurancetake out insurance I'll need to take out extra car insurance for another driver. The insurance doesn't cover you for (= include) household items.claim on the insurance When my bike was stolen, I claimed on the insurance. See also\ncomprehensive insurance\nhealth insurance\nlife insurance\nNational Insurance\nsocial insurance\nterm insurance\nthird-party insuranceCompare\nassurance (INSURANCE) UK\n[ C or U ] something that protects against the possible damaging effects of something: insurance against Households are stockpiling food as insurance against price rises.insurance policy Many people are applying for overseas passports as an insurance policy in case of future chaos. Owning gold was seen as an insurance against an unknown future.\nMore examplesFewer examplesIt is a legal requirement for drivers to have car insurance.The treatment is expensive, so we're lucky that our insurance covers most of it. It took the insurance company months to settle my claim.It's worth your while taking out travel insurance before you travel.Investors were buying oil as insurance against the falling dollar.The fact that there has been no major attack in three years is no insurance against future attacks.Fish from native populations were added to the streams to provide a kind of insurance policy for the survival of the fish.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nassessor\nassurance\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefending and protecting\nIn sport, an insurance run, point, goal, etc. is one that you score when you already have a small lead to make it more difficult for the other team to catch up: Kelly scored a huge insurance goal to put the Puffins up by 2, with 3 minutes left. They might regret not being able to score an insurance run in that inning.\nMore examplesFewer examplesHe hit a wonderful insurance point two minutes into injury time.The wind blowing the ball off the tee was a reminder that Ireland needed more insurance points.\nSMART Vocabulary: related words and phrases\nSports & games generally\nbattleship\nboard sport\nbuildering\nchoose\nchoose up sb/sth\nclassic\ncross-country\ndefensively\nhigh jinks\nland\nline\nmulti-sport\nparasport\nparkour\npickup\npre-game\nsnooker\nsport\nthe first person\nTTRPG\nSee more results »\nAdd to word list\nAdd to word list\nthe agreement in which you pay a company money and the company pays the cost if you have an accident, injury, or loss: fire/health/life insurance\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; INSURANCE an agreement in which you pay a company money, either in one payment or in regular payments, and they pay your costs, for example, if you lose or damage something, or have an accident, injury, etc.: car/holiday/home/health, etc. insurance an insurance plan/policy to buy/sell insurance insurance contributions/payments/premiums insurance against sth You can take out insurance against employee injury.offer/provide/refuse insurance Have you ever been refused car insurance in the past? arrange/obtain/take out insurance You must make sure you take out insurance on the contents of your house.have insurance Ensure you have sufficient insurance to cover the cost of replacing your valuables.be covered by (the) insurance Unfortunately, stolen personal belongings are not covered by the insurance.claim on the/your insurance I claimed on the insurance for the damage to the furniture.insurance pays for sth/covers sb/sth This insurance covers the cost of their mortgage but they are considering more life cover. Most insurances won't cover you if you take part in any dangerous sporting activities.\n[ U ]\n&#160; INSURANCE the business of selling insurance: He's worked in insurance for over 20 years. the insurance industry an insurance company\n[ U ]\n&#160; INSURANCE money that is paid to an insurance company: They ask for 8% extra from customers who pay insurance by direct debit instead of as a lump sum.\n[ U ]\n&#160; INSURANCE money that is paid by an insurance company: I had to cancel the trip, but I got back nearly $1000 in insurance.\n[ U or plural ]\n&#160; STOCK MARKET shares in insurance companies: Insurances were given a new lease of life as the market's strength helped to allay solvency margin fears. See also\naccident insurance\nagreed value insurance\nall-loss\nall-risks\nannuity insurance\nautomobile insurance\naviation insurance\nblanket insurance\nblock insurance\nbuildings and contents insurance\nbusiness interruption\nbusiness liability insurance\nbusiness life and health insurance\ncar insurance\ncasualty insurance\ncomprehensive insurance\nconsumer credit insurance\ncontingency insurance\ncredit insurance\ndeposit insurance\ndisability insurance\ndouble insurance\nengineering insurance\nexport insurance\nfidelity insurance\nfire insurance\nfloating policy\nflood insurance\ngeneral insurance\ngroup insurance\nhealth insurance\nhome insurance\nhomeowner's insurance\nhousehold insurance\nincome insurance\nincome protection insurance\nindustrial injuries insurance\nliability insurance\nlife insurance\nmarine insurance\nmedical insurance\nmortgage indemnity insurance\nmortgage protection insurance\nmotor insurance\nnational insurance\nopen insurance\nproperty and liability insurance\nself-insurance\nsocial insurance\nterm insurance\nthird party, fire and theft\ntravel insurance\nunemployment insurance\nvalued insurance\nwhole-of-life"}