{"id":194408,"name":"insure","type":"verb","us_sound":"ɪnˈʃʊr","us_link":"../audio/i/ensure.mp3","uk_sound":"ɪnˈʃɔːr","uk_link":"../audio/i/epd32142.mp3","content":"Add to word list\nAdd to word list\n[ I or T, usually + adv/prep ] to protect yourself against risk by regularly paying a special company that will provide a fixed amount of money if you are killed or injured or if your home or possessions are damaged, destroyed, or stolen: be insured for The house is insured for two million dollars.be insured against All our household goods are insured against accidental damage. [ + obj + to infinitive ] I'm not insured to drive his car.\n[ T ] to provide insurance for someone or something: They refused to insure us because they said we're too old. Many companies won't insure new or young drivers.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nassessor\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nPhrasal verb\ninsure against something\ninsure verb\n(MAKE CERTAIN)\nAdd to word list\nAdd to word list\n(also ensure) to make something certain, or to be certain about something: [ + (that) clause ] Because of the importance of the game, we wanted to insure (that) it would be televised. [ T ] We had reporters check to insure the accuracy of the story.\ninsure verb\n(PROTECT)\n[ T ] to protect yourself or your property against damage or loss by making regular payments to a company that will pay for the damage or loss if it happens: We’ve insured our house for $100,000.\nAdd to word list\nAdd to word list\nto protect yourself against risk by buying insurance from a company that will provide an agreed amount of money if a particular event happens, for example if you are killed or injured or if your possessions are damaged or stolen: insure sb/sth/yourself against sth We hadn't insured the bicycles against theft. insure sth for sth The antique dealer said we should insure the desk for at least £2,000.\nto provide insurance for someone or something: insure sb/sth against sth We can insure you against most of the risks involved in owning and operating a boat. Phrasal verb\ninsure against sth"}