{"id":194492,"name":"intangible","type":"adjective","us_sound":"ɪnˈtæn.dʒə.bəl","us_link":"../audio/i/intangible.mp3","uk_sound":"ɪnˈtæn.dʒə.bəl","uk_link":"../audio/i/ukinsur011.mp3","content":"Add to word list\nAdd to word list\nimpossible to touch, to describe exactly, or to give an exact value: She has that intangible quality which you might call charisma. intangible assets such as goodwill\nMore examplesFewer examplesThe university would also have to archive other items, intangible ones, that lingered only in the digital realm - blogs and songs and online chats.Another intangible benefit of the games is thousands of volunteers coming together around a common goal. Management evaluates people for promotions, benefits, or other rewards, whether tangible or intangible.\nSMART Vocabulary: related words and phrases\nDifficult to understand\nabstruse\nabstrusely\nambiguity\nambiguous\nambiguously\nequivocal\nequivocally\nesoteric\nesoterically\nfathomless\ninvolved\nit beats me idiom\nit's all Greek to me idiom\nlabyrinthine\nlost\nunintuitively\nunreadable\nverbiage\nverbosely\nverbosity\nSee more results »\nRelated word\nintangibly\nintangible noun [C usually plural]\nsomething that exists but that cannot be touched, exactly described, or given an exact value: Common sense and creativity are some of the intangibles we're looking for in an employee. His ability to inspire and lead players is an intangible that is difficult to quantify.\nMore examplesFewer examplesIntangibles like communication, collaboration, and leadership affect a management team.The jump in consumer confidence is based on the intangible of improved expectation. Intangibles such as name recognition and loyalty are important.\nSMART Vocabulary: related words and phrases\nDifficult to understand\nabstruse\nabstrusely\nambiguity\nambiguous\nambiguously\nequivocal\nequivocally\nesoteric\nesoterically\nfathomless\ninvolved\nit beats me idiom\nit's all Greek to me idiom\nlabyrinthine\nlost\nunintuitively\nunreadable\nverbiage\nverbosely\nverbosity\nSee more results »\nAdd to word list\nAdd to word list\ninfluencing you but not able to be seen or physically felt: There is the intangible benefit of playing a home game before a friendly crowd. intangible noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈtæn·dʒə·bəl/\nCommon sense and creativity are some of the intangibles we’re looking for in the people we hire.\nAdd to word list\nAdd to word list\nused about a feeling or quality that does not exist in a physical way, or that is difficult to describe: intangible benefit/reward He pointed to some of the intangible benefits of the job, such as knowing that you are making a contribution to society. The CEO had that intangible quality that we call charisma.\nACCOUNTING, FINANCE used about something that has value for a business, although it does not exist in a physical way: intangible capital/property/value Examples of intangible property include bonds, shares, copyrights, and patents.\nsomething that does not exist in a physical way, or that is difficult to describe: The list of requirements for the job includes intangibles such as self-reliance, persuasiveness, etc.\nACCOUNTING, FINANCE →\nintangible asset : Never underestimate the value of intangibles for your business."}