{"id":195744,"name":"internalize","type":"verb","us_sound":"ɪnˈtɝː.nəl.aɪz","us_link":"../audio/i/usinter010.mp3","uk_sound":"ɪnˈtɜː.nəl.aɪz","uk_link":"../audio/i/ukinter128.mp3","content":"Add to word list\nAdd to word list\nto accept or absorb an idea, opinion, belief, etc. so that it becomes part of your character: He had not expected the people so readily to internalize the values of democracy.\npsychology\n&#160; specialized If you internalize your emotions or feelings, you do not allow them to show although you think about them: Many women tend to internalize their anxiety and distress.\nfinance &amp; economics\n&#160; specialized to include something when calculating the cost of a product or activity: A fair energy market would include a greater emphasis on internalizing environmental costs. You will get more willingness to sue when the costs of trial aren't internalized by the party making the decision to go to trial.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot showing or feeling emotions\nControlling emotions\nCosts & expenses\nRelated word\ninternalization\nAdd to word list\nAdd to word list\nto accept an idea, attitude, belief, etc., so that it becomes part of your character: He had not expected the people so readily to internalize the values of democracy.\nIf you internalize your emotions or feelings, you do not express them openly: He usually internalized his anger, rather than expressing it to anyone.\nAdd to word list\nAdd to word list\nECONOMICS, PRODUCTION to include a cost during the process of manufacturing or producing something: The cost of pollution and other effects on the environment needs to be internalized and reflected in the price of goods or services, as well as normal production costs."}