{"id":195191,"name":"interesting","type":"adjective","us_sound":"ˈɪn.trɪ.stɪŋ","us_link":"../audio/i/interesting.mp3","uk_sound":"ˈɪn.tres.tɪŋ","uk_link":"../audio/i/ukinter018.mp3","content":"Add to word list\nAdd to word list\nA1 Someone or something that is interesting keeps your attention because he, she, or it is unusual, exciting, or has a lot of ideas: She's quite an interesting woman. She's got some very interesting things to say on the subject. It is always interesting to hear other people's point of view. Oh, I didn't know they were married - that's interesting.\nThesaurus: synonyms, antonyms, and examples\ngiving pleasure and holding your attention goodIt's a good film overall.enjoyableWe had an enjoyable time with Bob and Helen.pleasant The weather is pleasant but not too hot.interestingThe history of the place was really interesting.niceHave a nice day!\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ninterestinginterestingShe's such an interesting person.absorbingIt was a very absorbing film.grippingI found the book absolutely gripping - I couldn't put it down.rivetingThe performance was riveting.compellingIt was a compelling story.fascinatingThe history of the place was absolutely fascinating.\nSee more results »\nhumorous strange or different: That's an interesting looking hat you're wearing, Neil!\nMore examplesFewer examplesThere was an interesting article on vegetarianism in the paper yesterday.Have you been doing anything interesting lately?How can we make science lessons more interesting?I'm always looking for interesting new recipes.She has a lot of interesting ideas, but they're not very practical.\nSMART Vocabulary: related words and phrases\nExciting and interesting\nabsorbing\nabsorbingly\naction-packed\nadventurous\nalley\neye-catchingly\nfancifully\nfascinating\nfascinatingly\nfascinator\npulsating\npunchy\nracy\nriveting\nrivetingly\nspectacularly\nwith bells on idiom\nzhuzh\nzing\nzingy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural\nAdd to word list\nAdd to word list\nholding one’s attention: An interesting thing happened on the trip back."}