{"id":194588,"name":"intelligent","type":"adjective","us_sound":"ɪnˈtel.ə.dʒənt","us_link":"../audio/i/intelligent.mp3","uk_sound":"ɪnˈtel.ɪ.dʒənt","uk_link":"../audio/i/ukinsur025.mp3","content":"Add to word list\nAdd to word list\nB1 showing intelligence, or able to learn and understand things easily: He is a highly intelligent person who can think outside the box. She would like a partner with whom she can have an intelligent conversation. Helen had a few intelligent things to say on the subject.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nMore examplesFewer examplesShe's obviously very intelligent, but her lectures are difficult to follow.They are searching for intelligent life forms in other solar systems.Some people object to streaming because it gives an unfair advantage to intelligent children.These particular dinosaurs were large-brained and more intelligent than most.Man is still far more intelligent than the cleverest robot.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\nRelated word\nintelligently\nAdd to word list\nAdd to word list\nshowing intelligence, or the ability to understand and learn well: a highly intelligent woman intelligently adverb us/ɪnˈtel·ə·dʒənt·li/\nShe writes intelligently about the life of Mary Baker Eddy.\nAdd to word list\nAdd to word list\nable to learn and understand things quickly and easily: A lot of thoroughly intelligent, sensible people have fallen for the salesman's charm. a highly intelligent businessperson an intelligent conversation/decision/question\nIT designed to be able to react to changes or different situations in a similar way to humans: intelligent software intelligent systems"}