{"id":195186,"name":"interested","type":"adjective","us_sound":"ˈɪn.trɪ.stɪd","us_link":"../audio/i/interested.mp3","uk_sound":"ˈɪn.tres.tɪd","uk_link":"../audio/i/ukinter016.mp3","content":"interested adjective\n(FEELING INVOLVED)\nAdd to word list\nAdd to word list\nA2 wanting to give your attention to something and discover more about it: He didn't seem very interested in what I was saying. She's at that age where she's starting to get interested in boys. I'd be interested to hear more about your work. \"Really?\" he said, with an interested look on his face. Yes, I'd be very interested in knowing more about the services your firm offers. Opposite\nuninterested\nThesaurus: synonyms, antonyms, and examples\ninterested in somethinginterestedI've always been interested in the origins of blues music.fascinatedI was fascinated to hear that he had lived in Madagascar for years. spellboundThe audience was spellbound as he attempted his daring escape from the water tank.absorbed inI was so absorbed in the novel that I completely missed my tram stop.engrossedThey were so engrossed with the puzzle they missed my phone call.wrapped upShe's been completely wrapped up in her home life since getting married.\nSee more results »\nMore examplesFewer examplesShe's not especially interested in sport.Make sure you visit the maritime museum if you're interested in anything to do with ships or seafaring.Here's some news you might be interested in.Applicants interested in applying for the position should submit their CVs to the Anatomy Department no later than February 15.Do you really want to join the scheme, or were you just pretending to be interested?\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmood\nnuts\nomnivorous\nomnivorously\non the edge of your seat idiom\nzestful\nzestfully\nSee more results »\ninterested adjective\n(HAVING A CONNECTION)\nrelating to a person or group who has a connection with a particular situation, event, business, etc.: All interested parties (= people who are involved) are advised to contact this office.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\ncatch\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nre-engagement\nSee more results »\nAdd to word list\nAdd to word list\nwanting to give your attention to something or learn more about it: He didn’t seem interested in coming. [ + to infinitive ] I’d be interested to learn why he likes her."}