{"id":195198,"name":"interface","type":"noun","us_sound":"ˈɪn.t̬ɚ.feɪs","us_link":"../audio/i/eus72499.mp3","uk_sound":"ˈɪn.tə.feɪs","uk_link":"../audio/i/ukinter020.mp3","content":"Add to word list\nAdd to word list\na connection between two pieces of electronic equipment, or between a person and a computer: My computer has a network interface, which allows me to get to other computers. The new version of the program comes with a much better user interface (= way of showing information to a user) than the original.\na situation, way, or place where two things come together and affect each other: the interface between technology and tradition We need a clearer interface between management and the workforce.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\n[ T ]\n&#160; computing\n&#160; specialized to connect two or more pieces of equipment, such as computers: The computers must be properly interfaced.\n[ I ] to communicate with someone, especially in a work-related situation: We use email to interface with our customers.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nCommunicating & keeping in touch\nAdd to word list\nAdd to word list\nthe place where two systems come together and have an effect on each other, or a connection between two computers or between a person and a computer: Amphibians live at the interface of land and sea. To simplify software, you improve its interface.\nto communicate or cause someone or something to communicate: [ I ] Neighborhood groups here interface very well with police.\nAdd to word list\nAdd to word list\nIT the way in which information is made available to the user on the screen of a computer, mobile phone, etc.: A user-friendly shopping interface is essential if you want to encourage customers to buy online. a user/computer/software interface\nthe point at which two different systems, activities, etc. have an influence on each other: interface between sth and sth the interface between business and Governmentinterface with sth The decision is based on the need to create a more efficient interface with our customers.\nIT a connection between two pieces of electronic equipment: a network interface card/controller\nSee also\ngraphical user interface\nGUI\n[ I ] if two people, companies, systems, etc. interface, they are in contact and work together with each other: interface with sb/sth All workers at the airport should be willing to interface with local law-enforcement personnel as and when necessary.\n[ I or T ]\n&#160; IT if a computer, mobile phone, etc. interfaces with another system or piece of equipment, or is interfaced with it, it can be connected to or used with it: interface (sth) with sth Wireless Application Protocols are standards that govern how mobile phones interface with the World Wide Web."}