{"id":196457,"name":"intervention","type":"noun","us_sound":"ˌɪn.t̬ɚˈven.ʃən","us_link":"../audio/i/eus72557.mp3","uk_sound":"ˌɪn.təˈven.ʃən","uk_link":"../audio/i/ukinter321.mp3","content":"Add to word list\nAdd to word list\nC2 [ C or U ] the action of becoming intentionally involved in a difficult situation, in order to improve it or prevent it from getting worse: Half the people questioned said they were opposed to military intervention in the civil war. Repeated interventions on the currency markets failed to prevent the currency's value falling.\n[ C ]\n&#160; medical, psychology\n&#160; specialized a meeting at which someone with a drug or alcohol problem is asked by family members, friends, or health workers to accept the fact that they have a problem and is encouraged to get treatment: A medical professional can advise family members of the most appropriate times to stage an alcohol intervention.\n[ C ] an occasion when someone's friends or family speak to them about a problem or situation because the person's behaviour is unreasonable or harmful: humorous He's been playing that video game all day. I think it's time for an intervention.\nMore examplesFewer examplesThere is still some hope that the economic blockade will work and make military intervention unnecessary.The government was reluctant to sanction intervention in the crisis.The border dispute was used as a pretext for military intervention.England have fallen so far behind in the championship that their only hope of victory is divine intervention.Imposing sanctions is a moderate action when you consider that the alternative is military intervention.His manager staged an intervention, forcing him into one of two rehab stays.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\ncatch\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nre-engagement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddiction\nDrug addiction\nMedical treatment: general words\nSee\nintervene\nAdd to word list\nAdd to word list\nthe act or fact of becoming involved intentionally in a difficult situation: [ C ] The intervention by UN troops prevented fighting from breaking out.\nAdd to word list\nAdd to word list\ninvolvement in a difficult situation in order to improve it or prevent it from getting worse, or an occasion when this is done: intervention in sth Any intervention in the currency markets has to be followed by a tightening of monetary policy.government/regulatory/state intervention This comprehensive program is aimed at reducing state intervention in the economy."}