{"id":194873,"name":"interception","type":"noun","us_sound":"ˌɪn.t̬ɚˈsep.ʃən","us_link":"../audio/i/eus72480.mp3","uk_sound":"ˌɪn.təˈsep.ʃən","uk_link":"../audio/i/ukintem029.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] the action of stopping and catching something or someone before that thing or person is able to reach a particular place: the interception of enemy messagesinterception of They established a secure communications channel to prevent the interception of critical information.\n[ C ] in team sports, the action of catching, stopping, or taking control of the ball as it is being passed between two players of the opposing team: An interception gave Philadelphia the ball again in Dallas territory with one minute left in the half. He made two vital interceptions to block efforts in the final minutes.\nMore examplesFewer examplesWe authorize the interception of any phone line the target is using.Collaboration with other countries' spies and interception of communications are both common.Troy completed 67% of his throws for 587 yards and three scores, with no interceptions. An interception 40 yards out allowed the Argentine an unchallenged sprint to the line.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nsequester\nsequestration\nsnag\nsnatch\nsnatch at something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nRelated word\nintercept\nAdd to word list\nAdd to word list\n(esp. in football) the act of catching a ball intended for someone on the opposing team: He’s thrown 122 passes without an interception.\nAdd to word list\nAdd to word list\nthe act of stopping someone or something before they can get to a place: The IT engineer was accused of the illegal interception of private emails."}