{"id":194721,"name":"interactive","type":"adjective","us_sound":"ˌɪn.t̬ɚˈræk.tɪv","us_link":"../audio/i/eus72475.mp3","uk_sound":"ˌɪn.təˈræk.tɪv","uk_link":"../audio/i/ukintem021.mp3","content":"Add to word list\nAdd to word list\nB2 An interactive system or computer program is designed to involve the user in the exchange of information: an interactive game/video This is an interactive museum where children can actively manipulate the exhibits.\nC1 involving communication between people: interactive teaching methods\nMore examplesFewer examplesMany educational and instructional programs are interactive.The museum has many interactive exhibits.Teachers often supplement class discussions with interactive software.The museum has an interactive computer network that explains basic scientific themes.Interactive displays have attracted many new visitors to the museum.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nRelated word\ninteractively\nAdd to word list\nAdd to word list\ninvolving communication between people or reactions between things that work together: The ocean and the atmosphere form an interactive system.\nAn interactive computer program involves the user in the exchange of information while the computer is in operation: interactive software/technology interactively adverb us/ˌɪn·tərˈæk·tɪv·li/\nAdd to word list\nAdd to word list\nIT used to describe a system or computer program that is designed to allow the user to exchange information with it: Customers touch the screen on the interactive display to check if a product is in stock. We produce interactive games for small children.interactive with sb The program is interactive with the user.\nused to describe two things that affect each other when they are put together: be interactive with sth The level of service is interactive with the cost structure.\ninvolving communication between people: an interactive training workshop\ninteractively adverb uk/ˌɪntəˈræktɪvli/ us/-ṱɚ-/\nCustomers can buy products interactively through the website."}