{"id":194537,"name":"integrity","type":"noun","us_sound":"ɪnˈteɡ.rə.t̬i","us_link":"../audio/i/eus72464.mp3","uk_sound":"ɪnˈteɡ.rə.ti","uk_link":"../audio/i/ukinsur018.mp3","content":"integrity noun [U]\n(HONESTY)\nAdd to word list\nAdd to word list\nC2 approving the quality of being honest and having strong moral principles that you refuse to change: No one doubted that the president was a man of the highest integrity. someone's artistic, professional, etc. integrity approving\nsomeone's high artistic standards or standards of doing their job, and that person's determination not to lower those standards: Keen to preserve his artistic integrity, he refused several lucrative Hollywood offers.\nSee more\nMore examplesFewer examplesLord Fletcher, said the Bishop, was a man of unimpeachable integrity and character.His comments cast a slur on the integrity of his employees.Her probity and integrity are beyond question.I had credited them with more integrity than they showed.He was regarded as a man of absolute integrity.\nSMART Vocabulary: related words and phrases\nHonesty, openness & sincerity\nabove board\nanti-corruption\nartless\nartlessly\nartlessness\nhonestly\nhonourably\nin\nin all honesty/seriousness/truthfulness idiom\nin good faith idiom\njoking apart/aside idiom\nsincerely\nskinny\nspotless\nsqueaky-clean\nstainless\nstraight arrow idiom\nthe straight and narrow idiom\ntransparency\nupright\nSee more results »\nintegrity noun [U]\n(WHOLE)\nformal the quality of being whole and complete: A modern extension on the old building would ruin its architectural integrity.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nintegrity noun [U]\n(HONESTY)\nAdd to word list\nAdd to word list\nthe quality of being honest and having strong moral principles: He was a man of the highest personal integrity.\nintegrity noun [U]\n(UNITY)\nwholeness and unity: The integrity of the play would be ruined by changing the ending.\nAdd to word list\nAdd to word list\nthe quality of being honest and having strong moral principles that you refuse to change: He was a journalist of immense skill and integrity.\nthe quality of being whole and complete: They do not independently check the integrity of the data that companies send to them."}