{"id":195339,"name":"interim","type":"adjective","us_sound":"ˈɪn.t̬ɚ.ɪm","us_link":"../audio/i/eus72505.mp3","uk_sound":"ˈɪn.tər.ɪm","uk_link":"../audio/i/ukinter027.mp3","content":"Add to word list\nAdd to word list\nC2 temporary and intended to be used or accepted until something permanent exists: an interim solution An interim government was set up for the period before the country's first free election.\nThesaurus: synonyms, antonyms, and examples\ntemporarytemporaryThis is just a temporary solution.disposableI bought a disposable camera at the airport.makeshiftWe built a makeshift shelter under the trees.short-livedI had a few relationships at university, most of which were fairly short-lived.provisionalAfter the war, a provisional government was set up.\nSee more results »\nused to describe part of a company's business year, rather than the whole year: Directors declared an interim dividend of 30 cents.\nMore examplesFewer examplesThere will be an interim government to oversee the transition to democracy.The interim government is a mere cipher for military rule.The move is intended as an interim measure.The interim government was formed in 1990.An interim constitution was adopted in 1993.\nSMART Vocabulary: related words and phrases\nTemporary\nbe a nine days' wonder idiom\ncasual\ncasually\neddy\nephemeral\nfugacious\nfugitive\nhere\nhere today, gone tomorrow idiom\nimpermanence\nplaceholder\npro tem\nprovisional\nprovisionary\nprovisory\nsticking plaster\ntransient\ntransiently\ntransitorily\ntransitory\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nin the interim\nin the time between two particular periods or events: The new secretary starts in June, but in the interim we're having to type our own letters.\nSee more\nAdd to word list\nAdd to word list\ntemporary; intended for a short period only: an interim government\nthe time between two particular periods or events: I started writing two years ago, and other books on the subject have come out in the interim (= during this period).\nAdd to word list\nAdd to word list\nACCOUNTING, FINANCE used to describe something that relates to only part of a company's business year, rather than the whole year: Directors were forecasting an interim loss of over $3 million. interim results/figures/profits\nintended to be used or employed for a short time only: In a press release, the company announced that some employees would be retained on an interim basis. an interim CEO/chairman/director an interim agreement/measure\n[ C ]\n&#160; HR, WORKPLACE a person who is employed to work for a company or organization for a short period of time: Organizations are becoming more creative in their use of interims, but confusion still surrounds their role and how they differ from consultants.\ninterims\n[ plural ]\n&#160; ACCOUNTING financial results that are published during a financial year and show how much money a company is making or losing: The interims released in August show that year-on-year sales grew 27%. Clients are being advised to buy ahead of next week's interims.at the interims At the interims, analysts will want news on market share and current trading. to report/announce/file interims good/poor/disappointing interims"}