{"id":196175,"name":"intersect","type":"verb","us_sound":"ˌɪn.t̬ɚˈsekt","us_link":"../audio/i/eus72548.mp3","uk_sound":"ˌɪn.təˈsekt","uk_link":"../audio/i/ukinter310.mp3","content":"intersect verb\n(CROSS)\nAdd to word list\nAdd to word list\n[ I or T ] (of lines, roads, etc.) to cross one another: The roads intersect near the bridge. This is the point where the line intersects the curve.\n[ T ] to divide an area into smaller parts by crossing it with straight lines: The gardens are intersected by gravel paths.\nMore examplesFewer examplesThe dashed and dotted curves do not intersect.They live on the park's southeast corner, where Parkway and Ocean Drive intersect.She paints squares, rectangles and cubes that intersect and overlap one another.It is a cobblestone street intersected by narrow alleys. They made a list of all the streets intersecting the main street.\nSMART Vocabulary: related words and phrases\nRoad junctions\nbox\nbox junction\ncircus\ncloverleaf\ncorner\ncrossing\ncrossroad\ncrossroads\nfork\nintersection\njunction\nmini-roundabout\nroundabout\nspaghetti junction\nstaggered junction\nthroughabout\ntraffic circle\nturn off (something)\nturning\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrossing and moving through\nIsolating and separating\nintersect verb\n(SIMILAR)\n[ I ] If two things intersect, they are connected in some way and influence each other, usually by having some of the same parts, features, etc.: She discusses some of the ways in which work and health intersect. The book explores the intersecting lives of two siblings. Our life experiences intersect with our particular circumstances to shape our values.\n[ I ]\n&#160; mathematics\n&#160; specialized If sets (= groups of things with particular characteristics) intersect, they have some of the same members: These datasets may overlap and intersect. The report lists the numbers of women and minorities, but not the intersecting categories of women who are also members of other minorities. Related words\nintersectional\nintersectionality\nMore examplesFewer examplesHis home life and sporting life rarely intersect.We can see the way race, class and gender intersected to shape her life’s possibilities. The book explores how political culture and popular music intersected during the 1960s.The health of women in rural India is the complex outcome of many intersecting social, economic and demographic factors.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nrelation\ntar\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNumerical relationships\nAdd to word list\nAdd to word list\n[ I/T ] to meet and go through or across: [ T ] Weaver Street intersects Palmer Avenue at the next corner.\ngeometry (of a line or surface) To intersect is to cross at a point or set of points.\nAdd to word list\nAdd to word list\nif two things intersect, they come together and have an effect on each other: intersect with sth We need to pinpoint the place where maximum achievable conservation intersects with the highest potential financial return."}