{"id":194658,"name":"intense","type":"adjective","us_sound":"ɪnˈtens","us_link":"../audio/i/intense.mp3","uk_sound":"ɪnˈtens","uk_link":"../audio/i/ukintem006.mp3","content":"Add to word list\nAdd to word list\nC1 extreme and forceful or (of a feeling) very strong: intense cold/heat/hatred an intense flavour/colour He suddenly felt an intense pain in his back.\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving or giving out strong lightbrightA bright light was shining through the gloom.shiningWe topped our Christmas tree with a shining star.brilliantThe moon shed a brilliant light over the ocean.intenseThe intense light reflecting off snow at high altitudes can damage your eyes.blazingWe stepped out of the plane into blazing sunshine.\nSee more results »\nC2 Intense people are very serious, and usually have strong emotions or opinions: an intense young man\nSMART Vocabulary: related words and phrases\nHaving a powerful effect\nblazing\ncompelling\ncompellingly\ndevastating\ndevastatingly\nelementally\nfullness\nhigh-impact\nhyperintense\nimpactful\nlife-altering\nlife-changing\npungent\nscalding\nsuper-real\ntake (something) over\ntenaciously\nunconquerable\nunfailing\nvividly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong feelings\nLacking humour\nRelated word\nintensely\nAdd to word list\nAdd to word list\nextreme: intense heat/cold a look of intense joy\nIntense work or thought requires a lot of effort: an intense 13-week course\nA person who is intense is very forceful and has strong emotions and opinions: He was young and intense, and silly, too."}