{"id":195740,"name":"internal","type":"adjective","us_sound":"ɪnˈtɝː.nəl","us_link":"../audio/i/internal.mp3","uk_sound":"ɪnˈtɜː.nəl","uk_link":"../audio/i/ukinter126.mp3","content":"internal adjective\n(INSIDE PERSON)\nAdd to word list\nAdd to word list\nB2 inside the body: He sustained injuries to his arms, legs, and several internal organs.\ninside a person's mind: The internal struggle with his conscience continued. She didn't want to be left alone with her dark internal thoughts.\nMore examplesFewer examplesProlonged use of the drug can cause internal bleeding.The police have disclosed that two officers are under internal investigation.The internal logic of her argument is undeniable.A series of internal struggles was the prologue to full-scale civil war.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\ninternal adjective\n(INSIDE OBJECT)\ninside an object or building: Temperature is an indication of an object's internal energy level. An internal wall has been removed. See also\ninterior noun\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCentres of objects\ninternal adjective\n(WITHIN ORGANIZATION)\nwithin an organization: The bank conducted its own internal investigation into the robbery. This memo is for internal consumption only.\nwithin a country: The government warned its neighbours not to interfere in its internal affairs. Handguns, rifles, and grenades are the primary weapons used in internal conflicts from Asia to Africa.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\ninward\nmidst\non a dime idiom\nthere\ntherein\ntrack\nubiety\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCountries, nationalities & continents: country & nation\nRelated word\ninternally\nAdd to word list\nAdd to word list\nexisting, intended for, or happening inside a person, organization, place, country, etc.: the internal organs of the body The bank will conduct an internal investigation.\nAdd to word list\nAdd to word list\nrelating to activities, decisions, etc. within a particular organization or company, not outside it: New directives were issued in an internal memo to board members. internal communications/investigations/reviews\nGOVERNMENT relating to activities, decisions, etc. within a particular country: internal affairs/policies Compare\ndomestic"}