{"id":194514,"name":"integral","type":"adjective","us_sound":"ˈɪn.t̬ə.ɡrəl","us_link":"../audio/i/eus72461.mp3","uk_sound":"ˈɪn.tɪ.ɡrəl","uk_link":"../audio/i/ukinsur014.mp3","content":"Add to word list\nAdd to word list\nC1 necessary and important as a part of a whole: integral part He's an integral part of the team and we can't do without him.integral to Bars and terrace cafés are integral to the social life of the city.\nUK contained within something; not separate: All rooms have a flat-screen TV with integral DVD-player. The integral garage had been converted to make another bedroom.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif need be idiom\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\nnecessitate\nnecessity\nneed\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnclosing, surrounding and immersing\nmathematics\n&#160; specialized a number or function that gives the area under a curve on a graph between two points: The process of finding integrals is called integration. We know that the derivative of x2 is 2x, so an integral of 2x is x2. Related words\nintegrate\nintegrationCompare\nderivative\nMore examplesFewer examplesFinding an integral is the reverse of finding a derivative.The integrals are very easy to compute.The computing of probabilities in multidimensional spaces is a very hard problem in mathematics, being expressed by multiple integrals.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\nmultigroup\noperator\nroot\nsum\ntriangulation\nSee more results »\nAdd to word list\nAdd to word list\nnecessary and important as a part of a whole, or contained within it: Taking a ride on the canals of Venice is an integral part of experiencing that city.\nAdd to word list\nAdd to word list\nnecessary and important as a part of something: He's an integral part of the team and we can't do without him.integral to sth The reliability of our suppliers has been integral to the company's success."}