{"id":194582,"name":"intelligence","type":"noun","us_sound":"ɪnˈtel.ə.dʒəns","us_link":"../audio/i/intelligence.mp3","uk_sound":"ɪnˈtel.ɪ.dʒəns","uk_link":"../audio/i/ukinsur024.mp3","content":"intelligence noun\n(ABILITY)\nAdd to word list\nAdd to word list\nB2 [ U ] the ability to learn, understand, and make judgments or have opinions that are based on reason: an intelligence test a child of high/average/low intelligence It's the intelligence of her writing that impresses me.\nMore examplesFewer examplesI can't believe that someone of his intelligence can read such trash!He believes that all children are born with equal intelligence.He is blessed with both good looks and intelligence.You can't do that, man - use your intelligence!She handled the situation with great intelligence and maturity.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\nintelligence noun\n(SECRET INFORMATION)\n[ U, + sing/pl verb ] secret information about the governments of other countries, especially enemy governments, or a group of people who collect and deal with this information: the Central Intelligence Agency military intelligenceintelligence that They received intelligence (reports) that the factory was a target for the bombing.\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\nasset\nindustrial espionage\ninsider\nintel\nMI5\nMI6\noperative\nscout\nsleuthing\nsnoop\nsnoopy\nspook\nspy\nspy on someone/something\ntail\ntap\nthe CIA\nSee more results »\nintelligence noun [U]\n(THINKING ABILITY)\nAdd to word list\nAdd to word list\nthe ability to understand and learn well, and to form judgments and opinions based on reason: He’s a child of normal intelligence but he’s emotionally immature.\nintelligence noun [U]\n(INFORMATION)\na government department or other group that gathers information about other countries or enemies, or the information that is gathered: foreign intelligence\nAdd to word list\nAdd to word list\nthe ability to learn and understand things quickly and easily: Her high intelligence, ability and drive were evident from the start. People questioned the intelligence of his decision. an intelligence test\nsecret information that a company, country, etc. manages to get about another company, country, etc.: intelligence that We have good intelligence that they will be launching the latest model at next year's trade show.intelligence on/about sth Sometimes, the officers receive intelligence about a suspect on a particular flight.gather/provide intelligence They gather intelligence on their competitors to find out what their plans are.business/market intelligence We need to analyze and act on market intelligence with greater efficiency. foreign/national/military intelligence See also\nartificial intelligence\ncompetitive intelligence\ncultural intelligence\nemotional intelligence\nmarket intelligence"}