{"id":196478,"name":"interview","type":"noun","us_sound":"ˈɪn.t̬ɚ.vjuː","us_link":"../audio/i/eus72560.mp3","uk_sound":"ˈɪn.tə.vjuː","uk_link":"../audio/i/ukinter324.mp3","content":"Add to word list\nAdd to word list\nB1 a meeting in which someone asks you questions to see if you are suitable for a job or course: a job interview I had an interview for a job with a publisher.\nB1 a meeting in which someone answers questions about himself or herself for a newspaper article, television show, etc.: an exclusive interview with Johnny Depp In a television interview last night she denied she had any intention of resigning.\na meeting in which the police ask someone questions to see if they have committed a crime\nMore examplesFewer examplesIt was obvious that she had done her homework and thoroughly prepared for her interview.It creates a very bad impression if you're late for an interview.The interview will be broadcast during prime time.Apparently in interviews he refuses to talk about his private life.She wore a very smart trouser suit to her job interview.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nB1 [ T ] to ask someone questions in an interview: We've had 200 applicants for the job, but we only plan to interview about 20 of them. Who's the most famous person you've ever interviewed on TV? Police are interviewing a 43-year-old man in connection with the murder.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\n[ I ] to answer questions in an interview for a job or course: I interviewed for several jobs but I didn't get any of them. He's a good candidate on paper, but he didn't interview well.\nMore examplesFewer examplesI think it unnerved me to be interviewed by so many people.Without a doubt, she's the strongest candidate we've interviewed for the post.Detectives interviewed the men separately over several days.We'll be interviewing four more prospects for the posts this afternoon.He quickly mastered the art of interviewing people.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding\nAdd to word list\nAdd to word list\na formal meeting at which a person who is interested in getting a job or other position is asked questions to learn how well the person would be able to do it: a job interview\nAn interview is also a formal meeting at which reporters try to get information, esp. from a famous person or public official: an interview with the British prime minister\nto ask questions of someone who is interested in getting a job or other position: We interviewed dozens of applicants, and have narrowed the job search down to two.\nTo interview is also to ask questions of someone to get information: She interviewed voters as they left the polls.\nAdd to word list\nAdd to word list\nHR, WORKPLACE a meeting in which someone asks you questions to see if you are suitable for a job or a course: an interview for sth She has an interview for a new job tomorrow.an interview with sb Before getting a place at university, you may have to have an interview with the head of department. to be called for/invited for/selected for an interview She was very highly qualified, but didn't even get an interview. a job interviews Your second interview is likely to be more challenging than your first interview. interview techniques\nMARKETING a conversation in which someone is asked their opinion about a product or service, so that it can be improved or better advertised: carry out/conduct interviews The company conducted research and interviews with customers throughout the country. a face-to-face/telephone interview\nCOMMUNICATIONS a conversation in which someone is asked questions about themselves or a subject they know about for a newspaper article, television show, etc.: an interview with sb/sth He made the allegations in an interview with the New York Times.an interview about sth I read an interesting interview about Smith's views on the oil industry.take part in/give an interview He never gives interviews. Company officials refused a request for an interview. a newspaper/radio/television interview\nSee also\ndepth interview\nexit interview\nflyback interview\nscreening interview\nsemi-structured interview\nsituational interview\n[ I or T ]\n&#160; HR, WORKPLACE to ask someone questions at a formal meeting to see if they are suitable for a job or a course: There were so many applicants for the job that we will be interviewing all week.interview sb for sth We interviewed 20 people for the hotel vacancy.\n[ I ]\n&#160; HR, WORKPLACE to talk and answer questions at a formal meeting held to see if you are suitable for a job or a course: interview for sth He interviewed for a number of jobs with banks and telephone companies. Some people just don't interview well.\n[ T ]\n&#160; MARKETING to ask someone questions to get their opinion about a product or service, so that it can be improved or better advertised: The marketing department interviewed a random sample of 514 people aged 18+.\n[ T ]\n&#160; COMMUNICATIONS to ask someone questions about themselves or a subject they know about for a newspaper article, television show, etc.: interview sb for sth She interviewed 120 current and former employees of the company for her book. He declined to be interviewed for this article."}