{"id":195365,"name":"interior","type":"noun","us_sound":"ɪnˈtɪr.i.ɚ","us_link":"../audio/i/interior.mp3","uk_sound":"ɪnˈtɪə.ri.ər","uk_link":"../audio/i/ukinter028.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] the inside part of something: The estate agent had pictures of the house from the outside but none of its interior. The car's interior is very impressive - wonderful leather seats and a wooden dashboard. Compare\nexterior adjective\n[ S ] the land that is furthest away from the outside or coast of a country or continent: the African interior the interior\nin some countries, the government department that deals with subjects and events that are important in the country itself instead of events in other countries: the Ministry of the Interior officials of the US Interior Department\nMore examplesFewer examplesThe interior is spare, almost minimalist.The church has an ornate black and white marbled interior.The interior was extensively damaged in the fire.Grassland covers almost all of the country's interior.Cattle ranches occupy most of the country's interior.\nSMART Vocabulary: related words and phrases\nCentres of objects\ncentral\ncentrality\ncentrally\ncentre\ncentric\ncore\nhub\ninner ring\ninnermost\ninside\ninteriority\ninteriorly\ninternally\nmedian\nmid\nmiddle\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: areas of land in general\nUK politics: government departments & organizations\ninside: The interior walls have patches of damp on them. The paintwork on the interior doors (= those not in the outside wall of a building) is in good condition.\nrelating to the government department in some countries that deals with subjects and events that are important in that country instead of events in other countries: France's interior minister\nMore examplesFewer examplesThe interior walls are painted white.The interior walls of the house are thinner than the heavy exterior walls.The interior angles of a square are right angles or angles of 90 degrees.Virginia Woolf experimented with interior narration.The original interior doors have been replaced.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\nintra-\ninward\nmidst\non a dime idiom\nthere\ntherein\nthick\ntrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: government departments & organizations\nAdd to word list\nAdd to word list\ninner; on or from the inside: The interior surface of the seashell was smooth.\nthe inside part of something: [ U ] a car’s interior"}