{"id":195104,"name":"interdental","type":"adjective","us_sound":"ˌɪn.t̬ɚˈden.t̬əl","us_link":"../audio/i/cdo0319usinte0982.mp3","uk_sound":"ˌɪn.təˈden.təl","uk_link":"../audio/i/cdo0319ukinte0874.mp3","content":"Add to word list\nAdd to word list\nbetween the teeth or for use between the teeth: interdental spacesinterdental brush Keep your teeth clean by using interdental brushes in addition to your usual toothbrushing.\nphonetics\n&#160; specialized used to describe a sound that is made by putting the end of the tongue between the upper and lower front teeth: The interdental [T] is non-existent in Catalan phonetics.interdental fricative Many foreign learners have difficulty in pronouncing interdental fricatives (as in thin, this).\nMore examplesFewer examplesClean between your teeth once a day with floss or interdental cleaners.Your dentist will also recommend dental floss and perhaps interdental brushes.The toothpick can be worked into some of the tightest interdental spaces to attack plaque.In British English initial interdental fricatives are frequently pronounced as their corresponding stops.The word is adapted via the substitution of the alveolar sibilant 0 s 0 for the interdental consontant 0T0.\nSMART Vocabulary: related words and phrases\nThe teeth\nbaby tooth\nbuck-toothed\ncanine\ncentric\nchopper\ncoronal\ndentine\ndenture\nenamel\neruption\neyetooth\nincisor\nmolar\npearly whites\nperiodontal\npremolar\nprognathism\npulp cavity\nrictus\ntoothless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDentistry\nLinguistics: phonology & phonetics\nphonetics\n&#160; specialized a sound that is made by putting the end of the tongue between the upper and lower front teeth: Interdentals can be transcribed in different ways.\nMore examplesFewer examplesThere is a discussion of interdentals in Chapter 2.various coronal fricatives, including interdentals\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\napheresis\naphesis\nassonance\ndiphthong\nhomonym\nintrusive\nlabial\nlabialize\nlabiodental\nlateral\npostalveolar\npostconsonantal\nretroflex\nrhotic\nrhyme\nunpronounceable\nunrepeatable\nSee more results »"}