{"id":194527,"name":"integration","type":"noun","us_sound":"ˌɪn.t̬əˈɡreɪ.ʃən","us_link":"../audio/i/eus72463.mp3","uk_sound":"ˌɪn.tɪˈɡreɪ.ʃən","uk_link":"../audio/i/ukinsur017.mp3","content":"integration noun [U]\n(MIXING)\nAdd to word list\nAdd to word list\nC1 the action or process of successfully joining or mixing with a different group of people: racial/cultural integration To promote integration, several schools' catchment areas were merged.\nC1 the action or process of combining two or more things in an effective way: He creates a seamless integration of contemporary and historic images. The heads of government were trying to encourage regional integration. Related words\nintegrate\nintegrated\nMore examplesFewer examplesThe president was opposed to racial integration.In a 1956 referendum, the people voted in favour of integration.The signing of the Treaty of Rome was the greatest event in the annals of European integration.Businesses need to be awake to the advantages of European integration.The idea that national identity will be lost as a result of European integration is nonsense.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njunction\nkludge\nknit\nknock\nknock through something phrase\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nintegration noun [U]\n(IN MATHS)\nmathematics\n&#160; specialized the process of calculating the integral of a function: Integration can be used to find areas, volumes, central points, and many other useful things in addition to finding the area under the graph of a function. Related words\nintegral\nintegrateCompare\ndifferentiation\nMore examplesFewer examplesIntegration is a fundamental operation of calculus, and serves as a tool to solve problems in mathematics and physics.In calculus you will learn about differentiation, integration, circular and hyperbolic functions and differential equations.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\nmultigroup\noperator\nroot\nsum\ntriangulation\nSee more results »\nAdd to word list\nAdd to word list\nthe process of combining two or more things into one: integration across sth We need to reduce the differences between local units, with the aim of greater integration across markets.integration between sth and sth How can we achieve a higher level of integration between our company and our supply-chain partners?integration into sth The book examines China's integration into the global economy.integration (of sth) with sth One of the company's weaknesses is poor integration of business processes with information systems.close/smooth/total integration The new database will mean smoother integration with suppliers.\nthe process of becoming part of a group of people: integration (of sb) into sth The purpose of the induction program is to encourage the integration of new staff into the team.integration with sth The manager assesses other aspects of a new employee's development, such as social integration with colleagues. See also\nbackward integration\ncomputer telephony integration\ndata integration\neconomic integration\nEnterprise Application Integration\nforward integration\nglobal integration\nhorizontal integration strategy\nHR integration\nknowledge integration\nView all\nhorizontal integration\nmarket integration\nvertical integration\nvertical integration strategy"}