{"id":195185,"name":"interest","type":"noun","us_sound":"ˈɪn.trɪst","us_link":"../audio/i/interest.mp3","uk_sound":"ˈɪn.trest","uk_link":"../audio/i/ukinter015.mp3","content":"interest noun\n(INVOLVEMENT)\nAdd to word list\nAdd to word list\nB1 [ S or U ] the feeling of wanting to give your attention to something or of wanting to be involved with and to discover more about something: I've always had an interest in astronomy. He never seems to show any interest in his children. Unfortunately, I lost interest half way through the film. She takes more of an interest in politics these days.informal Just out of interest, how old is your wife?\nB1 [ C ] Your interests are the activities that you enjoy doing and the subjects that you like to spend time learning about: On his form he lists his interests as cycling and cooking.\nB1 [ U ] the quality that makes you think that something is interesting: Would this book be of any interest to you?\nMore examplesFewer examplesHe has demonstrated a genuine interest in the project.He wanted science students to take an interest in the arts, and so he ran literature classes at his home on Sunday afternoons.They take a lively interest in their grandchildren.I lost interest halfway through the book and I never finished it.I can honestly say that I have no interest whatsoever in the royal family.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPastimes - general words\ninterest noun\n(ADVANTAGE)\nC1 [ C usually plural, U ] something that brings advantages to or affects someone or something: A union looks after the interests of its members. It's in his interests to keep careful records. In the interests of safety, please do not smoke. Despite what you think, I'm only acting in your best interests (= doing what is best for you). See also\nvested interest\nMore examplesFewer examplesAs both a teacher and parent, she had an interest in seeing the school remain open.Is it really in the public interest to publish this information?The government's view is that raising taxes now would not be in the national interest .The government will only say it is not in the general interest to reveal any more information.She claimed that she had no financial interest in the case.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\ninterest noun\n(MONEY)\nC1 [ U ] money that is charged by a bank or other financial organization for borrowing money: Interest charges on an overdraft are usually quite high.\nC1 [ U ] money that you earn from keeping your money in an account in a bank or other financial organization: You should put the money in a savings account where it will earn interest.\nMore examplesFewer examplesMy investments return a high rate of interest.The rise in interest rates has pushed up the value of my investments.How much interest are you paying on the loan?The smaller local lenders charge a high rate of interest.An immediate interest cut might give a small boost to the economy.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\nfinance\ninterest rate\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nprincipal\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\ninterest noun\n(LEGAL RIGHT)\n[ C ]\n&#160; law, business\n&#160; specialized an involvement or a legal right, usually relating to a business or possessions: He is a multi-millionaire with business interests around the world. When they divorced she retained a legal interest in the property.\nMore examplesFewer examplesThe courts will have to decide the size of the beneficiary's interest in the trust.The deed transfers the interest to Mr Smith.Are there any third-party interests over the land?She is entitled to enforce her interest in the courts.Her interest in the trust has not yet been vested.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nB1 If someone or something interests you, you want to give that person or thing your attention and discover more about him, her, or it: Sport has never really interested me.\nMore examplesFewer examplesPolitics doesn't interest him much.I've got some news that might interest you.The subject that interests her most seems to be her own health!The idea of travelling to China had always interested him, and this seemed like a perfect opportunity.Anything to do with planes and flying interests him enormously.\nSMART Vocabulary: related words and phrases\nMaking people excited and interested\nabsorbed\nanimate\nbe someone's bag idiom\nbedazzle\nbreathe\nbreathe (new) life into sth idiom\nengage\nintoxicate\nintrigue\noccupy\noverexcite\noverstimulate\nstir\nstretch\nsweep someone along\ntalk something up\ntantalize\nthe Thames\nthrill\nwhip\nSee more results »\nPhrasal verb\ninterest someone in something\ninterest noun\n(INVOLVEMENT)\nAdd to word list\nAdd to word list\n[ C/U ] a feeling of having your attention held by something, or of wanting to be involved with and learn more about something: [ C ] an interest in chess [ U ] I lost interest halfway through the book.\n[ C/U ] Your interests are the activities that you enjoy doing and the subjects that you like to spend time learning about. of interest\nIf something is of interest, it holds your attention and makes you want to learn more about it: Nothing much of interest was discussed.\ninterest noun\n(ADVANTAGE)\n[ C ] something that gives you what is important or necessary or helps you in some way: A union looks after the interests of its members. I was only acting in your interest (= to achieve what would help you).\ninterest noun\n(MONEY)\n[ U ] money that is charged, esp. by a bank, when you borrow money, or money that is paid to you for the use of your money: My savings account is earning 5% interest.\nto cause you to want to give something your attention or learn more about it: Sailing has never really interested me. Idiom\nCan I interest you in something\nAdd to word list\nAdd to word list\n[ U ]\n&#160; FINANCE money that is charged by a bank or other financial organization for lending money: interest charges/payments Interest charges on an overdraft are usually quite high.charge/pay interest A number of providers don't charge any interest for an introductory period when you get one of their cards.interest on sth The interest on a mortgage is higher than the interest earned on savings. You can expect to pay interest of 4–6% on the loan.with interest I paid back the whole sum with interest within a month. monthly/annual interest\n[ U ]\n&#160; FINANCE money that you earn from keeping your money in an account in a bank or other financial organization: earn/receive/pay interest You will earn interest at 4% as long as you have money in your account. Consumers look for the best rate of interest on their savings. You will receive interest payments on your investments monthly. The account pays interest of up to 5%. monthly/annual interest\n[ C ] an involvement or a legal right, usually relating to a business or possessions that you own with other people: He is a multi-millionaire with business interests around the world.an interest in sth The bank has a legal interest in the building until the money is repaid, as it was offered as security on the loan.\n[ S or U ] the feeling of wanting to give your attention to something or of wanting to be involved with and to discover more about something: show interest (in sth) Customers are showing a lot of interest in this new design.lose interest (in sth) Keep your points short and snappy when you make your presentation, or the audience might lose interest.take an interest (in sth) Since our company featured in a national newspaper, people are starting to take an interest in what we do.have an interest in sth I've always had an interest in aviation. Just out of interest, how many people were at the conference?\n[ C ] an activity that you enjoy doing or a subject that you like to spend time learning about: She lists her interests as music, running, and learning languages.\n[ U ] the quality that makes you think that something is interesting: be of interest to sb I think this report would be of interest to you.\n[ C or U ] something that brings someone advantages or that affects someone or something: A union looks after the interests of its members. It's in your interests to keep careful records. In the interests of safety, please do not smoke. I believe it is in everyone's best interests if I resign. See also\naccrued interest\nadd-on interest\nbank interest\nbeneficial interest\ncompound interest\nconflict of interest\ncontrolling interest\nex-interest\nexpression of interest\ngross interest\nView all\nimputed interest\nmajority interest\nminority interest\nnet interest\nsimple interest\ntrue interest cost\nworking interest\nvested interest\nzero interest"}