{"id":195217,"name":"interference","type":"noun","us_sound":"ˌɪn.t̬ɚˈfɪr.əns","us_link":"../audio/i/eus72502.mp3","uk_sound":"ˌɪn.təˈfɪə.rəns","uk_link":"../audio/i/ukinter023.mp3","content":"Add to word list\nAdd to word list\nC1 an occasion when someone tries to interfere in a situation: She seems to regard any advice or help from me as interference. The government's interference in the strike has been widely criticized.\nC2 noise or other electronic signals that stop you from getting good pictures or sound on a television or radio\nMore examplesFewer examplesThe political subtext of her novel is a criticism of government interference in individual lives.In the end he moved to another part of the country to escape his mother's continual interference in his private life.They dreamed of a new world order, composed of co-operating independent nation states, free from outside interference.Now can I please get on with the job, without any more interference from you?I'm sorry if he sees it as interference - we were only trying to be helpful.\nSMART Vocabulary: related words and phrases\nGetting involved for one's own benefit or against others' will\na piece/slice of the action idiom\nact\naction\nbandwagon\nbe in bed with idiom\nbed\nget\nget in on something\nget/muscle in on the act idiom\nhave a finger in the pie idiom\nhorn\nhorn in\ninterfere\nintrude\nintrusion\njump/climb/get on the bandwagon idiom\nnon-interference\nsnoot\nstick your snoot in/into (something) idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nIdiom\nrun interference\nAdd to word list\nAdd to word list\nOn the radio, television, or telephone, interference is noise, lines, etc., that prevent a clear sound or picture from being received.\nphysics Interference between two waves happens when they have the same frequency and produce a force that is either stronger or weaker than one wave alone.\nIn sports, interference is an action that is against the rules which prevents an opposing player from completing a play."}