{"id":196416,"name":"interurban","type":"adjective","us_sound":"ˌɪn.t̬ɚˈɝː.bən","us_link":"../audio/i/cdo1121usinte2400.mp3","uk_sound":"ˌɪn.tərˈɜː.bən","uk_link":"../audio/i/cdo1121ukinte2142.mp3","content":"Add to word list\nAdd to word list\nbetween two or more cities: the interurban railway between Denver and Boulder A footbridge connects the car park to the interurban bike trail. Traffic on inter-urban roads is expected to increase still further. Related word\nurban\nMore examplesFewer examplesIn the last century, electric interurban railways ran across the country.There has been a substantial growth of the interurban railway lines.The school is situated above the former interurban rail line.The National Roads Authority will have completed the five main interurban motorways by the end of the decade.\nSMART Vocabulary: related words and phrases\nTowns & regions: towns, cities & villages (general)\naerotropolis\nanti-city\nanti-urban\nbackwater\nCantabrigian\ncentral city\ncitywide\nconurbation\ndormitory town\ngarden city\nmetro\nmunicipal\nnon-municipal\nopen city\nretirement community\nretirement village\nsanctuary city\nsmall-town\nsmoke\nurban\nSee more results »\na train that travels between two or more cities, or a railway line for trains like this: In the first years of the century, the number of interurbans grew rapidly. The Boulder-Denver Interurban, as the line was called, started service in 1908 and ran for 18 years.\nMore examplesFewer examplesThe general appearance of the cars was similar in style to the American inter-urban.L. A. Cleaver had the idea of an interurban to Huron.One reporter compared the comfort of the interurban to the luxury of a Pullman passenger train.\nSMART Vocabulary: related words and phrases\nRailways: trains & parts of trains\nbogie\nboiler\nboxcar\nbullet train\ncarriage\ncoach\ncowcatcher\nemergency cord\nfootplate\nfreight car\nguard's van\nlive rail\nloco\nluggage van\npuffer train\nrolling stock\nshunter\nsleeper\nsleeping car\nsmoker\nSee more results »"}