{"id":194523,"name":"integrate","type":"verb","us_sound":"ˈɪn.t̬ə.ɡreɪt","us_link":"../audio/i/eus72462.mp3","uk_sound":"ˈɪn.tɪ.ɡreɪt","uk_link":"../audio/i/ukinsur015.mp3","content":"integrate verb\n(MIX)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to mix with and join society or a group of people, often changing to suit their way of life, habits, and customs: He seems to find it difficult to integrate socially. It's very difficult to integrate yourself into a society whose culture is so different from your own.integrate into Children are often very good at integrating into a new culture.\n[ T ] to combine two or more things in order to become more effective: integrate something into something You need to integrate exercise into your normal life.integrate something with something The idea with young children is to integrate learning with play. Related words\nintegrated\nintegration\nSMART Vocabulary: related words and phrases\nCreating alliances\naffiliate\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\njoin\nnetwork\nnetworking\npair up\npairing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nintegrate verb\n(IN MATHS)\n[ T ]\n&#160; mathematics\n&#160; specialized to calculate the integral of a function: This step-by-step maths tutorial takes you through integrating a function. Try integrating cos(x) with different start and end values. Related words\nintegral\nintegrationCompare\ndifferentiate\nMore examplesFewer examplesHow do you integrate a function in Excel?The candidate must be able to integrate a variety of trigonometric functions.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\nmultigroup\noperator\nroot\nsum\ntriangulation\nSee more results »\nAdd to word list\nAdd to word list\nto end the separation of people by race, sex, national origin, etc., in an organization or in society: Until President Truman integrated the armed forces in 1948, African-American soldiers served in segregated army units.\nTo integrate is also to combine two or more things to make something more effective: We were taught how to integrate computer use into normal classroom procedures. integration noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɪn·təˈɡreɪ·ʃən/\nAdd to word list\nAdd to word list\n[ T ] to combine two or more things into one: integrate sth with sth We're planning to integrate the sales department with the marketing department.integrate sth into sth We need to develop an online shopping application and integrate it into our website.\n[ I or T ] to become part of a group of people: Her work's good and she seems to have integrated socially.integrate sb into sth Our induction program helps new staff members to integrate themselves into the team.integrate with sth Dave seems to be finding it hard to integrate with his colleagues."}