{"id":196480,"name":"interviewed","type":"verb","us_sound":"ˈɪn.t̬ɚ.vjuː","us_link":"../audio/i/eus72560.mp3","uk_sound":"ˈɪn.tə.vjuː","uk_link":"../audio/i/ukinter324.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ninterview\nB1 [ T ] to ask someone questions in an interview: We've had 200 applicants for the job, but we only plan to interview about 20 of them. Who's the most famous person you've ever interviewed on TV? Police are interviewing a 43-year-old man in connection with the murder.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\n[ I ] to answer questions in an interview for a job or course: I interviewed for several jobs but I didn't get any of them. He's a good candidate on paper, but he didn't interview well.\nMore examplesFewer examplesI think it unnerved me to be interviewed by so many people.Without a doubt, she's the strongest candidate we've interviewed for the post.Detectives interviewed the men separately over several days.We'll be interviewing four more prospects for the posts this afternoon.He quickly mastered the art of interviewing people.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding"}