{"id":195612,"name":"intermediate","type":"adjective","us_sound":"ˌɪn.t̬ɚˈmiː.di.ət","us_link":"../audio/i/eus72516.mp3","uk_sound":"ˌɪn.təˈmiː.di.ət","uk_link":"../audio/i/ukinter113.mp3","content":"Add to word list\nAdd to word list\nB1 being between two other related things, levels, or points: There are three levels of difficulty in this game: low, intermediate, and high. This novel is too difficult for intermediate students of English.\nMore examplesFewer examplesWe can teach dancers up to intermediate level here.The website is intended for intermediate and advanced French-language students and teachers.The Grade VI music syllabus is classed as 'intermediate', and Grade VII is called 'advanced'.He won the 110 metres hurdles event, taking his intermediate score in the competition to 5562 points.As a fairly experienced walker, I think you might be able to cope with one of our intermediate-grade walking holidays.\nSMART Vocabulary: related words and phrases\nBetween\n'twixt\n(in) between times idiom\namid\namong\nbetween\nbetwixt\nblock\nhalfway\nin\nin between phrase\ninter\ninterleave\ninterlinear\ninterstitial\ninterstitially\ninterval\nintervening\nliminal\nmid\npartway\nSee more results »\nAdd to word list\nAdd to word list\nbeing or happening between two other related things, levels, or points: a student of English at the intermediate level\nAdd to word list\nAdd to word list\nintermediate activities or decisions happen during a process, rather than at the beginning or end of it: The five-month program has been broken down into a series of separate, intermediate goals. Fed officials warned that there were many intermediate issues to be dealt with before making definitive changes to their economic forecast.\nhaving reached a fairly good level of skill or knowledge: Only 14% of British workers had intermediate level vocational qualifications, compared with 46% in Germany. The resort offers excellent skiing whether you are a beginner, intermediate, or advanced."}