{"id":196445,"name":"intervene","type":"verb","us_sound":"ˌɪn.t̬ɚˈviːn","us_link":"../audio/i/eus72556.mp3","uk_sound":"ˌɪn.təˈviːn","uk_link":"../audio/i/ukinter319.mp3","content":"intervene verb [I]\n(GET INVOLVED)\nAdd to word list\nAdd to word list\nC2 to intentionally become involved in a difficult situation in order to improve it or prevent it from getting worse: The Central Bank intervened in the currency markets today to try to stabilize the exchange rate. [ + to infinitive ] The minister intervened personally to stop the museum from being closed.\nMore examplesFewer examplesThere is increasing demand for the United Nations to intervene in trouble spots throughout the world.I'd like to help but I don't have the power to intervene in this dispute.The army's potentiality to intervene in politics remains strong.Their only hope now is that the outside world will intervene but it is an increasingly forlorn hope.The Bank of England intervened this morning to defend the pound .\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\ncatch\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nre-engagement\nSee more results »\nintervene verb [I]\n(COME BETWEEN)\nto happen between two times or between other events or activities: Two decades intervened between the completion of the design and the opening of the theatre.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattendant\nbe at work idiom\neventuate\nfall\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nroll\nroll around\nshake out\nsucceed\nsupervene\nsync\nSee more results »\nRelated word\nintervention\nintervene verb [I]\n(GET INVOLVED)\nAdd to word list\nAdd to word list\nto become involved intentionally in a difficult situation in order to change it or improve it, or prevent it from getting worse: The superpowers began to intervene in local struggles in Africa.\nintervene verb [I]\n(COME BETWEEN)\nto happen between two events, or to prevent something from happening by happening first: Two decades intervened between the completion of the design and the opening of the theater.\nAdd to word list\nAdd to word list\nto become involved in a difficult situation in order to improve it or prevent it from getting worse: intervene in sth The Central Bank intervened in the currency markets today to try to stabilize the exchange rate. The company has resolved the issue, and there is no need for the courts to intervene."}