{"id":196636,"name":"into","type":"preposition","us_sound":"ˈɪn.tuː","us_link":"../audio/i/into.mp3","uk_sound":"ˈɪn.tuː","uk_link":"../audio/i/ukintes013.mp3","content":"into preposition\n(INSIDE)\nAdd to word list\nAdd to word list\nA1 to the inside or middle of a place, container, area, etc.: Would you put the jar back into the cupboard for me, please? Let's go into the garden. Stop running around and get into bed! I can't get into these trousers any more. They're far too small for me.\nMore examplesFewer examplesThey climbed into the truck and drove away.The door opened and a nurse came into the room.Crack three eggs into a bowl and mix them together.He thrust his hands into his pockets.He took off his clothes and got into the bath.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nup\nward\nwise\nSee more results »\ninto preposition\n(CHANGE)\nA2 used to show when a person or thing is changing from one form or condition to another: Peel the cucumber and chop it into small cubes. There was a series of explosions and the van burst into flames (= started to burn violently). Her novels have been translated into 19 languages. We're planning to turn the smallest bedroom into an office.\nMore examplesFewer examplesThe commercialization of football has turned it from a sport into a business.Could we convert the small bedroom into a second bathroom?These chemicals quickly degrade into harmless compounds.Over time, their acquaintance developed into a lasting friendship.Heavy rainfall turned the river into a rushing torrent.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\ninto preposition\n(TOUCHING FORCEFULLY)\nB1 used to show movement that involves something touching something else with a lot of force but without moving inside it: He's always walking into things when he doesn't have his glasses on.\nMore examplesFewer examplesThe car skidded and went out of control, crashing into an oncoming truck.The plane crashed into a mountainside.A stone was digging into my heel.She bumped into his tray, knocking the food onto his lap.I wasn't looking where I was going and walked into a lamppost.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang around\nbowl someone over\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\ninto preposition\n(TOWARDS)\nB1 in the direction of something or someone: She was looking straight into his eyes.\nMore examplesFewer examplesThe bull tossed him up into the air.There was an accident on the main road into town.She shone the torch into the dark room.I trekked all the way into town to meet him and he didn't even turn up.Chuck it into the corner.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ngo\nmultidirectional\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nwest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing movement towards\ninto preposition\n(ABOUT)\ninvolving or about something: an inquiry into the cause of the accident\nMore examplesFewer examplesCitizens have demanded a full inquiry into the government's handling of the epidemic.Inquiry into the matter is pointless - no one will tell you anything.She's researching into possible cures for AIDS.They are doing some fascinating research into the language of dolphins.Several social workers have looked into the child's case.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nas\nconnection\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\nrange\nsay\nsomething\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\ninto preposition\n(DIVISION)\nused when referring to the division of one number by another number: What's 5 into 125?\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\ninto preposition\n(INTERESTED)\nB1 enthusiastic about or interested in: Jackie's really into classical music.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzealously\nzestful\nzestfully\nSee more results »\nGrammar\nIn, intoIn and into are prepositions. …\nIn, into: position and directionWe use in to talk about where something is in relation to a larger area around it: …\nInto: enthusiasm, interestWe use be into to express enthusiasm or strong interest for something: …\nChange into, turn intoWe use into after verbs describing change: …\nIn: phrasal verbsWe use in to make a number of phrasal verbs: …\ninto preposition\n(INSIDE)\nAdd to word list\nAdd to word list\ntoward the inside or middle of something and about to be contained, surrounded, or enclosed by it: Pour some sugar into the bowl. They went into the backyard.\ninto preposition\n(CONNECTED WITH)\nconnected with or involved in a condition or activity: My father went into the army the day after the war began. An investigation into the accident is underway. I know I should do my taxes but I just don’t want to get into it now.\ninfml Into also means strongly interested in or involved with something: Jeanne is heavily into music. Ken is into long-distance running.\ninto preposition\n(CHANGE)\nused to show when a person or thing is changing from one form or condition to another: Peel the potatoes and chop them into small cubes. We made the extra bedroom into an office. Her novels have been translated into nineteen languages.\ninto preposition\n(MOVEMENT)\nused to show movement that involves two things coming together with force: The driver apparently fell asleep and his car slammed into a tree. fig. Guess who I ran into (= met unexpectedly) at the shopping mall!\ninto preposition\n(DIVISION)\nused when referring to the division of one number by another number: 5 into 10 is 2."}