{"id":197049,"name":"introduce","type":"verb","us_sound":"ˌɪn.trəˈduːs","us_link":"../audio/i/introduce.mp3","uk_sound":"ˌɪn.trəˈdʒuːs","uk_link":"../audio/i/ukintra021.mp3","content":"introduce verb [T]\n(PUT INTO USE)\nAdd to word list\nAdd to word list\nB2 to put something into use, operation, or a place for the first time: Apple has sold many millions of iPods since the product was introduced in 2001. Such unpopular legislation is unlikely to be introduced before the next election.specialized The tube which carries the laser is introduced into the abdomen through a small cut in the skin.\nMore examplesFewer examplesThe Russian leader wants to introduce further changes.We need to introduce more stringent security measures such as identity cards.New measures have been introduced to try and ease traffic congestion in the city.The government introduced a law prohibiting tobacco advertisements on TV.They've introduced a fast-track system for brighter pupils which will allow thousands to take their GCSE exams two years early.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nstirring\nthe ground floor\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nintroduce verb [T]\n(GIVE SB'S NAME)\nB1 to tell someone another person's name the first time that they meet: I'd like to introduce my son, Mark. Have you two been introduced (to each other)?\nMore examplesFewer examplesShe introduced me to some of her fellow students.I didn't know anybody at the party, but the hostess came to my rescue by introducing me to a few people.Here's Fiona - let me introduce you to her.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nbuild\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npresent\npull\npull something on\nrub\nrub along\nscore\nstrike\nSee more results »\nintroduce verb [T]\n(BEGIN)\nto be the beginning of something: A haunting oboe solo introduces the third movement of the concerto.\nC2 to speak or write before the beginning of a performance, programme or book and give information about it; to tell an audience about the person who is going to speak, sing, etc. : The director will introduce the film personally at its premiere. This is the first official biography of her and it is introduced by her daughter. I'd now like to introduce our next guest, who will be singing songs from her latest album.\nMore examplesFewer examplesIt is my pleasure to introduce tonight's guest speaker.He introduced the visitors with a few well-chosen words.\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduction\nintroductory\nlead up to something\nlead-in\nopen the door to something idiom\npreamble\npreface\nprefix\npreliminarily\npreliminary\nprelude\nreintroduce\nSee more results »\nPhrasal verb\nintroduce someone to something\nintroduce verb [T]\n(MEET SOMEONE)\nAdd to word list\nAdd to word list\nto arrange for you to meet and learn the name of another person: I’d like to introduce you to my friend, Sally. George, I’d like to introduce my friend, Sally.\nTo introduce is also to formally present someone to a group: It’s my distinct honor to introduce the president of the United States of America.\nintroduce verb [T]\n(BEGIN TO USE)\nto put something into use for the first time, or to put something into a new place: When were music CDs first introduced? These trees were introduced into New England from Europe.\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING to make goods or services available to be bought for the first time: The company plans to introduce 45 new models over the next five years. The product range is being overhauled to introduce cheaper lines and more non-food products.\nSTOCK MARKET, FINANCE to make shares, etc. available for the first time: The shares moved higher to their highest level in the 21 years since this market introduced crude oil futures.\nto start using a new system, rule, or method: We will introduce a 10p starting rate of income tax for individuals. The company introduced a jobshare scheme last year.\nto tell someone another person's name the first time they meet: She plans to hold a meeting for all employees in the company to introduce her successor before she leaves.\nLAW to formally suggest a new law to be discussed and voted on by a parliament: introduce a bill/measure He plans to introduce legislation that would set minimum standards for corporate disclosure in the US. Phrasal verb\nintroduce sb to sth"}