{"id":197059,"name":"introduction","type":"noun","us_sound":"ˌɪn.trəˈdʌk.ʃən","us_link":"../audio/i/introduction.mp3","uk_sound":"ˌɪn.trəˈdʌk.ʃən","uk_link":"../audio/i/ukintra022.mp3","content":"introduction noun\n(PUT INTO USE)\nAdd to word list\nAdd to word list\nB2 [ U ] an occasion when something is put into use or brought to a place for the first time: The introduction of new working practices has dramatically improved productivity. Within a year of its introduction, questions began to emerge about the safety of the drug.specialized The introduction of the tube into the artery is a very delicate procedure.\nMore examplesFewer examplesThe introduction of identity cards has been opposed by the campaign for civil liberties.Company profits have doubled since the introduction of new technology.In the 1960s hemlines suddenly shot up with the introduction of the miniskirt.The introduction of new charges has angered customers.The minister has called for the introduction of harsher sentences for speeding offences.\nSMART Vocabulary: related words and phrases\nBeginnings and starts\na baptism of/by fire idiom\nadvent\nbaptism\nbeginning\nbirth\ncommencement\ninception\ninitiation\njumping-off point\nkick off\nonset\nopening\noutbreak\nsquare\nstarter\nstarting time\nthe thin end of the wedge idiom\nthin\ntrigger\nzero hour\nSee more results »\nintroduction noun\n(GIVING SB'S NAME)\nB2 [ C or U ] the action of telling someone another person's name the first time that they meet: You'll have to do/make the introductions - I don't know everyone's name. My next guest needs no introduction (= is already known to everyone).\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduce\nintroductory\nlead up to something\nlead-in\nopen the door to something idiom\npreamble\npreface\nprefix\npreliminarily\npreliminary\nprelude\nreintroduce\nSee more results »\nintroduction noun\n(BEGINNING)\nB2 [ C ] the first part of something: Have you read the introduction to the third edition? The song's great, but the introduction's a bit too long.\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduce\nintroductory\nlead up to something\nlead-in\nopen the door to something idiom\npreamble\npreface\nprefix\npreliminarily\npreliminary\nprelude\nreintroduce\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\nintroduction noun\n(FIRST EXPERIENCE)\nC1 [ S ] the first time someone experiences something: That trip was my introduction to winter sports.\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\nfirst come, first served idiom\nfrom the word go idiom\nfront end\nin the first/second place idiom\ninaugural\ninitial\ninitially\nplace\nprimary\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\ntrailblazing\nword\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnowledge and awareness\nintroduction noun\n(BASIC KNOWLEDGE)\nB2 [ C ] a book or course that provides basic knowledge about a subject: an introduction to psychology\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmust-read\nnovel\nnovelette\nnovelistic\nnovelistically\ntrilogy\nvade mecum\nworkbook\nya\nyoung adult\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nEasiness and simplicity\nintroduction noun\n(SPEECH)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; literature a short speech or piece of writing that comes before a longer speech or written text, usually giving basic information about what is to follow: The author’s introduction explains the organization of the book.\nintroduction noun\n(FORMAL MEETING)\n[ C ] the act of formally presenting someone to a group: Let me do the introductions (= introduce everyone to each other).\nintroduction noun\n(FIRST USE)\n[ U ] the act of putting something into use for the first time, or of putting something into a new place: The introduction of express buses is scheduled for July.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE, MARKETING the act of making goods or services available to be bought for the first time: the introduction of sth to sth The company has announced the introduction of a new games console to the market.\n[ C ]\n&#160; COMMERCE, MARKETING a product or service that is made available for the first time: She has successfully enhanced the financial stability of the company through product introductions.\n[ U ] the bringing in of something such as a new system, rule, or method: the introduction of sth Problems at the company have been caused by the introduction of a new computer system. These procedures now only take a few seconds to complete thanks to the introduction of £30m of new technology. She campaigned for the introduction of a national minimum wage.\n[ C or U ] the act of introducing one person to another: Our next guest speaker needs little introduction. Shall I do the introductions?\n[ C ] the first part of something such as a book or report: introduction to sth In the introduction to the book I used data from the Performance Measurement Association.\nLAW a situation in which a new law is formally suggested to be discussed and voted on by a parliament: The first step in Parliamentary procedure is the introduction and first reading of the bill."}