{"id":197291,"name":"invaded","type":"verb","us_sound":"ɪnˈveɪd","us_link":"../audio/i/invade.mp3","uk_sound":"ɪnˈveɪd","uk_link":"../audio/i/ukintru015.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ninvade\nB2 [ I or T ] to enter a country by force with large numbers of soldiers in order to take possession of it: Concentrations of troops near the border look set to invade within the next few days.\nThesaurus: synonyms, antonyms, and examples\nto try to hurt someone using violenceattackHe was attacked in the car park.assaultThe intruder assaulted him in his home.go forUK She suddenly lost her temper and went for me.come atHe came at me with a baseball bat.mugYes, that is the man who mugged me.ambushThey ambushed him and left him for dead.\nSee more results »\nC1 [ I or T ] to enter a place in large numbers, usually when unwanted and in order to take possession or do damage: Hundreds of squatters have invaded waste land in the hope that they will be allowed to stay.\n[ T ] to enter an area of activity in a forceful and noticeable way: Maria looks set to invade the music scene with her style and image.\nC2 [ T ] to spoil a situation or quality for another person without thinking about their feelings: Famous people often find their privacy is invaded by the press.\nMore examplesFewer examplesThe Spanish Armada was sent by the king of Spain to invade England in 1588.Supporters invaded the pitch.The D-Day landings began on 6 June 1944, when Allied forces invaded Normandy.They fought fearlessly against the troops who were invading from the north.The country does not have the resources to invade its neighbour.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberbullying\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\npost-conquest\npre-emption\nprivateer\nraid\nreconquer\nswoop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArriving, entering and invading\nTaking part and getting involved\nDamaging and spoiling"}