{"id":197303,"name":"invalid","type":"adjective","us_sound":"ɪnˈvæl.ɪd","us_link":"../audio/i/invalid_01_00.mp3","uk_sound":"ɪnˈvæl.ɪd","uk_link":"../audio/i/ukintru018.mp3","content":"Add to word list\nAdd to word list\nAn invalid document, ticket, law, etc. is not legally or officially acceptable: I'm afraid your driving licence is invalid in Eastern Europe.\nAn invalid opinion, argument, etc. is not correct, usually because it is not logical or not based on correct information: an invalid argument\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregularly\nliberal\nliberally\nquarrel\nwrongheaded\nwrongheadedly\nwrongly\nSee more results »\nRelated word\ninvalidly\nsomeone who is sick and unable to take care of himself or herself, especially for a long time: Is the invalid in bed?\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncase\ncasualty\nconvalescent\nday patient\ndonor\nepileptic\ngeriatric\nhealth tourist\nmedical tourist\nnon-responder\norgan donor\noutpatient\npatient\nsick\nsufferer\nunder\nvictim\nwounded\nSee more results »\nAdd to word list\nAdd to word list\nnot true or acceptable, or not correctly thought out: The results of the election were declared invalid by the court.\na person who is ill or injured for a long time and usually has to be cared for by others: My dad’s mother is an invalid, and she lives with my aunt and uncle.\nAdd to word list\nAdd to word list\nLAW not legally or officially acceptable: an invalid document/passport/licencebe declared/deemed/ruled invalid Insurance is ruled invalid if the report is not received within 30 days of the theft.\nnot correct, or not based on correct information: A small number of messages bounced back from invalid e-mail accounts.\nIT not recognized or accepted by a computer: invalid data\nCompare\nvalid"}