{"id":197397,"name":"inventory","type":"noun","us_sound":"ˈɪn.vən.tɔːr.i","us_link":"../audio/i/inventory.mp3","uk_sound":"ˈɪn.vən.tər.i","uk_link":"../audio/i/ukinvei009.mp3","content":"Add to word list\nAdd to word list\n[ C ] a detailed list of all the things in a place: A set of 24 gilded chairs appear on the inventory of the house for 1736.\n[ U ] US the amount of goods a shop has, or the value of them: Our inventory of used cars is the best in town.\n[ U ] US (UK stocktaking) the counting of all the goods, materials, etc. kept in a place such as a shop\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nglycaemic index\nhit list\nhonor roll\nhonours list\nindices\nrecital\nregistrable\nroll of honour\nroster\nrota\nthe White Pages\nwait list\nwaiting list\nwedding list\nwhitelist\nSee more results »\nAdd to word list\nAdd to word list\ngoods that are easily made available, or a detailed list of goods, property, etc.: [ C ] large inventories of oil and gasoline [ U ] The store is closed while we’re taking inventory (= counting and listing all the goods).\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; COMMERCE, PRODUCTION the amount of goods a store or business has for sale at a particular time, or their value: About half of the shop's inventory was damaged in the tornado. Analysts say the company's inventory of unsold cars could last two to three months. a big/large/low inventory\nACCOUNTING, PRODUCTION the amount of goods and materials owned by a company at a particular time, including parts, products being made, and finished products: Businesses are increasing their spending on plants, equipment and inventories. cut/bring down/reduce inventory We are trying to reduce manufacturing cycle time and the associated raw material, work in process, and finished goods inventory levels.\n[ C ] a detailed list of all the goods and property owned by a person or a business: a complete/extensive/detailed inventorydo/make/take an inventory We need to take a hardware inventory to estimate the hardware upgrade costs.\nSee also\nbeginning inventory\ncontinuous inventory\nto make a detailed list of all the goods and property owned by a person or a business: The judge ordered that all property should be inventoried before any more sales were made."}