{"id":197484,"name":"investment","type":"noun","us_sound":"ɪnˈvest.mənt","us_link":"../audio/i/investment.mp3","uk_sound":"ɪnˈvest.mənt","uk_link":"../audio/i/ukinvei022.mp3","content":"Add to word list\nAdd to word list\nB2 the act of putting money, effort, time, etc. into something to make a profit or get an advantage, or the money, effort, time, etc. used to do this: The government wanted an inflow of foreign investment. Stocks are regarded as good long-term investments. The account requires a minimum investment of €1,000. There's been a significant investment of time and energy in order to make the project a success.\nMore examplesFewer examplesIf the factory closes, that will be a million pounds' worth of investment down the drain.We are looking for exponential growth in our investment.A mixture of selected funds is an optimum choice for future security and return on investment.People are worried about inflation biting into their savings and investments.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInvesting money\nAdd to word list\nAdd to word list\nthe act of putting money or effort into something to make a profit or achieve a result: [ C ] real estate investments [ U ] There’s an awful lot of foreign investment in the US.\nAdd to word list\nAdd to word list\n[ C or U ] the act of putting money into a business to buy new stock, machines, etc., or a sum of money that is invested in a business in this way: investment in sth The company has increased its investment in research. They plan to maintain their current level of investment. We've made a significant investment in IT.\n[ U ] the act of buying shares, bonds, property, etc. in order to make a profit: investment in sth Investment in China has increased considerably. attract/encourage investment long-term/short-term investment domestic/foreign/overseas investment private/public investment The fund manager makes all investment decisions. We're always looking for investment opportunities.\n[ C ] something such as shares, bonds, or property that you buy in order to make a profit: good/bad/risky investment The fund was billed as an especially safe investment option.\n[ C ] an amount of money that you invest in something: an investment of sth The plan requires an estimated investment of €80 to €120 million. A business tries to get the best return on its investment. He made an initial investment of $2,000. the maximum/minimum investment See also\nalternative investment\nAlternative Investment Market\nauthorized investment fund\nautonomous investment\ncapital investment\ncommunity investment\ncorporate investment\ndirect investment\ndomestic investment\nequity investment\nView all\nethical investment\nfinancial investment\nfixed investment\nforeign direct investment\nforeign investment\ngovernment investment\ngross investment\ninward investment\nnet investment\nnon-investment\noutward investment\nover-investment\noverseas investment\npersonal investment\nprivate investment\nproperty investment\npublic investment\nreal estate investment\nreal investment\nretail investment\nreturn on investment\nspeculative investment"}