{"id":197470,"name":"investigation","type":"noun","us_sound":"ɪnˌves.təˈɡeɪ.ʃən","us_link":"../audio/i/investigation.mp3","uk_sound":"ɪnˌves.tɪˈɡeɪ.ʃən","uk_link":"../audio/i/ukinvei017.mp3","content":"Add to word list\nAdd to word list\nB2 the act or process of examining a crime, problem, statement, etc. carefully, especially to discover the truth: An investigation has been under way for several days into the disappearance of a 13-year-old boy. a full/thorough investigation of the incident Currently, the individuals who might have caused the accident are subject to/under investigation.\nMore examplesFewer examplesThe bank conducted its own internal investigation into the robbery.A lengthy police investigation failed to produce any evidence on which the suspect could be convicted.There will be a full investigation to work out what caused the accident.Both companies are under investigation for corrupt practices.They decided to reopen the investigation when some new evidence emerged.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nthe act of examining something carefully, esp. to discover the truth about it: [ C ] a criminal investigation [ U ] The cause of the fire is under investigation (= is being examined).\nAdd to word list\nAdd to word list\nthe careful examination of a crime, problem, statement, etc., especially to discover the truth: an investigation into sth An investigation into possible insider dealing has been begun by the stock exchange.the investigation of sth The investigation of the theft of a state data backup device last month continues. The Financial Services Authority launched an investigation. criminal/civil/internal investigationbe under investigation (for sth) Several companies are under investigation for fraud. The Justice Department is conducting investigations of alleged price-fixing at the company. continuing/ongoing investigation"}