{"id":197486,"name":"investor","type":"noun","us_sound":"ɪnˈves.t̬ɚ","us_link":"../audio/i/investor.mp3","uk_sound":"ɪnˈves.tər","uk_link":"../audio/i/ukinvei023.mp3","content":"Add to word list\nAdd to word list\nB2 a person who puts money into something in order to make a profit or get an advantage: A New York investor offered to acquire the company's shares for $13 each. Small investors (= people who invest only a small amount of money) are hoping that the markets will improve.\nMore examplesFewer examplesThere is a 20-day cooling-off period in which the investor can choose to back out of the contract.They have begun attracting investors, most notably big Japanese financial houses.The financial crash blackened the image of investment for many small investors.Stuttering productivity figures over the last two years have made the industry unattractive to investors.The company was set up to buy and sell shares on behalf of investors.\nSMART Vocabulary: related words and phrases\nInvesting money\nbacker\nbet\nbet big on something/someone idiom\ncapitalize\nco-investor\ndiscretionary\ndivestiture\ndivestment\nendow\nethical\nmature\nmicrofinance\npay something in\npension plan\nplough\nplough into something/someone\nprotect\npump\npump something into something\nspeculate\nSee more results »\nAdd to word list\nAdd to word list\na person or group of people that puts its money into a business or other organization in order to make a profit: Many stock-market investors who wanted to sell couldn’t find any buyers.\nAdd to word list\nAdd to word list\na person, organization, or country that puts money into something in order to make a profit or receive interest: an investor in sth The largest investor in the non-manufacturing sector was the UK. a large/major investoran institutional/individual/private investor Much of the increase in private investor activity has come through online dealing. a foreign/international/overseas investor See also\nangel investor\ninstitutional investor\npersonal investor\nprofessional investor\nretail investor\nsmall investor\nvalue investor\nvulture investor"}