{"id":197423,"name":"inverse","type":"adjective","us_sound":"ɪnˈvɝːs","us_link":"../audio/i/inverse.mp3","uk_sound":"ɪnˈvɜːs","uk_link":"../audio/i/ukinvei010.mp3","content":"Add to word list\nAdd to word list\nopposite in relation to something else: Their generosity was in inverse proportion/relation to their income (= the more money they had the less generous they were).\nThesaurus: synonyms, antonyms, and examples\ncompletely differentoppositeTheir two daughters may look alike, but they are completely opposite to one another. polar oppositesLove and hate are polar opposites.identicalHis opinions are identical to his spouse's.antitheticalHis actions were absolutely antithetical to our code of conduct.converseIf we ask what a citizen must sacrifice for the good of the nation, we must ask the converse question: what will the nation sacrifice for the good of its citizens?\nSee more results »\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nopposite\nor otherwise idiom\notherwise\npolar\npolarity\npole\npoles apart idiom\nreverse\nSee more results »\nRelated word\ninversely\nthe inverse\nthe opposite: Dividing by two is the inverse of multiplying by two.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nopposite\nor otherwise idiom\notherwise\npolar\npolarity\npole\npoles apart idiom\nreverse\nSee more results »\nAdd to word list\nAdd to word list\nchanging in an opposite direction in relation to something else, esp. an amount: in inverse proportion an inverse relationship inversely adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈvɜrs·li, ˈɪnˌvɜrs-/\nBy and large, your ability to cope with change varies inversely with age.\nAdd to word list\nAdd to word list\nchanging in the opposite way in relation to something else, especially an amount: an inverse relationship between sth and sth There is an inverse relationship between interest rates and bond prices.in inverse proportion to sth The amount of business activity is in inverse proportion to the amount of government control.\nthe opposite: the inverse of sth The current crisis is the exact inverse of the boom we experienced a few years ago. The Earnings/Price ratio is the inverse of the Price/Earnings ratio."}