{"id":197473,"name":"investigative","type":"adjective","us_sound":"ɪnˈves.təˌɡeɪ.t̬ɪv","us_link":"../audio/i/eus72586.mp3","uk_sound":"ɪnˈves.tɪ.ɡə.tɪv","uk_link":"../audio/i/ukinvei018.mp3","content":"Add to word list\nAdd to word list\ninvolving examining facts, events, problems, crimes, etc. in order to know more about about them or to discover the truth, or doing work like this : Children are encouraged to take an investigative approach to learning. The newspaper's investigative team would work for months on a single article. See also\ninvestigative journalism\ninvestigative journalistRelated word\ninvestigate\nMore examplesFewer examplesThe exam tests students' knowledge, reasoning, and investigative abilities.She was an excellent student who was admired for her investigative mind.Surveillance and investigative work is expensive because it requires manpower.There is a special investigative police unit for domestic violence cases.Steve is a freelance investigative reporter who writes frequently about the causes and effects of wrongful conviction.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nintended to examine something carefully, esp. to discover the truth about it: an investigative panel He's one of the paper's strongest investigative reporters (= someone whose job is gathering facts to be published).\nAdd to word list\nAdd to word list\nrelating to the discovery of information about something, especially something that may be illegal: Allowing a trade association representative to have access to the investigative information would be problematic. The Attorney General announced an investigative inquiry into the organization. an investigative agency/body/committee"}