{"id":197458,"name":"invest","type":"verb","us_sound":"ɪnˈvest","us_link":"../audio/i/invest.mp3","uk_sound":"ɪnˈvest","uk_link":"../audio/i/ukinvei015.mp3","content":"Add to word list\nAdd to word list\nB2 to put money, effort, time, etc. into something to make a profit or get an advantage: The institute will invest five million in the project. He's not certain whether to invest in the property market. You have all invested significant amounts of time and energy in making this project the success that it is.\nThesaurus: synonyms, antonyms, and examples\nto spend moneyspendHow much do you intend to spend on a house?payWhen you bought the tickets, how much did you pay?investShe's invested all her savings in the business.pay outI've just paid out £700 to get the car fixed.splurgeWe've just splurged on new kitchen appliances.blowWe won a £15 million settlement in court and we blew it all in six years.\nSee more results »\nMore examplesFewer examplesFrance and Germany invest far more per capita in public transport than Britain.There is a quirk in the rules that allows you to invest money without paying tax.Dean tricked the old lady into giving him £800, claiming that he would invest it for her.The return on the money we invested was very low.By investing small amounts regularly, you can smooth out the effects of sudden rises and falls in the stock market.\nSMART Vocabulary: related words and phrases\nInvesting money\nbacker\nbet\nbet big on something/someone idiom\ncapitalize\nco-investor\ndiscretionary\ndivestiture\ndivestment\nendow\nethical\ninvestor\nmature\nmicrofinance\npay something in\npension plan\nplough\nplough into something/someone\nprotect\npump something into something\nspeculate\nSee more results »\nPhrasal verbs\ninvest in something\ninvest someone with something\ninvest someone/something with something\nAdd to word list\nAdd to word list\nto put money or effort into something to make a profit or achieve a result: [ T ] She tends to invest a lot of energy in her work. [ I ] I think it’s time to invest in (= buy) a new washing machine.\nAdd to word list\nAdd to word list\nFINANCE to buy something that you think will go up in value, for example shares or property, in order to make a profit: It's a good time to invest.invest in sth He's not certain whether to invest in the property market.invest sth in sth The fund has invested 65% of its assets in shares. We advise our clients on how to invest wisely.\nFINANCE, BANKING to put money into a bank account, buy insurance, etc. so that you can receive interest or other payments: invest (sth) in sth You can invest up to £5,200 a year in a high-interest savings account.\nto put money, effort, time, etc. into something in order to improve it or get an advantage: invest sth in sth The company plans to invest $325 million in its new plant.fully/heavily invested in sth Generations ago, the government was more heavily invested in higher education. invest time and effort/energy/money in sth\nPhrasal verb\ninvest sb with sth"}