{"id":197465,"name":"investigate","type":"verb","us_sound":"ɪnˈves.tə.ɡeɪt","us_link":"../audio/i/investigate.mp3","uk_sound":"ɪnˈves.tɪ.ɡeɪt","uk_link":"../audio/i/ukinvei016.mp3","content":"Add to word list\nAdd to word list\nB2 to examine a crime, problem, statement, etc. carefully, especially to discover the truth: Police are investigating allegations of corruption involving senior executives. [ + question word ] We are of course investigating how an error like this could have occurred. Investigating further, we discovered that Carol was the person who took the call.\nMore examplesFewer examplesScotland Yard have been called in to investigate the murder.The remit of this official inquiry is to investigate the reasons for the accident.The government set up a commission to investigate the problem of inner city violence.The UN is investigating new methods of population control .I wonder what that noise was in the kitchen - I'd better go and investigate.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nto examine something carefully, esp. to discover the truth about it: [ I ] There was a suspicious man near the playground, and we asked the police to investigate. [ T ] The school created an independent review board to investigate charges of misconduct. investigator noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈves·tɪˌɡeɪ·t̬ər/\nShe hired a private investigator to check into her husband’s activities.\nAdd to word list\nAdd to word list\n[ I or T ] to examine a crime, problem, statement, etc. carefully, especially to discover the truth: The FBI was called in to investigate. Detectives will continue to investigate the incident.investigate allegations/claims/complaints of sth The office is investigating the allegations of embezzlement.investigate how/whether/why The commission will investigate whether these companies violated anti-trust laws.\n[ T ] to try to discover the truth about someone who is accused of a crime: investigate sb for sth The IRS are investigating Williams for alleged tax fraud. investigator noun [ C ]\nInvestigators discovered that the bank had covered up massive bad loans."}