{"id":197556,"name":"invisible","type":"adjective","us_sound":"ɪnˈvɪz.ə.bəl","us_link":"../audio/i/eus72590.mp3","uk_sound":"ɪnˈvɪz.ə.bəl","uk_link":"../audio/i/ukinvig009.mp3","content":"Add to word list\nAdd to word list\nB2 impossible to see: The aircraft is designed to be invisible to radar. These bacteria are invisible unless viewed with a microscope.\n[ before noun ]\n&#160; finance &amp; economics\n&#160; specialized used to refer to money that is added to a country's economy by activities such as the service and financial industries rather than the production of goods in factories: an increase in invisible exports Tourism brings in 40 percent of the island's invisible earnings.\nMore examplesFewer examplesAs the boat picked up speed, the coastline receded into the distance until finally it became invisible.The police found traces of blood on his jacket that were invisible to the naked eye.The sensor is able to detect invisible forms of radiation.The infrared rays are invisible except when viewed through a special filter.The fishing lines are almost invisible to the fish.\nSMART Vocabulary: related words and phrases\nIndistinct & invisible\nblur\nblurred\nblurrily\nblurry\ncloudily\nfuzzily\nfuzziness\nfuzzy\ninvisibly\nmelt (away) into something\nnot see hide nor hair of someone idiom\nsmudged\nsuper-subtle\nswimmy\nunclear\nunseen\nvaporous\nvapory\nviewless\nwashy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nRelated words\ninvisibly\ninvisibility\nAdd to word list\nAdd to word list\nimpossible to see: Invisible bacteria can lead to food poisoning. She was so unimportant in their lives that she was almost invisible to them. invisibility noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪnˌvɪz·əˈbɪl·ɪ·t̬i/\nAdd to word list\nAdd to word list\nused to describe trade in services such as banking and insurance, that can be sold in foreign countries or to buyers from foreign countries: The new invisible export figures are just out. An invisible import is generally a service – if a country receives investment banking consulting from another country, for instance. Invisible trade accounts for a growing slice of the value of world trade.\ninvisibles [ plural ]\n(also invisible exports) a service such as insurance or banking that is sold in foreign countries or to buyers from foreign countries: Invisibles now make up a larger proportion of the UK's current account. Compare\nbalance of trade"}