{"id":198365,"name":"irony","type":"noun","us_sound":"ˈaɪ.rə.ni","us_link":"../audio/i/irony.mp3","uk_sound":"ˈaɪ.rə.ni","uk_link":"../audio/i/ukiridi020.mp3","content":"irony noun [U]\n(OPPOSITE RESULT)\nAdd to word list\nAdd to word list\nC2 a situation in which something which was intended to have a particular result has the opposite or a very different result: The irony (of it) is that the new tax system will burden those it was intended to help.\nMore examplesFewer examplesWith inevitable irony, it was Smith who scored the winning goal against his former team.The final irony of the situation was that Collins himself ordered the assassination.The irony is that the formula turned out to have been incorrect all along.He noted the irony that the weapons were now being used against the country that produced them.The irony is that his mistake will actually improve the team's situation.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\ncorollary\nend result\nfallout\nfirst fruit\nfruit\nimplication\nin\nramification\nrepercussion\nresultant\nresultantly\nresulting\nsequel\nside effect\néclat\nSee more results »\nirony noun [U]\n(TYPE OF SPEECH)\nC2 the use of words that are the opposite of what you mean, as a way of being funny: Her voice heavy with irony, Simone said, \"We're so pleased you were able to stay so long.\" (= Her voice made it obvious they were not pleased.) Compare\nsarcasm\nSMART Vocabulary: related words and phrases\nFigurative use of language\nallegorically\nallusion\nanthropomorphic\nanthropomorphize\nfig\nfigurative\nfiguratively\nfigure of speech\nidiom\nironist\nmetaphorical\nmetonymic\nmixed metaphor\nnon-literal\nnon-metaphorical\npathetic fallacy\nso to speak idiom\nspeak\nsymbol\ntrope\nSee more results »\nAdd to word list\nAdd to word list\na type of usually humorous expression in which you say the opposite of what you intend: [ U ] He had a powerful sense of irony, and you could never be absolutely sure when he was serious.\nIrony is also something that has a different or opposite result from what is expected: [ C ] It is one of the ironies of life that by the time you have earned enough money for the things you always wanted, you no longer have the energy to enjoy them.\nliterature Irony is a style of writing in which there is a noticeable, often humorous, difference between what is said and the intended meaning."}