{"id":198545,"name":"irregular","type":"adjective","us_sound":"ɪˈreɡ.jə.lɚ","us_link":"../audio/i/irregular.mp3","uk_sound":"ɪˈreɡ.jə.lər","uk_link":"../audio/i/ukirred007.mp3","content":"irregular adjective\n(RULE)\nAdd to word list\nAdd to word list\nformal (of behaviour or actions) not according to usual rules or what is expected: Releasing the goods without an invoice is most irregular. Synonyms\nimproper (WRONG) formal\ninappropriate\nunacceptable\nunbecoming\nungentlemanly\nunladylike\nunprofessional\nunsuitable\nB1 language\n&#160; specialized An irregular verb, noun, adjective, etc. does not obey the usual rules for words in the language. Opposite\nregular (USUAL) specialized\nMore examplesFewer examplesThat is the pattern for most verbs, but some verbs are irregular and behave differently.A visitor can't wander around the building unaccompanied - that would be most irregular.The company was sold off in a rather irregular way, as I remember.The enquiry showed that various financial transactions had been carried out in a very irregular manner.If there was something irregular about how the system was shut down, you will get this message on screen.\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregularly\nliberal\nliberally\nquarrel\nwrongheaded\nwrongheadedly\nwrongly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistic terms & linguistic style\nirregular adjective\n(SHAPE)\nB2 not regular in shape or form; having parts of different shapes or sizes: an irregular coastline irregular teeth Opposite\nregular (EVEN)\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njagged\njaggedly\njaggy\njerky\nknobbly\nragged\nraggedly\nraggedness\nraggedy\nroughness\nunsmoothed\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »\nirregular adjective\n(TIME/SPACE)\nB2 not happening at regular times or not with regular spaces in between: an irregular heartbeat They met at irregular intervals. Opposite\nregular (EVEN)\nUS informal not emptying your bowels as often as you would usually Opposite\nregular (EVEN)\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nstatedly\nunsynchronized\nwould\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigestive disorders\nirregular adjective\n(SOLDIER)\n(of a soldier) fighting for a country but not as a member of its official army Opposite\nregular army, soldier, etc.\nSMART Vocabulary: related words and phrases\nSoldiers & people who fight in wars\nanti-guerrilla\nAnzac\nberserker\ncapability\ncavalryman\ncombat engineer\ncomrade\nex-serviceman\nex-servicewoman\nfoot soldier\nheadhunter\nparamilitary\nrecruit\nscout\nskirmisher\nsoldier of fortune\nunsoldierly\nvassal\nveteran\nwar party\nSee more results »\nRelated word\nirregularlyGrammar\nVerbs: basic formsMain verbs have three basic forms: the base form, the past form and the -ed form (sometimes called the ‘-ed participle’): …\nVerbs: the three basic formsMain verbs have three basic forms: the base form, the past form and the -ed form (sometimes called the ‘-ed participle’): …\nRegular verbsMost verbs in English are regular. Regular verbs add -ing to the base form to make the -ing form, and -ed to the base form to make the past simple and the -ed form. …\nIrregular verbsIrregular verbs follow the same rules as regular verbs for the present simple but have different forms for the past simple and the -ed form. …\na soldier who is not a member of the official army of a country Compare\nguerrilla noun\nSMART Vocabulary: related words and phrases\nSoldiers & people who fight in wars\nanti-guerrilla\nAnzac\nberserker\ncapability\ncavalryman\ncombat engineer\ncomrade\nex-serviceman\nex-servicewoman\nfoot soldier\nheadhunter\nparamilitary\nrecruit\nscout\nskirmisher\nsoldier of fortune\nunsoldierly\nvassal\nveteran\nwar party\nSee more results »\nirregular adjective\n(SHAPE)\nAdd to word list\nAdd to word list\nnot regular in shape or form; having parts of different shapes or sizes: an irregular surface\nirregular adjective\n(TIME/SPACE)\nnot happening at regular times, or not having usual or regular spaces in between: There are irregular spaces between the words. He showed up at irregular intervals.\nirregular adjective\n(RULE)\n(of behavior or actions) not according to usual rules or what is expected\ngrammar An irregular verb, noun, adjective, or other type of word does not obey the usual rules in the language for changing word endings.\nAdd to word list\nAdd to word list\nnot happening at regular times or in regular amounts: Many firms have an irregular cashflow. You will not be penalised for contributing irregular amounts, or missing or stopping payments. Airport staff inspect the runways three times a day at irregular intervals.\nnot according to usual rules or what is expected, and often not acceptable: Investigators found these bank deposits to be highly irregular because the amount exceeded the man's income. Certain irregular business practices were identified."}