{"id":198551,"name":"irregularly","type":"adverb","us_sound":"ɪˈreɡ.jə.lɚ.li","us_link":"../audio/i/usirrec009.mp3","uk_sound":"ɪˈreɡ.jə.lə.li","uk_link":"../audio/i/ukirred009.mp3","content":"irregularly adverb\n(TIME/SPACE)\nAdd to word list\nAdd to word list\nin a way that does not happen at regular times or does not have regular spaces in between: You may feel that your heart is beating irregularly. The path is made up of large, irregularly laid stones.\nMore examplesFewer examplesTaking the wrong antibiotic, or taking it irregularly, could compromise your immune system. Streetlights in the city function irregularly and traffic lights not at all.She had been eating very irregularly and fainted.News and letters from the outside world arrived irregularly, if at all. The houses were on irregularly placed, tilted stilts.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nlike clockwork idiom\nmany\nmany a time idiom\non-off\nperiodic\nperiodically\nprevalence\nregularity\nreligiously\nunsynchronized\nwould\nSee more results »\nirregularly adverb\n(SHAPE)\nin a way that is not regular in shape or form, or has parts of different shapes or sizes: The mole on her back grew and became irregularly shaped.\nMore examplesFewer examplesFive irregularly cut pieces of paper are put together to complete a jigsaw puzzle.The words were jumbled and irregularly formed on the page.The boulder is irregularly angular in shape.\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njaggedly\njaggy\njerky\nknobbly\nleathery\npockmarked\nraggedly\nraggedness\nraggedy\nroughness\nrugged\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »\nirregularly adverb\n(RULE)\nin a way that breaks the rules, or is not as should be done or as expected: It seems that the magistrate acted irregularly.\nlanguage\n&#160; specialized in a way that does not follow usual rules of grammar in a language: The verb acts irregularly.\nMore examplesFewer examplesThese are people who didn't enter the asylum procedure but who are staying irregularly. The order was reversed because it had been made by an irregularly convened council.irregularly formed plurals such as goose/geese and mouse/mice\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregular\nliberal\nliberally\nmal-\nquarrel\nwrongheadedly\nwrongly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistic terms & linguistic style\nSee\nirregular\nirregularly adverb\n(SHAPE)\nAdd to word list\nAdd to word list\nin a way that is not regular, or that has parts of different shapes or sizes: This irregularly shaped lake is 4 miles long.\nirregularly adverb\n(TIME/SPACE)\nnot at regular times, or not having the usual or regular spaces in between: He failed the exam because he only attended class irregularly.\nirregularly adverb\n(RULE)\nin a way that is not according to usual rules or what is expected: A stationary object in the sky can appear to move irregularly."}