{"id":198780,"name":"irritation","type":"noun","us_sound":"ˌɪr.əˈteɪ.ʃən","us_link":"../audio/i/irritation.mp3","uk_sound":"ˌɪr.ɪˈteɪ.ʃən","uk_link":"../audio/i/ukirres019.mp3","content":"irritation noun [C or U]\n(ANGER)\nAdd to word list\nAdd to word list\nC2 the feeling of being angry or annoyed, or something that makes you feel like this: That kind of behaviour is sure to cause irritation. Traffic noise is just one of several minor irritations (= small problems).\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that annoys youannoyanceThe café was cash only, which was a minor annoyance as I only had my credit card with me. nuisanceIt's a nuisance to have to drive to the nearest shop.inconvenienceThank you for holding - we apologize for the inconvenience.irritationThe CEO's poor communication skills became a source of irritation to the company's investors.irritantThe noise of the building work is a constant irritant.boreIt's such a bore to have to pack everything up again.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nangerangerHe vented his anger by kicking the door.annoyanceSmoke can cause annoyance by making clothes and hair smell unpleasant.irritationShe expressed irritation with her son's attitude.frustrationA lot of children's behaviour problems are caused by sheer frustration.furyThe speech provoked fury in some parts of the world.rageHe was filled with jealous rage when he saw his girlfriend talking to another man.\nSee more results »\nSMART Vocabulary: related words and phrases\nAnger and displeasure\nacrimony\nanger\nanimus\nannoyance\nbad feeling\nflap\nfuss\nget the hump idiom\ngorge\ngrit\ngrit your teeth idiom\ngrudge\nhard feelings idiom\nhuff\nrancour\nred mist\nreprehension\nresentfulness\nresentment\nroad rage\nSee more results »\nirritation noun [C or U]\n(SORE FEELING)\na painful or sore feeling in a part of the body: It is an antiseptic cream suitable for minor skin irritations. The strap had rubbed against his skin and caused irritation.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsore\nsting\nstitch\nthrob\nSee more results »\nirritation noun [C/U]\n(ANNOYANCE)\nAdd to word list\nAdd to word list\nsomething that annoys you or makes you angry: [ C ] minor irritations\nirritation noun [C/U]\n(SORE)\na sore or reddened area on the skin or other part of the body: [ C ] a skin irritation"}