{"id":199332,"name":"isolate","type":"verb","us_sound":"ˈaɪ.sə.leɪt","us_link":"../audio/i/isolate.mp3","uk_sound":"ˈaɪ.sə.leɪt","uk_link":"../audio/i/ukisola001.mp3","content":"Add to word list\nAdd to word list\nto separate something from other things with which it is connected or mixed: A high wall isolated the house from the rest of the village. They tried to isolate (= find) the cause of the problem.specialized Virus particles were eventually isolated from the tissue.\nto keep a person or animal separate from other people or animals by putting them in a different place: He was isolated from all the other prisoners.\nto put a person, country, or organization in a situation where they are seen as being separate : This policy will isolate minority groups and prevent integration.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nseclude\nthose\nuncouple\nwrench\nwrenching\nzonal\nSee more results »\nAdd to word list\nAdd to word list\nto separate something from other things, or to keep something separate: They tried to isolate the cause of the problem. A high wall isolated the house from the rest of the neighborhood. isolated adjective us\nYour browser doesn't support HTML5 audio\n/ˈɑɪ·səˌleɪ·t̬ɪd/\nOnly a few isolated cases of measles have been reported. isolation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌɑɪ·səˈleɪ·ʃən/\nThe prisoner was kept in isolation for three days.\nAdd to word list\nAdd to word list\nto separate something or someone from other things or people with which they are joined are mixed, or to keep them separate: We need to isolate the problem with our product distribution.\nPOLITICS to keep a company or country from doing business in the usual way: Despite American efforts to isolate the country, Europeans still travel and trade there freely.isolate sb/yourself from sth There is no way you can isolate yourself from politics unless you isolate yourself from society."}