{"id":199333,"name":"isolated","type":"adjective","us_sound":"ˈaɪ.sə.leɪ.t̬ɪd","us_link":"../audio/i/isolated.mp3","uk_sound":"ˈaɪ.sə.leɪ.tɪd","uk_link":"../audio/i/ukisola002.mp3","content":"Add to word list\nAdd to word list\nC1 not near to other places: an isolated farm/village\nC2 happening or existing only once, separate: There were only a few isolated cases of violent behaviour.\nThesaurus: synonyms, antonyms, and examples\nnot with othersaloneYou can tell me your secret - I think we're alone. (all) on your ownI like living on my own. on your lonesomeUK Sure, you can play the game on your lonesome, but it's more fun with friends.on your todUK Ah, your family's gone and left you on your tod, have they?unaccompaniedTo everyone's great surprise, she arrived at the ball unaccompanied.solitaryHe was a solitary child who preferred reading a book to football.\nSee more results »\nC1 feeling unhappy because of not seeing or talking to other people: Working at home was making her feel increasingly isolated.\nThesaurus: synonyms, antonyms, and examples\nfeeling sad and alonelonelyI've been lonely since my friends moved away.lonesomeUS I'm feeling lonesome.isolatedI wouldn't like living out in the country - I'd feel isolated from the rest of the world.forlornThe characters, a flighty heiress and her forlorn suitor, are a delight.lornHe's a lone, lorn creature.desolateAfter the market crash, desolate financiers left the field.\nSee more results »\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\nloose\nresegregation\nsecluded\nsecludedly\nseclusive\nseclusively\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRarely & infrequently\nAlone\nFeeling sad and unhappy\nAdd to word list\nAdd to word list\nnot near other things or people of the same kind: geographically/politically/socially isolatedisolated island/village You have brought the resources of the modern world to that isolated village.\nhappening alone, separately, or only once: isolated case/incident/instance This is not an isolated case of fraud but one of the biggest corruption scandals in history."}