{"id":199672,"name":"issue","type":"noun","us_sound":"ˈɪʃ.uː","us_link":"../audio/i/issue.mp3","uk_sound":"ˈɪʃ.uː","uk_link":"../audio/i/ukisola016.mp3","content":"issue noun [C]\n(SUBJECT)\nAdd to word list\nAdd to word list\nB1 a subject or problem that people are thinking and talking about: environmental/ethical/personal issues As employers we need to be seen to be addressing (= dealing with) these issues sympathetically. Don't worry about who will do it - that's just a side issue (= not the main problem). at issue\nC2 most important in what is being discussed: The point at issue is what is best for the child.\nSee more make an issue of something disapproving\nto make something seem more important than it should be, or to argue about it: Of course I'll help you - there's no need to make an issue of it.\nSee more take issue with someone/something C1 formal\nto disagree strongly: I took issue with him over his interpretation of the instructions.\nSee more have an issue with someone/something\nto dislike or disapprove of someone or something and let it upset or worry you: I feel like my dad has an issue with me having a husband with a different religion.\nSee more have issues (with someone/something)\nto have difficulty or disagreement with someone or something: All the people in the study had low self-esteem and had issues with their bodies.\nSee more\nMore examplesFewer examplesThe party is divided over the issue of capital punishment.Animal experimentation is a highly emotive issue.We met on several occasions to discuss the issue.They launched a vehement attack on the government's handling of environmental issues.Staffing is still a relatively unimportant issue compared to the other problems that we're encountering.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nissue noun [C]\n(PRODUCT)\nB2 a set of newspapers or magazines published at the same time or a single copy of a newspaper or magazine: There's an article on motorbikes in the latest/next issue. An old issue of \"Homes and Gardens\" lay on the table.\nAn issue of shares is a time when a company gives people the chance to buy part of it or gives extra shares to people who already own some.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncirculation\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nrag\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nIdiom\nwithout issue\nC2 to produce or provide something official: The office will be issuing permits on Tuesday and Thursday mornings. The school issued a statement about its plans to the press./The school issued the press with a statement about its plans.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nMore examplesFewer examplesPolice have issued an Identikit of the man they want to question.The Palace has issued a statement criticizing the newspaper report.He started issuing peremptory instructions.He will be issuing directions to judges on sentencing in the next few days.The company has been forced to issue a statement about yesterday's accident.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nPhrasal verb\nissue from something\nissue noun [C]\n(SUBJECT)\nAdd to word list\nAdd to word list\na subject or problem that people are thinking and talking about: There continues to be a great deal of debate over the property tax issue. Isn’t the need to hire more staff what’s really at issue here (= the subject of the disagreement)? I like my hair this way – I don’t see why you have to make an issue of it (= cause it to be a problem).\nissue noun [C]\n(SUPPLY)\na group or series, or one of a group or series, of things that are supplied, made available, or printed at the same time: A new issue of postage stamps was released to honor women in the military. He picked up an old issue of Life magazine.\nissue verb [T]\n(SUPPLY)\nto give, supply, or produce something official: Reporters gathered on the White House lawn, hoping that the president would issue a statement.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; FINANCE, STOCK MARKET\n&#160; (also issuance) the offer for sale by a company or organization of financial products such as shares or bonds: bond/stock/share issuethe issue of sth Shareholders approved the issue of 12 million shares of preferred stock.in issue Total shares in issue are in excess of the those stated in the report.at/on issue While the shares dipped below the price at issue, some buying support lifted the stock back into positive territory.\n[ C ]\n&#160; FINANCE, STOCK MARKET all of a particular type of shares, bonds, etc. that are offered for sale together: Since it is the largest issue and the market is witnessing poor performance, investors might not get value. We launched an exchange offer to buy back existing bonds in return for a new issue.\n[ C ] a group or series, or one of a group or series, of things that are made available, published, or printed at the same time: an issue of a journal/magazine/newspaper The latest issue of the journal features interviews with twelve great business leaders. today's/this month's/Saturday's/etc. issue Issue number one of the comic book sold for $1.2 million at auction.\n[ C or U ]\n&#160; MONEY the act of making available coins, currency, or stamps by a government, or the items themselves: Issue of a new ten rupee coin replaced a note of a similar denomination already in circulation. We expect the release of two commemorative coin issues by the United States Mint.\n[ C ] a subject or problem that people think or talk about, or need to deal with: address/tackle/resolve an issue The service offers confidential help to filers who cannot resolve an issue through normal channels. consider/discuss an issue a central/core/key issue a major/minor issuea critical/serious issue Health care could become a critical issue in political debate. a complex/controversial/sensitive issue\n[ C ]\n&#160; LAW a question that people still disagree about after all sides have argued for their clients in court: Pleadings, depositions, and admissions on file show that there is no genuine issue.\nbe at issue formal\nto be the most important part of what is being discussed: The point at issue is what is best for the firm.\ntake issue with sth formal\nto disagree strongly with someone: take issue with sb over sth I took issue with him over his interpretation of the instructions. See also\nauthorized issue\nbank of issue\nbonus issue\ncapitalization issue\ncash issue\ncorporate issuer\neuro-equity issue\nfree issue\noutstanding issue\nscrip issue\nFINANCE, STOCK MARKET to offer for sale financial products such as shares or bonds: issue shares/stock/bonds The notes are being issued to fund public infrastructure improvements. About $8.8 billion of debt was issued to pay dividends.\nto officially publish or announce something: issue a report/statement/warning A competitor issued a statement calling its bid superior to the one that had been accepted. issue an apology/a notice/an order The city issued a certificate of occupancy for the new building.\nLAW to start a legal process: issue a warrant/writ The judge issued a writ of possession, an order that allowed the bank to take possession of the collateral.\nto give someone something, especially officially: issue sth to sb/sth Officials issued new passports to refugees at the consulate.issue sb with sth Employees who are off sick for more than seven days will be issued with notes.\nMONEY to make or release new coins, currency, or stamps: The regime in December issued new currency and wiped out private savings."}