{"id":199717,"name":"it","type":"pronoun","us_sound":"ɪt","us_link":"../audio/i/it.mp3","uk_sound":"ɪt","uk_link":"../audio/i/ukisola019.mp3","content":"it pronoun\n(THING)\nAdd to word list\nAdd to word list\nA1 used as the subject of a verb, or the object of a verb or preposition, to refer to a thing, animal, situation, or idea that has already been mentioned: \"Where's my pen? It was on my desk a minute ago.\" \"You left it by the phone.\" The company was losing money and it had to let people go. The argument was upsetting for us all - I don't want to talk about it. Children who stay away from school do it for different reasons.\nMore examplesFewer examplesHe was clasping the vase tightly, terrified of dropping it.\"Have you written your English essay yet?\" \"Of course, I finished it last week.\"It's a nice dress, but it creases very easily.He finds it extremely difficult being a single parent.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nit pronoun\n(SUBJECT/OBJECT)\nA1 used as the subject or object of a verb to represent a phrase at the end of the sentence: It's unlikely that she'll arrive on time. It costs more if you travel before 9.00. I liked it in Scotland. I find it convenient to be able to do my banking by phone.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nit pronoun\n(TIME/WEATHER)\nA2 used to talk about the time, date, weather, or distances: What time is it? It was October, so it was quite cold. It rained all day. It's ten miles to Leeds.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nDummy subjectsEnglish clauses which are not imperatives must have a subject. Sometimes we need to use a ‘dummy’ or ‘empty’ or ‘artificial’ subject when there is no subject attached to the verb, and where the real subject is somewhere else in the clause. It and there are the two dummy subjects used in English: …\nIt as a dummy subjectWe often use it as a dummy subject with adjectives and their complements: …\nThere as a dummy subjectThere operates as a dummy subject in the construction there is or there are. There is/are indicates that something or someone exists or is in a particular place or situation: …\nItWe commonly use the pronoun it as both a subject and an object pronoun: …\nIt as an ‘empty’ or ‘dummy’ subject and objectWe can use it as an ‘empty’ subject or as an ‘empty’ object. It is ‘empty’ because it doesn’t refer to anything in particular: …\nAnticipatory itWe also use it to introduce or ‘anticipate’ the subject or object of a sentence, especially when the subject or object of the sentence is a clause. Most commonly, such clauses are to + infinitive and that clauses. We also call this use of it a ‘dummy’ subject, since the real subject is another part of the sentence (real subject underlined): …\nI find it amazing that …With verbs such as find or consider, it + adjective + that clause or it + adjective + to infinitive, are commonly used to anticipate an object: …\nIt and cleft sentences (It was my friend who …)We use it in cleft sentences. It emphasises the subject or object of the main clause: …\nIt with the passive voiceIt is common with the passive voice. It makes the sentence seem less personal and more objective: …\nIt, this and that in paragraphsWe use it, this and that to introduce further information about a topic already mentioned. However, the words have different uses. …\nIt’s or its?It’s is the contracted form of it is or it has: …\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nIt to create focusWhen we use it at the beginning of a clause, the subject can go at the end of the clause and therefore be in the position of focus or emphasis (underlined): …\nThere to create focusWe can use there at the start of a clause as a type of indefinite subject. This means that we can put the actual subject at the end of the clause and so give it emphasis or focus (underlined below): …\nNoun forms of verbs to create focusIn formal writing, especially academic writing, we can use a noun form of a verb as a subject. By doing this, extra focus is given to the end of the clause. Noun phrase subjects (topics) are in bold type below; the focus of each sentence is underlined: …\nIdiom\nit is what it is\nused for describing things or people that are very fashionable, and everyone is interested in them, wants to have them, etc.: The design of this bag makes it the \"it-bag\" for this summer.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\npeacock\nshabby chic\nsleekly\nsleekness\nsmartly\nthe avant-garde\nultra-modern\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nà la mode\nSee more results »\nA2 abbreviation for\ninformation technology\nExamples\nBob studied mathematics at university, but now he's working in IT.IT has made huge advances in the last 20 years.There seem to be plenty of jobs in IT at the moment.There are various part-time IT courses at the college you could join.IT is very much a male-dominated industry.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nAdd to word list\nAdd to word list\nthe thing or animal being spoken about, that has already been mentioned: I can’t find the newspaper. Do you know where it is? Someone is at the door. Find out who it is.\nIt is sometimes used to introduce a statement that does not involve a particular event or person: It’s supposed to rain tomorrow.\nAdd to word list\nAdd to word list\nIT abbreviation for information technology: the science and activity of using computers and software to store and send information: Leapfrogging outdated IT is one way that developing nations can beat the industrialized world. IT consultant/director/manager IT department/division/staff IT professional/specialist\nIT companies or organizations that sell or provide goods or services relating to computers, software, access to the internet, etc.: IT industry/sector The IT industry has the systems to gather and manage more data than the world can produce. jobs/work in IT The agency deals with a wide range of jobs in IT.\nIT, WORKPLACE the department in an organization that is responsible for electronic equipment and services, including computers, software, and internet access: Take your computer to IT and they'll put a new hard drive in it."}