{"id":199772,"name":"itch","type":"verb","us_sound":"ɪtʃ","us_link":"../audio/i/itch.mp3","uk_sound":"ɪtʃ","uk_link":"../audio/i/ukisola025.mp3","content":"Add to word list\nAdd to word list\nB2 to have or cause an uncomfortable feeling on the skin that makes you want to rub it with your nails: I can't wear wool - it makes me itch.\nMore examplesFewer examplesWhat's that big red lump on your arm? Does it itch?Try not to scratch those spots, no matter how much they itch, or you'll make them bleed.There's a mosquito bite on my ankle that is itching like crazy!She won't wear that beautiful woollen jumper; she complains that it itches.Why are you wrinkling your nose like that? Is it itching?\nSMART Vocabulary: related words and phrases\nSkin complaints & blemishes\nabscess\nage spot\nanti-crack\nanti-dandruff\nanti-leprosy\nanti-ulcer\nblotch\ncarbuncle\ncold sore\ndermatitis\nmelanoma\npocky\nport wine stain\npruritic\npruritus\npyoderma gangrenosum\nscald\nshingle\nulcer\nweal\nSee more results »\nRelated word\nitchingIdiom\nitch to do something\nan uncomfortable feeling on the skin that makes you want to rub it with your nails: I've got an itch on the back of my neck.\nMore examplesFewer examplesCould you scratch my back for me? I've got an infuriating itch right in the middle there.He's got sensitive skin and anything except pure cotton gives him an awful itch.The itch from that rash is driving her mad - I think I'll give her an antihistamine tablet.My grandmother was very strict and if you had an itch in church you were forbidden from scratching it.Poor dog - I wonder what's causing that itch. Have you got a sore patch, or is it a flea?\nSMART Vocabulary: related words and phrases\nSkin complaints & blemishes\nabscess\nage spot\nanti-crack\nanti-dandruff\nanti-leprosy\nanti-ulcer\nblotch\ncarbuncle\ncold sore\ndermatitis\nmelanoma\npocky\nport wine stain\npruritic\npruritus\npyoderma gangrenosum\nscald\nshingle\nulcer\nweal\nSee more results »\nAdd to word list\nAdd to word list\nto have an uncomfortable feeling on the skin that makes you want to rub it with something hard: My insect bites are itching. Idiom\nitching to do something\nan uncomfortable feeling on the skin that makes you want to rub it with something hard: I have an itch on the back of my neck. [ + to infinitive ] He has an itch (= desire) to travel. itchy adjective [ -er/-est only ] us\nYour browser doesn't support HTML5 audio\n/ˈɪtʃ·i/\nan itchy sweater"}