{"id":199794,"name":"item","type":"noun","us_sound":"ˈaɪ.t̬əm","us_link":"../audio/i/eus72616.mp3","uk_sound":"ˈaɪ.təm","uk_link":"../audio/i/ukisola028.mp3","content":"Add to word list\nAdd to word list\nB1 something that is part of a list or group of things: the last item on the list The restaurant has a long menu of about 50 items. Several items of clothing (= clothes) lay on the floor.\none of several subjects to be considered: There are three items on the agenda.\nB2 a piece of news on television or radio, or in a newspaper: There's an interesting item on the back page. item by item\none thing at a time: Buyers from stores are given the opportunity to go through fashion collections item by item and place orders.\nSee more\nMore examplesFewer examples\"Can we move on to the next item for discussion, please?\"The final item in today's programme is Beethoven's Trio in B flat, Opus 11.How many items of hand luggage am I allowed to take onto the plane?During the sale we're offering 20% off selected items.Many of these families are unable to afford even basic items.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTopics & areas of interest\nAccounts and stories\nBroadcasting: programmes & other broadcasts\nNewspapers & magazines\nGrammar\nPiece words and group wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nPiece wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nIdiom\nbe an item\nAdd to word list\nAdd to word list\none thing that is a part of a list or a collection of things: There were several more items on the agenda.\nAn item is also a particular thing considered as one among others of its type: a news item in this morning’s newspaper basic food items such as butter\nAdd to word list\nAdd to word list\nCOMMERCE a single object, especially one that is for sale or is bought: buy/purchase/select an item The business sells items made from recycled waste products. order/collect/return an itemfood/household/fashion item Supermarkets offer a wide range of food and household items.commodity/consumer item Manufacturing commodity items is increasingly competitive. expensive/valuable/luxury item item of equipment/clothing/furniture Radios with wooden cabinets have become collector's items.individual/particular/specific item Sometimes customers who like a particular item of clothing will ask for it at more than one branch of the same store.\nMEETINGS one of several points on an official list of things to be discussed at a meeting: Please let me have any items for the agenda by 4 pm today. Although fixed agenda items had been agreed at the last round of talks, members obviously had their own objectives.an item on the agenda Item 2 on the agenda is the Treasurer's report.\none of several things to be considered, to do, or to choose from: an item on the/sb's agenda The main item on my agenda for today is writing my month-end reports.menu/list item The program allows the user to remove or add menu items. The website has links to all the day's main news items."}