{"id":199850,"name":"itinerant","type":"adjective","us_sound":"aɪˈtɪn.ɚ.ənt","us_link":"../audio/i/itinerant.mp3","uk_sound":"aɪˈtɪn.ər.ənt","uk_link":"../audio/i/ukisola030.mp3","content":"Add to word list\nAdd to word list\ntravelling from one place to another, usually to work for a short period: an itinerant journalist/labourer/preacher\nMore examplesFewer examplesThe preacher had a small flock of itinerant oil workers.The farmers rely on itinerant labour.For a time, my sister was an itinerant church singer.Many fruitpickers were itinerant, following the seasons from farm to farm. This is an indication of how itinerant the US workforce has become.\nSMART Vocabulary: related words and phrases\nTravellers & visitors\nbird of passage\ncaravan\ncarpool\ndaily passenger\nday-tripper\ndrifter\nemmet\nexpedition\nflashpacker\ngrief tourist\nhouseguest\npassenger\npioneer\nrover\nsightseer\nstayer\nsuper-commuter\nswagman\ntouristic\ntripper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\na person who travels from one place to another, usually to work for a short period: Itinerants worked in the salt marshes and shrimp farms. He lived as an itinerant, earning or begging his bread as he went.\nMore examplesFewer examplesShe was an itinerant who had been riding the rails. For much of his life he has been an itinerant, working blue-collar jobs at warehouses and garages.They are itinerants, tinkers and traders.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nAdd to word list\nAdd to word list\n(of a person) traveling from one place to another, usually to work for a short period: itinerant farm workers\nAdd to word list\nAdd to word list\ntravelling from place to place, usually for work: itinerant labourers/workers/workforce The precise number of the itinerant workforce currently in London is not known. an itinerant life\nsomeone who travels from place to place, usually for work: Economic necessity has created a new generation of itinerants."}