{"id":262867,"name":"pace","type":"noun","us_sound":"peɪs","us_link":"../audio/p/pace.mp3","uk_sound":"peɪs","uk_link":"../audio/p/ukozone008.mp3","content":"pace noun\n(SPEED)\nAdd to word list\nAdd to word list\nB2 [ U ] the speed at which someone or something moves, or with which something happens or changes: a slow/fast pace When she thought she heard someone following her, she quickened her pace. Could you slow down - I can't keep pace with (= walk or run as fast as) you. For many years this company has set the pace (= has been the most successful company) in the communications industry. These changes seem to me to be happening at too fast a pace. I don't like the pace of modern life. See also\npacemaker (RUNNER)\nThesaurus: synonyms, antonyms, and examples\nslowlyslowlyI got out of bed and walked slowly to the door.slowGo slower! I can't keep up.at a slow paceThey are easy hikes, done at a slow pace.at a slow speedYou only have to hit a pedestrian at a slow speed to kill them.at slow rateThe economy grew at a slower rate during the second half of the year.\nSee more results »\nforce the pace mainly UK\nto make other people in a race go faster by going faster yourself: Sylva, in a red shirt and shorts, forced the pace lap after exhausting lap.\nSee more\n[ U ] the ability of a football player or team to move quickly with the ball: He plays on the right wing and has pace as well as skill. Chelsea lacked pace up front.\nMore examplesFewer examplesThe traffic was creeping along at a snail's pace.He set off running at a furious pace.She takes the attitude that children should be allowed to learn at their own pace.A few days before the elections, the pace began to hot up.He was walking at a very quick pace and I had to jog to keep up with him.\nSMART Vocabulary: related words and phrases\nSpeed of motion\nairspeed\nat full/half throttle idiom\nbriskness\ncelerity\nclip\nclock\ncruising speed\nground speed\nhypersonic\nhypervelocity\ninstantaneous velocity\nlight speed\nmomentum\nmulti-speed\nspeed\nspeediness\nsupersonically\nswiftness\nvelocity\nzip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving firmly on foot\nCompeting in sport\nGeneral terms used in ball sports\npace noun\n(STEP)\n[ C ] a single step, or the distance you move when you take a single step: Take two paces forwards/backwards. The runner collapsed just a few paces from the finish.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhoof it idiom\nrace walking\nrambler\nrambling\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\ntrekking pole\nwalk\nwalkable\nwalkabout\nwalkies\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements of length & distance\nIdiom\nput someone/something through their/its paces\npace verb\n(SPEED)\n[ T ] to get someone to run a race at a particular speed, for example by running with them pace yourself\nC2 to be careful not to do something too quickly, so that you do not get too tired to finish it: No more soup, thank you. I'm pacing myself so that I have room for a dessert. Don't try to do everything at once - pace yourself. There's a tremendous amount to see and do in the city, so pace yourself and don't try to do it all on the first day. The secret is to pace yourself and only increase the length of your run once a week. I've had to learn to pace myself in order to preserve my energy. She's not very good at pacing herself and can get pretty exhausted.\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmarch\nmark\nparade\nprance\nquick march! idiom\nsashay\nstamp\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalm and relaxed\npace verb\n(STEP)\nC2 [ I + adv/prep, T ] to walk with regular steps in one direction and then back again, usually because you are worried or nervous: He paced the room nervously. He paced up and down, waiting for the doctor to call.\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmarch\nmark\nparade\nprance\nquick march! idiom\nsashay\nstamp\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nPhrasal verb\npace something off/out\npace noun [U]\n(SPEED)\nAdd to word list\nAdd to word list\nthe speed at which someone or something moves, or with which something happens or changes: She walks four miles every day at a brisk pace. You seem to be working at a slower pace than normal. keep pace\nTo keep pace is to be in the same position as someone or something else as each progresses or moves forward: fig. The Orioles won their ninth straight game to keep pace with Boston.\npace verb\n(WALK)\n[ I/T ] to walk in one direction and then in the opposite direction, often because you are worried or waiting for something to happen: [ I ] She paced back and forth outside the courtroom.\npace verb\n(SPEED)\n[ T ] to move, happen, or progress: It was a cheaply produced film, sluggishly paced and poorly acted.\n[ T ] To pace a group or the members of a group is to lead them or stay even with them: Smith scored 17 points to pace North Springs to a 78-38 victory.\nAdd to word list\nAdd to word list\nthe speed at which something happens or is done: a fast/rapid pace a slow/leisurely/sustainable pace Their economy is expanding at an increasing pace. They are struggling to keep up with the pace of change in the industry.\nforce the pace\nto make things happen more quickly or to force other people to do things more quickly: New technologies are forcing the pace of globalization. There will be no attempt to force the pace at next week's meeting.\nkeep pace with sb/sth\nto manage to do things at the same time or speed as someone else, or as quickly as necessary: They simply can't keep pace with the competition. We need to keep pace with the latest IT developments.\npick up/gather pace\nto start to happen more quickly: The recovery from the global economic crisis is now gathering pace.\nput sb/sth through their paces\nto make someone show you their skills and knowledge, or to test how well something works: As the machines come off the assembly line, a team of quality controllers puts them through their paces. The interview panel will put all candidates through their paces especially in relation to financial skills.\nset the pace\nto be the first to do new things or to do them particularly well, so that other people or organizations have to follow your example if they want to succeed: The company has set the pace for flexibility and rapid turnaround of orders. The department is setting the pace with its use of virtual technology.\npace yourself\nto try not to do things too quickly so that you have enough energy to be able to complete your task successfully: Pacing yourself and setting achievable goals are the keys to success in this business."}