{"id":263015,"name":"pack","type":"verb","us_sound":"pæk","us_link":"../audio/p/pack.mp3","uk_sound":"pæk","uk_link":"../audio/p/ukozone020.mp3","content":"pack verb\n(PUT INTO)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to put something into a bag, box, etc.: We're leaving early tomorrow morning, so you'd better pack (= put clothes and other possessions into suitcases or bags) tonight. She packed a small suitcase for the weekend. He just packed his bags and walked out on his wife and children. I haven't packed my clothes (= put them into a suitcase, etc.) yet. [ + two objects ] Could you pack me a spare pair of shoes, please/pack a spare pair of shoes for me, please? These books need to be packed in/into a box.\n[ T ] to put a material around something before putting it into a bag, box, etc. so that it will not break or be damaged: She packed the vase in tissue paper to protect it.\nMore examplesFewer examplesGo and pack but don't hang around - we have to go in an hour.If we pack this evening, we can leave first thing in the morning.Don't forget to pack an overnight bag .It could be cold and wet so pack some sensible clothes.He had an old toy car that was still packed in its original box.\nSMART Vocabulary: related words and phrases\nWrapping, packing and loading\nblister pack\nbottle\nbottling\nBubble Wrap\nbundle\nfreighter\npack something away\npackaged\npackaging\npacker\npacket\npacking\nparcel\nparcel something up\nrewrap\nsheathe\nshrink-wrap\ntinned\ntraffic light\nwrapping\nSee more results »\npack verb\n(FILL)\n[ I usually + adv/prep, T ] to come or bring together in large numbers or to fill a space: Thousands of fans are packing into the stadium. Fans packed the stadium to watch the final game. The people on the bus were packed (together) like sardines (= there were many of them very close together) .\nMore examplesFewer examplesAll the children's relatives and friends were packed into the tiny theatre.We were all packed together in a small upstairs room.Eager spectators packed the streets.Anderson's supporters packed the courtroom.Hundreds of angry demonstrators are continuing to pack the palace grounds.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\npack verb\n(MASS)\n[ I or T, usually + adv/prep ] to (cause to) form into a solid mass: The wind has packed the snow against the garage door. The snow has packed down tightly, making the streets dangerous to walk on.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\npack verb\n(CARRY)\n[ T ] US slang to carry something, especially a gun: to pack a gun Each missile packs several warheads.figurative This gun packs (= has) a lot of firepower.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProviding weapons or taking weapons away\nIdiom\npack a punchPhrasal verbs\npack something away\npack something in\npack someone in\npack something/someone in\npack something into something\npack someone off\npack something/somewhere out\npack up\npack up (something)\npack (something) up\npack noun [C]\n(GROUP)\nB2 a group, set, or collection of something: The information pack consists of a brochure and a map.\nC2 a group of animals, such as dogs, that live and/or hunt together: a wolf pack a pack of wild dogs\nJim Cumming/Moment Open/GettyImages\nan organized group of children who are brownies or cubs: My uncle was the leader of my Cub pack.\n(US also deck) a set of playing cards: a pack of cards\nDorling Kindersley/GettyImages\nmainly disapproving a group of similar people, especially one that contains people whose activities you do not approve of: a pack of thieves A pack of journalists was waiting outside the White House. See also\ngang\nMore examplesFewer examplesThe shop is giving away a sample pack to every customer.Pick a card from the pack.The girls wanted to join a Brownie pack .The whole report is a pack of lies.Those kids are a real pack of rogues.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal groupings\nNamed organizations & societies & their members\nCard games\nGroups of people\npack noun [C]\n(CONTAINER)\nmainly US a small paper or cardboard container in which a number of small objects are sold : a pack of cigarettes/gum Compare\npacket\npackage\nMore examplesFewer examplesa pack of writing papertwo packs of cookiesWe polished off three six-packs watching the game.Can you buy this type in a multi-pack?You've used a whole pack of tissues.\nSMART Vocabulary: related words and phrases\nWrapping, packing and loading\nblister pack\nbottle\nbottling\nBubble Wrap\nbundle\nfreighter\npack something away\npackaged\npackaging\npacker\npacket\npacking\nparcel\nparcel something up\nrewrap\nsheathe\nshrink-wrap\ntinned\ntraffic light\nwrapping\nSee more results »\npack noun [C]\n(BAG)\n(US also backpack) a type of bag that you usually carry on your back when you are travelling\njonpic/E+/GettyImages\nSMART Vocabulary: related words and phrases\nContainers for carrying personal possessions\nattaché case\nbaggage\nbaggage allowance\nbillfold\nbindle\nbriefcase\nfanny pack\ngarment bag\ngrip\nhand luggage\nhandbag\npannier\npillbox\npocketbook\nportmanteau\nrucksack\nsack\nsaddlebag\nsatchel\nwashbag\nSee more results »\npack noun [C]\n(MASS)\na thick mass of a substance, often like clay, that is used as a beauty treatment for the face\nStephanie Rausser/DigitalVision/GettyImages\na thick mass of cloth, etc. that can be put on an injury to stop any bleeding or swelling: Hold this ice pack to your head to stop the bruising. See also\ncompress noun\nSMART Vocabulary: related words and phrases\nMake-up & skin care\naha\nalpha-hydroxy acid\nanti-wrinkle\nargan oil\nau naturel\nbarefaced\ngreasepaint\nliner\nlipsalve\nlipstick\nmade up\nmascara\nmascaraed\nmask\nmattify\nmudpack\nsuntan lotion\ntoner\nwand\nwarpaint\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical dressings, supports & devices\nIdioms\na pack of lies\na pack rat\nbe ahead of the pack\nused in combination with an amount to show that that many of a particular type of goods have been wrapped and are being sold together: a six-pack of beer a twin-pack of soap a multi-pack of toilet paper\nSMART Vocabulary: related words and phrases\nMiscellaneous units of measurement\nacre\nacreage\ncaloric\ndioptre\nfarad\nfathom\nfirkin\nflashpoint\nhectare\njoule\nMHz\nmolar\nnewton\nradian\nrefractive index\nScoville scale\nSI unit\nsievert\ntorr\nwatt\nSee more results »\npack verb\n(PUT INTO)\nAdd to word list\nAdd to word list\n[ I/T ] to put items into a container, esp. for transporting them or for storage: [ I ] You’d better start packing. [ T ] I forgot to pack my socks. [ T ] Pack your bag, we’re leaving tonight.\npack verb\n(FILL)\n[ T ] to fill a space, or to crowd people or things together, esp. in large numbers: [ T ] People packed Times Square, waiting for the new year to begin. The cooler was packed with cans of soda. fig. How much can you pack into a short vacation?\npack verb\n(PRESS TOGETHER)\n[ T ] to press something consisting of a lot of small pieces together so that they form a solid mass: Nina packed the snow into a hard snowball.\npacked adjective us\nYour browser doesn't support HTML5 audio\n/pækt/\nSeveral people in the packed courtroom were crying. Idiom\npack it inPhrasal verbs\npack someone in\npack off someone\npack up\npack noun [C]\n(GROUP)\na group of animals: Wolves live and hunt in packs.\npack noun [C]\n(PUT INTO)\na number of things usually of the same kind that are tied together or stored in a container, or the container itself: a pack of bubble gum a pack of cards\nA pack is also a backpack.\nAdd to word list\nAdd to word list\nCOMMERCE a container in which things are put to be kept, sold, or sent somewhere, or the contents of a container: a pack of cigarettes Keep the goods in the pack if you might want to return them to the store.\na collection of objects, documents, etc. that are made available as a set : pack of 6/12/20, etc. These items are usually sold in packs of ten. Information packs are available at the front desk. You can download the application pack from our website.\n-pack\nused with a word that describes an amount to show that a collection of objects are being sold together: a six-pack of beer a multipack of pet food These bulbs are sold as a twin-pack only.\nthe pack\na way of referring to the people, companies, etc. that are not the leaders in a particular area of business: The end of a downturn is an excellent opportunity for companies to pull ahead of the pack. See also\nblister pack\nbubble pack\ndisplay pack\nfour-pack\ngift pack\nmultipack\nsix-pack\nCOMMERCE to put something into a container: pack sth in/into sth The fruit is finally packed into wooden crates for shipping.\nto put material around something to protect it before putting it into a container: pack sth in sth The ornaments were carefully packed in soft material before being placed in the box.\nto put food in a particular substance so that it does not decay: pack sth in sth sardines packed in oil\nif people pack a place, they fill it completely: Staff packed the auditorium for her farewell speech.\npack a punch informal\nto have a great effect or influence: This was news that packed a punch in the business community. Her keynote address packed a powerful punch. It was a small company but one that packed a big punch.\nPhrasal verbs\npack sb in\npack sth in\npack (sth) up\npack sth with sth/sb"}