{"id":263034,"name":"packet","type":"noun","us_sound":"ˈpæk.ɪt","us_link":"../audio/p/eus73389.mp3","uk_sound":"ˈpæk.ɪt","uk_link":"../audio/p/ukozone025.mp3","content":"packet noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\nB1 UK a small paper or cardboard container in which a number of small objects are sold: a packet of cereal/biscuits/crisps/peanuts a packet of chewing gum/cigarettes Compare\npack noun (CONTAINER) mainly US\npackage noun\nFernando Trabanco Fotografía/Moment/GettyImages\nUS (UK sachet) a small closed container made of paper or plastic, containing a small amount of something, usually enough for only one occasion: a packet of sugar\nSiede Preis/Photodisc/GettyImages\nUK an object that is wrapped in paper, etc., for example so that it can be sent by post: It will be cheaper to send it as a small packet. Compare\npackage\nAndy Crawford/Dorling Kindersley/GettyImages\nUS several documents provided as a set, giving information about something: Our bookkeeping training packet includes everything you need to get started.\nMore examplesFewer examplesa packet of salt and vinegar crispsYou left the packet open.A packet of white powder was found and police scientists are analysing it.The contents of this packet may settle .She bought a packet of sweets to suck on the journey.\nSMART Vocabulary: related words and phrases\nWrapping, packing and loading\nblister pack\nbottle\nbottling\nBubble Wrap\nbundle\nfreighter\npack something away\npackage\npackaged\npackaging\npacker\npacking\nparcel\nparcel something up\nrewrap\nsheathe\nshrink-wrap\ntinned\ntraffic light\nwrapping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBags in general\nGroups and collections of things\nInformation and messages\npacket noun [C]\n(COMPUTERS)\ncomputing\n&#160; specialized a unit of data that is sent over a computer network\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\npacket noun [C]\n(BODY PART)\nUK offensive (also package) a man's sex organs\npacket noun [C]\n(MONEY)\na packet UK informal\na large amount of money: That house must have cost a packet! Someone's making a packet out of this business.\nSMART Vocabulary: related words and phrases\nLarge amounts of money\na king's ransom idiom\narm\nbig bucks\nblank cheque\nboxcar\nbundle\ncost someone a pretty penny idiom\ncost, charge, etc. the earth idiom\nearth\nfortune\ngratuity\nhandsome\nking\nmake a bundle idiom\nmegabucks\nnot to be sneezed at idiom\npile\npot\nriches\ntreasure\nSee more results »\nAdd to word list\nAdd to word list\na small package or envelope, or a collection of things in it: a packet of stamps\nA packet is also a piece of information that is exchanged between computers or over the Internet: The device converts speech into digital packets that scatter and reassemble at their destination.\nAdd to word list\nAdd to word list\nCOMMERCE\n&#160; UK a small paper or cardboard container used to hold goods, or the contents of the container: an empty cigarette packet He ate a whole packet of biscuits.\nCOMMERCE\n&#160; US a very small container for holding a small amount of a liquid, sugar, etc.: a packet of ketchup Compare\nsachet\nCOMMUNICATIONS\n&#160; ( US also mailer); ( UK also postal packet) a special envelope or container for sending things that can easily break, have an unusual shape, or are very small: In general, cigarettes, alcohol, and aerosols must not be included in postal packets .\nUS ( UK pack) a collection of documents that have been put together as a set: An information packet is available for customers on request.\nIT a collection of data that has been put together as a set: The X .25 interface breaks the datagrams up into 128-byte packets. All data sent over the internet goes in data packets.\ncost/pay/make a packet UK informal\nto cost, pay, or earn a lot of money: The advertising campaign must have cost them a packet. He dropped out of university but now he's making a packet in banking.\nSee also\npay packet\npostal packet\nwage packet"}