{"id":263080,"name":"pact","type":"noun","us_sound":"pækt","us_link":"../audio/p/packed.mp3","uk_sound":"pækt","uk_link":"../audio/p/ukozone023.mp3","content":"Add to word list\nAdd to word list\nC2 a formal agreement between two people or groups of people: The United States and Canada have signed a free-trade pact. [ + to infinitive ] Big drug companies plan to form a pact with the National Institutes of Health to share information. Synonyms\naccord\nagreement (SAME OPINION)\ncompact (AGREEMENT) formal\nconcordat specialized\ncovenant specialized\ntreaty\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nMore examplesFewer examplesa non-aggression pactThe Nazi-Soviet pact carved up the Baltic states in 1939.The leader of the religious sect and 30 of his followers killed themselves in a suicide pact last year.They made a pact never to tell anyone about the accident.Management have formed a pact with the unions.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nwarranty\nwelch\nSee more results »\nAdd to word list\nAdd to word list\na formal agreement between two people or groups of people: a peace pact\nAdd to word list\nAdd to word list\na formal agreement between two or more people, groups of people, or organizations: a pact with sb The free trade pact with the United States should be completed soon. The company has signed a pact with its unions that guarantees no further job cuts."}