{"id":263252,"name":"pagan","type":"adjective","us_sound":"ˈpeɪ.ɡən","us_link":"../audio/p/eus73393.mp3","uk_sound":"ˈpeɪ.ɡən","uk_link":"../audio/p/ukpaddl015.mp3","content":"Add to word list\nAdd to word list\nbelonging or relating to a religion that worships many gods, especially one that existed before the main world religions: a pagan religion The Easter egg has both pagan and Christian origins.\nbelonging or relating to a modern religion that includes beliefs and activities that are not from any of the main religions of the world, for example the worship of nature: The wedding was a pagan ceremony held in a forest. a pagan festival\nSMART Vocabulary: related words and phrases\nReligious concepts: holiness\nbeatitude\nblessed\nbread\nhallowed\nholily\nimpiousness\nkarma\nman cannot live by bread alone idiom\nmartyrdom\nnuminous\nsacred\nsacredly\nsacredness\nsacrilegiously\nsacrosanct\nspirituality\nspiritually\nunspiritual\nvisitation\nworldliness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious beliefs & atheistic beliefs\na person who belongs to a religion that worships many gods, especially one that existed before the main world religions: Originally pagans, the Anglo-Saxons were a Germanic people who invaded Britain in the fifth and sixth centuries.\nhumorous a person who has no religious beliefs:\na person who belongs to a modern religion that includes beliefs and activities that are not from any of the main religions of the world, for example the worship of nature: They are trying to stop some pagans from doing a nature ceremony. It is the nonjudgmental nature of pagans that drew her to them.\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\ndruid\nEpiscopalian\nevangelist\nfakir\nFranciscan\nmissionary\nMohammedan\nMoonie\nmoral majority\nMormon\nsectarianism\nSeventh-Day Adventist\nShia\nShiite\nSikh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: believers & non-believers\nRelated word\npaganism\nAdd to word list\nAdd to word list\nbelonging to or used in a religion that worships many gods: Those altars were used in pagan worship."}