{"id":263284,"name":"page","type":"noun","us_sound":"peɪdʒ","us_link":"../audio/p/eus73394.mp3","uk_sound":"peɪdʒ","uk_link":"../audio/p/ukpaddl017.mp3","content":"page noun [C]\n(PAPER)\nAdd to word list\nAdd to word list\nA1 (written abbreviation p.) a side of one of the pieces of paper in a book, newspaper, or magazine, usually with a number printed on it: For details on how to enter the competition, see page 134. The article appeared on the front page of the New York Times.\none of the sheets of paper in a book, newspaper, or magazine: Several pages have been torn out of this book.\nJose Luis Pelaez/Photodisc/GettyImages\nMore examplesFewer examplesI'd like you to look at the diagram on page 27.The photo was on the front page of all the papers.She ran her finger down the page, looking for her name.Now turn the page, please, and start work on Exercise 2.He turned over two or three pages.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\nNewspapers & magazines\npage noun [C]\n(COMPUTER)\nA2 (also web page) one part of a website See also\nhome page\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\npage noun [C]\n(PERSON)\nin the past, a boy who worked as a servant for a knight and who was learning to become a knight: Below in the courtyard the knights and men-at-arms and pages were already receiving the Queen’s message. He who would become a knight must first learn the rudiments as a page.\nin the past, a man or boy who was the personal servant of an important person: We know de Vere became \"poor\" with only 4 pages or attendants, after having run through his family wealth.\n(also pageboy) a young boy who is one of the people to go with the bride (= the woman who is getting married) into the place where the wedding is taking place: The children of the couple became the bridesmaids and pages. The pages, flower girls, and bridesmaids were waiting for the bride and her father.\na young person whose job is to deliver messages, answer people's questions, do things for other staff, etc. in a company or organization : He is a hotel page. He worked as a page at the old Vernon Branch Library. As young men, her three much older brothers were Senate pages who met Presidents John Kennedy and Richard Nixon.\nSMART Vocabulary: related words and phrases\nPeople who serve other people\nanti-slavery\nbelow/above stairs idiom\nboot boy\nbutler\ndogsbody\ngofer\nhandmaiden\nhousemaid\nlabourer\nlackey\nlady's maid\nretainer\nserf\nserfdom\nservant\nskivvy\nslave\nslaver\nvalet\nvassal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeddings\nIdioms\na page in/of history\ntake a page from someone/something\nto call a person using a loudspeaker (= an electric device for making sounds louder) in a public place: He was paged at the airport and told to return home immediately.\nto send a message to someone's pager (= small electronic device that receives signals): Have you tried to page him?\nSMART Vocabulary: related words and phrases\nCommunications - messaging\nbeep\nbleeper\ndirect message\nDM\nfacsimile\nfax\nintercom\nMailgram\nmessage\nmessaging\np.m.\npager\nresend\nTelemessage\ntelex\ntext\ntext message\nthnq\ntweet\ntweetstorm\nSee more results »\npage noun [C]\n(PAPER)\nAdd to word list\nAdd to word list\n(abbreviation p.) one side of a sheet of paper in a book, newspaper, magazine, etc.: What page are the baseball standings on? It’s a terrific novel, but it’s over 800 pages long. The article is continued on page 43 (= a side of a sheet of paper numbered 43).\npage noun [C]\n(COMPUTER)\na group of text and images shown together on a computer screen: Do you have a home page? It took her only 20 minutes to customize a Web page.\npage verb [T]\n(COMMUNICATE)\nto communicate with someone by having that person’s name announced publicly or by sending a signal to an electronic device the person is carrying: Doctors are paged by their answering services at all hours.\nAdd to word list\nAdd to word list\n(abbreviation p) a side of one of the pieces of paper in a book, newspaper, or magazine, usually with a number printed on it: Open your book and look at page nine. Even the major newspapers let important news slip off the front page.\n[ often plural ] one of the sheets of paper in a book, newspaper, or magazine: A page had been ripped out of the magazine.in the pages of sth There were several interesting articles to be found in the pages of the Wall Street Journal today. the financial/sports/news pages the business/culture/advertising pages\nINTERNET\n&#160; (also web page) one part of a website: Your page on the social networking site enables you to share your business profile. We added a jobs page to the website. Compare\nhome page\nIT the text of an electronic document that you can see on a computer screen: You have to scroll down the page to find the information you're looking for.\nCOMMUNICATIONS a message received on a pager (= a small piece of electronic equipment that moves or makes a noise to tell you to phone someone): send a page to sb I asked the nurse to send a page to the doctor.\nbe on the same page\nto have the same ideas as someone else: Everyone in the office has to be on the same page about what our top priorities are.\nto call a person using a loudspeaker in a public place: He was paged at the airport and told to return home immediately.\nto send a message to someone's pager : As soon as you're finished with the download, page me. Phrasal verb\npage through sth"}