{"id":263374,"name":"paid","type":"verb","us_sound":"peɪd","us_link":"../audio/p/paid.mp3","uk_sound":"peɪd","uk_link":"../audio/p/ukpaddl024.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npay\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nbeing given money for something: Are you looking for paid work or voluntary work? paid employmentUK paid holidayUS paid vacation paid leave\nused in combination to refer to the amount of money that someone is given for their work: low-paid workers a well-paid job\nMore examplesFewer examplesShe's finally in paid employment.I really need to find some paid work.She can take up to three weeks of paid leave.I can take some time off work but it won't be paid.What a luxury to have a paid holiday.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nAdd to word list\nAdd to word list\npast simple and past participle of pay\nAdd to word list\nAdd to word list\nFINANCE, ECONOMICS a paid job, activity, or period of time is one for which you are given money: After retiring from politics, he earned millions giving paid speeches and writing books.paid job/position/post Ms. Larkin later took a paid government post.paid work/employment Many of these women, aged 40 and over, are just returning to paid employment.paid holiday/vacation/leave Labor unions have made paid family leave a top priority.paid overtime/time off Will we receive paid overtime for the extra work? Employees who work Christmas Day are given a paid day off in compensation.low-paid/poorly paid In the interview, she mentioned the number of black workers in low-paid jobs.high-paid/well-paid Students want to get a degree and start work in a well-paid career.\nFINANCE, ECONOMICS a paid worker, employee, etc. is given money for work that they do: For years, he was a paid informant to the police.a paid consultant/advisor/contractor Ms. Minow also criticized the wisdom of using paid advisers as consultants.high-paid/best-paid He has been called Britain's highest-paid civil servant.low-paid/poorly paid The people who clean our most expensive buildings are often our most poorly paid employees. Compare\nvolunteer\nACCOUNTING, TAX used to talk about an amount of money that was owed to someone for which a payment has been made: The invoice was marked 'paid' in red letters. I spent my day filing paid bills in a dark basement. a paid parking ticket\nCOMMERCE a paid service is one which people must pay for in order to have it: The paid internet service was three times faster than the free one. The magazine also publishes paid business listings in its back pages.\nCOMMERCE used to describe a person who has paid money for a service: The news website has 2 million paid subscribers. See also\ndelivered duty paid\nduty-paid\nemployer-paid\nfully-paid shares\npartly-paid shares\npostage paid adjective\nprepaid\nreply paid\nunderpaid\nunpaid"}