{"id":263429,"name":"pain","type":"noun","us_sound":"peɪn","us_link":"../audio/p/pain.mp3","uk_sound":"peɪn","uk_link":"../audio/p/ukpaddl026.mp3","content":"Add to word list\nAdd to word list\nA2 a feeling of physical suffering caused by injury or illness: Her symptoms included abdominal pain and vomiting. Are you in (= suffering from) pain? She was in constant pain. These tablets should help to ease the pain. I felt a sharp pain in my foot. He's been suffering various aches and pains for years.\nThesaurus: synonyms, antonyms, and examples\npainpainThere are drugs you can take to ease the pain.agonyMothers will often talk about the agony of childbirth.sorenessIf you sailed through the exercises without soreness, you can move on.acheI developed a dull ache in my jaw.discomfortSometimes receding gums can cause discomfort.stingBee stings can cause an allergic reaction in some people.\nSee more results »\nB2 emotional or mental suffering: It's a film about the pains and pleasures of parenthood. The parents are still in great pain over the death of their child.\nThesaurus: synonyms, antonyms, and examples\nemotional painpainDivorce can cause a lot of pain and suffering.hurtThe hurt caused by the break-up was almost unbearable.griefAfter his death, her grief was unbearable.heartacheAfter all the tears and heartache, there is light at the end of the tunnel.heartbreakMany of us have known our share of heartbreak.\nSee more results »\nMore examplesFewer examplesShe cried out in pain as the bullet grazed her shoulder.He collapsed, groaning with pain.I felt a sharp pain and looked down to see blood pouring from my leg.She went to the doctor complaining of chest pains.Aspirin reduces pain and inflammation.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsting\nstitch\nthrob\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSadness and regret\nIdioms\non/under pain of death\na pain (in the neck)\na pain in the arse/backside\nIf something pains you, it causes you to feel sad and upset: [ + to infinitive ] It pains me to see animals being mistreated.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone emotionallyhurtI'm sorry, I didn't mean to hurt you.hurt someone’s feelingsDon't say anything - you'll hurt her feelings.upsetI'm sorry the news upset you.woundHe had wounded her pride more than she would ever have admitted.painIt pains me to admit it, but there's nothing I can do to change the situation.grieveIt grieved him that he had been the cause of all the bitterness.\nSee more results »\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\nAdd to word list\nAdd to word list\na bad or unpleasant physical feeling, often caused by injury or illness, that you want to stop, or an emotional feeling of this type: [ U ] Your whole perspective on life changes when you’re in pain. [ C ] He was admitted to the hospital with chest pains. pain verb [ T ] us\nYour browser doesn't support HTML5 audio\n/peɪn/\nfml It pained him when he did not make the high school football team. painful adjective us\nYour browser doesn't support HTML5 audio\n/ˈpeɪn·fəl/\nA painful leg injury forced her to withdraw from the competition. Idiom\na pain (in the neck)"}