{"id":263462,"name":"paint","type":"noun","us_sound":"peɪnt","us_link":"../audio/p/eus73396.mp3","uk_sound":"peɪnt","uk_link":"../audio/p/ukpaink007.mp3","content":"Add to word list\nAdd to word list\nA1 a coloured liquid that is put on a surface such as a wall to decorate it: UK a tin of paintUS a can of paint This wall needs another coat of paint. The sign said \"Caution! Wet paint.\" gloss paintUK matt paintUS matte paint There were so many paints (= types of paint) to choose from that I couldn't decide which to buy.\nlisegagne/iStock/Getty Images Plus/GettyImages paints [ plural ]\ntubes of paint or blocks of dried paint used for making pictures: oil paints\nSee more the paint [ singular ] informal\nanother word for\nfree-throw lane : He is a dominating presence in the paint. I liked his quickness going coast to coast and his ability to get in the paint.\nMore examplesFewer examplesCan't you just put a dab of paint over the mark and cover it up?emulsion paintI got a few flecks of paint on the window.The living room could do with a lick of paint.The new paint is already starting to crack and peel.\nSMART Vocabulary: related words and phrases\nPaints, dyes & pigments\nannatto\nbrazilwood\ncolourant\ndip dye\ndyer\nenamel\nhenna\nlacquer\nlogwood\nmarbling\nnon-drip\npaint thinner\npigment\nspray gun\nthinner\ntinted\ntopcoat\nturpentine\nundercoat\nvarnish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nA2 [ I or T ] to cover a surface with paint: [ + obj + adj ] We've painted the bedroom blue. I've been painting all morning. I'll need to paint over (= cover with another layer of paint) these dirty marks on the wall.\nA1 [ I or T ] to make a picture using paints: All these pictures were painted by local artists.\n[ T ] If you paint your nails or face, you put make-up on that part of your body: She painted her nails bright red.\nMore examplesFewer examplesThe room was painted a subtle shade of pink.We used four tins of paint when we painted the ceiling.Put several thicknesses of newspaper on the table before you start painting.She was painting her toenails.She usually paints in watercolour.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: interior decoration\nPainting, drawing & printing\nMake-up & skin care\nIdioms\npaint a picture (of something)\npaint the town red\nAdd to word list\nAdd to word list\na colored liquid that is put on a surface to protect or decorate it: [ C ] acrylic/oil paints [ U ] We need some white paint for the kitchen. Idiom\npaint a picture (of something)\nSomeone who paints may make a picture by using paints: [ I ] She always loved to paint."}