{"id":263506,"name":"pair","type":"noun","us_sound":"per","us_link":"../audio/p/pair.mp3","uk_sound":"peər","uk_link":"../audio/p/ukpaink014.mp3","content":"Add to word list\nAdd to word list\nA2 two things of the same appearance and size that are intended to be used together, or something that consists of two parts joined together: a pair of shoes/gloves a pair of scissors/glasses I can't find a matching pair of socks. He packed two pairs of trousers and four shirts. I'd like you to do this exercise in pairs (= in groups of two).\nD_Zheleva/iStock/Getty Images Plus/GettyImages\ntwo people who have a romantic relationship or are doing something together: They seem a very happy pair. What have the pair of you been up to? Synonyms\ncouple (TWO PEOPLE)\ntwosome\ntwo animals that come together to have sex and produce young: a breeding pair a mated pair of swans Compare\ncouple noun (TWO PEOPLE)\nMore examplesFewer examplesRachel bought yet another pair of shoes to add to her collection.I burrowed through the clothes in the drawer looking for a clean pair of socks.She was wearing an old pair of trousers with rips at the knees.Shoplifters often work in pairs, with one creating a diversion to distract the shop assistants while the other steals the goods.You should see her wardrobe - it's unbelievable - she's got about 50 pairs of shoes.\nSMART Vocabulary: related words and phrases\nNumbers: groups of things according to number\nbaker's dozen\nbrace\ncompanion\ncouple\ndozen\ndyad\ndyadic\ngross\nnull\nquaternity\nscore\ntriad\ntrinity\ntrio\ntwosome\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nAnimal reproduction\nAnimal groupings\nto make something one of a pair, or to become one of a pair: Famous paintings have been paired with poems by Sandburg, Angelou, and others. Opposite\nuncouple\nSMART Vocabulary: related words and phrases\nCreating alliances\naffiliate\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\nintegrate\njoin\nnetwork\npair off\npair up\npairing\nSee more results »\nPhrasal verbs\npair off\npair someone off\npair (someone) off\npair up\nAdd to word list\nAdd to word list\ntwo things of the same appearance and size that are intended to be used together, or something that consists of two parts joined together: a pair of gloves/shoes a pair of pants/scissors Each package contains three pairs of socks.\nto make or become one of a pair: [ T ] Famous paintings have been paired with poems by Sandburg, Angelou, and others. Phrasal verb\npair off\nAdd to word list\nAdd to word list\ntwo people, things, or organizations that work, are used, or appear together: The pair are accused of securities fraud. The carpenters worked in pairs.\n[ T ] (also pair off) to combine two things to produce a particular result: pair (off) sth with sth He is asking the state for a $26 million investment to be paired with private support of $10 million. Some funds combine long and short positions, usually pairing off stocks in the same industry.\n[ I or T ] to put two people or groups together to work or learn something, or to form a group of two for these purposes: The instructor paired us off, so that we could test the new techniques.pair sb (off) with sb Ms. Morris was paired with Ms. Lindsay, with whom she spent two days learning about various aspects of running a wine business. Employees paired off and began their tasks."}