{"id":263660,"name":"palaeogene","type":"adjective","us_sound":"ˈpeɪ.li.oʊ.dʒiːn","us_link":"../audio/p/cdo0318uspala3517.mp3","uk_sound":"ˈpæl.i.ə.dʒiːn","uk_link":"../audio/p/cdo0318ukpala1021.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 66 and 23 million years ago, in which many insects, mammals, and birds appeared: the Palaeogene period Palaeogene flora and fauna\nMore examplesFewer examplesThe earliest Palaeogene landscape was covered by ferns.The ancestors of modern camels evolved in North America during the Palaeogene period.In England, Palaeogene rocks are preserved in two E–W trending tectonic basins, the London Basin and the Hampshire Basin.\nSMART Vocabulary: related words and phrases\nPrehistory\nanatosaurus\napatosaurus\nAustralopithecus\nbrachiosaurus\nbroch\nhenge\nHolocene\nice age\nichthyosaur\niguanodon\nPhanerozoic\npictograph\nPleistocene\nPliocene\npost-glacial\nraptor\nSilurian\nstanding stone\nstegosaurus\nstone-age\nSee more results »\nthe Palaeogene\nthe period of time between about 66 and 23 million years ago, in which many insects, mammals, and birds appeared: In the Early Palaeogene, the earth was mainly made up of forests and woodlands. Sea-level change in the Late Palaeogene exposed the present-day lowland landscape.\nMore examplesFewer examplesSouth America was an island during the Palaeogene.Scientists previously believed dyrosaurids diversified in the Palaeogene.Across ecosystems, the Palaeogene also marks a rapid radiation of new species filling in empty ecological niches.\nSMART Vocabulary: related words and phrases\nPrehistory\nanatosaurus\napatosaurus\nAustralopithecus\nbrachiosaurus\nbroch\nhenge\nHolocene\nice age\nichthyosaur\niguanodon\nPhanerozoic\npictograph\nPleistocene\nPliocene\npost-glacial\nraptor\nSilurian\nstanding stone\nstegosaurus\nstone-age\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecific periods of time\nGeology - general words"}