{"id":264120,"name":"palette","type":"noun","us_sound":"ˈpæl.ət","us_link":"../audio/p/palate.mp3","uk_sound":"ˈpæl.ət","uk_link":"../audio/p/ukpaink028.mp3","content":"Add to word list\nAdd to word list\na thin board with curved edges and a hole for your thumb, used by artists to mix their paints on while they are painting: I was like an artist with his palette. He showed his student how to prepare a palette.\nlightmax/iStock/Getty Images Plus/GettyImages\nart\n&#160; specialized the range of colours that a painter, photographer, film maker, etc. usually uses: Matisse's palette typically consists of bright blues, greens and oranges. The director returns to the saturated colour palettes that made him famous.\nthe range of colours used in the decoration of a house, etc.: She chose a muted palette - putty green in the living room, a rich brown in the bedroom. I love this quilt, the colour palette is so soft and soothing.\ncomputing\n&#160; specialized the range of colours available to the user of a computer, etc.: Pixels of two colours from the 16 colour palette could be displayed in each block.\na flat case containing make-up such as eyeshadow or highlighter of different colours: This palette contains nine of our bestselling eye colours. I decided I just couldn't live without those glamorous makeup palettes that I spotted in duty free.\nSMART Vocabulary: related words and phrases\nPainting & drawing materials\nairbrush\nblank canvas\nbrush\ncanvas\ndrawing board\neasel\nglitter\nmanikin\nmannikin\noil\npaint\npaintbrush\npalette knife\npencil\nposter colour\nposter paint\nstencil\ntemplate\nwatercolour\nwoodblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColour - general words\nComputer concepts\nMake-up & skin care\nAdd to word list\nAdd to word list\na thin board that artists use to hold and mix paints before putting them on the picture surface, or a range of colors, esp. those typically used by an artist: Van Gogh’s palette included brilliant yellows and blues."}