{"id":264279,"name":"palliative","type":"adjective","us_sound":"ˈpæl.i.ə.t̬ɪv","us_link":"../audio/p/eus73401.mp3","uk_sound":"ˈpæl.i.ə.tɪv","uk_link":"../audio/p/ukpalef015.mp3","content":"Add to word list\nAdd to word list\nmedical\n&#160; specialized (of a drug or medical treatment) reducing pain without curing the cause of the pain: Older people facing a terminal illness may want to choose palliative care only. The success of chemotherapy as a form of palliative treatment depends on the type of tumour.\nformal making a problem seem less serious but not solving the problem or making it disappear: Short-term, palliative measures were taken which gave the appearance that the problems were being addressed. Some of the palliative strategies do not make sense.\nMore examplesFewer examplesWe need to integrate palliative care into mainstream medicine.The only feasible treatment is palliative.All of these will be only palliative measures if we go on increasing our global population.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nCaplet\nchemotherapy\ndosage\ndose\nelixir\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\noverdose\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSolving and solutions\nmedical\n&#160; specialized a drug or medical treatment that reduces pain without curing the cause of the pain: Most of the AIDS research community were either working on vaccines for prevention or on stronger palliatives. The substance has been consumed as a palliative by indigenous groups in Appalachia.\nformal something that makes a problem seem less serious but does not solve the problem or make it disappear: We want long-term solutions, not short-term palliatives. Knitting became a palliative for Mary as the long miserable days stretched out ahead.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nCaplet\nchemotherapy\ndosage\ndose\nelixir\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\noverdose\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSolving and solutions"}