{"id":264759,"name":"pandemic","type":"adjective","us_sound":"pænˈdem.ɪk","us_link":"../audio/p/uspalav030.mp3","uk_sound":"pænˈdem.ɪk","uk_link":"../audio/p/ukpampe015.mp3","content":"Add to word list\nAdd to word list\n(of a disease) existing in almost all of an area or in almost all of a group of people, animals, or plants: In some parts of the world malaria is still pandemic. A report on pandemic flu released last year said \"the potential for catastrophe is immense.\"\nMore examplesFewer examplesExperts estimated pandemic influenza might kill between 89,000 and 207,000 people in the United States.The WHO \"Pandemic Control Room\" is designed to map and track the spread of a pandemic virus.They prayed for an end to pandemic disease throughout the world.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\ninfantile\noutbreak\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\na disease that exists in almost all of an area or in almost all of a group of people, animals or plants: The COVID-19 pandemic spread to the United Kingdom in late January 2020. an influenza pandemic\nMore examplesFewer examplesThe 1918 flu pandemic caused death and devastation on an unimaginable scale.Leading researchers believed a human pandemic was not only inevitable but overdue.The AIDS pandemic ravaged countries in sub-Saharan Africa.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\ninfantile\noutbreak\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nAdd to word list\nAdd to word list\na dangerous disease that infects many people at one time: What can be done to prevent a bird flu pandemic? pandemic adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/pænˈdem·ɪk/\nScientists who study viruses say they don't know what a pandemic strain would look like."}