{"id":264946,"name":"panic","type":"noun","us_sound":"ˈpæn.ɪk","us_link":"../audio/p/panic.mp3","uk_sound":"ˈpæn.ɪk","uk_link":"../audio/p/ukpampe024.mp3","content":"Add to word list\nAdd to word list\nB2 a sudden strong feeling of fear that prevents reasonable thought and action: a state of panic Panic spread through the crowd as the bullets started to fly. Carmel was in a panic about her exam. He got in(to) a panic that he would forget his lines on stage.\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\nMore examplesFewer examplesHyperventilation can be caused by fear or panic.I was in a mad panic trying to get everything ready.A wave of panic swept through the crowd and people started running.The explosion sent the crowd into a panic.To say that her resignation was a shock would be an understatement - it caused panic.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\ncold sweat\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nB2 to suddenly feel so worried or frightened that you cannot think or behave calmly or reasonably: Don't panic! Everything will be okay. The sound of gunfire panicked the crowd. The boss always panics over/about the budget every month.\nMore examplesFewer examplesDon't panic - it mightn't be true.Don't panic, there's bags of time yet.Panicking isn't going to help the situation.I suddenly thought no one was going to come and panicked.He panicked and slammed his foot on the brake.\nSMART Vocabulary: related words and phrases\nAfraid\nafraid\nafraid for someone/something\nafraid of someone/something\nbe in fear of your life phrase\nbe like a deer/rabbit caught in the headlights idiom\nbottle\nfrit\ngoosey\ngun-shy\nhave a horror of something idiom\nhorror-struck\nleaf\nquake\nshake\nshake like a leaf idiom\nshit a brick idiom\nsquirrelly\nterrified\nterror\nterror-stricken\nSee more results »\nAdd to word list\nAdd to word list\na sudden, strong feeling of anxiety or fear that prevents reasonable thought and action and may spread to influence many people: [ U ] When fire broke out, 602 people died in the panic that ensued.\nPanic is also used to describe any behavior that is sudden, extreme, and results from fear: [ C ] A brief panic overtook the financial markets in October. panic verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈpæn·ɪk/ present participle panicking | past tense and past participle panicked\n[ I ] The driver who hit him panicked and fled. panicky adjective us\nYour browser doesn't support HTML5 audio\n/ˈpæn·ɪ·ki/\na panicky feeling Idiom\nhit the panic button\nAdd to word list\nAdd to word list\na sudden strong feeling of fear that prevents reasonable thought and action: panic about/over sth There is no cause for panic about oil prices.a state/wave of panic The government was in a state of panic.cause/trigger panic The drop in prices could cause panic among investors. There is no sense of panic yet or any feeling that this is the start of a long-term decline in the pound.\nto suddenly feel so worried or frightened that you cannot think or behave reasonably, or to cause someone to feel this: There is no need for home buyers to panic.panic about/over sth Should people with savings panic about the safety of their money? Oil producers were panicked by the drop in oil prices.panic sb into doing sth The delay in consumer spending means that shops may be panicked into cutting prices.\nresulting from a feeling of panic: panic buying/selling Panic buying has led to fears that almost half the gas stations could run out of fuel by tomorrow.a panic measure/reaction The private meeting was a panic reaction to the news of the merger."}