{"id":265442,"name":"paper","type":"noun","us_sound":"ˈpeɪ.pɚ","us_link":"../audio/p/paper.mp3","uk_sound":"ˈpeɪ.pər","uk_link":"../audio/p/ukpanor026.mp3","content":"paper noun\n(MATERIAL)\nAdd to word list\nAdd to word list\nA1 [ U ] thin, flat material made from crushed wood or cloth, used for writing, printing, or drawing on: a piece/sheet of paper writing paper Dictionaries are usually printed on thin paper. a paper bag This card is printed on recycled paper (= paper made from used paper). Get the idea down on paper (= write it) before you forget it. She works on paper (= writes things on paper) because she hates computers.\nUlf Wittrock/EyeEm/GettyImages\nMore examplesFewer examplesI didn't realize we had to write each answer on a new sheet of paper.The parcel had only been loosely wrapped, and the paper had come off.Have you got a scrap of paper I could write on?He rifled through the papers on the desk, but couldn't find the photographs.The leaflets will be printed on recycled paper.\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\npaper noun\n(DOCUMENT)\nB1 [ C ] a newspaper: a daily/weekly/local/national paper The photo was on the front page of all the papers. papers [ plural ]\nofficial documents, especially ones that show who you are: The border guards stopped me and asked to see my papers.\nSee more\nA2 [ C ] UK a set of printed questions for an exam: Candidates must answer two questions from each paper. The geography paper is not till next week.\nC2 [ C ] a piece of writing on a particular subject written by an expert and usually published in a book or journal, or read aloud to other people: He will give a paper on thermodynamics at a conference in Berlin.\nB1 [ C ] US (UK essay) a short piece of writing on a particular subject, especially one done by students as part of the work for a course: Mr Jones thought my history paper was terrific. For homework I want you to write a paper on endangered species.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncirculation\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nrag\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExams, tests & exercises\nPapers and compositions\nIdioms\nsomeone couldn't act, argue, fight, etc. their way out of a paper bag\non paper\na paper chase\nto cover a wall, room, etc. with wallpaper\nSMART Vocabulary: related words and phrases\nBuilding: interior decoration\naesthetic\nbacksplash\nboho\ncaulk\nchinoiserie\ndo something out\nfeng shui\nflock wallpaper\nflocked wallpaper\nfurbish\ninterior design\nlighting\nmasking tape\nmood board\nmoulding\nredo\nrehang\nsplashback\ntablescape\ntablescaping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCurtains & wallpaper\nPhrasal verb\npaper over something\nAdd to word list\nAdd to word list\na thin, flat material made from crushed wood or cloth used esp. for writing and printing on and in packaging: [ U ] a piece/sheet of paper [ U ] a paper bag/towel [ U ] paper cups/napkins/plates Let's put some of your good ideas down on paper (= write them down)\nA paper is also a newspaper: [ C ] I read it in the paper.\nA paper is also a piece of writing by a student for a course: [ C ] One of the course requirements is a 20-page paper. Idiom\non paper\nto put wallpaper (= decorative paper) on a surface, esp. a wall: We plan to paper the dining room.\nAdd to word list\nAdd to word list\n[ U ] thin, flat material used for writing, printing, or drawing on: There was a huge stack of papers on her desk.a sheet/piece of paper Someone had printed the memo on yellow sheets of paper and posted it around the office. The paper industry recovery of the last year shows little sign of slowing down.\n[ C ] a newspaper, or the company that owns and operates a newspaper: Murdoch has made an offer to buy the paper.in the papers There was nothing about the trial in the papers this morning. an article in Hong Kong's leading financial paper a daily/weekly paper a local/national paper\n[ U ]\n&#160; FINANCE\n&#160; (also financial paper) assets in the form of bonds, shares, etc., as opposed to cash: The rise in share prices encourages bidders to issue their own paper. The system failed because people realized that the securitized financial paper was not worth the top rating it had received.\npapers\n[ plural ] official documents that show who you are: The company was fined for hiring over a hundred immigrants without papers.\nLAW, GOVERNMENT an official government or legal document: Lawyers argued in papers submitted last month that lower courts were wrong to dismiss the lawsuit. The committee issued a paper stating that further information and analysis was required.\n[ C ] a piece of writing on a particular subject, written by an expert and usually published in a book or journal: The paper recommends a series of steps for dealing with the problem.\non paper\nwritten or printed on paper: The engineers worked out their ideas on paper.\nused to say that although an idea seems good when you think of it, it may not be so good when you try to use it: It's a good plan on paper, but will it really work? See also\nbearer paper\ncommercial paper\nfine paper\ntrade paper\nwhite paper\nworking paper"}