{"id":265628,"name":"par","type":"noun","us_sound":"pɑːr","us_link":"../audio/p/par.mp3","uk_sound":"pɑːr","uk_link":"../audio/p/ukpaper012.mp3","content":"par noun\n(EQUAL)\non a par (with someone/something)\nAdd to word list\nAdd to word list\nthe same as or equal to someone or something: The regeneration of the city's downtown dock front will put it on a par with Nice or Cannes.\nSee more\npar noun\n(STANDARD)\n[ U ] the usual standard or condition\n[ U ] the expected number of times in golf that a good player should have to hit the ball in order to get it into a hole or into all the holes: Tiger Woods finished the round 10 below/under par. par (value) finance &amp; economics\n&#160; specialized\nthe original value of a share, bond, etc. when it is made available for sale for the first time: Clients will be entitled to borrow 100 percent of the par value of their securities at a low interest rate.\nSee more\nSMART Vocabulary: related words and phrases\nAverages\naverage\naverage out at something\naverage something out\nhappy medium\nlaw\nmean\nmedian\nmedium\nmiddle\nthe law of averages idiom\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nIdioms\nbe par for the course\nbe up to par\nbelow/under par\nAdd to word list\nAdd to word list\nthe usual standard or condition: About half the teachers are good, and the rest are clearly below par.\nIn golf, par is the expected number of times a good player should have to hit the ball in order to get it into a hole or into all the holes: Walker shot a par 72 for the victory. Idioms\non (a) par with someone/something\npar for the course\nabbreviation for paragraph\nAdd to word list\nAdd to word list\nFINANCE\n&#160; (also nominal price) the original value of a share, bond, etc. when it is first available for sale: at par The bonds were priced at par with an initial yield of 4.4%.a par value of sth The Board of Directors authorized the designation of 1,000,000 shares of stock, with a par value of $0.10 per share.\nunder/below/sub par\nworse than the usual or expected standard: California ranks below par in tackling the retiree health-care issue.\non a par with sb/sth UK (US on par with sb/sth)\nthe same as or equal to someone or something: It is rated on a par with its rivals despite outperforming its sector in almost every measure. People often don't insist on raises that keep their pay on par with inflation.\npar for the course\na situation or standard of work or behaviour that is considered normal or typical: Massive management fees, he says, are par for the course in keeping an international operation running. The company's stock was hit hard today, but that's par for the course in this economy. See also\npar bond"}