{"id":265724,"name":"parachute","type":"noun","us_sound":"ˈper.ə.ʃuːt","us_link":"../audio/p/parachute.mp3","uk_sound":"ˈpær.ə.ʃuːt","uk_link":"../audio/p/ukpaper018.mp3","content":"Add to word list\nAdd to word list\nB2 a piece of equipment made of a large piece of special cloth that is fastened to a person or thing that is dropped from an aircraft, in order to make him, her, or it fall slowly and safely to the ground See also\nchute\nAngela Rohde/EyeEm/GettyImages\nExamples\na parachute harnessAirborne troops were dropped by parachute behind enemy lines.For whatever reason his parachute failed to open.She's agreed to do a parachute jump for charity.There was a large tear in his parachute.\nSMART Vocabulary: related words and phrases\nAir travel: balloons & parachutes\naeronaut\naerostat\nairship\nballoon\nbarrage balloon\nblimp\ncanopy\nchute\ndirigible\nhot-air balloon\nripcord\nweather balloon\nwingsuit\nZeppelin\nparachute verb\n(FROM AIRCRAFT)\n[ I usually + adv/prep ] to jump from an aircraft using a parachute: The plan is to parachute into the town.\n[ T usually + adv/prep ] to drop someone or something from an aircraft by parachute: [ often passive ] Thousands of leaflets were parachuted behind enemy lines.\nSMART Vocabulary: related words and phrases\nAir sports\nbase jumper\nbase jumping\nglide\ngliding\nhang-gliding\nparaglider\nparagliding\nparamotor\nparamotoring\nparapente\nparascending\npowered paraglider\npowered paragliding\nPPG\nskydiver\nskydiving\nslow roll\nwingsuiting\nYou can also find related words, phrases, and synonyms in the topics:\nMoving downwards\nparachute verb\n(INTO SITUATION)\n[ I or T + adv/prep ] to enter a situation without previously being involved in it, especially to offer temporary help, or to bring someone into a situation in this way : She parachutes into hospitals that desperately need nurses and stays three months or so. Before Hancock was parachuted in, sales had been falling consistently.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\ncatch\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nSee more results »\nAdd to word list\nAdd to word list\na large, usually circular piece of special cloth fastened to someone or something so that when dropped from an aircraft, it will catch the wind like a sail to make the person or thing fall slowly and safely to the ground parachute verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈpær·əˌʃut/\n[ I ] When the plane went down, three of the crewmen parachuted to safety.\nAdd to word list\nAdd to word list\n[ T ] to send a manager, politician, etc. to a new place that they have no previous connection with: He was parachuted into the failing corporation's headquarters in hopes that he could rescue it. See also\ngolden parachute"}