{"id":266300,"name":"paraprofessional","type":"noun","us_sound":"ˌper.ə.prəˈfeʃ.ən.əl","us_link":"../audio/p/cdo0319uspara1275.mp3","uk_sound":"ˌpær.ə.prəˈfeʃ.ən.əl","uk_link":"../audio/p/cdo0319ukpara1164.mp3","content":"Add to word list\nAdd to word list\na person who has some training in a job such as teaching or law, but does not have all the qualifications to be a teacher, lawyer, etc.: A paraprofessional, although not a licensed teacher, performs many of the same duties as a certified teacher.\nMore examplesFewer examplesWe offer training programmes for persons, including professionals, paraprofessionals, and volunteers, who work with delinquents.The prisoner was communicating with his counsel via a paraprofessional.The union represents teachers and other professional employees, paraprofessionals, and technical and clerical personnel.They found that it was mostly paraprofessionals, typically people who have high school diplomas or GEDs, who were working with patients.\nSMART Vocabulary: related words and phrases\nQualifications: school & vocational\nA level\nAS level\nbac\nbaccalaureate\nbona fides\ncertified\nCSE\ndiploma\nGCE\nGCSE\nHNC\nHND\nHSC\nHSED\nmatric\nOrdinary level\nqualification\nrecertification\nVantage\nWaystage\nSee more results »\nrelating to a person who has some training in a job such as teaching or law, but does not have all the qualifications to be a teacher, lawyer, etc., or to the work that they do: She worked as a paraprofessional educational assistant. The difference between professional and paraprofessional pay can be substantial.\nMore examplesFewer examplesI don't agree with the distinction between paraprofessional and professional library work. Workforces often consisted of male, white attorneys and female paraprofessional staff. It has been suggested that paraprofessional therapists (defined as those without post-graduate clinical training) may achieve equivalent outcomes to professionals.\nSMART Vocabulary: related words and phrases\nQualifications: school & vocational\nA level\nAS level\nbac\nbaccalaureate\nbona fides\ncertified\nCSE\ndiploma\nGCE\nGCSE\nHNC\nHND\nHSC\nHSED\nmatric\nOrdinary level\nqualification\nrecertification\nVantage\nWaystage\nSee more results »"}