{"id":266382,"name":"parasitic","type":"adjective","us_sound":"ˌper.əˈsɪt̬.ɪk","us_link":"../audio/p/eus73424.mp3","uk_sound":"ˌpær.əˈsɪt.ɪk","uk_link":"../audio/p/ukparas001.mp3","content":"parasitic adjective\n(ORGANISM)\nAdd to word list\nAdd to word list\nParasitic organisms live on other animals or plants of a different type and feed from them: A parasitic brain worm is killing moose in Minnesota. They have developed methods to combat any future outbreak of this parasitic weed. The bees were attacked by a tiny parasitical mite.\nA parasitic disease is caused by a parasite (= an animal or plant that lives on or in another animal or plant of a different type and feeds from it): The parasitic disease that causes the most deaths worldwide is malaria. There is now an effective vaccine against the parasitic bronchitis produced by lungworm in cattle. These chemicals lower the fish's resistance to parasitical diseases and fungi.\nMore examplesFewer examplesBees are under attack from two different parasitic mites.Parasitic wasps, flies and spiders are natural enemies of the larvae.The fast metabolism of young fish makes them more vulnerable to fatal parasitic infection.\nSMART Vocabulary: related words and phrases\nPlants & animals - general words\nanimal kingdom\nanti-parasitic\nautotroph\nbiota\nbiped\nfamily\nfauna\nflora\nflora and fauna\ngreenery\nnatively\nnon-mammalian\nnon-placental\nomnivore\nomnivorous\nsecondary consumer\nsongster\nterrestrially\nundomesticated\nvegetation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nparasitic adjective\n(PERSON)\ndisapproving A parasitic person lives by other people working, giving them money, etc. : We live in a world where society is directed to satisfy the greed of a tiny parasitic elite. Football attracts parasitical advertisers keen to feed on the excitement generated by a major tournament.\nSMART Vocabulary: related words and phrases\nLaziness and lazy people\nbludger\nbone idle idiom\nbum around\nCBA\nclock-watcher\nindolent\nindolently\nlayabout\nlazily\nlaziness\nshiftless\nshirker\nskiver\nslacker\nslackness\ntime-server\ntime-serving\nunambitious\nvegetable\nwork-shy\nSee more results »\nRelated words\nparasite\nparasitism"}