{"id":266845,"name":"parity","type":"noun","us_sound":"ˈper.ə.t̬i","us_link":"../audio/p/eus73429.mp3","uk_sound":"ˈpær.ə.ti","uk_link":"../audio/p/ukparis002.mp3","content":"Add to word list\nAdd to word list\nequality, especially of pay or position: Firefighters are demanding pay parity with police.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nAdd to word list\nAdd to word list\nequality, esp. of pay or position: Washington, DC, hopes to achieve political parity with the states.\nUS history Parity is also the ability of farmers to buy things at the same level as during a past time set as a standard and maintained by government price support.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; ECONOMICS, SOCIAL RESPONSIBILITY, WORKPLACE the state of being equal, especially in relation to pay and position: parity with sb In spite of many advances, women are far from achieving parity with men in many areas of employment. The union is campaigning to win the nurses pay parity with the drivers. They are confident that they will reach economic parity with other countries in the next decade.\n[ U ]\n&#160; FINANCE, ECONOMICS a situation in which one unit of a currency has exactly the same value as one unit of another currency: The parity of the currencies has created a serious crisis in the trading figures.at parity The peso was pegged to the US dollar at parity, so that one dollar equaled one peso.\n[ C ]\n&#160; FINANCE, ECONOMICS\n&#160; plural parities a measurement of the value of one unit of currency in comparison with another: The different currencies are all legal tender within each country or bloc, but parities are variable.the parity of sth against sth There was a 4% drop in the parity of the euro against the Swiss franc over the last twelve months. See also\nfixed parity\ninterest parity\nproduct parity\npurchasing power parity"}