{"id":266765,"name":"pariah","type":"noun","us_sound":"pəˈraɪ.ə","us_link":"../audio/p/pariah.mp3","uk_sound":"pəˈraɪ.ə","uk_link":"../audio/p/ukparas028.mp3","content":"Add to word list\nAdd to word list\na person who is not accepted by a social group, especially because they are not liked, respected, or trusted: The scandal transformed him into a pariah. He worried that his stammer would make him a social pariah. Her criticisms of the life-saving treatment have made her a pariah among international health leaders. Synonym\noutcastNote: This word is sometimes considered to be offensive in India.\na country or government that is not accepted by other countries, especially because it acts in a way that other countries consider to be wrong : Under the dictatorship, the country became an international pariah. The country faces economic sanctions and risks becoming a pariah state if it refuses to abandon its use of chemical weapons. Note: This word is sometimes considered to be offensive in India.\nold-fashioned offensive (also Pariah) a word used in the past for a person who belonged to a caste (= social group) in the south of India that was considered to be one of the lowest. This word is now considered offensive.\nMore examplesFewer examplesWhen he died he was still a pariah - the price he paid for political dissent.Before the causes of leprosy were understood, its contagiousness turned sufferers into pariahs.They wanted the world to know how they had suffered under the brutal pariah regime.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\nNATO\noccupied\nperestroika\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »\nAdd to word list\nAdd to word list\na person who is avoided or not accepted by a social group, esp. because he or she is not liked, respected, or trusted; an outcast: Because of its poor human rights record, the country was treated as a pariah by other nations."}