{"id":266850,"name":"park","type":"noun","us_sound":"pɑːrk","us_link":"../audio/p/park.mp3","uk_sound":"pɑːk","uk_link":"../audio/p/ukparis003.mp3","content":"Add to word list\nAdd to word list\nA1 a large area of land with grass and trees, usually surrounded by fences or walls, and specially arranged so that people can walk in it for pleasure or children can play in it: Central Park Hyde Park We watched the joggers in the park.\nRob Maynard/Moment/GettyImages\nan area of land that is used for a particular purpose: an office/a business park\nUS an area of land for playing sports on\nUK an area of land around a large house in the countryside\nMore examplesFewer examplesIf the weather's nice we could have a picnic in the park.He's jogging round the park every morning in an effort to get fit for the football season.I let the dogs run free in the park.What I like about Cambridge is that there's so much open space - there are parks and commons everywhere.The children enjoy floating their boats on the pond in the park.\nSMART Vocabulary: related words and phrases\nTowns & regions: areas in towns & cities\nanti-development\narrondissement\nbackstreet\nbackstreets\nborough\nbotanic garden\nbusiness park\nChinatown\nindustrial estate\nmarketplace\nold town\non skid row idiom\nouter ring\nplaza\nresidential\nshantytown\nskid\nslummy\nsubdivision\nWimbledon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: environments & localities\nSports venues\nGardening - general words\nIdioms\nhit the ball out of the park\nknock sb/sth out of the park\nknock sth out of the park\nA2 [ I or T ] to put a vehicle in a place where it can stay for a period of time, usually while you leave it: Where have you parked? Just park your car in the driveway.\n[ T + adv/prep ] informal to put yourself or something in a particular place for a long time, often annoying other people: He parked himself in front of the TV and stayed there all afternoon. She's parked an enormous pile of papers on my desk and I haven't a clue what to do with them.\n[ T ] to not deal with something or answer a question immediately but leave it for a later time: Can we park that question until the end of the session?\nMore examplesFewer examplesCars were parked all along the road.I usually park at my friend's house.an illegally parked carShe parked herself in front of the computer and started playing games.It's an offence to park on double yellow lines.\nSMART Vocabulary: related words and phrases\nOn the road: parking\nblock something/someone in\nboot\ncar park\ncarport\nclamp\ndriveway\ngarage\nmultistorey\nnon-moving\noff-street\nP, p\nparking\nparking garage\nparking lot\nparking meter\nparking policeman\npay station\nrepark\ntraffic warden\nvalet parking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\nDelaying and wasting time\nIdiom\npark the busPhrasal verb\npark up\npark noun [C]\n(AREA OF LAND)\nAdd to word list\nAdd to word list\na large area of land with grass and trees which is maintained for the pleasure of the public: a picnic in the park Central Park\npark verb [I/T]\n(STOP)\nto leave a vehicle in a place where it can stay for a period of time, or fig.infml to put yourself or something in a particular place for a period of time: [ I ] Where did you park? [ T ] Just park your car out front. [ T ] fig.infml He parked himself in front of the TV.\nAdd to word list\nAdd to word list\nan area of land used by businesses, factories, shops, etc.: a business/retail/industrial park\n[ I or T ] to leave a vehicle somewhere for a period: Staff park their cars in front of the main building. There's nowhere to park on the street.\n[ T ]\n&#160; FINANCE\n&#160; informal if you park money, an investment, etc. you leave it with another person or organization for a period of time. This is sometimes done to avoid tax and is illegal if it is done to hide the fact that you own something: park sth in sth More investors are seeking to park their money in an off-shore location. The funds were parked in an anonymous account.\n[ T ]\n&#160; MEETINGS\n&#160; informal if you park an idea, problem, etc. you decide not to deal with it until later: Let's park this issue for a moment and return to it later in the meeting."}