{"id":266903,"name":"parliament","type":"noun","us_sound":"ˈpɑːr.lə.mənt","us_link":"../audio/p/parliament.mp3","uk_sound":"ˈpɑː.lɪ.mənt","uk_link":"../audio/p/ukparis013.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] in some countries, the group of (usually) elected politicians or other people who make the laws for their country: On Tuesday the country's parliament voted to establish its own army. She was elected to Parliament in 1997.\n[ C ] a particular period of time during which a parliament is operating, between either holidays or elections\nMore examplesFewer examplesThere are two chambers in the British parliament - the House of Commons is the lower chamber, and the House of Lords is the upper chamber.If there were as many women as there are men in parliament, the situation would be very different.The opposition leader led a very forceful attack on the government in parliament this morning.When a bill is passed in parliament it becomes law.After 30 years in the political arena, our local member of parliament is retiring next year.\nSMART Vocabulary: related words and phrases\nUK politics: government administration & organization\napex\nawkward\nbackbench\nBrexit\nHolyrood\nhung parliament\nparliamentary\npartition\npartitionist\nPMQs\npolicy-maker\nquasi-public\nreprivatization\nreprivatize\nreshuffle\nsoviet\nthe awkward gang idiom\nthe House of Commons\nthe House of Lords\nthe Houses of Parliament\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitics - general words\nAdd to word list\nAdd to word list\nworld history the group of people who make the laws in some countries\nworld history Parliament often refers to the legislature of the United Kingdom of Great Britain and Northern Ireland. parliamentary adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌpɑr·ləˈmen·tər·i, -ˈmen·tri/\na parliamentary election\nAdd to word list\nAdd to word list\nin some countries, a group of politicians who have been elected to make laws for the country: They are hoping to push a radical income tax reform through parliament. Currently, women's issues are not being dealt with properly in parliament."}