{"id":267282,"name":"party","type":"noun","us_sound":"ˈpɑːr.t̬i","us_link":"../audio/p/eus73438.mp3","uk_sound":"ˈpɑː.ti","uk_link":"../audio/p/ukparti012.mp3","content":"party noun\n(CELEBRATION)\nAdd to word list\nAdd to word list\nA1 [ C ] a social event at which a group of people meet to talk, eat, drink, dance, etc., often in order to celebrate a special occasion: a birthday party a farewell party a dinner party (= a small, sometimes formal party where a meal is eaten)UK a fancy-dress (US costume) party (= a party where people wear clothes that make them look like someone or something else) Peter has/gives/throws really wild parties.\nCaiaimage/Tom Merton/GettyImages\nMore examplesFewer examplesHe said he had to be at his cousin's engagement party that evening.Who was she dancing with at the party last night?They decorated the room with balloons and streamers ready for the party.We're having a small drinks party for one of our colleagues who's leaving next week.I really enjoyed your party - it was such good fun.\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmasquerade\nmela\nstreet party\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nSee more results »\nparty noun\n(POLITICAL GROUP)\nB1 [ C, + sing/pl verb ] an organization of people with particular political beliefs that competes in elections to try to win positions in local or national government: the Democratic Party the Green partyUK the Conservative party The party have just elected a new leader. He was elected as party leader in 2011. They contacted party members from across the nation to ask for their support.\nMore examplesFewer examplesThere are signs of dissension within the ruling political party.A publicly disunited party stands little chance of winning the election.The party that was elected to power has no experience of government.There are two political parties in the US - the Democratic Party and the Republican Party.The committee's job is to ensure fair play between all the political parties and candidates during the election.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitics - general words\nparty noun\n(VISITING GROUP)\n[ C, + sing/pl verb ] a group of people who are involved in an activity together, especially a visit: a party of tourists Most museums give a discount to school parties.\nMore examplesFewer examplesThe museum was almost empty apart from a party of schoolchildren.We're taking a party of Japanese visitors on a tour of the city.A party of tourists were approaching the war memorial.There's a special education room set aside for school parties.Every day this once peaceful village is invaded by coach parties.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nparty noun\n(INVOLVEMENT)\n[ C ] one of the people or groups of people involved in an official argument, arrangement, or similar situation: The UN called on all parties in the conflict to take a positive stance towards the new peace initiative. It's often difficult to establish who the guilty party is following a traffic accident.\nMore examplesFewer examplesPaula really is the innocent party in all this, it was John that had the affair.An information meeting for all interested parties will be held on 10 November.The contract could be terminated by either party at any time.Mr Jackson was considered the injured party and awarded damages of over £5000.The court's decision did not satisfy either party.\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nthick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in general\nIdioms\nbe (a) party to something\nbring something to the party\nto enjoy yourself by drinking and dancing, especially at a party: Let's party! They partied till dawn.\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nemcee\nentertain\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\nput the flags out! idiom\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nromp\nthrow\nSee more results »\nparty noun [C]\n(SOCIAL GATHERING)\nAdd to word list\nAdd to word list\na social gathering at which people talk, eat, drink, and enjoy themselves: a birthday party Sally is having a party at her place tonight.\nparty noun [C]\n(POLITICAL GROUP)\nsocial studies a political group with particular beliefs and aims and which supports members who are trying to get elected to public office: the Democratic/Republican Party a political party\nparty noun [C]\n(PARTICULAR GROUP)\na particular group of people who are involved in an activity: I made a dinner reservation for a party of eight.\nparty noun [C]\n(ONE INVOLVED)\none of the people or sides involved in a formal agreement or argument, esp. a legal one: The UN called on all parties to lay down their arms.\nparty verb [I]\n(SOCIAL GATHERING)\nto enjoy yourself at a party with others, esp. by drinking alcohol, dancing, etc.\nAdd to word list\nAdd to word list\n[ C ] one of the people or groups of people involved in an official disagreement, arrangement, or similar situation: Both parties were happy with the result of the negotiations.\n[ C ] a group of people who are involved in an activity together, especially a visit: A party of college students is visiting the factory today. Our restaurants offer a discount of 10% to parties of 10 or more. There will be 8 people in our party, so we'll need to book a table.\n[ C ] a social event where a group of people meet to talk, eat, etc., often in order to celebrate a special occasion: We're having a farewell party for the sales manager.have/throw/give a party They're going to throw a party to celebrate a great year.\n[ C ]\n&#160; POLITICS an organization of people with particular political beliefs which competes in elections for positions in local or national government: a political party the governing/ruling/opposition party the Democratic/Green/Conservative Party He was elected as party leader in 2011. See also\ncharter party\nconcert party\ninterested party\nnon-party\nrelated party\nthird party\nworking party"}