{"id":267411,"name":"partnership","type":"noun","us_sound":"ˈpɑːrt.nɚ.ʃɪp","us_link":"../audio/p/partnership.mp3","uk_sound":"ˈpɑːt.nə.ʃɪp","uk_link":"../audio/p/ukparti006.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the state of being a partner\n[ C ] a company that is owned by two or more people: the John Lewis Partnership\nMore examplesFewer examplesTheirs was a very productive partnership.The festival is being coordinated by the city council in partnership with local schools.Theirs was a partnership based on mutual respect, trust and understanding.The fund-raiser involved a partnership of three local charities.They've gone into partnership with a rival company.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMergers & acquisitions\nEnterprises\nAdd to word list\nAdd to word list\n[ C or U ] an agreement between organizations, people, etc. to work together: a partnership between sb/sth and sb/sth The government is promoting a partnership between the state and the private sector. a partnership with sb/sth The Symphony has announced a new partnership with the Seattle Young Artists Festival. build/develop/form a partnership The company has formed a partnership with a US marketing firm to try to break into that market. in partnership with sb/sth The university works in partnership with several local businesses.a partnership of sth The program is a local partnership of groups helping elementary students begin preparing for college. They have signed a strategic partnership agreement with a leading mobile operator.go/enter into a partnership He has entered into a business partnership with his former boss.\n[ C ] a company which is owned by two or more people: set up/establish/found a partnership The partnership he jointly founded, is emerging as one of the leading headhunters for senior board appointments. See also\ndeed of partnership\ngeneral partnership\nlimited partnership\npublic-private partnership"}