{"id":267332,"name":"particular","type":"adjective","us_sound":"pɚˈtɪk.jə.lɚ","us_link":"../audio/p/particular.mp3","uk_sound":"pəˈtɪk.jə.lər","uk_link":"../audio/p/ukparsi023.mp3","content":"particular adjective\n(SPECIAL)\nAdd to word list\nAdd to word list\nB2 [ before noun ] special, or this and not any other: She wanted a particular type of cactus. He wouldn't take just any book - he had to have this particular one! \"Why did you ask?\" \"Oh, no particular reason, just making conversation.\" in particular\nB1 especially: What in particular did you like about the last apartment that we saw?\nSee more\nMore examplesFewer examplesThis particular stretch of coast is especially popular with walkers.In the light of recent incidents, we are asking our customers to take particular care of their personal belongings.Is there a particular sequence in which you have to perform these tasks?A lot of people think that most newspapers are biased towards one particular political party.As he gets older, my grandson is developing a particular interest in history.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividual\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\nper capita\npersonally\npet\nprivate\nrespectively\nseparately\nseverally\nSee more results »\nparticular adjective\n(NOT EASILY SATISFIED)\nC1 [ after verb ] not easily satisfied and demanding that close attention should be given to every detail: He's very particular about the kitchen - everything has to be perfectly clean and in its place. She's very particular about what she eats.\nSMART Vocabulary: related words and phrases\nWanting everything to be right\nanally\nanally retentive\nchoosy\ncover all the bases idiom\ndot the i's and cross the t's idiom\nfuss\nfussbudget\nfussily\nfussiness\nfusspot\npedantic\npedantically\npedantry\nperfectionism\nperfectionist\npurism\npurist\npuristically\nstickler\nultra-fastidious\nSee more results »\nparticulars [ plural ]\ndetails or information about a person or an event, especially when officially recorded: There's a form for you to note down all your particulars.\nSee more the particular formal\nIf you are considering the particular, you are considering single examples rather than general matters or ideas: The report focuses on the particular rather than the general and so doesn't draw any overall conclusions.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividual\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\nper capita\npersonally\npet\nprivate\nrespectively\nseparately\nseverally\nSee more results »\nparticular adjective\n(SPECIAL)\nAdd to word list\nAdd to word list\nspecial or single, or this and not any other: Is there a particular restaurant you’d like to eat at? What in particular (= special things) did you like about the last apartment that we saw?\nparticular adjective\n(CAREFUL)\nwanting to make choices carefully because you are not easily satisfied: She’s very particular about what she eats."}