{"id":267223,"name":"part","type":"noun","us_sound":"pɑːrt","us_link":"../audio/p/part.mp3","uk_sound":"pɑːt","uk_link":"../audio/p/ukparsi009.mp3","content":"part noun\n(SOME)\nAdd to word list\nAdd to word list\nA2 [ U ] some but not all of a thing: Part of my steak isn't cooked properly. Part of this form seems to be missing. I think part of her problem is that she doesn't listen carefully enough to what other people say. in part\nC2 partly, or to some degree: The deadline for applications is being extended, in part because of the postal strike.\nSee more in (a) large part\nto an important degree: How quickly we can finish the project depends in a large part on when we get the payments through.\nSee more for the most part\nC1 mostly or usually: He was, for the most part, quite helpful.\nSee more\nMore examplesFewer examplesExercise has become part of my daily routine.They've enlarged the kitchen by building over part of the garden.Politeness is traditionally part of the British character.Taking responsibility for yourself is part of the process of growing up.Unfortunately, accidents are part of life.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\npart noun\n(SEPARATE PIECE)\nA1 [ C ] a separate piece of something, or a piece that combines with other pieces to form the whole of something: We learned about all the different parts of the digestive system. The lower part of her spine was crushed in the accident. I think there's always a part of you that doubts what you're doing. Fresh fruit and vegetables form an essential/important part of a healthy diet. There'll be snow in parts (= particular areas) of the Midlands tonight.\nB2 [ C ] one of the pieces that together form a machine or some type of equipment: He works for a company that makes aircraft parts.\n[ C ] a single broadcast of a series of television or radio programmes or a division of a story: Next week we publish part three of the president's diaries. The programme will be shown in two parts.\n[ C ] one of two or more equal, or almost equal, measures of something: Mix one part of the medicine with three parts water.\nB1 [ C ] one of the characters in a film, play, or dance, or the words, actions, or movements that are said or done by that character: He has a small part in the school play. She plays the part of the sexy blonde waitress. Synonym\nrole (ACTING)\n[ C ] the music that a particular musician plays in a group these parts informal\nused to refer to an area of the country: We don't see many foreigners in these parts.\nSee more\nMore examplesFewer examplesThe old city around the cathedral is the most colourful part of town.Detach the lower part of the form from this letter and return it to the above address.This part of the book isn't very interesting, so I'm going to skip over it.It's a real fiddle to assemble because of all the small parts.Each part of the organization operates independently of the others.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nCinema & theatre: casting, roles & scripts\nMusical pieces\npart noun\n(INVOLVEMENT)\ntake part\nB1 to be involved in an activity with other people: She doesn't usually take part in any of the class activities.\nSee more\n[ U ] involvement in or responsibility for an activity, or action: He admitted his part in the robbery. I want no part in/of your crazy plans!\nSMART Vocabulary: related words and phrases\nTaking part and getting involved\nactor\nall in\nalong\nattendee\nbe (a) party to something idiom\nconcern\nengagement\ngo in on something\nhat\nhave a horse in the race idiom\nhave skin in the game idiom\nimmerse\nmuscle\nneck\npitch in\nplunge\nplunge in/plunge into something\npunch above your weight idiom\nre-engage\nthick\nSee more results »\npart noun\n(HAIR)\n[ C ] US (UK parting) a line on someone's head made by brushing the hair in two different directions: a centre/side part\nGlowimages/GettyImages\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nbowl cut\nchignon\nfade\nhair extension\nhaircut\nhairdo\nkiss curl\nplait\npompadour\npony\npudding basin\nrelaxed\nshake out\nsidelock\nundercut\nSee more results »\nIdioms\nbe part and parcel of something\nthe best/better part of\ndress/look/act the part\non the part of someone/on someone's part\npart of the furniture\ntake someone's part\nC2 [ I or T ] to separate or cause something or someone to separate: The curtains parted, revealing a darkened stage. To be parted from him even for two days made her sad.\n[ T ] If you part your hair, you arrange it so that it falls on either side of your head by separating it with a line down the middle or on one side.\nC2 [ I ] formal If two people part, they leave each other, often at the end of a relationship: I'm afraid we parted on very bad terms.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair care\nRelationships: ending & divorce\nIdiom\npart companyPhrasal verb\npart with something\npartly: He's part African - his father was born in Somalia. The exam is part spoken and part written. Synonyms\npartially\npartlyOpposites\ncompletely\nentirely\ntotally\nwholly\nSMART Vocabulary: related words and phrases\nIncomplete\nAnglocentric\nAnglocentrism\nbroad brush\ndemi-\nEurocentric\nextent\nhemi-\nimperfect\nimperfection\nimperfectly\nin a manner of speaking idiom\nincomplete\npartial\npartially\npartly\npatchily\npatchiness\nunfinished\nup to a point idiom\nvaguely\nSee more results »\nnot total or complete: He's (a) part owner of a racehorse. Part payment is better than no payment. Synonym\npartial\nMore examplesFewer examplesHe had a part share in a bicycle workshop in Nottingham.His trip to Egypt was part holiday and part official state visit.We don't know what's the whole truth and what's part truth.\nSMART Vocabulary: related words and phrases\nIncomplete\nAnglocentric\nAnglocentrism\nbroad brush\ndemi-\nEurocentric\nextent\nhemi-\nimperfect\nimperfection\nimperfectly\nin a manner of speaking idiom\nincomplete\npartial\npartially\npartly\npatchily\npatchiness\nunfinished\nup to a point idiom\nvaguely\nSee more results »\npart noun\n(SOME)\nAdd to word list\nAdd to word list\n[ C/U ] some but not all of something larger or greater: [ U ] I could only eat part of my dinner. [ C ] Parts of the movie were good. [ U ] Surgeons had to remove part of his lung. [ U ] Part of the problem is that she doesn’t like her boss very much.\npart noun\n(SEPARATE PIECE)\n[ C ] a separate piece or unit of something, esp. a piece that combines with other pieces to form the whole of something: The garage stocks auto parts from all current car models.\n[ C ] A part is also one of two or more equal measures of something: Mix one part vinegar with three parts olive oil.\n[ C ] A part is also a single broadcast of a series of television programs or a division of a story: Part three will be broadcast Tuesday.\npart noun\n(INVOLVEMENT)\n[ C usually sing ] involvement in or responsibility for an activity or action: He admitted his part in the robbery. It was a mistake on Julia’s part (= she was responsible).\n[ C usually sing ] A part in a movie or play is one of its characters, or the words written for that character: She plays the part of Lady Macbeth. Ben is learning his part for the school play.\npart noun\n(HAIR)\n[ C ] a line formed by the hair on a person’s head where the hair is divided partly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈpɑrt·li/\nThe house is partly owned by her father. Idiom\na parting of the ways\npart verb\n(SEPARATE)\n[ I/T ] to cause to separate, or to come apart: [ I ] The curtains parted, revealing a darkened stage. Phrasal verb\npart with something\nAdd to word list\nAdd to word list\none of the pieces that together make a machine, a vehicle, or a piece of equipment: The factory makes parts for the motor industry. auto/gun/missile parts See also\npart-time\nspare part"}