{"id":267626,"name":"passion","type":"noun","us_sound":"ˈpæʃ.ən","us_link":"../audio/p/passion.mp3","uk_sound":"ˈpæʃ.ən","uk_link":"../audio/p/ukparti026.mp3","content":"Add to word list\nAdd to word list\nB2 a very powerful feeling, for example of sexual attraction, love, hate, anger, or other emotion: Football arouses a good deal of passion among its fans. At school, his early interest in music developed into an abiding passion. Politics and philosophy were his lifelong passions.\nThesaurus: synonyms, antonyms, and examples\nloveloveI have a great love and respect for her.adorationShe described her complete adoration of her brother.romanceTheir relationship was nothing but romance and bliss.passionThe passion had gone out of their relationship.infatuationNo one expected their infatuation with each other to last.crushHe had a crush on his French tutor.\nSee more results »\na passion for something\nC1 an extreme interest in or wish for doing something, such as a hobby, activity, etc.: Anton has a consuming passion for science fiction.\nSee more passions [ plural ]\nvery powerful feelings: Touch a man's property and his passions are immediately aroused.\nSee more\nMore examplesFewer examplesAs a teenager, I was consumed by passion for the boy next door.The chance meeting awoke the old passion between them.It was this passion for fast cars that led to his untimely death at the age of 43.Her writing is full of passion and energy .Flames of passion swept through both of them.\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfierily\nfit to burst idiom\nflamingly\nfulminating\ngrip\npungently\nquiveringly\nrabid\nrabidly\nreinforced\nrhapsodic\nsearing\ntingle\ntorrid\nvirulent\nSee more results »\nIdiom\npassions run high\nin Christianity, the suffering and death of Jesus Christ\nSMART Vocabulary: related words and phrases\nThe Bible - people, events & places\nAdam\nannunciation\napocalypse\napostolic\nEden\nepistle\nepistolary\ngospel\nJesus Christ\nJudgment Day\npost-biblical\nPromised Land\npsalm\nresurrection\nthe ark\nthe Decalogue\nthe disciples phrase\nthe last judgment\nthe Last Supper\nthe Second Coming\nSee more results »\npassion noun\n(EMOTION)\nAdd to word list\nAdd to word list\n[ C/U ] a powerful emotion or its expression, esp. the emotion of love, anger, or hate: [ U ] romantic passion [ C ] Passions were running high in the aftermath of the accident.\npassion noun\n(STRONG INTEREST)\n[ C ] something that you are strongly interested in and enjoy: She has two passions in life – her cats and opera."}