{"id":267544,"name":"pass","type":"verb","us_sound":"pæs","us_link":"../audio/p/pass.mp3","uk_sound":"pɑːs","uk_link":"../audio/p/ukparti016.mp3","content":"pass verb\n(GO PAST)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to go past something or someone or move in relation to it, him, or her: I passed him on the stairs this morning. You should only pass a slower vehicle if it is safe to do so. If you pass a supermarket, could you get me some milk? I was just passing by (= going past the place where you are), so I thought I'd drop in for a chat. A momentary look of anxiety passed across his face. A cloud passed over the sun.\n[ T ] to go past a particular point in time: Don't buy goods that have passed their sell-by date.\nC2 [ T ] to go past something by being greater in amount or degree: The company's turnover is expected to pass the $10 million mark by the end of this year.\nC2 [ I ] If you say a state or feeling will pass, you mean it will disappear: Don't worry, his depression is only temporary - it'll soon pass.\nMore examplesFewer examplesStand aside, please, and let these people pass.He took a step backwards to allow her to pass.The ship passed Land's End, then steered towards southern Ireland.She affectionately ruffled his hair with her hand as she passed.After a strong start, she was passed by several runners on the final lap and finished ninth.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpending time & time passing\nBecoming bigger\nAppearing & disappearing\npass verb\n(SUCCEED)\nA2 [ I or T ] to be successful in an exam, course, etc.: Guess what? I've passed my driving test! The exam is so hard that only five percent of all applicants pass.\nMore examplesFewer examplesShe's been trying to pass her driving test for six years and she's finally succeeded.After all his hard work, he certainly ought to pass his exams.I passed in history but failed in chemistry.The teacher expected her to pass the exam without any difficulty.I took a flute exam last month and I'm still waiting to hear whether I passed.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\npass verb\n(GIVE)\nB1 [ T ] to give something to someone: Could you pass the salt please? I asked if I could see the letter, so she passed it to me reluctantly. [ + two objects ] Gerald passed me the note./Gerald passed the note to me. Genes are the means by which parents' characteristics are passed on to their children.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nC2 [ I or T ] In sports, if you pass the ball, you kick, throw, or hit it to someone in your team.\n[ T ] If you pass money, you give someone false or stolen money without telling them: [ + two objects ] I haven't trusted him since he passed me a forged $100 bill. She was arrested for passing stolen cheques.\nMore examplesFewer examplesCould you pass me that book?She passed him the mug, filled to the brim with hot black coffee.Pass me the camera, I want to take a photo.She passed a plate of biscuits around .Minelli passes the ball to Hernandez out there on the wing.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nTrafficking & racketeering\npass verb\n(TIME)\nB1 [ I ] When time passes, it goes past: Time seems to pass (by) so slowly when you're bored. I was a little worried about the party, but the evening passed without any great disasters.\nB2 [ T ] If you pass a period of time, you do something to stop yourself being bored during that period: The visitors pass their days swimming, windsurfing, and playing volleyball.\nMore examplesFewer examplesHardly had a moment passed before the door creaked open.Janet was surprised how quickly the time passed.The next two days passed in a whirl of activity.Time passes so quickly when you're enjoying yourself.While we were waiting we did the crossword to pass the time.\nSMART Vocabulary: related words and phrases\nSpending time & time passing\nall the time in the world idiom\nAnno Domini\ncourse\nelapse\nemploy\nfall\nfall away\ngone\nmisspend\nroll\nroll by\nrun\nrun out\nslip\nslip away\nthe sands of time idiom\ntick\ntimekeeper\nwear on\nwhile something away\nSee more results »\npass verb\n(APPROVE)\nB2 [ T ] (of an official group of people) to give approval to something, especially by voting to make it law: The government passed a law to restrict the sale of guns. The food supplement had been passed as safe for human consumption.\nMore examplesFewer examplesThe jury passed a verdict of guilty, with an appeal to the judge for clemency.This legislation won't be passed during the life of the present parliament.The motion was passed.It's one of the most ridiculous laws that has ever been passed.The two countries are resuming negotiations after a new resolution was passed by the Security Council.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElections\npass verb\n(JUDGE)\npass judgment, comment, etc.\nto express a judgment or opinion about something, especially someone else's behaviour: As a convicted criminal, he's in no position to pass judgment (on the rest of us). pass sentence\nto say officially, as a judge, what a criminal's official punishment will be\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\npass verb\n(DIE)\nmainly US (UK usually pass away) to die: After she passed, the doctors wanted to do an autopsy. His wife was at his side when he passed peacefully this morning.\nThesaurus: synonyms, antonyms, and examples\nto stop livingdieMy dog died last week.die a natural/violent deathShe dies a natural death at home, surrounded by loved ones.pass awayHe passed away peacefully in hospital.pass onI'm sorry to hear that your grandfather has passed on.passUS My father passed last year.\nSee more results »\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\nraise\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\npass verb\n(EXCRETE)\n[ T ] formal to remove waste from the body: to pass urine pass blood formal\nto have blood in your urine or faeces (= solid waste): If you pass blood, you should go and see your doctor.\nSMART Vocabulary: related words and phrases\nAnimal physiology: excrement & its excretion\naccident\nanal fissure\nbathroom\nbodily function\nbowel\ndefecate\ndoo-doo\ndung\ndunghill\nexcrement\nexcreta\nexcrete\nmotion\nmovement\npellet\npoo\npoop\npowder\nshit\nstool\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: urine & urinating\npass verb\n(NOT PLAY)\n[ I ] to choose not to play in a part of a game or not to answer a question in a quiz\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\npass verb\n(CHANGE)\n[ I usually + adv/prep ] to change from one state to another: Wax passes from solid to liquid when you heat it.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nIdioms\npass (all) belief\npass muster\npass the hat around/round\npass the time of day\npass waterPhrasal verbs\npass something around\npass as someone/something\npass away\npass someone by\npass something down\npass for sb/sth\npass off\npass something off as something\npass on\npass on something\nMore phrasal verbs\npass something on\npass out\npass something out\npass someone/something over\npass something round\npass something up\npass noun\n(EXAM RESULT)\nB2 [ C ] UK a successful result in an exam: Jon Hill achieved two grade A passes at A-level.\n[ C ] US a successful result in a course or exam for which the student will not be given a mark: I got a pass in my Literature course.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nboom\nevery dog has its day idiom\nfeat\nfeather\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\npass noun\n(BALL)\nC2 [ C ] a movement of the ball from one player to another member of the same team in a team sport\nExamples\nPeters received a diagonal pass and headed the ball into the net.Batistuta intercepted Neville's pass and scored the third goal.That was a perfect pass from Rooney to Owen.Yet another brilliant pass by Anderson!Another sloppy pass like that might lose them the whole match.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\npass noun\n(DOCUMENT)\nB1 [ C ] an official document or ticket showing that you have the right to go somewhere or use a particular form of transport: a bus pass a boarding pass My guest pass allows me to use the club's facilities free of charge.\n[ C ] mainly US a document that allows a student to leave a class for a particular reason: She had a pass to go to the library.\nMore examplesFewer examplesAnnie's the film critic for the local radio station, so she's got a free pass for all the cinemas in the area.The official at the gate checked our passes.You need a security pass to enter the building.All passengers will require a boarding pass and a valid passport.They gave me a backstage pass and I met some of the actors.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\nhalf\nhall pass\nrain check\nreturn fare\nreturn ticket\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\ntransfer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSchools in general\npass noun\n(PATH)\n[ C ] a path or road between or over mountains: a mountain pass\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ndead end\ndetour\nexit\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nshortcut\nskid marks\ntoll road\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: hills & mountains\npass noun\n(READING OF A TEXT)\nan occasion when someone reads through a text, especially in order to edit it (= make changes to it): I'm now doing my editing pass on the document. Don't try to memorize everything. Don't try to get every detail on the first pass.\nSMART Vocabulary: related words and phrases\nEditing & compiling\nabridged\nanthologist\nblue pencil\nbowdlerization\nbowdlerize\nbowdlerized\nco-edit\ncompile\ndub\nexcerpt\nnon-editorial\nover-edit\npost-editing\nproofreading\nrecension\nrevise\nsubedit\nundubbed\nunfiltered\nunrevised\nSee more results »\npass noun\n(BAD SITUATION)\n[ S ] a difficult or unpleasant condition: If I'd been aware things had reached such a pass, I'd have told the police.UK It's come to a pretty pass (= it's a bad situation) when you can't even have a few quiet drinks with some friends.\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\npass noun\n(SEXUAL ACTION)\nmake a pass at someone informal\nto speak to or touch someone in a way that shows you would like to start a sexual relationship with them\npass verb\n(GO PAST)\nAdd to word list\nAdd to word list\n[ I/T ] to go past or move beyond something or someone: [ T ] A car passed us doing 70 miles per hour. [ I ] I was just passing by and stopped to say hello.\npass verb\n(GO THROUGH)\n[ I/T ] to cause something to go around, across, through, etc., something else, or to be positioned in such a way: [ T ] Pass the wire through the slot and pull it out from the other side. [ I always + adv/prep ] The causeway passes across the bay and takes you to the mainland.\npass verb\n(GIVE)\n[ I/T ] to give something to someone: [ T ] Please pass the bread.\n[ I/T ] In team sports played with a ball, if you pass, you throw, kick, or hit the ball to someone on your team.\npass verb\n(DO WELL)\n[ I/T ] to be successful in a test, exam, or course, or to judge someone as having been successful in it: [ T ] The professor said that if I passed the final exam, she’ll pass me.\npass verb\n(TIME)\n[ I/T ] to go past or through a period of time: [ I ] The hours passed quickly.\npass verb\n(APPROVE)\n[ I/T ] to approve or be approved by a group having authority, esp. by voting: [ T ] The bill passed both houses of Congress and was signed by the president. [ I ] The bill passed unanimously.\npass verb\n(NOT DO)\n[ I ] to choose not to do, have, take part in, or take a turn at something: I think I’ll pass on going to the movies.\npass verb\n(BE ACCEPTED)\n[ I ] to be accepted as being something that you are not, esp. something better or more attractive: Marion looks so young she could pass for 30. Do this jacket and skirt match well enough to pass as a suit? passing adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈpæs·ɪŋ/Idioms\nin passing\npass the buck\npass the hat\npass the time\npass judgment on someone/somethingPhrasal verbs\npass someone/something off as something\npass around something\npass away\npass down something\npass on\npass on something\npass on something\npass on something/someone\npass out\npass out something\nMore phrasal verbs\npass over someone/something\npass up something\npass noun [C]\n(DOCUMENT)\nan official document or ticket showing that you have the right to go somewhere or do something: We bought three-day passes to the amusement park. The children get bus passes to travel to and from school.\npass noun [C]\n(DOING WELL)\na mark given to show that a student has successfully completed a course or an exam\npass noun [C]\n(GIVING)\nthe act of giving or sending the ball to another player on your own team: The receiver dropped the pass.\nAdd to word list\nAdd to word list\n[ I or T ] to go past something or someone or move in relation to it or them: I was just passing by, so I thought I'd drop in for a chat.\n[ T ] to go past a particular point in time: Don't buy goods which have passed their sell-by date.\n[ T ] to go past something by being greater in amount or degree: As the world's largest convenience store chain, it just passed McDonald's in the number of worldwide outlets.pass the $1m/€100m/£10bn, etc. mark The company is expected to pass the $10m mark by the end of this year.\n[ I ] if you say a situation or feeling will pass, you mean it will disappear: We're in a difficult economic situation, but it will pass eventually.\n[ I or T ] to be successful in an examination, course, etc.: All interviewees need to pass a basic math and literacy test.\n[ T ] to give something to someone: Could you pass me that file, please?\n[ T ] if you pass money, you give someone false or stolen money without telling them: Police have warned businesses that someone is passing stolen checks in the area.\n[ I ] when time passes, it goes past: A lot of time has passed since we opened our first store.\n[ T ] if you pass time, you spend time doing something: With more people passing time in the terminal, airport officials try to make them comfortable.\n[ T ] to give approval to something, especially by voting to make it law: California passed a law in September to cut carbon dioxide emissions by 25%.\n[ I ] to choose not to answer a question: pass on sth Asked whether he thought the FA should intervene, he replied diplomatically: 'Can I pass on this one?'\n[ I ] to change from one condition to another: pass from sth to sth As new electronic gadgets fall in price, they pass from a niche product to a mass product. Phrasal verbs\npass sth around/round\npass as/for sth/sb\npass sb by\npass sth/sb off as sth/sb\npass sth on/along to sb\npass sth out\npass sb/sth over\npass sth up\nan official document or ticket which shows that you have the right to go somewhere or use a particular form of transport: a parking/security/visitor's pass Sign in at reception and they will give you a visitor's pass.an annual/season/three-day pass Frequent visitors of national forests can save money by buying an annual pass.\na successful result in an examination: This candidate got 4 grade A passes at A-level."}