{"id":267555,"name":"passage","type":"noun","us_sound":"ˈpæs.ɪdʒ","us_link":"../audio/p/passage.mp3","uk_sound":"ˈpæs.ɪdʒ","uk_link":"../audio/p/ukparti019.mp3","content":"passage noun\n(CONNECTING WAY)\nAdd to word list\nAdd to word list\nB2 [ C ] (also passageway, uk/ˈpæs.ɪdʒ.weɪ/ us/ˈpæs.ɪdʒ.weɪ/) a usually long and narrow part of a building with rooms on one or both sides, or a covered path that connects places: A narrow passage led directly through the house into the garden. The bathroom's on the right at the end of the passage.\nCimmerian/E+/GettyImages\n[ C ] a hollow part of the body through which something goes: the nasal passages the anal passage\nMore examplesFewer examplessubterranean passagesan underground passageThe tomb was honeycombed with passages and chambers.A narrow passage leads from one building to the other.The president escaped through a secret passage underneath the parliament building.\nSMART Vocabulary: related words and phrases\nParts of buildings: passages & entrance areas\narcade\narchway\nbreezeway\nconcourse\ndesk\nentryway\ngangway\ngateway\nhall\nhallway\nlobby\nmarquee\npatio\nportal\nportico\nreception\nside entrance\nside return\nterrace\nvestibule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body\npassage noun\n(PART)\nB2 [ C ] a short piece of writing or music that is part of a larger piece of work: Several passages from the book were printed in a national newspaper before it was published.\nMore examplesFewer examplesThis passage of text has been excerpted from her latest novel.It is a difficult passage, but just translate it as best you can.This passage doesn't make any sense.The book contains numerous plagiarized passages.Kathy read a short passage from the Bible.\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nmambo\nmedley\nmelody\nmulti-part\nnocturne\noctet\nreel\nserenade\nsextet\nsignature tune\nsolo\nsonata\nsong form\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPieces of writing\npassage noun\n(TRAVEL)\n[ U ] formal travel, especially as a way of escape: The gunman demanded a plane and safe passage to an unspecified destination.\n[ S ] old-fashioned a journey, especially over the sea: He had booked his passage to Rio de Janeiro. work your passage old-fashioned\nto do work on a ship during your trip instead of paying for a ticket: He was allowed to work his passage from the port of Perth.\nSee more\nSMART Vocabulary: related words and phrases\nNavigation & shipwrecks\nastrolabe\ncelestial navigation\nchannel\nchart\ncircumnavigate\ncircumnavigation\ndead reckoning\nfoghorn\nlane\nlightship\nlodestar\nnarrows\nnavigability\npilot\nquadrant\nsea lane\nsextant\nsubmersible\nthe Pole Star\nyaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nJourneys\nSailing & boating\npassage noun\n(MOVEMENT)\nC2 [ U ] an act of moving through somewhere: Many meteors disintegrate during their passage through the atmosphere. The government prohibits the passage of foreign troops and planes across its territory.\nSMART Vocabulary: related words and phrases\nMovement\nambulatory\nbe treading water idiom\nbiodynamics\ncomings\nfloating\ngestural\nlocomotion\nmobile\nmobility\nmotile\nmotility\nmotion\nmovable\nmovement\npull\npull someone up short idiom\nrooted\nrooted to the spot idiom\nslithery\nsteadiness\nSee more results »\npassage noun\n(TIME)\nthe passage of time literary\nthe process of time going past: Memories fade with the passage of time.\nSee more\npassage noun\n(LAW)\n[ U ] formal the official approval of something, especially a new law: He again urged passage of a constitutional amendment outlawing abortion.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nsanction\nwrit\nSee more results »\npassage noun\n(CONNECTING WAY)\nAdd to word list\nAdd to word list\n[ C ] (also passageway, us/ˈpæs·ɪdʒˌweɪ/) a usually long and narrow part of a building with rooms on one or both sides, or an enclosed path that connects places: A narrow passage led through the house to the yard.\n[ C ] (also passageway, us/ˈpæs·ɪdʒˌweɪ/) A passage is also an entrance or opening: the nasal passages\npassage noun\n(PART)\n[ C ] a short piece of writing or music that is part of a larger piece: a short passage for a trumpet solo\npassage noun\n(TRAVEL)\n[ U ] the right to travel or to leave a place: We booked passage on a cruise ship. He was guaranteed safe passage to the border.\nAdd to word list\nAdd to word list\n[ C ] (also passageway, /ˈpæsɪdzweɪ/) a usually long and narrow part of a building with rooms on one or both sides, or a covered path which connects places: There's a passage on the side of the building – the maintenance department is along there.\n[ C ] a short piece of writing that is part of a larger piece of work: There's one passage in the report which seems incorrect.\n[ U ] an act of moving through a place: Despite security checks, our passage through the airport was fairly quick.\n[ U or S ] the way that time passes: The directors are hopeful that, with the passage of time, trading conditions will improve.\n[ U ] official approval of something, especially a new law: passage of sth Protesters are opposing passage of the new energy bill through parliament."}