{"id":267815,"name":"pastry","type":"noun","us_sound":"ˈpeɪ.stri","us_link":"../audio/p/pastry.mp3","uk_sound":"ˈpeɪ.stri","uk_link":"../audio/p/ukpassi025.mp3","content":"Add to word list\nAdd to word list\nC1 [ U ] a food made from a mixture of flour, fat, and water, rolled flat and either wrapped around or put over or under other foods, and then baked: shortcrust/puff/filo/choux/flaky pastry Ann makes delicious pastry - you should try her apple pie.\nFotografiaBasica/iStock/Getty Images Plus/GettyImages\nC1 [ C ] a type of sweet cake made from special pastry and usually containing something such as fruit or nuts: We were offered a selection of cakes and pastries with our tea. See also\nDanish pastry\nGary Woods/EyeEm/GettyImages\n[ U ]\n&#160; food &amp; drink\n&#160; specialized foods such as pastries, cakes, biscuits, and desserts (= sweet dishes eaten at the end of a meal): The chocolatier has headed up the pastry section at two of London's finest restaurants. She worked in Geauga County as a pastry assistant for three years. See also\npastry chef\nMore examplesFewer examplesWhen the pastry is golden and puffed up, take the pie out of the oven.To make the pastry, sieve the flour and salt into a mixing bowl.When you have rolled out the pastry, place it in a pie dish.This will be my second attempt to make flaky pastry.a pastry brush\nSMART Vocabulary: related words and phrases\nPastry & pies\napple pie\nbaked goods\nbanoffee pie\nbarquette\nbear claw\nelephant ear\nempanada\nen croute\nfilo pastry\nflaky pastry\nopen-faced\npain au chocolat\npandowdy\npastilla\npate a choux\nsausage roll\nshoofly pie\nshortcrust pastry\nsopaipilla\nspanakopita\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBiscuits\nCakes\nAdd to word list\nAdd to word list\na mixture of flour, fat, and water which is used as a base or covering for other foods and baked: [ U ] pie pastry\nA pastry is also a sweet, baked food made of a mixture of flour, fat, and water and often filled with fruit or cream: [ C ] We were offered a selection of pastries for dessert."}