{"id":268045,"name":"pathologically","type":"adverb","us_sound":"ˌpæθ.əˈlɑː.dʒɪ.kəl.i","us_link":"../audio/p/uspatho003.mp3","uk_sound":"ˌpæθ.əˈlɒdʒ.ɪ.kəl.i","uk_link":"../audio/p/ukpatch026.mp3","content":"pathologically adverb\n(BEHAVIOUR)\nAdd to word list\nAdd to word list\nin a way that is not reasonable or normal, or cannot be controlled: He comes across as pathologically ambitious. They become pathologically obsessed with their body image.\nMore examplesFewer examplesAs a mother, she was overprotective and pathologically controlling.She wanted to get away from her pathologically jealous husband.Much of the film is viewed through the perceptions of Jorge, a pathologically shy, nearly mute dishwasher. To avoid research projects involving rats or hamsters, of which she is pathologically terrified, she did a project on human bones and left with a PhD in bone identification.The National Council on Problem Gambling estimates that about 1 percent of US adults pathologically gamble.\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nhysterical\nobsessive-compulsive disorder\npsychosis\nscarred\nself-alienation\nsenility\nsociopathic\nsomatization\nSee more results »\npathologically adverb\n(DISEASE)\nin a way that relates to disease, especially its causes and effects or its diagnosis by the scientific examination of body tissue: The cancer was proven to be stage B, pathologically. These lesions can be very difficult to differentiate both radiologically and pathologically.\nMore examplesFewer examplespathologically normal tissueDiagnosis is difficult both clinically and pathologically. Pathologically, the most common primary brain tumour in adults is a glioma.\nSMART Vocabulary: related words and phrases\nMedical treatment: symptoms & diagnosis of medical problems\nadverse reaction\naerophobia\naggressively\namyloid\nanoxia\ncontraindication\nCT scan\ndiagnostic\nechocardiogram\nhistology\nhypoxic\nlacunar\nPCR test\nphlebotomy\nprandial\npresent\nprognostic\nvital signs\nvitals\nwithdrawal symptoms\nSee more results »\nSee\npathological"}