{"id":268098,"name":"patient","type":"noun","us_sound":"ˈpeɪ.ʃənt","us_link":"../audio/p/patient.mp3","uk_sound":"ˈpeɪ.ʃənt","uk_link":"../audio/p/ukpatie002.mp3","content":"Add to word list\nAdd to word list\nB1 a person who is receiving medical care, or who is cared for by a particular doctor or dentist when necessary: I'm a patient of Dr Stephens; please could I make an appointment to see her?\nMore examplesFewer examplesThe patient had surgery on his heart.A number of patients have been successfully treated with the new drug.There has been no significant change in the patient's condition.He has helped patients suffering from anxiety, depression, and eating disorders.This practice is responsible for about five thousand patients in this part of Leeds.\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncase\ncasualty\nconvalescent\nday patient\ndonor\nepileptic\nhealth tourist\ninjured\ninvalid\nmedical tourist\nnon-responder\norgan donor\noutpatient\nPWA\nsick\nsufferer\nunder\nwounded\nSee more results »\nB1 having patience: Dinner will be ready in half an hour - just be patient! Be patient with her - she's very young. Opposite\nimpatient\nMore examplesFewer examplesHe's very patient with small children.I could never be a teacher, I'm just not patient enough.If you could just be patient for a few more minutes, someone will be with you shortly.Be patient - it's your turn next!I'm sure we'll hear something soon, you'll just have to be patient.\nSMART Vocabulary: related words and phrases\nPatient and uncomplaining\ndove\nequable\nequably\nequanimity\neven-tempered\nforbearing\nlong-suffering\nlong-sufferingly\nnon-combative\npacific\npatience\npeace-loving\npeaceable\npeaceably\nstoic\nstoically\nstoicism\nthe patience of Job idiom\nuncomplaining\nSee more results »\nRelated word\npatiently\nAdd to word list\nAdd to word list\na person who is receiving medical care, esp. in a hospital, or who is cared for by a particular doctor or dentist when necessary"}