{"id":268095,"name":"patience","type":"noun","us_sound":"ˈpeɪ.ʃəns","us_link":"../audio/p/patience.mp3","uk_sound":"ˈpeɪ.ʃəns","uk_link":"../audio/p/ukpatie001.mp3","content":"patience noun [U]\n(QUALITY)\nAdd to word list\nAdd to word list\nB2 the ability to wait, or to continue doing something despite difficulties, or to suffer without complaining or becoming annoyed: You have to have a lot of patience when you're dealing with kids. In the end I lost my patience and shouted at her. He's a good teacher, but he doesn't have much patience with the slower pupils. Making small-scale models takes/requires a great deal of patience. Their youngest son was beginning to try my patience (= annoy me). Patience - they'll be here soon! Opposite\nimpatience\nThesaurus: synonyms, antonyms, and examples\nto get angrylose your temperShe never lost her temper, never raised her voice. explodeShe exploded with rage when she was mistaken for a cleaning lady.eruptMy ex-husband would erupt over little things.lose (your) patienceShe was starting to lose her patience with him.become enragedHe became enraged and crashed out of the room.fly into a rageI never saw him fly into a rage or treat anyone cruelly.\nSee more results »\nMore examplesFewer examplesI'm sorry but my patience is wearing thin.My patience is beginning to run out.He has the patience of a saint with those kids.I'm afraid he's exhausted my patience.He kept on crying and I lost my patience.\nSMART Vocabulary: related words and phrases\nPatient and uncomplaining\ndove\nequable\nequably\nequanimity\neven-tempered\nforbearing\nlong-suffering\nlong-sufferingly\nnon-combative\npacific\npatiently\npeace-loving\npeaceable\nstoic\nstoically\nstoicism\nthe patience of Job idiom\nuncomplaining\nuncomplainingly\nSee more results »\npatience noun [U]\n(CARD GAME)\nUK (US solitaire) a game played with cards by one person\n3bugsmom/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nflush\nhonour\njack\npool\nre-raise\nrebid\nrecut\nrookie card\nroyal flush\nsolitaire\nspade\nstraight\nSee more results »\nIdioms\nhave the patience of a saint\nthe patience of Job\nAdd to word list\nAdd to word list\nthe ability to accept delay, suffering, or annoyance without complaining or becoming angry: He’s a man of great patience. Her constant complaining was beginning to test/try my patience. patient adjective us\nYour browser doesn't support HTML5 audio\n/ˈpeɪ·ʃənt/\nJust be patient – dinner’s almost ready. patiently adverb us\nYour browser doesn't support HTML5 audio\n/ˈpeɪ·ʃənt·li/\nHe waited patiently for his name to be called."}