{"id":268250,"name":"patronage","type":"noun","us_sound":"ˈpæt.rə.nɪdʒ","us_link":"../audio/p/patronage.mp3","uk_sound":"ˈpæt.rə.nɪdʒ","uk_link":"../audio/p/ukpatie023.mp3","content":"patronage noun [U]\n(SUPPORT)\nAdd to word list\nAdd to word list\nthe support given to an organization by someone: The charity enjoys the patronage of many prominent local business people.\nmainly disapproving the power of a person to give someone an important job or position: Patronage is a potent force if used politically.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\nrecommended\nred carpet\nreinforce\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\npatronage noun [U]\n(CUSTOMERS)\nformal the business given to a shop or restaurant, etc. by its customers: We would like to thank all of our customers for their patronage in the past.\nSMART Vocabulary: related words and phrases\nPeople who buy things\nanti-consumer\nbidder\nbuyer\nconsumer\ncouponer\nend user\nfoot traffic\nimporter\nlate adopter\nmulti-client\npersonal shopper\nprosumer\npurchaser\nrag-and-bone man\nragman\nspeculator\nsubscriber\ntradesman\ntradespeople\nwholesaler\nSee more results »\nAdd to word list\nAdd to word list\nesp. disapproving the power to give someone an important job or advantages in exchange for help or support: New rules would minimize the effects of political patronage.\nAdd to word list\nAdd to word list\nCOMMERCE the business given to a shop, restaurant, hotel, etc. by its customers: Many wealthy Japanese have shifted their patronage to the new Western luxury hotels.\nsupport given to a public organization, especially by giving money: The company is famous for its arts patronage.\ndisapproving a situation in which a person gives someone an important job or position in return for their support: They plan to abolish patronage and place the appointment of senior law officers in the hands of an independent appointments board."}