{"id":268259,"name":"patronymic","type":"noun","us_sound":"ˌpæt.rəˈnɪm.ɪk","us_link":"../audio/p/cdo0319uspatr1286.mp3","uk_sound":"ˌpæt.rəˈnɪm.ɪk","uk_link":"../audio/p/cdo0319ukpatr1175.mp3","content":"Add to word list\nAdd to word list\na name that is based on the given name (= the name given at birth) of someone's father or one of their father's ancestors: Numerous patronymics of later formation have lasted: Johnson, Jackson, Peterson. The second Cossack addresses the first by his patronymic (\"son of Eremey\"). Compare\nmatronymic noun\nMore examplesFewer examplesA patronymic can be based on a full name (William-s) or a nickname (Will-s).Many family names are patronymics, so called because they are based on the first name of some long-ago father.Pressed by journalists, the guide still refuses to give his name, offering only his first name and patronymic, \"Valery Georgiyevich\".\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\n(of a name) based on the given name (= the name given at birth) of someone's father or one of their father's ancestors: Patronymic names, such as Robson, Richardson and Jackson, are based on the given name of a person's father. The patronymic form D'Amanti was given to the children of such unions. Compare\nmatronymic adjective\nMore examplesFewer examplesPaulsen is a Scandinavian patronymic surname, from the given name Paul.\"Respected Vladimir Vladimirovich!\" read the letter, using the president's patronymic middle name as a show of respect.In the past, most European Jews didn't have surnames, instead taking patronymic names such as \"David, son of Saul\".\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »"}