{"id":268313,"name":"pattern","type":"noun","us_sound":"ˈpæt̬.ɚn","us_link":"../audio/p/eus73455.mp3","uk_sound":"ˈpæt.ən","uk_link":"../audio/p/ukpatie028.mp3","content":"pattern noun\n(WAY)\nAdd to word list\nAdd to word list\nB2 [ C ] a particular way in which something is done, is organized, or happens: The pattern of family life has been changing over recent years. A pattern is beginning to emerge from our analysis of the accident data. In this type of mental illness, the usual pattern is bouts of depression alternating with elation. Many behaviour(al) patterns have been identified in the chimp colony.\nMore examplesFewer examplesRecent months have seen a pattern of tit-for-tat killings between the two sides.It is difficult to discern any pattern in these figures.Damage to the ozone layer has caused a change in weather patterns.Changing patterns of agriculture are threatening the countryside.Genetic engineers should not be allowed to play God, interfering with the basic patterns of Nature.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nstrategy\nstyleless\nstylistic\nstylistically\ntechnique\nthus\nvehicle\nSee more results »\npattern noun\n(ARRANGEMENT)\nB1 [ C ] any regularly repeated arrangement, especially a design made from repeated lines, shapes, or colours on a surface: Look, the frost has made a beautiful pattern on the window. The curtains had a floral pattern.\nStefan Cristian Cioata/Moment/GettyImages\nMore examplesFewer examplesHe bought a white tablecloth edged with a pretty pattern.The sunlight shining through the branches made a filigree pattern on the tiles.a fabric with a zigzag patternThe children made patterns by sticking coloured shapes onto paper.Joe's socks had diamond patterns on them.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\npattern noun\n(EXAMPLE)\n[ C usually singular ] something that is used as an example, especially to copy: The design is so good it's sure to set the pattern for many others.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\ninstance\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\npattern noun\n(DRAWING)\nB2 [ C ] a drawing or shape used to show how to make something: a knitting pattern a dress pattern Cut out all of the pieces from the paper pattern and pin them on the cloth.\nClarkandCompany/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nsemilunaris\nshapeable\nshaped\nshapeless\nshapelessly\nsilhouetted\nzigzag\nSee more results »\npattern noun\n(PIECE)\n[ C ] a small piece of cloth or paper taken from a usual-sized piece and used to show what it looks like: a pattern book Synonym\nsample (SMALL AMOUNT)\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\ninstance\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\nused in compounds to refer to the way in which a particular type of hair loss occurs, affecting mainly the top and front of the head: 50% of men over age 50 experience some kind of male pattern baldness. Female-pattern hair loss, which is caused by genetic and hormonal factors, is the most common type of hair loss in women.\nSMART Vocabulary: related words and phrases\nHair\nanti-dandruff\nas bald as a coot phrase\nbaldness\nbedhead\ncoily\nfive o'clock shadow\nfuzzy\nmane\nshaggy\nsideburns\ntextured\ntousle\ntousled\ntress\ntuft\nunshorn\nwavily\nwavy\nwig\nwiry\nSee more results »\npattern noun [C]\n(WAY)\nAdd to word list\nAdd to word list\na particular way in which something is done or organized, or in which something happens: Our weather pattern comes from the northwest. A whole variety of behavior patterns affect infants.\npattern noun [C]\n(SHAPES)\na regular arrangement of lines, shapes, or colors: A human fingerprint can be viewed as a geometric pattern.\nA pattern is also a design or set of shapes that show how to make something: a dress pattern patterned adjective us\nYour browser doesn't support HTML5 audio\n/ˈpæt̬·ərnd/\na rose and black patterned skirt\nAdd to word list\nAdd to word list\n[ C ] a particular way in which something usually happens or is done: a pattern of sth A pattern of sluggish consumer demand made growth targets impossibly high.a pattern emerges A pattern is emerging of a steady reduction in costs and increased sales.establish/fall into/follow a pattern The decision follows a pattern that has become increasingly common in the food industry.identify/reveal/show a pattern An examination of official documents shows a pattern of construction cost overruns.a changing/different/similar pattern changing patterns of employmenta consumption/growth/spending pattern High joblessness and changing consumption patterns will result in moderate sales. Organizations must address the needs of workers with diverse career patterns and goals.\n[ C ] a way of doing something that other people, organizations, etc. can copy: set the pattern for sth The talks have set the pattern for trying to solve problems within the industry.\na holding pattern\na situation where there is little activity or change, and people are not doing business, spending money, etc. because they cannot decide what to do next: be in/go into a holding pattern Several deals went into an immediate holding pattern after the crisis.\nused to describe an agreement based on similar agreements with other companies: a pattern agreement/contract The contract was viewed by bargainers as a pattern agreement to be used in negotiations with the car company. The traditional pattern bargaining that went on in the auto industry has gone.\nbe patterned after/on sth\nto be copied from something or to be very similar to something: The facility will employ 150 people and be patterned after the steel fastener facility in Saint Joe, Indiana."}