{"id":268554,"name":"pawn","type":"noun","us_sound":"pɑːn","us_link":"../audio/p/pawn.mp3","uk_sound":"pɔːn","uk_link":"../audio/p/ukpauci013.mp3","content":"pawn noun\n(GAME PIECE)\nAdd to word list\nAdd to word list\n[ C ] any one of the eight least valuable pieces in the game of chess\nBurazin/ Photographer's Choice/GettyImages\n[ C ] a person who does not have any real power but is used by others to achieve something: The refugees are pawns in an international political dispute.\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\nendgame\nforfeit\ngambit\nmove\npin\nqueen\nqueenside\nre-roll\nresign\nrook\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople of little importance\npawn noun\n(MONEY)\nin pawn\nleft with a pawnbroker: She had to put her ring in pawn to pay the bills.\nSee more\nto leave a possession with a pawnbroker, who gives you money for it and can sell it if the money is not paid back within a certain time: Of all items pawned, jewellery is the most common. Synonym\nhock informal\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-order\nprocurement\nrewards card\nsanctions-busting\nsealed-bid\nshelf\nstretch\ntreat\nSee more results »\npawn verb [T]\n(TRADE FOR MONEY)\nAdd to word list\nAdd to word list\nto leave a possession with someone in order to borrow money from that person, with the understanding that if you do not pay it back within the agreed time, the person can keep your possession and sell it\npawn noun [C]\n(GAME PIECE)\nany of the eight least valuable pieces in the game of chess\nA pawn is also a person who is controlled by others and used for their own advantage: She felt she had been used as a political pawn.\nAdd to word list\nAdd to word list\nto leave a valuable possession with a pawnbroker (= someone who lends money in exchange for possessions): Under the law, the owner of an automobile may pawn it to secure a loan up to $2,500.\n[ C ] a person or organization that does not have any real power, but is used by others to achieve something: a pawn in sth The federal jury rejected the company's defense that they were an unwitting pawn in the scheme to sell confidential documents.\nin pawn\nleft with a pawnbroker (= someone who lends money in exchange for valuable possessions): If a pawn shop loans $50 on a gold necklace, they might charge $5 to keep the necklace in pawn for each month.\nout of pawn\nno longer with a pawnbroker (= someone who lends money in exchange for valuable possessions): She had pawned the ring, and couldn't get it out of pawn until the Saturday."}