{"id":263359,"name":"pay","type":"verb","us_sound":"peɪ","us_link":"../audio/p/pay.mp3","uk_sound":"peɪ","uk_link":"../audio/p/ukpauci017.mp3","content":"pay verb\n(BUY)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to give money to someone for something you want to buy or for services provided: How much did you pay for the tickets? I pay my taxes. [ + two objects ] I'll pay you the fiver back back tomorrow. I paid the driver (in/with) cash. Would you prefer to pay with/by cash, cheque, or credit card? [ + obj + to infinitive ] I think we'll need to pay a builder to take this wall down. Did Linda pay you for looking after her cats while she was away? I paid (out) a lot of money to get the washing machine fixed and it still doesn't work!\nThesaurus: synonyms, antonyms, and examples\nto spend moneyspendHow much do you intend to spend on a house?payWhen you bought the tickets, how much did you pay?investShe's invested all her savings in the business.pay outI've just paid out £700 to get the car fixed.splurgeWe've just splurged on new kitchen appliances.blowWe won a £15 million settlement in court and we blew it all in six years.\nSee more results »\npay for itself\nIf something pays for itself, it works so well that it saves the same amount of money that it cost: The advertising should pay for itself.\nMore examplesFewer examplesI pay my electricity bill by direct debit.Very few people can afford to pay those prices.How much did you pay for your glasses?We agreed to pay for the car by instalments.I've been saving all year to pay for our holiday.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\nProfits & losses\npay verb\n(WORK)\nB1 [ I or T ] to give money to someone for work that they have done: The company pays its interns $4,000 a month. We pay €200 a day for this kind of work. Accountancy may be boring but at least it pays well. Most of these women are very poorly paid and work in terrible conditions.\nMore examplesFewer examplesI'll pay you double if you get the work finished by Friday.This magazine has considerable financial muscle and can afford to pay top journalists.They pay me next to nothing but I really enjoy the work.The law obliges companies to pay decent wages to their employees.You'll be paid on completion of the project.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\npay verb\n(PROFIT)\n[ I ] to give a profit or advantage to someone or something: It never pays to take risks where human safety is concerned.\nMore examplesFewer examplesCrime really doesn't pay.It always pays to keep on top of your work.It would pay you to be more cautious about future investments.It pays to get some professional advice first.It never pays to rush into things.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\npay verb\n(GIVE)\nC2 [ T ] to give or do something: The commander paid tribute to the courage of his troops. It's always nice to be paid a compliment. A crowd of mourners gathered to pay their respects to the dead man. pay attention (to something)\nB1 to watch, listen to, or think about something carefully: You weren't paying attention to what I was saying. pay (someone/something) a call/visit\nB2 to visit a person or place, usually for a short time: I'll pay you a call when I'm in the area. We thought we'd pay a visit to the museum while we were in Lisbon. If you leave your address, I'll pay a call on you when I'm in the area.\nMore examplesFewer examplesShe complained that her husband never paid her any compliments any more.He never paid attention in class and seemed to be in a permanent daydream.On this occasion we pay homage to him for his achievements.The teacher gently reproved the boys for not paying attention.You'd do well to pay heed to what your grandmother says.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying attention and being careful\nVisiting\nIdioms\nhe who pays the piper calls the tune.\npay it forward\npay your dues\npay your way\npay dividends\npay the price\npay the ultimate price\npay through the nose\npay top dollar\nput paid to something\nMore idioms\nyou pays your money and you takes your choice/chance\nPhrasal verbs\npay someone/something back\npay someone back\npay down something\npay for something\npay something in\npay off\npay something off\npay someone off\npay (something) out\npay something out\nMore phrasal verbs\npay up\nB1 the money you receive for doing a job: It's a nice job but the pay is appalling. Compare\nearnings\nwage noun\nremuneration formal\nsalary\nstipend be in the pay of someone\nto work for someone, especially secretly\nMore examplesFewer examplesThe unions are in dispute with management over pay.Many employees have had to take drastic cuts in pay.Management has/have offered staff a 3% pay increase.When you reckon in all my overtime, my total pay is quite good.If it's a choice between higher pay and job security, I'd prefer to keep my job.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\npay verb\n(GIVE MONEY FOR)\nAdd to word list\nAdd to word list\n[ I/T ] to give money to someone for goods or services: [ T ] We paid a lot of money for that table. [ I ] Would you prefer to pay by credit card? [ I ] fig. We all eventually pay for our mistakes (= suffer or are punished because of our mistakes).\n[ I/T ] To pay is also to give someone or something money for an amount you owe: [ T ] We’ve got to pay the rent. [ T ] We have so many bills to pay.\npay verb\n(GIVE EARNINGS)\n[ I/T ] to give money to someone that the person has earned for work done: [ T ] We pay our salespeople a salary plus a bonus based on their sales. [ I ] Construction jobs generally pay well.\npay verb\n(PROFIT)\n[ I ] to give a profit, advantage, or benefit: [ + to infinitive ] It never pays to take risks where human safety is concerned. The moral is, \"Crime doesn’t pay.\"\npay verb\n(PROVIDE)\n[ T ] to provide or do something: Please pay attention. It’s always nice to be paid a compliment. pay noun [ U ] us\nYour browser doesn't support HTML5 audio\n/peɪ/\nI asked the boss for a raise in pay. payable adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈpeɪ·ə·bəl/\nPlease make your check payable to Broadway Antiques. Idioms\npay someone a visit\npay your dues\npay through the nose (for something)Phrasal verbs\npay back something\npay down something\npay off\npay off something\npay off someone\npay out (something)\npay up\nAdd to word list\nAdd to word list\n[ I or T ] to give money to someone for a product or service: pay for sth Who paid for the meal?pay sb to do sth We'll need to pay a builder to take this wall down.pay sb for sth How much did they pay you for the computer?pay sb for doing sth Did the company pay you for doing the quote?pay in/with sth They paid for the car in cash.pay to do sth I paid a lot of money to get the washing machine fixed and it still doesn't work!pay a deposit You will need to pay a small deposit if you want us to keep the radio for you. pay by cash/cheque/credit card\npay for itself\nif something pays for itself, it works so well that it saves the same amount of money that it cost: The renewable energy system will have paid for itself within ten years.\n[ I or T ] to give money to someone for work that they have done: He hates his job, but at least it pays well. Most of these women are very poorly paid and work in terrible conditions.pay $20/€50/£5, etc. for sth They pay $30 an hour for editing work. I don't get paid until the end of the month.\n[ T ] to give someone money that you owe them: pay bills/rent I haven't got enough money to pay the rent this month.pay a debt/fine He was ordered by the court to pay a $100,000 fine. Will I have to pay income tax on any monies I receive?pay sb sth We haven't yet paid the contractor what we owe him for the work.\n[ I ]\n&#160; COMMERCE if a business pays, it produces a profit: make sth pay The cinema will be closed down at the end of October, as it has failed to attract enough patrons to make it pay.\n[ I ] to give an advantage to someone or something: pay to do sth When it comes to your retirement, it doesn't pay to take too many risks.\n[ T ]\n&#160; FINANCE if a bank account or an investment pays a particular amount of money or interest, the person who owns it will receive that amount of money or interest: The account will pay 4% gross on credit balances.pay interest/a return The bank will pay interest if your account is in credit.\npay dividends\nif something you do pays dividends, it has good results at a time in the future: The company found that the extra training really did pay dividends.\npay its way\nif a business pays its way, it makes at least the same amount of money as it costs to operate: When Swan Lake reached the West End, there had to be eight performances a week for the production to pay its way.\npay over the odds (for sth) UK informal\nto pay more for something than it is really worth: Small businesses have always paid over the odds for office supplies.\npay the price\nto experience the bad result of something you have done or that someone else has done: It is inexcusable for students to be paying the price for backroom deals in the student loan industry.\npay through the nose (for sth) informal\nto pay too much money for something: There's no point in getting a bargain flight only to pay through the nose for car hire.\npay top dollar (for sth) US\nto pay a lot of money for something: Many wealthy businessmen are prepared to pay top dollar for an exclusive property in this area.\npay your way\nto pay for yourself rather than allowing someone else to pay: I got a part-time job to help pay my way through university. Phrasal verbs\npay sb/sth back\npay down sth\npay sth down\npay sth in/pay sth into sth\npay into sth\npay off\npay sb off\npay sth off\npay out\npay sth out\nMore phrasal verbs\npay up\nthe money you receive for doing a job: There has been a long-running dispute over pay and working conditions. Workers threatened to strike over the low pay of the support staff. They agreed to give six months off work with full pay for staff whose jobs are to be outsourced. The current starting pay is about $500 a week.a pay award/deal/settlement Councils will have to fund the teachers' pay award from within their own resources.a pay cut Employees have a choice between taking a pay cut or working more.a pay hike/increase Pilots have received annual pay increases of only 1.5% since the ruling. hourly/monthly/weekly pay overtime/retirement pay holiday/vacation pay redundancy/severance pay executive pay\nbe in the pay of sb\nto work for someone, especially secretly: Doctors in the pay of drug companies were accused yesterday of exaggerating the benefits of antidepressant drugs for children. See also\nat-risk\nback pay\nbase pay\nbasic pay\ncallback pay\ncall-in pay\ndifferential pay\ndouble pay\nequal pay\nguaranteed pay\nView all\nhazard pay\nlow-paid\nmaternity pay\npaternity pay\nperformance-related\npremium pay\nreporting pay\nsick pay\nstrike pay\ntake-home pay\nvariable pay"}