{"id":263361,"name":"payable","type":"adjective","us_sound":"ˈpeɪ.ə.bəl","us_link":"../audio/p/payable.mp3","uk_sound":"ˈpeɪ.ə.bəl","uk_link":"../audio/p/ukpauci018.mp3","content":"Add to word list\nAdd to word list\nC1 that should be paid: Interest payments are payable monthly.\nC1 If a cheque is payable to a particular person or organization, his, her, or its name is written on it and the money will be paid to him, her, or it: Please make your cheque payable to WWF.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nAdd to word list\nAdd to word list\nFINANCE used for saying how or when an amount of money should be paid: The fees are payable monthly.payable in sth The debt is payable in one lump sum or by instalments.payable on January 1st/22nd May, etc. The final dividend will be 1.15p, payable on August 29. Payment by check of cash dividends will ordinarily be mailed within three business days after the payable date.\nBANKING if a cheque is payable to a person or an organization, the money will be paid to them because their name is written on it: Please make your cheque payable to Oxford Ecobuild.\npayable on demand\nFINANCE used to describe a loan that may have to be paid back at any time, with little or no warning: Many business loans are payable on demand.\npayable to bearer\nFINANCE used on a bond, cheque, etc. to state that the amount of money shown should be paid to the person who brings it for payment: Where a bill is not payable to bearer, the payee must be named.\npayable to order\nFINANCE used on a bond, cheque, etc. to state that the amount of money shown should be paid to the person who is named on it: If an instrument is not payable to order or to bearer, it is not negotiable. See also\naccounts payable\nbills payable\ndividends payable\nnote payable"}