{"id":263366,"name":"payback","type":"noun","us_sound":"ˈpeɪ.bæk","us_link":"../audio/p/uspatho021.mp3","uk_sound":"ˈpeɪ.bæk","uk_link":"../audio/p/ukpauci019.mp3","content":"payback noun [C or U]\n(ADVANTAGE)\nAdd to word list\nAdd to word list\nan advantage received from something, especially the profit from a financial investment: The payback for reorganization should be increased productivity.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nlock\nlose\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\npayback noun [C or U]\n(SOMETHING BAD)\nsomething bad that is done to you because of something bad that you have done previously: The problems she was experiencing felt like payback for her past mistakes.\nSMART Vocabulary: related words and phrases\nRevenge and vengefulness\navenge\navenger\nbite\nbite back (at someone/something)\ncounter-retaliation\neye\nfix\nkarma\nmedicine\npay\npay someone/something back\nreprisal\nretaliate\nretaliation\nstrike\nstrike back\nthat will show someone idiom\ntit for tat\ntwo can play at that game idiom\nvengeance\nSee more results »\nIdiom\npayback's a bitch\npayback noun\n(PUNISHMENT)\nAdd to word list\nAdd to word list\n[ C/U ] an action that punishes someone for something bad that the person did to you; revenge: [ U ] They view the proposed initiative as payback to those senators who have not shown enough Republican loyalty.\npayback noun\n(MONEY RETURN)\n[ C usually sing ] the activity of giving money that is owed, or of getting back something for money spent: He'll have a 20-year payback on his investment, and the improvements should last another 20 years after that.\nAdd to word list\nAdd to word list\nFINANCE the profit received from an investment or the time that it takes to receive the same amount that was invested: Shareholders are awaiting a cash payback from the deal.a payback on sth You should have a 20-year payback on your investment in solar panels.\nan advantage that you get from something: payback for sth The payback for reorganization should be increased productivity.\npayback time\na situation in which someone will have to suffer for the way that they have behaved in the past: The union has been treated very badly, and now it's payback time, and strike action will go ahead."}