{"id":263426,"name":"payment","type":"noun","us_sound":"ˈpeɪ.mənt","us_link":"../audio/p/payment.mp3","uk_sound":"ˈpeɪ.mənt","uk_link":"../audio/p/ukpauci027.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] an amount of money paid: Usually we ask for payment on receipt of the goods. We need a deposit of £165 followed by twelve monthly payments of £60. When is the first payment due?\n[ S or U ] reward: Verbal abuse was hardly the payment I expected for my troubles. back payment\nan amount of money received by a person that has been owed to them, and especially money received by an employee because of a pay rise at an earlier time: The company refused to give them their full pension, sick pay and other back payments.\nSee more\nMore examplesFewer examplesOrdinarily, we send a reminder about a month before payment is required.My monthly mortgage payment is debited from my bank account on the 2nd of each month.If you're in financial difficulty, we're happy to let you space out your payments over two years.I've had a letter from the tax authorities concerning my tax payments.Goods will be delivered on receipt of payment.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nAdd to word list\nAdd to word list\nan amount of money paid, or the act of paying: [ C ] When is the first payment due? [ U ] Usually we ask for payment when the order is placed.\nAdd to word list\nAdd to word list\n[ C ] an amount of money that has been paid or is expected to be paid: For the fiscal year ended February 28 2010, payments from Class A Shares amounted to $1,470. mortgage/insurance/tax payments a deferred/direct/lump-sum payment a maximum/minimum paymentmake a payment You will face interest charges if you don't make a payment within 30 days.fall behind on/meet/miss a payment If you anticipate missing a payment, call your lender. Any additional payments made to the employee's occupational pension will come from the pension fund. When is the first payment due? a salary/wage payment a pension/redundancy payment bond/interest/loan payments We couldn't afford the monthly payments on the loan once interest rates rose.\n[ U ] the act of paying or being paid a sum of money: immediate/late/prompt payment The company will charge for late payment. accept/defer/receive payment a payment plan/system payment terms a payment date/deadline cash/direct debit payment electronic/online paymentpayment by cash/credit card Some airlines charge for payment by credit card. New methods of payment are being introduced. payment in advance/in full/in instalments\nback payment\nHR money that is paid to an employee because of a pay rise at an earlier time, or the act of paying this money: I am due to receive back payments for the past six months' work.\nan amount of money owed that has not been paid back by the expected time, or the act of paying this money: Homeowners will be given 90 days to make back payments, to save the home from going to auction. He was being pursued by the tax authorities for back payment of taxes.\npayment by results (abbreviation PBR)\nHR, WORKPLACE a system of paying employees in which the amount paid varies according to the amount of work they do or the profit that is made\npayment in kind\nCOMMERCE a way of paying for something using goods and services instead of money: The company agreed that the loan should be settled by payment in kind.\npayment on account\nan amount of money paid that is part of the total amount owed for something, or the act of paying in this way: Tax is also due as the first payment on account for the tax year 2010-11.\npayment on delivery (abbreviation POD); (also payment on receipt of goods)\nCOMMERCE payment for goods that is received when they are delivered: Many suppliers have begun demanding cash payment on delivery.\npayment on invoice\nCOMMERCE payment for goods and services that must be made after the buyer receives an invoice: Terms are payment on invoice within 15 days of invoice date. See also\naccelerated payment\nbalance of payments\nballoon payment\nbonus payment\ncompensation payment\ncredit card payment\ndebt payment\ndisability payment\ndividend payment\ndocuments against payment\nView all\ndown payment\nfinal payment\ngoodwill payment\ninstalment payment\ninterim payment\nmilestone payment\npart payment\npartial payment\nprincipal payment\nprogress payment\nsocial security payment\ntransfer payment\nwelfare payment\nCompare\nnon-payment"}