{"id":263497,"name":"payoff","type":"noun","us_sound":"ˈpeɪ.ɑːf","us_link":"../audio/p/payoff.mp3","uk_sound":"ˈpeɪ.ɒf","uk_link":"../audio/p/ukpauci028.mp3","content":"payoff noun [C]\n(RESULT)\nAdd to word list\nAdd to word list\ninformal the result of a set of actions, or an explanation at the end of something: The payoff for years of research is a microscope that` performs better than all of its competitors.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\ncorollary\nend result\nfallout\nfirst fruit\nfruit\nimplication\nin\nramification\nrepercussion\nresultant\nresultantly\nresulting\nsequel\nside effect\néclat\nSee more results »\npayoff noun [C]\n(MONEY)\nmoney paid to someone, especially so that they do not cause trouble or so that they will do what you want: It has been alleged that the congressman received a secret payoff from an arms dealer.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\ncashback\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\nper calendar month\npocket\nwhip-round\nSee more results »\npayoff noun [C]\n(REWARD)\nAdd to word list\nAdd to word list\ninfml a result that rewards you for your effort or work: After years of study, the payoff is supposed to be a good job.\npayoff noun [C]\n(MONEY)\nmoney paid to someone for something that you want done or to not cause you trouble: He denied receiving any kickbacks or payoffs for giving a large contract to the company.\nAdd to word list\nAdd to word list\nHR, WORKPLACE money that is paid to someone so that they do not cause trouble, or to persuade them to leave their job: to accept/receive a payoff to demand/negotiate a payoff If her contract is terminated she will be in line for a $1.2m pay-off.\nmoney received from a business arrangement or an investment: The deal is forecast to produce a pay-off of $160,000. The payoff was greater than investors had been led to believe.\nan advantage gained as the result of a decision, series of actions, etc.: The payoff from the new organizational structure has been enormous, for instance in cutting project lead times by 50%."}