{"id":263516,"name":"payroll","type":"noun","us_sound":"ˈpeɪ.roʊl","us_link":"../audio/p/eus73463.mp3","uk_sound":"ˈpeɪ.rəʊl","uk_link":"../audio/p/ukpayro001.mp3","content":"Add to word list\nAdd to word list\n[ C ] a list of the people employed by a company showing how much each one earns: a payroll tax The company is growing fast, adding another 100 employees to its payroll over the last year.\n[ C usually singular ] the total amount of money paid to the people employed by a particular company: With debts of $4 million and a monthly payroll of $1.2 million, the venture is clearly heading for trouble.\nSMART Vocabulary: related words and phrases\nEmployees & colleagues\nalum\nalumna\nalumnae\nalumni\nalumnus\ncompatriot\ncontractor\nemployee\ngirl\ngoonda\nhireling\nnon-management\nnon-managerial\noffice politics\noffice spouse\noppo\nwage earner\nworker\nworking man/woman/person\nworkmate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEarning money\nAdd to word list\nAdd to word list\na list of a company’s employees and the amount each earns, or the total earnings a business gives to its employees\nAdd to word list\nAdd to word list\n[ C ]\n&#160; HR a list of the employees of a company showing how much each one earns: The company is growing fast, and increasing the number of staff on its payroll.\n[ C ]\n&#160; HR, ECONOMICS the total number of people employed by a company, or in an economy: The reduction in temporary hiring has led to the second successive month of falling payrolls.\n[ C, usually singular, or U ]\n&#160; ACCOUNTING the total amount of money paid to the employees of a particular company: payroll costs They operate with a strict $80 million payroll. On average, firms pay 10.45% of payroll into final salary pensions. The first thing the company must do to get out of trouble is to cut its payroll.\n[ U ]\n&#160; HR the activity of managing the money that is paid to employees: payroll administration/records/system His work is to manage the billing and payroll.\nbe on the payroll\nHR to be employed by a particular company: The company yesterday confirmed that she was no longer on its payroll as a paid consultant."}