{"id":268617,"name":"peace","type":"noun","us_sound":"piːs","us_link":"../audio/p/peace.mp3","uk_sound":"piːs","uk_link":"../audio/p/ukpayro010.mp3","content":"peace noun [U]\n(NO VIOLENCE)\nAdd to word list\nAdd to word list\nB2 freedom from war and violence, especially when people live and work together happily without disagreements: peace talks/proposals a peace conference/initiative Now that the war is over may there be a lasting peace between our nations. Peace lasted in Europe for just over 20 years after 1918 before war broke out again. She's very good at keeping (the) peace within the family. The police act on the public's behalf to keep the peace.\nMore examplesFewer examplesThey had worked for peace during the long era of conflict.Do you think they'll ever find a way of bringing peace to the region?Few observers believe that the treaty will bring a lasting peace to the region.The United Nations has exerted its authority to restore peace in the area.The war was followed by a long period of peace and prosperity.\nSMART Vocabulary: related words and phrases\nWar\nantebellum\nanti-militarism\nasymmetric warfare\nbattle-scarred\nbellicose\nconflagration\ngerm warfare\ngung-ho\nholy war\nhorizontal escalation\nphoney war\nSDI\nsinew\nsinews of war idiom\nsmokescreen\nStar Wars\nthe Great War\nthe Second World War\nWorld War I\nWorld War II\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeace\npeace noun [U]\n(CALM)\nB1 the state of not being interrupted or annoyed by worry, problems, noise, or unwanted actions: You'll need peace and quiet to study. He says he's at peace when he's walking in the mountains. Go away and leave us to finish our dinner in peace. For everyone's peace of mind go back and check that you locked the door. There'll be no peace until she gets what she wants. I didn't agree with what she said but I held my peace (= did not say anything).\nMore examplesFewer examplesSarah seemed to have a profound sense of inner peace.The peace of the village has been shattered by juggernauts thundering through it.He simply wants to live out the rest of his days in peace.Leave your mother in peace to get on with her work now, please.I go camping for some peace and quiet.\nSMART Vocabulary: related words and phrases\nPeaceful and tranquil\nbeatitude\nconsonance\ncoolness\ndust\nlow-traffic\nlull\nnon-militant\npeaceable\npeaceably\nquieten\nrestfully\nrestfulness\nsequestered\nsleepiness\nsleepy\nsoothing\nthe calm before the storm idiom\nthe dust settles idiom\nthe lull before the storm idiom\nunwarlike\nSee more results »\nIdioms\nat peace\nbe at peace with the world\nmake peace (with someone)\nmake peace with something\npeace noun [U]\n(NO VIOLENCE)\nAdd to word list\nAdd to word list\n(a period of) freedom from war or violence, esp. when people live and work together without violent disagreements: People don't like to think about spending money on the military in a time of peace. The country has been at peace for 25 years (= not involved in war during this period).\npeace noun [U]\n(CALM)\ncalm and quiet; freedom from worry or annoyance: I need peace and quiet to study. Idioms\nat peace with something/yourself\npeace of mind\nAdd to word list\nAdd to word list\nfreedom from war and violence: achieve/broker/promote peace Failure to achieve peace in the Middle East was one of the Secretary of State's major regrets.at peace The country is now at peace after nearly 30 years of civil war.peace accord/agreement/deal Officials say they hope to forge a peace agreement next year.peace negotiations/proposals/talks The two sides have agreed to resume peace negotiations."}