{"id":268628,"name":"peacefulness","type":"noun","us_sound":"ˈpiːs.fəl.nəs","us_link":"../audio/p/peacefulness.mp3","uk_sound":"ˈpiːs.fəl.nəs","uk_link":"../audio/p/ukpayro015.mp3","content":"peacefulness noun [U]\n(CALMNESS)\nAdd to word list\nAdd to word list\na state of being quiet and calm: We love the freedom and peacefulness of our life here.\na state of feeling calm and not being worried: A kind of peacefulness overcame him as he stared up at the stars.\nMore examplesFewer examplesI stand at my kitchen window - somehow the outside peacefulness puts my stress at ease.Everybody who comes here says they feel the peacefulness and the serenity of the space.Laura believed everything in the home should contribute to a pervading sense of calm and peacefulness.A golden morning sun rose over the vast blue sky and a peacefulness set in. Gentle cooking brings with it a peacefulness that can be as de-stressing as a massage.\nSMART Vocabulary: related words and phrases\nPeaceful and tranquil\nbalm\nbeatitude\nconsonance\ncoolness\ndust\nlow-traffic\nlull\nnon-militant\npeaceable\npeaceably\nquieten\nrestfulness\nsequestered\nsleepiness\nsleepy\nsoothing\nsoothingly\nthe calm before the storm idiom\nthe dust settles idiom\nthe lull before the storm idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalm and relaxed\npeacefulness noun [U]\n(NO VIOLENCE)\nthe fact of not involving violence, or the fact of trying to create peace: The country then had a few years of relative peacefulness.\nMore examplesFewer examplesThey noted the relative peacefulness of the demonstrations that took place.Let us rededicate ourselves to peacefulness and nonviolence.The people who are really suffering are black and ethnic minorities who have enjoyed a long period of peacefulness here and are now being victimised.The Global Peace Index ranks 121 nations according to their relative peacefulness.\nSMART Vocabulary: related words and phrases\nPeace\nconcord\ndove\ndovish\nhold out/offer an olive branch idiom\nnon-defence\nnon-violent\nnon-violently\nnon-war\npacifist\npacifistically\npeace\npeace accord\npeace-loving\npeaceably\npeaceful\npeacefully\npeacekeeper\npeacekeeping\npeacetime\ntruce\nSee more results »\nSee\npeaceful"}