{"id":268697,"name":"peak","type":"noun","us_sound":"piːk","us_link":"../audio/p/peak.mp3","uk_sound":"piːk","uk_link":"../audio/p/ukpayro024.mp3","content":"peak noun [C]\n(HIGHEST POINT)\nAdd to word list\nAdd to word list\nB2 the highest, strongest, or best point, value, or level of skill: Prices reach a peak during August. Beat the egg whites until they are stiff enough to form firm peaks. We saw a victory by an athlete at the very peak of her fitness and career. Synonyms\napex (SUCCESS) figurative\npinnacle (SUCCESS)\nthe summit\ntop (HIGHEST PART)\nvertex specialized\nzenith (MOST SUCCESSFUL POINT)\nMore examplesFewer examplesHe seems to have reached the peak of his tennis career.Accommodation is tricky to find at the peak of the season.The evening rush hour reaches its peak between 5 and 6pm.There are always peaks and troughs in any relationship.The Beatles were at their peak during the 1960s.\nSMART Vocabulary: related words and phrases\nHigher and lower points of achievement\napex\napogee\ncapstone\nclimax\nfulfilment\nglory days\nheight\nheyday\nhigh point\nhigh tide\nIndian summer\npinnacle\nplumb\nplumb the depths idiom\nprime\nrock bottom\nslow burner\nsummit\nthe acme\nzenith\nSee more results »\npeak noun [C]\n(MOUNTAIN)\nB1 the pointed top of a mountain, or the mountain itself: It is one of the most difficult peaks to climb. Synonyms\nmountaintop\npinnacle (TOP)\nsummit (HIGHEST POINT)\ntop (HIGHEST PART)\ncdbrphotography/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesthe glaciated peaks of the HimalayasFrom the lowlands of the south to the rugged peaks in the north, Derbyshire has something for everyone.Snow-covered peaks form a back-drop to beautiful mountain lakes.Ben Nevis is Scotland's highest peak.We set up camp three quarters of the way up the peak.\nSMART Vocabulary: related words and phrases\nGeography: hills & mountains\nacclivity\nbrow\nclifftop\nesker\nhillock\nMarilyn\nmesa\nmid-ocean ridge\nmotte\nMount Kilimanjaro\norographic\npinnacle\nscarp\nspur\nsteep\nthe Adirondack Mountains\nthe Alaska Range\nthe Alps\nthe Andes\nvolcano\nSee more results »\npeak noun [C]\n(HAT PART)\nmainly UK (US usually visor) the flat curved part of a cap that goes above the eyes of the person who is wearing it\nprapann/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nHats & scarves\nascot\nbalaclava\nbandana\nbaseball cap\nbeanie\ncycle helmet\ndeerstalker\ndicky bow\ndo-rag\ndunce's cap\nkippa\nmask\nmillinery\nmitre\nmortarboard\ntopee\ntopper\ntoque\ntrencher\ntrilby\nSee more results »\nPeak times are the times when most people are using or doing something: Traffic congestion is really bad at peak periods (= when it is busiest). It is most expensive to advertise at peak viewing times (= those with the most people watching). Don't go there in the peak (= busiest) season - it'll be hot and crowded.\nPeak levels or rates are when they are at their highest: peak rate electricity\nmainly UK often humorous used to describe something that has become so popular and common that it is no longer fashionable or people start to dislike it: I think we've reached peak beard (= beards were fashionable, but now too many people have them).\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetic\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nmad\nplate\nrun round\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaximum and minimum\nLinguistics: very & extreme\nto reach the highest, strongest, or best point, value, or level of skill: Official figures show that unemployment peaked in November.\nSMART Vocabulary: related words and phrases\nHigher and lower points of achievement\napex\napogee\ncapstone\nclimax\nfulfilment\nglory days\nheight\nheyday\nhigh point\nhigh tide\nIndian summer\npinnacle\nplumb\nplumb the depths idiom\nprime\nrock bottom\nslow burner\nsummit\nthe acme\nzenith\nSee more results »\npeak verb [I]\n(REACH HIGHEST POINT)\nAdd to word list\nAdd to word list\nto reach the highest point, value, or level: Official figures show unemployment peaked in November. peak adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/pik/\nDuring the peak season, the population swells with over 50,000 tourists.\npeak noun [C]\n(MOUNTAIN TOP)\nthe pointed top of a mountain, or the mountain itself\nAdd to word list\nAdd to word list\na period during which something reaches its highest level, price, rate, etc.: At its peak, the company was valued at £1.5 billion. Several internet service providers tested in the evening peak failed to deliver the new target for high-speed internet.be above/below the peak of sth The shares have started to recover but are still far below their 12-month peak.hit/reach/rise to a peak Investors were looking beyond the UK market because they feared it might have reached a peak. all-time/record/highest peak Markets are subject to strong peaks and troughs due to economic cycles. Compare\ntrough noun\nrelating to the highest level, price, rate, etc. that something reaches: The comparison site provides information on peak and off-peak rates across all the major mobile networks. Service providers keep spare capacity to meet peak demand. peak efficiency/performance\nrelating to a period of time during which more people are using a service or system than during any other period: The new facility could increase the number of packages shipped to 30,000 from 10,000 during the peak holiday season.peak hours/periods/times The Underground often operates a crowd-control system at peak periods. Compare\noff-peak\nto reach the highest level, price, rate, etc.: Official figures show that unemployment peaked in November.peak (out) at sth There was growing belief in the City that base rates may have peaked at 4.75%. Despite talk of the market peaking out, investors are still buying rather than selling."}