{"id":268734,"name":"pearl","type":"noun","us_sound":"pɝːl","us_link":"../audio/p/pearl.mp3","uk_sound":"pɜːl","uk_link":"../audio/p/ukpayro030.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a small, round object, usually white, that forms around a grain of sand inside the shell of a sea creature, especially an oyster. Pearls are valuable and are used to make jewellery: a string of pearls a pearl necklace\nToscaWhi/ iStock/Getty Images Plus/GettyImages pearls [ plural ]\njewellery made from pearls: He gave her pearls for her birthday. You never saw her without her pearls - even on the beach! Pearls are a safe bet for wearing with a little black dress. She was dressed in a cashmere sweater and pearls. She sat in front of the mirror and fastened her pearls around her neck.\nAnna Petrova Ilieva-Alikaj/EyeEm/GettyImages\n[ C ] an artificially made pearl: cultured pearls\n[ C usually plural ]\n&#160; food &amp; drink\n&#160; specialized a very small ball of some types of food : The pearls of rice are delicate and creamy. Tapioca is a starchy substance from the cassava plant and comes in many forms, including pellets called pearls. Pearls of caviar rolled nicely on the tongue.\n[ C ] literary a small drop of liquid: There were pearls of dew on the grass.\n[ U ] the white shiny colour of pearl or a pale colour\n[ U ] →\nmother-of-pearl : pearl buttons\nSMART Vocabulary: related words and phrases\nJewelry\nankle bracelet\nbangle\nbauble\nbe dripping with something idiom\nbutterfly\ncirclet\nclip-on\ncuff\ndrip\nearring\nengagement ring\nfinery\njewelled\njewellery\njewellery box\nrhinestone\nsignet ring\nsleeper\nsparkler\ntreasure\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeology: precious & semi-precious stones\nFood - general words\nSpherical, circular and annular objects\nBlack, white & grey\nThe skin, hair & bone of non-human animals\nIdiom\na pearl of great price\n[ I ] (of a liquid) to form small drops on a surface: Sweat was pearling on her brow. He quartered an orange with the knife and the juice on the blade pearled into droplets. be pearled with sth\n(of a surface) to have small drops of liquid form on it: The heavy dish cover was pearled around the edge with glistening drops. She saw one of Annie's thin white arms, pearled with water, shoot into the sky as the boat righted itself.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWet weather & wetness\nAdd to word list\nAdd to word list\na small, shiny, hard ball, usually white or blue-gray, that forms around a grain of sand inside some oyster shells and is valued as a jewel: a string of pearls"}