{"id":268877,"name":"peck","type":"verb","us_sound":"pek","us_link":"../audio/p/peck.mp3","uk_sound":"pek","uk_link":"../audio/p/ukpearl015.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] When a bird pecks, it bites, hits, or picks up something small with its beak: The birds learn to peck holes in the milk bottle tops. Geese were pecking around for food.peck at Chickens pecked at the seeds which covered the ground.\n[ T ] to give someone a quick kiss, especially on the side of the face: peck someone on the cheek He pecked his aunt on the cheek.\n[ I or T ] to type on a keyboard, pressing the keys using only one or two fingers, especially because you are not very good at typing: They hunch over keyboards, pecking individual lines of code in strange programming languages.peck at I'm tired of watching my 12-year-old daughter pecking at the keyboard with one finger.hunt and peck It has a small qwerty keyboard which touch-typists with tiny hands can use - I hunt and peck .\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBiting, chewing & swallowing\nShowing affection\nWriting & typing\nPhrasal verb\npeck at something\npeck noun [C]\n(QUICK TOUCH)\n(of a bird) the action of biting, hitting, or picking up something small with its beak: Be careful you don't get a peck in the face from one of the chickens. In the game show, she had to brave the pecks of a dozen ostriches while covered in bird seed.\na quick kiss: peck on the cheek She gave me the usual peck on the cheek.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBiting, chewing & swallowing\npeck noun [C]\n(AMOUNT)\nan old-fashioned unit of measurement equal to 554.84 cubic inches (9.092 litres) in the UK and 537.6 cubic inches (8.810 litres) in the US : Peter Piper picked a peck of pickled peppers. The labourer then earned two pecks of wheat a day.\nSMART Vocabulary: related words and phrases\nMeasurements of volume\ncapacity\ncentilitre\ncl\ncubic\ndecilitre\ndl\nfl.\ngal\ngallon\ngill\nheaped\nheaping\nlitre\nmeasure\nmillilitre\nml\npt\nquart\nteaspoon\ntin\nSee more results »\nAdd to word list\nAdd to word list\n(of a bird) to hit, bite, or pick up something with the beak\nA peck is also a quick kiss: Aunt Velma gave me a peck on the cheek."}