{"id":269360,"name":"peer","type":"verb","us_sound":"pɪr","us_link":"../audio/p/peer.mp3","uk_sound":"pɪər","uk_link":"../audio/p/ukpedal024.mp3","content":"Add to word list\nAdd to word list\nC2 to look carefully or with difficulty: When no one answered the door, she peered through the window to see if anyone was there. The driver was peering into the distance trying to read the road sign.\nThesaurus: synonyms, antonyms, and examples\nto look at someone or somethinglookLook over there! A rainbow!watchI sat by the window and watched people walking past.glanceShe glanced around the room to see who was there.peepShe peeped through the curtains to see what was happening.peekHe peeked inside the box.stareDon't stare at people like that - it's rude.\nSee more results »\nMore examplesFewer examplesI peered through a chink in the curtains and saw them all inside.They leaned over the rails and peered down into the dizzying chasm below.We peered through the crack in the floorboards.The car nosed out of the side street, its driver peering anxiously around.She peered closely at the map.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\npeer noun [C]\n(EQUAL)\nC1 a person who is the same age or has the same social position or the same abilities as other people in a group: Do you think it's true that teenage girls are less self-confident than their male peers? He wasn't a great scholar, but as a teacher he had few peers (= not as many people had the same ability as him).\nMore examplesFewer examplesAs the daughter of the president, she enjoys high status among her peers.When it comes to mathematics, he's in a different class to his peers.He doesn't really want to join in, it's just peer pressure.Teenagers are often worried about looking stupid in front of their peers.British children are less capable readers at this age than their Scandinavian peers.\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintance\nacquaintanceship\nacquainted\nacquainted with someone\namigo\ncompatriot\ncomrade\ncrony\ncrowd\nfair-weather friend\nfam\nflatmate\nintimate\nneighbour\noppo\npal\npeeps\npeer group\npen pal\nSee more results »\npeer noun [C]\n(HIGH RANK)\nin the UK, a person who has a high social position and any of a range of titles, including baron, earl, and duke, or a life peer: a hereditary peer a Conservative peer\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmiss\nmister\nmonarch\nmonarchist\nroyal prerogative\nroyalist\nroyally\nRt. Hon.\nShah\nSee more results »\npeer verb [I always + adv/prep]\n(LOOK)\nAdd to word list\nAdd to word list\nto look carefully or with difficulty: The judge peered over his glasses at the jury.\npeer noun [C]\n(EQUAL)\na person of the same age, the same social position, or having the same abilities as other people in a group: Getting help from a peer is easier than asking a teacher.\nAdd to word list\nAdd to word list\na company in the same industry as other companies: Dixons is doing better than its peers.\na person of a similar age, position, abilities, etc. as others in a group: According to research, high school dropouts earn $260,000 less in a lifetime than their degree-earning peers. See also\npeer-to-peer"}