{"id":269796,"name":"penalty","type":"noun","us_sound":"ˈpen.əl.ti","us_link":"../audio/p/eus73474.mp3","uk_sound":"ˈpen.əl.ti","uk_link":"../audio/p/ukpeewe019.mp3","content":"penalty noun [C]\n(PUNISHMENT)\nAdd to word list\nAdd to word list\nB2 a punishment, or the usual punishment, for doing something that is against a law: The law carries a penalty of up to three years in prison. They asked for the maximum penalty for hoax calls to be increased to one year. The protesters were told to clear the area around the building, on penalty of arrest (= or be arrested) if they did not.\nB2 a type of punishment, often involving paying money, that is given to you if you break an agreement or do not follow rules: Currently, ticket holders pay a penalty equal to 25 percent of the ticket price when they change their flight plans. There was a penalty clause which said you had to pay half the cost if you cancelled your booking.\nB2 an advantage given in some sports to a team or player when the opposing team or player breaks a rule: The referee awarded (= gave) a penalty kick. Hysen handled the ball and conceded the penalty that gave Manchester United the lead.\nMore examplesFewer examplesThe maximum penalty for the offence is a $1000 fine.Execution is still the penalty in some states for murder.I had to pay a penalty fee when my cheque bounced.They are campaigning for stiffer penalties for people who drink and drive.This offence carries a fixed penalty.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorse\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\npenalty noun [C]\n(DISADVANTAGE)\na disadvantage brought about as a result of a situation or action: Loss of privacy is one of the penalties of success. She has paid a heavy penalty for speaking the truth.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nlock\nlose\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nAdd to word list\nAdd to word list\na punishment, esp. the usual one, for breaking a law: Repeat offenders should face stiff/tough penalties.\nA penalty is also a type of punishment for breaking an agreement or not following rules: If you pay off the loan early, they’ll charge an extra month’s interest as a prepayment penalty. When a football team gives up 143 yards in penalties, they deserve to lose.\nAdd to word list\nAdd to word list\nFINANCE, LAW an amount of money that someone is forced to pay for failing to obey a rule, law, etc.: Taxpayers who do not send in their tax return by the deadline will pay a £100 penalty. exit/early-withdrawal/fixed penalty Savers who try to cash in their bonds in the first five years will usually face fixed penalty charges.impose/introduce a penalty Regulators prevented the broadband operator from imposing a penalty on customers defecting to other providers.without penalty Withdrawals can be made without penalty as long as 50 days' notice is given. face/incur a penalty financial/hefty/stiff penalties\nLAW a punishment for failing to obey a rule or law: Second-degree murder carries a maximum penalty of life imprisonment.abolish/oppose/seek the death penalty Several US states have considered bills that would abolish the death penalty. See also\nsurrender penalty"}