{"id":269895,"name":"penetrable","type":"adjective","us_sound":"ˈpen.ə.trə.bəl","us_link":"../audio/p/cdo1121uspene3303.mp3","uk_sound":"ˈpen.ɪ.trə.bəl","uk_link":"../audio/p/cdo1121ukpene3412.mp3","content":"penetrable adjective\n(THAT YOU CAN GET INTO)\nAdd to word list\nAdd to word list\nIf a place or substance is penetrable, you can move into it or through it: The riverside bushes were certainly very thick, but the undergrowth behind was evidently penetrable. The barrier of poisonous gas appeared to be less penetrable than the rock that had been tunnelled through.\nIf something such as a security system or device is penetrable, it is possible to get through or into it illegally in order to get information or do something illegal: The U. S. airport security systems established in the early 1970s are penetrable by minimal ingenuity. Everybody has a smartphone nowadays, and we are concerned about the safety of these vulnerable and penetrable devices.\nbusiness\n&#160; specialized If an area of business or a market is penetrable, you can become part of it and work in it. : The truth about this market has always been that it is penetrable, but only after tremendous effort.\nSMART Vocabulary: related words and phrases\nCrossing and moving through\nbash through (something)\nbreak\nbreak through something\ncriss-cross\ncrossable\ncrossed\ncut\nford\npenetrate\npenetration\npenetrative\npercolate\npierce\nplough\nrip\nscissor\nspan\nstraddle\ntransit\nuncrossed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\nBusiness - general words\npenetrable adjective\n(THAT YOU CAN UNDERSTAND)\nable to be understood when studied or investigated: Parts of the book will be penetrable only by scholars. She will presumably be the ideal person to help make the young doctor's prose more penetrable. Compare\nimpenetrable\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nscale\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nuncomprehending\nunderstanding\nSee more results »"}