{"id":269905,"name":"penetrate","type":"verb","us_sound":"ˈpen.ə.treɪt","us_link":"../audio/p/eus75861.mp3","uk_sound":"ˈpen.ɪ.treɪt","uk_link":"../audio/p/ukpeewe029.mp3","content":"penetrate verb\n(MOVE INTO)\nAdd to word list\nAdd to word list\n[ I or T ] to move into or through something: Amazingly, the bullet did not penetrate his brain. In a normal winter, the frost penetrates deeply enough to kill off insect eggs in the soil.\n[ T ] to succeed in becoming part of an organization, etc. and working within it : The organization had been penetrated by a spy. The company has been successful in penetrating overseas markets this year (= it has started selling its products in them).\n[ I or T ] in sport to move the ball through an opponent's defence: The Australians seemed able to penetrate the South African defence at will. They contained the opposition for long periods but were unable to penetrate.\n[ I or T ] to reach or affect something: These changes had not yet penetrated as far west as the mountains of Merioneth.\n[ T ] If your eyes penetrate somewhere dark, you manage to see through it: Our eyes couldn't penetrate the dark/the gloom of the inner cave.\n[ T ] When a person penetrates someone as a sexual act, they put their penis or another object into another person's body.\nSMART Vocabulary: related words and phrases\nCrossing and moving through\nbash through (something)\nbreak\nbreak through something\ncriss-cross\ncrossable\ncrossed\ncut\nford\npenetrable\npenetration\npenetrative\npercolate\npierce\nrip\nrip through something\nscissor\nspan\nstraddle\ntransit\nuncrossed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - joining & leaving\nGeneral terms used in ball sports\nUsing the eyes\npenetrate verb\n(UNDERSTAND)\n[ I or T ] to study or investigate something in order to understand it: It's hard to penetrate her mind. He penetrates deeper into the artist's life in the second volume of his autobiography.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\nscale\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\npenetrate verb [I/T]\n(MOVE)\nAdd to word list\nAdd to word list\nto move into or through something: [ I ] The drill isn’t sharp enough to penetrate into the rock. [ T ] Women have begun to penetrate a lot of fields that were dominated by men for centuries.\npenetrate verb [I/T]\n(UNDERSTAND)\nto understand something, or to be understood as a result of study or investigation: [ I ] Her writing penetrated to the heart of contemporary life. penetration noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌpen·ɪˈtreɪ·ʃən/\nThe program’s penetration in Utah schools varies from district to district.\nAdd to word list\nAdd to word list\nto begin to sell products or services in a new area or to a new group of customers: The company is beginning to penetrate Asian markets."}