{"id":270030,"name":"penny","type":"noun","us_sound":"ˈpen.i","us_link":"../audio/p/penny.mp3","uk_sound":"ˈpen.i","uk_link":"../audio/p/ukpenet020.mp3","content":"Add to word list\nAdd to word list\nB1 plural p, pence or pennies (abbreviation p) the smallest unit of money in the UK, of which there are 100 in a pound, or a small coin worth this much. You use \"pence\" or, more informally, \"p\" when you are talking about the units of money and pennies when you are talking about the coins themselves: Could you lend me 50 pence/50p please? I found a ten/twenty/fifty pence piece (= a coin of this value) on the floor. I keep pennies and other small coins in a jar.\nplural pennies in the US and Canada, a cent or a coin of this value\nplural pence or pennies (also old penny); (abbreviation d) in the UK before 1971, a large coin. There were twelve pennies in a shilling.\nplural pence or pennies used when talking about the smallest amount of money possible: Buy a TV now and it won't cost you a penny (= will cost nothing) for three months. It was an expensive meal but worth every penny.\nMore examplesFewer examplesHe has calculated the costs down to the last penny.Ten pence is donated to charity for every bottle sold.I keep pennies and other small coins in a jar.When we were first married we had to pinch pennies just to get by.The machine will only accept 10p coins.\nSMART Vocabulary: related words and phrases\nBritish money\nbit\nbob\ncopper\ncrown\nfarthing\nfiver\nP, p\npence\npound\npound sign\npound sterling\nquid\nshilling\nsixpenny\nsmacker\nsovereign\nthreepenny\ntuppence\ntuppenny\ntwopenny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNorth American money\nPayment methods\nIdioms\nbe penny-wise and pound-foolish\nbe two/ten a penny\nin for a penny (in for a pound)\nnot have a penny to your name\nthe penny drops\n(a) penny for your thoughts\na penny saved is a penny earned\nused in the past with numbers to show how many pence something cost: a fourpenny ice-cream\nSMART Vocabulary: related words and phrases\nBritish money\nbit\nbob\ncopper\ncrown\nfarthing\nfiver\nP, p\npence\npound\npound sign\npound sterling\nquid\nshilling\nsixpenny\nsmacker\nsovereign\nthreepenny\ntuppence\ntuppenny\ntwopenny\nSee more results »\nAdd to word list\nAdd to word list\nin the US and Canada, a coin worth 1/100th of a dollar; a cent: I keep pennies in a jar.\nA penny can also mean the smallest amount of money possible or the total cost of something: Our insurance didn’t cover a penny of our medical bills. It was an expensive meal but worth every penny. Idiom\na penny for your thoughts\nAdd to word list\nAdd to word list\nMONEY\n&#160; abbreviation plural pence | pennies (also p) the smallest unit of money used in the UK. There are 100 pence in one pound (= the currency of the UK): a 20/50p piece Shares in the rival group are up 7 pence at 638p.\nMONEY\n&#160; plural pennies in the US and Canada, a cent (= one hundredth of a dollar)\nused in expressions to refer to a very small amount of money: We have never taken a penny of aid from federal government. If you pay it back within six months, you won't pay a penny in interest."}