{"id":270119,"name":"pension","type":"noun","us_sound":"ˈpen.ʃən","us_link":"../audio/p/pension.mp3","uk_sound":"ˈpen.ʃən","uk_link":"../audio/p/ukpenet022.mp3","content":"Add to word list\nAdd to word list\nB2 an amount of money paid regularly by the government or a private company to a person who does not work any more because they are too old or have become ill: US a government pensionUK a state pension. He won't be able to draw (= receive) his pension until he's 65.\nMore examplesFewer examplesThe Chancellor announced a miserly 75p a week rise in the state pension.He retired on a generous pension from the company.It's a bloody disgrace that some war widows don't get a decent pension.The perks of the job include a company pension scheme and a generous travel allowance.After years of loyal service, his boss fired him just before he would have qualified for a pension.\nSMART Vocabulary: related words and phrases\nGrants & allowances\nanti-subsidy\nbenefit\nbenny\nbursary\ncost-of-living allowance\ndearness allowance\nexpense\nfellowship\nfringe benefit\nparachute payments\npersonal allowance\npin money\nredundancy payment\nscholarship\nscrappage\nstipend\nsubsidized\nsubsidizer\nunemployment benefit\nweighting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRetiring & resigning\nAdd to word list\nAdd to word list\na sum of money paid regularly to a person who has retired (= stopped working because of having reached a certain age)\nAdd to word list\nAdd to word list\na regular income paid by a government or a financial organization to someone who no longer works, usually because of their age or health: comfortable/decent/generous pension They receive a generous pension, typically 75% of last pay drawn.pension plan/scheme Her new job offers a company pension scheme. Any pension contributions you pay into your plan qualify for tax relief. According to the report, CEOs received an average of $1.3 million in pension benefits last year.final-salary/index-linked pension If you want an index-linked pension, which will rise in line with inflation, you will get less to start with. draw/pay/receive a pension a full/small pension See also\ndisability pension\noccupational pension\nold age pension\npersonal pension\nportable adjective\nprivate offering\nretirement pension\nself-administered pension\nstakeholder pension\nstate pension\nState Second Pension\ntop hat pension\ntop-up pension"}