{"id":270342,"name":"pentecostal","type":"noun","us_sound":"ˌpen.t̬ɪˈkɑː.stəl","us_link":"../audio/p/eus73482.mp3","uk_sound":"ˌpen.tɪˈkɒs.təl","uk_link":"../audio/p/cdo0319ukpent1186.mp3","content":"Add to word list\nAdd to word list\na member of a Church or group that is part of the branch of the Christian religion known as Pentecostalism, whose members put a lot of emphasis on the power of the Holy Spirit, for example to make people who are sick healthy again, and who believe that everything in the Bible is true: Like other evangelicals, Pentecostals assert the Bible's word-for-word authority, the need to accept Christ, and the duty to share that faith with others before the end days.\nMore examplesFewer examplesMost Pentecostals take pride in an expressive form of worship in which members are encouraged to clap, raise their hands, and shout out, \"Hallelujah.\"Jason was raised a Pentecostal and DeMarco a Roman Catholic.She said she's still a Pentecostal. She speaks in tongues, raises her hand during praise songs, says \"amen\" during sermons, quotes Scripture and shares Christ with friends.In Guatemala, 23 percent of Pentecostals said their future financial outlook will improve a lot, compared with 19 percent of those from all faiths.Being a Pentecostal is to worship in community.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalist\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nSee\nPentecostalism\nrelating to Pentecostalism (= a branch of the Christian religion that puts a lot of emphasis on the power of the Holy Spirit, for example to make people who are sick healthy again, and that believes that everything in the Bible is true): Charles Fox Parham of Topeka is credited with founding the first Pentecostal church and Bible school.\nMore examplesFewer examplesAs for the role of the pastor in a Pentecostal church, it is much the same as in a mainline Protestant or Roman Catholic church.This form of music grew out of Pentecostal and independent Baptist churches that embraced pianos and guitars.He had had a Pentecostal upbringing, so he was open to faith healing.Ethnic minorities and, particularly, black Pentecostal Christians are helping increase dwindling church congregations in many cities.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalist\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nSee\nPentecostalism"}