{"id":270344,"name":"pentecostalist","type":"noun","us_sound":"ˌpen.t̬ɪˈkɑː.s.t̬əl.ɪst","us_link":"../audio/p/cdo0319uspent1298.mp3","uk_sound":"ˌpen.tɪˈkɒs.təl.ɪst","uk_link":"../audio/p/cdo0319ukpent1187.mp3","content":"Add to word list\nAdd to word list\na follower of Pentecostalism (= a branch of the Christian religion that puts a lot of emphasis on the power of the Holy Spirit, for example to make people who are sick healthy again, and that believes that everything in the Bible is true): Her family were Pentecostalists.\nMore examplesFewer examplesAlthough his uncle was a keen Pentecostalist, his family had a Protestant background.He had been brought up a Pentecostalist, but was struggling with issues of faith.He spoke before an ecstatic congregation of Pentecostalists. There are six million Pentecostalists in the US - but 24 million in Brazil.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalism\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligions & religious groups\nrelating to or believing in Pentecostalism (= a branch of the Christian religion that puts a lot of emphasis on the power of the Holy Spirit, for example to make people who are sick healthy again, and that believes that everything in the Bible is true): the Pentecostalist church a Pentecostalist preacher\nMore examplesFewer examplesJackie, a Pentecostalist grandmother from Ohio, said God had told her to join the mission.He was once engaged to a fellow member of the ultra-conservative Apostolic Pentecostalist church.The country's Pentecostalist movement has gathered many professional people.Assemblies of God is a Christian pentecostalist denomination formed in the USA and Canada in the early 20th century.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\nCoptic\ndenominational\ndenominationally\necclesiastical\necumenical\nLatinization\nLatinize\nLatinized\nLow Church\nLutheran\nPentecostalism\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligions & religious groups"}