{"id":270456,"name":"people","type":"noun","us_sound":"ˈpiː.pəl","us_link":"../audio/p/people.mp3","uk_sound":"ˈpiː.pəl","uk_link":"../audio/p/ukpente010.mp3","content":"Add to word list\nAdd to word list\nA1 men, women, and children: Many people never do any exercise. We've invited 30 people to our party.\nused to refer to everyone, or informally to the group that you are speaking to: People will think you've gone mad. People like to be made to feel important. Now that we've discussed our problems, are people happy with the decisions we've made?\nmen and women who are involved in a particular type of work: We'll have to get the people at the city council to look at these plans. Most of her friends are media people. the people\nC1 the large number of ordinary men and women who do not have positions of power in society: She claims to be the voice of the people. The president has lost the support of the people. the people's Princess someone's people informal\nthe people someone is related to: Her people come from Scotland originally. I prefer to live with my people. His people have been in the fishing industry for generations. Where do your people come from originally? We married and I moved to live with her people.\nMore examplesFewer examplesThere was a queue of people waiting patiently for the bus to arrive.Many more people travel overseas these days.It is outrageous that these buildings remain empty while thousands of people have no homes.The old people in the village still observe the local traditions.On average, people who don't smoke are healthier than people who do.\nSMART Vocabulary: related words and phrases\nPeople in general\nbeggar\nbird\nbod\nbody\ncoot\ndevil\nfellow man/men\nguy\nloiterer\nlubber\nmankind\nnumber\nparty\npeeps\nperson\nperson of interest\nrogue\nsod\nstiff\nvessel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomeone, anyone, no one or everyone\nWorkers in general\nOrdinary people\nFamily: relations in general\nGrammar\nMan, mankind or people?Traditionally, we use man to refer to all human beings, male and female, usually in contrast with other animals. However, many people consider this to be sexist, so it is better to use a different expression, such as human beings: …\nPerson, persons or people?We use person in the singular to refer to any human being: …\nIdioms\nman/woman of the people\nof all people\nall the men, women, and children who live in a particular country, or who have the same culture or language: The French are known as a food-loving people.\na society: Customs similar to this one are found among many peoples of the world.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSociety - general words\nGrammar\nMan, mankind or people?Traditionally, we use man to refer to all human beings, male and female, usually in contrast with other animals. However, many people consider this to be sexist, so it is better to use a different expression, such as human beings: …\nPerson, persons or people?We use person in the singular to refer to any human being: …\npeople plural noun\n(PERSONS)\nAdd to word list\nAdd to word list\nmen, women, and children generally; pl ofperson: There were a lot of people there. Some people were hurt.\nPeople can refer to a particular group mentioned: young/old people poor/rich people Those people look as if they’re lost.\nWhen you say the people, you mean the large number of ordinary men and women who do not have positions of power: The president wanted to take his message directly to the people. Note: See the usage note at person.\npeople noun [C]\n(NATION)\na culture or nation: It is a custom shared by many Native American peoples.\npeople verb [T]\n(PERSONS)\nIf a place is peopled by a particular type of people, they have moved there or live there: Honolulu is peopled by native Hawaiians, Japanese, Chinese, Filipinos, white Americans, and others.\nAdd to word list\nAdd to word list\nHR the people who work for a particular organization or person: Firms need to keep investing both in infrastructure and their people. Your people can talk to my people about percentages."}