{"id":270686,"name":"perception","type":"noun","us_sound":"pɚ-","us_link":"../audio/p/perception.mp3","uk_sound":"pəˈsep.ʃən","uk_link":"../audio/p/ukpente025.mp3","content":"perception noun\n(BELIEF)\nAdd to word list\nAdd to word list\nC2 [ C ] a belief or opinion, often held by many people and based on how things seem: We have to change the public's perception that money is being wasted. These photographs will affect people's perceptions of war.\nMore examplesFewer examplesThere is a general perception that exams are becoming easier to pass.It is my perception that his argument was fundamentally flawed.We need to change people's perception of the military.These perceptions reflect those of the general public.Popular perception of him is gradually changing.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdeas, concepts and theories\nperception noun\n(SIGHT)\n[ U ] the quality of being aware of things through the physical senses, especially sight: Drugs can alter your perception of reality.\n[ U ] someone's ability to notice and understand things that are not obvious to other people: She has extraordinary powers of perception for one so young. He's not known for his perception.\nSMART Vocabulary: related words and phrases\nKnowledge and awareness\nacquaintance\nalertness\nas every schoolboy/schoolchild knows idiom\nastuteness\nat/in the back of your mind idiom\nfamiliarity\nfirsthand\ngeneral knowledge\ngnostic\ngrounding\nlived experience\nmetacognition\nnescience\nnescient\noff someone's radar idiom\nsensibility\nstreet smarts\ntheory of mind\nvisual literacy\nwitting\nSee more results »\nperception noun\n(BELIEF)\nAdd to word list\nAdd to word list\n[ C ] a thought, belief, or opinion, often held by many people and based on appearances: Even though he had done nothing illegal, the public’s perception was that he had acted dishonestly, and he was forced to resign.\nperception noun\n(AWARENESS)\n[ U ] an awareness of things through the physical senses, esp. sight\nAdd to word list\nAdd to word list\nthe way that someone thinks and feels about a company, product, service, etc.: Although our handling of complaints has improved greatly, it continues to be a significant problem in terms of public perception. A strong brand has a big impact on product perception. Sometimes the experience of going through the course changes people's perceptions about entrepreneurship."}