{"id":270668,"name":"percent","type":"adverb","us_sound":"pɚˈsent","us_link":"../audio/p/percent.mp3","uk_sound":"pəˈsent","uk_link":"../audio/p/ukpente020.mp3","content":"Add to word list\nAdd to word list\nB1 for or out of every 100, shown by the symbol %: You got 20 percent of the answers right - that means one in every five. Only 40 per cent of people bothered to vote in the election.\nused for showing how sure you are about something, or how likely or true something is, or how much you agree with someone : I'm 99.9 percent sure I'm right. There's a 20% chance of rain today. Patients who develop symptoms have only a 10 per cent chance of surviving. I agree with you 101 percent. one hundred percent\ninformal (also a hundred percent, hundred percent) completely; used for emphasizing what you are saying: I agree with you one hundred percent.\nSee more\nMore examplesFewer examplesSales are up by 36 per cent. How about that?They offer a 10% discount on rail travel for students.Across the country, exam results have improved by an average of eight percent.I've managed to negotiate a five percent pay increase with my boss.\nSMART Vocabulary: related words and phrases\nNumerical relationships\nabsolute maximum\nabsolute minimum\narithmetic progression\ncardinality\ncommensurable\ndifferential\nharmonic progression\nintersect\ninverse function\ninverse proportion\nlinear\nlinearly\nproportion\nproportional\nprorate\nprorated\nquantile\nrank correlation\nratable\nsubset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for size and amount\nIdioms\ngive a hundred percent\nnot a hundred percent\nAdd to word list\nAdd to word list\nfor or out of every 100: You got 20 percent of the answers right. Only 48% of registered voters actually voted in the election.\nAdd to word list\nAdd to word list\none part of every 100, or the specified amount of something divided by 100: Business customers account for about 70 percent of the computing company's revenue.by 3/50/100, etc. percent The bank needed to reduce its workforce by 20 percent.\n→\npercentage : as a percent of sth Operating income as a percent of sales increased slightly from the previous year.\nfor or out of every 100, often shown by the symbol %: Shares fell 6 percent after the group warned profits would be lower than expected.\npercent adjective\nUnions urged workers to reject the 1.5 percent pay offer."}