{"id":270973,"name":"performing","type":"verb","us_sound":"pɚˈfɔːrm","us_link":"../audio/p/eus73497.mp3","uk_sound":"pəˈfɔːm","uk_link":"../audio/p/ukperch028.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nperform\nperform verb\n(DO)\nB2 [ T ] to do an action or piece of work: Computers can perform a variety of tasks. The operation will be performed next week. Most of the students performed well in the exam. perform well/badly\nto operate/not operate in a satisfactory way: The equipment performed well during the tests. These tyres perform badly/poorly in hot weather.\nMore examplesFewer examplesWe usually ask interviewees to perform a few simple tasks on the computer just to test their aptitude.Reversing round a corner is one of the manoeuvres you are required to perform in a driving test.In Britain, AIDS tests are now performed on all people who offer to become blood donors.The operation is performed under anaesthetic.He performs his duties very ably.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning\nperform verb\n(ENTERTAIN)\nB1 [ I or T ] to entertain people by dancing, singing, acting, or playing music: Thomas and Elisa performed a rousing duet for violin and piano. She composes and performs her own music. A major Hollywood star will be performing on stage tonight. There are plans to ban circuses with performing animals.\nMore examplesFewer examplesI've seen her perform on television, but never in the flesh.The orchestra is to perform its last ever concert tomorrow night at the Albert Hall.The choir will be performing the Hallelujah Chorus at the concert.She is performing in Birmingham tonight, on the third leg of her nationwide tour.They're performing twice nightly at the Playhouse Theatre.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrating & entertaining\nSinging"}