{"id":270971,"name":"performer","type":"noun","us_sound":"pɚˈfɔːr.mɚ","us_link":"../audio/p/performer.mp3","uk_sound":"pəˈfɔː.mər","uk_link":"../audio/p/ukperch030.mp3","content":"performer noun [C]\n(ENTERTAIN)\nAdd to word list\nAdd to word list\nB1 a person who entertains people by acting, singing, dancing, or playing music: He's a brilliant performer.\nMore examplesFewer examplesShe's a wonderfully creative dancer but she doesn't have the technique of a truly great performer.a vibrant young performerThe show climaxed with all the performers singing on stage together.So let's hear some applause for these talented young performers.The performers tell the story through song and dance.\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactor\nactress\nall-star\nalum\nbelly dancer\nbill\ncast\nchorus\nheadliner\nimproviser\njuvenile lead\nleading lady\nleading man\nscream queen\nspear carrier\nstage name\nstarlet\nstooge\nsuperstar\ntroupe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEntertainers in general\nperformer noun [C]\n(DO)\nIf someone or something is a particular type of performer, they do, or it does, a stated thing well or badly: The British boat was the star performer in the race. If you like steady performers and are in for the long haul, these shares are still worth buying.\nsomeone who performs something such as an action, test, or a piece of work: In an active sentence, the performer of a verbal action is the subject of the sentence. The company is the only performer of the test in Europe.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\npocket\nrail\nrepresent\nstorming\nsuccessful\nsuccessfully\nsuperachiever\nsuperhit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing and acts\nAdd to word list\nAdd to word list\nFINANCE a product, business, investment, etc. when it is judged by how well it operates, how much profit it makes, etc. compared to others: best/worst performer Retail shares were among the best performers of the day.good/solid/strong performer It's a well-designed, solid performer for a reasonable price.star/top performer The clothing store was the star performer in yesterday's interim results.low/weak/poor performer Consumer products were the weakest performer with profits 4% ahead.\nHR a person when they are judged by how well they are doing their job: star/top performer Although two employees could be of the same grade levels, top performers were assigned more prestigious positions. a good/strong performer a high/outstanding performer a poor/low/weak performer"}