{"id":270978,"name":"perfume","type":"noun","us_sound":"ˈpɝː.fjuːm","us_link":"../audio/p/perfume.mp3","uk_sound":"ˈpɜː.fjuːm","uk_link":"../audio/p/ukperfu001.mp3","content":"Add to word list\nAdd to word list\nA2 [ C or U ] a liquid with a pleasant smell, usually made from oils taken from flowers or spices and often used on the skin: What perfume are you wearing? She adores French perfume.\n[ U ] a pleasant natural smell: The perfume of the roses filled the room.\nThesaurus: synonyms, antonyms, and examples\na smellsmellWhat's that terrible smell?aromaThe delicious aroma of fresh bread wafted out of the bakery.fragranceI adore the delicate fragrance of roses.perfumeThe perfume of the flowers filled the room.scentShe smelled the sweet scent of the lilies.odourUK There was the unmistakable odour of sweaty feet.\nSee more results »\nMore examplesFewer examplesShe dabbed a little perfume behind her ears.He bought his wife some duty-free perfume.She loved the wonderful musky perfume of the library.The evening was cool and pleasant, with the faintest perfume of apple blossoms upon the breeze.\nSMART Vocabulary: related words and phrases\nToiletry & perfumes\naftershave\nagarbatti\nair freshener\nbath bomb\nbath salts\nbinturong\ncarbolic soap\nemery board\nmusk\npowder puff\nsanitary\nshave\nshower gel\nSPF\nswab\ntoilet soap\ntoothpick\ntowelette\nwax melt\nylang-ylang\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSmells & smelling\nto make something or somewhere smell pleasant: In the evening, the flowers perfume the air. The cobbled streets were perfumed by wood smoke.\nMore examplesFewer examplesThe air is perfumed by breezes from the nearby Pacific.A drop of essential oil on a handkerchief will perfume a room if left on a radiator.Thyme's invigorating aroma not only perfumes the chicken but also your kitchen.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nAdd to word list\nAdd to word list\na liquid produced and sold for its strong, pleasant smell, often used on the skin: [ U ] She put a few drops of perfume on the back of her neck."}