{"id":270965,"name":"performance","type":"noun","us_sound":"pɚˈfɔːr.məns","us_link":"../audio/p/eus73498.mp3","uk_sound":"pəˈfɔː.məns","uk_link":"../audio/p/ukperch029.mp3","content":"performance noun\n(ACTIVITY)\nAdd to word list\nAdd to word list\nB2 [ C or U ] how well a person, machine, etc. does a piece of work or an activity: He was an experienced player who was always seeking to improve his performance. High-performance cars (= those that are fast, powerful, and easy to control) are the most expensive. This was a very impressive performance by the young player, who scored 14 points within the first ten minutes.\nMore examplesFewer examplesThe financial performance of the business is fully expected to improve.He was fired from his $165,000 job for poor performance.At the end of each teaching practice, trainee teachers are asked to appraise their own performance.That was an impressive performance from such a young tennis player.When criticisms were made of the school's performance, the parents' group countered with details of its exam results.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nmove\nresponsibility\nrole-play\nrot\nstep\nstep up\nstuff\ntalk\nSee more results »\nperformance noun\n(ENTERTAINMENT)\nB1 [ C ] the action of entertaining other people by dancing, singing, acting, or playing music: a performance of Arthur Miller's play \"The Crucible\" She gave a superb performance as Lady Macbeth. a performance mainly UK informal\nan action or type of behaviour that involves a lot of attention to detail or to small matters that are not important: Cleaning the oven is such a performance. What a performance! Please stop shouting! The fish pie is a bit of a performance to make. We managed to assemble the bookshelves eventually, but it was a real performance. We had such a performance getting the new sofa into the house. a repeat performance\nan occasion when an event or a situation happens again: The police hope to avoid a repeat performance of last year, when the festivities turned into rioting.\nSee more\nMore examplesFewer examplesWe all clapped his performance enthusiastically.an electrifying performanceThe audience was enraptured by the young soloist's performance.There was an explosion of applause from the audience at the end of the performance.She gave a masterly performance as Kate in 'The Taming of the Shrew'.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntableau\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult things and people\nperformance noun\n(DOING)\nAdd to word list\nAdd to word list\n[ U ] the act of doing something, such as your job: If the accident happened during the performance of his regular duties, he’s covered by disability insurance.\n[ U ] Performance also refers to how well an activity or job is done: With a record of 2 wins and 3 defeats, the team’s performance has been disappointing.\nAdd to word list\nAdd to word list\n[ C or U ] how successful an investment, company, etc. is and how much profit it makes: The Fund's past performance does not necessarily indicate how it will perform in the future.good/solid/strong performance Last year saw a strong performance from the high-street retailer.bad/disappointing/poor performance The retailer said it would restructure operations to cut costs after its disappointing performance of the past year.business/economic/financial performance Financial performance was below expectations and we are working on improvements.boost/improve/measure performance The board is under pressure to improve performance following a profits warning in January. The business value model should include high-level performance measures such as profitability, market growth, etc. operating/trading performance\n[ U ]\n&#160; IT how well a computer, machine, etc. works: The latest Intel-based notebooks rival PC performance.\n[ U ] how well someone does their job or their duties: good/impressive/poor perfomance He was fired for poor performance. John's departure is not directly related to his performance.\nLAW\n&#160; formal the act of doing what is stated in a legal agreement: Subject to due performance of its obligations, each Party shall be entitled to receive copies of all results. See also\nhigh-performance\nspecific performance"}