{"id":271505,"name":"peripheral","type":"adjective","us_sound":"pəˈrɪf.ɚ.əl","us_link":"../audio/p/peripheral.mp3","uk_sound":"pəˈrɪf.ər.əl","uk_link":"../audio/p/ukperfu015.mp3","content":"Add to word list\nAdd to word list\nSomething that is peripheral is not as important as something else: The book contains a great deal of peripheral detail.\nhappening at the edge of something: A figure came into my peripheral vision.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\npicayune\npicture\npiddling\npiddly\npiffling\nunserious\nunseriousness\nvenial\nvestigial\nvestigially\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEdges & extremities of objects\na piece of equipment, such as a printer, that can be connected to a computer\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nprinter\nSee more results »\nAdd to word list\nAdd to word list\nnot central or of main importance: First of all, we had to find out who the thief was – getting the money back was a peripheral issue.\nPeripheral vision is what you can see to the sides of what you are looking at.\na piece of equipment, such as a printer, that can be connected to a computer\nAdd to word list\nAdd to word list\nused to describe something that is not as important as the main thing to which it is related, for example a company's less successful activities in relation to its most successful ones: Some of the more peripheral interests have been sold and the company now has a clearer focus on certain markets.\nIT used to describe a piece of equipment, such as a printer, that can be connected to a computer: The system is expected to boost sales of PCs as well as components, applications, and peripheral devices.\nIT a piece of equipment, such as a printer, that can be connected to a computer: Whether something is a peripheral or part of a computer is not always clear."}