{"id":271390,"name":"period","type":"noun","us_sound":"ˈpɪr.i.əd","us_link":"../audio/p/eus73504.mp3","uk_sound":"ˈpɪə.ri.əd","uk_link":"../audio/p/ukperfu010.mp3","content":"period noun [C]\n(TIME)\nAdd to word list\nAdd to word list\nB1 a length of time: Her work means that she spends long periods away from home. Unemployment in the first half of the year was 2.5 percent lower than in the same period the year before. 15 people were killed in/over a period of four days. The study will be carried out over a six-month period.\na fixed time during the life of a person or in history: Most teenagers go through a rebellious period. The house was built during the Elizabethan period.\nB1 in school, a division of time in the day when a subject is taught: We have six periods of science a week.\none of the fixed times that a sports game is divided into, especially in ice hockey (= a team game played on ice, with curved sticks and a small disc): The match was won and lost in the first period, when Durham fell six goals behind. In the second period he scored by banking the puck off the right post and into the net.\nMore examplesFewer examplesHer time at university was the most eventful period of her life.He was one of the most important writers of that period.The war was followed by a long period of peace and prosperity.The 1990s were a period of rapid change.The police are carrying out spot checks on drivers over the Christmas period to test for alcohol levels.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nrest\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStages & phases\nStages of life\nClasses & courses\nHockey\nperiod noun [C]\n(BLOOD)\nthe process of blood coming from the uterus (= the organ in which a baby develops before birth), which usually happens once a month when someone is not pregnant: period pains She'd missed a period and was worried.\nSMART Vocabulary: related words and phrases\nObstetrics: processes & stages connected with sexual reproduction\namniotic\nandropause\ncome on\ndysmenorrhea\nfetal\nimpregnate\nmenopause\nmenstrual\nmenstrual cycle\nmenstruate\nnon-cyclical\novulate\novulation\novulatory\nperimenopausal\nperimenopause\nPMS\npremenstrual\npubescent\nsomeone's biological clock is ticking idiom\nSee more results »\nperiod noun [C]\n(MARK)\nmainly US (UK usually full stop) the symbol . used in writing at the end of a sentence or at the end of the short form of a word\nmainly US said at the end of a statement to show that you believe you have said all there is to say on a subject and you are not going to discuss it any more: There will be no more shouting, period!\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\nbracket\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\ntilde\nunbracketed\nuncapitalized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nperiod costume/dress/furniture\nthe clothes or furniture of a particular time in history: They performed \"Julius Caesar\" in period dress.\nSee more\nperiod noun [C]\n(TIME)\nAdd to word list\nAdd to word list\na length of time: The study will be carried out over a six-month period.\nA period in the life of a person or in history is a particular time during that life or history: The period after World War II was marked by rapid economic growth.\nA period is a division of time in an event of fixed length, such as a day at school or a game: There was no scoring in the second period.\nphysics A period is the time it takes for one complete repetition of a pattern that repeats. A second is used as the standard unit in most areas of science.\nPeriod costume/dress/furniture is the clothing or furniture of a particular time in history: At the Revolutionary War theme park, everyone was wearing period costumes.\nperiod noun [C]\n(MARK)\na mark (.) used in writing to show where the end of a sentence is, or to show that the letters before it are an abbreviation (= short word form)\ninfml You can say period at the end of a statement as a way of adding emphasis: There will be no more shouting, period!\nperiod noun [C]\n(BLEEDING)\n(also menstrual period, us/ˈmen·strəlˌpɪr·i·əd, -strə·wəl-/) the bleeding from a woman’s uterus that happens approximately every four weeks when she is not pregnant\nperiod noun [C]\n(REPEATED EVENT)\nscience the time needed to complete a regularly repeating event or series of events\nperiod noun [C]\n(ROW)\nchemistry any of the rows in the periodic table of chemical elements\nAdd to word list\nAdd to word list\na length of time: a period of six months/10 years, etc. This debt is repayable over a period of five years in equal quarterly instalments. Profit fell 75.1% from the same period a year ago. The Government will make an additional 10% contribution for a limited period. The second quarter of the year should have been a busy period. See also\naccounting period\ncooling-off period\ndeferment period\nearnout period\npayback period\npay period\nqualifying period\nrecovery period\nreporting period"}