{"id":271911,"name":"permit","type":"verb","us_sound":"pɚˈmɪt","us_link":"../audio/p/eus73514.mp3","uk_sound":"pəˈmɪt","uk_link":"../audio/p/ukperki018.mp3","content":"Add to word list\nAdd to word list\nB1 [ T ] to allow something: The regulations do not permit much flexibility. [ + -ing verb ] The prison authorities permit visiting only once a month. [ + obj + to infinitive ] The security system will not permit you to enter without the correct password. As it was such a special occasion, she permitted herself a small glass of champagne.formal The law permits of no other interpretation.\nThesaurus: synonyms, antonyms, and examples\nto allow someone to do somethingallowAm I allowed to go to the park?letShe wanted to go but her parents wouldn't let her.permitSmoking is not permitted in any part of the building.have your permissionYou have my permission to stay out past midnight on Friday.authorizeWho authorized this expenditure?give something the go-aheadThe government has given the go-ahead for a multi-billion pound road-building project.\nSee more results »\nC1 [ I ] to make something possible: The Chancellor is looking to lower interest rates, when economic conditions permit. We have arranged to play tennis on Saturday, weather permitting (= if the weather is good enough).\nMore examplesFewer examplesEntry to the club is only permitted on production of a membership card.Smoking is not permitted anywhere in this theatre.Some prisoners who want to start a family are to be permitted conjugal visits.Machine-readable passports will permit precise identity-checking.How can a loving, omnipotent God permit disease, war and suffering?\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nsufferance\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\nGrammar\nAllow, permit or let?Allow, permit and let are verbs that all have a similar meaning: ‘give permission or make it possible for somebody to do or have something’. …\nPermit/allow someone + to do somethingWe use a direct object + to-infinitive after permit and allow: …\nLet someone + do somethingWe use an infinitive without to after let: …\nPassive with permit and allowWe often use the passive with permit and allow. Permit is often used for official public notices: …\nC1 an official document that allows you to do something or go somewhere: a work/travel/parking permit She has managed to obtain a temporary residence permit. [ + to infinitive ] Do you need a permit to park here?\nMore examplesFewer examplesI pay £5 a week for my parking permit.The office will be issuing permits on Tuesday and Thursday mornings.Please turn your old parking permits in at the end of the week.You'll need a special permit if you want to use the facilities regularly.You will have to apply to City Hall for a building permit.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\ndriving licence\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nproceedings\npt\nPTO\nrecertification\nrecertify\nrecharter\nrenewable\nwarrant\nwrit\nSee more results »\nGrammar\nPermit or permission?The countable noun permit (pronounced /ˈpɜ:mɪt/) refers to an official document that allows you to do something or go somewhere. The uncountable noun permission refers to when someone is allowed to do something. It does not refer to a document: …\nAdd to word list\nAdd to word list\nto allow something, or make something possible: Playing loud music is not permitted after 10 pm.\nan official document that allows you to do something: Do you have a permit to park here?\nAdd to word list\nAdd to word list\nan official document that allows you to do something or go somewhere: grant/apply for/issue a permit The agency declined to issue a permit.permit for sth The permit for exploratory drilling is good for 30 days.permit to do sth Retailers need a permit to sell fireworks. See also\nbuilding permit\nconstruction permit\nexport permit\nimport permit\nresidence permit\nwork permit\n[ T ] to allow something: It is entirely at the carriers' discretion to permit a factory to load features into the newest phones. U.S. officials were not permitted to interview him.\n[ I or T ] to make something possible: Finally, the reports would permit the Commission to make information available to the public."}