{"id":271903,"name":"permission","type":"noun","us_sound":"pɚˈmɪʃ.ən","us_link":"../audio/p/permission.mp3","uk_sound":"pəˈmɪʃ.ən","uk_link":"../audio/p/ukperki014.mp3","content":"Add to word list\nAdd to word list\nB1 If someone is given permission to do something, they are allowed to do it: [ + to infinitive ] You will need permission from your parents to go on the trip. Official permission has been granted for more building near the river. The authorities have refused permission for the demonstration to take place.UK Planning permission was refused for the proposed superstore.US Zoning permission was refused for the proposed superstore.\nThesaurus: synonyms, antonyms, and examples\nto allow someone to do somethingallowAm I allowed to go to the park?letShe wanted to go but her parents wouldn't let her.permitSmoking is not permitted in any part of the building.have your permissionYou have my permission to stay out past midnight on Friday.authorizeWho authorized this expenditure?give something the go-aheadThe government has given the go-ahead for a multi-billion pound road-building project.\nSee more results »\nMore examplesFewer examplesHas the director given you permission to do that?We've received permission to go ahead with the music festival in spite of opposition from local residents.You'll pay some hefty bank charges if you go overdrawn without permission.The local council refused him planning permission to build an extra bedroom.You have to ask permission to leave.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nsufferance\nSee more results »\nGrammar\nPermit or permission?The countable noun permit (pronounced /ˈpɜ:mɪt/) refers to an official document that allows you to do something or go somewhere. The uncountable noun permission refers to when someone is allowed to do something. It does not refer to a document: …\nAdd to word list\nAdd to word list\nthe act of allowing someone to do something, or of allowing something to happen: Parents have to give their permission for their children to go on school trips. [ + to infinitive ] We had to get permission (= approval) from the city to build an extension to our house. permissible adjective us\nYour browser doesn't support HTML5 audio\n/pərˈmɪs·ə·bəl/\nIt is no longer permissible for athletic programs in universities to give a lot more money for men’s sports than for women’s sports.\nAdd to word list\nAdd to word list\n[ U ] the act of allowing something to happen, or allowing someone to do something: permission for sth The EU has already granted its permission for the deal to go through.permission to do sth We did get permission to hire more staff. They did the work without permission and without an official budget. Don't give permission to websites to install programs or files on your PC.ask for/seek/request permission Today's court case is to seek permission to convene meetings with shareholders.get/obtain/receive permission You must obtain permission from the Inland Revenue before going abroad.grant/deny/refuse permission The Council has decided to refuse permission for the development to go ahead.\n[ C, often plural ]\n&#160; LAW an official document allowing someone to do something: All the necessary permissions are in place."}