{"id":272352,"name":"persuading","type":"verb","us_sound":"pɚˈsweɪd","us_link":"../audio/p/persuade.mp3","uk_sound":"pəˈsweɪd","uk_link":"../audio/p/ukperso015.mp3","content":"Add to word list\nAdd to word list\npresent participle of\npersuade\nB1 to make someone do or believe something by giving them a good reason to do it or by talking to that person and making them believe it: If she doesn't want to go, nothing you can say will persuade her. [ + (that) ] It's no use trying to persuade him (that) you're innocent. [ + to infinitive ] He is trying to persuade local and foreign businesses to invest in the project. Using a bunch of bananas, the zoo-keeper persuaded the monkey back into its cage.formal The first priority is to persuade the management of the urgency of this matter. Her legal advisers persuaded her into/out of mentioning (= to mention/not to mention) the names of the people involved in the robbery. Synonym\ntalk someone into somethingOpposites\ndeter\ndissuadeCompare\nconvince\nencourage\nThesaurus: synonyms, antonyms, and examples\nto persuade someone to do somethingpersuadeIf she doesn't want to do it, nothing you say will persuade her.convinceThe lawyer convinced the jury of the man's innocence.talk someone intoShe managed to talk me into going along.talk someone out ofI think I've talked him out of leaving the country.dissuadeI tried to dissuade her from leaving.cajoleHe really knows how to cajole people into doing what he wants.\nSee more results »\nMore examplesFewer examplesClever salesmanship can persuade you to buy things you don't really want.We only need one more player for this game - can you persuade your sister to join in?I have a suspicion that he only asked me out because my brother persuaded him to.Johnson was influential in persuading the producers to put money into the film.She used her womanly charms to persuade him to change his mind.\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »"}