{"id":272253,"name":"personal","type":"adjective","us_sound":"ˈpɝː.sən.əl","us_link":"../audio/p/personal.mp3","uk_sound":"ˈpɜː.sən.əl","uk_link":"../audio/p/ukperpe028.mp3","content":"Add to word list\nAdd to word list\nB1 relating or belonging to a single or particular person rather than to a group or an organization: My personal opinion/view is that the students should be doing more work outside the classroom. Her uncle takes a personal interest in her progress. She has her own personal secretary/bodyguard/fitness instructor. Passengers are reminded to take all their personal belongings with them when they leave the plane.\nA personal action is one that is done by someone directly rather than getting another person to do it: The mayor made a personal appearance at the hospital. I will give the matter my personal attention.\nB1 private or relating to someone's private life: The letter was marked \"Personal. Strictly confidential.\" Do you mind if I ask you a personal question? His resignation was apparently for personal rather than professional reasons. For such a famous, wealthy man, his personal life was surprisingly simple and ordinary.\nC1 relating to your body or appearance: She is obsessed with personal hygiene. personal remark/comment\nan intentionally offensive remark about someone's character or appearance: Did you have to make such a personal remark about her new haircut?\nSee more get personal informal\nto start being rude to someone about their character or appearance: As long as the criticism is honestly given and doesn't get personal, I can handle it.\nSee more\nMore examplesFewer examplesThe college now has a counsellor to help students with both personal and work problems.Could I talk to you about a personal matter?With a personal fortune of six million pounds, she certainly doesn't work because she needs to.Please remember to take all your personal possessions with you when you leave the aircraft.The signing of the agreement was a personal triumph for the prime minister.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nMind and personality\npersonal noun [C]\n(ADVERTISEMENTS)\nthe personals\nUS (UK personal column) the part of a newspaper or magazine that contains short advertisements and private messages: Many of his friends met people through the personals.\nSee more\npersonal noun [C]\n(BASKETBALL)\nanother name for a\npersonal foul\nAdd to word list\nAdd to word list\nrelating or belonging to a single or particular person: I think you have a personal responsibility to know when to stop. That’s my personal opinion. He was given one hour to pack his personal belongings and leave.\nPersonal is also used to refer to your body: Students are taught about personal hygiene.\nA personal action is one that is done by someone directly rather than by someone else: The governor made a personal appearance at the hospital.\nPersonal also means private or relating to someone’s private life: Simon’s songs are intensely personal. He’s got problems in his personal life.\nPersonal also refers to an intentionally offensive or critical remark about someone’s character or appearance: There’s no need to get personal.\nAdd to word list\nAdd to word list\nbelonging to a single or particular person rather than to a group or an organization: The rising levels of personal debt are already a considerable problem for the economy. There is always some personal risk involved in purchase decisions.\nintended for a single or particular person rather than for a group or an organization: He didn't earn enough to qualify for a personal loan.\nacting as a single or particular person rather than a group or an organization: The company designs and operates schemes for personal customers such as credit insurance.\nconnected with someone's private life, rather than their job: She has resigned from the board for personal reasons. The law allows the government access to the personal affairs of many people. Only you, or someone you authorize, should provide your personal information to others. The fear is that the collection of so much personal data by one firm could expose it to theft."}