{"id":272263,"name":"personalize","type":"verb","us_sound":"ˈpɝː.sən.əl.aɪz","us_link":"../audio/p/personalize.mp3","uk_sound":"ˈpɜː.sən.əl.aɪz","uk_link":"../audio/p/ukperpe030.mp3","content":"Add to word list\nAdd to word list\nIf you personalize an object, you change it or add to it so that it is obvious that it belongs to or comes from you: The computer allows you to personalize standard letters by adding a greeting to each one. She had done little to personalize her room, except hang a few posters on the walls.\nto make something suitable for the needs of a particular person: She hired a trainer to create a personalized exercise schedule to get her into shape.\nIf you personalize a subject, you make people feel more emotionally involved in it by giving examples about real people: By telling people about her accident, she personalizes the numbing figure of traffic accidents that happen every year.\ndisapproving If you personalize an argument or discussion, you start to criticize someone's bad qualities instead of discussing the facts.\nSMART Vocabulary: related words and phrases\nUnique and unusual\naccidental\nalt-\nalternative\natypically\nbe marked out as something idiom\nguerrilla\nincongruous\ninimitable\ninimitably\nirreplaceable\npersonalized\nquaintly\nquaintness\nquirkily\nquirkiness\nuniquely\nunmatchable\nunmatched\nunparalleled\nunrivalled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing & telling stories\nDisapproving & criticizing\nAdd to word list\nAdd to word list\nto make something specially suitable for a particular person: We try to personalize these stories for the people who are listening.\nIf you personalize an issue, you talk about how it relates to particular people: In his description, he personalizes the plight of the homeless.\nObjects that are personalized have your name or something else you choose on them: personalized checks personalized license plates\nIf you personalize an argument or discussion, you start to criticize the other person’s faults instead of discussing the facts: We shouldn’t personalize these negotiations.\nAdd to word list\nAdd to word list\nto make something suitable for the needs of a particular person: This cookie is used by one online retailer to personalize the website for you. We try to personalize the service they receive without being too personal.\nto change something or add to it so that it is obvious that it belongs to or comes from you: I have personalized my e-mail signature to let others know I am recruiting team members."}