{"id":272260,"name":"personality","type":"noun","us_sound":"ˌpɝː.sənˈæl.ə.t̬i","us_link":"../audio/p/eus73518.mp3","uk_sound":"ˌpɜː.sənˈæl.ə.ti","uk_link":"../audio/p/ukperpe029.mp3","content":"personality noun\n(CHARACTER)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the type of person you are, shown by the way you behave, feel, and think: She has a very warm personality. He is well qualified for the job, but he does lack personality (= he is a boring person).\nMore examplesFewer examplesShe has a really intriguing personality.He had a nice smile and an appealing personality.She's no oil painting but she's got a lovely personality.He's not much to look at, but he has a wonderful personality.a vibrant personality\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\njib\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nSee more results »\npersonality noun\n(FAMOUS PERSON)\nB2 [ C ] a famous person: The show is hosted by a popular TV personality.\nThesaurus: synonyms, antonyms, and examples\nsomeone famouscelebrityThe magazine is all about the lives of celebrities.celebWhich celeb recently spent $60,000 on an engagement ring?slebUK She was last spotted interviewing a minor sleb on the red carpet.starHer ambition was always to become a movie star.superstarRock superstar Elton John grew up working class in England.legendHe became a legend in his own lifetime.\nSee more results »\nSMART Vocabulary: related words and phrases\nFamous people\nArchimedes\nAristotle\nbig name\nboldface\nboldfaced\ncelebrity\nglitterati\nHippocrates\nhousehold name\nimmortal\nit girl\nJulius Caesar\nlegend\nluminary\nnotable\npantheon\npersonage\npublic figure\nrising star\nsuperstar\nSee more results »\nAdd to word list\nAdd to word list\nthe special combination of qualities in a person that makes that person different from others, as shown by the way the person behaves, feels, and thinks: [ C ] She has a cheerful, attractive personality. [ U ] Personality is formed at a very early age.\nA personality is also a famous person, esp. in popular entertainment or sports: [ C ] a TV personality\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; HR the type of person you are, which is shown by the way you behave, feel, and think: He has a dynamic personality, makes excellent decisions, and is a true leader. The real issue is about personality clashes with management.\n[ U ]\n&#160; LAW the quality an organization has when it is seen as being legally separate from its owners: In England and Wales, a partnership does not have separate legal personality.\n[ C or U ]\n&#160; MARKETING the set of qualities that make a product interesting, attractive, etc.: A corporate personality can become a tangible asset. Product personality is determined by how a product looks and how it is perceived\nSee also\nbrand personality"}