{"id":272298,"name":"personnel","type":"noun","us_sound":"ˌpɝː.sənˈel","us_link":"../audio/p/personnel.mp3","uk_sound":"ˌpɜː.sənˈel","uk_link":"../audio/p/ukperso007.mp3","content":"Add to word list\nAdd to word list\nC1 the people who are employed in a company, organization, or one of the armed forces: The new director is likely to make major changes in personnel. military personnel\nC1 the department of a company or organization that deals with its employees when they first join, when they need training, or when they have any problems: Personnel will help you find somewhere to live. For more information about the job, please contact the personnel manager.\nMore examplesFewer examplesService personnel are subject to the Official Secrets Act.I initialled the documents and returned them to personnel.No admittance to unauthorized personnel.Enquiries about the post should be addressed in the first instance to the personnel manager.This is a restricted area, open to authorized personnel only.\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ncutter\ndrudge\nlabour force\nlabour market\nmachinist\nmanpower\nrelay\nsalaryman\nskeleton staff\nslogger\nstaff\nthe shop floor\nworkforce\nworkhorse\nworking group\nworking party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOffice practices\nAdd to word list\nAdd to word list\nthe people working in an organization or for a particular type of employer: Saturday was the most convenient day for students, parents, and school personnel. military personnel\nhuman resources\nAdd to word list\nAdd to word list\n[ plural ] the people who are employed by a company or organization: skilled/qualified/trained personnel Knowing how to handle difficult situations requires qualified personnel. The company may consider taking out insurance against the loss of key personnel.marketing/sales/technical personnel The sales personnel in a sales force evolves constantly. military/security personnel He has made personnel changes in the investment banking and bond areas.\n[ U ] the department of a company or organization that deals with employees when they join or leave, when they need training, when they have problems, etc.: Her personnel file showed excellent performance.the personnel department/division Few companies give their personnel department the same status as their finance department.the personnel chief/manager/office As personnel manager of a large company, I have regular meetings with our union. Compare\nhuman resource"}