{"id":272197,"name":"persevered","type":"verb","us_sound":"ˌpɝː.səˈvɪr","us_link":"../audio/p/persevere.mp3","uk_sound":"ˌpɜː.sɪˈvɪər","uk_link":"../audio/p/ukperpe013.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npersevere\nto continue making an effort to do or achieve something, even when this is difficult or takes a long time: If you persevere long enough and work hard enough, you’ll eventually succeed. I did not persevere with learning to play the violin. We will persevere in this struggle for peace, no matter how long it takes. The prime minister is aware of the risks of persevering with an unpopular policy. He urged them to persevere in keeping the promises they had made.\nto continue to exist despite a difficult or changing situation: Somehow, in the midst of despair, friendships and laughter persevered. Although modernization has reached the countryside, some traditions persevere. The town has persevered through epidemics, wars, and two great fires.\nMore examplesFewer examplesTheir encouragement and faith in my abilities motivated me to persevere.Not all of the proposals are worth persevering with.The company persevered in retraining the workforce at the expense of short-term profit.It looks as if the policy will be a success, providing that the government perseveres and does not give in to its critics.The education director is persevering in his attempt to obtain additional funding for the school.Despite receiving little support, the women are persevering with their crusade to fight crime.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\nCompare\npersistRelated words\nperseverance\nperseverant\npersevering"}