{"id":272267,"name":"personally","type":"adverb","us_sound":"ˈpɝː.sən.əl.i","us_link":"../audio/p/personally.mp3","uk_sound":"ˈpɜː.sən.əl.i","uk_link":"../audio/p/ukperso001.mp3","content":"Add to word list\nAdd to word list\nB1 used when you give your opinion: Personally (speaking), I think the show is going to be a great success.\nB2 affecting you and not anyone else: He believes that parents should be made personally responsible for their children's behaviour.\nB2 done by you and not by someone else: These figures should be correct because I've checked them personally. take something personally\nC1 to think that someone is offending you when they are not: These criticisms should not be taken personally (= they are not meant to criticize any one person in particular).\nSee more\nMore examplesFewer examplesHe held me personally responsible whenever anything went wrong in the project.She's a very talented young singer, Mike and I personally think she's got a great future ahead of her!The Minister intervened personally to stop the museum being closed.I am not personally acquainted with the gentleman in question.The director will introduce the film personally at its world première.\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParticular and individual\nLinguistics: personal pronouns\nGrammar\nEvaluative adverbs (surprisingly) and viewpoint adverbs (personally)We put some adverbs outside the clause. They modify the whole sentence or utterance. Evaluative and viewpoint adverbs are good examples of this: …\nAdd to word list\nAdd to word list\nPersonally can refer to yourself or your own opinion: Personally, I think their marriage won’t last. I haven’t been there personally, but I’ve read a lot about it.\nIf you do something personally, you do it yourself rather than asking someone else to do it: He plans to personally direct the fund-raising drive. He believes that parents should be made personally responsible for their children’s behavior.\nPersonally also refers to an intentionally offensive remark about someone’s character or appearance or which is understood as being critical: Please don’t take this personally, but I think you need to brush your teeth."}