{"id":272232,"name":"persistent","type":"adjective","us_sound":"pɚˈsɪs.tənt","us_link":"../audio/p/persistent.mp3","uk_sound":"pəˈsɪs.tənt","uk_link":"../audio/p/ukperpe020.mp3","content":"Add to word list\nAdd to word list\nlasting for a long time or difficult to get rid of: a persistent smell/skin rash Symptoms of the illness include a high temperature and a persistent dry cough. There have been persistent rumours that the principal might take early retirement.\nC2 Someone who is persistent continues doing something or tries to do something in a determined but often unreasonable way: Be persistent - don't give up. He has been a persistent critic of the president. She is a persistent offender and has been arrested five times this year for shoplifting.\nThesaurus: synonyms, antonyms, and examples\nworking to achieve a goal even if it is difficult determinedI was determined not to give up.doggedHer dogged determination to uncover the truth about the scandal led to her winning a reporting prize.persistentThe shop never gives refunds, but if you are persistent, they may. resolvedI am resolved to do something about the issue.resoluteWe must remain resolute in the face of opposition.single-mindedShe was single-minded and uncompromising in her work.\nSee more results »\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nhere to stay idiom\nimmanence\nimmanent\nimmanently\nimperishable\nnon-stop\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong-willed\nRelated word\npersistently\nAdd to word list\nAdd to word list\ncontinuing to exist past the usual time, or continuing to do something in a determined way even when facing difficulties or opposition: a persistent cough persistent rumors persistently adverb us\nYour browser doesn't support HTML5 audio\n/pərˈsɪs·tənt·li, -ˈzɪs-/\nThe rains persistently fell."}