{"id":272199,"name":"persevering","type":"adjective","us_sound":"ˌpɝː.səˈvɪr.ɪŋ","us_link":"../audio/p/usperpl003.mp3","uk_sound":"ˌpɜː.sɪˈvɪə.rɪŋ","uk_link":"../audio/p/ukperpe014.mp3","content":"Add to word list\nAdd to word list\nhaving the quality of continuing to make an effort to do or achieve something, even when this is difficult or takes a long time: He was one of the most determined, stubborn, persevering people I had ever met. She was persevering enough to reach the height of her ambition and become CEO. They have a persevering spirit through hardship.\nThesaurus: synonyms, antonyms, and examples\nworking to achieve a goal even if it is difficult determinedI was determined not to give up.doggedHer dogged determination to uncover the truth about the scandal led to her winning a reporting prize.persistentThe shop never gives refunds, but if you are persistent, they may. resolvedI am resolved to do something about the issue.resoluteWe must remain resolute in the face of opposition.single-mindedShe was single-minded and uncompromising in her work.\nSee more results »\ncontinuing to exist despite a difficult or changing situation: Football has always been unpredictable and this is the reason for its persevering attraction. It is a persevering and potentially increasing problem. Martin Luther King, Jr. wrote of a necessary spirit of \"persistent trying, perpetual experimentation, persevering togetherness\". Synonym\nperseverantCompare\ndetermined\nenduring\npersistentRelated words\nperseverance\npersevere\nMore examplesFewer examplesShe was a determined, generous, and persevering woman.She was always less daring, but more persevering than her brother.She was sorry for his persevering sulkiness.The birds accompanied us the whole day in a most persevering manner.He argues that incremental change is the key to a persevering continuity with the past.\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngoing\ngrittily\ngutsily\ngutsy\ngutty\npersistently\npertinacious\npertinaciously\npigheaded\npigheadedly\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nunbending\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinuous & permanent"}