{"id":272606,"name":"pet","type":"noun","us_sound":"pet","us_link":"../audio/p/pet.mp3","uk_sound":"pet","uk_link":"../audio/p/ukperv_026.mp3","content":"pet noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nA1 an animal that is kept in the home as a companion and treated kindly: They have several pets - a dog, two rabbits, and a guinea pig. a pet snake\nMartin Farkas/EyeEm/GettyImages\nMore examplesFewer examplesDoctors have discovered that keeping a pet can do wonders for your health.my pet dogSome people are really soppy about their pets.There was a fashion for keeping reptiles as pets.Old people often rely on pets for comfort and companionship in their twilight years.\nSMART Vocabulary: related words and phrases\nGeneral & informal words for animals\nanti-predator\narthropod\nbeast\nbeastie\nbossy\nbrute\nESA\nfeathered\nfeathered friend idiom\nfour-legged friend\nfur baby\nfurry\nfurry friend\nmyriapod\npest\npredator\nprey\nservice animal\nstray\nthing\nSee more results »\npet noun [C]\n(PERSON)\nbe someone's pet disapproving\nto be the person that someone in authority likes best and treats better than anyone else: be (the) teacher's pet The other children hated her because she was the teacher's pet.\nSee more\ninformal approving a kind person who is easy to like: He's always sending me flowers - he's a real pet!\nUK informal a friendly way of talking to someone, especially a woman or a child: Thank you, pet.\nSMART Vocabulary: related words and phrases\nPeople having good qualities\nadvertisement\naltruist\nangel\nbeatify\nbrick\nbunch\nenchantress\ngem\njewel\nmensch\nnot be as black as you are painted idiom\nparagon\npoppet\nrough diamond\nsaint\nsalt\nsalt of the earth idiom\nsoftie\nsweetheart\ntreasure\nSee more results »\n[ T ] If you pet an animal, child, etc., you touch it, him, or her gently and kindly with your hands: Our dog loves to be petted and tickled behind the ears.\n[ I ] informal If two people are petting, they are kissing and touching each other in a sexual way. See also\nheavy petting\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntouch\ntoy\nSee more results »\npet theory, subject, hate, etc.\na theory, subject, hate, etc. that is special and important to you: pet peeve US My pet peeve (= pet hate) is cleaning the bathroom.\nSee more\nPET noun [U]\n(PLASTIC)\nabbreviation for polyethylene terephthalate: a type of plastic used especially to make bottles: The house has translucent walls made from a plastic called PET, essentially the same material used in soda bottles. Most water bottles are made from PET plastic.\nMore examplesFewer examplesThe supermarket is considering PET, a type of plastic popular for bottling beer and soft drinks, as an alternative to glass for wine bottles.Evidence is accumulating that the phthalates in flexible plastics such as PET can interfere with our endocrine system at high doses.Clear PET plastics are currently being recycled at a rate of 47% in the city.\nSMART Vocabulary: related words and phrases\nPlastics & rubber\nBakelite\nbioplastic\nBubble Wrap\nCellophane\ncelluloid\ninjection moulding\nlatex\nLucite\nmelamine\nmicrobeads\npolyethylene\npolypropylene\npolystyrene\npolythene\npolyurethane\nthermoplastic\nthermosetting\nuPVC\nvinyl\nvulcanization\nSee more results »\nPET noun [U]\n(SCAN)\nabbreviation for positron emission tomography: a method of using special rays (= beams of light) to make images of the inside of the body, especially the brain: They used PET, a brain-scanning technology. Volunteers underwent PET scans while trying to quickly retrace routes between various landmarks in the virtual town.\nMore examplesFewer examplesMRI scans offered researchers a less risky alternative to PET scans.Scientists have used PET technology to watch the dreaming brain.\nSMART Vocabulary: related words and phrases\nMedical & surgical equipment\nbedpan\nbioprinting\nblood pressure monitor\nbougie\ncannula\ncatheter\ncatheterization\nclinical thermometer\nelectrocardiograph\nexoskeleton\nhypodermic\nincubator\nlaparoscope\nlaryngoscope\nlateral flow test\nmagnetic resonance imaging\nmicrocatheter\nnebulizer\nsyringe\nventilator\nSee more results »\npet noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nan animal that is kept in the home as a companion and treated affectionately: She has several interesting pets, including a couple of snakes.\npet adjective [not gradable]\n(LIKED)\nespecially liked or personally important: The legislation will face strong opposition from senators whose pet projects would be cut back.\npet verb [I/T]\n(TOUCH)\nto touch an animal or person gently and affectionately with the hands: [ T ] Our dog loves to be petted and tickled behind the ears."}