{"id":272711,"name":"petition","type":"noun","us_sound":"pəˈtɪʃ.ən","us_link":"../audio/p/petition.mp3","uk_sound":"pəˈtɪʃ.ən","uk_link":"../audio/p/ukpeter006.mp3","content":"Add to word list\nAdd to word list\na document signed by a large number of people demanding or asking for some action from the government or another authority: I signed a petition against the proposed closure of the local hospital today.\nlaw\n&#160; specialized a formal letter to a law court asking for a particular legal action: She's filing a petition for divorce.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nlaw\n&#160; also specialized to make a formal request for something, especially in a law court: They're petitioning for/about better facilities for disabled people. [ + obj + to infinitive ] I think we should petition the government to increase the grant for the project. She is petitioning for a re-trial.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nAdd to word list\nAdd to word list\na document signed by a large number of people requesting some action from the government or another authority, or law a formal letter to a court of law requesting a particular legal action: More than 2000 people signed a petition to protect a wildlife area from development. law She’s filing a petition for divorce. petition verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/pəˈtɪʃ·ən/\n[ T ] They plan to petition the governor to increase funding for the project.\nAdd to word list\nAdd to word list\nPOLITICS a document signed by a large number of people asking the government or authorities to do something or not to do something: a petition against/for sth Trade unions have started a petition against the merger.\nLAW a formal letter to a court of law asking for a particular decision: They had filed a petition in federal court on behalf of the detainees. See also\nbankruptcy petition\nLAW to make a formal request for a decision or action, especially from a court of law: He could have petitioned for the appeals court to consider his request. The company has petitioned the organization to keep details of the new phone secret.\nPOLITICS to sign a document with large numbers of other people asking the government or authorities to do something or not to do something: petition for/against sth Local people petitioned against the closure of the hospital."}