{"id":273485,"name":"phase","type":"noun","us_sound":"feɪz","us_link":"../audio/p/faze.mp3","uk_sound":"feɪz","uk_link":"../audio/p/ukfault016.mp3","content":"Add to word list\nAdd to word list\nB2 any stage in a series of events or in a process of development: The project is only in its initial phase as yet, but it's looking quite promising. We're entering a new phase in international relations.\nB2 a period of strange or difficult behaviour that will stop after a while, especially a period that a young child or person goes through: When I was in my early teens I went through a phase of only ever wearing black.\nThe phases of the moon are the regular changes in its shape as it appears to us on earth.\nMore examplesFewer examplesI'm sure he'll get over it, it's just a phase.She seems to be going through some sort of religious phase.An initial phase of research has produced some exciting results.We're now entering the final phase of the project.The business is going through a rather depressing phase at the moment.\nSMART Vocabulary: related words and phrases\nStages & phases\nearly-stage\nearly-term\nhome run\nhome straight\nin phase/out of phase idiom\ninterstage\nlandmark\nleg\nmulti-step\nmultiphasic\npartway\nperiod\npoint\nshovel-ready\nstage\nstep\ntertiary\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving, interacting and behaviour\nAstronomy\nIdiom\nin phase/out of phase\nto introduce something in stages over a particular period of time: The reduction in armed forces will be phased over the next ten years.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nPhrasal verbs\nphase something in\nphase something out\nAdd to word list\nAdd to word list\nany stage in a series of events or in a process of development: The project is only in its first phase of planning, so we haven’t yet established the cost.\nThe phases of the moon are the regular changes in its shape as it appears to people on earth.\nphysics A phase is one of the forms in which matter can exist, such as solid, liquid, or a gas.\nphysics A phase is also one of the stages or points in a repeating process measured from a specific starting point.\nAdd to word list\nAdd to word list\na stage in a series of events or in a process of development: the early/final/late phase The inflation rate is high, even for the early phase of an economic expansion. The project is only in the initial phase, but it's looking quite promising. We're entering a new phase in international relations.the design/development/manufacturing phase After two years of discussion, the project is still at the development phase.the growth/start-up phase The merger has helped with the growth phase of our strategy.\nto introduce something in stages over a particular period of time: be phased over 6 months/2 years, etc. The closure of the regional offices was phased over an 18-month period and affected 435 staff. Phrasal verbs\nphase sth down\nphase sth in\nphase sth out"}