{"id":273722,"name":"phenomenon","type":"noun","us_sound":"fəˈnɑː.mə.nɑːn","us_link":"../audio/p/phenomenon.mp3","uk_sound":"fəˈnɒm.ɪ.nən","uk_link":"../audio/p/ukpfft_030.mp3","content":"phenomenon noun [C]\n(EXISTING THING)\nAdd to word list\nAdd to word list\nC1 something that exists and can be seen, felt, tasted, etc., especially something unusual or interesting: Gravity is a natural phenomenon. Do you believe in the paranormal and other psychic phenomena? There's evidence to suggest that child abuse is not just a recent phenomenon. Synonyms\nepisode (EVENT)\nevent\nhappening\nincident\noccurrence (HAPPENING)\nMore examplesFewer examplesparanormal phenomenageophysical and geological phenomenaJohnson (op. cit., page 53) calls this phenomenon 'the principle of minimal effort'.the El Nino weather phenomenonThis trend is certainly not a new phenomenon.\nSMART Vocabulary: related words and phrases\nObjects - general words\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nthang\nthing\nSee more results »\nphenomenon noun [C]\n(SUCCESS)\nsomeone or something that is extremely successful, often because of special qualities or abilities: The Beatles were a phenomenon - nobody had heard anything like them before.\nThesaurus: synonyms, antonyms, and examples\nsomeone famouscelebrityThe magazine is all about the lives of celebrities.celebWhich celeb recently spent $60,000 on an engagement ring?slebUK She was last spotted interviewing a minor sleb on the red carpet.starHer ambition was always to become a movie star.superstarRock superstar Elton John grew up working class in England.legendHe became a legend in his own lifetime.\nSee more results »\nSMART Vocabulary: related words and phrases\nGood and excellent things\nbadass\nbe the best thing since sliced bread idiom\nbeatification\nbeaut\nbeauty\nbunch\ngem\nhumdinger\njewel\njim-dandy\nkiller\nking\nlulu\npeach\nscreamer\nsleeping beauty\nstandout\nsublime\nthe jewel in the crown idiom\nthe Rolls-Royce of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccessful (things or people)\nphenomenon noun\n(EXPERIENCE)\nAdd to word list\nAdd to word list\n[ C ] plural phenomena us/fɪˈnɑm·ə·nə/ anything that is or can be experienced or felt, esp. something that is noticed because it is unusual or new: We discussed the ever-growing popularity of talk radio, and wondered how to explain this phenomenon.\nphenomenon noun\n(SPECIAL PERSON/THING)\n[ C usually sing ] plural phenomenons someone or something special, esp. because it is completely different or extremely unusual: He was a kind of phenomenon, an actor running for president."}