{"id":274230,"name":"philosophy","type":"noun","us_sound":"fɪˈlɑː.sə.fi","us_link":"../audio/p/philosophy.mp3","uk_sound":"fɪˈlɒs.ə.fi","uk_link":"../audio/p/ukpheno023.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the use of reason in understanding such things as the nature of the real world and existence, the use and limits of knowledge, and the principles of moral judgment: René Descartes is regarded as the founder of modern philosophy. See also\nPhD the philosophy of something\na group of theories and ideas related to the understanding of a particular subject: the philosophy of education/religion/science\nSee more\n[ C ] a particular system of beliefs, values, and principles: the Ancient Greek philosophy of Stoicism\nC1 [ C usually singular ] informal the way that someone thinks about life and deals with it: Live now, pay later - that's my philosophy of life!\nMore examplesFewer examplesa degree in philosophyMarxist philosophyHis tutor encouraged him to read widely in philosophy.She majored in philosophy at Harvard.a peddler of New Age philosophies\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nessentialism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nnon-deterministic\nnon-philosophical\nnotional\nontological\nontologically\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nsyllogism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLogic and reason\nSubjects & disciplines\nOpinions, beliefs and points of view\nAdd to word list\nAdd to word list\nthe study of the nature of reality and existence, of what it is possible to know, and of right and wrong behavior, or a particular set of beliefs of this type: [ C ] the philosophy of Kant [ U ] I’d like to take a course in philosophy next semester.\nThe philosophy of a subject is a group of theories and ideas related to the understanding of that subject: [ U ] the philosophy of language/science\nA philosophy is also the beliefs you have about how you should behave in particular situations in life: [ C ] It was always my philosophy to pay my debts promptly. philosopher noun [ C ] us\nYour browser doesn't support HTML5 audio\n/fɪˈlɑs·ə·fər/\nPlato, Aristotle, and the other Greek philosophers philosophize verb [ I ] us\nYour browser doesn't support HTML5 audio\n/fɪˈlɑs·əˌfɑɪz/\nThat’s when she’ll start philosophizing about the notion of time."}