{"id":274948,"name":"phone","type":"noun","us_sound":"foʊn","us_link":"../audio/p/phone.mp3","uk_sound":"fəʊn","uk_link":"../audio/p/ukpheno029.mp3","content":"phone noun\n(PHONE)\nAdd to word list\nAdd to word list\nA1 [ C or U ] (formal telephone) a device that uses either a system of wires along which electrical signals are sent or a system of radio signals to make it possible for you to speak to someone in another place who has a similar device: Just then, his phone rang. Could you answer the phone? We speak on the/by phone about twice a week. You had three phone calls this morning. If the phone lines are busy, please try again later. Could you pick the phone up for me - my hands are wet. I left the phone off the hook, so it wouldn't ring. I was so angry I just put/slammed the phone down (on her) (= replaced it before our conversation was finished).\nMohd Haniff Abas/EyeEm/GettyImages on the phone\nspeaking on the phone: She's on the phone at the moment but she can see you in a few minutes.\nUK with a phone connected to your home by wires: Are the Middletons on the phone at their cottage, do you know?\nSee more on your phone\nto be using your mobile phone to send messages, play games, look at the internet, etc.: These kids are on their phones all day long.\nSee more\nMore examplesFewer examplesJust as I was sitting down to watch TV, the phone rang.Every time I ring her, the phone is engaged.We've spoken on the phone but never face-to-face.After he was attacked, he managed to stagger to the phone and call for help.\"There's someone on the phone for you.\" \"What do they want?\"\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncall box\ncell phone\ndevice\ndumbphone\nextension\nmouthpiece\nphablet\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nphone noun\n(PHONETIC UNIT)\n[ C ]\n&#160; phonetics\n&#160; specialized a unit of sound at the phonetic level, used when studying speech\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\napheresis\naphesis\nassonance\ndiphthong\nintrusive\nlabial\nlabialize\nlabiodental\nmispronounce\nplosive\npostalveolar\npostconsonantal\nretroflex\nrhotic\nthe International Phonetic Alphabet\nunpronounceable\nunrepeatable\nSee more results »\nGrammar\nTelephoningHere is the start of an informal telephone call between friends: …\nA1 to communicate with someone by phone: She phoned just after lunch. He's phoned me (up) every day this week. Synonyms\ncall\nring\nMore examplesFewer examplesHadn't you better phone home? Your parents will be wondering where you are.He said he'd phone back first thing tomorrow.I tried to phone her but couldn't get through.The shop phoned to say your order has come in.Who could be phoning us at this unearthly hour?\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nGrammar\nTelephoningHere is the start of an informal telephone call between friends: …\nPhrasal verbs\nphone in\nphone something in\nused to form words referring to a speaker or speakers of a particular language: a francophone (= a French speaker) the anglophone world (= people in the world who speak English)\nused to form the names of musical instruments: a chordophone (= an instrument in which sound is produced by the vibration of a string) a sousaphone (= a brass instrument named after J. P. Sousa)\nMore examplesFewer examplesMexico is the most populous Hispanophone country on earth.I grew up in a largely Germanophone household.Both Russians and Russophone Ukrainians living in these territories use Russian on a daily basis.He played sax, trombone, and vibraphone.Any musical instrument in which sound is produced mainly by means of electricity can be called an electrophone.\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\ninterpret\nmistranslate\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nrender\nrendering\ntarget language\ntranslator\ntransliterate\ntrilingual\nword for word idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpeakers & talkers\nMusical instruments\nAdd to word list\nAdd to word list\nshort form oftelephone: The phone is ringing – would you answer it? phone verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/foʊn/\n[ I ] Fernando phoned just after lunch.\nAdd to word list\nAdd to word list\na piece of electronic equipment which makes it possible for you to speak to someone in another place who has similar equipment, using either electrical signals sent along a system of wires, or radio signals: over the phone You can arrange a mortgage online, over the phone, or through a meeting.by phone The company can be reached by phone on this number.on the phone She has spent hours on the phone in recent weeks, talking to negotiators in a labour dispute. See also\ncell phone\nmobile phone\ntelephone\nto communicate with someone by phone: Someone phoned while you were at lunch. Phone him and ask if he's free this afternoon. See also\ntelephone verb Phrasal verbs\nphone in\nphone sth in\nphone up"}