{"id":275345,"name":"photocopy","type":"noun","us_sound":"ˈfoʊ.t̬oʊˌkɑː.pi","us_link":"../audio/p/photocopy.mp3","uk_sound":"ˈfəʊ.təʊˌkɒp.i","uk_link":"../audio/p/ukphone022.mp3","content":"Add to word list\nAdd to word list\nB1 a photographic copy of a document made on a photocopier: I'll just make a photocopy of the agreement.\nCaiaimage/Rafal Rodzoch/GettyImages\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nto make a photocopy of a document: Could you photocopy those three pages for me, please? All articles on this page may be photocopied free of charge.\nMore examplesFewer examplesYou cannot photocopy or scan any of the documents in the reading room.Photocopy the important papers and keep the originals. They're writing and photocopying a sheet of information, and then the homework is to copy it into their books.\nSMART Vocabulary: related words and phrases\nOffice practices\nadmin\nadministrative\nadministratively\nbadge in\nbadged\nbranch\ndictate\nhuman resources\nhygiene factor\nin-house\ninteroffice\nkaizen\nphotostat\npower breakfast\npower lunch\npp\nremit\nremittance\nscrum\ntyping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nAdd to word list\nAdd to word list\na copy of a document made on a photocopier\nAdd to word list\nAdd to word list\na photographic copy of a document made on a photocopier: make/keep a photocopy If you send off any documents, be sure to keep a photocopy.a photocopy of sth I forgot to make a photocopy of my tax return. a black-and-white/colour photocopy\n[ T or I ] to make a photographic copy of a document on a photocopier: You cannot photocopy or scan any of the documents in the reading room. Printing, fax, and photocopying facilities are offered at a fee.\n[ I ] to be copied using a photocopier: photocopy well/badly This yellow logo doesn't photocopy very well in black and white."}