{"id":275452,"name":"photograph","type":"noun","us_sound":"ˈfoʊ.t̬oʊ.ɡræf","us_link":"../audio/p/photograph.mp3","uk_sound":"ˈfəʊ.tə.ɡrɑːf","uk_link":"../audio/p/ukphone026.mp3","content":"Add to word list\nAdd to word list\nA2 a picture produced using a camera: a colour/black-and-white photograph aerial photographs nude photographs My parents took lots of photographs of us when we were small. Synonyms\nexposure\npic informal\npicture\nsnap (PHOTOGRAPH) UK informal\nMore examplesFewer examplesA photograph of her daughter was prominently displayed on her desk.The report comes complete with diagrams and colour photographs.She's got photographs of all her grandchildren on the mantelpiece.We all posed for our photographs next to the Statue of Liberty.Police have issued a photograph of the suspect.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nB2 to take a picture using a camera: I prefer photographing people rather than places. [ + obj + -ing verb ] MacKay was photographed leaving the building. Synonym\nsnap (PHOTOGRAPH)Compare\npap verb informal mainly UK photograph well/badly\nto appear attractive/unattractive in photographs: I don't usually wear black because it doesn't photograph well.\nSee more\nMore examplesFewer examplesMacKay was photographed leaving the building.The Princess was photographed shaking hands with AIDS victims.He has photographed her against lots of different backgrounds.I prefer photographing people rather than places.The actor is photographed in profile, smoking a cigarette.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nAdd to word list\nAdd to word list\nan image of a person, object, or view that is produced by using a camera and film: color/black-and-white photographs photograph verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈfoʊ·t̬əˌɡræf/\nWe photographed the house to document the damage done by the storm. photographer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/fəˈtɑɡ·rə·fər/\na fashion/newspaper photographer"}