{"id":275786,"name":"phrase","type":"noun","us_sound":"freɪz","us_link":"../audio/p/phrase.mp3","uk_sound":"freɪz","uk_link":"../audio/p/ukphoto010.mp3","content":"phrase noun [C]\n(GRAMMAR)\nAdd to word list\nAdd to word list\nlanguage a group of words that is part of, rather than the whole of, a sentence\nExamples\nan adverbial phrasean adjectival phraseThe phrase \"a not unfamiliar situation\" is an example of a double negative.The phrase \"a hard frost\" is a collocation.In grammar, an adjunct is an adverb or adverbial phrase that gives extra information in a sentence.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nepigram\nmotto\noperative\nproverbial\nsentence\nslogan\nsubsentence\nto coin a phrase idiom\nTrumpism\nSee more results »\nphrase noun [C]\n(EXPRESSION)\nB1 a short group of words that are often used together and have a particular meaning: We are governed, in Lord Hailsham's famous phrase, by an \"elective dictatorship\". Synonym\nexpression (WORDS)See also\nphrase book\nMore examplesFewer examplesI've just bought a dictionary of phrases, sayings and quotations.He used a rather obscure phrase and I can't remember what it was now.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nepigram\nmotto\noperative\nproverbial\nsentence\nslogan\nsubsentence\nto coin a phrase idiom\nTrumpism\nSee more results »\nphrase noun [C]\n(MUSIC)\nmusic\n&#160; specialized a small group of notes forming a unit of a tune\nSMART Vocabulary: related words and phrases\nBeats or lengths of musical notes\nbackbeat\nbar\nbar line\nbeat\ncommon time\ncompound time\neighth\nfour-four time\nfourth\nhalf note\nmeasure\nminim\noctave\npause\nrest\nsixteenth note\nthree-four time\nthree-quarter time\ntime signature\ntiming\nSee more results »\nRelated word\nphrasalGrammar\nChunksWhen we speak and write, we repeat a lot of phrases and clauses, such as on the other hand, a lot of, at the moment, you know, you see, I mean. Some of these phrases, or chunks of language, are very common and they have specific meanings. …\nChunks in speakingWe use chunks like you know, you know what I mean, I know what you’re saying to check and show understanding between speaker and listener: …\nChunks in writingWe use many chunks in writing. They help us to structure what we write: …\nChunks as framesSome chunks don’t look complete (I don’t know if, in the middle of). These usually help make up or frame sentences: …\nNoun phrasesA noun phrase consists of a noun or pronoun, which is called the head, and any dependent words before or after the head. Dependent words give specific information about the head. …\nNoun phrases: dependent wordsIn a noun phrase, dependent words before the head are either determiners (e.g. the, my, some) or premodifiers (e.g. adjectives). Dependent words after the head are either complements or postmodifiers. …\nNoun phrases: determiners (a, the, my, his, some, this, etc.)Determiners come first in a noun phrase (e.g. the big black car). They include: …\nNoun phrases: premodifiers (big, good, red)Premodifiers consist of single adjectives, adjective phrases, single nouns and noun phrases which are used before the head in a noun phrase. …\nNoun phrases: complementsComplements come immediately after the head in a noun phrase. They are prepositional phrases or clauses which are necessary to complete the meaning of the noun. Without the complement, we wouldn’t understand what the noun was referring to. …\nNoun phrases: postmodifiersPostmodifiers come after the head in a noun phrase. They consist of adverb phrases, prepositional phrases and clauses. Postmodifiers give extra or specific information about the noun (e.g. place, possession, identifying features). Unlike complements, they are not necessary to complete the meaning. …\nNoun phrases: complements or postmodifiers?Complements are necessary to complete the meaning of a noun. Postmodifiers are not necessary; they give extra information about the noun which helps to identify it or locate it in some way. (The complement and the postmodifier are underlined below.) …\nNoun phrases: orderBefore the head of a noun phrase, determiners come first, then adjectives, then nouns acting as modifiers. The spoken stress is normally on the head. …\nNoun phrases: usesWe most typically use noun phrases as the subjects (s) and objects (o) of clauses (io = indirect object; do = direct object): …\nNoun phrases: noun phrases and verbsNoun phrases can show person (first, second or third) and number (singular or plural). The person and number of the noun phrase which is the subject of a clause decides the person and number of the verb. This is called agreement. …\nNoun phrases: two noun phrases togetherWe can put two noun phrases (np) together to refer to the same person or thing. This is called apposition: …\nVerb phrasesA verb phrase consists of a main verb alone, or a main verb plus any modal and/or auxiliary verbs. The main verb always comes last in the verb phrase: …\nSimple verb phrasesA simple verb phrase consists of a main verb. The verb in a simple verb phrase shows the type of clause (e.g. declarative, imperative): …\nComplex verb phrasesA complex verb phrase may include one modal verb and one or more auxiliary verbs before the main verb. A modal verb always comes before any auxiliary verbs: …\nVerbs and verb phrases: typical errorsWe always need an e in the -ed form (past simple and -ed form) of regular verbs: …\nPhrase classesThe different word classes can form the basis of phrases. When they do this, they operate as the head of the phrase. So, a noun operates as the head of a noun phrase, a verb as the head of a verb phrase, and so on. Heads of phrases (H) can have words before them (e.g. determiners (det), adjectives (adj), adverbs (adv)) or after them (e.g. postmodifiers (pm) or complements (c)): …\nto express something with a particular choice of words: The declaration was carefully/cleverly/tactfully, etc. phrased. Synonym\nword\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nevery\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nmouth\nquoth\nsay\nspoken\nstring\ntalk sense idiom\nthink\nutterance\nverbalize\nvolunteer\nSee more results »\nAdd to word list\nAdd to word list\na group of words expressing a particular idea or meaning: I think the phrase \"bundle of energy\" describes Mara very well.\ngrammar A phrase is a group of words forming a part of a sentence: In \"He was a man of great wealth,\" \"of great wealth\" is a prepositional phrase.\nmusic A phrase is also a group of notes with a clear beginning and ending within a larger piece of music. phrasal adjective us\nYour browser doesn't support HTML5 audio\n/ˈfreɪ·zəl/\nto express something in a particular way when speaking or writing: The wording of his resignation was carefully phrased to avoid any admission of guilt."}