{"id":276162,"name":"picked","type":"verb","us_sound":"pɪk","us_link":"../audio/p/pick.mp3","uk_sound":"pɪk","uk_link":"../audio/p/ukpiano004.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npick\npick verb\n(CHOOSE)\nB1 [ T ] to take some things and leave others: Pick a card from the pack. One of my sisters has been picked for the Olympic team. [ + obj + to infinitive ] She was picked to play for the team. The police asked him if he could pick (out) the killer from a series of photos. The fairest way to decide the winner is to pick a name out of a hat/at random (= without looking or choosing). They picked their way (= carefully chose a route) down the broken steps. He's brilliant at picking winners (= choosing what will be successful). Synonyms\nchoose\nelect\nselect\nThesaurus: synonyms, antonyms, and examples\nto choose or choose to do somethingchooseThere are thirty-one flavours of ice cream to choose from.pickHe's been picked for the school football team.selectWe've selected three candidates.opt (for)Mike's opted for early retirement.decide (on)I've decided on blue walls for the bathroom.go forUK I think I'll go for the chocolate cake.\nSee more results »\npick and choose often disapproving\nto take some things but not others: The richest universities can pick and choose which students they take.\nMore examplesFewer examplesI was never picked for the school football team.I asked him which pastry he wanted and he picked an almond croissant.I gave her a choice of several toys and she picked a doll.Of all the gorgeous clothes in the shop she picked a really plain grey sweater.Do you want to help me pick some numbers for my lottery ticket.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\npick verb\n(REMOVE)\nB1 [ I or T ] to remove separate things or small pieces from something, especially with the fingers: I picked a piece of fluff off my shiny black suit. The child continued picking (at) a sore on his leg (= trying to remove parts of it with his fingers). He kept picking his nose (= removing mucus from it with his finger).\nB1 [ T ] When you pick flowers or fruit, you take them off a plant or tree: They were picking strawberries for twelve hours a day. I picked some roses this morning. Machines pick the fruit (from/off the trees).\n[ T ] to remove meat from the bones of a bird or animal : In the kitchen Maya was laboriously picking chickens. I store the meat, and throw the picked carcass, skin, etc. into the pot with water and some vegetables. [ + obj + adj ] The carcass had been picked clean (= all the flesh had been removed) by other animals and birds.\nMore examplesFewer examplesYou ought to pick those lettuces before they shrivel and die.I tend to leave the windfalls for the birds to pick at.He thought we'd been picking his apples and came after us with a stick.She sat there sulking and picking the pills off her sweater.The fruit is picked and artificially ripened before shipping.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nRemoving and extracting\nPreparing food\npick verb\n(PLAY INSTRUMENT)\n[ T ] When you pick a string on a guitar or similar instrument, you pull it quickly and release it suddenly with your fingers to produce a note.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\nGrammar\nFixed expressions with andWe often use and in common fixed expressions. The order of the words cannot change: peace and quiet, pick and choose, come and go, knife and fork, black and white. …\nPick or pick up?Pick means ‘remove small pieces of something from something else, usually with your hands’: …\nIdioms\npick someone's brains\npick someone's pocket\npick yourself up off the floor\npick a fight/quarrel/argument\npick holes in something\npick 'n' mixPhrasal verbs\npick at something\npick someone/something off\npick on someone\npick someone/something out\npick something out\npick over something\npick through something\npick someone/something up\npick something up\npick (something) up\nMore phrasal verbs\npick someone up\npick up\npick someone up on something\npick up on something"}