{"id":276181,"name":"picket","type":"noun","us_sound":"ˈpɪk.ɪt","us_link":"../audio/p/picket.mp3","uk_sound":"ˈpɪk.ɪt","uk_link":"../audio/p/ukpiano012.mp3","content":"Add to word list\nAdd to word list\na worker or group of workers who protest outside a building to prevent other workers from going inside, especially because they have a disagreement with their employers: There were pickets outside the factory gates.\ntacojim/E+/GettyImages\nan occasion on which a picket happens: The union organized a month-long picket.\nSMART Vocabulary: related words and phrases\nIndustrial action\nabstain\nanti-strike\nblackleg\ncooling-off period\ndemarcation dispute\njob action\nlightning strike\nlock\nlock someone out\nlockout\non strike phrase\nstoppage\nstrike pay\nstrikebound\nstrikebreaker\nstrikebreaking\nstriker\nsympathy\nunion-bashing\nwalk\nSee more results »\nRelated word\npicketing\nto act as or take part in a picket: They picketed the burger restaurant and handed out leaflets to potential customers. He was not surprised when his office was picketed.\nMore examplesFewer examplesDemonstrators picketed and chanted outside the company's annual meeting.More than 100 protesters picketed the hotel on Saturday as part of a nationwide boycott.Workers had picketed at the plant for more than two weeks, mainly over health-care costs.\nSMART Vocabulary: related words and phrases\nIndustrial action\nabstain\nanti-strike\nblackleg\ncooling-off period\ndemarcation dispute\njob action\nlightning strike\nlock\nlock someone out\nlockout\non strike phrase\nstoppage\nstrike pay\nstrikebound\nstrikebreaker\nstrikebreaking\nstriker\nsympathy\nunion-bashing\nwalk\nSee more results »\nAdd to word list\nAdd to word list\na person or group of people who have a disagreement with a company, usually the one where they work, and who walk around in a line outside the place of business to tell other people not to enter until the problem is solved: Three pickets stood at the factory gate. picket verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈpɪk·ɪt/\n[ I/T ] The women picketed (outside) the factory for three months.\nAdd to word list\nAdd to word list\n(also picket line) a group of people who stand outside an organization's building holding signs to protest against something. The people who protest are often employees who disagree with the management: The rail union is planning a 150-person picket of the terminal for two days next week. The new government was determined to avoid a return to the old days of industrial action and mass picket lines. Most union members were reluctant to cross the picket line.stand on/walk the picket line We spent two weeks walking the picket line, trying to get better benefits. Workers staged a picket outside the factory gates. Workers picked up their picket signs and began their protest. Compare\nstrike noun\nUK a single person in a picket line: Police escorts were provided for tanker drivers who had experienced intimidation by pickets. Compare\npicketer See also\nflying picket\nto show an organization that you are not satisfied with them by standing outside their building and trying to prevent people from entering and doing business with them : The firm's annual general meeting was picketed by union members angry at the decision to cut jobs. The group has decided not to picket until after the talks. Compare\nstrike verb\npicketing noun [ U ] uk/ˈpɪkɪtɪŋ/ us/-ṱɪŋ/\nThe proposed new law would ban picketing. See also\nsecondary picketing"}