{"id":276145,"name":"pick","type":"verb","us_sound":"pɪk","us_link":"../audio/p/pick.mp3","uk_sound":"pɪk","uk_link":"../audio/p/ukpiano004.mp3","content":"pick verb\n(CHOOSE)\nAdd to word list\nAdd to word list\nB1 [ T ] to take some things and leave others: Pick a card from the pack.be picked for One of my sisters has been picked for the Olympic team. [ + obj + to infinitive ] She was picked to play for the team.pick someone (out) The police asked him if he could pick (out) the killer from a series of photos.pick something out of a hat The fairest way to decide the winner is to pick a name out of a hat (= without looking or choosing).be picked at random The winning lottery numbers will be picked at random (= without choosing).pick your way They picked their way (= carefully chose a route) down the broken steps.pick a winner He's brilliant at picking winners (= choosing what will be successful). Synonyms\nchoose\nelect\nselect\nThesaurus: synonyms, antonyms, and examples\nto choose or choose to do somethingchooseThere are thirty-one flavours of ice cream to choose from.pickHe's been picked for the school football team.selectWe've selected three candidates.opt (for)Mike's opted for early retirement.decide (on)I've decided on blue walls for the bathroom.go forUK I think I'll go for the chocolate cake.\nSee more results »\npick and choose often disapproving\nto take some things but not others: The richest universities can pick and choose which students they take.\nSee more\nMore examplesFewer examplesI was never picked for the school football team.I asked him which pastry he wanted and he picked an almond croissant.I gave her a choice of several toys and she picked a doll.Of all the gorgeous clothes in the shop she picked a really plain grey sweater.Do you want to help me pick some numbers for my lottery ticket.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\npick verb\n(REMOVE)\nB1 [ I or T ] to remove separate things or small pieces from something, especially with the fingers: pick something off something I picked a piece of fluff off my shiny black suit.pick (at) The child continued picking (at) a sore on his leg (= trying to remove parts of it with his fingers).pick your nose He kept picking his nose (= removing mucus from it with his finger).\nB1 [ T ] When you pick flowers or fruit, you take them off a plant or tree: They were picking strawberries for twelve hours a day. I picked some roses this morning.pick something (from/off something) Machines pick the fruit (from/off the trees).\n[ T ] to remove meat from the bones of a bird or animal : In the kitchen Maya was laboriously picking chickens. I store the meat, and throw the picked carcass, skin, etc. into the pot with water and some vegetables. [ + obj + adj ] The carcass had been picked clean (= all the flesh had been removed) by other animals and birds.\nMore examplesFewer examplesYou ought to pick those lettuces before they shrivel and die.I tend to leave the windfalls for the birds to pick at.He thought we'd been picking his apples and came after us with a stick.She sat there sulking and picking the pills off her sweater.The fruit is picked and artificially ripened before shipping.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nRemoving and extracting\nPreparing food\npick verb\n(PLAY INSTRUMENT)\n[ T ] When you pick a string on a guitar or similar instrument, you pull it quickly and release it suddenly with your fingers to produce a note.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick someone/something out\nplay (something) by ear idiom\nplayability\nplayable\npluck\npump\nraise\ntap\nthrow\ntranspose\ntransposition\nultra-smooth\nvibe\nwah-wah\nSee more results »\nGrammar\nFixed expressions with andWe often use and in common fixed expressions. The order of the words cannot change: peace and quiet, pick and choose, come and go, knife and fork, black and white. …\nPick or pick up?Pick means ‘remove small pieces of something from something else, usually with your hands’: …\nIdioms\npick someone's brains\npick someone's pocket\npick yourself up off the floor\npick a fight/quarrel/argument\npick holes in something\npick 'n' mix\npick up what someone is putting downPhrasal verbs\npick at something\npick someone/something off\npick on someone\npick someone/something out\npick something out\npick over something\npick through something\npick someone/something up\npick something up\npick (something) up\nMore phrasal verbs\npick someone up\npick up (something)\npick someone up on something\npick up on something\npick noun\n(CHOICE)\n[ U ] choice: You can have first pick of the desserts.\n[ C ] a thing or person chosen, especially a player chosen to play for a sports team: He was expected to be one of the top 10 picks in the upcoming draft. have your pick\nto have a large choice available: have your pick of something The plane was fairly empty so we had our pick of seats.\nSee more take your pick\nto choose the one(s) you want from the different types available: The shirts come in five different colours - just take your pick.\nSee more\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\npick noun\n(TOOL)\n[ C ] a\npickaxe : picks and shovels\nmerlinpf/iStock/Getty Images Plus/GettyImages\n[ C ] especially in combinations, a sharp pointed tool: a toothpick\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\nexcavator\ngimlet\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\nplunger\nrasp\nrazor knife\nreamer\nsander\nsandpaper\ntrowel\nSee more results »\npick noun\n(IN MUSIC)\n[ C ] a small, thin piece of plastic, metal, etc. that is held between the fingers and thumb and used for playing instruments such as the guitar Synonym\nplectrum mainly UK\nMatthew Bosco/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum kit\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\npanpipes\npedal steel\npenny whistle\npercussion\npercussionist\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »\npick noun\n(SPORT)\n[ C ] in American football, an interception (= an occasion when a player catches the ball as it is being passed between two players of the opposing team): The quarterback threw a pick in the fourth quarter. The strong safety made a pick and returned it for a touchdown.\n[ C ] in basketball, a move in which a player positions themselves between a player from their team who has the ball and a defending player from the opposing team: You've got to be moving without the ball, making back cuts, and setting picks. The best players are masters at utilizing picks to create space for open shots. Synonym\nscreenRelated word\npick-and-roll\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\nplace-kick\nrush\nscramble\nsplit end\nSuper Bowl\ntouchdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nIdiom\nthe pick of something\npick verb [T]\n(CHOOSE)\nAdd to word list\nAdd to word list\nto take some things and leave others: She’s been picked for the Olympic team. We finally picked February 14 as the date for our wedding.\npick verb [T]\n(REMOVE)\nto remove or move something with your fingers or hands: I picked a piece of lint off my suit. We picked apples yesterday. Idioms\npick a fight\npick and choose\npick someone’s brain\npick someone’s pocket\npick up steam\npick up the tab (for something)\npick your way somewhere\nthe pick of somethingPhrasal verbs\npick at something\npick off someone/something\npick on someone\npick out something/someone\npick over something\npick through something\npick up\npick up something/someone\npick up someone/something\npick up something\nMore phrasal verbs\npick up someone\npick up (something)\npick up on something\npick up on something\npick noun\n(MUSIC TOOL)\n[ C ] a thin piece of plastic or metal used to pull at the strings of a guitar\npick noun\n(DIGGING TOOL)\n[ C ] a pickax, or a sharp, pointed tool: They worked with a pick and shovel.\npick noun\n(THING TO CHOOSE)\n[ C/U ] a choice, or something that is chosen: [ U ] Mick gets first pick of where to sit. [ C ] Here are my picks for the ten best restaurants.\nAdd to word list\nAdd to word list\nCOMMERCE to choose items that have been ordered by a customer: He picked goods into pallets for the delivery. Your groceries will be carefully picked, packed, and delivered to your door.\nFINANCE, STOCK MARKET to choose particular shares in which to invest: If you pick stocks thoughtfully and hold them patiently, your gains should be considerable.\nPRODUCTION to remove fruit, cotton, etc. from a tree or plant when it is ready: Immigrants do much of the menial labor in town, picking fruit, cleaning hotel rooms, and sweeping the sidewalk.\nSee also\ncherry-pickPhrasal verbs\npick up\npick sth up\nFINANCE, STOCK MARKET particular shares that you choose to invest in: His stock picks rose 112% last year. What's his secret?"}