{"id":276173,"name":"picker","type":"noun","us_sound":"ˈpɪk.ɚ","us_link":"../audio/p/picker.mp3","uk_sound":"ˈpɪk.ər","uk_link":"../audio/p/ukpiano011.mp3","content":"picker noun [C]\n(CHOOSE)\nAdd to word list\nAdd to word list\nmainly US a person who chooses a particular thing: Traditional stock pickers (= people who choose companies in which others should invest) are being replaced by computer programs.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\nplump\nRobin Hood\nselect\nselection\nselective\nselectively\nskim\nyou pays your money and you takes your choice/chance idiom\nSee more results »\npicker noun [C]\n(COLLECT)\na person or a machine that picks crops: He's looking for work as a fruit picker. Sharecroppers were displaced by tractors and mechanized cotton pickers.\na person who works in a supermarket or warehouse getting the things from the shelves that people have ordered over the internet : Pickers take goods off the shelves, and delivery drivers take the goods to the customer. The company's marketing manager joined the company as a warehouse picker.\nSMART Vocabulary: related words and phrases\nFarmers & farm workers\ncrofter\ndairymaid\nfarmer\nfarmhand\nhomesteader\nlandholder\nmarket gardener\nmilkmaid\norchardist\npastoralist\npeasant\npeon\nploughman\npoulterer\nrancher\nsharecropper\nsmallholder\ntruck farmer\nyeoman\nSee more results »\nAdd to word list\nAdd to word list\na person or machine that picks crops: fruit pickers\nAdd to word list\nAdd to word list\nCOMMERCE a person whose job is to choose items that have been ordered by a customer: Because everything has to be scanned in, the picker cannot accidentally select the wrong product.\nFINANCE, STOCK MARKET a person who chooses particular shares to invest in: Traditional stock pickers are being replaced by computer programs.\nPRODUCTION a person whose job is to remove fruit, cotton, etc. from a tree or plant when it is ready: An average picker fills eight bins of pears a day, making roughly $160. a fruit/strawberry/cotton picker"}