{"id":276362,"name":"pictograph","type":"noun","us_sound":"ˈpɪk.tə.ɡræf","us_link":"../audio/p/cdo0319uspict1324.mp3","uk_sound":"ˈpɪk.tə.ɡrɑːf","uk_link":"../audio/p/cdo1121ukpict3450.mp3","content":"Add to word list\nAdd to word list\na picture drawn on painted or rock, especially in ancient times: The caves contain important aboriginal pictographs.\na picture or symbol that represents a word, phrase, or idea: When the Chinese began to create Sino-Japanese characters four millennia ago, they used pictographs representing key elements of everyday life. Synonym\npictogramCompare\nhieroglyph\nideogram\nlogograph\nDavid Clapp/Stone/GettyImages\na picture that represents information or statistics (= numbers): We create graphs and charts when possible, including pictographs. Synonym\npictogram\njapatino/Moment/GettyImages\nMore examplesFewer examplesMany pictographs and petroglyphs (carvings in the rock) were lost or destroyed by dam construction on the Columbia River.Archaeologists say the pictographs are the only written records left by early Indian peoples, who otherwise relied on oral histories.At Bhimbetka (India) and Matopo Hills (Zimbabwe) there are rock shelters with evidence of Stone Age occupation as well as pictographs (rock paintings).Rock art experts think the pictographs found here are complex murals that tell stories about the artists' spiritual beliefs. This symbol is a pictograph of a fishhook.Election officials have designed pictograph ballots with symbols of the candidates' parties or themselves.\nSMART Vocabulary: related words and phrases\nRepresentation in art & in general\nanti-realism\nanti-realist\nCalvary\ncomplementary\nconfederate\nmimesis\nnaturalistically\nnon-figurative\nnon-representational\nnon-symbolic\nportrayal\nrealism\nrealist\nrepresentation\nrepresentational\nstylized\nsymbolic\nsymbolism\nsymbolization\nultrarealism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nLettering & alphabets\nAdd to word list\nAdd to word list\nGRAPHS &amp; CHARTS →\npictogram"}