{"id":276390,"name":"picture","type":"noun","us_sound":"ˈpɪk.tʃɚ","us_link":"../audio/p/picture.mp3","uk_sound":"ˈpɪk.tʃər","uk_link":"../audio/p/ukpiano028.mp3","content":"picture noun\n(IMAGE)\nAdd to word list\nAdd to word list\nA1 [ C ] a drawing, painting, photograph, etc.: Freddy drew/painted a picture of my dog. We took a picture of (= photographed) the children on their new bicycles. I hate having my picture taken (= being photographed). Synonyms\nillustration (PICTURE)\nimage (PICTURE)\nB2 [ C ] an image seen on a television or cinema screen: We can't get a clear picture.\nB1 [ C ] a film: Could this be the first animated movie to win a best picture award? the pictures [ plural ] old-fashioned\nthe cinema: Let's go to the pictures tonight.\nSee more\nB2 [ C ] something you produce in your mind, by using your imagination or memory: I have a very vivid picture of the first time I met Erik.\nThesaurus: synonyms, antonyms, and examples\nto imagine somethingimagineYou can just imagine her storing up these anecdotes for her dinner parties.think ofI want you to think of a time when you felt happy.pictureCan you picture yourself at the age of 60 doing what you do now?pictureWhen I say 'your car' you have a picture of that in your head.in your mind's eyeIn my mind's eye, I'm still a uni student and not a middle-aged worker.conceiveI can't conceive why anyone would want to hurt her.\nSee more results »\nMore examplesFewer examplesShe cut out his picture from the magazine.There was a picture of the Trevi fountain on the front of the book.Take a look at this picture and see if you recognize anyone.This TV gives a very sharp picture.All these pictures were painted by local artists.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\nPillCam\npin-up\nprojection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nCinema - general words\nImagining and conceiving\npicture noun\n(IDEA)\nB2 [ S ] (an idea of) a situation: After watching the news, I had a clearer picture of what was happening. The picture emerging in reports from the battlefield is one of complete confusion.\n[ S ] a situation described in a particular way: figurative The experts are painting a gloomy/brighter/rosy picture of the state of the economy.\nMore examplesFewer examplesThis report gives a global picture of the company's finances.He painted a rosy picture of family life.She paints a gloomy picture of the future.I suspect she gave a true picture of what had happened.There are, however, one or two items of good news to brighten the economic picture a bit.\nSMART Vocabulary: related words and phrases\nSituations and circumstances\naffair\nbackdrop\nbackground\nbusyness\ncase\ncircumstance\nclimate\ncomedy of errors\ncondition\nfinancial affairs\nfooting\ngoing\nposition\nscheme\nsituation\nsituational\nsituationally\nstake\nthe scheme of things idiom\nthing\nSee more results »\nIdioms\nbe a picture\nbe the picture of health, innocence, etc.\nevery picture tells a story\nget the picture\nkeep someone in the picture\nout of the picture\nput someone in the picture\nsomeone's face is a picture\nC1 to imagine something: Picture the scene - the crowds of people and animals, the noise, the dirt. [ + -ing verb ] Try to picture yourself lying on a beach in the hot sun. [ + question word ] Picture to yourself how terrible that day must have been.formal He was pictured (= an artist had painted him) as a soldier in full uniform.\nThesaurus: synonyms, antonyms, and examples\nto imagine somethingimagineYou can just imagine her storing up these anecdotes for her dinner parties.think ofI want you to think of a time when you felt happy.pictureCan you picture yourself at the age of 60 doing what you do now?pictureWhen I say 'your car' you have a picture of that in your head.in your mind's eyeIn my mind's eye, I'm still a uni student and not a middle-aged worker.conceiveI can't conceive why anyone would want to hurt her.\nSee more results »\nMore examplesFewer examplesI pictured myself relaxing by the pool.Can you picture yourselves living in the country?He smiled to himself as he pictured the scene.If you could try to picture how difficult life was in those days, you'll understand more.I'd pictured him as much older.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nrevisualization\nriot\nrun riot idiom\ntheorize\nthink of something\nthrow\nvision\nSee more results »\npicture noun\n(REPRESENTATION)\nAdd to word list\nAdd to word list\n[ C ] a representation of someone or something produced by drawing, painting, or photographing: He drew/painted a picture of my dog. Brian takes lots of pictures (= photographs).\n[ C ] A picture is also an image seen on a television or movie screen: It’s an old set, and the picture is a little fuzzy.\n[ C ] A picture is also a movie: It won an Academy Award for best picture.\npicture noun\n(DESCRIPTION)\n[ C/U ] a description of a situation, or the situation itself: [ C ] Do news reports give an accurate picture of events? [ U ] They’re looking at individuals and not at the overall picture. [ U ] Don’t say any more – I get the picture (= understand the situation). [ U ] Marilyn’s mother more or less stayed out of the picture (= was not involved).\n[ C/U ] To paint a picture is to describe a situation: [ C ] The statistics do not paint an optimistic picture. Idiom\nthe picture of something\npicture verb [T]\n(REPRESENTATION)\nto imagine how something looks: Try to picture yourself lying on a beach in the hot sun.\nAdd to word list\nAdd to word list\n[ S ] an idea about what is happening in a particular situation: a picture of sth They conducted a survey to get a better picture of their customers' needs.a clear/complete/accurate picture It is difficult to get an accurate picture of value.a gloomy/grim/rosy picture The economic picture that the prime minister painted was fairly gloomy.\nthe big picture\nthe whole situation, as opposed to particular parts of it: see/look at the big picture The board needs to look at the bigger picture when taking investment decisions. It's important not to lose sight of the big picture. The bigger picture shows a growing divide in the market between the wealthy and the poor.\nkeep/put sb in the picture\nto make sure someone knows all the facts about a situation that is changing: We keep shareholders in the picture with our annual reports.\nout of the picture\nnot part of or involved in a particular situation: With overtime out of the picture, many of the workers will struggle to survive."}