{"id":276455,"name":"piece","type":"noun","us_sound":"piːs","us_link":"../audio/p/peace.mp3","uk_sound":"piːs","uk_link":"../audio/p/ukpayro010.mp3","content":"piece noun [C]\n(PART)\nAdd to word list\nAdd to word list\nA2 a part of something: a piece of cloth torn from her coat He cut the cake into six pieces. This jigsaw puzzle has two pieces missing. The vase lay on the floor in pieces (= broken into small parts). She tried to break/tear a small piece off the edge. The building was taken apart and reassembled piece by piece (= one part after another).\nSamere Fahim Photography/Moment/GettyImages\nMore examplesFewer examplesI'm going to have another piece of cake.A piece of shell fell into the cake mixture.He broke off a piece of chocolate.I dropped the vase and it broke into pieces.She ripped up his letters and burned the pieces.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\npiece noun [C]\n(THING)\nA2 a single object of a particular type: a piece of furniture/clothing/equipment a piece of paper (= a whole sheet) a piece of china (= an object made of china) a piece of information/advice\nan item of clothing, especially one that is expensive, fashionable, or individually made : Each piece is quite unique, owing to the fact that all her creations are hand-knitted.\nB2 something that has been created by an artist, musician, or writer: an orchestral/piano/instrumental piece a skilful piece of work/research Did you read that piece (= article) in the newspaper?\na single thing that forms part of a set: a chess piece\na coin with a stated value: Could you swap me two quarters for a 50 cent piece?\nMore examplesFewer examplesI read an interesting piece of information in the newspaper.If you listen carefully to this piece of music, you can hear a flute in the background.Valuable pieces of china were on display in a glass-fronted cabinet.How many pieces of baggage do you have?The winning novel truly is a magnificent piece of writing.\nSMART Vocabulary: related words and phrases\nObjects - general words\naffair\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\nphenomenon\nshape\nsnow globe\nsuch and such\ntchotchke\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClothing - general words\nThe visual arts in general\nWords meaning parts of things\nPayment methods\npiece noun [C]\n(GUN)\nold-fashioned a gun: an artillery pieceUS slang He was carrying a piece when he was arrested.\nSMART Vocabulary: related words and phrases\nHandguns & rifles\n.22\n.45\nair pistol\nair rifle\nairgun\ncarbine\ncolt\nfirearm\nflamethrower\ngat\npistol\nray gun\nrevolver\nrifle\nSaturday night special\nstarting pistol\nstun gun\nsubmachine gun\ntommy gun\nUzi\nSee more results »\npiece noun [C]\n(BREAD)\nScottish English a sandwich: a ham piece\nRichard Griffin/iStock/Getty Images Plus/GettyImages Grammar\nPiece words and group wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nPiece wordsPiece words make it possible to talk about a single unit or units of something which is seen as uncountable. Piece words include words such as piece, bit, item, article. We normally use them with of. We can use them in the singular or the plural. …\nIdioms\ncome to pieces\ngive someone a piece of your mind\nfall to pieces\n(all) in one piece\nin pieces\npick/pull someone/something to pieces\na piece of ass\na piece of cake\na piece of the pie\na piece of work\nMore idioms\ntake something to pieces\nwith the number of pieces mentioned: a five-piece band (= with five players)\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\npiece noun [C]\n(PART)\nAdd to word list\nAdd to word list\na part of something: a piece of cake/chicken/pizza The vase lay on the floor in pieces (= broken into small parts). She was so mad that she ripped the letter to pieces (= into small parts).\npiece noun [C]\n(ITEM)\na single item that is one of other similar items: a piece of furniture/equipment/luggage/paper I have an important piece of information for you.\nA piece can be something created by an artist, writer, or musician: He’s written a new piece of music. Idioms\ngo to pieces\na piece of cake\na piece of the action\na piece of the pie\nAdd to word list\nAdd to word list\na single thing of a particular type, especially one of many: a piece of sth A faulty piece of software caused the bank's online facility to shut down for three hours. He produced an excellent piece of work. a piece of data/evidence/information\na coin that has a value below 100 pence, cents, etc.: a fifty-pence/fifty-cent piece\npay/buy/sell by the piece\nCOMMERCE to pay for, buy, or sell something in single units rather than in groups: The stitchers are paid a salary rather than by the piece. In those days stores sold candy by the piece for a penny.\nSee also\nmailing piece"}