{"id":276547,"name":"piercing","type":"adjective","us_sound":"ˈpɪr.sɪŋ","us_link":"../audio/p/piercing.mp3","uk_sound":"ˈpɪə.sɪŋ","uk_link":"../audio/p/ukpictu013.mp3","content":"Add to word list\nAdd to word list\ngoing through or into something: Troops have been issued with new armour-piercing anti-tank grenades.\nvery cold, or making you feel very cold: We shivered in the piercing wind.\n(of a sound) high, loud, and unpleasant: piercing screams\nThesaurus: synonyms, antonyms, and examples\nloudloudThe sirens were loud.noisyOur neighbours are very noisy.deafeningThe music was deafening.thunderousThunderous cheers erupted from the fans during the final seconds of the game.explosiveThere was an explosive clap of thunder.\nSee more results »\na piercing criticism, question, remark, etc.\na criticism, question, remark, etc. that is unpleasant or uncomfortable because it is expressed strongly, or it makes you think about or discuss something that you would prefer not to: She hadn't really meant to lie, but their piercing questions had forced her to.\nSee more piercing eyes, look, gaze, etc.\nused to describe the fact of a person looking very carefully at someone or something, especially when they are trying to discover something, often making people feel uncomfortable: Sherlock Holmes gave him a piercing glance.\nSee more\nSMART Vocabulary: related words and phrases\nMaking holes in things\nbore\nborer\nbreach\ncutout\ndent\ndrill\ngouge\nhole\nperforate\nperforated\npierce\nprick\nprobe\npunch\npuncture\nrebore\nredrill\nriddle\nundrilled\nYou can also find related words, phrases, and synonyms in the topics:\nNoise & noisy\nRelated word\npiercingly\n[ C ] a hole made in the body for wearing jewellery: He has several tattoos and multiple piercings. a belly button/nose piercing\n[ U ] the process of making a hole in the body for wearing jewellery: They offer ear piercing, facials, massage, and manicures.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking holes in things\nAdd to word list\nAdd to word list\nfeeling or seeming very sharp or powerful: He had piercing blue eyes. She let out a piercing (= loud) shriek."}