{"id":276638,"name":"pigeonhole","type":"noun","us_sound":"ˈpɪdʒ.ən.hoʊl","us_link":"../audio/p/pigeonhole.mp3","uk_sound":"ˈpɪdʒ.ən.həʊl","uk_link":"../audio/p/ukpictu022.mp3","content":"Add to word list\nAdd to word list\none of a set of small boxes, open at the front, in which letters and messages are left for different people: Leave the report in my pigeonhole when you've read it.\nDavid Pagán/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nCommunications - the postal system\naddy\nBFPO\ncare of idiom\ncollection box\nconsignee\ndelivery\ndirect mail\nexpress\nFreepost\nletterbox\nmail\nmail slot\npostage\npostbox\npostmark\nself-addressed\nshipping and handling\nstamp\nwindow\nzip code\nSee more results »\nIdiom\nput something/someone in a pigeonhole\nusually disapproving to have an often unfair idea of what type someone or something is: He is a film producer who can't be conveniently pigeonholed.\nto put something away or leave it until a later time: Consultants found the experience frustrating - their reports were only partly implemented, or, worse still, just pigeonholed.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDelaying and wasting time\nAdd to word list\nAdd to word list\nto put someone or something into a group or type, often unfairly: He’s was pigeonholed early on in his career as a gospel singer.\nAdd to word list\nAdd to word list\ndisapproving to form a fixed and often unfair idea of what someone or something is like: They say reviewers are pigeonholing their studies and making unfair judgements about potentially useful research.be pigeonholed as sth We decided to drop the .com in our name because we didn't want to be pigeonholed as an internet company. I was pigeonholed early in my career.\nWORKPLACE one of a set of small boxes along a wall in which mail, messages, etc. can be left: She left her business card in my pigeonhole.\ndisapproving a particular group of similar things that people or things are put into: put sb/sth in a pigeonhole My boss put me in a pigeonhole, so I was never considered for work in other departments."}