{"id":276901,"name":"pilfer","type":"verb","us_sound":"ˈpɪl.fɚ","us_link":"../audio/p/pilfer.mp3","uk_sound":"ˈpɪl.fər","uk_link":"../audio/p/ukpigmy018.mp3","content":"Add to word list\nAdd to word list\nto steal things of small value: He was caught pilfering (sweets) from the shop. Synonyms\nfilch informal\nlift (STEAL)\nnab informal\nnick (STEAL) UK informal\npinch (STEAL) informal\npurloin formal or humorous\nsnarf informal\nswipe (STEAL) informal\nThesaurus: synonyms, antonyms, and examples\nto steal somethingstealI caught him trying to steal my bike.takeSomeone took their car from outside the house.shopliftHe was caught shoplifting by a security guard.robHe robbed a bank.burgleUK When she got home from work, she discovered that her house had been burgled.pilferEmployees pilfering paper, pens, etc. can cost employers a lot.\nSee more results »\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiratical\npiratically\nplunder\npoach\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nAdd to word list\nAdd to word list\nto steal things of little value or in small amounts: [ I/T ] Neighborhood kids were pilfering (candy) from the corner store.\nAdd to word list\nAdd to word list\nto steal things that are not worth much money, especially from the place where you work: He was caught pilfering stationery more than once.\nto steal money, ideas, information, etc. from an organization: They were charged with conspiracy to pilfer $600m from a major international conglomerate. U.S. officials claimed the plane's electronic surveillance equipment had been thoroughly examined and pilfered by their military. pilferage noun [ U ]\nClosed circuit TVs have helped reduce the levels of pilferage experienced by retailers. pilfering noun [ U ]\nHis pilfering of the fund landed him in prison and destroyed his political career."}