{"id":276987,"name":"pillion","type":"noun","us_sound":"ˈpɪl.jən","us_link":"../audio/p/cald4us1766.mp3","uk_sound":"ˈpɪl.jən","uk_link":"../audio/p/ukpigmy025.mp3","content":"Add to word list\nAdd to word list\na seat or place behind the person riding a motorcycle where a passenger can sit: Perched precariously on the pillion, her arms around his waist, she giggled with delight He even took me to a charity ball on the pillion, all dressed up in my long gown!\nWestend61/GettyImages\nMore examplesFewer examplesMum climbed on the pillion, tying a headscarf around her head, and we were off.\"Hop on,\" he said, patting the pillion.\nSMART Vocabulary: related words and phrases\nMotorbikes\nBeemer\nbike\nbiker\nboda boda\ncc\nchopper\nhandlebar\nHarley-Davidson\nHell's Angels\nkick-start\nkickstand\nmachine\nmobility scooter\nmoped\nmotorbike\npannier\nroad racer\nsidecar\nsnowmobile\nSee more results »\nbehind the person riding a motorcycle, bicycle, or horse: The pillion seat is about size of matchbox! She was a pillion passenger on his motorcycle when it crashed.\nMore examplesFewer examplesA motorcyclist and pillion rider were slightly hurt after their machine crashed.Tom brought him back on the pillion seat of his bike.The bike has good suspension and comfortable seating for both rider and pillion passenger.\nSMART Vocabulary: related words and phrases\nMotorbikes\nBeemer\nbike\nbiker\nboda boda\ncc\nchopper\nhandlebar\nHarley-Davidson\nHell's Angels\nkick-start\nkickstand\nmachine\nmobility scooter\nmoped\nmotorbike\npannier\nroad racer\nsidecar\nsnowmobile\nSee more results »\nsitting behind the person riding a motorcycle, bicycle, or horse: You get a bit uncomfortable after riding pillion for a couple of hours. Simon was riding pillion on a motorcycle when it hit a car head-on.\nMore examplesFewer examplesTom had never before ridden pillion on a motorbike.He couldn't ride because he was too young, yet he was happy to travel pillion for the week.Two men rode into the clearing, one carrying a girl pillion.\nSMART Vocabulary: related words and phrases\nMotorbikes\nBeemer\nbike\nbiker\nboda boda\ncc\nchopper\nhandlebar\nHarley-Davidson\nHell's Angels\nkick-start\nkickstand\nmachine\nmobility scooter\nmoped\nmotorbike\npannier\nroad racer\nsidecar\nsnowmobile\nSee more results »"}