{"id":277620,"name":"pioneer","type":"noun","us_sound":"ˌpaɪəˈnɪr","us_link":"../audio/p/pioneer.mp3","uk_sound":"ˌpaɪəˈnɪər","uk_link":"../audio/p/ukpinkn017.mp3","content":"Add to word list\nAdd to word list\nC2 a person who is one of the first people to do something: one of the pioneers of modern science a pioneer heart surgeon\na person who goes to an area and builds a house, begins a farm, etc.: The pioneers went west across North America, cutting down forests and planting new crops.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravellers & visitors\nto be one of the first people to do something: It was universities that pioneered these new industries.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspark\nspell\nSee more results »\nAdd to word list\nAdd to word list\na person who is among the first to study or develop something: He was a pioneer in big-band jazz.\nUS history A pioneer is also a person who is among the first to enter and live in an area, esp. European Americans in the western US: The pioneers made their way across the desert. pioneer verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˌpɑɪ·əˈnɪər/\nHe pioneered the design of the Internet.\nAdd to word list\nAdd to word list\nto be the first person or organization to start work in a new area, introduce a new idea, etc.: He is chief content officer of Netflix, the company that pioneered mailed rentals of DVDs. Most major airlines have had to adopt many of the cost-saving innovations pioneered by their low-cost competitors.\na person or organization that is the first to start work in a new area, introduce a new idea, etc.: pioneer in/of sth She was a pioneer in the biotech industry's patent law."}