{"id":278498,"name":"pit","type":"noun","us_sound":"pɪt","us_link":"../audio/p/pit.mp3","uk_sound":"pɪt","uk_link":"../audio/p/ukpiqua023.mp3","content":"pit noun [C]\n(PLACE/AREA)\nAdd to word list\nAdd to word list\nC2 a large hole in the ground, or a slightly low area in any surface: They'd dug a shallow pit and left the bodies in it. These pits in my skin are from when I had chickenpox. See also\narmpit\nsandpit UK\na coal mine or an area of land from which a natural substance is taken by digging: The coal-mining industry wants new pits to be opened. a gravel/chalk pit\nf3rd14n/iStock/Getty Images Plus/GettyImages\nslang a very untidy or dirty place: I'm afraid my room is a complete pit! the pit [ S ]\nin a theatre, the seats at the lowest level, or the orchestra pit the pits [ plural ]\ninformal something that is of extremely low quality: The hotel we stayed in was the pits!\n(in motor racing) the area next to the track where the cars are given fuel or repaired during a race\nMartin Barraud/Caiaimage/GettyImages\nMore examplesFewer examplesThe unions fought hard against the government's programme of pit closures.The plumber climbed down the inspection pit.They had to dig a six-foot deep pit to sink the sewage pipes.Can you tidy up that pit of a bedroom of yours!They dumped his dismembered body in a pit.\nSMART Vocabulary: related words and phrases\nGeography: caves, cracks & crevices\ncave\ncavern\ncrack\ncrater\ncratered\ncrevasse\ncrevice\nfault\nfissure\nfurrow\ngouge\ngrotto\ngulf\nhole\npothole\nrelocation\nrut\nrutty\nspeleologist\nstalagmite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHoles, hollows and dips\nEngineering - mining & quarrying\nUnpleasant places\nTheatre auditorium & front-of-house\nInformal words for bad\nMotor racing\npit noun [C]\n(SEED)\nmainly US (UK usually stone) a large, hard seed inside some types of fruit: Peaches, plums, and olives all contain pits.\nNatthakan Jommanee/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving the skin or seed from fruit & vegetables\nIdiom\npit of your stomach\nUS for\nstone\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving the skin or seed from fruit & vegetables\nPhrasal verb\npit someone/something against someone/something\npit noun [C]\n(HOLE)\nAdd to word list\nAdd to word list\na large hole in the ground, or a hollow in any surface: The trash had been buried in a six-foot-deep pit. a fire pit\nA pit is also the area in the front of a theater where the musicians perform. The pit of your stomach\nThe pit of your stomach is the center of your body, where you feel esp. fear and anxiety: I got a sick feeling in the pit of my stomach before the performance.\npit noun [C]\n(SEED)\na large, hard seed that grows inside some types of fruit and vegetables: a peach/plum/cherry pit\npit noun [C]\n(REPAIR AREA)\nan area on the side of a track on which cars race, where the cars are given fuel or repaired during a race\npit noun [C]\n(UNDERGROUND METALS)\n(also pit mine) a hole from which natural substances, such as rocks and minerals, are dug; mine Idiom\nthe pits\nAdd to word list\nAdd to word list\nSTOCK MARKET the area of a stock exchange used for trading: Many traditional pits have moved their business to electronic trading systems. Compare\nthe floor\nNATURAL RESOURCES a deep area underground from which a natural resource is taken by digging: a coal/clay/gravel pit"}