{"id":278654,"name":"pity","type":"noun","us_sound":"ˈpɪt̬.i","us_link":"../audio/p/pity.mp3","uk_sound":"ˈpɪt.i","uk_link":"../audio/p/ukpitfa022.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] a feeling of sadness or sympathy for someone else's unhappiness or difficult situation: The girl stood gazing in/with pity at the old lion in the cage. She agreed to go out with him more out of pity than anything. These people don't want pity, they want practical help. See also\nself-pity disapproving\nA2 [ S ] mainly UK If something is described as a pity, it is disappointing or not satisfactory: \"Can't you go to the party? Oh, that's (such) a pity.\" [ + (that) ] It's a pity (that) children spend so little time outside nowadays. [ + (that) ] Pity (that) you didn't remember to give me the message. What a pity you're ill! \"I called the restaurant, but they're closed tonight.\" \"Pity.\" We'll have to leave early, more's the pity (= and I am unhappy about it). The pity was that so few people bothered to come. take pity (on someone)\nto feel sorry for someone, and to do something that shows this: We took pity on a couple of people waiting in the rain for a bus and gave them a lift.\nSee more\nMore examplesFewer examplesIt's a pity Christmas has become so commercialized.\"She can't come.\" \"What a pity.\"I was toiling up the hill with four heavy bags when he took pity on me.His heart ached with pity for her.They took pity on the stray cat and fed it.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npityingly\npoor\nrelate\nsensitivity\nsympathetic\nsympathize\nsympathy\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisappointing yourself and others\nC2 to feel sadness or sympathy for someone's unhappiness or bad situation: I pity anyone who's never been in love. He's deeply unhappy, and more to be pitied than criticized. I pity you having to put up with her at work!\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npityingly\npoor\nrelate\nsensitivity\nsympathetic\nsympathize\nsympathy\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nAdd to word list\nAdd to word list\nsympathy and understanding for someone else’s suffering or troubles: She did not want his pity.\nIf something is described as a pity, it is a cause for regret: It’s a pity you can’t come to the party. pity verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈpɪt̬·i/\nI pity people who have to work with statistics."}