{"id":278832,"name":"place","type":"noun","us_sound":"pleɪs","us_link":"../audio/p/place.mp3","uk_sound":"pleɪs","uk_link":"../audio/p/ukpkk__006.mp3","content":"place noun\n(AREA)\nAdd to word list\nAdd to word list\nA1 [ C ] an area, town, building, etc.: Her garden was a cool pleasant place to sit. What was the name of that place we drove through on the way to New York? They decided to go to a pizza place. There are several places of interest to visit in the area. It's important to feel comfortable in your place of work.\nA2 [ C ] informal a home: I'm looking for a place to live. We'll have the meeting at my place.\nThesaurus: synonyms, antonyms, and examples\naccommodationaccommodationUK Our holiday accommodation was not up to standard.place to stayIf you need a place to stay, I have a spare room.lodgingOur lodging on the estate wasn't free: we had to help with household tasks in payment.lodgingsAfter work she returned to her lodgings on the outskirts of town.digsUK I had digs in Jesus Lane, not far from college.\nSee more results »\n[ S ] a suitable area, building, situation, or occasion: University is a great place for making new friends. [ + to infinitive ] This meeting isn't the place to discuss your problems, I'm afraid.\nMore examplesFewer examplesThe school was a cold, unwelcoming place.The mixture of flour, water and yeast is then left in a warm place for four hours.New York is reportedly a very exciting place to live.I wonder if you could give me some information about places to visit in the area?The new law will outlaw smoking in public places.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHome\nSuitable and acceptable\nplace noun\n(POSITION)\n[ C ] a position in relation to other things or people: His leg was broken in two places. When you've finished, put the book back in its place on the shelf. This plant needs a warm, sunny place. Will you keep my place (in the queue) (= allow me to come back to the same position)? She spoke to me and I lost my place in the book (= I forgot where I had been reading). See also\ndecimal place\nB1 [ C ] the seat you will sit in on a particular occasion, or the seat where you usually sit, in the theatre, a class, a train, etc.: My ticket says 6G but there's someone sitting in my place. The children collected their prizes and then went back to their places. Save me a place (= keep a seat for me until I arrive) near the front.\n[ C ] the space at a table where one person will sit and eat, usually with a plate and knives, forks, and spoons arranged on it: The waiter showed us to our places and gave us each a menu. He laid six places at the table.\nB1 [ C ] a position in an organization, system, or competition: UK She's got a place at universityUK She's got a place on a fine-arts course.US She's got a place in a fine-arts course. Our team finished in second place. He took third place (= was the third to finish) in the marathon last year.\n[ C ] US used after words such as \"any\" and \"some\" as a different way of saying \"anywhere\", \"somewhere\", etc.: I know I left that book some place - now, where was it? That bar was like no place I'd ever been before. take place\nB1 to happen: The concert takes place next Thursday.\nSee more out of place\nC2 in the wrong place or looking wrong: The boy looked uncomfortable and out of place among the adults.\nSee more in place\nC2 If something is in place, it is in its usual or correct position: The chairs are all in place.\nC2 organized: The arrangements are all in place for the concert next Thursday.\nUS (UK on the spot) (of running or jumping) in one place without moving forward or backward at all: She looked like she was running in place as six women flew past her.\nUS without making any progress : While Maryland has been standing in place or going backward, a number of states have courted filmmakers aggressively.\nSee more in place of someone/something\nB2 instead of someone or something: You can use margarine in place of butter in some recipes.\nSee more take the place of someone/something\nB2 to be used instead of someone or something: These portable machines can take the place of your desktop PC.\nSee more\nMore examplesFewer examplesTo divide by ten, move the decimal point one place to the left.Their 2-0 victory today has ensured the Italian team a place in the Cup Final.I lost my place in my book when the pages flipped over in the wind.I just get on with my job and do as I'm told - I know my place.There will be a brief pause in the proceedings while the piano is moved into place.\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nposition\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChairs & seats\nProviding & serving meals\nOrganizations - position & status\nSomewhere, anywhere, nowhere, or everywhere\nplace noun\n(DUTY)\n[ U ] what a person should do or is allowed to do, especially according to the rules of society: [ + to infinitive ] It's not your place to tell me what to do. I'm not going to criticize his decision - I know my place (= I know that I am of lower rank or have less authority).\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nIdioms\nall over the place\nchange places\nfrom a place of\ngo places\nin a ... place\nin the first/second place\na place for everything and everything in its place\na place in the sun\nput someone in their place\ntake first/second place\nplace verb\n(POSITION)\nB2 [ I or T ] to put something in a particular position: She placed the letter in front of me. She placed her name on the list of volunteers. I'd place him among the ten most brilliant scientists of his age. [ + obj + adj ] The horse was placed first/second/third in its first race (= finished the race in first/second/third position). place an advertisement, bet, order, etc.\nC1 to arrange to have an advertisement, bet, order, etc.: We placed the order for the furniture six weeks ago.\nSee more place emphasis, importance, etc. on something\nC2 to give something emphasis, importance, etc.: She placed the emphasis on the word \"soon\" in order to make sure she was understood.\nSee more\n[ T ] to find someone a job: The students are placed in/with companies for a period of work experience.\nMore examplesFewer examplesWe placed saucepans on the floor to catch the drops of water coming through the roof.The chairs were placed in a semi-circular arrangement.His penalty kick placed the ball decisively in the back of the net.Please place your questionnaire in the box when you've finished.She placed the vase of flowers carefully in the centre of the table.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nplace verb\n(RECOGNIZE)\n[ T ] to recognize someone or remember where you have seen someone and how you know them: She looks familiar but I can't place her - did she use to work here?\nSMART Vocabulary: related words and phrases\nRemembering, reminding and reminders\naide-mémoire\nannal\nawaken someone to something\nbe engraved on someone's memory/mind idiom\nbe etched on/in someone's memory idiom\ncommit\nhooky\nif my memory serves me right idiom\nimprint\nindelible\njog\njog someone's memory idiom\nremember\nremind\nremind someone of something/someone\nreminder\nreminisce\nresonance\nresonant\nstamp\nSee more results »\nIdiom\nhow are you placed for...?\nplace noun\n(AREA)\nAdd to word list\nAdd to word list\n[ C ] an area, a building, or a city, town, or village: Airports are usually busy places. Larchmont is a nice place to live.\n[ C ] Your place is your home: We can meet at my place.\n[ C ] A place is also an area or building used for a specific purpose: a place of worship\nplace noun\n(POSITION)\n[ C ] a particular position: That’s the best place for the piano. The librarian put the book back in its place (= in the right position).\n[ C ] A place is also a space for a person, as in a theater, at a table, or in a line: Will you hold my place in line for a minute? in place\nIf plans are in place, they have been made: I think everything’s in place for the wedding. in place\nIn place can also be used to talk about something that is being used now: The new building code will replace the rules that are currently in place.\nplace noun\n(RANK)\n[ C ] the rank someone or something has: Our team finished in second place.\nplace noun\n(JOB)\n[ C ] a job, or a position in an organization, at a school, etc.: Ann just got a place at Yale.\nplace noun\n(DUTY)\n[ U ] a person’s duty or position of authority: [ + to infinitive ] It’s not your place to tell me what to do. Idiom\ntrade places (with someone)\nplace verb\n(RECOGNIZE)\n[ T ] to recognize someone or something because of memory or past experience: She looks familiar, but I can’t place her.\nplace verb\n(PUT)\n[ T ] to put someone in a situation: They placed him in a nursing home. She was placed under arrest.\nplace verb\n(INVEST)\n[ T ] to invest or risk money: They placed a significant amount in stocks.\nplace verb\n(GIVE)\n[ T ] to arrange to get something by telling someone who will supply it: I placed an order for three CDs.\nAdd to word list\nAdd to word list\nto do the things necessary to make something happen: place an advertisement/order Orders can be placed by phone or via the website. The President placed calls to several world leaders to discuss the crisis.\nSTOCK MARKET, FINANCE to find buyers for shares when they are made available for sale: place sth with sth Brokers BZW place shares in the company with various institutional investors.\nHR to find a job for someone to do for a short period so that they can get some work experience: The college placed him with a software firm for a month.\nan area, building, room, etc. that is used for a particular purpose: Trade fairs and exhibitions remain a common meeting place for retail buyers and suppliers. He qualified for redundancy on the basis that the new hours and place of work would be a change to his terms and conditions.\nin place\ndone and ready to be used: The details of the deal aren't in place yet.\nin sb's place\ninstead of someone else: When her manager fell ill, she was asked to attend the sales conference in his place.\nbe going places\nto behave or work in a way that shows you will soon become successful: Although it was a young company, it was obvious that it was going places.\ntake place\nto happen: The handover to the new owners will take place in July. The historic meeting took place in New York."}