{"id":279171,"name":"plan","type":"noun","us_sound":"plæn","us_link":"../audio/p/plan.mp3","uk_sound":"plæn","uk_link":"../audio/p/ukplain004.mp3","content":"plan noun\n(DECISION)\nAdd to word list\nAdd to word list\nA2 [ C ] a set of decisions about how to do something in the future: a company's business plan a negotiated peace plan a five-year plan holiday plans What are your plans for this weekend? [ + to infinitive ] My plan is to sell the house and buy an apartment.\nThesaurus: synonyms, antonyms, and examples\nan ideaideaI've got an idea - why don't we ask John for help?planThe plan is to hire a car when we get there.thoughtHave you had any thoughts on presents for your mother?suggestionHave you got any suggestions for improvements?brainwaveUK I wasn't sure what to do and then I had brainwave - I could ask Anna for help.brainstormUS She was stuck until she had a brainstorm and the solution came to her.\nSee more results »\n[ C ] a type of arrangement for financial investment: a pension/savings plan go according to plan\nto happen in the way you intend: Events of this type rarely go according to plan.\nSee more\nMore examplesFewer examplesThe government recently announced details of its plan to streamline the taxation system.She explained her plan in a few brief sentences.The plan entails rerouting traffic through a tunnel to create a vast pedestrian area around Al-Azhar.The management board has set out its plans for the coming year.We've had to forget about our holiday plans because of David's accident.\nSMART Vocabulary: related words and phrases\nPlans and arrangements\naccommodation\nappointed\narrangement\narranger\nbackstop\nblueprint\ncounter-strategy\ncounter-tactic\ndesign\ndone\nexit strategy\nmaster plan\nnon-programme\npackage deal\nparty line\nplan of action\nplanning\npolicy\nTBA\nwalk-in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nplan noun\n(DRAWING)\nB2 [ C ] a drawing of a building, town, area, vehicle, machine, etc. that only shows its shape from above, its size, and the position of important details: a street plan (= a type of map of a town showing the roads) a seating plan (= a drawing that shows where each person will sit)\ncherezoff/iStock/Getty Images Plus/GettyImages plans [ plural ]\nB2 drawings from which something is made or built: draw up plans The architect showed us the house plans that she had drawn up.\nSee more\nMore examplesFewer examplesarchitectural plansThe plans should be drawn as accurately as possible, showing all the measurements.Have you worked out the seating plan for the wedding reception?The shaded areas of the plans show where the houses will be built.The developers submitted building plans to the council for approval.\nSMART Vocabulary: related words and phrases\nArchitecture\nanti-modernism\nanti-modernist\narchitect\narchitectural\narchitecturally\nbuilt environment\ncolonial\ndefensive architecture\ndesign\necotecture\nItalianate\nLatinization\nLatinize\nLatinized\nmid-century modern\nrococo\nRomanesque\nsympathetically\nthe pyramids phrase\ntrefoil\nSee more results »\nplan verb\n(DECIDE)\nB1 [ I + adv/prep, T ] to think about and decide what you are going to do or how you are going to do something: She helped them to plan their route. If we plan carefully, we should be able to stay within our budget. [ + question word ] She's already planning how to spend her prize money.\nA2 [ I or T ] to intend to do something or that an event or result should happen: Our meeting wasn't planned - it was completely accidental. [ + to infinitive ] I'm not planning to stay here much longer. [ + adv/prep ] We only planned for six guests, but then someone brought a friend.\nMore examplesFewer examplesDo you plan to leave London in the distant future or the near future?How do you plan to spend your holiday?The four biggest banks are all planning to cut their service charges.We're planning to turn the smallest bedroom into an office.The route we had planned took us right across Greece.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nplan verb\n(DESIGN)\n[ T ] to design a building or structure: The people who planned these new towns had a vision of clean modern housing for everyone.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\nPhrasal verbs\nplan on doing something\nplan on someone/something doing something\nplan something out\nplan noun\n(METHOD)\nAdd to word list\nAdd to word list\n[ C/U ] a method for doing or achieving something, usually involving a series of actions or stages, or something you have arranged to do: [ C ] The financial plan calls for growth of 5% next year. [ C ] They had plans to have dinner at a local restaurant.\n[ C/U ] A plan is also an arrangement for investment: [ C ] a pension/savings plan\n[ C/U ] If something goes according to plan, it happens the way you wanted it to: [ U ] Producing a new movie rarely goes exactly according to plan.\nplan noun\n(MAP)\n[ C ] a drawing that shows the shape, size, and position of important details of a building or other structure, or of objects within it: The floor plan showed us exactly where everyone’s office would be.\nplan verb\n(METHOD)\n[ I/T ] to think about and decide on a method for doing or achieving something: [ + to infinitive ] She’s planning to visit her sister in Australia next year. [ I always + adv/prep ] He planned on taking his vacation in July. [ I always + adv/prep ] You’ve got to plan ahead and save your money for your retirement.\nAdd to word list\nAdd to word list\n[ C ] a set of actions that are intended to achieve a specific aim: a plan/plans to do sth The government has launched a $935m plan to create jobs.a plan/plans for sth Plans for a share buyback are expected to be unveiled later this week.have plans/no plans to do sth A representative of the bank said it had no plans to make further cuts in its bonus rates.under a plan A further 2,500 job cuts are planned for this year under a plan to save €1.3bn in costs.a strategic/financial/marketing plan Operations that do not fit the firm's overall strategic plan are currently being sold off. a restructuring/spending/recovery plan an ambitious/controversial plan immediate/long-term/future plans a three-phase/five-point/ten-year planhave/come up with/draw up a plan You will need to have a plan to cover start-up expenses while you grow your business.announce/unveil/reveal a plan The telecommunications giant yesterday announced a restructuring plan.outline/formulate/finalize a plan Over the next few months, the board will finalize its plans for meeting the 2020 mandate on carbon dioxide emissions.abandon/shelve/scrap a plan Plans to expand into Spain and Portugal were shelved during the recession last year.keep to/stick to/follow a plan By sticking to our original plan, we finally made a success of the business.approve/back/support a plan Ministers meeting in Brussels approved a plan to refinance the project.agree/adopt/implement a plan Get your team around the table and agree a plan of action to give more attention to detail. oppose/reject a plan go ahead/press ahead/proceed with a plana plan involves/includes sth A new €30 million investment plan announced Friday includes the construction of new plants.a plan fails/succeeds Plans to reassure investors failed and shares slipped 3%.\nan idea about what you may do in the future: What are your plans after you graduate from college?a plan/plans for sth You need to sit down and think about your plans for retirement.sb's plan is to do sth Their plan is to cut income tax for the lower paid.\nFINANCE a financial arrangement in which someone regularly saves or invests money: a retirement/investment/savings plan\na detailed drawing or diagram of a machine or building that shows the different parts, rooms, etc., including their size and shape: A team of architects drew up plans for the new office building.\na drawing of a room or other area that shows the position or arrangement of things inside it: a floor/seating plan See also\naction plan\nbusiness plan\ncafeteria plan\ncontingency plan\ndividend reinvestment plan\nemployee share ownership plan\nfloor plan\nhealth plan\nparty plan\npension plan\nView all\nplot plan\n[ I or T ] to think about the details of something that will happen in the future: plan a project/mission/campaign They spent several months planning the project.go ahead/happen as planned If all goes ahead as planned, the new superstore will open in November.earlier/longer/less, etc. than planned Installing the new computer system has taken far longer than planned.\n[ I or T ] to intend to do a particular thing in the future: We're planning a change to our pricing structure. A number of large residential developments are planned for the area.plan to do sth In February of this year, the company filed for bankruptcy, and it plans to auction its assets in late May.plan (on) doing sth She plans on working as a freelance consultant once she has left her current role.\n[ I ] to think about and make arrangements for things that will happen in the future: Job insecurity makes it difficult for people to plan. plan ahead The new tax guide tells you how to plan ahead to keep any tax bills to a minimum.plan for sth Airport bosses are planning for an extension of the current terminal. Phrasal verb\nplan sth out"}