{"id":279362,"name":"plant","type":"noun","us_sound":"plænt","us_link":"../audio/p/plant.mp3","uk_sound":"plɑːnt","uk_link":"../audio/p/ukplain017.mp3","content":"plant noun\n(LIVING THING)\nAdd to word list\nAdd to word list\nA1 [ C ] a living thing that grows in earth, in water, or on other plants, usually has a stem, leaves, roots, and flowers, and produces seeds: native plants and animals garden/greenhouse/indoor plants a tomato plant See also\nhouseplant\nelenaleonova/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThis plant grows quickly and provides excellent ground cover.Emily scraped away the dead leaves to reveal the tiny shoot of a new plant.Bees pollinate the plants by carrying the pollen from one flower to another.Water the plants twice a week, preferably in the morning.The courtyard was full of exotic plants in terracotta pots.\nSMART Vocabulary: related words and phrases\nPlants & animals - general words\nanimal kingdom\nanti-parasitic\nautotroph\nbiota\nbiped\nfamily\nfauna\nflora\nflora and fauna\ngreenery\nnatively\nnon-mammalian\nnon-placental\nomnivore\nomnivorous\nscavenger\nsecondary consumer\nsongster\nterrestrially\nundomesticated\nSee more results »\nplant noun\n(BUILDING/MACHINES)\n[ U ] machines used in industry: The industry was accused of having invested little in workers, plant, or infrastructure.\n[ C ] a factory in which a particular product is made or power is produced: Two more car-assembly plants were closed by the strike.\n[ U ] UK a large, heavy machine or vehicle used in industry, for building roads, etc.: The sign by the roadworks said \"Slow - heavy plant crossing\". The firm's main business was plant hire.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFactories\nTrucks, vans & caravans\nplant noun\n(PUT SECRETLY)\n[ C usually singular ] something illegal or stolen that has been put secretly in a person's clothing or among the things that belong to them to make them seem guilty of a crime: He insisted the money was a plant.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theorist\nconspiracy theory\nconspirator\nconspire\nentrap\nhatch\ninsinuate\nplotter\nploy\npretext\npretextual\nput-up job\nscheme\nsting\nwheeze\nSee more results »\nplant verb\n(LIVING THING)\nB1 [ T ] to put a plant into the ground or into a container of soil so that it will grow: We planted trees and bushes in our new garden. Hyacinth bulbs planted in pots now will flower early in the spring.\n[ T ] If you plant a particular area, you put plants into the ground there: The plot was surrounded by a stone wall and planted with flowering trees. a densely planted garden (= one in which the plants are close together)\nMore examplesFewer examplesShe planted some roses and other flowering shrubs.Some fields are planted with crops for several years, and then returned to pasture for the cattle.Rake over the soil before planting the seeds.Before deciding what to plant, think about how much sun comes into that area of the garden.I think I'll try planting some vegetables this year.\nSMART Vocabulary: related words and phrases\nGardening - general words\nallotmenteer\nallotmenteering\naquaponics\narborist\nbed\nhedging\nhomegrown\nhorticultural\nhorticulturally\nhorticulture\nprune\nregraft\nregreen\nrepot\nresod\nweeding\nweedy\nwindow box\nxeriscaping\nyardwork\nSee more results »\nplant verb\n(PUT)\n[ T + adv/prep ] to put something firmly and strongly in a particular place: My brother planted himself on the sofa in front of the television. He planted a kiss on her forehead/a blow on his opponent's jaw.\nC2 [ T usually + adv/prep ] to cause an idea or story to exist: That incident planted doubts about him in my mind. Who planted these rumours?\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nplant verb\n(PUT SECRETLY)\n[ T usually + adv/prep ] informal to put something or someone in a position secretly, especially in order to deceive someone: She insisted that the drugs had been planted on her without her knowledge.\nB2 [ T usually + adv/prep ] informal to put a bomb somewhere so that it will explode there: The bomb was planted in the station waiting room.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlotting & trapping\nRelated word\nplantingPhrasal verb\nplant something out\nplant noun\n(LIVING THING)\nAdd to word list\nAdd to word list\n[ C ] a living thing that usually produces seeds and typically has a stem, leaves, roots, and sometimes flowers: We brought a house plant as a gift when we spent the weekend with our friend Sylvia.\nplant noun\n(GROUP)\n[ U ]\n&#160; biology one of five kingdoms (= groups) into which living things are divided, the members of which have many cells, are unable to control their own movement, and get their energy from the light of the sun\nplant noun\n(FACTORY)\n[ C ] us\nYour browser doesn't support HTML5 audio\n/plænt/ a factory and the machinery in it used to produce or process something: a manufacturing plant\nplant verb\n(PUT)\n[ T always + adv/prep ] to put something firmly in a particular place: He planted a kiss on her forehead.\n[ T always + adv/prep ] To plant an idea or story is to cause it to exist: Defense lawyers try to plant doubts in the minds of the jurors about what actually happened.\nplant verb\n(PUT SECRETLY)\n[ T ] to put something or someone in a position secretly, esp. in order to deceive: She insisted that the real thief had planted the evidence in her car.\nplant verb\n(LIVING THING)\n[ T ] to put a seed or plant into the ground or into a container of earth so that it will grow: We’ve planted some trees along the back of our property.\nAdd to word list\nAdd to word list\n[ C ] a factory or other place where goods are manufactured or resources such as energy are produced: The city is considering shutting down a major power plant for environmental reasons. A series of recent plant closures has left hundreds of people out of work. industrial/manufacturing/processing plant assembly/chemical/bottling plant\n[ U ] large pieces of equipment and machinery that are used in manufacturing processes: plant and equipment/machinery Improved market conditions worldwide are driving investments in new plant and equipment. See also\nassembly plant\nmanufacturing plant"}