{"id":279517,"name":"plaster","type":"noun","us_sound":"ˈplæs.tɚ","us_link":"../audio/p/plaster.mp3","uk_sound":"ˈplɑː.stər","uk_link":"../audio/p/ukplain023.mp3","content":"plaster noun\n(SUBSTANCE)\nAdd to word list\nAdd to word list\n[ U ] a substance that becomes hard as it dries and is used especially for spreading on walls and ceilings in order to give a smooth surface: The plaster on the walls was cracked and flaking. See also\nplasterboard mainly UK in plaster UK (US in a cast)\nIf a part of your body is in plaster, it has a plaster cast around it to protect it while a broken bone repairs itself: My leg was in plaster for about six weeks.\nSee more\nSMART Vocabulary: related words and phrases\nBuilding: plastering\nfiller\nmortar\nplasterboard\nplasterer\nplastering\nrender\nreplaster\nroughcast\nSheetrock\nstucco\nstuccoed\nwallboard\nplaster noun\n(STICKY MATERIAL)\n[ C or U ] UK (UK also sticking plaster); (US trademark Band-Aid) a small piece of sticky cloth or plastic that you use to cover and protect a cut in the skin: a box of waterproof plasters Put a plaster on it so that it doesn't get infected.\nGlowimages/GettyImages\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nearplug\nElastoplast\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\n[ T ] to spread plaster on a surface\n[ T + adv/prep ] to make something stick in a flat smooth layer: The torrential rain had plastered her hair to her head.\n[ T usually + adv/prep ] informal to cover a surface or an object with something completely or thickly: She had plastered her bedroom walls with photos of pop stars. The car was plastered with mud. The story was plastered all over (= printed so that it completely covered) the front page of the newspaper.\nThesaurus: synonyms, antonyms, and examples\nto put something over someone or somethingcoverI covered her with a blanket to keep her warm.spreadI spread peanut butter on my bread.smother something in/with somethingThe chicken was absolutely smothered in butter sauce.coatCoat the cherries in chocolate.plasterHis laptop cover was completely plastered with stickers.cakeHis shoes were caked in mud.\nSee more results »\nSMART Vocabulary: related words and phrases\nBuilding: plastering\nfiller\nmortar\nplasterboard\nplasterer\nplastering\nrender\nreplaster\nroughcast\nSheetrock\nstucco\nstuccoed\nwallboard\nYou can also find related words, phrases, and synonyms in the topics:\nCovering and adding layers\nGlues, gluing & stickiness\nRelated word\nplastering\nplaster noun\n(WALL COVERING)\nAdd to word list\nAdd to word list\n[ U ] a substance that is used esp. for spreading on walls and ceilings because it makes a smooth, hard surface after it dries\nplaster noun\n(INJURY PROTECTION)\n[ C ] Br Band-Aid\nplaster verb [T]\n(PLACE WALL COVERING)\ninfml To plaster a surface or an object with something is to cover it completely or thickly: She has plastered her bedroom walls with posters of pop singers."}