{"id":279842,"name":"platoon","type":"noun","us_sound":"pləˈtuːn","us_link":"../audio/p/eus73594.mp3","uk_sound":"pləˈtuːn","uk_link":"../audio/p/ukplate012.mp3","content":"platoon noun [C, + sing/pl verb]\n(GROUP)\nAdd to word list\nAdd to word list\na small group of about ten or twelve soldiers, with a lieutenant in charge of it: His platoon was ambushed. a platoon commander\na group of vehicles, especially military vehicles: The captain was in the lead vehicle of the platoon. First there is a platoon of motorcycle outriders who will clear the streets ahead.\ntransport\n&#160; specialized a group of vehicles that are connected physically or using computer technology so they can travel close together in a group, as a way to save space, fuel, or money: But there is still the problem of managing the formation and dispersal of platoons as cars join and leave. The non-mechanically linked vehicles move in platoon formation.\nMore examplesFewer examplesTwo members of the platoon were injured.He led an infantry platoon on a combat mission.I was a platoon leader in Vietnam.They dispatched platoons of soldiers and trucks.\nSMART Vocabulary: related words and phrases\nParts of armies & groups of servicemen\nbaggage train\nbattalion\nbomb disposal\nbomb squad\ncadre\nCoast Guardsman\ncorps\ndetachment\nmilitia\nparatroops\npatrol\nseal\nsquad\nsquadron\ntask force\nthe Coast Guard\nthe Marine Corps\nthe tip of the spear idiom\ntroop\nWRAC\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArmy & military vehicles\nRoad vehicles in general\nplatoon noun [C, + sing/pl verb]\n(SPORTS)\nsports\n&#160; US specialized two sports players, especially baseball players, who play at the same position at different times: The most common platoon uses a left-handed batter against right-handed pitching and a right-handed batter against left-handed pitching.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nfoul\nglove\nhomer\nliner\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nplatoon verb [I or T]\n(SPORTS)\nsports\n&#160; US specialized in a sports team, especially in baseball, to use two players at different times at the same position, or to play at the same position as another player: Bowden says he'll be platooning the two players as much as possible. The coach plans to platoon him with Ahman Green. Kotchman is now playing full time, instead of platooning.\nMore examplesFewer examplesHe knew that by platooning players, they'd get angry at him. Almost every player he platooned hated him.First baseman Rico Brogna was platooned with Wes Helms.Ortiz should have been platooned.They told him that he'd be platooning with Fartinez.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nfoul\nglove\nhomer\nliner\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nplatoon verb [I or T]\n(VEHICLES)\ntransport\n&#160; specialized to connect vehicles either physically or using computer technology so they can travel close together in a group, as a way to save space, fuel, or money: As drivers become comfortable with the technology and see that it is safe, they might be willing to consider platooning in their own cars. Platooning trucks has been proposed as a way of reducing energy consumption.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nsteer\nton\nSee more results »\nAdd to word list\nAdd to word list\na military unit consisting of a group of about 20 soldiers who are all members of a company"}