{"id":279640,"name":"platform","type":"noun","us_sound":"ˈplæt.fɔːrm","us_link":"../audio/p/platform.mp3","uk_sound":"ˈplæt.fɔːm","uk_link":"../audio/p/ukplate007.mp3","content":"platform noun\n(STRUCTURE)\nAdd to word list\nAdd to word list\nB2 [ C ] a flat raised area or structure\nA2 [ C ] a long, flat raised structure at a railway station, where people get on and off trains: The next train for Aberdeen will depart from platform 9.\nLuismiX/Moment/GettyImages\n[ C ] the raised part of the floor in a large room, from which you make a speech or give a musical performance: Speaker after speaker mounted/took the platform to denounce the policy. This brilliant young violinist has appeared on concert platforms all round the world.\nRobert Daly/OJO Images/Getty Images /GettyImages the platform UK\nthe people who are up on a platform in order to speak to an audience: An elderly lady stood up and said she had a question for the platform. The platform party (= the group on the platform) applauded loudly.\nMore examplesFewer examplesAll southbound trains leave from platform one.Three men were feared dead last night after a helicopter veered off course into an oil platform.I slipped as I stepped onto the platform.He mounted the platform and began to speak to the assembled crowd.Passengers wishing to take the Kings Cross train should go to platform 9.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nupstairs\nwoodblock\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrain & bus stations & taxi ranks\nGroups of people\nplatform noun\n(shoe)\n[ C usually plural ] a style of shoe with a very thick high sole (= bottom part): Flared trousers and platforms were in then. Strappy heels or even clunky retro platforms can look good.\nJ2R/iStock/Getty Images Plus/Getty Images /GettyImages\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh heels\nhigh-top\nhiking boot\nhobnail\nhobnail boot\nrunning shoe\nsandal\nshoehorn\nshoelace\nshoemaker\nwedge\nwedgie\nwellie\nwellington\nwelly\nSee more results »\nplatform noun\n(IDEAS)\nC2 [ C usually singular ] an opportunity to make your ideas or beliefs known publicly: By refusing to give us a grant to make this programme, they are denying us a platform.\n[ S ] all the things that a political party promises to do if they are elected: We campaigned on a platform of low taxation.\nMore examplesFewer examplesThe television has provided the evangelists with yet another platform for their proselytizing.This generous grant will provide a platform for new research and development.These kind of TV-shows provide the platform for opinionated people to express their views.the Labour party platforma strong gay rights platform\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nbreak\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nheadroom\niron\nit's now or never idiom\npass\nroom for manoeuvre idiom\nscope\nshop window\nsmell blood idiom\nthe American dream\nthe run of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIdeas, concepts and theories\nPolitics - general words\nplatform noun\n(COMPUTING)\n[ C ] the type of computer system or smartphone you are using, in relation to the type of software (= computer programs) you can use on it: This new personal banking software can be used with any Windows platform. Both Apple's iOS and Google's Android mobile platforms now have emoji keyboards built into their software.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\nCommunications - telephone equipment\nComputer programming & software\nIdiom\nshare a platform\n(of shoes) having a very thick high sole (= bottom part): She borrowed her mother's platform shoes. When I started high school, those huge platform sandals were all the rage.\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh heels\nhigh-top\nhiking boot\nhobnail\nhobnail boot\nrunning shoe\nsandal\nshoehorn\nshoelace\nshoemaker\nwedge\nwedgie\nwellie\nwellington\nwelly\nSee more results »\nAdd to word list\nAdd to word list\na flat, raised area or structure: We waited on the platform for the train to arrive from Boston.\nPoliticians’ or political parties’ platforms are the things they say they believe in and that they will achieve if they are elected: He campaigned on a platform of reducing taxes and cutting the costs of government.\nAdd to word list\nAdd to word list\nIT a particular computer technology that can be used with some types of software programs but not with others: Companies are creating standard platforms to collect and process massive amounts of data.a computer/technology/software platform CIM systems are the technology platform of this organization.\nCOMMUNICATIONS a method of communication or entertainment, for example television, radio, or the internet: We are currently selling advertisements across several different platforms - web, internet phones, and multiple sections of the newspaper.\nCOMMUNICATIONS a particular technology that is used for broadcasting television or radio programmes: The club has now set up its own television channel, aiming to launch a paid-for service on an existing broadcast platform before the year's end.\na set of actions or ideas that forms the basis for future development: a platform for sth Every euro spent on marketing and market development will provide a platform for long-term growth and profits.a strong/solid/sound platform The board believes that the group has a strong platform on which to grow.\nPOLITICS a set of ideas and plans that a politician or party promises to act on if elected: on a platform He won a decisive victory on a platform of economic reform. See also\ncross-platform\noil platform\ntrading platform"}