{"id":279034,"name":"player","type":"noun","us_sound":"ˈpleɪ.ɚ","us_link":"../audio/p/player.mp3","uk_sound":"ˈpleɪ.ər","uk_link":"../audio/p/ukplate026.mp3","content":"player noun [C]\n(GAME)\nAdd to word list\nAdd to word list\nA1 someone who takes part in a game or sport: Each player takes three cards. The team has many talented players.\nsomeone who is very involved in an activity or organization: She was a leading/key player in the reorganization of the health service.\nMore examplesFewer examplesHe's currently the best defensive player on the team.That was an impressive performance from such a young tennis player.A good snooker player takes time deciding which shot to play.She's the youngest player ever to get through to a semifinal.Some very high-profile British players have transferred to clubs abroad.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSupporters, members & defenders\nplayer noun [C]\n(ACTING)\nold use an actor\nThesaurus: synonyms, antonyms, and examples\nan actoractorHe is a celebrated Hollywood actor.actressLet’s take a closer look at this year's Academy Award nominees for Best Actress in a Leading Role.playerThey belong to the Littlehampton Players.thespianIt is a Saturday-morning acting group for budding thespians.luvvyThe luvvies were out in force for the awards ceremony.\nSee more results »\nused in the names of some theatre companies: the Shakespeare Players\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactor\nactress\nall-star\nalum\nbelly dancer\ncast\nchorus\nheadliner\nimproviser\njuvenile lead\nleading lady\nleading man\nperformer\nscream queen\nspear carrier\nstage name\nstarlet\nstooge\nsuperstar\ntroupe\nSee more results »\nplayer noun [C]\n(SOUNDS/PICTURES)\nA2 a person who plays a musical instrument: a recorder/piano player\nA2 a machine for playing music, sound, or pictures: a CD/DVD player\nSMART Vocabulary: related words and phrases\nMusicians\naccompanist\narranger\nartist\nbandleader\nbandmaster\ncrossover\ndrum major\ndrummer\nemcee\nfiddler\nmuso\nnon-musician\noboist\none-hit wonder\none-man band\nsight-reader\nsoloist\ntimpanist\ntrombonist\ntrumpeter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\nplayer noun [C]\n(PRODUCE SOUNDS/PICTURES)\nAdd to word list\nAdd to word list\nsomeone who plays a musical instrument: a cello/flute player\nA player is also a machine: a CD/record player\nplayer noun [C]\n(COMPETE)\nsomeone who takes part in a sport or game: This basketball team has a lot of talented players. fig. The company is one of the leading players (= organizations taking part) in the deal.\nAdd to word list\nAdd to word list\na company, organization, or person that has influence within a particular activity, industry, or type of work: a player in sth The organization used to be unique; today it is just another player in a cut-throat market.key/major/important player As chairman of the Finance Committee, she was a key player in the assembly's lengthy budget negotiations.global/industry player It may take another three to four years before the market stabilizes enough for global players to think about establishing new EU locations. See also\nmarket player\nteam player"}