{"id":278995,"name":"play","type":"verb","us_sound":"pleɪ","us_link":"../audio/p/play.mp3","uk_sound":"pleɪ","uk_link":"../audio/p/ukplate018.mp3","content":"play verb\n(ENJOY)\nAdd to word list\nAdd to word list\nA1 [ I ] When you play, especially as a child, you spend time doing an enjoyable and/or entertaining activity: The children spent the afternoon playing with their new toys. My daughter used to play with the kids next door.\nMore examplesFewer examplesChildren were playing on the village green.I'm not playing with him, he's not nice to me!Erik needed a good wash after playing in the garden all day.I asked Sophie if she wanted to come round and play with Isabel.It's nice to hear children playing in the street.\nSMART Vocabulary: related words and phrases\nChildren's games\nblind man's buff\nconker\ndingbat\ndouble Dutch\ndress-up box\ndressing-up box\nFrench cricket\ngo fish\nhide-and-seek\nhopscotch\njack\nmagnet fishing\nmarble\npainting\npainting by numbers idiom\npeekaboo\npig Latin\npiggy in the middle\npiggyback\nwarm\nSee more results »\nplay verb\n(GAME)\nA1 [ I or T ] to take part in a game or other organized activity: Do you want to play cards/football (with us)? Irene won't be able to play in the tennis match on Saturday. Which team do you play for? Luke plays centre-forward (= plays in that position within the team).\nB1 [ T ] to compete against a person or team in a game: Who are the Giants playing next week?\n[ T ] to hit or kick a ball in a game: He played the ball back to the goalkeeper. A good pool player takes time deciding which shot to play.\n[ T ] (in a card game) to choose a card from the ones you are holding and put it down on the table: She played the ace of spades.\nMore examplesFewer examplesThe children had an argument about what game to play.I usually play football with some of my mates from the office on Saturdays.We need a minimum of ten people to play this game.She was picked to play for the team.Susan is playing golf every day to try to improve her game.\nSMART Vocabulary: related words and phrases\nSports & games generally\nbattleship\nboard sport\nbuildering\nchoose\nchoose up sb/sth\nclassic\ncross-country\ndefensively\nhigh jinks\ninsurance\nland\nmulti-sport\nparasport\nparkour\npickup\npre-game\nsnooker\nsport\nthe first person\nTTRPG\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting in sport\nGeneral terms used in ball sports\nCard games\nplay verb\n(ACT)\nB1 [ I or T ] to perform an entertainment or a particular character in a play, film, etc.: Scottish Opera played to full houses every night. I didn't realize that \"Macbeth\" was playing (= being performed) at the festival. In the movie version, Branagh played the hero.\n[ T ] to behave or pretend in a particular way, especially in order to produce a particular effect or result: to play dead/dumb Would you mind playing host (= entertaining the guests)? play a joke/trick\nB2 to deceive someone to make them laugh or in order to get an advantage over them: She loves playing practical jokes on her friends. When I saw the gun, my first thought was that he must be playing a joke. He thought someone was trying to play a joke on him when he received the email. One spring, his students played a trick on him by hiding his books. Sometimes our nervous system can play nasty tricks on the body. play a part\nB2 to help to achieve something: My thanks to everyone who has played a part in saving the hospital. Better sanitation helped to eradicate malaria, but DDT also played a part. The government wants us all to play a part in fighting terrorism. Some of the people who will play a part in rebuilding the country are returning there for the first time in decades.\nMore examplesFewer examplesVargas plays the part of treacherous aristocrat who betrays his king and country.In the movie, he plays a concerned and sensitive father trying to bring up two teenage children on his own.She plays the part of the sexy blonde waitress.In British pantomimes a man dresses up as the Dame and a woman plays the part of the young hero.Not so long ago Viviana was a little-known actress playing in a provincial theatre.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappearance\nblocking\ncamp\ncamp it up\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving, interacting and behaviour\nCheating & tricking\nHelping and co-operating\nplay verb\n(PRODUCE SOUNDS/PICTURES)\nA2 [ I or T ] to perform music on an instrument or instruments: He learned to play the clarinet at the age of ten. [ + two objects ] Play us a song!/Play a song for us! On Radio London they play African and South American music as well as rock and pop. They could hear a jazz band playing in the distance.\nA2 [ I or T ] to (cause a machine to) produce sound or a picture: Play the last few minutes of the video again.\nMore examplesFewer examplesJean plays the guitar and her brother is on percussion.Suddenly, cymbals crashed and the orchestra began playing.I'm playing in a concert at the church hall next weekend.I've asked them not to play their music so loudly, but they're not being very cooperative.The family all play instruments - they're all very musical.\nSMART Vocabulary: related words and phrases\nPlaying music\naccompaniment\naccompany\nair guitar\nbeat something out\nbeatbox\nblow\npick\npick someone/something out\npitch\nplay (something) by ear idiom\nplayability\nplayable\npump\ntap\nthrow\ntickle the ivories idiom\ntranspose\ntransposition\nultra-smooth\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nUsing and misusing\nplay verb\n(MOVE)\n[ I or T ] to direct or be directed over or onto something: Firefighters played their hoses onto the base of the fire. A fountain was playing (= sending out water) in the courtyard outside.\n[ I + adv/prep ] (of something you see, such as light) to move quickly or be seen for a short time: A smile played across/over/on his lips.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nplay verb\n(RISK MONEY)\n[ T ] to risk money, especially on the results of races or business deals, hoping to win more money: He plays the horses/the stock market.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nIdioms\nbe playing at something\ngo play with yourself!\nhave it all to play for\nhave something to play with\nplay big\nplay the race, gender, etc. card\nplay someone at their own game\nplay your cards right\nplay (something) by ear\nplay it by ear\nMore idioms\nplay (merry) hell with something\nplay (it) safe\nplay it straight\nplay a joke/trick on someone\nplay ball\nplay both ends against the middle\nplay fair\nplay footsie\nplay for time\nplay games\nplay God\nplay hard to get\nplay hardball\nplay it cool\nplay possum\nplay sb on\nplay second fiddle\nplay silly buggers\nplay small\nplay the field\nplay the game\nplay the system\nplay to the gallery\nplay to the whistle\nPhrasal verbs\nplay along\nplay around\nplay around with something\nplay at something\nplay something back\nplay something down\nplay off\nplay someone/something off against someone/something\nplay on\nplay on/upon something\nMore phrasal verbs\nplay something out\nplay itself out\nplay out\nplay something up\nplay (someone) up\nplay up\nplay up to someone\nplay with something\nplay with yourself\nplay noun\n(ACTING)\nA2 [ C ] a piece of writing that is intended to be acted in a theatre or on radio or television: a radio play \"Did you see the play (= the performance of the play) on Thursday?\" \"No, I went on Wednesday night.\"\nMore examplesFewer examplesHe's got a small part in the school play.In Shakespeare's play 'Twelfth Night', Duke Orsino falls in love with the disguised Viola.During certain scenes of the play there isn't any script and the actors just improvise.The play will be performed first in London, and will then tour the rest of the country.His latest play has delighted theatre audiences and theatre critics alike.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nsuperheroine\nswashbuckler\nsympathetically\ntanka\ntartan noir\nSee more results »\nplay noun\n(GAME)\n[ U ] the activity of taking part in a sport or a game: Rain stopped play during the final of the National Tennis Championship.\n[ C ] US a plan or a small set of actions in a sport: The new pitcher made a great play on that throw to first base. in play\nIf a ball is in play, it is in a position where it can be hit, kicked, or thrown: She managed to keep the ball in play. The referee let the game carry on as the ball was in play. The match was very broken, with the ball in play for a total of only 41 minutes. out of play\nIf a ball is out of play, it is not in a position where it can be hit, kicked, or thrown: The ball had gone out of play. In tennis, the ball is out of play if it goes outside the lines or bounces more than once.\nMore examplesFewer examplesBy the end of the day's play Davies had a lead of three points.There was some truly magnificent play in the third set of the match.Play will resume here at Wimbledon at 2 p.m. tomorrow.Could it be that the champion is allowing his personal problems to affect his play?We've seen some very untidy play from both teams since half-time.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nsquare\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSports & games generally\nGeneral terms used in ball sports\nplay noun\n(ENJOYMENT)\nB2 [ U ] activity that is not serious but done for enjoyment, especially when children enjoy themselves with toys and games: The kids don't get much time for play in the evenings. We watched the children at play in the park.\nSMART Vocabulary: related words and phrases\nGeneral words for fun\namusement\ncrack\ncraic\nfling\nfun\ngas\ngiggle\nhoopla\nhorseplay\njollification\njollity\nlaugh\nlolz\nmerriment\nriot\nrough\nrough and tumble idiom\nsesh\nsport\nwhimsy\nplay noun\n(MOVEMENT)\n[ U ] movement: the play of moonlight across the water the play of emotion across/on his face\n[ U ] the fact that a rope or a structure is free to move, especially a small distance: Aircraft wings are designed to have a certain amount of play in them.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlexible, loose and yielding\nGrammar\nPlay or game?Play as a noun means ‘a piece of dramatic writing for the theatre or radio or television’: …\nPlayPlay as a noun means ‘a piece of dramatic writing for the theatre or radio or television’: …\nGameGame is a noun. We use it to talk about sports or other entertaining activities: …\nIdioms\ncome into play\ngive/allow something full play\nmake a play for something/someone\nplay on words\nplay verb\n(ENJOY)\nAdd to word list\nAdd to word list\n[ I ] to spend time doing something enjoyable or amusing: The children spent the afternoon playing.\nplay verb\n(COMPETE)\n[ I/T ] to take part in a game or other organized activity: [ T ] He loves playing football. [ I ] What team does she play for?\n[ I/T ] If you play a person or team, you compete against them: [ T ] We’re going to the stadium to see New York play Chicago.\n[ I/T ] If you play the ball or a shot, you hit or kick the ball: [ T ] In golf, you have to take time to decide how to play difficult shots.\n[ I/T ] In a card game, to play a card is to choose it from the ones you are holding and put it down on the table.\nplay verb\n(ACT)\nto perform as a character in a play or movie, or (of a performance) to be shown: [ T ] She played the part of a beautiful and brilliant scientist. [ I ] What’s playing at (= being shown at) the local movie theaters?\nTo play is also to behave or pretend in a particular way, esp. to produce an effect or result: [ L ] Don’t play dumb with me (= pretend you don’t know anything) – you know very well what happened!\nTo play can mean to influence or have an effect on: [ T ] The president denied that politics played any part in his decision to appoint a woman to the Supreme Court. play a joke on someone (also play a trick on someone)\nTo play a joke on someone or play a trick on someone is to deceive someone for amusement or in order to get an advantage: She loves to play jokes on her friends.\nplay verb\n(PRODUCE SOUNDS/PICTURES)\n[ I/T ] to perform music on an instrument, or to cause something that produces sound or a picture to operate: [ I/T ] She plays (the piano) beautifully. [ T ] I was just playing my stereo. I learned how toplay the guitar by ear (= by listening rather than by reading music).\nplay verb\n(RISK MONEY)\n[ T ] to risk money, esp. on the results of races or business deals, hoping to win money: He plays the stock market. Idioms\nplay ball\nplay your cards right\nplay games\nplay hardball\nplay havoc with\nplay hooky\nplay it by ear\nplay it safe\nplay with firePhrasal verbs\nplay along\nplay around\nplay back something\nplay down something\nplay up\nplay up something\nplay with something\nplay noun\n(ACT)\n[ C ]\n&#160; literature a story that is intended to be acted out before people who have come to see it: She starred in many Broadway plays in her career.\nplay noun\n(COMPETE)\nin play (also out of play)\nIf a ball or something else is in play, it is in a position where it can be used as part of the regular action in a game or sport, and if it is out of play, it is not in such a position: [ U ] She put the ball in play in midfield.\nIn sports, a play can also be a particular action or a plan for a specific set of actions: [ C ] The school football team has been practicing new plays all week. Idiom\na play on words\nhave money/time, etc. to play with\nAdd to word list\nAdd to word list\nto have money, time, etc. available to use: Swelling tax receipts have given the government more money to play with over the last two years.\nplay by the rules\nto obey the rules of a particular system: Workers should not be relegated to poverty if they work hard and play by the rules.\nplay by your own rules\nto do things in the way that you want, rather than obeying the rules of a particular system: Large multinational corporations often play by their own rules.\nplay catch up\nto try to be as successful as other people, companies, etc.: The firm has adapted quickly to changes in the global market, leaving its rivals to play catch up.\nplay for high stakes\nto take big risks in order to achieve something that you really want: The Prime Minister is playing for high stakes, at the risk of alienating public opinion.\nplay (it) safe\nto decide not to take risks: The federal government often plays it safe by funding research that is likely to succeed but may have only a slight impact. The biggest companies usually play safe and hire top legal firms from London or New York.\nplay the (money/stock) market\nFINANCE to trade shares, bonds, etc., especially in order to make money quickly, rather than to invest over a longer period: Spread betting companies offer an opportunity for private individuals to play the stock market.\nplay a key/major/important role/part (in sth) (also have a key/major/important role/part to play (in sth))\nto have a lot of power or influence in a particular situation: His financial expertise played a major role in London City airport's development. IT had a key part to play in modernizing the organization.\nplay the system\nto use a set of rules or laws in order to get an advantage for yourself, in a way that may not be fair: If you know how to play the system, there are various legal loopholes to be exploited.\nplay to your strengths\nto do things that you know you are good at: In business, you sometimes have to follow your instincts and play to your strengths. See also\nPlug-and-Play nounPhrasal verbs\nplay sth back\nplay sth down\nplay out\nplay sth up\n[ C ]\n&#160; FINANCE the act of trading shares, bonds, etc.: Institutional investors remained on the sidelines, refusing to make any big plays until a definite announcement is made.\nbe at play\nto have an influence in a situation: Many issues are at play here, including the impact on the environment.\nbe in play\nFINANCE if a company or its shares are in play, they may be bought by other companies or shareholders: In a corporate-driven deal environment, even \"untouchable\" bank stocks could be in play.\nbring/call sth into play\nto start to use something for a particular purpose: Special computer software programs were brought into play during the vote recount.\ncome into play\nto begin to have an influence on something: New federal pension laws have come into play that could affect the retirement security of many of our employees.\nmake a play for sth\nto try to get control of something: The government has been accused of making a play for online betting tax revenues. See also\nrole play"}