{"id":279916,"name":"please","type":"exclamation","us_sound":"pliːz","us_link":"../audio/p/please.mp3","uk_sound":"pliːz","uk_link":"../audio/p/ukplayg022.mp3","content":"Add to word list\nAdd to word list\nA1 used to make a request more polite: Could I have two coffees and a tea, please? Please remember to close the windows before you leave.\nused to add force to a request or demand: Please, David, put the knife down. Oh, please. Do shut up!\nUK used especially by children to a teacher or other adult in order to get their attention: Please, Miss, I know the answer!\nA1 used when accepting something politely or enthusiastically: \"More potatoes?\" \"Please.\" \"May I bring my husband?\" \"Please do.\" \"Would you like dessert?\" \"Oh, yes please.\"\nMore examplesFewer examplesFor further information, please contact your local library.Can you pass the salt please?Come on children, stop chatting and settle down please!\"Would you like a glass of wine?\" \"Yes please.\"Someone's at the door - would you answer it please?\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\nmagic word\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon (me) idiom\nproblem\nsay\nthank you\nwelcome\nwonder\nwould\nyou're welcome idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\nWords & phrases expressing agreement & acceptance\nGrammar\nPlease and thank youPlease and thank you are usually associated with politeness. We use them a lot in English. …\nPleaseWe use please to make a request more polite: …\nThank you and thanksWe use expressions with thank you and thanks to respond to something politely and to show we are grateful for something. Thanks is more informal than thank you. We often add other words to make the response stronger: …\nB1 [ I or T ] to make someone feel happy or satisfied, or to give someone pleasure: I only got married to please my parents. He was always a good boy, very friendly and eager to please. [ + obj + to infinitive ] It always pleases me to see a well-designed book!\nC2 [ I ] to want, like, or choose, when used with words such as \"whatever\", \"whoever\", and \"anywhere\": She thinks she can just do whatever/as she pleases. I shall go out with whoever I please. if you please\nmainly UK formal used to express surprise and anger: They want £200, if you please, just to replace a couple of broken windows!\nold-fashioned or formal used to make a request more polite: Take your seats, ladies and gentlemen, if you please.\nSee more\nMore examplesFewer examplesIt would please Granny no end if you wrote to her occasionally.I'll give you a key then you're free to come and go as you please.He's a hard man to please.I don't care about fashion - I dress how I please.My niece is impossible when she's tired - you can't do anything to please her.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomely\nhomey\nindulgent\nindulgently\njovial\nsensually\nsensuous\nsensuously\nserendipitous\nsweeten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiking\nIdioms\nplease God\nplease yourself\nplease exclamation\n(POLITE REQUEST)\nAdd to word list\nAdd to word list\ncommonly used in order to make a request more polite, or, sometimes, to make it stronger or urgent: Could I please have some ketchup for my hamburger? Please be sure to take all your personal belongings when you leave the train. Please do as I say and don’t ask questions. \"Would you like some more salad?\" \"Please (= yes, I would).\"\nplease verb [I/T]\n(MAKE HAPPY)\nto make someone feel happy or satisfied, or to give someone pleasure: [ I/T ] He did what he could to please her, but she was hard to please. [ T ] I’m pleased to report that sales have increased by 15%. [ I ] She’ll listen to what you say, but in the end she’ll do as/what she pleases (= what she wants to do)."}