{"id":279883,"name":"plea","type":"noun","us_sound":"pliː","us_link":"../audio/p/plea.mp3","uk_sound":"pliː","uk_link":"../audio/p/ukplayg013.mp3","content":"plea noun [C]\n(REQUEST)\nAdd to word list\nAdd to word list\nC2 formal an urgent and emotional request: He made a plea for help/mercy. Synonyms\nappeal\nentreaty\nprayer\nrequest\nMore examplesFewer examplesThey made a desperate plea for help.The president has made an emotional plea for the killing to stop.Relatives of the dead made an impassioned plea for the bodies to be flown back to this country.The child's mother made a passionate plea for help.Aid organizations are making an urgent plea for financial assistance.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nplea noun [C]\n(STATEMENT)\nlaw\n&#160; specialized the answer that a person gives in court when they have been accused of committing a crime: Mr Wilson entered a plea of not guilty.\nMore examplesFewer examplesThe prisoner entered a plea of not guilty.Her plea of ignorance of the law in extenuation of her crime was not accepted.The judge is not likely to look favourably on a plea of not guilty.His plea of guilty to manslaughter was not accepted by the prosecution.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nplea noun [C]\n(REQUEST)\nAdd to word list\nAdd to word list\nan urgent and emotional request: The president made a strong plea to Congress to vote on the health-care bill.\nplea noun [C]\n(STATEMENT)\nlaw the answer that a person gives in court to the accusation of having committed a crime: He received a sentence of 5 to 10 years for his guilty plea to the robbery charge.\nAdd to word list\nAdd to word list\nLAW a statement made by someone in a court of law in which they say if they are guilty of something that they are accused of: a guilty/not guilty plea The guilty plea will mark the second time in eight years that the oil company has been convicted of a federal environmental crime in Alaska.a plea of guilty/not guilty She entered a plea of not guilty in federal court Friday to multiple extortion and bribery charges.enter/withdraw a plea Recent reforms will allow them to enter a plea of diminished political responsibility."}