{"id":279889,"name":"plead","type":"verb","us_sound":"pliːd","us_link":"../audio/p/plead.mp3","uk_sound":"pliːd","uk_link":"../audio/p/ukplayg014.mp3","content":"plead verb\n(REQUEST)\nAdd to word list\nAdd to word list\nC2 [ I ] to make an urgent, emotional statement or request for something: He was on his knees, pleading for mercy/forgiveness. She appeared on television to plead with the kidnappers. [ + speech ] \"Give us more time,\" they pleaded. Synonyms\nadjure formal\nappeal (REQUEST)\nbeg\nbeseech old use or literary\nentreat\nThesaurus: synonyms, antonyms, and examples\nto beg for something or beg someone to do something begHe begged her to stay, but she wouldn't listen.imploreI implore you to change your mind.plead withHe pleaded with the guards to be allowed to see his daughter.appeal toI appeal to the public to remain calm.entreatThe banners entreated the government to release the prisoners.adjureThe gospel adjures us to love one another.\nSee more results »\nMore examplesFewer examplesHer voice was breaking with emotion as she pleaded for her child's return.The prisoners pleaded for mercy.She got what she wanted by dint of pleading and threatening.'Please, let the children go!' she pleaded.She pleaded with him to change his mind, but he refused to listen.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nticket\nSee more results »\nplead verb\n(STATE)\nC2 [ I, L only + adj, T ]\n&#160; law\n&#160; specialized to make a statement of what you believe to be true, especially in support of something or someone or when someone has been accused in a law court: The defendant pleaded not guilty/innocent to robbery with violence. They paid a high-powered attorney to plead their case (= argue for them in court). The judge ruled her unfit to plead (= to answer a legal charge) on the grounds of insanity.\nMore examplesFewer examplesShe pleaded her innocence, but no one believed her.The accused pleaded not guilty on grounds of diminished responsibility.He did not have to pay his speeding fine because he pleaded diplomatic immunity.The judge won't look favourably on her if she pleads not guilty.You stand accused of murder, how do you plead?\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAssertions & asserting\nplead verb\n(EXCUSE)\nC2 [ T ] to say something as an excuse or explanation: She left early, pleading pressure of work. plead ignorance formal\nto say that you do not know about something: He pleaded ignorance when they found the package in his suitcase.\nSee more\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nRelated words\npleading\npleadingly\nplead verb\n(REQUEST)\nAdd to word list\nAdd to word list\n[ I ] to make an urgent, emotional statement or request for something: She appeared on television to plead for help in finding her child.\nplead verb\n(STATE)\n[ T ] fml to give an official answer to an accusation in a law court: to plead guilty/not guilty\nAdd to word list\nAdd to word list\nLAW to say in a court of law if you are guilty or not guilty of something that you have been accused of: plead guilty/not guilty to sth They pleaded guilty to price-fixing and paid a $45 million fine."}