{"id":280022,"name":"pledge","type":"noun","us_sound":"pledʒ","us_link":"../audio/p/pledge.mp3","uk_sound":"pledʒ","uk_link":"../audio/p/ukplebb008.mp3","content":"Add to word list\nAdd to word list\na serious or formal promise, especially one to give money or to be a friend, or something that you give as a sign that you will keep a promise: [ + to infinitive ] All the candidates have given/made pledges not to raise taxes if they are elected. Thousands of people made pledges (= promised to give money) to the charity campaign. I give you this ring as a pledge of my everlasting love for you. Synonyms\nassurance (PROMISE)\nbond (PROMISE)\ncommitment\nguarantee\noath (PROMISE)\npromise (SAY CERTAINLY)\nundertaking (PROMISE) formal\nvow\nword (PROMISE)\nMore examplesFewer examplesThe couple will exchange rings as a pledge of their love for one another.We've received pledges of more than ten thousand pounds to help pay for repairs to the church.You can go online to make a pledge to the disaster relief fund.The government has made a pledge never to make deals with terrorists.Godparents make a pledge of support to the child's parents.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nIdiom\ntake/sign the pledge\nto make a serious or formal promise to give or do something: We are asking people to pledge their support for our campaign. If you join the armed forces, you have to pledge allegiance to your country. So far, £50,000 has been pledged (= people have promised to pay this amount) in response to the appeal. [ + to infinitive ] Both sides have pledged to end the fighting. I've been pledged to secrecy.\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nMore examplesFewer examplesThe government has pledged to reduce the amount of chemicals used in food production.The president pledged to respect the existing frontiers between the two countries.He pledged undying love/loyalty.The minister has pledged his whole-hearted support for the scheme.Both Britain and the United States are pledging their support for the campaign.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nAdd to word list\nAdd to word list\na formal promise, or something that is given as a sign that you will keep a promise: a pledge of friendship The telethon raised $150,000 in pledges for leukemia research.\nAdd to word list\nAdd to word list\nto make a formal promise to do something: pledge to do sth The UK chief executive has pledged to slash costs by £150m a year by 2014.pledge $32m/£100,000, etc. to/for sth EU leaders pledged $1.2 billion to the region over the next 18 months.pledge that sth He pledged that a reduction in the burden of taxation will become the central economic objective of the government.\nLAW to give something valuable to a person or organization that has lent you money, which they can keep if you fail to pay back the loan: pledge sth as collateral/security Shares are frequently pledged as collateral for loans.\na formal promise to do something: a campaign/election/manifesto pledgea pledge to do sth Analysts warn that OPEC's pledge to ramp up oil production in order to ease record crude prices will not have the desired effect.make/honour/sign a pledge Campaigners have accused Congress of failing to honour its US funding pledges.a pledge that sth Their goal of increasing electricity production from renewables by 40% has been reinforced by a pledge that they will not support further development of nuclear power.\nLAW something valuable that is given to a person or organization that has lent you money, which they can keep if you fail to pay back the loan: Serious financial irregularities took place, including the pledge of already paid-for securities."}