{"id":280068,"name":"pleistocene","type":"adjective","us_sound":"ˈplaɪ.stoʊ.siːn","us_link":"../audio/p/eus73602.mp3","uk_sound":"ˈplaɪ.stə.siːn","uk_link":"../audio/p/ukplebb009.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between around 1.8 million and 11,000 years ago, in which modern humans first appeared, and the Northern Hemisphere experienced an ice age: the Pleistocene epoch These are thought to be Pleistocene rocks.\nMore examplesFewer examplesDid a giant prehistoric ape die out in the Pleistocene epoch or do we know it today as Bigfoot?No lacustrine records from the region were yet available to provide insight into late Pleistocene vegetation or climate.The geological strata dates back to the Pleistocene age from around 2 million years ago.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Pleistocene\nthe period of time between around 1.8 million and 11,000 years ago, in which modern humans first appeared, and the Northern Hemisphere experienced an ice age: The islands have existed since the Pleistocene. The carbon crisis is shaping up as the biggest potential disaster since the start of the Pleistocene .\nMore examplesFewer examplesThe landscape is stark and treeless, punctuated by towering stacks of boulders that glaciers left behind after the Pleistocene.Even the early human populations of the region were capable of decimating the large animals that were heading for extinction at the end of the Pleistocene.The Clovis times go back to the end of the Pleistocene when the last Ice Age occurred.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}