{"id":280114,"name":"plenty","type":"pronoun","us_sound":"ˈplen.t̬i","us_link":"../audio/p/eus73605.mp3","uk_sound":"ˈplen.ti","uk_link":"../audio/p/ukplebb014.mp3","content":"Add to word list\nAdd to word list\nB1 (the state of having) enough or more than enough, or a large amount: \"Would you like some more wine?\" \"No thanks, I've had plenty.\" Don't grab at the balloons, children - there are plenty for everyone. We've got plenty of time before we need to leave for the airport. They've always had plenty of money. There's plenty to do here.US informal This car cost me plenty (= a lot of money). There's plenty more beer in the fridge.\nMore examplesFewer examplesIf you have a fever you should drink plenty of fluids.Eat healthily and take plenty of exercise.\"There's plenty more cake if you'd like another piece.\" \"I don't mind if I do.\"There's plenty of cupboard space in the kitchen for all your pots and pans.What's the hurry? We've got plenty of time.\nSMART Vocabulary: related words and phrases\nPlenty and abundant\nabound\nabound in/with something\nabundance\nabundant\nabundantly\ndrip\ngenerous\ngenerously\nhandsomely\nhealthily\nin abundance\nlavish\nluxuriant\nplenteous\nplenteously\nplentiful\nplentifully\nprofuse\nrichly\nwell off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nToo much and unnecessary\nGrammar\nLots, a lot, plentyWe use lots, a lot and plenty in informal styles to talk about quantities, amounts and degree. Lots and a lot are similar in meaning to much and many. Plenty means ‘enough’ or ‘more than enough’. Lots is even more informal than a lot: …\nPlentyWe use plenty as a pronoun to mean ‘enough’ or ‘more than enough’: …\nPlenty as a pronounWe use plenty as a pronoun to mean ‘enough’ or ‘more than enough’: …\nPlenty of as a quantifierWe use plenty of as a quantifier before both countable and uncountable nouns to mean ‘a lot’, ‘a large quantity’: …\nPlenty: typical errorsTake care to spell plenty correctly: not ‘planty’. …\nIdiom\nbe plenty more where someone/something came from\nAdd to word list\nAdd to word list\nan amount or supply that is enough or more than enough, or a large number or amount: This car has plenty of power. I didn’t eat them all – there’s plenty left for you. infml This car cost me plenty (= a lot of money). Have another sandwich – there’s plenty more where that came from (= a lot more available). plentiful adjective us\nYour browser doesn't support HTML5 audio\n/ˈplen·tɪ·fəl/\nStrawberries are in plentiful supply this year. plenty adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈplen·ti/\ninfml He was plenty mad."}