{"id":280356,"name":"pliancy","type":"noun","us_sound":"ˈplaɪ.ən.si","us_link":"../audio/p/uspleur004.mp3","uk_sound":"ˈplaɪ.ən.si","uk_link":"../audio/p/ukplebb020.mp3","content":"pliancy noun [U]\n(ABILITY TO CHANGE)\nAdd to word list\nAdd to word list\nwillingness to change because of what other people want, or to do what other people want: His plan depended on her pliancy and submission.\nthe good quality of being able to change or to be used in different ways: the remarkable purity and pliancy of his voice\nMore examplesFewer examplesHe had noticed that after people show pliancy and submissiveness they soon become demanding and aggressive.The judge was known as \"Dr. Yes\" for his pliancy in giving legal opinions that supported the government's actions.Elizabeth had more quickness of observation and less pliancy of temper than her sister.Mark's pliancy—he is happy to switch beer for roasted vegetables—means he takes the doctor's advice easily.She commended his ease and pliancy and natural grace in society.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshaky\nsitting duck\nsitting target\nsoft target\nsofty\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdapting and modifying\npliancy noun [U]\n(ABILITY TO BEND)\nthe quality of being able to bend easily without being damaged or losing its shape: The new technology has enabled scientists to produce display screens of incredible pliancy. The dancers' bodies have a pliancy that a snake would envy. See\npliant\nMore examplesFewer examplesHer skin still has its girlish pliancy. Soft carbonation adds to the pliancy of the dough—it yields but doesn’t give.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\nfullness\njointed\nlimply\nlimpness\npliantly\nrelax\nrubbery\nsemi-flexible\nslacken\ntensile\nunstayed\nunstuck\nyielding\nSee more results »"}