{"id":280433,"name":"pliocene","type":"adjective","us_sound":"ˈplaɪ.oʊ.siːn","us_link":"../audio/p/eus75872.mp3","uk_sound":"ˈplaɪ.ə.siːn","uk_link":"../audio/p/ukplebb027.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between around 5.3 million and 1.8 million years ago, in which many modern mammals and the first modern humans appeared: Whitney concluded the skull was Pliocene, evidence that humans occupied North America more than 1 million years ago. In the Pliocene era the Valdarno was a vast lake, its shores patrolled by troops of prehistoric elephants.\nMore examplesFewer examplesThe section on prehistoric man dating back to the middle Pliocene age is very informative.Toward the end of the Pliocene epoch 2-3 million years ago, the earth's coldest environments were alpine.The earliest fossil evidence for the Homininae is based on fragments of jaw from latest Miocene to Pliocene deposits in Africa.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Pliocene\nthe period of time between around 5.3 million and 1.8 million years ago, in which many modern mammals and the first modern humans appeared: the end of the Pliocene Their comparative scarcity at the present time probably results from climatic changes in the Pliocene.\nMore examplesFewer examplesThese aquatic mammals were apparently more abundant from the Oligocene to the Pliocene than they are now.At the beginning of the Pliocene, the Strait of Gibraltar opened again, according to Hsu, as a fantastic cataract through which a catastrophic deluge refilled the Mediterranean.A low-range optimistic estimate of 2°C of 21st century warming will shift the Earth’s global mean surface temperature into conditions which have not existed since the middle Pliocene, 3 million years ago.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}