{"id":280497,"name":"plot","type":"noun","us_sound":"plɑːt","us_link":"../audio/p/plot.mp3","uk_sound":"plɒt","uk_link":"../audio/p/ukplodd006.mp3","content":"plot noun [C]\n(STORY)\nAdd to word list\nAdd to word list\nB2 the story of a book, film, play, etc.: The movie has a very simple plot. The plots of his books are basically all the same.\nMore examplesFewer examplesThe movie's plot hinges on a case of mistaken identity.It takes a fair amount of concentration to follow the movie's labyrinthine plot.There are so many different strands to the plot that it's quite hard to follow.There's an unexpected twist in/to the plot towards the end of the movie.I enjoyed the movie, but I couldn't follow all the intricacies of the plot.\nSMART Vocabulary: related words and phrases\nAccounts and stories\nanecdote\nanother\nanti-narrative\nbe another story idiom\nbodice-ripper\nbrushstroke\ncautionary tale\ncommentary\nlore\nmisdescription\nmulti-stranded\nmyth\nmythic\nscenario\nsemi-legendary\nshaggy-dog story\nshort story\nsleeping beauty\nstrand\nwrite something up\nSee more results »\nplot noun [C]\n(PLAN)\na secret plan made by several people to do something that is wrong, harmful, or not legal, especially to do damage to a person or a government: The plot was discovered before it was carried out. [ + to infinitive ] The police have foiled a plot to assassinate the president.\nMore examplesFewer examplesa devilish plotThey uncovered a plot to destabilize the government.The conspirators' plot failed because they made two fatal miscalculations.Guy Fawkes was executed for treason after he took part in a plot to blow up the British Parliament building.It was in August of 1978 that the Bolton brothers hatched their plot to kill their parents.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theorist\nconspiracy theory\nconspirator\nconspire\nentrap\nhatch\ninsinuate\nplotter\nploy\npretext\npretextual\nput-up job\nscheme\nsting\nwheeze\nSee more results »\nplot noun [C]\n(GROUND)\nC2 a small piece of land that has been marked or measured for a particular purpose: a vegetable plot There are several plots of land for sale.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\necoregion\nenclosure\nground\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntransect\nSee more results »\nplot noun [C]\n(DIAGRAM)\nUS a diagram or chart\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nIdiom\nthe plot thickens\nplot verb\n(MARK)\n[ T ] to mark or draw something on a piece of paper or a map\n[ T ] to make marks to show the position, movement, or development of something, usually in the form of lines or curves between a series of points on a map or piece of paper: Radar operators plotted the course of the incoming missile. We've plotted our projected costs for the coming year, and they show a big increase.\nSMART Vocabulary: related words and phrases\nMaps & map-making\natlas\ncartographer\ncartographic\ncartographically\ncompass rose\ncontour\ncontoured\ncontouring\ncoordinate\nelevation\nisobar\nisotherm\nmeridian\nos\npt\nreplot\nresurvey\nroad map\nsurvey\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTables, graphs & diagrams\nplot verb\n(PLAN)\n[ I or T ] to make a secret plan to do something wrong, harmful, or illegal: The army is plotting the overthrow of the government. I can't believe that he's plotting against his own father. [ + to infinitive ] They're plotting (together) to take over the company.\n[ T ] humorous to make a secret plan to do something funny or enjoyable to or for someone: [ + to infinitive ] They're plotting to play a trick on their brother. He's plotting a surprise party for his wife's birthday.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theorist\nconspiracy theory\nconspirator\nconspire\nentrap\nhatch\ninsinuate\nplotter\nploy\npretext\npretextual\nput-up job\nscheme\nsting\nwheeze\nSee more results »\nplot verb\n(STORY)\n[ T ] to write the plot for something: So far I've only plotted (out) the story in a rough form.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nplot noun [C]\n(SECRET PLAN)\nAdd to word list\nAdd to word list\na secret plan to do something that is wrong, harmful, or illegal: The police discovered a plot to rob the bank.\nplot noun [C]\n(STORY)\nliterature the plan or main story of a book, film, play, etc.: The novel has a complicated plot that is sometimes difficult to follow.\nplot noun [C]\n(GROUND)\na small piece of land that has been marked or measured for a particular purpose: a garden plot\nplot verb\n(MARK)\n[ T ]\n&#160; mathematics to mark a paper or use a computer to show the position of a number or represent a solution to an equation (= mathematical statement) and create a graph (= drawing)\n[ T ] To plot something is also to mark or draw lines showing a route on a piece of paper or a map, or to put numbers on a piece of paper to show how amounts are related: He plotted a course between Hawaii and Tahiti. We measured and plotted the amounts of chemicals that were released in the countryside.\nAdd to word list\nAdd to word list\nPROPERTY a small piece of land that is intended for a particular purpose: The building plot was valued at £160,000. We are planning to develop a plot of land adjacent to the park.\nto mark or draw something on a piece of paper or a map: The software system makes it possible to plot the exact location of sales vehicles.\nGRAPHS &amp; CHARTS to make marks to show the position, movement, or development of something, usually in the form of lines or curves between a series of points on a piece of paper: We provide a two-dimensional graph where you can plot the current location of your organization and then identify the desired point to which you would like the organization to move.\nto make a secret plan to do something: The French building materials giant is plotting a £3bn bid for the troubled UK cement maker."}