{"id":280634,"name":"plug","type":"noun","us_sound":"plʌɡ","us_link":"../audio/p/plug.mp3","uk_sound":"plʌɡ","uk_link":"../audio/p/ukplodd017.mp3","content":"plug noun [C]\n(ELECTRICAL)\nAdd to word list\nAdd to word list\nB1 a small plastic or rubber object with two or three metal pins, attached to the end of a wire on a piece of electrical equipment and pushed into a special opening in a wall to connect the equipment to a supply of electricity: a three-pin/two-pin plug to fit/change a plug If a plug is wired incorrectly, it can be dangerous.\nFotonen/iStock/Getty Images Plus/GettyImages\nmainly UK informal an electric socket: Is there a plug in the bedroom that I can use for my hairdryer?\n4FR/iStock/Getty Images Plus/GettyImages\nUS (UK jack plug) a metal pin at the end of a long wire joined to a piece of electrical equipment and used to connect it to another piece of electrical equipment\nTevarak/iStock/Getty Images Plus/GettyImages\ninformal for\nspark plug\nMore examplesFewer examplesIt's no wonder your shaver isn't working. There's a loose connection in the plug.This cable should have a plug at one end and a socket at the other.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe engine & engine parts\nplug noun [C]\n(FOR HOLE)\nB1 a small piece of rubber, plastic, wood, etc. that fits into a hole in order to close it See also\nearplug\nB1 a round piece of rubber or plastic that fits into the hole in a sink or a bath: a bath plug Put the plug in the sink and run some water.\nmsg-s/iStock/Getty Images Plus/GettyImages\na small piece of plastic or wood that you put into a hole in a wall before putting a screw into it\na small piece of material such as cotton wool, twisted or pressed tightly so it is firm\nSMART Vocabulary: related words and phrases\nLids, covers and stoppers\nbezel\nbottle cap\nbottle top\ncoozy\ncosy\ncrystal\njacket\nKoozie\nlid\nliner\nnozzle\npen lid\npiano lid\nsleeve\nstopper\nstubby holder\ntab\ntea cosy\ntight-fitting\nzarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBathroom fixtures & fittings\nTools\nMedical dressings, supports & devices\nplug noun [C]\n(PLANT)\n(UK also plug plant); (US also starter plug) a very small, young plant in a small amount of soil, often sold in a container with sections that each contain a plant: You can raise seed as plugs this summer and introduce the plants into the garden in the autumn. Look out for plug plants in garden centres.\nSMART Vocabulary: related words and phrases\nTypes of plant\nacanthus\nair plant\namaranth\nAndromeda\nangiosperm\nearly\nemergent\nevergreen\nfiddlehead\ngrower\nmoss\nmossy\nmugwort\nmustard\nnon-hardy\nspiderwort\nspleenwort\nstarter plug\nsucculent\nsundew\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nplug noun [C]\n(ADVERTISEMENT)\nthe act of telling people publicly about a product, event, etc.: She never misses an opportunity to get in a plug for her new film.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nplug verb [T]\n(ADVERTISE)\nto advertise something by talking about it a lot or praising it, especially on the radio or television: That interview was just a way for him to plug his new book. They're plugging this new chocolate bar everywhere at the moment.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nplug verb [T]\n(SHOOT)\nUS slang to shoot someone with a gun: Sure, boss, we plugged the guy (full of lead).\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngo off\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\nplug verb [T]\n(FILL HOLE)\nto fill a hole with a piece of suitable material: Have you plugged that leak (= stopped it by filling the hole) in the pipe? My nose was bleeding and I plugged it with cotton wool.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nround\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nPhrasal verbs\nplug away\nplug (something) in/plug (something) into something\nplug (something/someone) into something\nplug into something\nplug noun [C]\n(ELECTRICAL DEVICE)\nAdd to word list\nAdd to word list\na small plastic or rubber device with metal pins that connects the end of a wire on a piece of electrical equipment to a supply of electricity\nA plug is also a spark plug\nplug noun [C]\n(HOLE BLOCK)\na small piece of esp. rubber or plastic that fits into a hole in order to block it: I was trying to fill the bathtub, but Matthew kept pulling out the plug.\nplug noun [C]\n(ADVERTISE)\nan advertisement for something by someone talking about it or praising it, esp. on television or radio: He took the opportunity to put in a plug for his new book.\nplug verb\n(ADVERTISE)\n[ T ] to advertise something by talking about it or praising it, esp. on television or radio\nplug verb\n(USE ELECTRICAL DEVICE)\n[ I/T ] to attach electrical equipment to a supply of electricity with a plug : [ M ] All you have to do is plug in the computer. [ T ] I’d like to plug the stereo into that outlet. [ I ] These systems plug into TV sets and run games.\nplug verb\n(HOLE BLOCK)\n[ T ] to prevent water or other liquid from coming through a hole by covering the hole: Workers finished plugging the hole in the dam.\nPhrasal verb\nplug away\nAdd to word list\nAdd to word list\nMARKETING\n&#160; informal a way of advertising a product, event, etc. by talking about it or praising it, especially on radio or television: put in a plug for sth He put in a plug for the company's Casino Night fundraiser.give a plug to sth I'd like to give a little plug to a movie that we have that's coming out pretty soon.\npull the plug (on sth)\nto bring a business project, plan, etc. to an end, especially by taking away financial support: We lost all the shares when the company's bankers pulled the plug in February 2011. Plans to sell its property division collapsed yesterday after the private equity group pulled the plug on a $50m management buyout.\nMARKETING\n&#160; informal to advertise a product, event, etc. by talking about it or praising it, especially on radio or television: During the interview she took the opportunity to plug her new book.\nto provide something that is needed, because there is not enough: plug a deficit/gap/hole None of these measures are going to plug the gap caused by falling sales and dismal global markets. Phrasal verbs\nplug in\nplug sth in\nplug into sth\nplug sth into sth"}