{"id":280753,"name":"plummet","type":"verb","us_sound":"ˈplʌm.ɪt","us_link":"../audio/p/plummet.mp3","uk_sound":"ˈplʌm.ɪt","uk_link":"../audio/p/ukplodd028.mp3","content":"Add to word list\nAdd to word list\nto fall very quickly and suddenly: House prices have plummeted in recent months. Several large rocks were sent plummeting down the mountain. She plummeted to the ground.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving downwards\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nsink\nspiral\nsubside\ntouch\ntouch down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nAdd to word list\nAdd to word list\nto fall very quickly and suddenly: Temperatures plummeted last night. The parachute failed to open and he plummeted to the ground.\nAdd to word list\nAdd to word list\nto go down in amount or value very quickly and suddenly: House prices have plummeted in recent months.plummet (by) sth First-half advertising revenues plummeted 13%, compared with the same period a year ago.plummet to sth The food retailer's shares plummeted 17.5p to 227.5p.\na sudden and large reduction in value or amount: a plummet in sth The petrol retailer denies its 25% dividend hike is to prop up the shares after a plummet in the price from 270p to 118p."}