{"id":280810,"name":"plunge","type":"verb","us_sound":"plʌndʒ","us_link":"../audio/p/plunge.mp3","uk_sound":"plʌndʒ","uk_link":"../audio/p/ukplump004.mp3","content":"plunge verb\n(FALL)\nAdd to word list\nAdd to word list\nC2 [ I or T, usually + adv/prep ] to (cause someone or something to) move or fall suddenly and often a long way forward, down, or into something: We ran down to the beach and plunged into the sea. The car went out of control and plunged over the cliff. Cook the peas by plunging them into boiling water. Niagara Falls plunges 55.5 metres.\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nMore examplesFewer examplesThe car skidded and plunged headlong over the cliff.She drew a deep breath and plunged into the water.The climbers had plunged to their deaths in the avalanche.The lack of employment in this part of the country is causing house prices to plunge.Desperately needing to cool off, I plunged my hands into the cold water and threw it over my face.\nSMART Vocabulary: related words and phrases\nMoving downwards\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nsink\nspiral\nsubside\ntouch\ntouch down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nplunge verb\n(BECOME LOWER)\nC1 [ I ] to become lower in value or level very suddenly and quickly: The fall in demand caused share prices to plunge. Our income has plunged dramatically.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nroll back something\nrollback\nrun someone/something down\nrundown\nsag\nshave\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFalling and dropping\nPhrasal verbs\nplunge in/plunge into something\nplunge (someone/something) into something\nplunge noun [C]\n(MOVEMENT)\na sudden movement or fall forward, down, or into something: I really enjoyed my plunge (= jumping in and swimming) in the pool.\nSMART Vocabulary: related words and phrases\nMoving downwards\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nsink\nspiral\nsubside\ntouch\ntouch down\nSee more results »\nplunge noun [C]\n(REDUCTION)\na sudden and large fall in value or level: We are expecting a plunge in profits this year.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\nbase jumping\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\npratfall\nput something/someone down\nshower\nthump\ntrip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nIdiom\ntake the plunge\nAdd to word list\nAdd to word list\nto move or fall suddenly forward, down, or into something: [ I ] Her car plunged off the cliff. [ I ] He plunged into the crowd, smiling and shaking hands. [ T always + adv/prep ] She suddenly plunged the knife into the cake.\nIf a value or price plunges, it suddenly becomes less: [ I ] Rumors on Wall Street have caused stock prices to plunge.\nIf a person or group plunges into an activity, or a place plunges into a condition, it suddenly experiences it: [ I always + adv/prep ] The economy was in danger of plunging into a depression. [ T always + adv/prep ] The storm cut power lines, plunging the town into darkness.\na sudden fall forward, down, or into something: A tree broke his plunge downhill. The rapid plunge of the stock market caused panic among investors.\nAdd to word list\nAdd to word list\nto go down in amount or value very quickly and suddenly: markets/sales plunge Car sales plunged in France in June.plunge to sth Share prices plunged $16.74, or 44%, to $20.51 a share.plunge by sth The Dow was 40 points ahead, having plunged by 60 points shortly after the opening bell.plunge from sth Visitor numbers plunged from 25million in 2010 to 22.8million - but they are now recovering. Phrasal verbs\nplunge in/plunge into sth\nplunge (sb/sth) into sth\na sudden and large reduction in value or amount: We are expecting a plunge in profits this year. Profits are being affected by the plunge in the dollar against the euro.a plunge in prices/sales The plunge in oil prices has driven fuel bills 12% lower.\ntake the plunge\nto make a decision to do something, especially after thinking about it for a long time: Consumers who want to buy a home ought to take the plunge, rather than waiting for even lower mortgage rates."}