{"id":280911,"name":"plus","type":"preposition","us_sound":"plʌs","us_link":"../audio/p/plus.mp3","uk_sound":"plʌs","uk_link":"../audio/p/ukplump015.mp3","content":"Add to word list\nAdd to word list\nA2 added to: What is six plus four? The rent will be £175 a week, plus (= added to the cost of) gas and electricity.\nMore examplesFewer examplesThe cost is $205 plus $3 for shipping.Please enclose £15.99, plus £2 for postage.\"Three plus three is seven. True or false?\" \"False.\"It costs £1,000 a week to hire the yacht, plus a £120 returnable deposit.The loan has to be repaid, plus interest, within 18 months.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\nB1 and also: There will be two adults travelling, plus three children.informal Let's not go on holiday in August - it'll be too hot - plus it'll be more expensive.\nMore examplesFewer examplesWe're taking Phil's luggage, plus Annie's.There'll be Jenny and Darren, plus Mike and Sean.We'll need a washing machine and cooker, plus a new bed.Skiing would be too expensive, plus Susie doesn't like the cold.Steve won't be around to help us, plus we're moving house around that time.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nplus noun [C]\n(ADVANTAGE)\nB2 informal plural pluses or plusses an advantage or a good feature: Your teaching experience will be a plus in this job.\nMore examplesFewer examplesOn the whole it's a good proposition, the plusses seem to outweigh the minuses.You've got more experience than the others, which should be a real plus in the interview.The fact that we live so near my parents is a major plus from the point of view of childcare.Some knowledge of accountancy techniques is a definite plus in this role.Having an extra bedroom since we moved is a big plus.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nleg\nlock\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nplus noun [C]\n(ADDITION SIGN)\n(also plus sign) the (+) sign, written between two numbers to show that they should be added together\nSMART Vocabulary: related words and phrases\nMathematical symbols\naddition sign\ndegree\ndivision sign\nequal sign\nexpression\nfoot\nminus\nmultiplication sign\noperator\npi\nplaceholder\npoint\nsolidus\nsubtraction sign\nvalue\nX, x\nY, y\nplus adjective\n(ADDITION)\n[ before noun ] A plus number or amount is more than zero: Plus 8 is eight more than zero. The temperature is expected to be no more than plus two (degrees).\n[ after noun ] more than the number or amount mentioned: temperatures of 40 plus Those cars cost £20,000 plus.\n[ after noun ] used by teachers after a letter, such as B or C, to show that the standard of a piece of work is slightly higher than the stated mark: I got C plus/C+ for my essay.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nplus adjective\n(ADVANTAGE)\n[ before noun ] informal used to describe an advantage or good quality that something has: The house is near the sea, which is a plus factor for us.UK The fact that the flight goes from our nearest airport is a real plus point.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nleg\nlock\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nplus preposition\n(ADDITION)\nAdd to word list\nAdd to word list\nadded to, or and in addition: Six plus four is ten. That will be $16.99, plus tax.\nplus noun [C]\n(ADVANTAGE)\nan advantage or a good feature: Your teaching experience will be a plus in this job.\nplus conjunction\n(ADDITION)\nand also: The four of us, plus my son’s girlfriend, went out to dinner.\nplus adjective [not gradable]\n(ADDITION)\nA mark such as B-plus (B+) or C-plus (C+) given to a student’s work means that the work is slightly better than if it were given the B or C mark.\nAdd to word list\nAdd to word list\nused to say that one amount or number is being added to another: The apartment costs $900 a month, plus $100 for the parking space. You will get twenty-five days paid leave per year, plus bank holidays. He will be asked to repay the damages and costs awarded plus interest.\nand also: Most campsites have shower facilities, plus a small store and cafe where you can stock up on supplies. Compare\nminus\nplus or minus sth\nused to say that the number stated may be more or less by a particular amount: The survey's margin of error is plus or minus three percentage points.\nplural plusses | or pluses an advantage or a good feature: Choice and control are two of the big pluses of their consumer-directed plan.\n(also plus sign) the + sign, written between two numbers to show that they should be added together Compare\nminus\n[ after noun ] more than the number or amount stated: Those cars cost £15,000 plus.\n[ before noun ] used to show that something is an advantage or a good feature: a plus factor/point US ski resorts have plenty of big plus points, such as reliable natural snow and some of the best ski schools in the world. On the plus side, sales are picking up and it is also debt-free at last. Compare\nminus"}