{"id":280351,"name":"ply","type":"verb","us_sound":"plaɪ","us_link":"../audio/p/ply.mp3","uk_sound":"plaɪ","uk_link":"../audio/p/ukplump025.mp3","content":"ply verb\n(WORK)\nAdd to word list\nAdd to word list\n[ T ] to sell or to work regularly at something, especially at a job that involves selling things: Fishermen in small boats ply their trade up and down the coast. Dealers are openly plying drugs in school playgrounds. The market traders were loudly plying their wares. ply for business, trade, etc. mainly UK\nto try to get customers for your business in a public place, for example, as a taxi driver, by driving around or waiting in a regular place: There are never any taxis plying for trade/hire in our area.\nSee more\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nsell out\nsell something off\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nply verb\n(TRAVEL)\n[ I + adv/prep, T ] old-fashioned When a boat, train, bus, etc. plies a particular route, it makes that journey regularly: High-speed trains regularly ply between Paris and Lyons. This airline has been plying the transatlantic route for many years.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\nswan\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\nPhrasal verb\nply someone with something\nthe particular number of threads from which wool, rope, etc. is made, used as a measure of its thickness: six balls of four-ply (wool) What ply do you need for that knitting pattern?\nthe particular number of layers from which plywood or tissue is formed, used as a measure of its thickness: Will three-ply (= woolmade from three layers stuck together) be strong enough for making a shelf?\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndistance\ndrop\nelevation\nfactor\nkilo\nmetric\nmetrication\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nply noun [U]\n(LAYER)\nAdd to word list\nAdd to word list\na layer of something such as wood or paper, or a thread that is wrapped with other threads to form yarn (= wool cord) or rope: two-ply facial tissue\nply verb\n(WORK)\n[ T ] to work at something regularly: New buses plied the city's bus routes this week. Extreme-sports athletes ply their craft (= their skill or job) in especially difficult conditions.\nply verb\n(TRAVEL)\n[ I/T ] to travel over distances regularly by boat or other form of transport: [ T ] Large numbers of vessels plied the waters between New York and Cape Hatteras.\nPhrasal verb\nply someone with something\nAdd to word list\nAdd to word list\n[ T ]\n&#160; COMMERCE to sell something: ply (your) wares Companies should be accountable for the wares that they ply.\n[ I or T ]\n&#160; TRANSPORT to make a journey regularly: There are fears about the safety of some of the ageing vessels that ply Aegean waters.ply between sth At present, big cargo ships plying between the east and west coasts of India have to circumnavigate Sri Lanka. The airline recently founded a new operator to ply long-haul routes to China and Britain starting in July.\nply for business/hire/trade\nCOMMERCE to try to get customers for your business in a public place, for example, as a taxi driver, by driving around or waiting in a regular place: London's formidable black taxis enjoy a lucrative near monopoly over plying for hire on the capital's streets.\nply your trade\nto do your job: Having worked as a government lawyer for 15 years, he is departing for the private sector to ply his trade as a barrister at Lincoln's Inn. Phrasal verb\nply sb with sth"}