{"id":281181,"name":"poach","type":"verb","us_sound":"poʊtʃ","us_link":"../audio/p/poach.mp3","uk_sound":"pəʊtʃ","uk_link":"../audio/p/ukpmt__006.mp3","content":"poach verb\n(COOK)\nAdd to word list\nAdd to word list\n[ T ] to cook something such as a fish, or an egg with its shell removed, by putting it in gently boiling water or other liquid: We had poached eggs for breakfast. Do you like pears poached in red wine?\nSMART Vocabulary: related words and phrases\nPreparing food using heat\nair fryer\nbain-marie\nbaking\nbaking parchment\nbarbecue\nblanch\nboil\ncooking\ndeep fat fryer\ndeep-fried\ndeep-fry\ndone\noverdone\npan-fry\nparboil\npoaching\nprecook\nsear\nwarm (someone/something) up\nwood-fired\nSee more results »\npoach verb\n(TAKE)\n[ I or T ] to catch and kill animals without permission on someone else's land: The farmer claimed that he shot the men because they were poaching on his land.\n[ T ] to take and use for yourself unfairly or dishonestly something, usually an idea, that belongs to someone else: Jeff always poaches my ideas, and then pretends that they're his own.\n[ T ] disapproving to persuade someone who works for someone else to come and work for you: They were furious when one of their best managers was poached by another company.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\nApplying for a job\npoach verb\n(COOK)\nAdd to word list\nAdd to word list\n[ T ] to cook something in water or another liquid that is almost boiling: poached eggs\npoach verb\n(TAKE ILLEGALLY)\n[ I/T ] to catch or kill an animal without permission on someone else’s property, or to kill animals illegally to get valuable parts of them: [ T ] Anybody you see with a piece of ivory has poached it. [ I ] Foreign fishing boats were caught poaching offshore. poacher noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈpoʊ·tʃər/\nAdd to word list\nAdd to word list\nHR, COMMERCE\n&#160; disapproving to persuade employees or customers of another company to become your employees or customers instead: poach sb from sth The company is considering a nationwide expansion after poaching a new chief operating officer from a rival restaurant group.poach staff He is suing the rival company for damages of about £35m after they poached 27 staff from him earlier this year.poach clients/customers Such data should help newcomers to poach customers from existing companies.\nto take ideas that belong to another person, company, etc. and use them for yourself, especially in a secret and dishonest way: Several unscrupulous IT companies are offering 'free' seminars on e-commerce to customers and then quietly poaching ideas.\npoach talent\nHR to persuade very able and skilled employees from another organization to come and work for you: Rival brokers have been sniffing around in a bid to poach talent.\npoaching noun [ U ]\nThe major firms have strong, legally enforceable clauses regarding poaching of clients."}