{"id":281220,"name":"pocket","type":"noun","us_sound":"ˈpɑː.kɪt","us_link":"../audio/p/pocket.mp3","uk_sound":"ˈpɒk.ɪt","uk_link":"../audio/p/ukpmt__009.mp3","content":"pocket noun [C]\n(BAG)\nAdd to word list\nAdd to word list\nA2 a small bag for carrying things in, made of cloth and sewn into the inside or onto the outside of a piece of clothing: a jacket/trouser/coat pocket a hip/breast pocket She thrust her hands deep in/into her pockets. He took some coins from/out of his pocket.\nCharissa Van Straalen/EyeEm/GettyImages\nB1 a container, usually made of cloth, that is sewn into or onto a bag or attached to a seat or door in a vehicle: Sarah put her maps in the outside pocket of her rucksack. The safety instructions are in the pocket of the seat in front of you.\nSavushkin/iStock/Getty Images Plus/GettyImages\none of several holes around the edge of a billiard or snooker table, into which balls are hit\nVlaDee/iStock/Getty Images Plus/GettyImages\nC2 informal the amount of money that someone has for spending: You need deep pockets (= a lot of money) if you're involved in a long law suit. I paid for my ticket out of my own pocket (= with my own money), but I can claim the cost of it back from my employer.\nMore examplesFewer examplesHe pulled out a handful of coins from his pocket.The keys are in my jacket pocket.One of the men suddenly produced a knife from his pocket.There are no pockets in these trousers.I've got my hands in my pockets to keep them warm.\nSMART Vocabulary: related words and phrases\nParts of clothes\narmhole\nbodice\ncap sleeve\nclerical collar\ncowl neck\ndart\nknee\nlapel\nneckband\nneckline\npatch pocket\npeplum\nslash\nspaghetti strap\nsweetheart neckline\ntuck\nturn up (somewhere)\nturtleneck\nV-neck\nwaist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe interior of vehicles\nContainers for carrying personal possessions\nSnooker, pool & billiards\nAmounts of money\npocket noun [C]\n(GROUP/AREA)\na group, area, or mass of something that is separate and different from what surrounds it: Among the staff there are some pockets of resistance to the planned changes (= some small groups of them are opposed). The pilot said that we were going to encounter a pocket of turbulence (= an area of violently moving air). Synonyms\ncavity\nchamber (SPACE) specialized\ngap (HOLE)\nhole (SPACE)\nhollow\nspace (EMPTY PLACE)\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: areas of land in general\npocket noun [C]\n(AROUND TEETH)\nmedical\n&#160; specialized a space between the teeth and the gums (= the firm pink flesh inside the mouth, covering the bones into which the teeth are fixed) that can contain bacteria that cause disease : Studies show that people with deep periodontal pockets between their teeth and gums should have them cleaned by a dental hygienist every 3-4 months. In periodontitis, gums pull away from the teeth and form spaces (called “pockets”) that become infected.\nSMART Vocabulary: related words and phrases\nDentistry\nbrace\ncavity\ncentral giant cell granuloma\ndam\ndental floss\ndental hygienist\ndental practitioner\ndental surgeon\ndentigerous cyst\ndentistry\nextraction\ngrind\nhygienist\nodontologist\nodontology\noral irrigator\noral surgeon\northodontic\northodontist\ntoothpick\nSee more results »\nIdioms\nbe/live in each other's pockets\nhave something in your pocket\nin pocket\nin someone's pocket\nout of pocket\nto put something into your pocket: He carefully pocketed his change.\nto hit a billiard or snooker ball into a pocket: Davis pocketed the black to win the game.\nto take something for yourself, especially dishonestly: I'll tell them I sold it for £20, not £25, then I can pocket the rest.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSnooker, pool & billiards\nGetting, receiving and accepting\nused to describe something that is small enough to put in your pocket, or that you regularly carry in your pocket: a pocket dictionary a pocket diary a pocket calculator\nsmaller than usual: a pocket battleship\nSMART Vocabulary: related words and phrases\nSmall\nbaby\nbijou\nbite-sized\nclaustrophobically\ncompactly\ndwarf\nelfin\nmidget\nminiaturized\nmissy\nmodestly\nno/not enough room to swing a cat idiom\non the large, small, etc. side idiom\nS, s\nsampler\nscaled-down\nscrubby\nshoe box\nshrunken\nwee\nSee more results »\npocket noun [C]\n(BAG)\nAdd to word list\nAdd to word list\na small bag, usually made of cloth, sewn on the inside or outside of a piece of clothing and used to hold small objects: coat/pants/shirt pockets She took her keys out of her pocket. I paid for my ticket out of my own pocket (= with my own money).\nA pocket is also a small container that is part of or attached to something else: The map is in the pocket on the car door.\nIn the game of pool, the pockets are the holes around the edge of the table into which the balls are hit.\npocket noun [C]\n(PART)\na small part of something larger that is considered separate because of a particular quality: It remained a pocket of poverty within a generally affluent area. pocketful noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈpɑk·ɪtˌfʊl/\na pocketful of coins\npocket adjective [not gradable]\n(BAG)\nsmall enough to be kept in a pocket: a pocket diary a pocket watch\npocket verb [T]\n(BAG)\nto put something in your pocket, or (fig.) to take money esp. when it has been obtained unfairly or illegally: He pocketed his change. fig. Some sold nonexistent land and pocketed all the cash.\nAdd to word list\nAdd to word list\nFINANCE used to talk about the amount of money that a person or an organization has for spending: come from/out of sb's pocket The cost of fixing flaws comes out of the contractor's pocket.put cash/money into sb's pockets This is significant because it puts more cash into people's pockets. He will have to dig deep into the taxpayer's pocket to finance the required investment in the country's rail infrastructure. This is beyond the pockets of most homeowners.\na group, area, or part of something which is separate and different from what surrounds it: Outside of manufacturing, there are pockets of our economy that continue to perform well.\nbe in the pocket of sb/sth\nto be under the control of a person, an organization, etc.: At the heart of the scandal is the suggestion that supposedly independent brokers are in the pocket of the insurers which are theoretically competing.\ndeep pockets\na lot of money: In this market, you need to have deep pockets. The two companies will survive any downturn because of their large market shares, strong technology, and deep pockets.\nfrom/out of your own pocket(s)\nusing your own personal money, and not the money of a company or an organization: Managers have donated €80,000 from their own pockets to help the company fund its campaign.\nhit sb/sth in the pocket\nto make a person or an organization pay for something: The shareholders have been hit in the pocket.\nline your/sb's pockets\nto get richer or make someone richer, especially by acting unfairly or by being dishonest: He was not accused of lining his own pockets.\nout of pocket FINANCE\n&#160; UK\nhaving less money than you had previously or should have, as a result of something such as a business deal: The company is out of pocket to the tune of $18 million. The limit on his pension would be irrespective of how fast prices are rising, meaning he could be out of pocket in real terms.leave sb out of pocket Charities fear that an interruption to the lottery could leave them out of pocket. See also\nout-of-pocket\nINSURANCE\n&#160; US if you pay out of pocket for medical treatment, you pay for the cost of treatment that is not included in your insurance: According to the report, families are paying about $1,500 more out of pocket than six years ago\nput your hand in your pocket\nto spend money or give money to someone: The landlord insisted that the tenant should put his hand in his pocket and pay for the repairs.\nto earn or win an amount of money: The company now pockets £44 million profit a year. Even relatively junior traders were pocketing huge bonuses.\nto take money for yourself in a dishonest way, especially when you are responsible for looking after it: The two men were indicted for pocketing tens of millions of dollars.\npocket the difference\nto keep the extra money made from a financial deal, often in a dishonest way: They purchased homes with loans above the asking price so they could pocket the difference.\nrelating to something that is small enough to be put or carried in your pocket: a pocket computer/pager/PC a pocket calculator/diary/organiser"}