{"id":281614,"name":"pointe","type":"noun","us_sound":"pɔɪnt","us_link":"../audio/p/cdo0318uspoin3750.mp3","uk_sound":"pɔɪnt","uk_link":"../audio/p/cdo0216poinuk1498.mp3","content":"Add to word list\nAdd to word list\n[ C ] a position in which someone is dancing on the toes of their shoes: They perform ballet numbers complete with jetés and pointes.\nRobert Nieznanski/iStock/Getty Images Plus/GettyImages\n[ U ] (also pointe work) a style of dancing which is done on the toes of the shoes: Georgian dances involve men doing pointe work, or dancing on curled toes.on pointe Ballerinas danced around the stage on pointe.en pointe A dancer is said to be en pointe when all the body weight is supported on the tips of the toes.\nMore examplesFewer examplesPointes have an enormous part to play in classical ballet.She leapt onto her pointes with catlike ease. A \"pointe\" is the ballet figure where one stands on tiptoes.This ballet features a great deal of tricky and demanding pointe work.The production features a Swan Queen who balances, on pointe, on top of her partner's head.The scene features 16 white swans, en pointe in the mist by the lake, arms gracefully stroking the air in imaginary flight.\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\ntights\nSee more results »\npointes\nballet shoes with special thick strong parts at the front for dancing on the toes: Getting used to wearing pointes is a painful process. Why did your hang up your pointes?\nthe thick strong toes of a ballet dancer's shoes: The prima ballerina danced forward on her pointes. When she realizes she loves Aminta, she rises slowly on to pointes with touching gentleness.\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\ntights\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShoes\nrelating to or designed for dancing on the toes of your shoes: Pointe technique is part of classical ballet training. We used to have pointe classes without shoes, which was painful, but incredibly strengthening. See also\npointe shoe\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\ntights\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShoes"}