{"id":281633,"name":"pointillist","type":"noun","us_sound":"ˈpɔɪn.tə.lɪst","us_link":"../audio/p/uspluto019.mp3","uk_sound":"ˈpɔɪn.tɪ.lɪst","uk_link":"../audio/p/ukpogos013.mp3","content":"Add to word list\nAdd to word list\na painter who paints in a style developed in France at the end of the 19th century in which small spots of pure colour are used that seem to mix when seen from far away: Seurat and Signac were two of the most famous pointillists. I'd seen several pastel painters use little dots, like the pointillists. See\npointillism\nMore examplesFewer examplesSeurat was a pointillist who filled his canvas with dots.He applies a mass of detail with a pointillist's brush.Pissarro's late landscapes retain the pointillists' interest in optically mixed color.\nSMART Vocabulary: related words and phrases\nArtists\nagent\nanti-modernist\nartist\ncalligrapher\ndraftswoman\ndraughtsman\ndraughtswoman\netcher\nexpressionist\nMannerist\nmaximalist\nminimalist\nmodernist\nmosaicist\nsidewalk artist\nsketcher\nstructuralist\nsuperagent\nsurrealist\nthe avant-garde\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArt history & artistic movements\nin or relating to a style of painting developed in France at the end of the 19th century in which small spots of pure colour are used that seem to mix when seen from far away: Seurat's \"Une Baignade\" is a well-known pointillist painting. The woman was painted with dots in the pointillist style. See\npointillism\nMore examplesFewer examplesIt's like a pointillist painting. You see a series of dots, and when you back up you can see it's a picture.The artist is known around town for his meticulous pointillist ink sketches.Seurat had already conquered color and the painstaking pointillist technique.\nSMART Vocabulary: related words and phrases\nArt history & artistic movements\nabstract\naesthetic\nanti-modern\nanti-modernism\nanti-modernist\ncubist\nexpressionism\nexpressionist\nexpressionistic\nexpressionistically\nmodernism\nmodernist\nmontage\nnaturalism\nnaturalistic\nrococo\nromantic\nromanticism\nscreen printing\nsilkscreen\nSee more results »"}