{"id":281609,"name":"point","type":"noun","us_sound":"pɔɪnt","us_link":"../audio/p/point.mp3","uk_sound":"pɔɪnt","uk_link":"../audio/p/ukpogos007.mp3","content":"point noun\n(IDEA EXPRESSED)\nAdd to word list\nAdd to word list\nB1 [ C ] an idea, opinion, or piece of information that is said or written: I'd like to discuss the first point in your essay. You made some interesting points in your speech. the/someone's point\nB2 the meaning or most important part of what someone says or writes: The point is, if you don't claim the money now you might never get it. I think you missed (= did not understand) the point of what she was saying. I take your point/Point taken (= I understand that what you are saying is important). Please get to the point (= say the thing that is most important to you). He hasn't got much money, but that's not the point (= that is not the important thing).\nB1 [ S ] an opinion or fact that deserves to be considered seriously, or that other people agree is true: Yes, I can see your point/you've got a point there. OK, you've made your point (= told us your opinion) - there's no need to go on about it. beside the point\nnot important or not related to the subject being discussed: The fact that he doesn't want to come is beside the point - he should have been invited. that's a (good) point\nB2 said to show that what someone has just said is true or important: \"We'll take the bus.\" \"But we don't have any money for the fare.\" \"That's a point.\"\nMore examplesFewer examplesThe lecturer illustrated his point with a diagram on the blackboard.What relevance does that point have to the discussion?Time is short so I'll get straight to the point.I'm unclear about a couple of points in your proposal - could you go over them again?I'll just summarize the main points of the argument in a few words if I may.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nexceptionalism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nnon-dogmatic\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nsupersensible\ntenet\ntheory\nthinking\ntrope\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nIrrelevant\nWords & phrases expressing agreement & acceptance\npoint noun\n(TIME/PLACE)\nB2 [ C ] a particular time or stage reached in a process: At that point, a soldier opened fire on the car. I was completely lost at one point. [ + question word ] It was so confusing that eventually it got to the point where no one knew what was going on. I said I'd tell her the bad news, but when it came to the point (= when I had to do it), I couldn't.\n[ C ] a particular place: the point where the road bends This is a good point from which to watch the race. boiling, melting, freezing, etc. point\nthe temperature at which a substance boils, melts, freezes, etc.\nMore examplesFewer examplesI'm sure at some point in the future I'll want a baby.At no point did the company do anything illegal.It doesn't have to be done this minute, but at some point this week please.I was near to tears at one point during the film.I've reached the point where I'm not going to put up with her criticisms of me any more.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\none\nposterior\nthe last minute idiom\ntime\ntime slot\nunder the wire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStages & phases\nPlaces and locations\nMeasurements of temperature\npoint noun\n(PURPOSE)\nB2 [ S or U ] purpose or usefulness: [ + -ing verb ] informal There's no point arguing about it - we're going and that's that. I'd like to write to him, but what's the point? He never writes back. I see little point in discussing this further.\nMore examplesFewer examplesWhat's the point of that?What's the point of shouting at him?There's no point in going if Maggie isn't going to be there.There's no point in getting yourself all upset over it.I'm not going to this afternoon's session - I don't see the point of it.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\npoint noun\n(UNIT)\nB1 [ C ] a mark or unit for counting, especially how much a person or team has scored in a sport: The youngest skier won the most points. He won the world heavyweight boxing championship on points (= as a result of the points that he had won). Interest rates have risen by two percentage points (= two percent).\n[ C ]\n&#160; publishing\n&#160; specialized a unit used for measuring the size of printed letters, equal to about 0.3 mm or 1/72 of an inch: The large letters are in 7.5 point type, and the small letters are in 6 point.\nMore examplesFewer examplesI won that point, I'm telling you! The ball was definitely in!This was a very impressive performance by the young player, who scored 12 points within the first 10 minutes.Clive's team is on five points while Joan's is on seven.The player had points deducted from his score for arguing with the referee.On Wall Street today, the Dow Jones rose 55 points following good economic figures.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nMeasuring & weighing\npoint noun\n(SHARP END)\nB2 [ C ] the sharp end of something, such as a knife: The knife landed with its point sticking into the floor. Be careful with that needle - it has a very sharp point. See also\ngunpoint\ngolovorez/E+/GettyImages\nMore examplesFewer examplesThe bone had been honed to a point.The point of this pencil isn't sharp enough.the sharp point of a sword/daggerHe thrust the sharp point of his weapon into the heavy wooden door.She carefully pushed the sharp point of the needle into the back of her hand.\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\ndull\nhone\njag\njaggy\nkeen\npointed\nprickly\nrazor-sharp\nsharpen\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nstrop\nultra-sharp\nwhet\nSee more results »\npoint noun\n(CHARACTERISTIC)\nB2 [ C ] a particular quality or characteristic of a person or thing: There are various points to look out for when you're judging dogs in a competition. He's boring, but I suppose he has his good points. I think her kindness is one of her strong points (= one of her good qualities). Synonyms\nangle (WAY OF THINKING)\naspect (FEATURE)\nfacet\nfeature (QUALITY)\ningredient\nside (PART OF SITUATION)\nstrand (PART)\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\npoint noun\n(PIECE OF LAND)\n[ C ] a long, thin area of land that stretches out into the sea: Spurn Point\nSMART Vocabulary: related words and phrases\nGeography: promontories & peninsulas\narm\ncape\nCape Cod\ncauseway\nhead\nheadland\nisthmus\npanhandle\npeninsula\npeninsular\npromontory\nsea stack\nspit\nstack\ntombolo\npoint noun\n(SIGN)\nB2 [ C ] a small, round spot that is used in numbers to separate whole numbers from parts of numbers: One kilogram equals two point two (= 2.2) pounds. The error occurred when someone left out the decimal point.\nSMART Vocabulary: related words and phrases\nMathematical symbols\naddition sign\ndegree\ndivision sign\nequal sign\nexpression\nfoot\nminus\nmultiplication sign\noperator\npi\nplaceholder\nplus\nsolidus\nsubtraction sign\nvalue\nX, x\nY, y\npoint noun\n(FEET)\npoints [ plural ]\n&#160; theatre &amp; film\n&#160; specialized\nthe toes of a ballet dancer's shoes: She is learning how to dance on her points.\npetrenkod/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntap dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShoes\npoint noun\n(ELECTRIC)\n[ C ] UK a socket to which a wire from a piece of electrical equipment is connected in order to supply it with electricity or a radio, television, or other signal: a TV antenna point There is a phone point in every room.\n4FR/iStock/Getty Images Plus/GettyImages\n[ C ]\n&#160; engineering\n&#160; specialized in some car engines, either of two parts that allow or prevent the flow of electricity: He checked the points and plugs and topped up the oil.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe engine & engine parts\npoint noun\n(RAILWAY)\npoints [ plural ] mainly UK (US usually switches)\na place on a railway track where the rails (= metal bars on which the trains travel) can be moved to allow a train to change from one track to another: The train rattled as it went over the points.\nDinodia Photo/Corbis NX/GettyImages\nSMART Vocabulary: related words and phrases\nRailways & railway lines\nAmtrak\nartery\nbranch line\nelectrify\nfunicular\njunction\nlevel crossing\nlight rail\nlight railway\nmetro\nmonorail\nrailroad\nrailroad tie\nRR\nsiding\nsignal\nsignal box\nswitch\nswitchback\nunderground\nSee more results »\npoint noun\n(MARK)\n[ C ] a small, round mark on a line, plan, or map to show the position of something: Join the points A and B together on the diagram with a straight line.\nC2 [ C ] a mark on a compass that shows direction, such as north, south, east, and west\n[ C ] a very small, round light that you can see in the distance: I could just make out the tiny points of a car's headlights far away.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPoints of the compass\nQuantities & units of light\nIdioms\nbe on the point of (doing) something\nmake a point of doing something\nmy point exactly\non point\nto the point\nup to a point\npoint verb\n(IN PARTICULAR DIRECTION)\nA2 [ I ] to direct other people's attention to something by holding out your finger towards it: \"Look at that!\" she said, pointing at the hole in the door. Small children are often told that it's rude to point.\nB1 [ T ] to hold something out in the direction of someone or something: He said that the man had pointed a knife at him.\nB1 [ I ] If something points in a particular direction, it is turned towards that direction: The road sign points left. All the cars were pointing in the same direction. There was an arrow pointing to the door.\nMore examplesFewer examplesIt is impolite to point at people.She spun the globe, and pointed to the Solomon Islands.She pointed to her watch as a sign that it was getting late and she wanted to leave.Select the function you require by pointing to the toggle with the mouse and then clicking.\"No, go that way, \" I said, pointing in the opposite direction.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral location and orientation\npoint verb\n(WALLS)\n[ T ] to fill the gaps between bricks, etc. with mortar (= a mixture of sand, water, and cement): The physical work of preservation includes pointing handmade bricks and repairing windows. They failed to identify problems such as condensation, badly pointed walls and leaky gutters.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nIdiom\npoint someone towards/in the direction of somethingPhrasal verbs\npoint (something/someone) out\npoint something out\npoint to/towards something\npoint something up\nrelating to when a ballet dancer dances on their toes: a pair of point shoes Today we'll do some point work.\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntap dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\nSee more results »\npoint noun\n(SHARP END)\nAdd to word list\nAdd to word list\n[ C ] the sharp or narrow end of something, such as a knife or pin: I stuck myself with the point of the needle.\n[ C ] A point is also a narrow piece of land that stretches out into the sea.\npoint noun\n(IDEA EXPRESSED)\n[ C ] an idea, opinion, or piece of information that is said or written: He made some good points in his speech. The lawyers reviewed the issues point by point. You have a point (= What you say is reasonable).\n[ C ] The point is the main or most important idea: He doesn’t have much money, but that’s not the point.\npoint noun\n(CHARACTERISTIC)\n[ C ] a particular quality or characteristic: Truthfulness is not one of his strong points.\npoint noun\n(TIME OR PLACE)\n[ C ] a particular time, place, or stage reached in a process: She felt that they were at a critical point in their marriage.\npoint noun\n(ADVANTAGE)\n[ U ] purpose or usefulness: What’s the point of leaving at six in the morning?\npoint noun\n(UNIT)\n[ C ] a unit for measuring or counting: Our team won by seven points. Interest rates dropped two percentage points.\npoint noun\n(position)\ngeometry an exact position in space that has no size and is usually represented by a small, round mark pointy adjective [ -er/-est only ] us\nYour browser doesn't support HTML5 audio\n/ˈpɔɪnt·i/\npointy shoes Idioms\npoint the finger at someone\npoint the way (to something)\npoint verb [I/T]\n(SHOW)\nto direct other people’s attention to something by signaling toward it with your finger: [ I ] \"Look,\" she said, pointing at the sign. [ M ] Which one is your sister – would you point her out to me?\nIf something points in a particular direction, it is turned toward that direction: [ I ] The arrow points left. Phrasal verbs\npoint out something\npoint up something\nAdd to word list\nAdd to word list\n[ C ] an idea, opinion, or piece of information that is spoken or written: I agree with your point about the management team. Thank you, that was a very interesting point.make/raise a/the point He made the point quite forcefully that no more money was available.get a point across I wasn't sure what point she was trying to get across.prove sb's point I think that proves my point. The figures just don't stack up.\nthe point\nthe meaning or most important part of what is being said or written: The point is that on weekends and late at night there should always be someone on duty to deal with emergencies. come/get to the point We haven't got all day, so please get to the point. To talk only about managing one country's economy is to miss the point. The list could go on and on, but I think you get the point.\n[ U or S ] purpose, or the fact of something being useful: no point (in doing sth) There is no point in discussing this further if you've already made up your mind.\n[ C ] a particular detail or characteristic of a person or thing: the main points I noted down the main points of his speech.good/bad point The government's financial plan has both its good and its bad points. When you are appraising someone, try to emphasize their good points. Speaking in public is not one of her strong points.\n[ C ]\n&#160; MEETINGS one part that a meeting, plan, etc. is divided into: We have seven points on the agenda today. Has anyone any comments on Point 4? We need to examine the proposals point by point. My boss gave me a five-point plan for improving my performance.\n[ C ] a particular time or stage that is reached in a process: highest/lowest point Copper prices rose to their highest point in two weeks. The stock went to $74 at one point.get to/reach a/the point It's taken us years to get to the point where we're making a reasonable profit. We shall need to discuss this further at some point.at this point (in time) This is not something that we want to introduce at this point in time.\n[ C ] a mark or unit for counting or measuring something: score points You will normally be accepted if you score more than 20 points on the test. The bond rose 10 basis points, from 2.932 to 2.942 percent. Interest rates have gone up two percentage points. We will introduce an Australian-style points system for work permits.\n[ C ] a particular place: The building served as the group's meeting point. The store is the focal point of the small community.\n[ C ] a small round mark that is used in numbers to separate whole numbers from parts of numbers: A kilogram equals two point two (2.2) pounds. a decimal point\nI take your point (also point taken)\nused when you are saying that you think that something that someone has said is important: I take your point. That's something we need to consider.\nmake a point of doing sth\nto always do something, or to take particular care to do something: She always makes a point of inviting all her staff to briefing meetings.\nmake your point\nto tell people your opinion: OK, you've made your point. Let someone else say what they think now.\nto the point\nvery important or suitable for the subject being discussed: His remarks about the pay structure were well expressed and to the point.\nup to a point\npartly, or to a limited degree: The new system was working - up to a point. See also\naction point\nassembly point\nbasis point\nbreak-even point\nbreaking point\nbreakpoint\nbullet point\ngross rating point\nhalf point\ninflection point\nView all\norder point\npercentage point\nprice point\nquarter-point\nratings point\nreorder point\nselling point\nstrategic inflection point\ntalking point\ntipping point\ntrigger point\nturning point\nunique selling point\nto show someone the direction that they should go, or what they should do: The figures pointed us in the direction that we should be taking over the next year or so.\npoint the finger at sb\nto accuse someone of being responsible for something bad that has happened: The reports are understood not to point the finger at the group's finance director. Phrasal verbs\npoint sth out\npoint to/towards sth\npoint sth up"}