{"id":281663,"name":"poised","type":"adjective","us_sound":"pɔɪzd","us_link":"../audio/p/poised.mp3","uk_sound":"pɔɪzd","uk_link":"../audio/p/ukpogos021.mp3","content":"poised adjective\n(WAITING)\nAdd to word list\nAdd to word list\n[ after verb ] If an object or a part of your body is poised, it is completely still but ready to move at any moment: My pencil was poised over the page, ready to take down her words.\n[ after verb ] ready to do a particular thing at any moment: [ + to infinitive ] The company is poised to launch its new advertising campaign. The military forces are poised for attack.\nMore examplesFewer examplesShe watched a little white bird, poised on a branch and fluttering its wings.He sat with his pencil poised, ready to take notes.Her finger was poised on the camera as she waited for them to take their positions.The two guards stood poised with their shields and swords raised.They stood their waiting, poised for action.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\nprepared\nraring\nreadily\nreadiness\nready\nshape\nSee more results »\npoised adjective\n(CONTROLLED)\napproving showing very calm and controlled behaviour\nSMART Vocabulary: related words and phrases\nCalm and relaxed\n(as) cool as a cucumber idiom\nat (your) leisure idiom\nbe at peace with the world idiom\nbiddable\ncalmly\neasy come, easy go idiom\neasy-going\nequilibrium\nfluidly\nfree-flowing\nnon-hysterical\npeaceably\npeacefully\npeacefulness\nplacable\nunpressurized\nunruffled\nunshockable\nunstrained\nunstressed\nSee more results »\npoised adjective\n(READY)\nAdd to word list\nAdd to word list\n[ not gradable ] ready to move, or prepared and waiting for something to happen: The lion was poised to strike.\npoised adjective\n(CONFIDENT)\ncalm and confident: Angela is a polite, poised young woman.\nAdd to word list\nAdd to word list\n[ after verb ] ready to do a particular thing at any moment: poised to do sth The public pension fund is poised to invest up to $1.5 billion over the next year. The City is poised for a major announcement on the airline's fare strategy.\nshowing very calm and controlled behaviour: She remained poised throughout the difficult presentation."}