{"id":281669,"name":"poison","type":"noun","us_sound":"ˈpɔɪ.zən","us_link":"../audio/p/poison.mp3","uk_sound":"ˈpɔɪ.zən","uk_link":"../audio/p/ukpogos022.mp3","content":"Add to word list\nAdd to word list\nB2 a substance that can make people or animals ill or kill them if they eat or drink it: The pest control officer put bowls of rat poison in the attic. Her drink had been laced with a deadly poison. Compare\ntoxin\nvenom (POISON)\nMore examplesFewer examplesBottles of lemonade doctored with rat poison were discovered in the kitchen.Forensic examination revealed a large quantity of poison in the dead man's stomach.The giraffe was killed with a spear that had been tipped with poison.Arsenic is a deadly poison that takes immediate effect.a phial of poison\nSMART Vocabulary: related words and phrases\nPoisoning and allergy\nallergen\nallergenic\nallergic\nanaphylactic\nanaphylactic shock\nanaphylaxis\nanimatedly\nhypersensitivity\nhypoallergenic\nintolerance\nintolerant\njimson weed\nlactose intolerance\nlisteriosis\npoisoner\npoisoning\ntoxicology\nvenom\nvenomous\nWarfarin\nSee more results »\nIdiom\nname your poison\npoison verb [T]\n(ADD SUBSTANCE)\nB2 to kill a person or animal or to make them very ill by giving them poison: Four members of the family had been poisoned, but not fatally.\nB2 to put poison in someone's food or drink: He said that someone had poisoned his coffee.\nB2 to add dangerous chemicals or other harmful substances to something such as water or air: The chemical leak had poisoned the water supply.\nSMART Vocabulary: related words and phrases\nPoisoning and allergy\nallergen\nallergenic\nallergic\nanaphylactic\nanaphylactic shock\nanaphylaxis\nanimatedly\nhypersensitivity\nhypoallergenic\nintolerance\nintolerant\njimson weed\nlactose intolerance\nlisteriosis\npoisoner\npoisoning\ntoxicology\nvenom\nvenomous\nWarfarin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKilling\nMurder & attempted murder\nEnvironmental issues\npoison verb [T]\n(SPOIL)\nto spoil a friendship or another situation, by making it very unpleasant: The long dispute has poisoned relations between the two countries.\nThesaurus: synonyms, antonyms, and examples\nto spoil somethingspoilDon't spoil the movie by telling me what happens!ruinI put too much salt in the sauce and ruined it.defaceMany of the library books had been defaced.disfigureHer face was disfigured by the scar.sourOur friendship soured after the argument, and we just drifted apart.poisonThe long dispute has poisoned relations between the two countries.\nSee more results »\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nseismic\nsour\nwreck\nSee more results »\nIdiom\npoison someone's mind\npoison noun\n(SUBSTANCE)\nAdd to word list\nAdd to word list\n[ C/U ] a substance that causes illness or death if swallowed, absorbed, or breathed into the body: [ U ] poison gas [ C ] Some cleaning products are poisons. [ U ] He sprayed the weeds with poison. poisonous adjective us\nYour browser doesn't support HTML5 audio\n/ˈpɔɪ·zə·nəs/\nThe mushrooms they picked were poisonous.\npoison verb [T]\n(CAUSE HARM)\nto cause serious harm to something: Jealousy poisoned our relationship. I don’t see why you think TV poisons people’s minds (= influences them in a bad way).\npoison verb [T]\n(SUBSTANCE)\nto cause a person or animal to take in poison, or to add poison to food or a liquid: He thinks someone is trying to poison him. Her tea was poisoned."}