{"id":281785,"name":"polarization","type":"noun","us_sound":"ˌpoʊ.lɚ.əˈzeɪ.ʃən","us_link":"../audio/p/eus73626.mp3","uk_sound":"ˌpəʊ.lə.raɪˈzeɪ.ʃən","uk_link":"../audio/p/ukpolar003.mp3","content":"polarization noun\n(DIVIDING)\nAdd to word list\nAdd to word list\n[ U ] the act of dividing something, especially something that contains different people or opinions, into two completely opposing groups: The polarization of society into rich and poor can clearly be seen in urban areas. Our goal is lively discussion, not polarization.\nMore examplesFewer examplesThe polarization of wealth in the past 20 years has been extreme.They agreed to work together to end racial polarization. In these days of increasing polarization, it's easy to regard those on the other side of the argument as evil.\nSMART Vocabulary: related words and phrases\nClass & class-consciousness in general\nanti-bourgeois\nanti-snob\narriviste\nbougie\ngentrify\ngo/come down in the world idiom\ngo/come up in the world idiom\nheap\npedigreed\npetit bourgeois\npetty bourgeois\npleb\nsocial climbing\nsocial mobility\nthe bottom of the heap idiom\nthe gentry\nthe petite bourgeoisie\ntrailer trash\nunderclass\nupper class\nSee more results »\npolarization noun\n(LIGHT)\n[ U ]\n&#160; physics\n&#160; specialized the act of making light waves move in one direction only, or mainly in one direction: Polarization of light occurs when light is scattered and oriented in a certain direction. A magnetic field will rotate the plane of polarization of polarized light.\n[ U or C ] the process of treating glass with a substance that reduces the amount of reflected light, or the degree to which glass reduces the amount of reflected light: 3D glasses that have different polarizations for each eye have recently been developed.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: optics, microscopy & lasers\nEyesight, glasses & lenses\nSee\npolarize\nAdd to word list\nAdd to word list\nthe fact of people or opinions being divided into two opposing groups: There is now more polarization and less cooperation between the political parties."}