{"id":281788,"name":"polarized","type":"adjective","us_sound":"ˈpoʊ.lə.raɪzd","us_link":"../audio/p/cdo0319uspola1346.mp3","uk_sound":"ˈpəʊ.lə.raɪzd","uk_link":"../audio/p/cdo0319ukpola1226.mp3","content":"polarized adjective\n(DIVIDED)\nAdd to word list\nAdd to word list\ndivided into two completely opposing groups: The debate is becoming polarized and there seems to be no middle ground. They hoped the deal could finally bring a measure of peace to the increasingly polarized country.\nMore examplesFewer examplesThe mass media may be polarized, but the nation is not.The result of such partisan and polarized debate is that the mainstream American public gets turned off - not just from the debate but from the issue itself.When did we become so polarized that we lost our ability to have a civilized discussion about complex issues?He said that Belfast was a divided city with polarized communities.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\npolarized adjective\n(LIGHT)\nphysics\n&#160; specialized (of light waves) made to move in one direction only, or mainly in one direction: The samples were analyzed with polarized light microscopy.\n(of glass) treated with a substance that reduces the amount of reflected light: They suggest boaters wear polarized sunglasses that cut down on glare and make it easier to spot the endangered marine mammals.\nMore examplesFewer examplesWang found the light from more than a dozen supernovae to be polarized.Crystals under polarized light are a favorite subject of artistically inclined microscopists.They needed polarized camera lenses to reduce glare on photos taken in bright sunlight. The fire watchers wear polarized sunglasses to help them spot smoke.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: optics, microscopy & lasers\nEyesight, glasses & lenses"}