{"id":281750,"name":"polar","type":"adjective","us_sound":"ˈpoʊ.lɚ","us_link":"../audio/p/cdo1121uspola3411.mp3","uk_sound":"ˈpəʊ.lər","uk_link":"../audio/p/ukpolar001.mp3","content":"polar adjective\n(PLACE)\nAdd to word list\nAdd to word list\nrelating to the North or South Pole or the areas around them: the polar ice caps polar explorers\nMore examplesFewer examples129 men disappeared on this ill-fated polar expedition.The terrible beauty of the polar regions has fascinated many.We tracked seasonal changes, such as the comings and goings of polar ice, clouds, and dust storms.Warm air from the south collides with polar air from the north.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: continents & regions of the world\nAfrocentric\nAfrocentrism\namazonian\nAntarctica\nAntipodean\nblack Africa\nCaribbean\nlat.\nLATAM\nLatin America\nlatitudinal\nlatitudinally\nlongitude\nmeridian\nparallel\npole\nthe Antipodes\nthe South Pole\nthe subtropics\nthe Tropic of Cancer\nSee more results »\npolar adjective\n(OPPOSITE)\nPolar opposites are complete opposites: The novel deals with the polar opposites of love and hate.\nThesaurus: synonyms, antonyms, and examples\ncompletely differentoppositeTheir two daughters may look alike, but they are completely opposite to one another. polar oppositesLove and hate are polar opposites.identicalHis opinions are identical to his spouse's.antitheticalHis actions were absolutely antithetical to our code of conduct.converseIf we ask what a citizen must sacrifice for the good of the nation, we must ask the converse question: what will the nation sacrifice for the good of its citizens?\nSee more results »\nMore examplesFewer examplesHe becomes increasingly drawn into their exciting lives, the polar opposite of his lonely one.On issues including abortion and gay rights he stands in polar opposition to the socially liberal mainstream of his party. He represents an almost polar contrast to his brother.\nSMART Vocabulary: related words and phrases\nOpposites\nantinome\nantithesis\nantithetical\nantonymous\nanything\nconverse\ncounterpose\ndiametric\ndiametrical\ndichotomist\ndichotomous\nflip side\nnegation\nopposed\nopposite\nor otherwise idiom\notherwise\npolarity\npole\nreverse\nSee more results »\npolar adjective\n(maths)\nmathematics\n&#160; specialized relating to poles (= the two points at which a straight line through the centre of a circle cuts the surface of a sphere): It is best to use polar coordinates to locate points in the plane.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\na straight line at an angle of 90 degrees to another line that passes through the centre of a circle and another given point: Given a circle c with center O and a point P, there is a special line called the polar of P.\nSMART Vocabulary: related words and phrases\nGeometry: parts of geometrical shapes\n-sided\nangle\naxis\naxisymmetric\nbulky\nchord\ncircumference\nconic\ncorresponding sides\nhemisphere\nperimeter\nplane\npole\nquadrant\nquadric\nsymmetrical\nsymmetrically\ntan\nultra-dense\nvertex\nSee more results »\npolar adjective\n(OF A PLACE)\nAdd to word list\nAdd to word list\n[ not gradable ] of or near the area around the most northern or most southern points of the earth: the polar ice cap a polar expedition\npolar adjective\n(OF ELECTRICITY)\nrelating to either of the two ends of a magnet or two parts of a battery (= device that produces electricity) which have opposite charges: fig. The play’s main characters are polar opposites (= They are completely opposite).\nchemistry Polar also describes a substance whose molecules have opposite positive and negative poles"}