{"id":281789,"name":"polarizer","type":"noun","us_sound":"ˈpoʊ.lə.raɪ.zɚ","us_link":"../audio/p/cdo0319uspola1347.mp3","uk_sound":"ˈpəʊ.lə.raɪ.zər","uk_link":"../audio/p/cdo0319ukpola1227.mp3","content":"polarizer noun [C]\n(LIGHT)\nAdd to word list\nAdd to word list\nphysics\n&#160; specialized a device that makes light waves move in one direction only, or mainly in one direction, used, for example, in cameras and electronic devices: It's possible to create an outdoor-readable Tablet PC by using an appropriate LCD technology coupled with appropriate polarizers and filters. The light is bright enough on its own, without the need for polarisers, colour filters and backlights.\nMore examplesFewer examplesWhen shooting in bright light, leave a polarizer on.The light blocked by the polariser never sees the reflector and a dark display results.When the angle (C) between the slow direction of the plate and the transmission axis of the polarizers is at 0 degrees the apparatus transmits white light.The photos were taken into the sun with a polarizer filter on with a Canon 500D DSLR Camera.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\nlaser\nlens\nmagnification\nmagnify\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\nreflect\nreflecting telescope\nreflection\nrefracting telescope\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\npolarizer noun [C]\n(DIVIDE)\na person or thing that causes something, especially people or their opinions, to divide into two completely opposing groups: This 11-track album will stand out as an anomaly, a polarizer among fans. He was a polariser: so much so that he never won more than 55% of the vote in North Carolina.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »"}