{"id":282865,"name":"politics","type":"noun","us_sound":"ˈpɑː.lə.tɪks","us_link":"../audio/p/politics.mp3","uk_sound":"ˈpɒl.ə.tɪks","uk_link":"../audio/p/ukpolar030.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the activities of the government, members of law-making organizations, or people who try to influence the way a country is governed: Joe is very active in left-wing politics.\n[ U ] the job of holding a position of power in the government: The group is campaigning to get more women into politics. He is planning to retire from politics next year.\n[ U ] the study of the ways in which a country is governed: She studied politics at Leicester University. someone's politics\nsomeone's opinions about how a country should be governed: Her politics have become more liberal over the past few years. He moved to Los Angeles, a place more in tune with his politics than Texas. He was accused of twisting the facts to suit his politics. Whatever your politics, you should be happy about these reforms. These people really live their politics, organizing, fundraising, and demonstrating constantly.\n[ plural ] the relationships within a group or organization that allow particular people to have power over others: I don't like to get involved in office politics. They know how to get on with people and they understand the politics of a social group.\nMore examplesFewer examplesAfter 30 years in politics, our local member of parliament is retiring next year.Ms Doughty entered politics after a career in banking.He was a powerful force in British politics during the war years.She has a degree in sociology and politics.In the old days of two-party adversarial politics, voting was easy.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nGrammar\nPolitics, political, politician or policy?Politics means the activities of the government or people who try to influence the way a country is governed. We use a singular verb with it: …\nIdiom\nplay politics\nAdd to word list\nAdd to word list\npolitics &amp; government the activities of the government, politicians, or political parties, or the study of these activities: [ U ] She got involved in local politics.\npolitics &amp; government A person’s politics are that person's opinions about how a country should be governed: [ pl ] His politics are becoming increasingly liberal.\npolitics &amp; government Politics are also the activities of people who are trying to obtain an advantage within a group or organization: [ pl ] I don’t like to get involved in office politics.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; POLITICS, GOVERNMENT the activities of the government, members of law-making organizations, or people who try to influence the way a country is governed: It seems that most people have very little interest in politics. These proposals will help shape the politics of the country for years to come. local/national/domestic politics\n[ U ]\n&#160; POLITICS, GOVERNMENT the fact of being involved in political activities and getting political power: The group is campaigning to get more women into politics. He is planning to retire from politics next year.\n[ usually plural ]\n&#160; WORKPLACE activities that are related to getting or keeping power within a particular company, organization, etc.: company/office/workplace politics Don't be seen as a troublemaker and avoid company politics.\n[ plural ] a person's political opinions: His politics are generally considered to be right of centre.\n[ U ]\n&#160; POLITICS the study of political systems and power, for example at a college or university : a degree in politics"}