{"id":282795,"name":"polite","type":"adjective","us_sound":"pəˈlaɪt","us_link":"../audio/p/polite.mp3","uk_sound":"pəˈlaɪt","uk_link":"../audio/p/ukpolar021.mp3","content":"Add to word list\nAdd to word list\nA2 behaving in a way that is socially correct and shows understanding of and care for other people's feelings: I'm afraid I wasn't very polite to her. She sent me a polite letter thanking me for my invitation. He was too polite to point out my mistake.\nThesaurus: synonyms, antonyms, and examples\npolitepoliteHe was always such a polite child.courteousAlthough she often disagreed with me, she was always courteous.respectfulHe was respectful towards his elders.well manneredThey were quiet, well mannered children.chivalrousHe held open the door in that chivalrous way of his.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nwell behavedwell behavedOur kids are normally well behaved.goodBe a good girl and sit quietly.as good as goldThe babysitter said Arlo had been as good as gold.angelTeddy is a little angel.obedientHe always tried his best to be an obedient son.\nSee more results »\nsocially correct rather than friendly: polite conversation polite society/company old-fashioned or humorous\npeople who have been taught how to behave in a socially correct way: in polite society/company Sex never used to be discussed in polite society.\nSee more\nMore examplesFewer examplesShe was polite but not excessively so.\"Try to be polite to him.\" \"Like hell I will!\"He was unusually polite.He's usually quite polite in my presence.They're very polite in your presence, but you get the feeling they're laughing up their sleeves.\nSMART Vocabulary: related words and phrases\nPolite and respectful\ncandy coat\ncandy-coated\nchivalric\nchivalrous\nchivalrously\ncourtliness\ncourtly\ncouth\ndeferential\ndeferentially\ngraciously\ngraciousness\nhyper-civilized\nkeep a civil tongue in your head idiom\nmanner\nsugarcoat\nsuper-polite\ntactful\ntactfully\nultra-civilized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving well\nRelated word\npolitenessGrammar\nBeing polite or less directWe sometimes use a past verb form to talk about present time, in order to be more polite or less direct: …\nThings in the past that are still trueSometimes we use past verb forms to refer to things which were true or which happened in the past, even when they are still true now: …\nPast: typical errorsWe use the past simple, not the past continuous, to talk about past habits: …\nPolitenessPoliteness is about keeping good relations with your listener or reader. There are two types of politeness …\nPoliteness: showing respectThere are many ways in which we can show that we value and respect our listener or reader. In more formal situations, we are especially careful to use certain polite phrases: …\nPoliteness: making what we say less directWhen we speak and write, we usually try not to be too direct. There are a number of ways in which we can do this. …\nPoliteness: what is impolite?Being direct is impolite so we need to be careful when using direct forms. …\nAdd to word list\nAdd to word list\nbehaving in a way that is socially correct and shows respect for other people’s feelings: She was too polite to point out my mistake. politely adverb us\nYour browser doesn't support HTML5 audio\n/pəˈlɑɪt·li/\nHe politely asked them to leave. politeness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/pəˈlɑɪt·nəs/\nWith unfailing politeness he answered their questions."}