{"id":282832,"name":"political","type":"adjective","us_sound":"pəˈlɪt̬.ə.kəl","us_link":"../audio/p/political.mp3","uk_sound":"pəˈlɪt.ɪ.kəl","uk_link":"../audio/p/ukpolar025.mp3","content":"Add to word list\nAdd to word list\nB1 relating to politics: political leaders There are two major political parties in the US - the Democratic Party and the Republican Party. Education is back at the top of the political agenda (= the matters that the government is considering).\nMore examplesFewer examplesThe National Front is an extremely right-wing political party in Britain.He rose quickly through the political hierarchy to become party leader.He has given up political power, but he remains securely in control of the army.The political reforms have led to major structural changes in the economy.His political career ended when he was found to have been accepting bribes.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nRelated word\npoliticallyGrammar\nPolitics, political, politician or policy?Politics means the activities of the government or people who try to influence the way a country is governed. We use a singular verb with it: …\nIdiom\na political football\nAdd to word list\nAdd to word list\npolitics &amp; government relating to politics: political parties a political speech Free trade is an ongoing political issue because it affects local employment rates. politically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/pəˈlɪt̬·ɪ·kli/\npolitics &amp; government They encourage young people to become more politically active.\nAdd to word list\nAdd to word list\nGOVERNMENT, POLITICS relating to politics: The financial crisis will determine the new government's political agenda for the next few years. She became a candidate for the leadership of a major political party. There the unions still hold enormous political power and represent the majority of the population.\nWORKPLACE relating to getting or keeping power within a particular company, organization, etc.: The move by the CEO was regarded by the majority of the management as being purely political. It was a political decision, taken in order to cling on to power. politically adverb\nThe information was judged to be politically sensitive and was not published."}