{"id":281973,"name":"police","type":"noun","us_sound":"pəˈliːs","us_link":"../audio/p/police.mp3","uk_sound":"pəˈliːs","uk_link":"../audio/p/ukpolar012.mp3","content":"Add to word list\nAdd to word list\nA2 the official organization that is responsible for protecting people and property, making people obey the law, finding out about and solving crime, and catching people who have committed a crime: I think you should call the police. The police are investigating fraud allegations against him.\nmembers of this organization: There should be more police patrolling the area on foot.\nMore examplesFewer examplesThe police are appealing to the public for any information about the missing girl.The police gave out road-safety booklets to the children.Get out of here now or I'll call the police.When she was stopped by the police for speeding, she gave them a false name and address.The role of the police is to ensure that the law is obeyed.\nSMART Vocabulary: related words and phrases\nThe police generally\nanti-police\nanti-riot\nbaton\nbaton charge\nbilly\nbilly club\nbooze bus\nescort\ngendarmerie\nInterpol\nkettle\nkettling\nlathi\npatrol car\nScotland Yard\nsecret police\nSpecial Branch\nstation house\nSWAT team\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who work for the police service\nto control or guard a public event or area by using members of the police or a similar force: The march will be heavily policed by an anti-riot unit.\nto control the way in which a possibly dangerous substance is dealt with or a dangerous activity is done: The use of these chemicals must be carefully policed.\nSMART Vocabulary: related words and phrases\nThe police generally\nanti-police\nanti-riot\nbaton\nbaton charge\nbilly\nbilly club\nbooze bus\nescort\ngendarmerie\nInterpol\nkettle\nkettling\nlathi\npatrol car\nScotland Yard\nsecret police\nSpecial Branch\nstation house\nSWAT team\nwarrant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\nAdd to word list\nAdd to word list\nan official force whose job is to maintain public order, deal with crime, and make people obey the law, or the members of this force: I think you should call the police. Police arrested two people in connection with the robbery.\nto control or maintain order, esp. with police: Security forces policed the border. It’s up to the government to police the financial markets.\nAdd to word list\nAdd to word list\nto make sure that the rules of an activity, organization, industry, etc. are obeyed: It's impossible for the moderator to police all the comments that have been posted.\nto control the way in which a possibly dangerous substance is dealt with or a dangerous activity is done: The use of these chemicals must be carefully policed."}