{"id":282036,"name":"policy","type":"noun","us_sound":"ˈpɑː.lə.si","us_link":"../audio/p/policy.mp3","uk_sound":"ˈpɒl.ə.si","uk_link":"../audio/p/ukpolar015.mp3","content":"policy noun [C]\n(PLAN)\nAdd to word list\nAdd to word list\nB2 a set of ideas or a plan of what to do in particular situations that has been agreed to officially by a group of people, a business organization, a government, or a political party: They believe that Europe needs a common foreign and security policy. What is your party's policy on immigration?\nMore examplesFewer examplesNo smoking is company policy.It was an unpopular policy and caused a number of conflicts within the party.She advises the president on African policy.The school has an enlightened policy of teaching boys to cook.The president's speech heralds a new era in foreign policy.\nSMART Vocabulary: related words and phrases\nPlans and arrangements\naccommodation\nappointed\narrangement\narranger\nbackstop\nblueprint\ncounter-strategy\ncounter-tactic\ndesign\ndone\nexit strategy\nmaster plan\nnon-programme\npackage deal\nparty line\nplan of action\nplanning\npreparation\nTBA\nwalk-in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: government administration & organization\npolicy noun [C]\n(DOCUMENT)\nC1 a document showing an agreement you have made with an insurance company: You should check your policy to see if you're covered for flood damage.\nMore examplesFewer examplesCan you give me the reference number of your policy?Details of the policy are provided in the accompanying booklet.When is the policy due for renewal?I think the policy has expired.My life assurance policy matures in 2005.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nGrammar\nPolitics, political, politician or policy? …\npolicy noun [C]\n(PLAN)\nAdd to word list\nAdd to word list\na set of ideas or a plan for action followed by a business, a government, a political party, or a group of people: The White House said there will be no change in policy.\npolicy noun [C]\n(DOCUMENT)\na document showing an agreement you have made with an insurance company: a life-insurance policy\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; GOVERNMENT, POLITICS, MANAGEMENT a set of ideas, or a plan of what to do in particular situations, that has been agreed officially by a group of people, a business organization, a government, or a political party: The government has finally announced its policy on the regulation of the financial services industry. The oil markets are affected by economic policy. The company policy is that most workers should retire at 60.formulate/develop/implement a policy The company has now implemented its policy of Quality Control.change of policy This move represents a change of policy on the part of the Board.\n[ C ]\n&#160; INSURANCE\n&#160; (also insurance policy) an agreement with an insurance company that it will provide insurance for you against particular risks, or the document showing this: You should check your policy to see if you're covered for flood damage. Make sure to keep your policy document in a safe place. See also\nclosed-door policy\ncollective policy\ncredit policy\ndear-money policy\ndomestic policy\neasy monetary policy\nendowment policy\nfire policy\nfiscal policy\nforeign policy\nView all\nhousehold policy\nincomes policy\nmonetary policy\nmortgage protection policy\nopen-door policy\npaid-up policy\nscorched-earth policy\nstandard fire policy\nsurvivorship policy\nvalued policy\nwith-profits\nwithout profits"}