{"id":282950,"name":"poll","type":"noun","us_sound":"poʊl","us_link":"../audio/p/eus73630.mp3","uk_sound":"pəʊl","uk_link":"../audio/p/ukpolar007.mp3","content":"Add to word list\nAdd to word list\n[ C ] a study in which people are asked for their opinions about a subject or person: We're carrying out/conducting a poll to find out what people think about abortion. The latest opinion poll puts the Democrats in the lead. the polls [ plural ]\nthe places where people vote in a political election: The TV stations agreed not to announce the projected winner until after the polls closed. Thousands of people made their way to the polls to register their vote. These are just some of the issues that drive people to the polls. There isn't much overlap between the reason people go to the movies and the reason they go to the polls. Record numbers of young voters turned up at the polls this year. go to the polls\nto vote: The country will go to the polls on 13 September.\nSee more\nMore examplesFewer examplesA poll was conducted to gauge consumers' attitudes.68% of those questioned in the poll thought noise levels had increased.The poll showed that over 40% of Americans worship on a weekly basis.In a recent opinion poll, a majority of respondents were against nuclear weapons.A straw poll of local inhabitants concluded that British tourists were the worst dressed and Italians the most stylish.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElections\npoll verb [T]\n(ELECTION)\nWhen a person or a political party polls a particular number of votes in an election, they receive that number: With nearly all the votes counted, Mr Soto had polled 67 percent of the vote.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\npoll verb [T]\n(OPINION)\nto ask a person for their opinion as part of a general study of what people think about a subject: Half the people polled said they would pay more for environmentally friendly food.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\npoll noun [C]\n(OPINION)\nAdd to word list\nAdd to word list\na study of a group’s opinion on a subject, in which people are questioned and their answers examined: an opinion poll We took a poll this week.\npoll verb [T]\n(RECEIVE VOTES)\nto receive a particular number of votes in an election: Bob Friedman polled 67% of the vote.\npoll verb [T]\n(OPINION)\nto answer questions as part of a study of a group’s opinion on a subject: Almost 86% of the parents polled said yes, and only 7% said no.\nAdd to word list\nAdd to word list\n[ C ] a process in which a large number of people are asked for their opinions about a subject or person: The poll surveyed 1,282 adults nationwide.carry out/conduct a poll The magazine conducted a poll of 2,000 readers. In a poll recently, 8 out of 10 people stated that they were worried about debt. A recent opinion poll revealed that just one in four voters wants to see the party in power. See also\nsurvey noun\nPOLITICS\n&#160; (also the polls [ plural ]) the fact of voting in a political election, or the places where people vote: Voters' opinions will become clear at the polls. Next month the country will go to the polls in both presidential and parliamentary elections.\nthe poll\nPOLITICS the number of votes in an election: She was elected decisively, with over 70% of the poll.\n[ C ] an occasion when people in a group, company, etc. vote for or against something at a meeting: Each ordinary share carries one vote in the event of a poll of shareholders. See also\nexit poll\nGallup poll\nstraw poll\nto ask a large number of people for their opinions about a particular subject: poll sb on sth We poll employees on their views on particular aspects of company policy. Only one in five of those polled were in favour of the government's proposals.\nPOLITICS to receive a number of votes in an election: To win a seat, a candidate had to poll 50% plus one vote."}