{"id":282141,"name":"polyester","type":"noun","us_sound":"ˌpɑː.liˈes.tɚ","us_link":"../audio/p/polyester.mp3","uk_sound":"ˌpɒl.iˈes.tər","uk_link":"../audio/p/ukpolka016.mp3","content":"polyester noun\n(MATERIAL)\nAdd to word list\nAdd to word list\n[ U or C ] an artificial material that is a kind of plastic, often used for making clothes, bags, tents, etc.: The backpack is made of hard-wearing polyester. a polyester shirt Rugs from the modern era also make use of modern fabrics such as polyesters and brightly-coloured cottons.\nMore examplesFewer examplesMost football strips are made from polyester.Wearing a garment made of mainly polyester or viscose will make you hot under the collar.Today polyester fleece is the uniform of hikers, climbers, and backpackers.\nSMART Vocabulary: related words and phrases\nTextiles made from man-made fibres\nacetate\nborg\nCrimplene\nDacron\nfaille\nfleece\nfun fur\nlame\nLycra\nmemory foam\nmicrofibre\nMinky\nneoprene\nPUL\nrayon\nsharkskin\nsherpa\nsmart fibre\nvelour\nviscose\nSee more results »\npolyester noun\n(TYPE OF POLYMER)\n[ C ]\n&#160; chemistry\n&#160; specialized a polymer (= a chemical substance consisting of large molecules made from many smaller and simpler molecules) in which the polymer units are joined by esters (= substances produced by a reaction between an acid and an alcohol): Polyesters are another type of condensation polymer. Polyesters can be made by reacting dicarboxylic acids with diols.\nMore examplesFewer examplesPolyesters are polymers whose monomers are bonded to each other via the ester link, COO. A polyester called PBAT is widely used in agriculture.As in other polyesters, the multiple repeating units that make up the long, chainlike polyarylate molecules are linked together by ester groups.\nSMART Vocabulary: related words and phrases\nChemistry: types of chemical\nacid salt\naerogel\nalkali metal\nalkaline\nalkalinity\nantioxidant\ncarbohydrate\ninorganic\nketone\nlectin\nmelamine\nmethyl orange\nmonomer\nmonosaccharide\nmothball\npropellant\nreactant\nsaline\nsoluble\nsulphide\nSee more results »\nAdd to word list\nAdd to word list\na cloth made from artificial substances: polyester pants"}