{"id":282025,"name":"polychrome","type":"adjective","us_sound":"ˈpɑː.li.kroʊm","us_link":"../audio/p/cdo0623uspoly3042.mp3","uk_sound":"ˈpɒl.i.krəʊm","uk_link":"../audio/p/cdo0623ukpoly3066.mp3","content":"Add to word list\nAdd to word list\nhaving more than one colour: Lela Gutierrez was known for making polychrome pottery. Polychrome statues of little-known saints stood around the altar.\nMore examplesFewer examplesGiant polychrome vases depict palace scenes.One of the exhibits is a polychrome barrel-shaped bowl decorated with monkeys.The widespread adoption of polychrome decoration is the traditional marker for the beginning of the Early Classic in much of the Maya area.\nSMART Vocabulary: related words and phrases\nMonochrome & multi-coloured\ncolourway\nin glorious technicolor idiom\niridescence\niridescent\niridescently\nmonochrome\nmulti-hued\nmulticolour\nmulticoloured\nopalescence\nopalescent\npied\nprismatic\npsychedelically\nrainbow\nsolid\ntechnicolor\ntwo-tone\nunicorn\nSee more results »\na painting, photograph, or other piece of art that has more than one colour: Most fine polychromes date to the Late Classic period. Compare\nmonochrome in polychrome\nusing more than one colour: He continued to carve his large heads, sometimes in polychrome, until 1915. The courtroom seal is in polychrome and depicts the scales of justice with the state motto on a banner below.\nMore examplesFewer examplesNot all polychromes are indicative of high-ranking elites.The complex texts and images presented on Classic Maya polychromes have driven research for more than 150 years.Polychromes were manufactured in or near the Copan valley and arrived at San Andrés ready for redistribution.\nSMART Vocabulary: related words and phrases\nMonochrome & multi-coloured\ncolourway\nin glorious technicolor idiom\niridescence\niridescent\niridescently\nmonochrome\nmulti-hued\nmulticolour\nmulticoloured\nopalescence\nopalescent\npied\nprismatic\npsychedelically\nrainbow\nsolid\ntechnicolor\ntwo-tone\nunicorn\nSee more results »"}