{"id":283432,"name":"pool","type":"noun","us_sound":"puːl","us_link":"../audio/p/pool.mp3","uk_sound":"puːl","uk_link":"../audio/p/ukponti011.mp3","content":"pool noun\n(LIQUID)\nAdd to word list\nAdd to word list\nB2 [ C ] a small area of usually still water: We looked for crabs in the rock pools along the seashore.\njohnnya123/iStock/Getty Images Plus/GettyImages\nB2 [ C ] a small amount of liquid on a surface: a pool of blood/oilfigurative a pool of light\nA2 [ C ] a\nswimming pool : I spent most of my holiday lying/sunbathing by the pool.\nscanrail/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe boys were splashing about and ducking each other in the pool.I just managed to grab hold of Lucy before she fell in the pool.a pool of sunlightShe looked at her reflection in the deep green pool of water.She dipped her toe into the pool to see how cold it was.\nSMART Vocabulary: related words and phrases\nInland waters\nbody\ncatchment area\ncrater lake\nfiord\nfjord\nL, l\nlake\nLake Baikal\nloch\nlough\nmillpond\noasis\noxbow lake\nreservoir\nribbon lake\nslop\nstretch\ntank\ntarn\nthe Great Lakes\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWater in general\nSwimming\npool noun\n(COLLECTION)\n[ C ] a number of people or a quantity of a particular thing, such as money, collected together for shared use by several people or organizations: Patrick crashed a Ford that he'd borrowed from the car pool at work. As unemployment rises, the pool of cheap labour increases.\nMore examplesFewer examplesDuring times of mass unemployment, there's a pool of cheap labour for employers to draw from.Did Gary win the office pool?Everybody puts some money into a common pool.We need a reserve pool of cash, just to be on the safe side.We're recruiting from a large pool of graduate lawyers.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\ngeneration\npackage\npermutation\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\npool noun\n(MONEY)\n[ C ] in some card games, an amount of money that is collected from all the players and received by the player who wins the game\n[ C ] US the money risked by a number of people on the result of a game or event: a baseball/football/hockey pool the office pool Who won the pool? the pools [ plural ] UK (also football pools)\na type of gambling in which people risk a small amount of money and try to guess the results of football games correctly and win a lot of money: do the pools They do the pools every week. His brother won £150,000 on the pools. Other than winning the football pools, we have no chance of owning our own house. She booked the cruise after a lucky win on the pools. When she was in her thirties, she won a small fortune on the football pools.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\njack\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\nGambling & bookmaking\npool noun\n(GAME)\nB1 [ U ] a game in which two people use cues (= long, thin poles) to hit 16 coloured balls into six holes around the edge of a large table covered in soft cloth: a pool table/room/hallmainly US informal Do you want to shoot (= play) some pool? Compare\nsnooker noun\nDave and Les Jacobs/Blend Images/GettyImages\nSMART Vocabulary: related words and phrases\nSnooker, pool & billiards\nbilliard\nbilliard ball\nbilliards\nbreak\nbreak (something) off\ncannon\ncarom\ncue\ncushion\nframe\nmiscue\npocket\nrack\nre-rack\nre-spot\nshoot\nsnooker\nsnooker ball\ntriangle\nSee more results »\nto collect something such as money in order for it to be used by several different people or groups: The kids pooled their money to buy their parents a wedding anniversary gift.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\npool noun\n(LIQUID)\nAdd to word list\nAdd to word list\n[ C ] a small area of usually still water, or a small amount of liquid: pools of water in the gutter a pool of blood\n[ C ] A pool is also a swimming pool.\npool noun\n(COLLECTION)\n[ C ] an amount of money or a number of people or things collected together for shared use by several people or organizations: Their profits get plowed back into a pool to pay subscribers’ claims.\n[ C ] A pool is also the total amount of money risked by people on the result of a card game or sports event: an office Super Bowl pool\npool noun\n(GAME)\n[ U ] a game played by two or more people in which a cue (= long, round stick) is used to hit a white ball against other balls in order to roll them into one of six holes around the edge of a special table: a pool table\nto combine your money with money from a number of other people for shared use: The kids pooled their money to buy their parents plane tickets.\nAdd to word list\nAdd to word list\na quantity of a particular thing or money that is collected and used by different people or organizations: You can buy shares directly via a stockbroker or invest in a pool of shares run by a professional fund manager. You can use a car from the car pool for your trip.\nWORKPLACE, HR a number of people who are available to work when needed: We are creating a pool of workers who are willing and able to fill such positions. Many companies are considering outsourcing some of their operations in order to tap into a cheaper pool of labour.\nINSURANCE a group of insurance companies that work together to provide insurance for something that a single insurance company cannot provide insurance for alone: a high-risk insurance pool\nSee also\nblind pool\ncarpool noun\nmotor pool\nto share something such as money, information, etc. so that it can be used by several different people or groups: The countries agreed to pool resources for defence purposes. They pool money from thousands of different investors and put it into a wide range of companies. pool experience/knowledge/talents"}