{"id":283462,"name":"poor","type":"adjective","us_sound":"pʊr","us_link":"../audio/p/poor.mp3","uk_sound":"pɔːr","uk_link":"../audio/p/ukponti016.mp3","content":"poor adjective\n(NO MONEY)\nAdd to word list\nAdd to word list\nA1 having little money and/or few possessions: Most of the world's poorest countries are in Africa. He came from a poor immigrant family. Synonym\nindigent formalOpposite\nrich\nThesaurus: synonyms, antonyms, and examples\nnot having much or enough moneypoorHer family was poor and didn't own a computer.pennilessAt the time, I was a penniless student.impoverishedBenefits should be targeted at the most impoverished families.disadvantagedThe scheme was set up to help disadvantaged children.deprivedDeprived areas will be hardest hit by the cuts.\nSee more results »\nbe poor in something\nB2 to have very little of a particular substance or quality: Unfortunately, Iceland is poor in natural resources.\nSee more\nMore examplesFewer examplesThe demonstrators seemed to be from a complete cross-section of society - male and female, old and young, rich and poor.Because of debt repayments, the divide between rich and poor countries is continuing to grow.Fair trade, say Oxfam, is about giving poor people power.When he started he was just a poor boy from the slums - now he's a multimillionaire.We certainly don't lead a life of luxury but we're not poor either.\npoor adjective\n(BAD)\nB2 not good; being of a very low quality, quantity, or standard: a poor harvest Last year's exam results were fairly poor. I was always very poor at maths at school. Dad had been in poor health for several years. At last month's meeting, attendance was poor.\nThesaurus: synonyms, antonyms, and examples\nbad weather, conditions, situations, etc.badIf the weather is bad, we'll have to find something else to do.poorShe's 87 and in poor health.direThe predictions for the economy are dire.grimShe was quickly brought back to the grim reality of her life.awfulThe smell from the bins was awful.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nof bad qualitybadThe food wasn’t as bad as I’d expected.poorTheir efforts produced extremely poor results.low/poor/bad qualityTheir sausages are made with low-quality meat.mediocreThe striker has been dropped after a mediocre performance.inferiorThe copies are of inferior quality.\nSee more results »\nMore examplesFewer examplesThis novel is available in large print for readers with poor eyesight.Teachers shouldn't have to take all the blame for poor exam results.The land is so poor here that it cannot support any crops.The match was abandoned at half-time because of the poor weather conditions.He was fired from his $165 000 job for poor performance.\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ndownscale\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\ntawdrily\ntawdriness\ntawdry\nthinness\nthird-class\ntrinket\nwretched\nSee more results »\npoor adjective\n(DESERVING SYMPATHY)\nA2 [ before noun ] deserving sympathy: That cold sounds terrible, you poor thing! Look at that dog - the poor thing only has three legs.\nMore examplesFewer examplesHe neglects that poor dog - he never takes him for walks or gives him any attention.I hear poor old Frank's lost his job.The poor things were kept in small cages without room to move.The poor bird couldn't fly because it had a broken wing.You poor thing - you're all wet.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nrelate\nsensitivity\nsympathetic\nsympathize\nsympathy\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nIdioms\nbe as poor as a church mouse\ncome/be a poor second, third, etc.\npoor man's...\npoor relation\nthe poor\nC1 poor people considered together as a group: housing for the poor Opposite\nthe rich\npoor adjective\n(NO MONEY)\nAdd to word list\nAdd to word list\n[ -er/-est only ] having little money or few possessions, or lacking something important: He came from a poor, immigrant family. Most of the world’s poorest countries are in Africa. The country is poor in natural resources.\npoor adjective\n(BAD)\n[ -er/-est only ] of a very low quality or standard; not good: poor eyesight poor grades He’s in very poor health.\npoor adjective\n(DESERVING SYMPATHY)\n[ not gradable ] deserving sympathy: That poor dog looks like it hasn’t been fed in a while.\npoor plural noun\n(NO MONEY)\npoor people: She gives a lot of money to the poor.\nAdd to word list\nAdd to word list\nhaving little money and/or few possessions: It's offering to pay off 10 percent of the poor countries' debt. He came from a poor immigrant family.\nnot good or operating well, or of a low quality or standard: The retailer has had two poor Christmases in a row. PinnFund specialized in mortgage loans for borrowers with poor credit. He was fired for poor job performance.\nbe poor in sth\nto have very little of a particular substance or quality: Greece is relatively poor in natural resources."}