{"id":283616,"name":"population","type":"noun","us_sound":"ˌpɑː.pjəˈleɪ.ʃən","us_link":"../audio/p/population.mp3","uk_sound":"ˌpɒp.jəˈleɪ.ʃən","uk_link":"../audio/p/ukpopsi011.mp3","content":"Add to word list\nAdd to word list\nB1 all the people living in a particular country, area, or place: Ten percent of the population lived in poverty. In 1992 the population of Cairo was approximately 6,500,000. a growing/shrinking population Throughout the war, there were horrific casualties among the civilian populations of both countries. The UN is investigating new methods of population control (= limiting the growth of the number of people). The country is facing a population explosion (= sudden growth in the number of people).\nB2 all the people or animals of a particular type or group who live in one country, area, or place: There's been a nine percent rise in the prison population (= the number of people in prison). The dolphin population has been decimated by tuna fishing.\nMore examplesFewer examplesChildren make up a large proportion of the world's population.The population as a whole is getting healthier.The early settlers enslaved or killed much of the native population.In the past eight years, the elephant population in Africa has been halved.Many of the world's cities have populations of more than five million.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nAdd to word list\nAdd to word list\nall the people living in a particular country, area, or place: [ U ] What is the population of Toronto (= how many people live there)?\nbiology Population is also used to refer to all the living things of a particular type or group who live in a particular area or environment.\nAdd to word list\nAdd to word list\n[ S or U ] the number of people living in a particular country, area, or town: a population of 12,000/175,000/13 million, etc. With a population of 2.1 million, it is the country's 25th largest metropolitan area. We've seen a slow but steady decline in population over the years. In these countries there is still rapid population growth.\n[ S ] all the people living in a particular country, area, or town: 10% of the population were living in poverty.\n[ C, usually singular ] all the people or animals of a particular type or group that live in one country, area, or town: More than half of the world's working population has no formal employment or social security arrangements. With the restrictions on hunting, deer populations have begun to grow.\nSee also\nactive population\nfloating population"}