{"id":283593,"name":"popular","type":"adjective","us_sound":"ˈpɑː.pjə.lɚ","us_link":"../audio/p/popular.mp3","uk_sound":"ˈpɒp.jə.lər","uk_link":"../audio/p/ukpopsi004.mp3","content":"popular adjective\n(LIKED)\nAdd to word list\nAdd to word list\nA2 liked, enjoyed, or supported by many people: She's the most popular teacher in school. That song was popular with people from my father's generation. Walking is a popular form of exercise in Britain. How popular is Madonna among/with teenagers?informal Jan wasn't very popular (= people were annoyed by her) when she opened all the windows on that cold day. Opposite\nunpopular\nMore examplesFewer examplesThe government's policies have not been popular with the voters.The potato is the most popular vegetable in Britain.This particular stretch of coast is especially popular with walkers.At school he was popular and self-confident, and we weren't surprised at his later success.It's the good weather that makes Spain such a popular tourist destination.\nSMART Vocabulary: related words and phrases\nLiked, or not liked, by many people\nacquire\nan acquired taste idiom\nanti-popular\nbe the new rock and roll idiom\nbe welcome to idiom\ncult\nhigh-traffic\nin someone's bad books idiom\nin someone's good books idiom\nkiller app\nlimb\nlose ground phrase\nlow-traffic\npopularize\nrock and roll\nsought after\ntop-rated\ntrend\nunappreciated\nviral\nSee more results »\npopular adjective\n(GENERAL)\nB2 [ before noun ] for or involving ordinary people rather than experts or very educated people: popular music/entertainment/culture The issue was virtually ignored by the popular press. The popular myth is that air travel is more dangerous than travel by car or bus.\nMore examplesFewer examplespopular cultureContrary to popular opinion, I don't dye my hair!The tabloid newspapers have fastened on popular psychology.We hope our work will help to change popular misconceptions about disabled people.He owed his popular support to the potency of his propaganda machine.\nSMART Vocabulary: related words and phrases\nOrdinary people\nbanausic\ncommonalty\ncommunity\nEssex girl\ngrassroots\nJoe Public\nJohn Doe\nJohn Q. Public\nman/woman of the people idiom\nmass market\nmortal\nomnibus\npopularly\nprole\npublic\nrabble\nrank and file\nruck\nthe common man idiom\nthe man/woman in the street idiom\nSee more results »\npopular adjective\n(LIKED)\nAdd to word list\nAdd to word list\nliked, enjoyed, or admired by many people or by most people in a particular group: In-line skating is increasingly popular.\npopular adjective\n(GENERAL)\ninvolving or relating to ordinary people or to all the people who live in a country or area: Contrary to popular belief, air travel is less dangerous than travel by car. popularity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌpɑp·jəˈlær·ɪ·t̬i/\nThe governor’s popularity will probably guarantee his reelection."}