{"id":283932,"name":"portfolio","type":"noun","us_sound":"ˌpɔːrtˈfoʊ.li.oʊ","us_link":"../audio/p/portfolio.mp3","uk_sound":"ˌpɔːtˈfəʊ.li.əʊ","uk_link":"../audio/p/ukporta013.mp3","content":"portfolio noun [C]\n(CASE)\nAdd to word list\nAdd to word list\na large, thin case used for carrying drawings, documents, etc.\nvladvvm/iStock/Getty Images Plus/GettyImages\na collection of drawings, documents, etc. that represent a person's, especially an artist's, work: She's trying to build up a portfolio of work to show during job interviews.\nSMART Vocabulary: related words and phrases\nGeneral and miscellaneous containers\nBall jar\nbin\nbindle\nbiscuit tin\ncaddy\ndrum\nflowerpot\ngeocache\ngift box\ngunnysack\npacking case\npaintbox\npallet\npiggy bank\nplanter\nuncase\nurn\nvivarium\nworkbasket\nworkbox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\nportfolio noun [C]\n(FINANCIAL)\nfinance &amp; economics\n&#160; specialized a collection of company shares and other investments that are owned by a particular person or organization\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nportfolio noun [C]\n(JOB)\npolitics\n&#160; UK specialized a particular job or area of responsibility of a member of a government: The prime minister offered her the foreign affairs portfolio. without portfolio politics\n&#160; UK specialized\nIn Britain, a minister without portfolio is an important government official who is not in charge of a particular department, but who still takes part in the decisions of the government: He knows that life will not be simple when he takes up his post as minister without portfolio in the cabinet.\nSee more\nSMART Vocabulary: related words and phrases\nUK politics: government administration & organization\napex\nawkward\nbackbench\nBrexit\nHolyrood\nhung parliament\nparliamentarian\nparliamentary\npartition\npartitionist\nPMQs\npublic policy\nquasi-public\nreprivatization\nreprivatize\nreshuffle\nthe awkward gang idiom\nthe House of Commons\nthe House of Lords\nthe Houses of Parliament\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDuty, obligation and responsibility\nportfolio noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\na large, flat container used for carrying large drawings, documents, or other papers\nart A portfolio is also a collection of drawings, designs, or other papers that represent a person’s work.\nportfolio noun [C]\n(INVESTMENTS)\na collection of investments that are owned by a particular person or organization: a stock portfolio\nAdd to word list\nAdd to word list\nFINANCE a collection of different investments that are owned by a particular person or organization: an investment portfolio a property portfolio have/hold a portfolio These funds are less risky because you hold a portfolio selected and monitored by a specialist manager. build (up) a portfolio You could build up a portfolio including UK funds.a balanced/diversified portfolio It's a diversified portfolio, which will lower the risk.a global/international portfolio These funds are impossible to ignore if you want a broad international portfolio.a bond/stock/share portfolio These shares should amount to no more than 10 or 20% of a stock portfolio.\nCOMMERCE, FINANCE the range of products or services that a company offers, or the businesses that someone owns: Customer reaction to our product portfolio has been extremely positive. The hotel group's brand portfolio includes about 15 complementary brands, from luxury to budget hotels.strong/broad portfolio We will continue to have a strong portfolio of businesses with an annual turnover of approximately £1.65bn. build up/expand a portfolio He and associates want to build up a portfolio of money-making websites.\nGOVERNMENT the particular job or area of responsibility that a member of a government has : One of the most significant changes is in the trade portfolio."}