{"id":283877,"name":"portal","type":"noun","us_sound":"ˈpɔːr.t̬əl","us_link":"../audio/p/portal.mp3","uk_sound":"ˈpɔː.təl","uk_link":"../audio/p/ukporta004.mp3","content":"portal noun [C]\n(WAY TO GET STH)\nAdd to word list\nAdd to word list\na way to get or do something: The laptop is my portal to the outside world. The Post Office has lost any sense that its core business is to provide a portal to delivery services.\ninternet &amp; telecoms\n&#160; specialized a website or page on the internet that allows people, especially a group of people who are interested in a particular subject, to get useful information and to find other websites: A number of large access providers offer portals to the Web for their own users. There are a huge number of knit and crochet resources online, from trade association portals to blogs.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nportal noun [C]\n(ENTRANCE)\nformal (also portals [ plural ]) an entrance to a building, especially a large or important one: Carrell's name remains above the portal to this day. Passing through the portals of the BBC for the first time, she felt slightly nervous.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorstop\ndoorway\ndraught excluder\nentryway\nfire door\nknocker\nlintel\npurging\nrevolving door\nsafety gate\nscreen door\ntrapdoor\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: passages & entrance areas\nanatomy , medical\n&#160; specialized relating to an opening to an organ in the body, especially the opening where blood vessels (= thin tubes that carry blood) enter the liver (= a large organ that cleans the blood): A liver biopsy reveals portal fibrosis. Nerve fibres are abundant in the liver, particularly in the portal triads.\nanatomy , medical\n&#160; specialized relating to a system in the body in which blood flows from capillaries (= very thin tubes) of one organ, through larger blood vessels (= tubes), to capillaries of another organ, before returning to the heart : Ultimately these veins drain into the portal system. The problem sometimes results from obstruction of the portal circulation.\nanatomy , medical\n&#160; specialized relating to the portal vein (= a major vein in the body that leads to the liver): Portal hypertension is a common related condition that is caused by liver damage. Clotting time increases because the high portal pressure backs up blood into the spleen, destroying platelets.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe circulatory system & blood\nSee also\nportal vein\nportal noun [C]\n(BUILDING)\nAdd to word list\nAdd to word list\nfml us\nYour browser doesn't support HTML5 audio\n/ˈpɔr·təl, ˈpoʊr-/ a large and often highly decorated entrance to a building: We entered the side portal of the cathedral.\nportal noun [C]\n(INTERNET)\nus\nYour browser doesn't support HTML5 audio\n/ˈpɔr·təl, ˈpoʊr-/ a page on the World Wide Web that users can change so it shows information they want to see: The portal lets you access specific information from anywhere in the site.\nAdd to word list\nAdd to word list\nINTERNET a website that collects information on a particular subject and has links (= connections) to other websites with related information: Welcome to the Murray Portal, an educational resource for all those involved in teaching and learning."}