{"id":284014,"name":"portrait","type":"noun","us_sound":"ˈpɔːr.trɪt","us_link":"../audio/p/eus73655.mp3","uk_sound":"ˈpɔː.trət","uk_link":"../audio/p/ukporta025.mp3","content":"Add to word list\nAdd to word list\nB2 a painting, photograph, drawing, etc. of a person or, less commonly, of a group of people: She's commissioned an artist to paint her portrait/paint a portrait of her. a portrait gallery a portrait painter\nCyndi Monaghan/Moment/GettyImages\nA film or book that is a portrait of something describes or represents that thing in a detailed way: Her latest novel paints a very vivid portrait of the aristocracy in the 1920s.\nMore examplesFewer examplesan exceptionally fine portraita lifelike portrait of the queenThe portrait was finished after only three sittings.It was said that the portrait was a very true likeness of her.The movie paints a very vivid portrait of family life during the 1950's.\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npastel\npencil\nposter\nraster\nrehang\nscreen print\nshade\nsketch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounts and stories\nA portrait computer document is to be printed with the shorter side of the paper at the top and bottom. Compare\nlandscape adjective\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nAdd to word list\nAdd to word list\na painting, photograph, or drawing of a person\nA portrait is also a description or representation of something: The book paints a grim portrait of wartime suffering.\nAdd to word list\nAdd to word list\nused to describe a computer document that is to be printed with the shorter side of the paper at the top and bottom: The design was intended to be distributed in printed form, so the pages are laid out for printing in A4 portrait format. Compare\nlandscape"}