{"id":283960,"name":"portion","type":"noun","us_sound":"ˈpɔːr.ʃən","us_link":"../audio/p/portion.mp3","uk_sound":"ˈpɔː.ʃən","uk_link":"../audio/p/ukporta019.mp3","content":"Add to word list\nAdd to word list\nC1 a part or share of something larger: A large/major portion of the company's profit goes straight back into new projects. I accept my portion of the blame.\nB2 the amount of a particular food that is served to one person, especially in a restaurant or a shop that sells food ready to be eaten: The portions are very generous in this restaurant.\nMore examplesFewer examplesShe donated a sizeable portion of her riches to children's charities.A good rule of thumb is that a portion of rice is two and a half handfuls.Just a modest portion for me, please.The school would only receive a very small portion of the profits.A very large portion of our income goes to pay the mortgage.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nsubsegment\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFood - general words\nAdd to word list\nAdd to word list\na part or share of something larger: She read large portions of the manuscript and offered many useful suggestions. A portion of my paycheck was withheld for taxes.\nA portion is also the amount of food served to or suitable for a person: They serve children’s portions at half-price.\nAdd to word list\nAdd to word list\na part or share of something larger: A large portion of the company's profits is ploughed back into new projects. These products account for a relatively small portion of sales.\nCOMMERCE the amount of a particular food that is enough for one person, especially in a restaurant, etc.: Bar food, lunchtime and evening, comes in generous portions. They kept their costs down by minimizing waste and having strict portion control."}