{"id":284091,"name":"position","type":"noun","us_sound":"pəˈzɪʃ.ən","us_link":"../audio/p/position.mp3","uk_sound":"pəˈzɪʃ.ən","uk_link":"../audio/p/ukposer007.mp3","content":"position noun\n(PLACE)\nAdd to word list\nAdd to word list\nB1 [ C ] the place where something or someone is, often in relation to other things: Well, I've found our position on the map if you want to see where we are. You've moved the furniture around - the sofa is in a different position.\n[ C ] (in team sports) the part someone plays in a game, relating to the area of the field in which they mostly play: I didn't know you played hockey - what position do you play?\nC1 [ C or U ] the place where people are sent in order to carry out a course of action: The troops took up their battle positions at the front line. As soon as his officers were in position/had moved into position, the police commander walked up the path towards the house.\nMore examplesFewer examplesSince the volcano last erupted, many houses have been built in a dangerous position on its slopes.The house is in a very exposed position.The shop front occupies a very prominent position on the main street.The blocks of stone had to be lifted into position with a system of pulleys.Can you hold this nail in position while I hammer it into the door?\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfar\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nPlaces and locations\nposition noun\n(SITUATION)\nB1 [ C usually singular ] a situation: My financial position is somewhat precarious at the moment. When two of your best friends argue, it puts you in a very awkward position. be in a position to do something\nC1 to be able to do something, usually because you have the necessary experience, authority, or money: I'm not in a position to reveal any of the details of the project at present.\nSee more\nMore examplesFewer examplesShe's in the enviable position of being able to choose who she works for.The company is in a bad financial position because of overproduction and distribution problems.When friends divorce, you can find yourself in a really awkward position.As a convicted criminal, he's in no position to pass judgment on the rest of us.She's in an impossible position - she's got to leave him but she can't bear losing her children.\nSMART Vocabulary: related words and phrases\nSituations and circumstances\naffair\nbackdrop\nbackground\nbusyness\ncase\ncircumstance\ncomedy of errors\ncondition\nfarce\nfinancial affairs\nfooting\ngoing\nlandscape\npracticality\nscheme\nsituation\nsituational\nstake\nthe scheme of things idiom\nthing\nSee more results »\nposition noun\n(RANK)\nB2 [ C ] a rank or level in a company, competition, or society: Whether or not you're given a car depends on your position in the company.UK She finished the race in third position.\nB2 [ C ] a job: She applied for a position in the firm that I work for. Synonyms\nappointment (JOB)\njob (EMPLOYMENT)\npost (JOB)\nsituation old useCompare\nemployment (WORK)\nwork noun (ACTIVITY)\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\nMore examplesFewer examplesThere is a growing number of women in high-profile positions in the government.This course aims to prepare students for middle and senior managerial positions.The Italian champion was in second position when he came to grief on the third lap.He currently holds the position of technical manager.Manchester United and Liverpool are jousting for position at the top of the football league.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nposition noun\n(ARRANGEMENT)\nB1 [ C ] the way in which something is arranged: Keep the bottles in an upright position. Rotate it slowly from the horizontal into a vertical position.\n[ C ] the way in which someone is lying, sitting, or standing: This is not a very comfortable position. I go to sleep on my back but I always wake up in a different position. You might feel more comfortable in a sitting position.\nMore examplesFewer examplesCan you hold this nail in position while I hammer it into the door?Fishing nets are often held in position by floats.Please return your seat to an upright position and fasten your belt.\nSMART Vocabulary: related words and phrases\nPosture\nattitude\nbearing\ncarriage\ncarry\ncrossed\ndeportment\northostatic\npose\npostural\nposture\npower pose\npower posing\nsoldierly\nstrike\nstrike an attitude idiom\nsuck\nsuck something in\nposition noun\n(OPINION)\n[ C usually singular ] formal an opinion: What's the company's position on recycling? He takes the position (= believes) that individuals have a responsibility to look after themselves.\nThesaurus: synonyms, antonyms, and examples\na feeling or opinion about something or someoneattitudeHis attitude towards authority has often got him into trouble.outlookI wish I could share your positive outlook on life.frame of mindI need to be in the right frame of mind to talk about this.approachIt's time to try a different approach to the problem.viewpointHis viewpoint is his own and does not affect how I think about the issue.point of viewFrom a strictly financial point of view it looks like a positive change.\nSee more results »\nMore examplesFewer examplesThe prime minister has adopted an inflexible position on immigration.The group has taken a militant position on the abortion issue and is refusing to compromise.You've made your position quite clear .Do we have a fallback position for these negotiations?I think we need to reconsider our position.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nto put something or someone in a particular place: The army had been positioned to the north and east of the city. When it came to seating people for dinner, I positioned myself as far away from him as possible.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nposition noun\n(PLACE)\nAdd to word list\nAdd to word list\n[ C/U ] the place where something or someone is, often in relation to other things: [ C ] I’ve switched the positions of the sofa and the chair.\n[ C/U ] In sports, a position is the place where you play on your team, or the responsibilities of someone who plays in that place: [ C ] He played the shortstop position when he started in baseball.\nposition noun\n(RANK)\n[ C ] a rank or level in a company, competition, or society: She’s devoted her life to improving the position of women in society.\n[ C ] A position in a company or organization is also a job: He applied for the position of marketing manager.\nposition noun\n(SITUATION)\n[ C usually sing ] a situation or condition: a shaky financial position She found herself in a difficult position and didn’t know what to say.\n[ C usually sing ] If you are in a position to do something, you are able to do it, usually because you have the necessary power or money: [ + to infinitive ] Do you think she’s in a position to help you?\nposition noun\n(OPINION)\n[ C ] a way of thinking about a particular matter; opinion: Our position is that we’ve made a very fair offer to settle this dispute.\nposition noun\n(ARRANGEMENT OF BODY)\n[ C ] the way in which the body is arranged: My knees get stiff when I sit in the same position for a long time. position verb [ T ] us\nYour browser doesn't support HTML5 audio\n/pəˈzɪʃ·ən/\nThe Secret Service men quickly positioned themselves around the president.\nAdd to word list\nAdd to word list\nHR, WORKPLACE a job, especially one that is important: advertise/fill a position We hope to fill the position within the next two months.apply for/take up/fill a position She will soon take up an important position with a firm of lawyers. He filled the position of Executive Director recently vacated by Terry John.\na rank or level of success in a company, in society, etc.: establish/gain/hold a position He took advantage of every opportunity to establish his position within the company.strengthen sb's position Industry insiders said the move would strengthen the position of the chief executive on the board.\na situation that someone or something is in: The bank's position looks difficult, to say the least.put sb/sth in a position This decision put me in an awkward position with regard to my staff. They were not willing to release details of the company's financial position.be in a strong/weak position Luckily, we were in a strong position compared to the competition.reach a/the position We want to reach a position where we can pay off the debt.consolidate/strengthen/weaken sb's position This news will serve to consolidate our position in the market.\nan opinion on an important subject: position on sth What's the company's position on outsourcing?take the position that The Board will certainly take the position that their decision was justified.take a position (on sth) When you are negotiating, you will need to take a position and be prepared to stick to it.\nFINANCE the fact of investing in something, or the total amount that is invested: take a position (on sth) Investors can take a position on any stock quoted in London.hedge a position The riskier the stock, the more you will need to hedge your position.\nbe in a position to do sth\nto be able to do something, usually because you have the necessary experience, authority, or money: Nine months ago, we were not in a position to announce the expansion plan.\nSee also\nbear position\nbull position\ncash position\nisland position\nlong position\nopen position\nshort position\nspecial position\nto put something or someone in a particular position or situation: The company has positioned itself as the country's leading textile manufacturer.be well/ideally positioned to do sth We are well positioned to be able to deal with a downturn in the economy.\nMARKETING to advertise a product or service so that people think about it in a particular way, and so that it is attractive to a particular part of the market: position sth as sth Its high-end price ticket has positioned it as a luxury item."}