{"id":284146,"name":"possession","type":"noun","us_sound":"pəˈzeʃ.ən","us_link":"../audio/p/possession.mp3","uk_sound":"pəˈzeʃ.ən","uk_link":"../audio/p/ukposer017.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] the fact that you have or own something: The possession of large amounts of money does not ensure happiness.formal I have in my possession a letter which may be of interest to you.formal He was found in possession of explosives.\nB2 [ C usually plural ] something that you own or that you are carrying with you at a particular time: Please remember to take all your personal possessions with you when you leave the aircraft.\n[ C usually plural ] a country that is ruled by another country: a former overseas possession\n[ U ] in games such as football and rugby, the time when a team has control of the ball: Wolves had a lot of possession but failed to score. We need to keep possession of the ball to give ourselves a chance. get/take possession of something law\n&#160; specialized\nto start to use and control something such as a building or piece of land that you may or may not own: We've already bought the house but we won't take possession of it until May.\nSee more\nMore examplesFewer examplesPolice found a large quantity of drugs in his possession.Her most cherished possession is a 1926 letter from F. Scott Fitzgerald.She attaches a lot of importance to personal possessions.Her photograph is among my most prized possessions.This pen that my grandfather gave me is one of my most treasured possessions.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbear\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert to something\nshared ownership\nstake something out\nsurvey\nthey've\ntraditional owner\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBelongings and possessions\nColonization & self-government\nGeneral terms used in ball sports\nGrammar\nApostrophe + s to show possessionWhen we show who owns something or has a close relationship with something, we use an apostrophe + s after the name or the noun. When the noun is plural, we put the apostrophe after the s: …\nPossessive ’sWe use apostrophe s (’s), also called possessive ’s, as a determiner to show that something belongs to someone or something: …\nPossessives with ofWe can talk about possession using the pattern: noun phrase + of + possessive pronoun: …\n’s or of or either?There are some general rules about when to use ’s and when to use of but there are many cases where both are possible: …\nPossession: typical errorsWe don’t use ’s with plural nouns: …\nAdd to word list\nAdd to word list\nsomething that you own, or the condition of owning something: [ U ] She couldn’t take possession of the house until the current occupants moved out. [ C ] Meanwhile, all her possessions were in storage. in possession of fml\nIf you are in possession of something you have it with you: He was in possession of two tickets to the concert.\nAdd to word list\nAdd to word list\n[ U ] the situation in which someone has or owns something: in sb's possession No steps may be taken to repossess goods in the company's possession except with the leave of the court.have possession of sth The Court of Appeal admitted that Ms Mountford did have exclusive possession of the property.in possession of sth The ruling did not establish that he was in possession of the disputed land. See also\nfreehold possession\nimmediate possession\nleasehold possession\nprivate possession\nquiet possession\nvacant possession\n[ C, usually plural ] something that someone owns or has with them at a particular time: The value of his possessions came to about $1 million. material/personal possessions\nget/take possession of sth\nto start to use and control goods, a building, or a piece of land, whether you own them or not: Was the bank entitled to take possession of his property and exercise its power of sale without an order of the court? The court appointed a receiver to take possession of the assets of the company.\n[ U ]\n&#160; LAW the crime of having illegal drugs or illegally owning a gun: He is wanted by police on charges of possession of illegal firearms."}