{"id":284160,"name":"possessive","type":"adjective","us_sound":"pəˈzes.ɪv","us_link":"../audio/p/possessive.mp3","uk_sound":"pəˈzes.ɪv","uk_link":"../audio/p/ukposer018.mp3","content":"possessive adjective\n(PERSON)\nAdd to word list\nAdd to word list\nIf you are possessive about something that you own, you do not like lending it to other people or sharing it with other people: He's pretty possessive about his iPod - I wouldn't dare ask to borrow it.\nC2 Someone who is possessive in his or her feelings and behaviour towards or about another person wants to have all of that person's love and attention and will not share it with anyone else: a possessive mother Her boyfriend was getting too possessive so she finished with him.\nThesaurus: synonyms, antonyms, and examples\njealousjealousI'm so jealous that she's going to that concert!enviousShe was very envious of her brother's success.green with envyYou'll be green with envy when you meet her new boyfriend.possessiveShe has a wildly possessive boyfriend who doesn't like her even looking at other men.covetousShe's covetous of his gorgeous house.\nSee more results »\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbear\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake something out\nsurvey\nthey've\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvy and jealousy\npossessive adjective\n(GRAMMAR)\nB1 language In grammar, a possessive word, form, etc. shows who or what something belongs to: \"Mine\" and \"yours\"are possessive pronouns.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nGrammar\nPossessive ’sWe use apostrophe s (’s), also called possessive ’s, as a determiner to show that something belongs to someone or something: …\nPossessives with ofWe can talk about possession using the pattern: noun phrase + of + possessive pronoun: …\n’s or of or either?There are some general rules about when to use ’s and when to use of but there are many cases where both are possible: …\nPossession: typical errorsWe don’t use ’s with plural nouns: …\nAdd to word list\nAdd to word list\n[ not gradable ]\n&#160; grammar having or relating to the case (= form) of a word used to show who or what something belongs to\npossessive adjective\n(OWN)\nIf you are possessive about something that you own, you do not like sharing it: He’s very possessive about his car.\nSomeone who is possessive in feelings and behavior toward another person wants all of that person’s love and attention:"}