{"id":284185,"name":"possibly","type":"adverb","us_sound":"ˈpɑː.sə.bli","us_link":"../audio/p/possibly.mp3","uk_sound":"ˈpɒs.ə.bli","uk_link":"../audio/p/ukposer022.mp3","content":"possibly adverb\n(NOT CERTAIN)\nAdd to word list\nAdd to word list\nA2 used when something is not certain: He may possibly decide not to come, in which case there's no problem.\nThesaurus: synonyms, antonyms, and examples\nused to say you are not certainmaybe\"Do you want to go to the show tonight?\" \"Maybe. Let's see how I feel after work.\"perhapsPerhaps he'll decide to join us tonight.possiblyThere are four, possibly five people who have been injured in the explosion.potentiallyThese potentially unsafe chemicals are present in our groundwater.conceivablyIt would be hard, but a burglar could conceivably shut down your electronic alarm system by hacking into it. plausiblyShe argued, rather plausibly, that her neighbour was the one who took the tools from her allotment.\nSee more results »\nused to agree or disagree when some doubt is involved: \"Do you think this skirt might be too small for her?\" \"(Very) possibly - she has put on a some weight.\" \"Will he come?\" \"Possibly not.\"\nMore examplesFewer examplesI might possibly get the job finished by tomorrow evening, if I have no more interruptions.I'd guess that she's in her forties - 45 possibly?\"Are you going to be at church on Sunday morning?\" \"Possibly - it depends how late we get back on Saturday.\"There were possibly a hundred people at the meeting - certainly 80.I can't understand why he's so bad tempered this week - possibly something at school is upsetting him.\nSMART Vocabulary: related words and phrases\nUncertainty\namorphous\narguable\nbe neither fish nor fowl idiom\nblurringly\nblurry\ncircumstantial\nindeterminate\nindeterminately\ninsecurely\ninsecurity\ninterrogatively\nmurky\nslippery\nspec\nsquishy\nstutter\nswither\nwifty\nwishy-washy\nyou never know idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\npossibly adverb\n(WITH CAN/COULD)\nB2 used with \"can\" or \"could\" for emphasis: He can't possibly have drunk all that on his own! We did all that we possibly could to persuade her to come.\nB1 used in polite requests: Could I possibly ask you to move your chair a little?\nused when politely refusing offers: \"Have another chocolate.\" \"No, really, I couldn't possibly.\"\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\npossibly adverb [not gradable]\nAdd to word list\nAdd to word list\nso as to do or achieve something: He can’t possibly mean what he says.\npossibly adverb [not gradable]\nwith a likelihood that might or might not be true; perhaps: \"Do you think this skirt might be too small for her?\" \"Possibly, she has put on weight.\""}