{"id":284180,"name":"possible","type":"adjective","us_sound":"ˈpɑː.sə.bəl","us_link":"../audio/p/possible.mp3","uk_sound":"ˈpɒs.ə.bəl","uk_link":"../audio/p/ukposer021.mp3","content":"possible adjective\n(CAN ACHIEVE)\nAdd to word list\nAdd to word list\nA1 able to be done or achieved, or able to exist: I can't get it all done by Friday - it's just not possible. Is it possible to buy tickets in advance? They got as far as was humanly possible (= as far as anyone could have) before turning back. Opposite\nimpossible as much, quickly, soon, etc. as possible\nA2 as much, quickly, soon, etc. as something can happen or be done: Please take your seats as quickly as possible.\nSee more\nMore examplesFewer examplesI have tried to keep my translation as faithful as possible to the original book.The judge made an example of him and gave him the maximum possible sentence.Rescuers are doing everything that is humanly possible to free the trapped people.If atmospheric conditions are right, it may be possible to see this group of stars tonight.With today's technology almost anything seems possible.\nSMART Vocabulary: related words and phrases\nAchievable\n-ible\nable\naccomplishable\nachievable\nattainable\ndoable\nfeasibility study\nfeasible\nfeasibly\nhumanly\nmanageably\nmight\nposs\npracticability\npracticable\npracticably\npractical\nreach\nrunning\nvincible\nSee more results »\npossible adjective\n(NOT CERTAIN)\nB1 [ + (that) ] that might or might not happen: It's possible (that) Mira might turn up tonight. \"Do you think he'll end up in prison?\" \"It's very possible.\" That's one possible solution to the problem. Compare\nprobable\nThesaurus: synonyms, antonyms, and examples\nthat might or might not happen possibleI suppose it's possible that she just forgot my birthday, but it's unlikely.potentialShe is being mentioned as a potential successor to the leader.imaginableThe pens came in every colour imaginable. conceivableIt is conceivable that they'll agree to our terms, but I wouldn't bet on it.thinkableThe existence of something like the internet would not have even been thinkable in Einstein's day.\nSee more results »\nMore examplesFewer examplesIt's just possible that we might be going away that weekend.She's researching into possible cures for AIDS.Here is a list of possible answers. Please delete as appropriate.This is one possible solution to the problem. However, there are others.Investigators have studied the possible effects of contamination.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nIdiom\nanything's possible\npossible adjective [not gradable]\n(ACHIEVABLE)\nAdd to word list\nAdd to word list\nthat can be done or achieved, or that can exist: [ + to infinitive ] Is it possible to get an earlier flight? If possible I’d like to get there before noon. We need to send that letter off as soon as possible.\npossible adjective [not gradable]\n(NOT CERTAIN)\nthat might or might not happen or exist: [ + (that) clause ] It’s possible (that) Mary will turn up tonight."}