{"id":284178,"name":"possibility","type":"noun","us_sound":"ˌpɑː.səˈbɪl.ə.t̬i","us_link":"../audio/p/possibility.mp3","uk_sound":"ˌpɒs.əˈbɪl.ə.ti","uk_link":"../audio/p/epd32708.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] a chance that something may happen or be true: It's not likely to happen but I wouldn't rule out the possibility. The forecast said that there's a possibility of snow tonight. [ + (that) ] There's a distinct possibility (that) I'll be asked to give a speech. Is there any possibility (that) you could pick me up from the station? Opposite\nimpossibility (impossible)\nThesaurus: synonyms, antonyms, and examples\nthe chance of something happeningchanceThere's a good chance he'll resign.probabilityWhat's the probability of winning?oddsWhat are the odds that she takes him back?likelihoodThe treaty increases the likelihood that the cease-fire will hold.possibilityThere's a distinct possibility I won't be able to make it to the pub tonight.\nSee more results »\nB2 [ C ] something that you can choose to do in a particular situation: We could take on extra staff - that's one possibility. \"Have you decided what to do?\" \"No, I'm still considering the various possibilities.\"\nMore examplesFewer examplesThere's a possibility of my flight being delayed.He died in mysterious circumstances, and there is still a possibility that it was murder.We're having a meeting next week to talk about the possibility of merging the two companies.The whole town is patrolled by police because of the possibility of riots.There's still a possibility that Scotland will get through into the World Cup.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nGrammar\nOpportunity or possibility?We use opportunity to talk about a situation in which we can do something that we want to do. Opportunity is most commonly followed by a verb in the to-infinitive form, or of + -ing form: …\npossibility noun [C]\n(ACHIEVEMENT)\nAdd to word list\nAdd to word list\nsomething that can be done or achieved, or that can exist: One possibility is to hire more people.\npossibility noun [C]\n(POSSIBLE HAPPENING)\nsomething that might or might not happen or exist: There’s a possibility of snow tonight."}