{"id":284368,"name":"poster","type":"noun","us_sound":"ˈpoʊ.stɚ","us_link":"../audio/p/poster.mp3","uk_sound":"ˈpəʊ.stər","uk_link":"../audio/p/ukpostc003.mp3","content":"poster noun [C]\n(PICTURE)\nAdd to word list\nAdd to word list\nA2 a large printed picture, photograph, or notice that you stick or pin to a wall or board, usually for decoration or to advertise something: The children put up posters on the classroom walls. We noticed a poster advertising a circus. See also\nposter paint\ndickcraft/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesan eye-catching posterOn his wall he has a poster of Marilyn Monroe, her lips forever parted in anticipation.\"The end of the world is at hand!\" the poster declaimed.The posters were peeling away from the damp walls.She had done little to personalize her room, except hang a few posters on the walls.\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\nfloral\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npencil\nraster\nrehang\nscreen print\nseascape\nshade\nsketch\nSee more results »\nposter noun [C]\n(PERSON)\ninternet &amp; telecoms someone who publishes something such as a message or picture on a website or using social media: There was a lively debate on the message boards, with many posters arguing against the plan.\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nAdd to word list\nAdd to word list\na large printed picture or notice put up for advertising or decoration: She had a poster of some rock star on the wall.\nAdd to word list\nAdd to word list\na large printed picture, photograph, etc., that is used to advertise something in a public place: The company has been running a large advertising campaign on television, billboards, and posters on London Underground trains. display/distribute/put up posters a promotional poster a poster campaign poster advertising"}