{"id":284522,"name":"posting","type":"noun","us_sound":"ˈpoʊ.stɪŋ","us_link":"../audio/p/ca2us088.mp3","uk_sound":"ˈpəʊ.stɪŋ","uk_link":"../audio/p/ukpostc012.mp3","content":"posting noun [C]\n(JOB)\nAdd to word list\nAdd to word list\nUK (US and Australian English usually post) a job, often within the same organization that you are working for, that involves going to a different country or town: If you were offered an overseas posting, would you take it?\nposting noun [C]\n(MESSAGE)\nan electronic message that you send to a website in order to allow many people to see it\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nposting noun [C]\n(MAKING KNOWN)\nAdd to word list\nAdd to word list\na single act of putting information on the Internet, or the information itself: A hoaxer wrote a widely publicized posting in Ms. Hilton's name.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; HR a job, often within the organization that you already work for, which involves going to a different country or town to work for a particular period: a foreign/overseas postinga posting in/to sth He will use a two-year posting in Singapore to encourage people to consider living and working in Scotland.\n[ C ]\n&#160; INTERNET an electronic message or information that is put on a website in order to allow many people to see it: A separate report on Thursday showed that job postings on the internet stayed strong in July. an internet/online/website posting a blog/bulletin board/message board posting\n[ C or U ]\n&#160; ACCOUNTING the process of writing figures in a ledger (= book recording money that a company has spent and received), or the figures that are written: The company's posting of third-quarter earnings indicated a substantial slackening in computer sales.\n[ U ]\n&#160; COMMUNICATIONS\n&#160; mainly UK the act of sending a letter or package by mail: Proof of posting does not constitute proof of delivery. See also\ncertificate of posting"}