{"id":284194,"name":"post","type":"noun","us_sound":"poʊst","us_link":"../audio/p/post.mp3","uk_sound":"pəʊst","uk_link":"../audio/p/ukposer025.mp3","content":"post noun\n(LETTERS)\nAdd to word list\nAdd to word list\nA2 [ U ] mainly UK (US usually mail) letters, etc. that are delivered to homes or places of work: I'd been away for a few days so I had a lot of post waiting for me. My secretary usually opens my post, unless it's marked \"private\". Has the post come/arrived yet? Synonyms\ncorrespondence (WRITING)\nmail (LETTERS/PACKAGES)\nA2 [ U ] mainly UK (US usually mail) the public system that exists for the collecting and delivering of letters: My letter must have got lost in the post. If you don't want to take it there, you can just send it by post.\n[ S ] UK the time during the day when letters, etc. are collected or delivered: I missed the post this morning. Did you manage to catch the post?\nMore examplesFewer examplesMany thanks for your lovely long letter which arrived in this morning's post.The post comes twice daily.The package had been badly crushed in the post.Every Christmas thousands of people are drafted in to help with the post.The letter must have gone astray in the post.\nSMART Vocabulary: related words and phrases\nCommunications - the postal system\naddy\nBFPO\ncare of idiom\ncollection box\nconsignee\ndelivery\ndirect mail\ndispatch\nfirst class\nFreepost\nmail\nmail slot\npigeonhole\npostage\npostbox\npostmark\nself-addressed\nstamp\nwindow\nzip code\nSee more results »\npost noun\n(JOB)\nB2 [ C ] a job in a company or organization: Teaching posts are advertised in Tuesday's edition of the paper. She's held the post for 13 years. They have several vacant posts. Synonyms\nappointment (JOB)\njob (EMPLOYMENT)\nposition (RANK)\nsituation old useCompare\nemployment (WORK)\nposting\nwork noun (ACTIVITY)\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\nMore examplesFewer examplesShe rose to the exalted post of Foreign Secretary after only three years in the government.I'm sorry, the post has already been filled.She has been removed from her post as managing director.Without a doubt, she's the strongest candidate we've interviewed for the post.Chief Inspector of Schools is a very challenging and high-profile post.\nin post\nUK doing a particular job in a company or organization: He has been in post since February 2015.\nSee more\npost noun\n(POLE)\n[ C ] a vertical stick or pole stuck into the ground, usually to support something or show a position\n[ C ] used as a combining form: a lamppost a signpost the post\nin the sport of horse racing, the place where the race finishes or, less often, the place from which the race starts: It was a photo finish at the post. Bloomer's Pride pulled ahead right before the post.\nBikemech/iStock/Getty Images Plus/GettyImages\nin sports such as football, a goalpost (= either of two vertical posts showing the area in which the ball is kicked to score points): The shot hit the post and bounced out of bounds.\na rectangular area marked on a basketball court (= playing area) in front of the basket : He set up in the post and brought down a rebound. The post is often painted a different colour from the rest of the court. Synonym\nfree-throw lane\nMore examplesFewer examplesHe caught the rope and knotted it around a post.a fence postThe gate won't stay open, so we'll have to secure it to that post.The first stage of building the fence is sinking the posts into the ground.They moved the goal posts wider apart.\nSMART Vocabulary: related words and phrases\nPoles, rods, shafts and sticks\nbar\nbargepole\nbaton\nbilly club\nboathook\nbollard\nlathi-charge\nlightning conductor\nlitter grabber\nlitter pick\nlitter picker\nmast\npointer\nshaft\nstake\ntelegraph pole\ntelephone pole\ntent pole\ntotem pole\ntrash grabber\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHorse racing\nFootball/soccer\nGeneral terms used in ball sports\nBasketball, netball & volleyball\npost noun\n(PLACE)\n[ C ] the particular place where someone works, especially where a soldier is told to be for military duty, usually as a guard: The soldier was disciplined for deserting his post. I was ordered to remain at my post until the last customer had left.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlaces involved in military activity\npost noun\n(MESSAGE)\ninternet &amp; telecoms something such as a message or picture that you publish on a website or using social media: Lots of people have commented on my post. You can change your privacy settings so that only certain people can see your posts.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\npost verb\n(LETTERS)\nA2 [ T ] UK (US mail) to send a letter or parcel by post: Did you remember to post my letter? I must post that parcel (off) or she won't get it in time for her birthday. [ + two objects ] Could you post me the details/post the details to me?\n[ T ] UK to put an object through a letterbox (= special opening in a door): Just post the key through the door after you've locked it.\nMore examplesFewer examplesShe gave me her assurance that she would post the cheque immediately.Please remind me to post this letter when we're out - I keep forgetting.I had posted the card two months previously.My husband generally posts our letters on his way to work.I posted the parcel over a week ago - it should have reached you by now.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\npost verb\n(PLACE)\nC2 [ T ] to send someone to a particular place to work: He's been posted to Pakistan for six months. Guards were posted at all the doors.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\n(furniture) remover phrase\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndiaspora\ngreener pastures idiom\nimmigrant\nimmigration\nmigrant\nmigrate\nmover\npasture\nrelocate\nrelocation\nremoval\nremovalist\nremover\nstake\nwinter\nSee more results »\npost verb\n(MESSAGE)\n[ T ] to stick or pin a notice on a wall in order to make it publicly known: Company announcements are usually posted (up) on the noticeboard.\nB1 [ I or T ]\n&#160; internet &amp; telecoms to publish something such as a message or picture on a website or using social media: I never post anything on the Internet that I wouldn't want my boss to see. She hardly ever posts on Facebook. Somebody's been posting obscene messages in this chat room.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\npost verb\n(PAY)\nUS to pay money, especially so that a person who has been accused of committing a crime can be free until their trial: She has agreed to post bail for her brother.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\npost verb\n(RESULTS)\nto announce a company's financial results: The oil company posted profits of $25.1 billion.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nPhrasal verb\npost up (someone)\nafter or later than: postgraduate postoperative He took a post-lunch nap.\nThesaurus: synonyms, antonyms, and examples\nafter somethingafterAfter the show we were invited back to the dressing room.followingThe years following the war were hard. subsequent toSubsequent to her appearance on TV she received many bookings.post-I’m doing post-doctoral research.nextWhat is the next step in your treatment?\nSee more results »\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\npost noun [C]\n(POLE)\nAdd to word list\nAdd to word list\na vertical pole stuck in the ground, usually to support something or to mark a position: Al leaned against a fence post.\npost noun [C]\n(JOB)\na job, esp. one in which someone is performing an official duty: Novello was the first woman and first Hispanic to hold the post of surgeon general.\npost verb [T]\n(MAKE KNOWN)\nto make information known to the public, or to put up signs on land or other property: Snow advisories were posted for Ohio and Pennsylvania. All over town, for-sale signs are posted in front of houses.\nTo post something is also to put it on the Internet where others can see it: The earnings release also will be posted on the Company's website.\npost verb [T]\n(PAY)\nto pay money to a law court, as a formal promise that a person released from prison will return for trial: McLaughlin posted $3000 bail after his arrest.\nafter (a time or event): post-9/11 post-election\nAdd to word list\nAdd to word list\nafter or later than: Post-tax profits are £931,000 against £971,000 the previous year. The Tokyo market made a strong post-crash recovery. Compare\npre-\n[ U ]\n&#160; COMMUNICATIONS\n&#160; mainly UK ( also mail) letters and packages that are sent to homes or places of work: to check/collect the post to get/receive postdeliver post Did the postman deliver any post for me?the post arrives/comes Has the post come yet?answer/open/read post I've got a lot of post to open.\nCOMMUNICATIONS the public system for sending letters and packages from place to place: first-/second-class postbe/put sth in the post The cheque is in the post, and you should receive it tomorrow.through the post Given that most people would not wish to send their original passport through the post, they will have to get a certified copy. The letter got lost in the post. Dividends may be sent by post, held for collection, or paid in some other way.arrive/come/be delivered by post Hard copy products, such as a CD or newsletter, should arrive by post within days. See also\nregistered post\n[ S or U ]\n&#160; COMMUNICATIONS\n&#160; UK the time during the day when letters and packages are collected, or arrive at homes and places of work: the first/last postcatch/meet/miss the post The letter needed to be sent today, but I missed the last post.\nby return (of) post\nCOMMUNICATIONS if you reply to a letter by return of post, you reply by sending a letter back almost immediately: Please send the invoice back by return of post.\n[ C ] a job in a company or organization, especially an important one that pays well: accept/hold/remain in a post He has held the post of commercial director since 2002.apply for/be appointed to/take up a post She has applied for the vacant manager's post.advertise/fill a post Almost a third of employers said they had not received one application for a post they had advertised. a high-level/key/senior post a full-time/part-time post a permanent/temporary post a government/teaching postresign (from)/leave a post She was forced to resign from her £300,000-a-year post after the scandal. be removed/step down from a post\n[ C ]\n&#160; IT\n&#160; (also posting) a message or information that is put on a website, or sent to an internet discussion group for all the members to read: The site is seeing 10,000 posts per hour from its 50,000 members all over the world. a blog post\nCOMMUNICATIONS\n&#160; UK ( US mail) to send a letter or package to someone by mail: post sth to sb/post sb sth I'll post the details to you.post (off) sth Have you posted off your application form?\nCOMMUNICATIONS\n&#160; UK ( US mail) to put a letter or package into a postbox (= official public box for mail) so that it can be sent: Could you post this letter for me please?\nto announce a company’s sales, financial results, etc.: post gains/losses/profits The oil company posted profits of $25.1 billion.post an improvement/a rise/a decline They posted a 16% rise in sales.\nto send someone to a particular place to work for a period of time: be posted to sth He has been posted to Pakistan for six months.\nto put a notice in a public place in order to make something known to other people: be posted (up) on sth Company announcements are usually posted on the bulletin board. The rules include requiring businesses to post signs stating that smoking is not allowed.\nIT to put a message or information on a website for other people to read: The State Department posted a notice on its website saying that applicants may wait 10 weeks for passports.post sth on a website/online/on the internet The reports were written up and posted on the internet.\npost bail\nLAW to pay money so that a person who has been accused of committing a crime can be free until their trial: He is now free after posting $20,000 bail.\nkeep sb posted\nto continue giving someone the most recent information about a situation that involves them: I'll keep you posted on any new developments with the deal."}