{"id":284960,"name":"potential","type":"adjective","us_sound":"poʊˈten.ʃəl","us_link":"../audio/p/potential.mp3","uk_sound":"pəˈten.ʃəl","uk_link":"../audio/p/ukpostw014.mp3","content":"Add to word list\nAdd to word list\nB2 possible when the necessary conditions exist: A number of potential buyers have expressed interest in the company. Many potential customers are waiting for a fall in prices before buying. The accident is a grim reminder of the potential dangers involved in North Sea oil production.\nThesaurus: synonyms, antonyms, and examples\nthat might or might not happen possibleI suppose it's possible that she just forgot my birthday, but it's unlikely.potentialShe is being mentioned as a potential successor to the leader.imaginableThe pens came in every colour imaginable. conceivableIt is conceivable that they'll agree to our terms, but I wouldn't bet on it.thinkableThe existence of something like the internet would not have even been thinkable in Einstein's day.\nSee more results »\nMore examplesFewer examplesOf course we don't want to alarm people unnecessarily, but they should be alerted to potential dangers.They went into the restaurant and handed out leaflets to potential customers.We estimate the potential market for the new phones to be around one million people in this country alone.We shall pilot several new cosmetic products to selected potential purchasers.The potential benefits outweigh the problems.\nSMART Vocabulary: related words and phrases\nPotential\naccident\nan accident waiting to happen idiom\nauspicious\nauspiciously\nbe an actor, cook, etc. in the making idiom\nfertile\nlatently\nmaking\nnot be beyond the wit of man/someone idiom\npotentiality\npotentially\npromise\nprospect\nrealizable\nretrievable\nroom\nroom for improvement idiom\nsleeper\nuntapped\nwit\nSee more results »\npotential noun [U]\n(ABILITY)\nB2 someone's or something's ability to develop, achieve, or succeed: The region has enormous potential for economic development. I don't feel I'm achieving my full potential in my present job. [ + to infinitive ] You have the potential to reach the top of your profession. I think this room has got a lot of potential (= could be very nice if some changes were made to it).\nMore examplesFewer examplesThe school is based on the fundamental principle that each child should develop its full potential.The house looks a bit of a mess now, but it's got real potential.That child shows great potential - he's a talented musician.We need to find new ways to help students realize their potential.The aim is to maximize the potential for financial growth.\nSMART Vocabulary: related words and phrases\nPotential\naccident\nan accident waiting to happen idiom\nauspicious\nauspiciously\nbe an actor, cook, etc. in the making idiom\nfertile\nlatently\nmaking\nnot be beyond the wit of man/someone idiom\npotentiality\npotentially\npromise\nprospect\nrealizable\nretrievable\nroom\nroom for improvement idiom\nsleeper\nuntapped\nwit\nSee more results »\npotential noun [U]\n(IN PHYSICS)\nphysics\n&#160; specialized the amount of electricity passing through an electric circuit, measured in volts\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nelectrify\ngenerate\nhigh-voltage\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nAdd to word list\nAdd to word list\npossible but not yet achieved: He was eager to talk with potential customers. potentially adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/pəˈten·tʃə·li/\nPotentially dangerous products are often recalled by their manufacturers.\nSomeone’s potential is an ability the person has not yet developed: She keeps saying I should live up to my potential.\nphysics Potential energy is the energy that something has because of its position and structure, not because of its movement.\nphysics Electric potential is a measure of the power of electrical energy, measured in volts.\nAdd to word list\nAdd to word list\nable to develop into something in the future when the necessary conditions exist: There are potential problems at every stage of the drug production chain. A number of potential buyers are thought to have shown interest. a potential cost/market\nthe possibility of something developing or happening in a particular way: have the potential for sth/to do sth These equity securities are believed to have the potential for high earnings growth. commercial/economic potential growth/market/sales potential\nnatural qualities or abilities that mean that someone or something may or should succeed or achieve something: enormous/great/huge potential This marketing idea has great potential. We have put additional resources into the company to ensure it reaches its full potential in Scotland.have the potential to be sth He has the potential to be the very best."}