{"id":285203,"name":"pound","type":"noun","us_sound":"paʊnd","us_link":"../audio/p/pound.mp3","uk_sound":"paʊnd","uk_link":"../audio/p/ukpotti008.mp3","content":"pound noun [C]\n(MONEY)\nAdd to word list\nAdd to word list\nA2 (symbol £) the standard unit of money used in the UK and some other countries: a one-pound/two-pound coin There are one hundred pence in a pound. They stole jewellery valued at £50,000 (= 50,000 pounds). \"Do you have any change?\" \"Sorry, I only have a five-pound note. the pound (symbol £)\nthe value of the UK pound, used in comparing the values of different types of money from around the world: The devaluation of the pound will make British goods more competitive abroad. On the foreign exchanges the pound rose two cents against the dollar to $1.52.\nMore examplesFewer examplesThe pound has fallen to its lowest-ever level against the dollar.The value of the pound fell against other European currencies yesterday.He landed a part in a multi-million pound action thriller and made the Hollywood A list.Tourism contributes millions of pounds to the country's economy.I owe Janet £10.\nSMART Vocabulary: related words and phrases\nBritish money\nbit\nbob\ncrown\nfarthing\nfiver\nguinea\nP, p\npence\npenny\npound sign\npound sterling\nquid\nshilling\nsixpenny\nsmacker\nsovereign\nthreepenny\ntuppence\ntuppenny\ntwopenny\nSee more results »\npound noun [C]\n(WEIGHT)\nB2 (written abbreviation lb) a unit for measuring weight: One pound is approximately equal to 454 grams. One kilogram is roughly the same as 2.2 lbs. There are 16 ounces in one pound. Ann's baby weighed eight and a half pounds at birth.\nMore examplesFewer examplesSixteen ounces equals one pound.The recipe tells you to use a pound and a half of butter.She's a few pounds lighter than she used to be.He's put on ten pounds in the last month.What's the formula for converting pounds into kilos?\nSMART Vocabulary: related words and phrases\nMeasurements of weight & mass\natomic mass\nBMI\nbody mass index\ncarat\ncentigram\nct\nG, g\ngm\ngrammage\nhundredweight\nkilogram\nlb\nmg\nmicrogram\nmilligram\nounce\noz\nst\ntalent\nton\nSee more results »\nIdioms\nmatch something pound for pound\npound of flesh\nB2 to hit or beat repeatedly with a lot of force, or to crush something by hitting it repeatedly: I could feel my heart pounding as I went on stage to collect the prize. Nearly 50 people are still missing after the storm pounded the coast. The city was pounded to rubble during the war. He pounded on the door demanding to be let in. She was pounding away on her typewriter until four in the morning.\nMore examplesFewer examplesThe town finally succumbed last week after being pounded with heavy artillery for more than two months.She pounded on the door with her fists, pleading with him to let her out.Enormous waves pounded against the empty seashore.She pounded away at the computer until she had finished the report.Use the pestle and mortar to pound the spices into a fine powder.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting and beating\nIdioms\npound sand\ntell someone to pound sandPhrasal verb\npound away at something/someone\npound noun [C]\n(WEIGHT)\nAdd to word list\nAdd to word list\n(abbreviation lb.); (symbol #) a unit of measurement of weight equal to 0.453 kilogram\npound noun [C]\n(PLACE)\na place where pets that are lost or not wanted are kept: We got this mutt at the pound.\npound noun [C]\n(MONEY)\n(symbol £) the standard unit of money in the United Kingdom and some other countries\npound verb [I/T]\n(HIT)\nto hit repeatedly with force, or to crush by hitting repeatedly: [ T ] The speaker pounded his fists on the table. [ I ] Waves were pounding at the rocks.\nIf your heart pounds, it beats very strongly: [ I ] My heart was still pounding after we nearly crashed on the Interstate.\nAdd to word list\nAdd to word list\nMONEY\n&#160; ( written abbreviation £) the standard unit of currency in the UK and some other countries: The group has assets of about 120 million pounds. The company has lost hundreds of thousands of pounds of investors' money. a ten-pound note\nMEASURES\n&#160; ( written abbreviation lb) a unit for measuring weight, equal to 16 ounces or 0.454 of a kilogram: September copper rose 0.85 cents to 135.30 cents a pound.\nMONEY, ECONOMICS the value of the currency used in Britain compared with the value of the curriencies used in other countries: the strength/value of the pound The dollar gained more than a cent against the pound.\nin the pound\nfor each British pound counted: The Chancellor wanted to cut the starting rate of income tax to 10p in the pound. See also\nthe grey pound\nthe pink pound"}