{"id":285228,"name":"poured","type":"verb","us_sound":"pɔːr","us_link":"../audio/p/poor.mp3","uk_sound":"pɔːr","uk_link":"../audio/p/ukponti016.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npour\npour verb\n(LIQUID)\nB1 [ I or T ] to make a substance flow from a container, especially into another container, by raising just one side of the container that the substance is in: I spilled the juice while I was pouring it. Pour the honey into the bowl and mix it thoroughly with the other ingredients. [ + two objects ] Would you like me to pour you some more wine? Would you like to pour (= pour a drink into a glass or cup) while I open some bags of nuts?\nMore examplesFewer examplesAfter four minutes, pour the pasta into a colander to drain.Let's see if I can pour the juice into the glass without spilling it.I could hear the champagne fizz as he poured it into my glass.The milk overflowed when I poured it into the jug.Jack was pouring himself another glass of whisky.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\npour verb\n(LARGE AMOUNTS)\nB1 [ I or T, usually + adv/prep ] to (cause to) flow quickly and in large amounts: The bus was pouring out thick black exhaust fumes. The government has been pouring money into inefficient state-owned industries, and the country can no longer afford it. I felt a sharp pain and looked down to see blood pouring from my leg. Refugees have been pouring into neighbouring countries to escape the civil war. The sweat was pouring down her face by the end of the race. It looks as though it's about to pour (with rain). I was standing in the pouring rain for an hour waiting for my bus.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nIdioms\npour oil on troubled waters\npour scorn on someone/somethingPhrasal verb\npour something out"}