{"id":285276,"name":"powder","type":"noun","us_sound":"ˈpaʊ.dɚ","us_link":"../audio/p/powder.mp3","uk_sound":"ˈpaʊ.dər","uk_link":"../audio/p/ukpotti014.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] a loose, dry substance that consists of extremely small pieces, usually made by breaking something up and crushing it: curry/chilli powder talcum powder A packet of white powder was found and police scientists are analysing it. You'll get more flavour from the spices if you grind them into a powder.UK Why are there so many adverts for washing powders on TV? You can buy milk in powder form. See also\ngunpowder\n[ U ] a soft, dry substance that is spread over the skin of the face, in order to stop the skin from looking shiny: face powder Dust the face lightly with powder.\n[ U ] fallen snow that is loose and dry and has not begun to melt: I love skiing in deep powder.\nMore examplesFewer examples(non-)biological washing powderSift the flour and baking powder into a mixing bowl.Mix the powder and water into a stiff paste.Scatter the powder around the plants.Dissolve two spoons of powder in warm water.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\npowdered\nrarefy\nreflective\nrustily\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMake-up & skin care\nPrecipitation: snow & ice\nRelated word\npowderyIdiom\nkeep your powder dry\nto put powder on someone's skin: Powder the baby's bottom to stop it chafing.\nSMART Vocabulary: related words and phrases\nPersonal care - general words\namenity kit\nbaby wipe\nbeach body\nbeardy\nbed bath\nbubble bath\nfat-shaming\nfatphobia\nfatphobic\nflossing\nhand gel\nscrub\nscrub up well idiom\nshave\nspruce\nweak-chinned\nwell groomed\nwhirlpool bath\nwindblown\nwindswept\nSee more results »\nIdiom\npowder your nose\nAdd to word list\nAdd to word list\na loose, dry substance of extremely small pieces, usually made by breaking up something into smaller parts and crushing them\nPowder is also any of various loose, dry, usually pleasant-smelling substances that people put on their skin as a help in healing or as makeup: [ U ] talcum powder\nPowder is also gunpowder."}