{"id":285295,"name":"power","type":"noun","us_sound":"ˈpaʊ.ɚ","us_link":"../audio/p/power.mp3","uk_sound":"paʊər","uk_link":"../audio/p/ukpotti017.mp3","content":"power noun\n(CONTROL)\nAdd to word list\nAdd to word list\nB2 [ U ] ability to control people and events: I've no power over him - he does what he wants to. Once nicotine has you in its power, it's very difficult to stop smoking. She has the power to charm any man she meets.\nC1 [ U ] the amount of political control a person or group has in a country: Does the president have more power than the prime minister? How long has the Conservative Party been in power? The army seized power after five days of anti-government demonstrations.\nMore examplesFewer examplesAfter eight years in power, the government can no longer use the previous government's policy as an alibi for its own failure.Until the constitution is amended, the power to appoint ministers will remain with the president.Fair trade, say Oxfam, is about giving poor people power.The army took control of the city after the president's fall from power.Most modern kings and queens rule only in a formal way, without real power.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\npower noun\n(STRENGTH)\nC1 [ U ] strength: Our car doesn't have enough power to tow a trailer. Weightlifters have tremendous power in their arms and legs. Scientists are working to harness the power of the atom. The economic power of many Asian countries has grown dramatically in recent years.\nMore examplesFewer examplesThe pictures were an eloquent reminder of the power of the volcano.The Kon-Tiki sailed across the Pacific Ocean propelled by wind power.I was so terrified I seemed to lose all the power from my legs.It is astonishing to see the sheer power of this extraordinary athlete.The power of her religious faith is clear for all to see.We were struck by the power of the dancers' performances.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\npower noun\n(OFFICIAL RIGHT)\n[ U ] an official or legal right to do something: [ + to infinitive ] I'd like to help but I don't have the power to intervene in this dispute. It's not in your power to cancel the order. I can't give you a refund - I'm afraid it's not within my power. powers [ plural ]\nauthority: beyond someone's powers You were acting beyond your powers when you agreed to give her a pay rise.\nSee more\nMore examplesFewer examplesSince the government limited their powers, the unions are no longer a force to be reckoned with .I'll do everything within my power as a lawyer to achieve justice for you.The power to sack employees resides in the Board of Directors.He has been vested with the power to implement whatever changes he sees fit.They have the power to say yes or no to big investment projects.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\npower noun\n(ELECTRICITY)\nB1 [ U ] electricity, especially when considering its use or production: You should disconnect the power before attempting to repair electrical equipment. Our building lost power (= the electricity was stopped) during the storm. power cables/lines\nMore examplesFewer examplesMost of the data on the hard drive was corrupted by the power cut.Solar power is the conversion of the sun's energy into heat and electricity.The storm has affected power lines all over the region.a hydroelectric power stationa nuclear power plant\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\npower noun\n(ABILITY)\npowers [ plural ]\nabilities: My mental powers aren't as good as they used to be.\nSee more\nC1 [ U ] a natural skill or an ability to do something: power of He was so shocked by what happened to his parents that he lost the power of speech. We humans believe that we are the only animals to have the power of reason. [ + to infinitive ] The surgeon did everything in her power to save him. Environmentalists are doing everything within their power to minimize the impact of the oil spill. Solving this problem has taken all my brain power.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nwhat someone is (really) made of idiom\nwheelhouse\nwizardry\nworkmanship\nSee more results »\npower noun\n(PERSON WITH CONTROL)\nC1 [ C ] a person, organization, or country that has control over others, often because of wealth, importance, or great military strength: Spain was an important military power in the 16th century. Germany is on its way to becoming a world power with a permanent seat on the UN Security Council. She is an increasingly important power in the company.\nMore examplesFewer examplesa dominant military powerThis country would never submit to living under the heel of a foreign power.an imperialist powerThe major powers have said they will not send in ground troops .It's up to the powers that be to decide what should be done next.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\ntsar\nvice presidency\nvice president\nvicegerency\nvicegerent\nSee more results »\npower noun\n(ENERGY)\n[ U ]\n&#160; physics\n&#160; specialized the rate at which energy is used, or the ability to produce energy: The ship was only slightly damaged in the collision and was able to sail into port under its own power. The power rating of my amplifier is 40 watts per channel.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\npower noun\n(IMAGE SIZE)\n[ U ] the amount by which an image is increased by a device used for seeing things that are very small or a long distance away: What's the magnification power of your binoculars? You'll need a very high-power microscope to see something as small as that. A low-power telescope is enough if you only want to look at the moon.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nSee more results »\npower noun\n(MATHEMATICS)\n[ S ]\n&#160; mathematics\n&#160; specialized the number of times that a number is to be multiplied by itself: 2 to the fourth power is 2 times 2 times 2 times 2, which equals 16. 3 to the power 4 is usually written as 34.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsquare\nsubtraction sign\ntable\ntimes\ntreble\nSee more results »\nIdioms\ndo someone a power of good\nmore power to your elbow!\nthe power behind the throne\nthe powers that be\npower verb\n(ENERGY)\n[ T ] to provide a machine with energy and the ability to operate: Buses and trucks are usually powered by diesel engines. Electricity costs less than petrol, so powering an electric vehicle is cheaper.\nSMART Vocabulary: related words and phrases\nMachines - general words\n3-D printer\nanimatronic\nautomated\nautomation\nbackhoe\nchuck\ncoffee machine\nconvenience\ncrankshaft\nflywheel\nHeath Robinson\nhumanoid\nmill\nshredder\nstump grinder\nsupersensitivity\nsynchrotron\ntabulator\nteleprompter\nwater cooler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFuels\npower verb\n(STRENGTH)\n[ I usually + adv/prep ] to act with great strength or in a forceful way: Halfway through, she powered into the lead and went on to win the race.\n[ T ] in sports, to hit or kick the ball very hard: She powered her return past Fernandez who had come to the net. He powered his drive over 300 yards down the first hole.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nPhrasal verbs\npower (something) down\npower through (something)\npower (something) up\npower adjective [before noun]\n(MACHINE)\nprovided with energy by an electric motor: a power shower a power drill See also\npower tool\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\ngadget\ngrabber\nhardware\ninstrument\nmachine tool\npower tool\nprecision instrument\nspacer\nspreader\ntoolbox\ntoolkit\nutensil\nutility belt\nSee more results »\npower adjective [before noun]\n(PERSON)\nin sports, having great physical strength: a power pitcher a power hitter\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysically strong and powerful\npower noun\n(CONTROL)\nAdd to word list\nAdd to word list\n[ U ] the ability or right to control people and events, or to influence the way people act or think in important ways: The election results showed that the Democrats had lost power, with Republicans taking over five more Democratic seats.\npower noun\n(PERSON WHO CONTROLS)\n[ C ] someone or something, such as an organization or country, that has control over others, often because of authority, importance, or wealth: She is a power in the field of medical education.\npower noun\n(NATURAL ABILITY)\n[ C/U ] a natural skill or ability to do something: [ U ] She was so shocked that for a moment she lost the power of speech. [ C ] The doctor did everything in her power to save him. [ C ] More, though, it is an expression of the artist's power to create.\npower noun\n(STRENGTH)\n[ U ] physical strength or force: He’s a good baseball player – he hits with a lot of power.\npower noun\n(ENERGY)\n[ U ] the ability to produce energy, or the energy produced: electrical/nuclear/solar power\n[ U ]\n&#160; physics Power is also the rate at which work is done or at which energy is produced, measured in watts.\n[ U ] Power is also electricity: Whenever there’s a storm in these parts, you can expect a power outage (= a loss of electrical power).\npower noun\n(MATHEMATICS)\n[ U ]\n&#160; mathematics\n&#160; specialized the number of times that a number is to be multiplied by itself, or the number that is the result of multiplying a number by itself: Three to the fourth power can be written 34.\npower noun\n(NATION)\n[ C ]\n&#160; world history us/ˈpɑʊ·ər/ an independent nation\npower verb [T]\n(ENERGY)\nto provide something with the energy it needs to operate: [ T ] Many buses and trucks are powered by diesel fuel. Phrasal verb\npower up (something)\nAdd to word list\nAdd to word list\n[ U ] the ability to control or influence people, organizations, events, etc.: Shareholder power is a crucial part of how any capitalist society works.power over sb/sth Most CEOs have a great deal of power over the boards of directors.the power to do sth Oil prices still have the power to hurt the world economy. The bitter power struggle at the top of the company had a negative effect on the value of its shares. The balance of power in global markets is beginning to shift.be in power The last government was in power for over a decade.\n[ C or U ] an official or legal authority to do something: have the power to do sth The regulator has the power to block a deal that would be damaging to consumers.emergency/executive/special powers The Prime Minister was set to invoke emergency powers to handle the distribution of petrol during the crisis.\n[ C ] a group, country, or organization that has control over others, especially because of financial or military strength: a world/global power China is fast developing into a major global power. a military/political power a corporate/economic/financial power\n[ U ] the strength or influence of something in a particular market or activity: We are seeing a shift in economic power from Europe to Asia. I believe he has seriously underestimated the power of the brand.\n[ U ] energy that is produced and used to make things work: The agency is running a campaign to try and turn public opinion in favour of nuclear power. The energy regulator agreed that power companies could make customers sign long-term agreements.a power cut/failure/outage A power outage in Quebec left 6 million people in the dark.\n[ U ]\n&#160; IT the ability of a machine, computer, etc. to work effectively: The system is a way of measuring how much computer-processing power is needed to handle all the hits to a customer's site. See also\nbargaining power\nborrowing powers\nbuyer power\nbuying power\nearning power\ngrey power\nmarket power\npester power\npricing power\npurchasing power\nView all\nsolar power\nspending power\nstaying power\nunderwriting power\nwind power\nto provide a machine, computer, vehicle, etc. with the energy it needs to work effectively: be powered by sth There is increasing interest in cars powered by alternative fuels, such as ethanol or clean diesel. Most computers are now powered by Intel chips.\nto make something happen in a faster or more effective way: The supermarket's strong performance was powered by a 39% increase in sales of organic produce. Phrasal verb\npower (sth) up\noperated by electricity or a motor: power tools a power drill\nused to describe something that shows that you are a busy important person in a company: She was wearing her trademark power suit for the meeting."}