{"id":285301,"name":"powerful","type":"adjective","us_sound":"ˈpaʊ.ɚ.fəl","us_link":"../audio/p/powerful.mp3","uk_sound":"ˈpaʊə.fəl","uk_link":"../audio/p/ukpotti019.mp3","content":"powerful adjective\n(CONTROL)\nAdd to word list\nAdd to word list\nB1 having a lot of power to control people and events: The president is more powerful than the prime minister. She's the most powerful person in the organization.\nMore examplesFewer examplesThe president is so powerful that he is able to dictate to the government.He was a powerful force in British politics during the war years.I get the impression that Sheila is the powerful one in that relationship, not her husband!Today's teachers are not the powerful authority figures they once were.Are multinational companies now more powerful than governments?\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\npowerful adjective\n(STRENGTH)\nB1 having a lot of strength or force: She's an extremely powerful runner. The picture quality is bad because the TV signal isn't powerful enough.\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of physical or mental strengthstrongHe is a big, strong man.strongTwo thirds of voters see him as a strong leader.powerfulHe is the most powerful fighter I have seen in a boxing ring.muscularHe is tall with a muscular body.muscledShe has worked hard to achieve that muscled body.\nSee more results »\nB2 having a very great effect: a powerful drug Her speech about cruelty to children was very powerful.\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving a powerful effect\npowerful adjective\n(IMAGE SIZE)\nhaving the power to increase the size of an image of something that is very small or far away many times: You'd need an extremely powerful microscope to see something so small.\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nSee more results »\nRelated word\npowerfully\npowerful adjective\n(STRONG)\nAdd to word list\nAdd to word list\nstrong: The picture quality is bad because the TV signal isn’t powerful enough.\nThings that are powerful have a strong effect: a powerful drug\npowerful adjective\n(CONTROLLING)\nhaving a lot of power: He’s in a powerful position as an adviser of the president."}