{"id":285373,"name":"practical","type":"adjective","us_sound":"ˈpræk.tɪ.kəl","us_link":"../audio/p/practical.mp3","uk_sound":"ˈpræk.tɪ.kəl","uk_link":"../audio/p/ukpr___004.mp3","content":"practical adjective\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nB2 relating to experience, real situations, or actions rather than ideas or imagination: Qualifications are important but practical experience is always a plus. The service offers young people practical advice on finding a job. What's the use of theoretical knowledge that has no practical application? for all practical purposes\nin fact: Dr Frampton is in charge, but for all practical purposes, her assistant runs the office.\nSee more\nMore examplesFewer examplesIt's all very well knowing things in theory but what you need to gain is practical experience.So how does this theory translate into practical policy?Greater emphasis is given to practical tests rather than written work.We offer practical help for people with disabilities.There are various practical problems that we need to overcome.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\npractical adjective\n(SUITABLE)\nC1 suitable for the situation in which something is used: I tend to wear clothes that are practical rather than fashionable. Heavy boots aren't very practical for running. Opposite\nimpractical\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nticket\nSee more results »\npractical adjective\n(EFFECTIVE)\nC2 approving able to provide effective solutions to problems: She has lots of interesting ideas, but they're not very practical. We need someone practical who can cope with a crisis. Opposite\nimpractical\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\npractical adjective\n(POSSIBLE)\nC1 able to be done or put into action: [ + to infinitive ] It's simply not practical to divide the work between so many people. Opposite\nimpractical\nSMART Vocabulary: related words and phrases\nAchievable\n-ible\nable\naccomplishable\nachievable\nattainable\ndoable\nfeasibility study\nfeasible\nfeasibly\nhumanly\nmanageably\nmight\nposs\npossible\npracticability\npracticable\nreach\nrunning\nviably\nvincible\nSee more results »\na class or exam in a scientific or technical subject in which students do things rather than just write or talk about them: We had to dissect a worm and a frog in our biology practical today.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\noral\npop quiz\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\npractical adjective\n(ACTUAL/REAL)\nAdd to word list\nAdd to word list\nrelating to actual experience or to the use of knowledge in activities rather than to knowledge only or ideas: I know you’ve been trained as a teacher, but do you have any practical teaching experience?\nIf you say that a person is practical, you mean the person behaves in ways that relate more to the realities of the world than to ideas or desires: You’ve got to learn to be practical and save your money.\npractical adjective\n(EFFECTIVE)\nfitting the needs of a particular situation in a helpful way; helping to solve a problem or difficulty; effective or suitable: We didn’t want to spend the night at a motel, but it just wasn’t practical to do the trip in one day. In some cities, it isn’t practical to keep the subways operating all night because there aren’t enough passengers.\nWhen used of objects such as clothes, practical can mean directed only to the goal of doing their intended work, and often plain in style or character: I wear clothes that are practical rather than fashionable."}