{"id":285381,"name":"practically","type":"adverb","us_sound":"ˈpræk.tɪ.kəl.i","us_link":"../audio/p/practically.mp3","uk_sound":"ˈpræk.tɪ.kəl.i","uk_link":"../audio/p/ukpr___007.mp3","content":"practically adverb\n(NEARLY)\nAdd to word list\nAdd to word list\nB2 almost or very nearly: She blamed me for practically every mistake in the report. These changes would cost us practically nothing. It's practically impossible for me to get home in less than an hour. They used to argue all the time and now they've practically stopped talking to each other.\nThesaurus: synonyms, antonyms, and examples\nnot completelyalmostWe need to hurry up - it's almost time to go.nearlyIt's nearly midnight.nearHe was near tears (= almost crying).aboutAre you about ready to leave?all butThe concert was all but over by the time we arrived. well-nighIt was well-nigh impossible to get a person on the phone these days.\nSee more results »\nMore examplesFewer examplesHer blouse was practically transparent!I attended practically every lecture and seminar when I was a student.She'll walk the interview - the job is practically hers already.I visit Mum and Dad practically every day.These two dresses are practically identical.\nSMART Vocabulary: related words and phrases\nAlmost\na hop, skip, and a jump idiom\nabout\nalmost\nas good as idiom\nas much as idiom\nbe on the way to something idiom\ngoing on\nintent\nmore\nmore or less idiom\nmuch\npart\nsub\nthat was close! idiom\nto/for all intents and purposes idiom\nup to (doing) something idiom\nverge\nverge on something\nvirtual\nway\nSee more results »\npractically adverb\n(IN FACT)\nin a way that relates to real situations and actions rather than ideas: Many people have offered to help, but there is little they can do practically. Theoretically, it's a good idea to live without a car, but practically speaking, it would be difficult to manage without one.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\npractically adverb\n(ALMOST)\nAdd to word list\nAdd to word list\n[ not gradable ] almost or very nearly: Practically everybody will be at the party. It’s practically impossible to get home in less than an hour.\npractically adverb\n(EFFECTIVELY)\nin a way that fits the needs of a particular situation: Many people have offered help, but there’s little they can practically do."}