{"id":285395,"name":"practise","type":"verb","us_sound":"ˈpræk.tɪs","us_link":"../audio/p/practice.mp3","uk_sound":"ˈpræk.tɪs","uk_link":"../audio/p/ukpr___008.mp3","content":"practise verb\n(TRAINING)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to do or play something regularly or repeatedly in order to become skilled at it: I'm quite good at tennis but I need to practise my serve. She practises the violin every day. [ + -ing verb ] His written French is very good but he needs to practise speaking it.\nMore examplesFewer examplesYou must practise your scales every day.The students paired off to practise their conversational skills.People learning to fly often practise on a flight simulator.Get into the habit of tuning your guitar every day before you practise.Some driving teachers use computers to simulate different road conditions for learners to practise on.\nSMART Vocabulary: related words and phrases\nRepeating an action\nbe at it again idiom\nbe/sound like a broken record idiom\nbinge-watch\nbingeable\nblitz\ndrill\nhere we go (again) idiom\niteration\niterative\niteratively\nkeep on doing something\nkeep your eye in idiom\nrepetitive\nrepetitively\nreplicable\nreprise\nreproduce\nreproducible\nreproducibly\nrewrite\nSee more results »\npractise verb\n(WORK)\nC1 [ I or T ] to work in an important skilled job for which a lot of training is necessary: How long have you been practising as a dentist? She practised medicine for 20 years.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nslave\nslog\nslouch\nspadework\nsubtask\nsweat\nSee more results »\npractise verb\n(REGULAR ACTIVITY)\n[ T ] to do something regularly, often according to a custom, religion, or set of rules, or as a habit: The new government has promised all citizens the right to practise their religion. Practising safe sex is an important way of avoiding HIV infection. The company denies that it has practised discrimination against any of its employees.\nSMART Vocabulary: related words and phrases\nRepeating an action\nbe at it again idiom\nbe/sound like a broken record idiom\nbinge-watch\nbingeable\nblitz\ndrill\nhere we go (again) idiom\niteration\niterative\niteratively\nkeep on doing something\nkeep your eye in idiom\nrepetitive\nrepetitively\nreplicable\nreprise\nreproduce\nreproducible\nreproducibly\nrewrite\nSee more results »\nIdiom\npractise what you preach\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; LAW to work in an area such as law or medicine, etc. that involves long periods of training and high levels of skill: practise as sth She practised as a solicitor for 10 years before taking a career break.practise law/medicine He had been banned from practising law.\n[ T ] to do something regularly, often according to a custom or set of rules, or as a habit: The technique is rarely practised in the West.practised by Unemployment among the country's working classes is being blamed on the open discrimination practised by both the state-owned and private sectors.\n[ I or T ] to repeat something often so that you improve your skill: I need to practise my presentation before the meeting."}