{"id":285551,"name":"praised","type":"verb","us_sound":"preɪz","us_link":"../audio/p/praise.mp3","uk_sound":"preɪz","uk_link":"../audio/p/ukpr___017.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npraise\npraise verb [T]\n(SHOW APPROVAL)\nB2 to express admiration or approval of the achievements or characteristics of a person or thing: He should be praised for his honesty. My parents always praised me when I did well at school. He was highly praised for his research on heart disease.\nThesaurus: synonyms, antonyms, and examples\nto praise someone or somethingpraiseLawmakers praised the bipartisan deal.congratulateI congratulated him on passing his driving test.complimentI was just complimenting Robert on the wonderful meal he has cooked.commendThe judge commended her for her bravery.pay tribute toHe paid tribute to the firefighters who had saved his daughter's life.flatterI knew he was only flattering me because he wanted to borrow some money.\nSee more results »\nMore examplesFewer examplesHis friends praised his generosity, wit, and learning.He praised her professionalism and dynamism.The police praised motorists for driving sensibly in the appalling conditions.The speech praised those who had displayed gallantry in the liberation of their country.I tried to boost his ego by praising his cooking.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\npraise verb [T]\n(WORSHIP)\nto honour, worship, and express admiration for a god: They sang hymns praising God.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\nglory\ngodliness\ngodly\nPharisee\npiety\npious\npiously\npraise\nworship\nworshipper\nSee more results »"}