{"id":285550,"name":"praise","type":"verb","us_sound":"preɪz","us_link":"../audio/p/praise.mp3","uk_sound":"preɪz","uk_link":"../audio/p/ukpr___017.mp3","content":"praise verb [T]\n(SHOW APPROVAL)\nAdd to word list\nAdd to word list\nB2 to express admiration or approval of the achievements or characteristics of a person or thing: He should be praised for his honesty. My parents always praised me when I did well at school. He was highly praised for his research on heart disease.\nThesaurus: synonyms, antonyms, and examples\nto praise someone or somethingpraiseLawmakers praised the bipartisan deal.congratulateI congratulated him on passing his driving test.complimentI was just complimenting Robert on the wonderful meal he has cooked.commendThe judge commended her for her bravery.pay tribute toHe paid tribute to the firefighters who had saved his daughter's life.flatterI knew he was only flattering me because he wanted to borrow some money.\nSee more results »\nMore examplesFewer examplesHis friends praised his generosity, wit, and learning.He praised her professionalism and dynamism.The police praised motorists for driving sensibly in the appalling conditions.The speech praised those who had displayed gallantry in the liberation of their country.I tried to boost his ego by praising his cooking.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\npraise verb [T]\n(WORSHIP)\nto honour, worship, and express admiration for a god: They sang hymns praising God.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\nglory\ngodliness\ngodly\nPharisee\npiety\npious\npiously\nworship\nworshipper\nSee more results »\npraise noun [U]\n(APPROVAL)\nC1 things that you say that express your admiration and approval of someone or something: They deserve praise for all their hard work. His economic policies have won widespread praise for reducing government debt. Praise from Adrian is (high) praise indeed. (= praise from him is particularly special because he rarely praises anyone.)\nMore examplesFewer examplesHis boss showered him with praise.The committee lavished praise on the project.He is sparing with his praise .His efforts are certainly deserving of praise.A young child needs plenty of praise and encouragement.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\npraise noun [U]\n(GOD)\nformal an expression of respect and worship to a god: As we give praise to God, let us remember those who are less fortunate than ourselves.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\nglory\ngodliness\ngodly\nPharisee\npiety\npious\npiously\nworship\nworshipper\nSee more results »\npraise verb [T]\n(SHOW APPROVAL)\nAdd to word list\nAdd to word list\nto express strong admiration for or approval of a person or something done: The \"Times\" praised the mayor’s decision to reappoint the parks commissioner.\npraise verb [T]\n(WORSHIP GOD)\nto honor, worship, and express admiration for (God or a god): Praise God/the Lord. praise noun [ U ] us\nYour browser doesn't support HTML5 audio\n/preɪz/\nHis economic policies have won praise from fellow Republicans."}