{"id":286392,"name":"preciousness","type":"noun","us_sound":"ˈpreʃ.əs.nəs","us_link":"../audio/p/uspr___024.mp3","uk_sound":"ˈpreʃ.əs.nəs","uk_link":"../audio/p/ukpraye024.mp3","content":"preciousness noun [U]\n(VALUE)\nAdd to word list\nAdd to word list\nthe quality of being very valuable because of being rare, expensive, or important: I have always had a sense of the preciousness of life. As an elder person, part of my role is to try to keep alive the preciousness of history.\nMore examplesFewer examplesHe needs to understand the preciousness of the lives he has destroyed.He recited a Chinese proverb about the preciousness of spring showers for farmers.Mary assumed with delight that this was another special recognition of her preciousness.\nSMART Vocabulary: related words and phrases\nExpensive & luxurious\nchampagne\ncostliness\nexpense\nexpensively\nextravagance\ngold plate\ngraciousness\nluxuriant\nluxurious\nluxury goods\nno expense is spared idiom\nposhly\nposhness\nprecious\npremium-rate\nprestige\npriceless\npricelessly\nritzy\nupmarket\nSee more results »\npreciousness noun [U]\n(BEHAVIOUR)\nmainly UK disapproving behaviour that is very formal and unnatural because it gives too much attention to details that are not important and tries too hard to be perfect: As an actor, he has always tried to avoid preciousness. We don't want too much preciousness about our ingredients all being locally sourced and organic.\nMore examplesFewer examplesSome viewers have come to loathe his films for their preciousness.Her lyrics are clever without spiraling into preciousness.She is particular to the point of preciousness about her living environment.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\ntheatricality\nSee more results »\nSee\nprecious"}