{"id":286247,"name":"precaution","type":"noun","us_sound":"prɪˈkɑː.ʃən","us_link":"../audio/p/precaution.mp3","uk_sound":"prɪˈkɔː.ʃən","uk_link":"../audio/p/ukpraye012.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] an action that is done to prevent something unpleasant or dangerous happening: Many people have been stockpiling food as a precaution against shortages. They failed to take the necessary precautions to avoid infection. precautions [ plural ]\na polite way of referring to contraception (= methods that prevent a woman becoming pregnant): If you're going to have sex, make sure you take precautions.\nMore examplesFewer examplesThe inquiry into the disaster damns the company for its lack of safety precautions.Safety precautions are observed as a matter of course.Millions of travellers fail to take even the most elementary of precautions.Doctors are legally obliged to take certain precautions.The tighter security precautions include video cameras in the city centre.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nsentry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObstetrics: contraception\nRelated word\nprecautionary\nAdd to word list\nAdd to word list\nan action taken to prevent something unpleasant or dangerous from happening: Homeowners should take the basic precaution of locking their doors and windows. precautionary adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/prɪˈkɔ·ʃəˌner·i/\nThe company has withdrawn the drug as a precautionary measure while further testing is done.\nAdd to word list\nAdd to word list\nsomething that is done to try and protect a person or thing from something dangerous or harmful: The bank decided to reduce interest rates as a precaution against inflation. We're taking every precaution necessary to ensure the safety of our employees. necessary/safety/security precautions"}