{"id":286203,"name":"precambrian","type":"adjective","us_sound":"ˌpriːˈkæm.bri.ən","us_link":"../audio/p/eus22530.mp3","uk_sound":"ˌpriːˈkæm.bri.ən","uk_link":"../audio/p/epd22958.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the earliest period of time, between about 4,600 and 543 million years ago, from when the earth was formed until the first simple forms of life appeared: Precambrian time Precambrian rocks The silvery Precambrian quartzite is some of Australia’s oldest exposed rock.\nMore examplesFewer examplesThe development of the Atlantic began as far back as Precambrian times.It is one of the most comprehensive studies for any Precambrian interval.Precambrian rocks outcrop over vast areas of continental interiors.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nrockfall\nsyncline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Precambrian\nthe earliest period of time, between about 4,600 and 543 million years ago, from when the earth was formed until the first simple forms of life appeared: It was in the Precambrian when the first single-celled microbes evolved. The museum's Tower of Time referred to the Precambrian as an era.\nMore examplesFewer examplesThe project will adopt a case-study methodology and will focus on scientific studies of the Precambrian . The Precambrian refers to a stretch of time spanning from the inception of the Earth approximately 4.5 billion years ago to about 540 million years ago.Algae are found in the fossil record dating back to approximately 3 billion years in the Precambrian.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nrockfall\nsyncline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}