{"id":286429,"name":"precise","type":"adjective","us_sound":"prəˈsaɪs","us_link":"../audio/p/eus75878.mp3","uk_sound":"prɪˈsaɪs","uk_link":"../audio/p/ukpreci003.mp3","content":"precise adjective\n(EXACT)\nAdd to word list\nAdd to word list\nB2 exact and accurate: The bunker's precise location is a closely guarded secret. He caught me at the precise moment that I fainted. There was a good turnout for the meeting - twelve of us to be precise.\nThesaurus: synonyms, antonyms, and examples\ncomplete and true in every detailexactWhat is your exact location?preciseIt was a mathematically precise model of how the wind would affect the structure.accurateWe need accurate measurements before we can begin the building project.superaccurateScientists use a superaccurate atomic clock to measure time.specificPlease make your questions as specific as possibile.\nSee more results »\nMore examplesFewer examplesLet's not trouble ourselves about the precise details at the moment.I can give no information at this precise moment in time.We don't know the precise details of the story yet.Machine-readable passports will permit precise identity-checking.Do you think you could be a bit more precise?\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nprecise adjective\n(CAREFUL)\napproving very careful and accurate, especially about small details: Years of doing meticulous research had made her very precise in her working methods.\nThesaurus: synonyms, antonyms, and examples\npaying close attention to detailcarefulAfter careful consideration, we are unable to accept your proposal.thoroughHe seems like he's not paying attention, but don't be fooled - he's very thorough. meticulousThis book is the result of years of meticulous research.methodicalI appreciated his methodical approach to the work.\nSee more results »\nSMART Vocabulary: related words and phrases\nCautious and vigilant\nabundance\nan abundance of caution idiom\naskance\nattentive\nattentively\ndiligence\ndiligent\ndiscreet\ndue diligence\ngingerly\nmeticulousness\nmindful\nminutely\nnarrowly\nonce\nsemi-conservative\nslowly\nsnuffly\nsuper-cautious\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDetailed and careful\nRelated word\npreciseness\nAdd to word list\nAdd to word list\nexact and accurate in form, time, detail, or description: The precise recipe is a closely guarded secret. Years of doing this research had made her very precise in her working methods. There was a good turnout for the meeting – twelve of us, to be precise."}