{"id":287830,"name":"preference","type":"noun","us_sound":"ˈpref.ər.əns","us_link":"../audio/p/preference.mp3","uk_sound":"ˈpref.ər.əns","uk_link":"../audio/p/ukpredi030.mp3","content":"Add to word list\nAdd to word list\nB2 the fact that you like something or someone more than another thing or person: Her preference is for comfortable rather than stylish clothes. I have a preference for sweet food over spicy. Choosing furniture is largely a matter of personal preference. It would be wrong to discriminate against a candidate because of their sexual preference (= the sex of the people they are sexually attracted to).\nan advantage that is given to a person or a group of people: We give preference to those who have worked with us for a long time. Special preferences were offered initially to encourage investment. in preference to something\nIf you choose one thing in preference to another thing, you choose it because you like or want it more than the other thing: He studied chemistry in preference to physics at university.\nSee more\nMore examplesFewer examplesI have a preference for blond men over dark.My preference is for savoury food over sweet.White wine or red - what's your preference?I wouldn't like to guess her sexual preference.We have white and brown bread - do you have a preference?\nSMART Vocabulary: related words and phrases\nLiking more\nbias\ndruthers\neach\neach to his/their own phrase\nfave\nfavour\nfavoured\nfavourite\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\nprefer\npreferable\npreferably\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nAdd to word list\nAdd to word list\nA preference is also an advantage given to someone: [ U ] The city gives preference to job applicants who live there.\nAdd to word list\nAdd to word list\n[ C or U ] the fact of liking or wanting one thing more than another: preference for sth These investors had a preference for securities rather than bank deposits. More flexibility will enable managers to redesign their floors quickly according to customer preferences. Buying a car is a matter of personal preference.\n[ U ] an advantage or better treatment that is given to a person or a group of people: give preference to sb/sth This small-business program gives preference to minority- and women-owned companies. See also\nCommunity preference\nconsumer preference\nliquidity preference\nused to describe a company's shares that have the right to fixed dividends (= payments from profits) before the dividends on its ordinary shares are calculated and paid in a particular period, or in periods when dividends on these shares are not paid at all: Nokia is to increase its capital with about $100 million of new preference stock."}