{"id":287823,"name":"prefer","type":"verb","us_sound":"prɪˈfɝː","us_link":"../audio/p/prefer.mp3","uk_sound":"prɪˈfɜːr","uk_link":"../audio/p/ukpredi027.mp3","content":"prefer verb [T]\n(CHOOSE)\nAdd to word list\nAdd to word list\nA2 to like, choose, or want one thing rather than another: Do you prefer hot or cold weather? I prefer red wine to white. [ + -ing verb ] He prefers watching football to playing it. [ + to infinitive ] I'd prefer not to discuss this issue.formal I'd prefer you not to smoke (= I would like it better if you did not smoke), please.\nMore examplesFewer examplesSome people prefer a vegetarian diet, while others prefer a meat-based diet.I'd prefer not to work but I don't have much choice.Most convalescents prefer to be cared for at home rather than in a hospital.You can detach the hood if you prefer the coat without it.Would you prefer to pay by cash, cheque, or credit card?\nSMART Vocabulary: related words and phrases\nLiking more\nbias\ndruthers\neach\neach to his/their own phrase\nfave\nfavour\nfavoured\nfavourite\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\npreferable\npreferably\npreference\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nprefer verb [T]\n(ACCUSE)\nlaw\n&#160; UK specialized to accuse someone officially: The police have decided not to prefer charges against them because of insufficient evidence.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecutorial\nreindict\nreindictment\nretry\nspecimen charge\nsummons\nSee more results »\nGrammar\nHate, like, love and preferWe can use hate, like, love and prefer with an -ing form or with a to-infinitive: …\nPreferWe use prefer to say we like one thing or activity more than another. We can use a prepositional phrase with to when we compare two things or actions: …\nExpressing preferenceWe use prefer to say we like one thing or activity more than another. We can use a prepositional phrase with to when we compare two things or actions: …\nWould preferWe use would prefer or ’d prefer, followed by a to-infinitive or a noun, to talk about present and future preferences: …\nAdd to word list\nAdd to word list\nto choose or want one thing rather than another: [ T ] We have tea and coffee, but perhaps you’d prefer a cold drink. [ T ] He prefers watching baseball to playing it. [ + that clause ] She prefers that we meet at the station. [ + to infinitive ] Would you prefer to leave?"}