{"id":287887,"name":"prefix","type":"noun","us_sound":"ˈpriː.fɪks","us_link":"../audio/p/prefix.mp3","uk_sound":"ˈpriː.fɪks","uk_link":"../audio/p/ukprefe004.mp3","content":"Add to word list\nAdd to word list\nlanguage\n&#160; specialized a letter or group of letters added to the beginning of a word to make a new word: In the word \"unimportant\", \"un-\" is a prefix. A suffix is added at the end of a word, and a prefix is added to the beginning. \"Eco-\" is a prefix used to mean 'relating to the environment' Compare\naffix\ninfix\nsuffix\na word added to the beginning of a name, for example of a company or an event: The group will use the Marston's prefix on all three of its trading divisions and will put the name on all pub signs. The festival adopted the Hydro prefix in reference to its partnership with Scottish Hydro Electric, a renewable energy company.\ninternet &amp; telecoms\n&#160; UK specialized a number added to the beginning of a phone number, either used when calling someone outside your town or country or as a way of making the caller pay for or not pay for the call : From the UK, add the prefix 00 33 1 to phone numbers. Every phone number in town begins with the same three-digit prefix: 445. Many people trying to call numbers with 0345, 0845 or 0800 prefixes were unable to get through for several hours Compare\narea code\ncomputing\n&#160; specialized a group of numbers, letters, or symbols added to the beginning of an internet address or piece of computer code : Not all Web server names use the www prefix. Often, the prefix that you use to install the software affects the contents of the files that actually get installed. Each VPN needs its own set of prefixes.\na word or phrase that is often said before something, for example to describe it: The term “beleaguered” seems to be permanently attached as a prefix to the company’s name.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsuffix\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNames and titles\nCommunications - by telephone\nInternet terminology\nPreceding and introducing\nGrammar\nPrefixesPrefixes are letters which we add to the beginning of a word to make a new word with a different meaning. Prefixes can, for example, create a new word opposite in meaning to the word the prefix is attached to. They can also make a word negative or express relations of time, place or manner. Here are some examples: …\nWord formationThere are four main kinds of word formation: prefixes, suffixes, conversion and compounds. …\nPrefixesWe add prefixes before the base or stem of a word. …\nSuffixesWe add suffixes after the base or stem of a word. The main purpose of a suffix is to show what class of word it is (e.g. noun or adjective). …\nConversionConversion involves the change of a word from one word class to another. For example, the verbs to email and to microwave are formed from the nouns email and microwave: …\nCompoundingWhen we use compounding, we link together two or more bases to create a new word. Normally, the first item identifies a key feature of the second word. For example, the two bases back and ache can combine to form the compound noun backache, and the two bases post and card combine to form the compound noun postcard. …\nAbbreviationAbbreviation involves shortening a word. We do this in three main ways: clipping, acronyms and blends. …\nBack-formationWe form words with back-formation when we remove part of a word, usually something which we think is a suffix (or occasionally a prefix). We do this commonly when we form verbs from nouns. …\nlanguage\n&#160; specialized to add a letter or group of letters to the beginning of a word to make a new word: prefixed with Many German participles are prefixed with ge- .prefixed to This word is usually prefixed to an adjective.\nUK to add a number to the beginning of a phone number, especially when calling someone outside your town or country: prefix sth with sth To phone countries outside the US, you prefix the country code with 011.prefix sth to sth The subscriber can dial trunk calls direct by prefixing the STD number to the number they wish to call.prefixed by Numbers prefixed by 020 are all toll-free.\ncomputing\n&#160; specialized to add a group numbers, letters, or symbols to the beginning of an internet address or piece of computer code: prefixed with Wherever such XML elements appear, they are prefixed with the letters DAV. Usually drivers are prefixed with V (for version).\n(of a word) to come before or at the beginning of a name: \"Wheal\", the Cornish word for workplace, prefixes the names of all the county's mines. The fact that a brand name now prefixes the location shows that it is owned by a very specific corporate body.\nto say a word before the name of someone or something, for example to describe them or it: prefixed by At that time, artists were often prefixed by the word \"struggling\". The town is usually prefixed by the word \"sleepy\".\nto add something before another thing: prefix sth to sth I prefixed my preface to the translation.prefixed by Each document is prefixed by a helpful few lines of context.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsuffix\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - by telephone\nPreceding and introducing\nBeginnings and starts\nAdd to word list\nAdd to word list\ngrammar a letter or group of letters added to the beginning of a word to change the meaning or make a new word: In the words \"unknown\" and \"unusual,\" \"un-\" is a prefix meaning \"not.\""}