{"id":288409,"name":"prejudice","type":"noun","us_sound":"ˈpredʒ.ə.dɪs","us_link":"../audio/p/prejudice.mp3","uk_sound":"ˈpredʒ.ə.dɪs","uk_link":"../audio/p/ukprefe014.mp3","content":"Add to word list\nAdd to word list\nB2 an unfair and unreasonable opinion or feeling, especially when formed without enough thought or knowledge: Laws against racial prejudice must be strictly enforced. [ + that ] The campaign aims to dispel the prejudice that AIDS is confined to the homosexual community. He claims that prejudice against homosexuals would cease overnight if all the gay stars in the country were honest about their sexuality. without prejudice to something law\n&#160; formal or specialized\nIf a decision or action is made without prejudice to a right or claim, it is made without having an effect on that right or claim: My client accepts the formal apology without prejudice to any further legal action she may decide to take.\nSee more\nMore examplesFewer examplesShe criticized the government for trying to whip up anti-German prejudice.He had to battle against prejudice to get a job.Such ingrained prejudices cannot be corrected easily.It seems that old prejudices are still lurking beneath the surface.We mustn't let our prejudices blind us to the facts of the situation.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nSomeone or something that prejudices you influences you unfairly so that you form an unreasonable opinion about something: His comments may have prejudiced the voters against her.\nformal Something or someone that prejudices something else has a harmful influence on it: The fact that you were late all this week may prejudice your chances of getting a promotion.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nAdd to word list\nAdd to word list\nan unfair and unreasonable opinion or feeling formed without enough thought or knowledge: [ U ] racial prejudice [ C ] The experience merely confirmed all his prejudices about living in the city. prejudicial adjective us\nYour browser doesn't support HTML5 audio\n/ˌpredʒ·əˈdɪʃ·əl/\nAn official investigation would have a prejudicial effect on the company’s reputation.\nto unfairly influence a person or matter so that an unreasonable opinion or decision results: Both sides pledged not to do anything to prejudice the final outcome.\nAdd to word list\nAdd to word list\nan unreasonable opinion, especially about a particular group of people, that is formed without thought or knowledge: prejudice against sb/sth The prejudice against hiring someone 50 or older is unsound, because of the value, wisdom, and experience older people bring to the workforce. racial/religious prejudice\nwith prejudice\nLAW if a decision or action is made with prejudice to a right, you have lost that right: The government agreed to dismiss the criminal charges with prejudice, meaning that they cannot be refiled.with prejudice to sth The case shall be dismissed with prejudice to the refiling of the same or similar cause of action.\nwithout prejudice\nLAW if a decision or action is made without prejudice to a right, you continue to have that right: Three days later, she asked for a dismissal without prejudice, meaning that she can re-file at any time.without prejudice to sth The original contract of sale is rescinded, but without prejudice to any claim that the seller may have for damages.\nto unfairly influence someone or something, so that an unreasonable opinion or decision is the result: prejudice sb against sb/sth His comments may have prejudiced the voters against her.\nto have a harmful influence on something: The absence of expert testimony prejudiced her defense."}