{"id":288514,"name":"preliminary","type":"adjective","us_sound":"prɪˈlɪm.ə.ner.i","us_link":"../audio/p/preliminary.mp3","uk_sound":"prɪˈlɪm.ɪ.nər.i","uk_link":"../audio/p/ukprefe019.mp3","content":"Add to word list\nAdd to word list\nC1 coming before a more important action or event, especially introducing or preparing for it: Preliminary results show that the vaccine is effective, but this has to be confirmed by further medical trials. We've decided to change the design based on our preliminary findings.\nMore examplesFewer examplesThe preliminary results are very positive.Our preliminary findings suggest an increased risk for those aged over 60.Jackson is performing well in the preliminary stages of the competition.The two officials will be meeting today in order to establish a preliminary agreement.I'd like to make a few preliminary remarks before we begin the discussion.\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduce\nintroduction\nintroductory\nlead up to something\nlead-in\npreamble\npredecessor\npreface\nprefix\npreliminarily\nprelude\nreintroduce\nSee more results »\nan event or action that introduces or prepares for something else: After a few polite preliminaries (= introductions), we stated our main ideas and intentions. The French team finished first in the competition preliminaries (= the first part of the competition).\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nemcee\nforerunner\nintroduce\nintroduction\nintroductory\nlead up to something\nlead-in\npreamble\npredecessor\npreface\nprefix\npreliminarily\nprelude\nreintroduce\nSee more results »\nAdd to word list\nAdd to word list\ncoming before a more important action or event, esp. introducing or preparing for it: preliminary talks a preliminary investigation The preliminary rounds of negotiation went well. preliminary noun [ C usually pl ] us\nYour browser doesn't support HTML5 audio\n/prɪˈlɪm·əˌner·i/\nHer time of 12:32 took four seconds off the mark she set in Friday’s preliminaries.\nAdd to word list\nAdd to word list\ncoming before or done to prepare for a main or more important action, event, etc: preliminary data/numbers/statistics The preliminary numbers indicate that all classes of creditors have accepted the plan. A final report showed inflation rising 2.4%, up from a preliminary estimate of 2.3%. He emphasized that the commissioner's decision is only preliminary. The National Transportation Safety Board, in a preliminary report, did not say what may have caused the crash. The case was dismissed because prosecutors were not ready for the preliminary hearing.preliminary agreement/approval/decision The commission has given preliminary approval to another 27 projects totaling $3.1 billion.a preliminary inquiry/investigation At present a preliminary investigation is under way. preliminary discussions/meetings/talks\nan event or action that prepares for or introduces something: After the greetings and other preliminaries, the meeting got down to serious business."}