{"id":288624,"name":"premed","type":"noun","us_sound":"priːˈmed","us_link":"../audio/p/eus22560.mp3","uk_sound":"priːˈmed","uk_link":"../audio/p/cdo0216premuk1532.mp3","content":"Add to word list\nAdd to word list\n[ U ] a college or university course that prepares students for medical school: Michael decided that premed was no longer for him. I started in premed and switched to social work.\n[ C ] a student who is doing a course that prepares him or her for medical school: This is a difficult question to answer for a premed.\n[ C ] a drug or mix of drugs sometimes given to relax someone before an anaesthetic (= a substance that makes you unable to feel pain): The surgeon said I was nervous and gave me a premed.\nSMART Vocabulary: related words and phrases\nMedical studies & the people who study them\nanatomist\naudiologist\naudiology\nbacteriologist\nbariatrics\ncardiologist\nmannikin\nmidwife\nneurologist\nodontology\noncological\noncologist\noptometry\noral surgeon\northopaedics\nuncontrolled\nurology\nvirologist\nvirology\nvivisectionist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedicines & drugs\nrelating to or doing a course that prepares someone for medical school: He was a premed student at the University of California. The two students had been admitted to a prestigious premed program.\nMore examplesFewer examplesIt all began while he was still an undergraduate on the premed track at Harvard.He offered to pay for an extra year of college if she would take premed courses.\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nreception\nworkshop\nSee more results »\nAdd to word list\nAdd to word list\nbeing in a university course that prepares students for medical school: He was a premed student at the University of California."}