{"id":288722,"name":"premium","type":"noun","us_sound":"ˈpriː.mi.əm","us_link":"../audio/p/premium.mp3","uk_sound":"ˈpriː.mi.əm","uk_link":"../audio/p/ukpremi005.mp3","content":"premium noun\n(EXTRA)\nAdd to word list\nAdd to word list\n[ C ] an amount that is more than usual: We're willing to pay a premium for the best location. Because of their location, these offices attract a premium. The modified cars are available at a premium of five percent over the original price. The busy shopper puts a premium on (= appreciates and will pay more for) finding everything in one big store.\nMore examplesFewer examplesYou usually pay a premium for organic meat and vegetables.These flats attract a premium because of their riverside location.A higher spec version is available at a premium of £3000 above the standard price.Customers will be required to pay a premium for this extra service.Vintage champagne is being sold at a premium.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\npremium noun\n(PAYMENT)\nC2 [ C ] an amount of money paid to get insurance: Car insurance premiums have increased this year. The premiums for healthcare plans are high.\nMore examplesFewer examplesa monthly premium of £30Many insurance companies are under pressure to increase premiums to stay solvent.Do you pay a health insurance premium?We pay the car insurance by an annual premium.Our monthly premium for house insurance has gone up.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nassessor\nassurance\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\npremium noun\n(FUEL)\n[ U ] (also premium fuel); (US also premium gas) the highest quality fuel that can be used in cars\nSMART Vocabulary: related words and phrases\nPetroleum products especially when used as fuel\nantiknock\nantiknocking\nderv\ndiesel\ngasohol\nhexane\nhigh-octane\njuice\nleaded\nmineral oil\nnon-leaded\noil\nparaffin\npetrochemical\npetrol\npetroleum\npetroleum jelly\npetroleum-based\npropane\nunleaded\nSee more results »\nIdiom\nbe at a premium\nC2 used to refer to something that is of higher than usual quality: premium ice cream The building is on a premium site.\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\npremium noun [C]\n(PAYMENT)\nAdd to word list\nAdd to word list\nan amount of money paid at regular times to insure (= protect against risk) your health or life, or your home or possessions: That could mean higher Medicare premiums for retirees.\npremium noun [C]\n(EXTRA)\nsomething extra given or an extra amount charged: You get a lipstick as a premium with the purchase of this makeup. Our customers are willing to pay a premium for a superior product. at a premium\nIf you get something at a premium, you pay a high price for it, esp. because it is not easily available: It’s possible to get a large apartment, but only at a premium.\nA premium is also a great amount of importance: The admissions office places a premium on a student’s character in the selection process.\npremium adjective [not gradable]\n(EXTRA)\nof higher than usual quality or value: premium gasoline\nAdd to word list\nAdd to word list\nan amount of money that is more than usual: We're willing to pay a premium for the best location.attract/command a premium BMW, Mercedes, Volvo, and even Volkswagen have usually commanded a premium because they are seen as stylish.\nHR, WORKPLACE →\npremium pay\nINSURANCE →\ninsurance premium See also\nshare premium\nat a premium\nat a high price or a higher price than might be expected: We made 2.20 a share this year, and are trading at a premium on the S&amp;P 500.at a premium to sth Investors had bid up the bank's shares in recent weeks, because they thought a bigger bank might buy the company at a premium to the current stock price.\nput a premium on sth\nto consider something to be very important or valuable: The busy shopper puts a premium on finding everything in one big store. See also\noption premium\nof very high quality: The premium package also provides higher screen resolution. All high street banks offer some sort of \"premium banking service\" to wealthier customers.\nvery high, or higher than usual: Experts advise businesses to switch to producing quality goods, which will be desirable to customers even at a premium price."}