{"id":289036,"name":"preparation","type":"noun","us_sound":"ˌprep.əˈreɪ.ʃən","us_link":"../audio/p/preparation.mp3","uk_sound":"ˌprep.ərˈeɪ.ʃən","uk_link":"../audio/p/ukpremi018.mp3","content":"preparation noun\n(GETTING READY)\nAdd to word list\nAdd to word list\nB1 [ U ] the things that you do or the time that you spend preparing for something: The teacher didn't seem to have done much preparation for the class. The team blamed injuries and lack of preparation for their loss. Yasmin assisted in the preparation of this article. preparations B2 [ plural ]\nplans or arrangements that you make to prepare for something: [ + to infinitive ] We are making preparations to fly Mr Goodall to the nearest hospital.\nSee more\nMore examplesFewer examplesThere was a lot of activity in preparation for the Queen's visit.They have been strengthening their border defences in preparation for war.We shared the preparation for the party between us, so it wasn't too much work.They're making the most elaborate preparations for the wedding.If I'm going to do my best in this interview I'll need to do some preparation.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\nprep\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\ntune\nSee more results »\npreparation noun\n(MIXTURE)\n[ C ] a mixture of substances, often for use as a medicine: a preparation for nappy rash\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\nchurn\ncrossed\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nmeld\nmethylate\nmingle\nmosaic\nmush\nsaturated solution\nscramble\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedicine in different forms\nAdd to word list\nAdd to word list\nthe state of being ready for something that will happen, or an action taken to become ready: [ U ] The teacher said my preparation for the exam was inadequate. [ C ] By the next morning our preparations for the storm were complete. [ U ] A platform had been set up in preparation for the ceremony."}