{"id":289046,"name":"prepare","type":"verb","us_sound":"prɪˈper","us_link":"../audio/p/prepare.mp3","uk_sound":"prɪˈpeər","uk_link":"../audio/p/ukpremi021.mp3","content":"Add to word list\nAdd to word list\nA2 to make or get something or someone ready for something that will happen in the future: Have you prepared for your interview? She'll prepare the food ahead of time and freeze it. This course prepares students for middle and senior managerial positions. [ + obj + to infinitive ] Are the players mentally and physically prepared to play a tough game? The meal took two hours to prepare.\nB1 to expect that something will happen and to be ready for it: [ + to infinitive ] It almost seems as if she is preparing to die. You need to prepare yourself for a long wait.\nMore examplesFewer examplesI was busily preparing for their arrival.The sixth-form students are preparing to take their A levels.I don't think you appreciate how much time I spent preparing this meal.Flushed with success after their surprise win against Italy, Belgium are preparing for Saturday's game against Spain.I hadn't prepared a speech so I just said a few words off the cuff.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\npreparation\nset something up\nset the scene/stage idiom\nsuit\nsuit up\nsurvivalism\ntee\ntune\nSee more results »\nIdiom\nprepare the ground\nAdd to word list\nAdd to word list\nto make or get something or someone ready for something that will happen in the future: [ T ] Keane is preparing a film version of the play. [ I ] The Southeast prepared for the worst as the hurricane turned toward the Atlantic coast. preparatory adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/prɪˈpær·əˌtɔr·i, -ˈpeər-, ˈprep·ər·ə-, -ˌtoʊr·i/\nPlans for building a new school are under way, but so far only in the preparatory stage. preparedness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/prɪˈpeər·ɪd·nəs/\nearthquake preparedness Idiom\nbe prepared to do something"}