{"id":289171,"name":"preposition","type":"noun","us_sound":"ˌprep.əˈzɪʃ.ən","us_link":"../audio/p/preposition.mp3","uk_sound":"ˌprep.əˈzɪʃ.ən","uk_link":"../audio/p/ukpremi028.mp3","content":"Add to word list\nAdd to word list\nB1 in grammar, a word that is used before a noun, a noun phrase, or a pronoun, connecting it to another word: In the sentences \"We jumped in the lake\", and \"She drove slowly down the track\", \"in\" and \"down\" are prepositions.\nMore examplesFewer examplesIn the sentence 'The dog jumped over the wall', the word 'over' is a preposition.Some prepositions consist of more than one word, such as 'out of'.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\ndefinite article\npart of speech\nprep\nrelative pronoun\nSee more results »\nRelated word\nprepositionalGrammar\nNouns and prepositionsMany nouns have particular prepositions which normally follow them. Here are some common examples: …\nPrepositionsWe commonly use prepositions to show a relationship in space or time or a logical relationship between two or more people, places or things. Prepositions are most commonly followed by a noun phrase or pronoun (underlined): …\nPrepositions: usesWe commonly use prepositions to show a relationship in space or time or a logical relationship between two or more people, places or things. Prepositions are most commonly followed by a noun phrase or pronoun (underlined): …\nPrepositions: position and strandingTraditional grammatical rules say that we should not have a preposition at the end of a clause or sentence. However, we sometimes do separate a preposition from the words which follow it (its complement). This is called preposition stranding, and it is common in informal styles: …\nPrepositional phrasesPrepositional phrases consist of a preposition and the words which follow it (a complement). The complement (underlined below) is most commonly a noun phrase or pronoun, but it can also be, an adverb phrase (usually one of place or time), a verb in the -ing form or, less commonly, a prepositional phrase or a wh-clause: …\nPrepositions and their complementsPrepositional phrases consist of a preposition and the words which follow it (a complement). The complement (underlined below) is most commonly a noun phrase or pronoun, but it can also be, an adverb phrase (usually one of place or time), a verb in the -ing form or, less commonly, a prepositional phrase or a wh-clause: …\nPrepositional phrases after verbsPrepositional phrases can be complements of verbs. If we need a special preposition to introduce the complement of the verb, we call such verbs ‘prepositional verbs’: …\nAdd to word list\nAdd to word list\ngrammar a word that connects a noun, a noun phrase, or a pronoun to another word, esp. to a verb, another noun, or an adjective: In the sentence, \"We jumped in the lake,\" \"in\" is a preposition, and in the sentence, \"I heard the sound of loud music,\" \"of\" is a preposition."}