{"id":289906,"name":"pressurized","type":"adjective","us_sound":"ˈpreʃ.ə.raɪzd","us_link":"../audio/p/uscld01129.mp3","uk_sound":"ˈpreʃ.ər.aɪzd","uk_link":"../audio/p/ukcld01129.mp3","content":"pressurized adjective\n(CONTAINER)\nAdd to word list\nAdd to word list\nIf a container, etc. is pressurized, the air pressure inside it is higher than the air pressure outside it: a pressurized tank Aircraft cabins are pressurized.\nMore examplesFewer examplesThe aeroplane was built to fly at high altitudes, and it had one of the first pressurized cabins.Once luggage moves from the check-in desk to the conveyor belt, it is put in a pressurized box that detonates any explosive before the bag is loaded on the plane.Artesian wells are sunk into pressurized rock formations, and the water gushes out like a natural spring.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\nrarefy\nreflective\nrustily\nrusty\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\npressurized adjective\n(SITUATION)\ndifficult to deal with, especially because there are a lot of things to do or difficult decisions to make: In head office everything's very pressurized, with deadlines left, right, and centre. He has performed best under the most pressurized circumstances.\nMore examplesFewer examplesThe increasingly pressurized environment of classrooms is having a negative effect on children. In this pressurized setting, separate divisions worked as fast as possible.He did not trust them to keep their nerves under control in such a pressurized spot.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »"}