{"id":289745,"name":"president","type":"noun","us_sound":"ˈprez.ɪ.dənt","us_link":"../audio/p/eus73699.mp3","uk_sound":"ˈprez.ɪ.dənt","uk_link":"../audio/p/ukprese007.mp3","content":"president noun [C]\n(POLITICS)\nAdd to word list\nAdd to word list\nA2 (the title given to) the person who has the highest political position in a country that is a republic and who, in some of these countries, is the leader of the government: President Kennedy the president of France [ as form of address ] Thank you, Mr/Madam President.\nMore examplesFewer examplesBoris Yeltsin was Russia's first democratically elected president.The former president has agreed to act as an intermediary between the government and the rebels.The country's president is seeking to mend relations with the United States.Several opposition groups are fighting to remove the president from power.She is Ireland's first woman president.\nSMART Vocabulary: related words and phrases\nLeaders of national & regional governments\nchancellor\nchancellorship\nchief executive\nco-ruler\ncollector\nFM\ngeneralissimo\ngovernor\ngovernorship\ngubernatorial\npremier\npremiership\nPres.\npresidency\nTaoiseach\nthe power behind the throne idiom\nTánaiste\nveep\nvice president\nvice-presidential\nSee more results »\npresident noun [C]\n(ORGANIZATION)\nthe person who has the highest position in an organization or, especially in the US, in a company: a former president of the Royal Societymainly US She's a friend of the president of the bank.\nMore examplesFewer examplesHe was president of the charity for ten years.The new president of the company called a top-level management meeting.The president of my bank has been named Businessperson of the Year.She told me that her father is the president of a multinational corporation.There was a top-level meeting of oil company presidents today to discuss the crisis.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\nvice presidency\nvice president\nvicegerency\nvicegerent\nwarden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBosses & managers\nRelated word\npresidential\npresident noun [C]\n(POLITICS)\nAdd to word list\nAdd to word list\npolitics &amp; government\n&#160; (abbreviation Pres.) the highest political position in the United States and some other countries, usually the leader of the government: Several people are considering running for president, but none have announced their candidacy yet.\npresident noun [C]\n(ORGANIZATION)\na person who has the highest position in a company or organization: The company’s board of directors will name a new president at its next meeting. presidential adjective us\nYour browser doesn't support HTML5 audio\n/ˌprez·ɪˈden·ʃəl/\na presidential candidate\nAdd to word list\nAdd to word list\nHR, WORKPLACE the person who has the highest position in an organization or, especially in the US, in a company: president of sth He was president of the charity for ten years. The new president of the company called a top-level management meeting.\nPOLITICS\n&#160; (also President) in the US and some other countries, the highest position in the government See also\nexecutive vice president\nvice president"}