{"id":289644,"name":"presentation","type":"noun","us_sound":"ˌprez.ənˈteɪ.ʃən","us_link":"../audio/p/presentation.mp3","uk_sound":"ˌprez.ənˈteɪ.ʃən","uk_link":"../audio/p/ukprepo023.mp3","content":"presentation noun\n(EVENT)\nAdd to word list\nAdd to word list\nB1 [ C ] a talk giving information about something: The speaker gave an interesting presentation on urban transport.\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\nB2 [ C ] an occasion when prizes, qualifications, etc. are formally given to those who have won or achieved them: The presentation of prizes and certificates will take place in the main hall.\nMore examplesFewer examplesThe presentation was a collaborative effort by all the children in the class.The charity invited the press to a presentation of its plans for the future.The magazine asked its readers to send in their comments about the new style of presentation.Jenny's retiring and I think there's going to be a small presentation this afternoon.Graduates must be in full academic dress at the presentation of certificates.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\nsermon\nsermonize\nslide\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nCeremonies\npresentation noun\n(APPEARANCE)\nC2 [ U ] the way something looks when it is shown to other people, or the way someone looks: Presentation is important if you want people to buy your products.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nAdd to word list\nAdd to word list\nthe act of giving or showing something, or the way in which something is given or shown: [ C ] a multimedia presentation [ C ] After the sales presentation, the board had a number of questions. [ U ] Presentation of the awards takes place at a banquet in June. [ U ] Both the food and its presentation were excellent.\nAdd to word list\nAdd to word list\n[ C ] a talk to a group in which information about a new product, plan, etc. is presented: give/make/do a presentation I made a presentation to the board, but sadly it was rejected. They gave a PowerPoint presentation explaining what they hoped to accomplish.sales/strategy presentation Closing a sale constitutes the objective of any sales presentation.\n[ U ] the way in which someone or something appears or is shown: Presentation is important if you want people to buy your products.business/corporate/public presentation The most important place to spend money is on business presentation, meaning the quality of your stationery, business cards, brochures, etc."}