{"id":289898,"name":"pressure","type":"noun","us_sound":"ˈpreʃ.ɚ","us_link":"../audio/p/pressure.mp3","uk_sound":"ˈpreʃ.ər","uk_link":"../audio/p/ukprese013.mp3","content":"pressure noun\n(PUSHING)\nAdd to word list\nAdd to word list\nC2 [ U ] the force you produce when you press something: He put too much pressure on the door handle and it snapped. You can stop bleeding by applying pressure close to the injured area.\nC1 [ C or U ] the force that a liquid or gas produces when it presses against an area: gas/water pressure The new material allows the company to make gas pipes which withstand higher pressures. The gas is stored under pressure (= in a container which keeps it at a higher pressure than it would usually have).\nMore examplesFewer examplesIf you apply pressure to a cut it's meant to stop the bleeding.She tried to cure the pain in my knee by putting manual pressure on the joint.The alarm is activated by the lightest pressure.My ankle is extremely painful if I put any pressure on it.The vacuum inside the tube caused it to implode when the external air pressure was increased.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\npressure noun\n(PERSUADING)\nB2 the act of trying to make someone else do something by arguing, persuading, etc.: public/political pressure Teachers are under increasing pressure to work longer hours. [ + to infinitive ] Pressure to abandon the new motorway is increasing. The government is facing pressure from environmental activists. The Defence Secretary resigned under pressure from the Prime Minister (= because the Prime Ministerforced him to). She's putting pressure on him (= trying to persuade him) to get married.formal The international community is trying to bring pressure to bear on the government (= trying to persuade them) to resolve the situation.\nB2 [ C or U ] a difficult situation that makes you feel worried or unhappy: She's got a lot of pressure on her at work just now. Be nice to him - he's been under a lot of pressure recently. Can you work well under pressure? the pressures of work so no pressure then! humorous\nsomething that you say when what someone has just said makes you feel that you must try very hard to do something: \"These exams are the most important of all.\" \"Oh, so no pressure then!\"\n[ U ] a situation in a football game in which attacking players are moving forward and getting closer to scoring a goal, and players from the opposing team have to work hard to stop them from scoring: Ryan Giggs put the home defence under pressure. Playing four forwards puts too much pressure on the defence.\nMore examplesFewer examplesThey are putting pressure on the government to equalize state pension ages between men and women.Some managers exert considerable pressure on their staff to work extra hours without being paid.He's putting pressure on me to change my mind.Despite renewed pressure to give up the occupied territory, they will not yield.Her confession could not be admitted as evidence because it was given under pressure from the police.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUrging & persuading\nAnxiety and worry - general words\nTrying and making an effort\nCompeting in sport\nFootball/soccer\nto strongly persuade someone to do something they do not want to do: She was pressured into joining the club. Synonym\ncoerce formal\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUrging & persuading\npressure noun\n(FORCE)\nAdd to word list\nAdd to word list\n[ C/U ] the force produced by pressing against something: [ U ] air/blood/water pressure\n[ C/U ]\n&#160; physics Pressure is also the force that is put on a surface with reference to the area of the surface.\npressure noun\n(INFLUENCE)\n[ C/U ] a strong, often threatening influence on an organization or person: [ C ] Competitive pressures will force the company to sell off its factories.\n[ C/U ] If you put pressure on someone, you try to cause that person to do something by persuading or threatening them: [ U ] They put a lot of pressure on him to resign.\npressure noun\n(WORRY)\n[ U ] worry and fear caused by the feeling that you have too many responsibilities and cares: I like this job – there’s not so much pressure to produce every day.\npressure verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈpreʃ·ər/\nShe was pressured into signing the agreement.\nAdd to word list\nAdd to word list\na situation in which someone tries to make someone else do something by arguing, persuading, etc.: public/political pressure The guidelines were imposed under pressure from Congress.\na difficult situation, or the worried feeling that such a situation can give you: pressure on sb She's got a lot of pressure on her at work just now. He doesn't work well under pressure. The pressures of work are making her depressed.\nput pressure on sb/sth\nto put someone or something in a difficult situation, or to try and persuade or force someone to do something: Analysts said the lack of supply would undoubtedly put pressure on prices."}