{"id":289858,"name":"press","type":"verb","us_sound":"pres","us_link":"../audio/p/press.mp3","uk_sound":"pres","uk_link":"../audio/p/ukprese010.mp3","content":"press verb\n(PUSH)\nAdd to word list\nAdd to word list\nB1 [ I or T, usually + adv/prep ] to push something firmly, often without causing it to move permanently further away from you: Press the button to start the machine. He pressed his face against the window. Can you press a little harder on my shoulders, please? The crowd pressed against the locked doors trying to get into the building. Press down firmly on the lever.\n[ T ] to make clothes smooth by ironing them: I'll just press these trousers.\n[ T ] to put a weight on fruit in order to remove the juice: to press grapes\n[ T ] to make a CD, DVD, etc.: Over 3,000 copies of the CD were pressed and sent out to college radio stations.\n[ T ] to make something flat and firm by putting it under something heavy: The children pressed some flowers. pressed turkey breast\nMore examplesFewer examplesPeel off the backing strip and press the label down firmly.I put my money in the slot and pressed the button but nothing came out.I pressed the buzzer and after a while someone came to the door.Mike pressed hard on the wound and staunched the flow of blood.He inserted the CD and pressed the 'play' button.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCleaning clothes\nPreparing food\nRecording sounds and images\npress verb\n(PERSUADE)\nC2 [ T ] to try hard to persuade someone to do something: [ + obj + to infinitive ] The committee pressed him to reveal more information. He's pressing me for an answer. Can I press you further on (= persuade you to say more about) this issue? press charges\nC2 to complain officially about someone in a law court: press charges against The family have decided not to press charges against him.\nSee more press a case/claim\nto continue to try to make people accept your demands: press a case/claim for Once again he tried to press his case for promotion.\nSee more\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »\nIdioms\npress something/someone into service\npress home your advantage\npress the fleshPhrasal verbs\npress on/ahead\npress something on someone\npress noun\n(NEWSPAPERS)\nthe press [ S, + sing/pl verb ]\nB2 newspapers and magazines, and those parts of television and radio that broadcast news, or reporters and photographers who work for them: in the press The incident has been widely reported in the press.freedom of the press Freedom of the press (= the right of newspapers to publish news and opinions without being controlled by the government) must be upheld. press reports/coverage press reporters/photographers the local/national press The charity invited the press (= reporters and photographers) to a presentation of its plans for the future. The press was out in force at the awards ceremony.\nMore examplesFewer examplesThe government is being widely criticized in the press for failing to limit air pollution.The judge issued a gagging order to prevent the witnesses from speaking to the press.Jones was censured for leaking a secret report to the press.The school issued the press with a statement about its plans.I never said that at all - the press misquoted me.\nC1 [ S or U ] the judgment that is given of someone or something in the newspapers or on radio or television: What kind of press did his play get?UK The play has had a good/bad press.US The play has had good/bad press.\nSMART Vocabulary: related words and phrases\nMedia in general\nanti-press\nconsume\neditorially\nmainstream media\nmedia\nmedia event\nmedium\nMSM\nnon-broadcast\norgan\nprofile\npublishing\nthe Fourth Estate\nthe mass media\nunreported\nvehicle\nYou can also find related words, phrases, and synonyms in the topics:\nNewspapers & magazines\nJudgments and analyses\npress noun\n(BOOKS)\n[ C ] a business that prints and produces books and similar things: Cambridge University Press\nMore examplesFewer examplesEdinburgh University Presspublished by Manchester University Press\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\npress noun\n(PRINTING MACHINE)\n[ C ] a machine that is used for printing: a printing press\nKim Steele/DigitalVision/GettyImages go to press\nto start to be printed: The newspaper will go to press at midnight.\nSee more\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\npress noun\n(PUSH)\n[ C usually singular ] a firm push against something using the fingers: To start the machine, just give this button a press.\n[ S ] the act of making cloth smooth with an iron: Can you give this shirt a quick press?\n[ C ] a piece of equipment that is used to put weight on something in order to crush it, remove liquid from it or to make it flat: a garlic/trouser/wine press\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things more or less smooth or straight\nWines & winemaking\npress verb\n(PUSH)\nAdd to word list\nAdd to word list\n[ I/T ] to push firmly against something that is fixed in position: [ T ] I pressed the volume button on the remote. [ I always + adv/prep ] The crowd pressed up against the doors. [ I always + adv/prep ] He pressed down hard on the accelerator, and the car shot ahead.\n[ I/T ] When you press clothes, you use an iron (= a heavy device with a flat base) to make them smooth.\npress verb\n(PERSUADE)\n[ T ] to try to persuade or cause someone to do something, or to act in a determined way to cause something to be accepted: The police pressed her to identify the man she had seen. Marquez will visit Washington to press his country’s case. She decided not to press charges against him (= make an official complaint). Phrasal verbs\npress ahead (with something)\npress for something\npress on\npress noun\n(DEVICE)\n[ C ] any of various devices that use force: a pants press a garlic press a printing press\npress noun\n(NEWSPAPERS)\n[ U ] newspapers, magazines, and other businesses that communicate news to the public by print, television, or radio, or the people who work to prepare and present the news: Is the press too conservative?\n[ U ] Good/bad press is the positive or negative reaction of newspapers, magazines, etc., to a person or thing: At some point, every president has complained about bad press.\npress noun\n(PUBLISHER)\n[ C ] a business that prints and produces books or other printed material: Cambridge University Press\nAdd to word list\nAdd to word list\nto try hard to persuade someone to do something: The committee pressed him to reveal more information.press (sb) for sth The lawyers are likely to press for a settlement of claims.\npress charges\nto complain officially about someone in a court of law: press charges against sb Italian magistrates are expected to press charges against the company's founder.\npress your case\nto try to make people accept your demands: He was determined to press his case for promotion.\nPhrasal verbs\npress ahead/on\npress sb about/on sth\npress sth on sb\nCOMMUNICATIONS\n&#160; (also the press) newspapers and magazines, and those parts of television and radio that broadcast news, or the people who work for newspapers, etc.: in the press The company's problems have been widely reported in the press.freedom of (the) press He was an outspoken activist in favor of freedom of press and freedom of speech. The press was present at the briefing in large numbers and asked some awkward questions. local/national press press reports/coverage press reporters/photographers\n[ S or U ] the judgment that is given about someone or something in the newspapers or on radio or television: (a) good/bad press The announcement has had a generally good press.\n[ C ] a business that publishes and sometimes prints books, etc.: Cambridge University Press\n[ C ]\n&#160; PRODUCTION a machine that is used for printing books, etc.: a printing press\ngo to press\nto start to be printed, or to include something in a newspaper, etc.: The last issue of the journal went to press before the news broke. She had gone to press with the rumour without checking her sources first."}