{"id":289630,"name":"presence","type":"noun","us_sound":"ˈprez.əns","us_link":"../audio/p/presence.mp3","uk_sound":"ˈprez.əns","uk_link":"../audio/p/ukprepo019.mp3","content":"Add to word list\nAdd to word list\nB2 [ S ] the fact that someone or something is in a place: She was overawed by the presence of so many people. The presence of pollen in the atmosphere causes hay fever in some people. He's usually quite polite in my presence. The document was signed in the presence of two witnesses.\nC2 [ C usually singular ] a feeling that someone is still in a place although they are not there or are dead: His daughter's presence seemed to fill her empty bedroom.\nC2 [ S ] a group of police or soldiers who are watching or controlling a situation: The United Nations has maintained a presence in the region for some time. There was a strong police presence at the demonstration.\nC2 [ U ] approving a quality that makes people notice or admire you, even when you are not speaking: stage presence He stood there in the corner of the room, a dark, brooding (= worrying) presence.\nMore examplesFewer examplesThe strong police presence only heightened the tension among the crowd.Some workers were inhibited from speaking by the presence of their managers.He didn't even acknowledge my presence.He signed the treaty in the presence of two witnesses.He stood there in the corner of the room, a dark, brooding presence.\nSMART Vocabulary: related words and phrases\nPresent\nall over\nappearance\nattend\nattendance\nattendant\nbe in at the kill idiom\nbulk\nfront\nimmanent\nimmanently\nin the flesh idiom\nkick\nkick around\nkill\npresent\nseropositive\nsit\nsit through something\nsynchronic\nsynchronically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNon-existence and not being\nStrange, suspicious and unnatural\nBehaving, interacting and behaviour\nIdiom\nmake your presence felt\npresence noun [C/U]\n(PLACE)\nAdd to word list\nAdd to word list\nPresence is also a person’s ability to make his or her character known to others: [ U ] He writes better, he reports better, and his presence on camera is better.\nIf a country or organization has a presence somewhere, some of its members are there."}