{"id":289638,"name":"present","type":"noun","us_sound":"ˈprez.ənt","us_link":"../audio/p/present_01_00.mp3","uk_sound":"ˈprez.ənt","uk_link":"../audio/p/ukprepo020.mp3","content":"present noun\n(SOMETHING GIVEN)\nAdd to word list\nAdd to word list\nA2 [ C ] (UK informal prezzie); (or pressie, uk/ˈprez.i/ us/ˈprez.i/) something that you are given, without asking for it, on a special occasion, especially to show friendship, or to say thank you: a birthday/Christmas/wedding present They gave me theatre tickets as a present. Synonyms\ngift (PRESENT)\noffering\nThesaurus: synonyms, antonyms, and examples\nsomething that you givepresentThe coat was a birthday present from my sister.giftI have a small gift for you.donationAfter the earthquake, donations poured in from all over the world.grantStudents receive a grant equal to £250 per month.contributionShe wanted to make a financial contribution to the family.\nSee more results »\nMore examplesFewer examplesWe're having a collection for Tom's retirement present.They got an entire set of silver cutlery as a wedding present.I was looking for a birthday present for my mother but I didn't find anything suitable.Aren't you going to unwrap your presents?The children squealed in delight when they saw all the presents under the Christmas tree.\nSMART Vocabulary: related words and phrases\nPresents and gifts\nChristmas box\nChristmas stocking\ncomp\nfavour\nfree gift\nfreebie\ngift wrap\ngiftee\ngiveaway\ngoody bag\ngrab bag\nlittle\nnovelty\noffering\nperk\nprezzie\nsecret Santa\nstocking\nstocking filler\ntoken\nSee more results »\npresent noun\n(NOW)\nthe present B1 [ S ]\nthe period of time that is happening now, not the past or the future: That's all for the present.in the present The play is set in the present.\nMore examplesFewer examplesI'm usually too immersed in the present to worry about the future.Let's talk about the present.\nthe present (tense)\nA1 [ S ]\n&#160; language the form of the verb that is used to show what happens or exists now: The verb in this sentence is in the present.\nSee more at present B1 formal\nnow: \"Are you busy?\" \"Not at present.\"\nSee more\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nmodern-day\nmoment\nright\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\ntopicality\nSee more results »\nGrammar\nPresentPresent time refers to the time around the moment of writing or speaking (time around now) and to general and permanent time. The two most common ways to refer to present time are the present simple for general facts and regular events, and the present continuous for an event happening now: …\nPresent verb forms referring to the pastWe commonly use the present simple to refer to the past when we want to make events sound as if they are happening now. For example, news headlines are commonly written in the present simple: …\nPresent: typical errorsWe always use the -s form for third person singular present simple: …\npresent adjective\n(IN A PLACE)\nB1 [ after verb ] in a particular place: The whole family was present. There were no children present.\nMore examplesFewer examplesMind your language - there are ladies present!Is it necessary for all of us to be present at the meeting this afternoon?Melanin is the dark brown pigment of the hair, skin, and eyes that is present in varying amounts in every human being.More men are present at the births of their children these days.There ought to be an adult present at all times, when there are young children in the pool.\nSMART Vocabulary: related words and phrases\nPresent\nall over\nappearance\nattend\nattendance\nattendant\nbe in at the kill idiom\nbulk\nfront\nimmanent\nimmanently\nin the flesh idiom\nkick\nkick around\nkill\npresence\nseropositive\nsit\nsit through something\nsynchronic\nsynchronically\nSee more results »\npresent adjective\n(NOW)\n[ before noun ] happening or existing now: I don't have her present address. Please state your present occupation and salary. Related word\npresently (NOW) mainly US formal\nMore examplesFewer examplesCharlie has a clever plan for getting us out of our present difficulties.Unlike the present government, we believe in serving the community.The present system of payment will remain in effect until the end of the rental agreement.The present voting system distorts the wishes of the electorate.Are you feeling frustrated in your present job?\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nmodern-day\nmoment\nright\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\ntopicality\nSee more results »\nGrammar\nPresentPresent time refers to the time around the moment of writing or speaking (time around now) and to general and permanent time. The two most common ways to refer to present time are the present simple for general facts and regular events, and the present continuous for an event happening now: …\nPresent verb forms referring to the pastWe commonly use the present simple to refer to the past when we want to make events sound as if they are happening now. For example, news headlines are commonly written in the present simple: …\nPresent: typical errorsWe always use the -s form for third person singular present simple: …\nIdiom\npresent company excepted\npresent verb\n(GIVE)\nB2 [ T ] to give, provide, or make something known: The winners were presented with medals. The letter presented the family with a problem that would be difficult to solve. The documentary presented us with a balanced view of the issue. He presented the report to his colleagues at the meeting. The classroom presented a cheerful busy atmosphere to the visitors (= appeared to them to have this). The school is presenting (= performing) \"West Side Story\" as its end-of-term production.\nMore examplesFewer examplesHe has a lot more work to do before he can present the scheme to the public.Ruth was astonished when he presented her with an engagement ring.She presented a well-argued case for the banning of smoking in public places.She graciously accepted the flowers that were presented to her.The Duchess of Kent will be presenting the trophies.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\npresent verb\n(INTRODUCE)\nB2 [ T ] UK to introduce a television or radio show: She presents the late-night news.\n[ T ] formal to introduce a person: May I present Professor Carter? Later on I'd like to present you to the headteacher. present yourself\nto arrive somewhere and introduce yourself: He presented himself at the doctor's at 9.30 a.m. as arranged. You should present yourselves at the front desk at 8 o'clock in the morning. He presented himself to the Criminal Tribunal in The Hague. She presented herself at the abbey to begin her life as a nun. I presented myself to the supervisor, eager to begin work. present itself C2\nIf something presents itself, it happens: An opportunity suddenly presented itself. When a challenge to his authority presented itself, he dealt with it firmly. She opted for cash over comfort whenever the choice presented itself. I would be open to taking up a directorship should the right opportunity present itself. After a couple of successful years, a new hurdle presented itself.\nMore examplesFewer examplesI'd like to present my grandson, Jackson Junior.He was presented to the Queen and given a knighthood.She used to present one of those holiday programmes but now she reads the news.May I present Sir Bob Geldof?What was that documentary called that she used to present?\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nsyndicated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing friends & getting to know them\nArriving, entering and invading\nOccurring and happening\npresent verb\n(SHOW SIGNS OF ILLNESS)\n[ I ]\n&#160; medical\n&#160; specialized to see a doctor, etc. when showing particular signs of an illness or medical condition : Children presenting with acute respiratory infections were referred for a chest X-ray. When patients present with chest pain, clinical examination and patient history are fundamental to determine the probable cause of pain.\n[ I ]\n&#160; medical\n&#160; specialized (of an illness) to show itself in a particular way: Medical conditions might present differently during pregnancy. Bone cancer generally presents as pain in the area of the tumour.\nSMART Vocabulary: related words and phrases\nMedical treatment: symptoms & diagnosis of medical problems\nadverse reaction\naerophobia\naggressively\namyloid\nanoxia\ncontraindication\nCT scan\ndiagnostic\nechocardiogram\nhistology\nhypoxic\nlacunar\nPCR\nPCR test\nphlebotomy\nprandial\nprognostic\nvital signs\nvitals\nwithdrawal symptoms\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing & falling ill\npresent noun\n(SOMETHING GIVEN)\nAdd to word list\nAdd to word list\n[ C ] something that is given without being asked for, esp. on a special occasion or to say thank you; a gift: a birthday/wedding/graduation present Did you wrap the present?\npresent noun\n(NOW)\n[ U ] this period of time, not the past or the future; now: The story moves back and forth between the past and the present.\npresent adjective [not gradable]\n(GRAMMAR)\nspecialized (in grammar) having the tense of a verb used to describe actions, events, or states that are happening or existing at this time: Her book is written entirely in the present tense.\npresent adjective [not gradable]\n(GRAMMAR)\ngrammar having the tense of a verb used to describe actions, events, or states that are happening or existing at this time: Her book is written entirely in the present tense.\npresent adjective [not gradable]\n(PLACE)\nin a particular place: The mayor was present during the entire meeting.\npresent verb [T]\n(PROVIDE)\nto give, show, provide, or make known: The mayor presented five firefighters with medals for saving people’s lives. Two clubs in the neighborhood present jazz on Thursdays. Dr. Gottlieb will present her research in a series of lectures this spring.\nIf you present yourself, you go to someone or make yourself known to someone: Paul Groncki presented himself to the receptionist on the 41st floor.\nIf something presents itself, it happens or takes place: An opportunity suddenly presented itself.\npresent verb [T]\n(CAUSE)\nto cause something: Falling tax revenues present a problem for the city.\npresent verb [T]\n(INTRODUCE)\nfml to introduce a person: I’m pleased to present my son, Charles.\nAdd to word list\nAdd to word list\nto offer your thoughts, ideas, plans, etc., to others for them to consider: He will present a detailed explanation of the new sales campaign at the next meeting.\nto give a bill, cheque, document, etc., to someone: Today a store scans your goods, and you simply present your credit card and sign your name.present sb with sth Organizers presented her with a check for $25,000.present sth to sb We presented our passports to the customs officer.\nif someone or something presents a problem, opportunity, etc., they create it: The shake-out in bank shares may well have presented an opportunity for bargain hunters.be presented with sth He was presented with a tough choice."}