{"id":290038,"name":"presume","type":"verb","us_sound":"prɪˈzuːm","us_link":"../audio/p/presume.mp3","uk_sound":"prɪˈzjuːm","uk_link":"../audio/p/ukprese021.mp3","content":"presume verb\n(BELIEVE)\nAdd to word list\nAdd to word list\nC1 [ T ] to believe something to be true because it is very likely, although you are not certain: [ + (that) ] I presume (that) they're not coming, since they haven't replied to the invitation. [ + speech ] You are Dr Smith, I presume? \"Are we walking to the hotel?\" \"I presume not/so.\" [ + obj + adj ] The boat's captain is missing, presumed dead (= it is believed that he is dead). In British law, you are presumed innocent until you are proved guilty. [ + obj + to infinitive ] The universe is presumed to contain many other planets with some form of life.\nMore examplesFewer examplesYou were sniffing a lot - I presumed you had a cold.She said it in a whisper so I presumed it wasn't common knowledge.\"Is he coming?\" \"I presume so.\"Under the Bill of Rights, a person is presumed innocent until proved otherwise.A person accused of a crime is presumed innocent until proven guilty.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nfall\nguess\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nSee more results »\npresume verb\n(BE RUDE)\n[ I ] to do something although you know that you do not have a right to do it: [ + to infinitive ] I wouldn't presume to tell you how to do your job, but shouldn't this piece go there? I don't wish to presume (= make a suggestion although I have no right to), but don't you think you should apologize to her? He presumes on her good nature (= takes unfair advantage of it).\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarse\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\nscatological\nunpleasant\nunprintable\nSee more results »\npresume verb\n(BELIEVE)\nAdd to word list\nAdd to word list\n[ T ] to believe something to be true because it is likely, although not certain: [ + (that) clause ] I presume (that) they’re not coming, since they haven’t replied to the invitation. People accused of a crime are presumed innocent until proven guilty.\npresume verb\n(BE RUDE)\n[ I ] to be rude by doing something you know that you do not have a right to do: [ + to infinitive ] How can you presume to criticize me when you did the same thing yourself? presumably adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/prɪˈzu·mə·bli/\nPresumably they can afford to buy an apartment, or they wouldn’t be looking."}