{"id":289948,"name":"prestige","type":"noun","us_sound":"presˈtiːʒ","us_link":"../audio/p/eus73700.mp3","uk_sound":"presˈtiːʒ","uk_link":"../audio/p/ukprese017.mp3","content":"Add to word list\nAdd to word list\nC1 respect and admiration given to someone or something, usually because of a reputation for high quality, success, or social influence: The company has gained international prestige. Many people are attracted by the prestige of working for a top company.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\ncausing admiration because of being connected with being rich or powerful: a prestige address/car/job/label\nSMART Vocabulary: related words and phrases\nExpensive & luxurious\nchampagne\ncostliness\ncostly\nexpense\nexpensively\nextravagance\ngold plate\ngraciousness\nluxuriant\nluxurious\nluxury\nluxury goods\nposhly\nposhness\nprecious\npreciousness\npremium-rate\npriceless\nritzy\nupmarket\nSee more results »\nAdd to word list\nAdd to word list\nrespect and admiration given to someone or something, usually because of a reputation for high quality, success, or social influence: No one would go into this sort of work for the prestige. prestigious adjective us\nYour browser doesn't support HTML5 audio\n/presˈtɪdʒ·əs/\na prestigious school\nAdd to word list\nAdd to word list\nrespect or admiration that is given to someone or something, usually because of the reputation that they have for high quality, success, or social influence: The company has gained international prestige in recent years. the prestige of working for a top Wall Street firmlow/high prestige a gold credit card with high prestigeenjoy/gain prestige Many of these companies enjoy prestige outside their own countries.have/lack prestige The brand lacked prestige and had poor name recognition.\nused to describe something that causes people to feel respect or admiration, for example because it is of high quality or connected with social success: The company is a manufacturer of prestige products."}