{"id":289592,"name":"prescription","type":"noun","us_sound":"prɪˈskrɪp.ʃən","us_link":"../audio/p/prescription.mp3","uk_sound":"prɪˈskrɪp.ʃən","uk_link":"../audio/p/ukprepo017.mp3","content":"prescription noun\n(MEDICINE)\nAdd to word list\nAdd to word list\nB1 [ C ] a piece of paper on which a doctor writes the details of the medicine or drugs that someone needs: a doctor's prescription a prescription for sedatives The doctor should give you a repeat prescription (= another piece of paper allowing more of the same medicine to be given, often without the person seeing the doctor again). These drugs are only available on prescription (= with a prescription from a doctor). Prescription charges (= the standard amount of money you pay for any medicine prescribed by a doctor) are rising in June.\nMore examplesFewer examplesimproper prescription of medicinesI was given the wrong tablets when the chemist misread my prescription.I got a prescription for some stronger painkillers.I must take that prescription to the chemist.When I bought my new glasses, they threw in a free pair of prescription sunglasses.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nbooster\nCaplet\nchemotherapy\ndosage\ndose\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nwonder drug\nSee more results »\nprescription noun\n(RULE)\n[ C or U ] formal the act of telling someone else what they must have or do: So what is his prescription for success?\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexpect\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nprescription noun [C]\n(MEDICINE)\nAdd to word list\nAdd to word list\na doctor’s written direction for the medicine that someone needs and how it is to be used, or the medicine itself: The doctor gave me prescriptions for antibiotics and cough syrup. The drugstore called to say your prescription is ready to be picked up.\nprescription noun [C]\n(RULES)\nrules or a situation that will have a particular effect: The company’s reorganization could be a prescription for disaster.\nAdd to word list\nAdd to word list\na doctor's written instruction for the medicine that someone needs and for how it should be used: These drugs are only available on prescription. The doctor wrote him a prescription for two tablets, 100 mg each for a total of 200 mg a day. prescription medications/medicines/pharmaceuticals"}