{"id":289669,"name":"presenting","type":"verb","us_sound":"prɪˈzent","us_link":"../audio/p/present_02_00.mp3","uk_sound":"prɪˈzent","uk_link":"../audio/p/ukprepo021.mp3","content":"Add to word list\nAdd to word list\npresent participle of\npresent\npresent verb\n(GIVE)\nB2 [ T ] to give, provide, or make something known: The winners were presented with medals. The letter presented the family with a problem that would be difficult to solve. The documentary presented us with a balanced view of the issue. He presented the report to his colleagues at the meeting. The classroom presented a cheerful busy atmosphere to the visitors (= appeared to them to have this). The school is presenting (= performing) \"West Side Story\" as its end-of-term production.\nMore examplesFewer examplesHe has a lot more work to do before he can present the scheme to the public.Ruth was astonished when he presented her with an engagement ring.She presented a well-argued case for the banning of smoking in public places.She graciously accepted the flowers that were presented to her.The Duchess of Kent will be presenting the trophies.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\npresent verb\n(INTRODUCE)\nB2 [ T ] UK to introduce a television or radio show: She presents the late-night news.\n[ T ] formal to introduce a person: May I present Professor Carter? Later on I'd like to present you to the headteacher. present yourself\nto arrive somewhere and introduce yourself: He presented himself at the doctor's at 9.30 a.m. as arranged. present itself C2\nIf something presents itself, it happens: An opportunity suddenly presented itself.\nMore examplesFewer examplesI'd like to present my grandson, Jackson Junior.He was presented to the Queen and given a knighthood.She used to present one of those holiday programmes but now she reads the news.May I present Sir Bob Geldof?What was that documentary called that she used to present?\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing friends & getting to know them\nArriving, entering and invading\nOccurring and happening\npresent verb\n(SHOW SIGNS OF ILLNESS)\n[ I ]\n&#160; medical\n&#160; specialized to see a doctor, etc. when showing particular signs of an illness or medical condition : Children presenting with acute respiratory infections were referred for a chest X-ray. When patients present with chest pain, clinical examination and patient history are fundamental to determine the probable cause of pain.\n[ I ]\n&#160; medical\n&#160; specialized (of an illness) to show itself in a particular way: Medical conditions might present differently during pregnancy. Bone cancer generally presents as pain in the area of the tumour.\nSMART Vocabulary: related words and phrases\nMedical treatment: symptoms & diagnosis of medical problems\nadverse reaction\naerophobia\naggressively\namyloid\nanoxia\ncontraindication\ndiagnostic\nechocardiogram\nhistology\nhypoxic\nlacunar\nlaparoscopic\nphlebotomy\nprandial\npresent\nprognosis\nprognostic\nprognosticate\nquestioning\nwithdrawal symptoms\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing & falling ill"}