{"id":290210,"name":"preterit","type":"noun","us_sound":"ˈpret̬.ɚ.ɪt","us_link":"../audio/p/cdo0318uspret3862.mp3","uk_sound":"ˈpret.ər.ɪt","uk_link":"../audio/p/cdo0318ukpret1115.mp3","content":"the preterit\nAdd to word list\nAdd to word list\nthe tense used to describe actions, events, or states that happened or existed before the present time: The preterit is several times more frequent than the perfect. In terms of grammar, they favor dove as the preterit of dive. Synonym\nthe past tense\nMore examplesFewer examplesThe preterit is associated with given information and the narrative foreground, while the perfect is associated with new information.The present perfect and the preterit are not always clearly separated (as in I('ve) finished my paper). The preterit expresses perfective aspect whereas the past perfect overwhelmingly refers to durative or repeated situations.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nlanguage\n&#160; specialized relating to the tense used to describe actions, events, or states that happened or existed before the present time: Highlight the imperfect and preterit verbs in the text. Synonym\npast (GRAMMAR)\nMore examplesFewer examplesThis is the first person singular preterit ending for verbs belonging to the first conjugation.One can speculate that some time in the future -mos may become a preterit marker. For regular verbs the - mos forms are ambiguous between the present and the preterit tenses.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »"}