{"id":290343,"name":"pretty","type":"adverb","us_sound":"ˈprɪt̬.i","us_link":"../audio/p/eus73704.mp3","uk_sound":"ˈprɪt.i","uk_link":"../audio/p/ukprete012.mp3","content":"Add to word list\nAdd to word list\nB1 quite, but not extremely: The house has four bedrooms, so it's pretty big. I'm pretty sure it was her. I've got a pretty good idea of how to get there. pretty much/well\nB1 almost: I've pretty much finished here.\nSee more\nMore examplesFewer examplesI guess that things are pretty hard for you now.It's pretty noisy at night-time.It's pretty unlikely that they'll turn up now - it's nearly ten o'clock.The place emptied pretty quickly when the fight started.Nothing really changes around here. One day is pretty much like the next.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\ncertain\nfaintly\nfairly\nha'porth\nhalfway\nlightly\nlittle\nmildly\npie\nquite\nrather\nremotely\nseveral\nsome\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nGrammar\nPrettyWe can use pretty as an adverb, before an adjective or another adverb, meaning ‘quite, but not extremely’. It is informal: …\nA2 pleasant to look at, or (especially of girls or women or things relating to them) attractive or pleasant in a delicate way: That's a pretty hat you're wearing. The sofa was covered in very pretty flowery material. She's got such a pretty daughter.\nThesaurus: synonyms, antonyms, and examples\na beautiful person, painting, sight, etc.beautifulI've never seen a more beautiful view in my life.attractiveHer husband is really attractive.good-lookingI think they're very good-looking.handsomeHe's so handsome.prettyYour daughter is very pretty.gorgeousYou look gorgeous in that dress!\nSee more results »\nMore examplesFewer examplesShe looked pretty in a simple cotton dress.Our hotel room overlooked a pretty little fishing harbour.pretty pink flowersI tied the ribbon around the parcel in a pretty bow.She was young and pretty, with a spotless reputation.\nSMART Vocabulary: related words and phrases\nAttractive\nadorable\nadorably\nadorbs\naesthetic\naesthetically\ndelicate\ndisarming\ndisarmingly\ndistinguished\ndreamy\nloveliness\nlovely\nlusciously\nmagnetically\nmagnificent\nsuave\nsuavely\nsuit\nsuper-cute\nsweetly\nSee more results »\nRelated word\nprettinessIdioms\ncost someone a pretty penny\nnot be a pretty sight\nnot be just a pretty face\na pretty pass\npretty please\npretty adjective [-er/-est only]\n(PLEASANT)\nAdd to word list\nAdd to word list\npleasant to look at, or (esp. of girls or women or things connected with them) attractive or charming in a delicate way: a pretty view My older sister is prettier than I am. Idiom\npretty much\npretty adverb [not gradable]\n(TO A LARGE DEGREE)\n(used to give emphasis) to a large degree; to some degree: I’ve got a pretty clear idea of what’s going on. She was pretty tired. \"How are you feeling?\" \"Pretty good, thanks.\""}