{"id":290494,"name":"preview","type":"noun","us_sound":"ˈpriː.vjuː","us_link":"../audio/p/preview.mp3","uk_sound":"ˈpriː.vjuː","uk_link":"../audio/p/ukprete025.mp3","content":"Add to word list\nAdd to word list\nan opportunity to see something such as a film or a collection of works of art before it is shown to the public, or a description of something such as a television programme before it is shown to the public\nshort parts of a television show or film that are shown to the public in order to advertise it\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nto describe something or be shown before it officially begins: Miller's new play is previewing (= being performed publicly before it officially opens) at the Theatre Royal tomorrow. On page 11, Sally Gaines previews next week's movies on TV.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTheatre - general words\nExhibiting and exhibitions\nAdd to word list\nAdd to word list\nan advance showing of something such as a movie or play before its formal opening, or the showing of a few parts of a movie or television program as an advertisement preview verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈpriˌvju/\nMembers got a chance to preview the new show at the museum.\nAdd to word list\nAdd to word list\n[ C ] an opportunity to see or hear about something before it is available or shown to the public: There was a preview screening of the movie on Monday night. Click here for an exclusive preview of our forthcoming new products.\n[ C or U ] →\nprint preview\nif something previews or is previewed, it is shown or described before it is available to be seen by the public: They will be previewing their latest products at a series of trade shows in the spring."}