{"id":290447,"name":"prevent","type":"verb","us_sound":"prɪˈvent","us_link":"../audio/p/eus73705.mp3","uk_sound":"prɪˈvent","uk_link":"../audio/p/ukprete020.mp3","content":"Add to word list\nAdd to word list\nB1 to stop something from happening or someone from doing something: Label your suitcases to prevent confusion. [ + -ing verb ] His disability prevents him (from) driving.\nThesaurus: synonyms, antonyms, and examples\nto prevent something from happeningpreventVaccination will prevent the spread of the disease.avoidLabel the boxes to avoid confusion.stopThis should stop any further trouble.avertWe had to act quickly to avert disaster.prohibitBehavioural problems in the classroom prohibit learning.checkChildren are being vaccinated in an attempt to check the spread of the disease.\nSee more results »\nMore examplesFewer examplesThe police seem to be powerless to prevent these attacks.She would go over the accident again and again in her mind, wishing that she could somehow have prevented it.A block in the pipe was preventing the water from coming through.Fierce winds prevented the race from taking place.The law has done little to prevent racial discrimination and inequality.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprejudice\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nAdd to word list\nAdd to word list\nto stop something from happening or someone from doing something: The police tried to prevent him from leaving. Can this type of accident be prevented? preventable adjective us\nYour browser doesn't support HTML5 audio\n/prɪˈven·tə·bəl/\nFortunately, the suffering caused by ulcers is entirely preventable. prevention noun [ U ] us\nYour browser doesn't support HTML5 audio\n/prɪˈven·ʃən/\ncrime prevention"}