{"id":290647,"name":"prick","type":"verb","us_sound":"prɪk","us_link":"../audio/p/eus73707.mp3","uk_sound":"prɪk","uk_link":"../audio/p/ukprice006.mp3","content":"Add to word list\nAdd to word list\nto make a very small hole or holes in the surface of something, sometimes in a way that causes pain: Prick the skin of the potatoes with a fork before baking them. She pricked the balloon with a pin and it burst with a loud bang.\nSMART Vocabulary: related words and phrases\nMaking holes in things\nbore\nborer\nbreach\ncutout\ndent\ndrill\ngouge\nhole\nperforate\nperforated\npierce\npiercing\nprobe\npunch\npuncture\nrebore\nredrill\nriddle\nundrilled\nIdioms\nprick someone's conscience\nprick the bubble (of something)Phrasal verb\nprick (something) up\nprick noun [C]\n(HOLE)\nthe act of making a very small hole in the surface of something with a sharp object, or a hole that is made like this: The test requires a small blood sample from a heel prick. She saw the two tiny pricks on her with blood running down her chest from the wound.\nthe pain that is felt when a hole is made in the surface of the skin with a sharp object : Many also find the pain - which feels like a series of burning pricks - unbearable.\nMore examplesFewer examplesA simple prick of a finger causes a drop of blood to well.Needles in the garbage can cause anything from minor pricks to major infections.The process is usually painless except for the initial prick of the needle in a vein of the arm.\nSMART Vocabulary: related words and phrases\nMaking holes in things\nbore\nborer\nbreach\ncutout\ndent\ndrill\ngouge\nhole\nperforate\nperforated\npierce\npiercing\nprobe\npunch\npuncture\nrebore\nredrill\nriddle\nundrilled\nYou can also find related words, phrases, and synonyms in the topics:\nPain & painful\nprick noun [C]\n(FEELING)\n[ usually singular ] an unpleasant emotion that is felt for a short time: With the thought came a tiny prick of fear.\nMore examplesFewer examplesHer thoughts returned with a prick of concern to Emily and her imminent dental appointment.We usually yield to these temptations without the slightest pricks of conscience. He felt in spite of himself a prick of jealousy.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\nprick noun [C]\n(BODY PART)\nslang offensive a penis\nprick noun [C]\n(MAN)\nslang offensive a stupid man: I'm not wearing that - I'd look a complete prick.\nAdd to word list\nAdd to word list\nto make a small hole or holes in the surface of something: The nurse pricked his finger to draw blood. Idiom\nprick up your ears"}