{"id":290628,"name":"price","type":"noun","us_sound":"praɪs","us_link":"../audio/p/price.mp3","uk_sound":"praɪs","uk_link":"../audio/p/ukprice001.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] the amount of money for which something is sold: The price of oil has risen sharply. House prices have been falling. We thought they were asking a very high/low price. The large supermarkets are offering big price cuts.\nC1 [ S ] the unpleasant results that you must accept or experience for getting or doing something: Perhaps being unpopular is the price of success. An extra few minutes at the airport is a small price to pay for safe travel.\nMore examplesFewer examplesThe price of petrol will rise by 5p a gallon from tomorrow.Shall I inquire about the price of tickets?The price of PCs has fallen recently.The restaurant charges shockingly high prices for its food.There are a couple of shops in town which sell nice clothes at affordable prices.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOutcomes and consequences\nGrammar\nPrice or prize?Price /praɪs/ and prize /praɪz/ are nouns. …\nIdioms\nat any price\nat/for a price\nnot at any price\nwhat price...?\nC1 [ T often passive ] to say what the price of something is: The car is priced at £28,000. There is a lack of reasonably priced housing for rent.\nThesaurus: synonyms, antonyms, and examples\nto have a certain monetary valuecostHiring a car for the week will cost close to £300!beThe cakes were £1.50 each or two for £2.sell forThe tickets sell for £100 each. fetchThe medieval manuscript fetched a record-breaking £1.2 million at auction. go for somethingHouses around here usually go for about £500,000. set someone back (something)Phew, that ring looks like it set you back.\nSee more results »\n[ T ] to discover how much something costs: We went around all the travel agents pricing the different tours.\nMore examplesFewer examplescompetitively priced goodsThe company makes and retails moderately priced sportswear.I bought a reasonably priced radio.We've been pricing new kitchens.I think you need to price things slightly lower if you want to get rid of them quickly.\nSMART Vocabulary: related words and phrases\nEstimating value\nappraise\nappraiser\nbook value\ncost\ncosting\nde-index\nest.\neuro\nfigure\ngoodwill\nindex of leading economic indicators\npricelessly\npricing\nput a figure on it idiom\nput something at something\nquantity surveyor\nquote\nre-estimate\nrecommended retail price\nunderestimate\nSee more results »\nIdiom\nprice yourself out of the marketPhrasal verb\nprice someone out\nAdd to word list\nAdd to word list\nthe amount of money for which something is sold or offered for sale: high/low prices The price of gas went up five cents a gallon. price verb [ T ] us\nYour browser doesn't support HTML5 audio\n/prɑɪs/\nThe car is priced at $24,000. Idiom\nat a price\nAdd to word list\nAdd to word list\nthe amount of money for which something is sold or offered for sale: at/for a price We managed to purchase the business for a reasonable price.house/oil/share prices Large increases in house prices have given a strong boost to consumer spending. During the last week of May, share prices surged.a competitive/fair/reasonable price The company hopes to sell its biofuel at a competitive price.a high/low price They sold the property for a high price.falling/rising prices Falling prices should be good news for textile producers.agree/agree on a price It took some time before we could agree on a price increase/put up/raise prices They're quite willing to raise prices when there are more people wanting to buy something than there are units available for sale.cut/reduce/slash prices Companies are slashing prices in an attempt to attract customers who are reluctant to spend.price increases/reductions/rises A spokesman confirmed that the price increases would take effect from next month.a price of $50/£300/€10,000, etc. The stocks reached a price of $25. The plumber will estimate how long the work will take and give the customer a price for labor. Some retailers are still selling the goods at full price.\nat/for a price\nfor a lot of money: Almost anything can be fixed for a price.\nput a price on sth\nto say how much something costs, or is worth: The latest development makes it difficult to put a price on other bonds and loans. Staff loyalty is something that you can't really put a price on.\nSee also\nactual price\nafter-hours price\nadjusted share price\nask price\nasked price\nasking price\nbargain-priced\nbasic price\nbelow-cost price\nbest price\nView all\nbid price\nbuying price\ncash price\ncatalogue price\nclosing price\nconsumer prices\ncost price\ncurrent price\ncut-price\ndelivered price\ndemand price\ndiscount price\nequilibrium price\nexercise price\nfactor price\nfactory price\nfirm price\nfixed price\nfloor price\nforward price\nguaranteed price\nguide price\nhalf price\ninflation-adjusted price\ninitial price\nintervention price\ninvoice price\nissue price\nlaw of one price\nlist price\nlow-price\nmanufacturer's recommended price\nmarket price\nmarket clearing price\nmedian price\nnet price\nnominal price\noffering price\noffer price\nofficial price\noff-price\nopening price\npackage price\nper subscriber price\nphysical price\npopular price\npremium price\nproducer price\nproducer price index\npump price\npurchase price\nrecommended retail price\nreservation price\nreserve price\nretail price\nretail price index\nsale price\nselling price\nshare price\nsoft price\nspot price\nsticker price\nstock price\nstreet price\nstrike price\nstriking price\nsubsidized price\nsuggested retail price\nsupply price\nsupport price\nthreshold price\ntrade price\ntransfer price\nunit price\nupset price\nwholesale price\nwide price\nCOMMERCE, MARKETING to decide the price of a particular product or service: price sth at sth With tickets priced at $300 a person, proceeds from the event are to be given to charity. Many stocks are priced as if oil were still $28 to $30 a barrel.price sth high/low The sales team felt that the new product had been priced too low.attractively/competitively priced The major mining stocks look attractively priced, and our recommendation is to buy.moderately/reasonably priced The sales staff always stay at a moderately priced hotel. See also\nbargain-priced\nmid-priced\noverpriced\nunderpriced\n(also price sth up) to compare prices of similar products or services: We priced up the various systems on offer before deciding to go for this one.\nCOMMERCE\n&#160; (also price sth up) to put a ticket or label on goods in a store to show how much they cost: All these items need pricing up before they go on display. The gadget had been wrongly priced by the store, but they agreed to sell it to me for the price on the label.\nprice yourself/sb/sth out of the market\nCOMMERCE to charge so much for a product or service that people cannot or do not want to buy it: By setting the price at that level we had effectively priced ourselves out of the market. With house prices and mortgage rates so high, first-time buyers are effectively priced out of the market. Phrasal verb\nprice sth in"}