{"id":290776,"name":"primary","type":"adjective","us_sound":"ˈpraɪ.mer.i","us_link":"../audio/p/primary.mp3","uk_sound":"ˈpraɪ.mər.i","uk_link":"../audio/p/ukprice025.mp3","content":"primary adjective\n(MAIN)\nAdd to word list\nAdd to word list\nB2 more important than anything else; main: The Red Cross's primary concern is to preserve and protect human life. The primary responsibility lies with those who break the law.\nMore examplesFewer examplesHer primary purpose in suing the newspaper for libel was to clear her name.Ozone is the earth's primary filter for ultraviolet radiation.The money I earn is extra, my husband's job is our primary source of income.The course's primary aim is to improve students' proficiency in oral Spanish.Although the issues you raise are important, they are not really our primary concern.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprime\nprincipally\nprior\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\nprimary adjective\n(EDUCATION)\nB1 [ before noun ] of or for the teaching of young children, especially those between five and eleven years old: primary education a primary school\nSMART Vocabulary: related words and phrases\nSchools in general\nadmission\nassembly\nbailey\nblackboard\nblackboard jungle\nbreak something up\nbursar\nclassroom\ninfant\ninterschool\nintramural\nivory tower\njolly hockey sticks idiom\nlanguage laboratory\nreception\nschoolgirl\nseat of learning idiom\nsixth form\nstaffroom\nyear\nSee more results »\nprimary adjective\n(EARLIEST)\nhappening first: the primary stages of development\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\nfirst come, first served idiom\nfrom the word go idiom\nfront end\nin the first/second place idiom\ninaugural\ninitial\ninitially\nplace\nprefatory\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\ntrailblazing\nword\nSee more results »\nin the US, an election in which people choose who will represent a particular party in an election for political office closed primary\na primary in which only voters who are members of a political party can vote for the candidates from that party in order to choose who will represent the party in a later election: They won't give up on their demand for a closed primary election.\nSee more open primary\na primary in which everyone who is allowed to vote can choose either party's ballot (= list of candidates) in order to vote for a candidate to represent that party at a later election: In an open primary, you can vote for a candidate from either party.\nSee more\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nprimary adjective [not gradable]\n(MOST IMPORTANT)\nAdd to word list\nAdd to word list\nmore important than anything else; main: The primary goal of the space flight was to recover a satellite.\nprimary adjective [not gradable]\n(IN EDUCATION)\nrelating to the first part of a child’s education: the primary grades\nprimary adjective [not gradable]\n(EARLIEST)\nhappening first: the primary stages of development\nprimary noun [C]\n(ELECTION)\npolitics &amp; government an election in which people who belong to a political party choose who will represent that party in an election for political office\nAdd to word list\nAdd to word list\nmore important than anything else: primary concern/consideration/focus When oil prices started to rise sharply, the primary concern of financial markets was the possibility of inflation. Newspapers have been the primary source of news for many people for many years. The CEO has primary responsibility for making day-to-day investment decisions for each fund. primary goal/objective/purpose\nFINANCE, STOCK MARKET used to describe shares, bonds, etc. at the time they are first made available, rather than when they are traded later: A combination of factors point to a rise in primary trading that will provide lucrative opportunities for new bond dealers. Compare\nsecondary"}