{"id":290795,"name":"prime","type":"adjective","us_sound":"praɪm","us_link":"../audio/p/prime.mp3","uk_sound":"praɪm","uk_link":"../audio/p/ukprice027.mp3","content":"Add to word list\nAdd to word list\nC2 main or most important: This is a prime example of 1930s architecture. the prime suspect in a murder investigation a prime source of evidence The president is a prime (= likely) target for the assassin's bullet.\nof the best quality: prime beef The hotel is in a prime location in the city centre.\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nMore examplesFewer examplesHer prime objective now is simply to stay in power.Though I'd like to know more about Spanish culture, this was not my prime motivation for doing the course.The cottage is in a prime spot with a view of the lake and a private jetty.This painting is a prime example of Lowry's best work.She was a prime candidate for promotion.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprincipally\nprior\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExtremely good\nprime noun\n(BEST TIME)\n[ S ] the period in your life when you are most active or successful: This is a dancer in her prime. Middle age can be the prime of life if you have the right attitude. I suspect this cheese is past its prime. Synonym\nheyday\nSMART Vocabulary: related words and phrases\nStages of life\nadolescence\nadult life\nadulthood\nadultification\nadultify\ncoming of age\nday\nearly years\nephebe\nhealthspan\nheyday\nin my day idiom\nin your salad days idiom\nIndian summer\nrite of passage\nsalad\nschooldays\nsomeone's declining years idiom\nthose were the days idiom\ntwilight years idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHigher and lower points of achievement\nprime noun\n(SYMBOL)\n[ U ] the symbol ( ' ) used, for example, to represent feet in measurements: Prime is used to designate units in mathematics.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall capitals\nsolidus\nsquare brackets\nstroke\nunbracketed\nuncapitalized\nunpunctuated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSigns, signals and symbols\nto tell someone something that will prepare them for a particular situation: I'd been primed so I knew not to mention her son.\nto cover the surface of wood with a special paint before the main paint is put on\nto make a bomb or gun ready to explode or fire\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\npreparation\nset something up\nset the scene/stage idiom\nsuit\nsuit up\nsurvivalism\ntee\ntune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: carpentry & joinery\nCovering and adding layers\nDetonation & bombardment\nprime adjective [not gradable]\n(MAIN/BEST)\nAdd to word list\nAdd to word list\nmost important, or of the best quality: You’re a prime candidate to be spending money on foolish things. This is a prime example of native Utah architecture. The hospital is located on prime Upper East Side property. Idioms\nin your/its prime\npast your/its prime\nprime verb [T]\n(PREPARE)\nto prepare someone or something for the next stage in a process: Their teachers are getting those kids primed for the tests.\nTo prime a surface is to cover it with a special paint before the main paint is put on.\nAdd to word list\nAdd to word list\nmain or most important: This is a prime example of good salesmanship. Reckless lending was the prime cause of the crisis. With a market value now of only £2.1bn, it remains a prime takeover target.\nof the best quality: The hotel is in a prime location in the city centre. The land is considered prime real estate that could eventually be used for homes.\nPrime-1/Prime-2/Prime-3\nFINANCE a rating (= measurement of how good something is) given to a loan to show how much of a risk there is that the loan will not be paid back. A Prime-1 rating means that the risk is very low. A Prime-2 or Prime-3 rating means that the risk is higher: Issuers rated Prime-1 have a superior ability for repayment of senior short-term debt obligations.\nthe period in your life or your job when you are most active or successful: in his/her/their prime He retired while he was still in his prime.past my/your prime I plan to work way past my prime.\nFINANCE, BANKING, ECONOMICS\n&#160; US the lowest rate of interest that banks charge their best customers for loans over a short period and that is used for calculating the interest rates on other types of loan: above/below prime The loan was issued at a variable interest rate of 1.5% above prime. See also\nbase rate\nto prepare someone or something for a particular situation: I was well primed for the meeting and gave a very successful presentation. The company is primed to move ahead with its public offering.\nprime the pump\nto provide money, encouragement, ideas, etc. to help something get started: Venture capital needs to be raised to prime the pump of startups, which are long on ideas but short on cash."}