{"id":290979,"name":"printable","type":"adjective","us_sound":"ˈprɪn.t̬ə.bəl","us_link":"../audio/p/eus73714.mp3","uk_sound":"ˈprɪn.tə.bəl","uk_link":"../audio/p/ukpriml018.mp3","content":"Add to word list\nAdd to word list\nIf something that is said is not printable, it is too rude or offensive to be included in a newspaper or magazine: He let out a torrent of abuse, none of it printable in a respectable daily newspaper. Opposite\nunprintable\nable to be printed, for example from a website, email, etc.: You can download the printable PDF containing details of the event. Printable tickets will be emailed to you before the concert. Click here to download a printable version of this article.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: printing & word processing\na document, etc. that can be printed, for example from a website, email, etc.: When you subscribe to our list we will send you the links to our exclusive free printables.\nMore examplesFewer examplesDownload our free menu planning printables.Teachers can access free materials of exceptional quality, including online interactive lessons, professional development resources, and printables for the classroom.The content is then packaged into a printable which is featured on the website.We supply free printables to support your DIY projects.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nAdd to word list\nAdd to word list\nIT a printable version of a document can be printed on paper using a computer printer: Go to our website to download a printable application form in PDF format.\nCOMMUNICATIONS if something is printable, it is suitable for publishing in a newspaper or magazine because it is not offensive: \"Untrustworthy\" and \"incompetent\" were among the more printable descriptions of the former chairman."}