{"id":290938,"name":"principal","type":"adjective","us_sound":"ˈprɪn.sə.pəl","us_link":"../audio/p/principal.mp3","uk_sound":"ˈprɪn.sə.pəl","uk_link":"../audio/p/ukpriml012.mp3","content":"Add to word list\nAdd to word list\nB1 first in order of importance: Iraq's principal export is oil. He was principal dancer at the Dance Theatre of Harlem. That was my principal reason for moving. Synonyms\nchief\nmain\nprimary\nMore examplesFewer examplesThe principal aim of this meeting is to reach a decision that we all agree on.The diaphragm is the principal muscle of respiration.I would like to earn more, but this isn't my principal reason for leaving the job.He can't give up teaching, it's his principal source of income.This is the principal road between the two cities.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nGrammar\nPrincipal or principle?Principal as an adjective means ‘most important’: …\nprincipal noun\n(PERSON)\nA2 [ C ] US (UK headteacher, head) the person in charge of a school\nA2 [ C ] UK the person in charge of a college or university\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhomeschooler\nhousemaster\nhousemistress\ninstructor\nlecturer\nmentor\nrector\nresidence\nschoolie\nschoolmarm\nschoolmaster\nscribe\ntrainer\ntutor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUniversity & college education\nprincipal noun\n(MONEY)\n[ C usually singular ]\n&#160; finance &amp; economics\n&#160; specialized an amount of money that someone has invested in a bank or lent to a person or organization so that they will receive interest on it from the bank, person, or organization: She lives off the interest and tries to keep the principal intact.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\nfinance\ninterest\ninterest rate\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nprincipal adjective [not gradable]\n(MAIN)\nAdd to word list\nAdd to word list\nfirst in order of importance: Iraq’s principal export is oil.\nprincipal noun\n(PERSON)\n[ C ] a person in charge of a school\nprincipal noun\n(MONEY)\n[ C usually sing ] an amount of money that is lent, borrowed, or invested, apart from any additional money such as interest\nAdd to word list\nAdd to word list\nfirst in order of importance: Iraq's principal export is oil. Nigeria remains the country's principal economic partner.\nFINANCE, ECONOMICS relating to an amount of money lent or borrowed, rather than to the interest paid on it: Shares of these funds involve investment risk, including the possible loss of the principal amount invested.\n[ C usually singular ]\n&#160; FINANCE an amount of money lent or borrowed, rather than the interest paid on it: She lives off the interest and tries to keep the principal intact. These bonds involve the risk that the issuing company may be unable to pay interest or repay principal. The money is secured by the borrower's home, which is sold after the borrower's death to pay off the interest and principal.\n[ C ]\n&#160; LAW a person who is directly involved in an arrangement, agreement, etc., rather than someone acting for that person: Once the principals sign the necessary papers the deal will be done.\n[ C ]\n&#160; LAW a person who has legal responsibility for what a business or organization does: I later became a principal at an investment banking firm."}