{"id":290955,"name":"principle","type":"noun","us_sound":"ˈprɪn.sə.pəl","us_link":"../audio/p/principal.mp3","uk_sound":"ˈprɪn.sə.pəl","uk_link":"../audio/p/ukpriml015.mp3","content":"principle noun\n(IDEA)\nAdd to word list\nAdd to word list\nC1 [ C ] a basic idea or rule that explains or controls how something happens or works: the principles of the criminal justice system The country is run on socialist principles. The machine works according to the principle of electromagnetic conduction. The organization works on the principle that all members have the same rights. Synonyms\nbasics\nessential\nfoundation (BASIC FACT)\nfundamentals\nthe rudimentsSee also\nfirst principles UK in principle\nC2 If you agree with or believe something in principle, you agree with the idea in general, although you might not support it in reality or in every situation: In principle I agree with the idea, but in practice it's not always possible.\nSee more\nMore examplesFewer examplesThe school is based on the fundamental principle that each child should develop its full potential.The government has promised to uphold the principles of democracy.In the 1870s and 1880s, doctors began to follow the principles of antiseptic surgery.The party's principles are basically egalitarian.Johnson calls this phenomenon 'the principle of minimal effort'.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nexceptionalism\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nnon-dogmatic\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nprinciple noun\n(RULE)\nC2 [ C or U ] approving a moral rule or standard of good behaviour: She doesn't have any principles. He was a man of principle. Anyway, I can't deceive him - it's against all my principles. I never gamble, as a matter of principle (= because I believe it is wrong). She'd never ask to borrow money, on principle.\nSMART Vocabulary: related words and phrases\nMorality and rules of behaviour\nantisocial\nantisocially\nbaseness\nbiocentric\nbioethicist\nethic\nethical\nethically\nethicist\nethos\nhonour\nliberty\nmotto\nprecept\nprincipled\npropriety\nsavoury\nscript\nthe rights and wrongs idiom\nwork ethic\nSee more results »\nGrammar\nPrincipal or principle?Principal as an adjective means ‘most important’: …\nprinciple noun\n(MORAL RULE)\nAdd to word list\nAdd to word list\n[ C/U ] a moral rule or standard of good behavior or fair dealing: [ C ] His guiding principle is that everyone should have equal access to high-quality health care. [ C ] He refused to compromise his principles. on principle\nIf you believe or act on principle, you are following a personal standard of behavior: On principle, I never eat meat.\nprinciple noun\n(BASIC TRUTH)\n[ C often pl ] a basic truth that explains or controls how something happens or works: the principles of Newtonian physics in principle\nSomeone who agrees to something in principle agrees with the idea, but may not agree with using the idea to bring about practical changes: In principle I agree that mothers should spend as much time as possible with their young children, but it isn’t easy.\nAdd to word list\nAdd to word list\n[ C ] a basic idea or rule that explains or controls how something happens or works: a principle of sth Those who paid the most would be earning the most: it's a pretty basic principle of fair taxation.basic/fundamental/general principle The general principles of project management are much the same in the two cases.on the principle that The organization works on the principle that all members have the same rights. The country is run on socialist principles.\n[ C or U ] a moral rule or standard of good behaviour: I never cheat a customer, as a matter of principle. She'd never ask to borrow money, on principle.\nin principle\nif you agree with or believe something in principle, you agree with the idea in general, although you might not agree with all the details or support it in every situation: In principle, we support the merger, but we think the value is insufficient. The EU may also move to implement a ban on new investment, previously agreed in principle.\nif something should happen in principle, it should happen in theory although it does not in fact always happen or has not yet happened: In principle, bonuses ought to fall when conditions get tough. In practice, they don't.\nSee also\nability to pay principle\naccounting principle\nbenefit principle\nthe Pareto principle\nstatement of principles"}