{"id":290977,"name":"print","type":"noun","us_sound":"prɪnt","us_link":"../audio/p/print.mp3","uk_sound":"prɪnt","uk_link":"../audio/p/ukpriml017.mp3","content":"print noun\n(TEXT)\nAdd to word list\nAdd to word list\nC2 [ U ] letters, numbers, or symbols that have been produced on paper by a machine using ink: The title is in bold print. This novel is available in large print for readers with poor eyesight. The book was rushed into print (= was produced and published) as quickly as possible. The print quality (= the quality of the text produced) of the new laser printer is excellent.\n[ U ] newspapers, books, and magazines: The debate is still raging, both in print and online. in/out of print\nC2 If a book is in print, it is possible to buy a new copy of it, and if it is out of print, it is not now possible: Is her work still in print?\nSee more\nMore examplesFewer examplesAll his hard work was rewarded when he saw his book in print.a book with dense print\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNewspapers & magazines\nprint noun\n(PICTURE)\nC1 [ C ] a photographic copy of a painting, or a picture made by pressing paper onto a special surface covered in ink, or a single photograph from a film: a print of Van Gogh's \"Sunflowers\" a signed Hockney print I had some prints made of the party photos.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nPictures\nprint noun\n(PATTERN)\n[ C ] any type of pattern produced using ink on a piece of clothing: a floral/paisley print\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nprint noun\n(FINGERPRINT)\n[ C ] informal for\nfingerprint : The burglar had left his prints all over the window.\nSMART Vocabulary: related words and phrases\nThe hand\ncarpal\ncarpometacarpal\ncarpus\ncuticle\ndexterity\ndexterous\nfinger\nfingertip\nknuckle\nleft-handed\nleft-hander\nlittle finger\nmetacarpus\nminimus\nnail\nopposable\npalm\npalmar\nphalangeal\npinkie\nSee more results »\nprint verb\n(TEXT)\nA2 [ I or T ] to produce writing or images on paper or other material with a machine: The leaflets will be printed on recycled paper. I'm waiting for a document to print.\nB2 [ T ] to include a piece of writing in a newspaper or magazine: Some newspapers still refuse to print certain swear words. They printed his letter in Tuesday's paper.\nB2 [ T ] to produce a newspaper, magazine, or book in large quantities: 20,000 copies of the novel will be printed in hardback.\nMore examplesFewer examplesThis sentence is printed in italics.The newspaper printed a retraction for their previous error.The author's name was printed below the title.The instructions are printed so small I can hardly read them.The book has been printed in six languages and in braille.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nprint verb\n(WRITE)\n[ I or T ] to write without joining the letters together: Please print your name clearly below your signature.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nprint verb\n(PICTURE)\n[ T ] to produce a photograph on paper: Photographs are better if they are printed from the original negative.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nprint verb\n(PATTERN)\n[ T ] to produce a pattern on material or paper: The designs are printed onto the fabric by hand.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nPhrasal verb\nprint something out\nprint verb [T]\n(MAKE TEXT)\nAdd to word list\nAdd to word list\nto put letters or images on paper or another material using a machine, or to produce books, magazines, newspapers, etc., in this way: The newspaper printed my letter to the editor.\nTo print is also to write without joining the letters together: Please print your name clearly below your signature.\nTo print something out is to print text or images from a machine attached to a computer: [ M ] Just print out the first two pages.\nprint noun\n(PICTURE)\n[ C ] a single photograph made from film, or a photograph of a painting or other work of art: We made extra prints of the baby to send out with the birth announcement.\n[ C ] A print is also a picture made by pressing paper or other material against a special surface covered with ink: woodcut prints\nprint noun\n(PATTERN)\n[ C ] a pattern produced on a piece of cloth, or cloth having such a pattern: a print dress\nprint noun\n(MARK)\n[ C ] a mark left on a surface where something has been pressed on it: The dog left prints all over the kitchen floor.\n[ C ] A print is also a fingerprint.\nprint noun\n(TEXT)\n[ U ] text or images that are produced on paper or other material by printing in print\nIf something is in print, it is published and available to buy: Is the book still in print? out of print\nIf a book is out of print, it is no longer available from a publisher: I’m afraid you can’t get that book – it’s out of print.\nAdd to word list\nAdd to word list\n[ I or T ] to produce writing or images on paper or other material with a machine: print sth on sth The leaflets will be printed on recycled paper. I'm waiting for the document to print. I had some business cards printed. Words found in the glossary are printed in bold the first time they appear in the prospectus.\n[ T ] to include a piece of writing in a newspaper or magazine: No one was willing to print the story without identifying its source. The article was printed in Tuesday's paper.\n[ T ] to produce a newspaper, magazine, or book in large quantities: 20,000 copies of the novel will be printed in hardback.\n[ I or T ] to write without joining the letters together: Please print your name clearly below your signature. Phrasal verb\nprint sth out/off\nletters, numbers, words, or symbols that have been produced on paper by a machine using ink: The report is being published both in print and online.\nnewspapers, books, and magazines: Television, radio, and print are inundated with advertisements for Web sites.\nin/out of print\nif a book is in print, it is possible to buy a new copy of it, and if it is out of print, it is not now possible: Is her work still in print? That book has been out of print for years. See also\nthe fine print\nthe small print"}