{"id":291035,"name":"priority","type":"noun","us_sound":"praɪˈɔːr.ə.t̬i","us_link":"../audio/p/eus73716.mp3","uk_sound":"praɪˈɒr.ə.ti","uk_link":"../audio/p/ukpriml027.mp3","content":"Add to word list\nAdd to word list\nB2 something that is very important and must be dealt with before other things: The management did not seem to consider office safety a priority. My first/top priority is to find somewhere to live. You have to learn to get your priorities right/straight (= decide which are the most important jobs or problems and deal with them first). Repairing the plumbing is a priority task (= more important than other jobs). Banks normally give priority to large businesses when deciding on loans (= they deal with them first because they consider them most important). Official business requirements obviously take/have priority over personal requests (= official business matters will be dealt with first).\nMore examplesFewer examplesWe need to establish a new set of priorities.You need to identify your priorities.a low priority taskIf agriculture were given priority, the country would easily be able to feed itself.The establishment of new areas of employment is a priority.\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinearity\nlinearly\nlitany\nprecedence\nprocession\nsecondly\nsequence\nsequencing\nstring\ntrain\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImportant and essential things\nAdd to word list\nAdd to word list\nsomething that is considered more important than other matters: [ C ] The president vowed to make education one of his top priorities. takes priority over\nIf something takes priority over something else, it is more important: [ U ] Getting fresh water and food to the flood victims takes priority over dealing with their insurance claims.\nAdd to word list\nAdd to word list\n[ C ] something that you do or deal with first because it is more important or urgent than other things: The company focuses on business priorities that make a difference: intense commitment to customer service and maintaining low costs. strategic/corporate priorities spending/financial/investment prioritiesa top/number one/first priority For the Internal Revenue Service, protection of taxpayers' data is a top priority.a high/clear priority Regulators, both globally and locally, need to define clearer priorities.sb's priority is to do sth At the moment, our priority is to recruit high-calibre employees to supplement the existing staff.make sth a priority Union representatives are anxious to make healthcare benefits a priority for their workers over the next few months.identify/set/establish priorities The bank's board of directors was criticized for failing to set priorities.a list/set of priorities Tackling the issue of World debt relief will be high on the list of priorities at next week's summit.\n[ U ] the state or fact of being the most important job or aim, compared to other jobs or aims: high/low/top priority Euro MPs are now demanding higher priority for climate change policy.take/have/get priority (over sth) Under certain circumstances, there may be special requirements that take priority over all others.give sth priority/give priority to sth Both countries have given priority to corporate investment.a priority area/sector Products across twelve priority sectors are now being traded freely between member states."}