{"id":291022,"name":"prior","type":"adjective","us_sound":"praɪr","us_link":"../audio/p/prior.mp3","uk_sound":"praɪər","uk_link":"../audio/p/ukpriml024.mp3","content":"prior adjective [before noun]\n(EARLIER)\nAdd to word list\nAdd to word list\nC1 formal existing or happening before something else, or before a particular time: The course required no prior knowledge of Spanish. They had to refuse the dinner invitation because of a prior engagement (= something already planned for that time). prior to something\nC1 before a particular time or event: the weeks prior to her death\nSee more\nMore examplesFewer examplesYou can only withdraw money from this account by prior arrangement with the bank.It's a pretty steep learning curve when you're thrown into a job with no prior experience.We reserve the right to make changes to the schedule without prior notice.Due to a prior engagement Mr Richards is unable to attend.No prior knowledge of the language is required.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\npriorly\nprologue\nquondam\nsecond-wave\nsecondary\nwake\nSee more results »\nprior adjective [before noun]\n(MORE IMPORTANT)\nformal more important: Mothers with young children have a prior claim on funds.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprized\nradical\nseminal\ntectonic\nweighty\nSee more results »\na man who is in charge of a priory or who is second in charge of an abbey\nSMART Vocabulary: related words and phrases\nReligious people: monks & nuns\nabbess\nabbey\nabbot\nanchorite\nascetic\nbenedictine\nFranciscan\nfriar\nfriary\nhabit\nhermit\nlay brother\nmonastic\nmonastically\nmonasticism\nmonk\nmother\npriory\nTrappist monk\nveil\nSee more results »\nAdd to word list\nAdd to word list\ncoming before in time, order, or importance: She denied prior knowledge of the meeting. Passengers may board the plane twenty minutes prior to (= before) departure.\nAdd to word list\nAdd to word list\nexisting or happening before something else: Operating earnings were $71 million, compared with a loss of $111 million in the prior year. Board members denied any prior knowledge of an executive compensation agreement. prior agreement/approval/consent Do not publish these figures without prior authorization from the Board. Applicants should have prior experience of the pharmaceutical sector.give/receive prior notice (of sth) According to the law, the finance ministry should have been given prior notice, which it did not get.\nprior to (doing) sth\nbefore something else: It is vital that boards, management, and shareholders fully appreciate the risks and rewards prior to any merger. She was vice president of business operations for three years prior to becoming commissioner."}