{"id":291161,"name":"privilege","type":"noun","us_sound":"ˈprɪv.əl.ɪdʒ","us_link":"../audio/p/privilege.mp3","uk_sound":"ˈprɪv.əl.ɪdʒ","uk_link":"../audio/p/ukpriso013.mp3","content":"Add to word list\nAdd to word list\nC1 [ C or U ] an advantage that only one person or group of people has, usually because of their position or because they are rich: Healthcare should be a right, not a privilege. Senior management enjoy certain privileges, such as company cars and health insurance.\nC1 [ S ] an opportunity to do something special or enjoyable: I had the privilege of interviewing Picasso in the 1960s. It was a real privilege to meet her.\n[ U ] the way in which people who are rich, come from a high social class, or belong to a particular race or gender have more advantages in society than people who do not belong to these groups: a life of privilege My thesis examines the role of societal privilege in the maintenance of health disparities. Some men will even resort to violence to try to enforce and protect their male privilege.\n[ C or U ]\n&#160; law\n&#160; specialized the special right that some people in authority have that allows them to do or say things that other people are not allowed to: diplomatic/parliamentary privilege\nMore examplesFewer examplesThe leaders were often more concerned with status and privilege than with the problems of the people.There are no special privileges for the managers.It was a privilege to work with her and she will be sadly missed.Frequent fliers receive travel privileges.an abuse/misuse of privilege\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nlock\nlose\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPleasure and happiness\nRich and wealthy\nNot punishing & reducing punishment\nto give an advantage to one person or group of people and not to others: Since colonization, the country has a history of privileging people who have white skin. Family endowments were nearly all male-centric, privileging men and their descendants over female lines of descent.\nto give something more importance than other things: The new exhibition privileged industry over agriculture. They do not privilege one approach over the other.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nlock\nlose\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nAdd to word list\nAdd to word list\na special advantage or authority possessed by a particular person or group: [ C ] As a senior executive, you will enjoy certain privileges. [ C ] I had the privilege (= the honor) of interviewing the prime minister of Canada.\nAdd to word list\nAdd to word list\na right or advantage that only a small number of people have: At the moment, it tends to be managers or technology-related workers who work from home - it's seen as something of a privilege for trusted employees. With power and privilege comes responsibility.be a privilege doing/to do sth It's been a pleasure and a privilege to work with you all.have the privilege of doing sth I had the privilege of studying at one of the country's leading business schools.for the privilege of doing sth Advertisers often subsidize entire TV productions or movie marketing campaigns for the privilege of featuring their brands.enjoy/earn a privilege It is possible that the company will one day command a premium rating, but the market clearly believes it has to earn that privilege.\nLAW legal protection that a person or a group has because of their position within a society, for example the right to keep particular discussions, etc. private: the attorney-client privilege Executive privilege means that certain documents will not have to be disclosed."}