{"id":291131,"name":"private","type":"adjective","us_sound":"ˈpraɪ.vət","us_link":"../audio/p/private.mp3","uk_sound":"ˈpraɪ.vət","uk_link":"../audio/p/ukpriso007.mp3","content":"private adjective\n(PERSONAL)\nAdd to word list\nAdd to word list\nB1 only for one person or group and not for everyone: She has a small office that is used for private discussions. I caught him looking through my private papers. The sign on the gate said \"Private Property - No Trespassing!\"\nPrivate activities involve personal matters or relationships and are not related to your work: Apparently in interviews he refuses to talk about his private life.\nB1 Private thoughts and opinions are secret and not discussed with other people: Although I support the project in public, my private opinion is that it will fail. This is a private matter.\nThesaurus: synonyms, antonyms, and examples\nkept hidden from other peoplesecretThe spies had a secret meeting.covertThe government was accused of covert military operations.clandestineHe arranged a clandestine meeting between his client and the candidate.confidentialAll the information you give us will be treated as strictly confidential.classifiedThese documents contain classified information.\nSee more results »\nA private place is quiet and has no other people to see or hear you: Is there somewhere private where we can talk?\nA private person does not like to talk about their personal feelings and thoughts: She's a very private person. in private\nB2 If you talk to someone or do something in private, you do it without other people being present: Jamie wants to speak to me in private.\nSee more\nMore examplesFewer examplesUnless it's marked 'private', my secretary usually opens my post.The hospital gives mothers no quiet private time to bond with their babies.We've been invited to a private viewing, before the exhibition opens.You had no business reading my private letters.Do you mind? We're trying to have a private conversation here!\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividual\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nrespectively\nseparately\nseverally\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nSeparateness and isolation in space\nAlone\nShy and modest\nprivate adjective\n(NOT OFFICIAL)\nB2 controlled or paid for by a person or company and not by the government: private education/healthcare a private doctor/dentist Banks should be supporting small private businesses.\nMore examplesFewer examplesShe has her own private plane.She's decided to leave the Health Service and join a private practice.The government restructured the coal industry before selling it to private owners.The upper classes usually send their children to expensive private schools.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\nIdiom\ngo private\n(also Private) a soldier of the lowest rank in an army: Private Murray/Sam Murray [ as form of address ] You're dismissed, Private.\nSMART Vocabulary: related words and phrases\nRanks in the Army\nbrigadier\nbrigadier general\ncol\ncolonel\nCorp.\ncorporal\nfield marshal\ngeneral\ngeneralship\nlance corporal\nLieut.\nmajor\nmajor general\nsarge\nsergeant\nsergeant major\nSgt\nstaff officer\nsubaltern\nprivate adjective\n(PERSONAL)\nAdd to word list\nAdd to word list\nfor the use of or belonging to one particular person or group only, or not shared or available to other people: The sign on the gate said \"Private Property – Keep Out.\" Let’s go somewhere private so we can talk freely. in private\nIf you do something in private, you do it without other people present: I asked if I could talk to her in private.\nprivate adjective\n(INDEPENDENT)\n[ not gradable ] belonging to or managed by a person or independent company rather than the government: The governor visited Ireland as a private citizen (= not as an official).\nprivate noun [C]\n(RANK)\na person in the military of the lowest rank, below a corporal\nAdd to word list\nAdd to word list\nused to describe a company with shares that are not traded on a stock market: EM.TV is a private family-owned company.\nECONOMICS owned or controlled by one person or company, rather than by a government: Much of the funding for this type of investment comes from public, rather than private, sources. We need to review public and private interests in order to balance them carefully. The center has about 85 employees supported by private money from grants and donations. private health insurance private agencies/institutions/hospitals\nECONOMICS private employees, investors, etc. act for themselves, rather than for a government or company: private buyers/investors a private contractor/developer\nCOMMERCE, FINANCE only offered to particular people or organizations to buy and not offered to the public: The property was sold by private treaty. a private sale\nintended only for the use of one person or group of people: a private jet a private club\nMEETINGS involving only a small group of people and kept secret: Senior group executives are reported to be in private talks regarding a possible merger. a private agreement/conversation\nconnected with your personal life, rather than your job: Employees are asked to keep private emails/phone calls to a minimum.\ngo private\nFINANCE, STOCK MARKET if a company whose shares are traded on a stock market goes private, the owners buy the shares back from other shareholders in order to take control of the company themselves: The Canadian utility company is well on its way to going private through a $22 billion management-led buyout.\nECONOMICS, GOVERNMENT if an organization that is owned by the government goes private, it is sold to investors: The satellite company was bought by its current owners for $3.1 billion in cash after going private and shedding its intergovernmental ownership.\nUK to pay for your own medical treatment, rather than using treatment provided by the National Health Service: People who cannot find an NHS dentist are already going private and insurers are keen to fill in gaps in their finances.\nin private\nMEETINGS something that is done in private is done secretly and only involves a small group of people: Negotiations are underway in private.\nin private hands\nECONOMICS, GOVERNMENT owned or controlled by one person or company, rather than by a government: The transaction would put control of a key service in private hands.\nowned by one person, rather than by an organization: Two original copies of the manuscript are still in private hands.\ntake sth private\nFINANCE, STOCK MARKET to take control of a company or organization whose shares are traded on a stock market by buying the shares back from other shareholders: Two of the world's richest men combined to take the upmarket hotel chain private in a $1.95bn deal."}