{"id":291123,"name":"privacy","type":"noun","us_sound":"ˈpraɪ.və.si","us_link":"../audio/p/privacy.mp3","uk_sound":"ˈprɪv.ə.si","uk_link":"../audio/p/ukpriso006.mp3","content":"Add to word list\nAdd to word list\nB2 someone's right to keep their personal matters and relationships secret: The new law is designed to protect people's privacy.\nthe state of being alone: I hate sharing a bedroom - I never get any privacy.\nMore examplesFewer examplesYou can close this curtain to give you a little more privacy.an invasion of privacyPatients' names have been changed to protect their privacy.I would appreciate it if you would respect my privacy.Famous people often find their privacy is invaded by the press.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivately\nprivileged\npseudonym\npseudonymization\npseudonymize\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlone\nSeparateness and isolation in space\nAdd to word list\nAdd to word list\nthe state of being alone, or the right to keep one’s personal matters and relationships secret: A fence would give us more privacy in the backyard.\nAdd to word list\nAdd to word list\nthe right that someone has to keep their personal life or personal information secret or known only to a small group of people: Among the three industries studied, concerns about privacy and security of data were highest in the financial sector. Security and privacy issues relating to online trading still represent the most significant barrier to e-commerce. Despite recent lawsuits upholding rights to privacy, the media show little willingness to keep their distance. consumer/customer/patient privacy data/online/internet privacy privacy laws/policies/rights privacy concerns/issues/protectionsan invasion/violation of privacy Campaigners have protested that the release of sensitive medical information is an invasion of privacy.invade/breach/violate sb's privacy According to customers, the company was using underhand tactics in order to invade their privacy.protect/safeguard/respect sb's privacy She donated $650,000 to the party through intermediaries in order to protect her privacy."}