{"id":291172,"name":"prize","type":"noun","us_sound":"praɪz","us_link":"../audio/p/prize.mp3","uk_sound":"praɪz","uk_link":"../audio/p/ukpriml029.mp3","content":"Add to word list\nAdd to word list\nA2 something valuable, such as an amount of money, that is given to someone who succeeds in a competition or game or that is given to someone as a reward for doing very good work: The critics' prize for best film was won by Marc Abbott for \"Belly Laugh\". I won a prize in the raffle. The first (= main) prize is a week for two in Miami. The prize money for winning Wimbledon has been increased by 12.5 per cent.\nsomething important and valuable that is difficult to achieve or get: The prize would be her hand in marriage.\nMore examplesFewer examplesFirst prize is a fortnight in Barbados and second prize is a weekend in Rome.There's a prize for the fastest three runners in each category.Carlos was awarded first prize in the essay competition.The children collected their prizes and then went back to their places.Her internationally acclaimed novel has won several literary prizes.\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nPulitzer Prize\nPurple Heart\nrainbow\nstake\nthe golden boot\nthe wooden spoon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGoals and purposes\nGrammar\nPrice or prize?Price /praɪs/ and prize /praɪz/ are nouns. …\nIdiom\nno prizes for guessing something\nprize verb\n(REWARD)\n[ T often passive ] to think that someone or something is very valuable or important: In parts of Asia this plant is prized for its medicinal qualities. I prize that intimacy above everything.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nshook\nsmile\nsmile on something/someone\nsmitten\nsoft corner\ntaste\ntight\nwarm\nSee more results »\nprize verb\n(LIFT)\n[ T + adv/prep ] (UK also prise); (US also pry) to use force to lift something off something else, for example by pressing a tool against a fixed point; to separate things using force: I prized the lid off with a spoon. The window had been prized open with a jemmy. She couldn't prize his fingers apart to get the key.\nSMART Vocabulary: related words and phrases\nRaising and lowering\ndepress\nelevate\nelevated\nerect\nhike\nhike something up\nhoick\nhoist\njack\njack something up\nprise\npry\nput something up\nraise\nre-erect\nride\nride up\nrun\nrun something up\nyo-yo\nSee more results »\nPhrasal verb\nprize something out of someone\nA prize animal, flower, or vegetable is one that has won or deserves to win a prize in a competition because it is of very good quality: a prize bull a prize marrow\nused to describe something that is a very good or important example of its type: prize assets Some prize idiot (= extremely foolish person) forgot to lock the door.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nshining\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSamples and examples\nAdd to word list\nAdd to word list\na reward for victory in a competition or game: David won first prize in the school science fair.\ngiven as a prize, or having won or deserving to win a prize: prize money\nto value greatly: The Japanese prize personal relationships in doing business.\nA prized possession is one that is very important to you.\nAdd to word list\nAdd to word list\nsomething such as an amount of money that is given to a person or organization that wins a competition: The promotion, launched on a national breakfast show, involves a competition with a daily prize of $10,000. A new sponsor has been found to put up the prize money. Cash prizes are awarded to winners and runners-up with the Student Journalist of the Year offered a paid summer placement.a $100,000/£70,000, etc. prize More than a dozen young interior designers are fighting for the $150,000 prize.win/get/share a prize Loan sharks sometimes use tactics which include sending letters to home-owners telling them they've won a prize and urging them to get in touch.award/offer/present a prize Each award category offers prizes for small, medium, and large businesses.top/big/major prize Several small businesses in the area are challenging for the top prize in the Entrepreneur Award scheme.first/second/third prize She won first prize in a literary competition and has just had her first book published.a prize for sth The London-based agency has been awarded several prizes for its original and creative advertising campaigns.\nsomething valuable that people want very much to have: The huge export order is an important prize to be won.\ngood enough to get a prize: He had won awards for his prize ranch animals.\nbeing the most valuable or most important example of its type: prize asset/possession The group plans to sell off its prize asset, a Russian oil company, at a knockdown price."}