{"id":291332,"name":"probationary","type":"adjective","us_sound":"proʊˈbeɪ.ʃən.er.i","us_link":"../audio/p/usprint016.mp3","uk_sound":"prəˈbeɪ.ʃən.ər.i","uk_link":"../audio/p/ukpriso027.mp3","content":"Add to word list\nAdd to word list\nrelating to a period of time when a criminal must behave well and not commit any more crimes in order to avoid being sent to prison: A probationary sentence would be appropriate in this case. The offenders are allowed to apply for probationary release. He was given a probational sentence of two years for assault.\nrelating to a period of time when you are new to a job or activity and are being watched and tested to see if you are suitable: New staff have a probationary period of fourteen weeks before their contract is made permanent. Probationary employees still have certain rights. The visa will give probationary status to illegal immigrants before they become eligible to apply for green cards. After the law changed, the probational aliens were able to apply for a visa.\nMore examplesFewer examplesThe prosecutor asked for a probationary punishment, but the judge insisted on a prison sentence. They are placed for six months on intensive parole or probationary supervision.At the time he was a probationary officer with Merseyside police.Teachers hired in this way are considered probationary for three years.You must have been a probationary member for at least 1 year to apply for full membership.Teens under 17 who have a probationary license cannot have more than one person who is not a family member in their car unless the driver's parent or guardian is along.There should be training on high-speed driving for probationary motorists.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsort\nsort something out\nspare the rod and spoil the child idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nExams, tests & exercises\nRelated word\nprobation\nAdd to word list\nAdd to word list\nHR relating to the period during which a new employee is being watched closely to see if they are suitable for their job : The administration will more closely scrutinize teachers during the three-year probationary period before tenure. State officials say as a probationary employee, he has no rights to appeal against the firing. Schools must give probationary teachers 60 days notice before the end of the school year if their contract is not going to be renewed.\nLAW relating to the situation in which a criminal is allowed to stay out of prison if they follow particular rules and do not commit another crime : He is serving a five-year probationary sentence following a 2010 conviction for perjury."}