{"id":291329,"name":"probation","type":"noun","us_sound":"proʊˈbeɪ.ʃən","us_link":"../audio/p/probation.mp3","uk_sound":"prəˈbeɪ.ʃən","uk_link":"../audio/p/ukpriso026.mp3","content":"Add to word list\nAdd to word list\na period of time when a criminal must behave well and not commit any more crimes in order to avoid being sent to prison: He was fined and given two years' probation. The judge put him on probation for two years. He served a year in prison and was then let out on probation.\na period of time at the start of a new job when you are watched and tested to see if you are suitable for the job: a period of probation\nUS a period of time during which a student who has not performed well must continue to have a particular grade point average in order to stay in school: Gene's on probation this semester.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of employment\nExams, tests & exercises\nSchools in general\nRelated word\nprobationary\nAdd to word list\nAdd to word list\na period during which a person’s behavior or performance on a job or in a school is watched closely to see whether the person does well enough to stay: I’m on probation this semester, so I’ve really got to study hard.\nProbation for criminals is the condition of being allowed freedom if they commit no more crimes and follow certain rules.\nAdd to word list\nAdd to word list\nHR the period during which a new employee is watched closely to see if they are suitable for their job: Many organizations operate a three-month probation period before making a position permanent.\nWORKPLACE the period during which a company, an employee, etc. is given a chance to improve their work or actions: place/put sb on probation He was put on probation and disciplined for lying about his expenses.\nLAW a situation in which a criminal is allowed to stay out of prison if they do not commit any more crimes and follow particular rules: get/be given/receive probation He pleaded guilty to resisting arrest and was given probation."}