{"id":291348,"name":"probe","type":"verb","us_sound":"proʊb","us_link":"../audio/p/probe.mp3","uk_sound":"prəʊb","uk_link":"../audio/p/ukpriso029.mp3","content":"Add to word list\nAdd to word list\nto try to discover information that other people do not want you to know, by asking questions carefully and not directly: The interviewer probed deep into her private life. Detectives questioned him for hours, probing for any inconsistencies in his story. The article probes (= tries to describe and explain) the mysteries of nationalism in modern Europe.\nto examine something with a tool, especially in order to find something that is hidden: They probed in/into the mud with a special drill.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking holes in things\nan attempt to discover information by asking a lot of questions: an FBI probe into corruption a Justice Department probe into the Democrats' fund raising\nmedical\n&#160; specialized a long, thin metal tool used by doctors to examine inside someone\nscience\n&#160; specialized a device that is put inside something to test or record information See also\nspace probe\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical & surgical equipment\nMeasuring, weighing, & counting devices\nAdd to word list\nAdd to word list\nto search into or examine something: [ I ] Investigators are probing into new evidence in the case.\nTo probe something with a tool is to examine it: [ T ] Using a special instrument, the doctor probed the wound for the bullet.\na careful and detailed examination: The probe explored allegations of corruption in the police department.\nA probe is also a long, thin tool used by doctors in medical examinations or operations.\nAdd to word list\nAdd to word list\nthe process of asking questions and examining facts in a situation, often in order to discover information that someone may be hiding: corruption/criminal/federal probe Alarm bells rang around the City after the investment bank revealed it had widened its accounting probes. a probe into sth The fund manager was arrested following a probe into alleged corruption.launch/conduct/open a probe The Swiss Banking Commission is conducting a probe into possible insider dealing.\nto try to discover information about a situation by asking questions and examining facts: probe into sth High-end investors began to probe into the fund's performance and demanded better returns. He says the problems prompted him as a journalist to probe deeper, even after the issues disappeared from the media."}