{"id":291301,"name":"probability","type":"noun","us_sound":"ˌprɑː.bəˈbɪl.ə.t̬i","us_link":"../audio/p/eus73720.mp3","uk_sound":"ˌprɒb.əˈbɪl.ə.ti","uk_link":"../audio/p/ukpriso022.mp3","content":"Add to word list\nAdd to word list\nC1 the level of possibility of something happening or being true: What is the probability of winning? The probability of getting all the answers correct is about one in ten. There's a high/strong probability (that) (= it is very likely that) she'll be here. Until yesterday, the project was just a possibility, but now it has become a real probability (= it is likely to happen). Synonym\nlikelihood\nThesaurus: synonyms, antonyms, and examples\nthe chance of something happeningchanceThere's a good chance he'll resign.probabilityWhat's the probability of winning?oddsWhat are the odds that she takes him back?likelihoodThe treaty increases the likelihood that the cease-fire will hold.possibilityThere's a distinct possibility I won't be able to make it to the pub tonight.\nSee more results »\nin all probability\nC2 used to mean that something is very likely: She will, in all probability, have left before we arrive.\nSee more\nMore examplesFewer examplesWhat's the probability of that happening?There's a strong probability that we'll have moved by then.There's a distinct probability that Philip will be there.There's a high probability that she'll get the job.Against all probability we found ourselves in the same hotel.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nAdd to word list\nAdd to word list\nmathematics a number that represents how likely it is that a particular thing will happen\nmathematics Probability is the study of the mathematics of calculating the likelihood that particular events will happen.\nthe likelihood of something happening or being true: [ C ] There’s a higher probability of now having a state income tax (= the tax is more likely now). In all probability he would never see her again (= very likely he would not see her again).\nAdd to word list\nAdd to word list\nthe level of possibility that something will happen or is true: high/low/strong probability There is a strong probability that the country will fall into recession again.probability of sth Spam filters calculate the probability of a message being spam.assess/calculate/estimate the probabilities They also estimated the probabilities of dividend increases and decreases under certain circumstances."}