{"id":291365,"name":"problem","type":"noun","us_sound":"ˈprɑː.bləm","us_link":"../audio/p/problem.mp3","uk_sound":"ˈprɒb.ləm","uk_link":"../audio/p/ukprobi002.mp3","content":"Add to word list\nAdd to word list\nA1 a situation, person, or thing that needs attention and needs to be dealt with or solved: financial/health problems Our main problem is lack of cash. I'm having problems with my computer. No one has solved the problem of what to do with radioactive waste. The very high rate of inflation poses/presents (= is) a serious problem for the government. Who is going to tackle (= deal with) the problem of poverty in the inner cities? [ + -ing verb ] Did you have any problems (= difficulties) getting here? I'd love to come - the only problem is I've got friends staying that night.\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\na question in mathematics that needs an answer: We were given ten problems to solve. problem child, family, etc.\na child, family, etc. that is considered to have problems with their behaviour, mental or physical health, etc.: She spoke like a schoolteacher talking to a problem child.\nSee more\nMore examplesFewer examplesTraffic congestion in large cities seems to be an insoluble problem.Her only problem is lack of confidence.I've had continual problems with this car ever since I bought it.Tiredness, loss of appetite and sleeping problems are all classic symptoms of depression.Desperate measures are needed to deal with the growing drug problem.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nchill\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nCalculations & calculating\nIdioms\nhave a problem with something/someone\nno problem\nAdd to word list\nAdd to word list\nsomething that causes difficulty or that is hard to deal with: Financing the camp’s athletic program is a problem. He has a serious health problem. I’m having problems with my in-laws again.\nmathematics A problem is also a question to be answered or solved, esp. by reasoning or calculating: math problems"}