{"id":291497,"name":"processing","type":"noun","us_sound":"ˈprɑː.ses.ɪŋ","us_link":"../audio/p/usb01104.mp3","uk_sound":"ˈprəʊ.ses.ɪŋ","uk_link":"../audio/p/ukb01104.mp3","content":"Add to word list\nAdd to word list\nthe act of dealing with documents or people in an official way: There was a delay in the processing of passport applications. The processing of claims will begin later this year.\n(of a computer) the act of performing a particular series of operations on information, such as a set of calculations: data processing\nthe act of preparing, changing, or treating food or natural substances as a part of an industrial operation: a waste processing plant\n[ T ] the act of making pictures from photographic film: The popularity of digital cameras has reduced the demand for traditional film processing.\nMore examplesFewer examplesThey found cans containing rotting meat, which was the result of poor processing when the cans were sealed.Passengers can check in only one piece of luggage, permitting speedier processing of passengers. These files enable you to control image processing on your PC.The next step is the statistical processing. The credit card company agreed to waive the $29 late fee since it was a processing error.There was a time when one-hour film processing seemed like a great deal.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nturn to someone/something\nweather\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nComputer concepts\nIndustrial processing\nPreserving & storing food\nSee\nprocess verb\nAdd to word list\nAdd to word list\nPRODUCTION the series of actions that are taken to change raw materials during the production of goods: the processing of sth Uruguay's manufacturing production and exports are largely based on the processing of natural resources.processing equipment/facility/plant The refinery is among the largest and most advanced crude oil processing plants in the world.\nIT the use of a computer to collect, store, organize, and use information See also\nbatch processing\nCPU\ndata processing\ndistributed processing\nparallel processing\nword processing"}