{"id":291453,"name":"proceed","type":"verb","us_sound":"proʊˈsiːd","us_link":"../audio/p/eus73722.mp3","uk_sound":"prəˈsiːd","uk_link":"../audio/p/ukprobi010.mp3","content":"Add to word list\nAdd to word list\nC1 to continue as planned: His lawyers have decided not to proceed with the case. Preparations for the festival are now proceeding smoothly. proceed to do something\nC2 to do something after you have done something else: She sat down and proceeded to tell me about her skiing holiday.\nSee more\nformal to move forward or travel in a particular direction: Passengers for Madrid should proceed to gate 26 for boarding.\nMore examplesFewer examplesWe need to think about how to proceed from here.You should proceed with caution.The suspect alighted from the train at Euston and proceeded to Heathrow.He proceeded to relieve himself against a tree.Should you decide to proceed with the treatment you will be contacted by the hospital.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotraction\npush ahead\npush on\nrun on\nrun someone/something over\nspan\nspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nPhrasal verb\nproceed against someone\nAdd to word list\nAdd to word list\nto start or continue an action or process: The building project is proceeding smoothly. You should ask a lawyer for advice on how to proceed.\nTo proceed is also to move forward or travel in a particular direction: The warning signs said \"Proceed with caution.\"\nAdd to word list\nAdd to word list\nto continue as planned: The merger is proceeding according to schedule and should be complete by July.proceed with sth It is not yet clear whether the private investor has decided to proceed with a formal bid for the budget airline. proceed carefully/quickly/slowly Phrasal verbs\nproceed against sb\nproceed to sth"}