{"id":291458,"name":"proceedings","type":"noun","us_sound":"proʊˈsiː.dɪŋz","us_link":"../audio/p/proceedings.mp3","uk_sound":"prəˈsiː.dɪŋz","uk_link":"../audio/p/ukprobi011.mp3","content":"proceedings noun [plural]\n(EVENTS)\nAdd to word list\nAdd to word list\na series of events that happen in a planned and controlled way: Millions of people watched the proceedings on television. The Chairperson opened the proceedings with a short speech.\na complete written record of what is said or done during a meeting Compare\nthe minutes\nMore examplesFewer examplesMichael was there so that added a bit of excitement to the evening's proceedings.We watched the proceedings from a raised platform.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\ndevelopment\nedition\nepiphenomenon\nepisode\nevent\ngoings-on\noccurrence\npast\nreoccurrence\nspree\nsynchronicity\nthing\nto-ing and fro-ing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOfficial documents\nproceedings noun [plural]\n(LEGAL ACTION)\nC2 law\n&#160; specialized legal action: Allegations of sexual harassment have led to disciplinary proceedings being taken against three naval officers. I started legal proceedings to try to have him taken away from his parents permanently.\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecutorial\nreindict\nreindictment\nretry\nspecimen charge\nsummons\nSee more results »\nAdd to word list\nAdd to word list\na series of actions that happen in a planned and controlled way: As the president was sworn in, the nation watched the proceedings on TV.\nAdd to word list\nAdd to word list\nthe actions that are taken in a court of law: commence/enter into/start proceedings The plaintiffs commenced proceedings for breach of contract. proceedings against sb/sth Financial institutions have started legal proceedings against him for defaulted loans.proceedings for sth He commenced proceedings for damages for professional negligence against the defendant. civil/criminal proceedings deportation/divorce/foreclosure proceedings See also\nbankruptcy proceedings\nstay of proceedings"}