{"id":291488,"name":"process","type":"noun","us_sound":"ˈprɑː.ses","us_link":"../audio/p/process.mp3","uk_sound":"ˈprəʊ.ses","uk_link":"../audio/p/ukprobi013.mp3","content":"Add to word list\nAdd to word list\nB2 a series of actions that you take in order to achieve a result: the peace process Increasing the number of women in top management jobs will be a slow process. This decision may delay the process of European unification. The party has begun the painful (= difficult) process of rethinking its policies and strategy. Going to court to obtain compensation is a long process. She arrived at the correct answer by a process of elimination (= by deciding against each answer that was unlikely to be correct until only one was left).\nB2 a series of changes that happen naturally: the digestive process the ageing process It's all part of the learning process.\na method of producing goods in a factory by treating natural substances: They have developed a new process for extracting aluminium from bauxite.\nMore examplesFewer examplesWarm air rises by the process of convection.Her conversion to Buddhism was a very gradual process.Repairing damaged nerves is a very delicate process.An enzyme in the saliva of the mouth starts the process of breaking down the food.A refining process is used to extract usable fuel from crude oil.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking progress and advancing\nIndustrial processing\nIdioms\nbe in the process of doing something\nin the process\nprocess verb\n(DEAL WITH)\nB2 [ T ] to deal with documents in an official way: Visa applications take 28 days to process.\n[ T ] If a computer processes information, it performs a particular series of operations on the information, such as a set of calculations.\n[ T ] to prepare, change, or treat food or natural substances as a part of an industrial operation: a waste processing plant\n[ T ] to think about a difficult or sad situation so that you can gradually accept it: Returning soldiers need time to process what they have experienced in combat.\n[ T ] to make pictures from photographic film: I need to get those films processed.\nMore examplesFewer examplesIt usually takes about four weeks to get the forms processed.Don't switch the computer off - it's still processing data.Sugar is obtained by crushing and processing sugar cane.I've sent off the film to be processed.They processed my claim really quickly.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nComputer concepts\nIndustrial processing\nPreserving & storing food\nThinking and contemplating\nprocess verb\n(WALK)\n[ I + adv/prep ] mainly UK formal uk\nYour browser doesn't support HTML5 audio\n/prəˈses/ us\nYour browser doesn't support HTML5 audio\n/prəˈses/ to walk slowly: We watched them process down the aisle.\nSMART Vocabulary: related words and phrases\nMoving gently on foot\namble\ncirculate\ndumbwalking\nflâneur\ngently\nmeander\nmince\nmincingly\nmooch\nmosey\nplod\npotter\npromenade\nputter\nslink\nstroll\nstroller\ntippy\ntiptoe\nwander\nSee more results »\nRelated word\nprocessing\nAdd to word list\nAdd to word list\na series of actions or events performed to make something or achieve a particular result, or a series of changes that happen naturally: Completing his degree at night was a long process. Graying hair is part of the aging process. We are still in the process of redecorating the house (= working to decorate it).\nA process is also a method of doing or making something, as in industry: A new process has been developed for removing asbestos.\nto deal with something according to a particular set of actions: Your insurance claim will take about a month to process.\nIf a computer processes information, it performs a series of operations on it.\nTo process food or raw materials is to prepare, change, or treat them as part of an industrial operation.\nAdd to word list\nAdd to word list\na series of actions that are needed in order to do something or achieve a result: Management recognizes it is important to get the process right even if it means delaying the project start date.consultation/decision-making/planning process The role offers the opportunity to be a part of the company's decision-making process. approval/evaluation/inspection process complete/finish/start a process a disciplinary/hiring/selection process improve/speed up/streamline a process\nPRODUCTION a method of producing goods in a particular industry: an industrial/manufacturing/production process\nbe in the process of doing sth\nto have started doing something: We're in the process of reviewing the court's decision and evaluating our response.\nin the process\nif something is happening, and something else happens in the process, the second thing happens as a result of the first: A clash with their main supplier means they won't be able to honour their contracts and will lose millions of pounds in the process. See also\ndue process\nfour-colour process\nPRODUCTION to change raw materials, for example by adding chemicals or other substances to them, as part of the production of goods: The two new oil refineries will be able to process 250,000 barrels of crude a day.\nto deal with documents in an official way: process applications/claims/orders Insurance claims may take up to 30 days to process.\nIT if a computer processes data, it uses a set of instructions to organize it and produce a particular result: A bug in the system was preventing it from processing digital image files."}