{"id":291875,"name":"producing","type":"verb","us_sound":"prəˈduːs","us_link":"../audio/p/produce_01_00.mp3","uk_sound":"prəˈdʒuːs","uk_link":"../audio/p/ukprod_009.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nproduce\nproduce verb [T]\n(MAKE)\nB1 to make something or bring something into existence: France produces a great deal of wine for export. Red blood cells are produced in the bone marrow. She works for a company that produces (= makes for sale) electrical goods. I was wondering whether I could produce a meal out of what's left in the fridge. She's asked me to produce a report on the state of the project.\nThesaurus: synonyms, antonyms, and examples\nto make somethingmakeCan I make you a cup of coffee?produceCalifornia produces a lot of grapes.createLeonardo da Vinci created the masterpiece we know as \"Mona Lisa\".inventAlexander Graham Bell is credited with inventing the telephone.developThey are working to develop the next generation of underwater vehicles.manufactureThe car is manufactured in Germany.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto build somethingbuildThe house was built in the 1950s.constructThe company wants to construct a 175-mile pipeline.put something upPutting up a wall will not solve the problem.erectIt's unlawful to erect a building until you get approval.assembleHe has a job assembling furniture in a warehouse.put togetherWithout the instruction sheet, I've got no idea how to put all these parts together.\nSee more results »\nWhen animals produce young, they give birth to them: Our cat produced four kittens during the course of the night.humorous All our friends seem to be busy producing offspring at the moment.\nMore examplesFewer examplesPlutonium is a fuel used to produce nuclear energy.$4 million worth of souvenirs and gift items have been produced for the event.The meat produced from a pig is called pork, bacon, or ham.The government has produced a series of leaflets designed to extend public awareness of the dangers of AIDS.New York City produces 10500 tons of residential waste each day.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal reproduction\nproduce verb [T]\n(CAUSE)\nB2 to cause a reaction or result: The senator's speech produced an angry response from the opposition. Her remarks produced an awkward silence. If used on delicate skin, this cream may produce a stinging sensation.\nMore examplesFewer examplesCars produce a lethal cocktail of gasses.Their methods of assessment produce some unusual results.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nproduce verb [T]\n(FILM/MUSIC)\nto organize the practical and financial matters relating to the preparation of a film, play, or television or radio programme Compare\ndirect verb (CONTROL)\nto be in charge of making a musical recording and to be responsible for the arrangement of the music, the combination of the different instruments or voices and the general sound of it\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\nauteur\ncanister\ncomputer-animated\nfog machine\nframing\nframing device\ngreen screen\nhelmer\nlinear\nproduce\nrestage\nrun through something\nscreen test\nsetting\nSFX\nspecial effect\nsynthespian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nRecording sounds and images\nproduce verb [T]\n(BRING OUT)\nC1 to bring something out from somewhere and show it: He produced a letter from his desk that he asked me to read. One of the men suddenly produced a knife from his pocket.\nMore examplesFewer examplesThe company produced receipts in substantiation of its claim.He opened his suitcase and produced a large box of chocolates.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbetray\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nproduce\nspeak\nvirtue signalling\nvisualization\nwear\nwhiff\nSee more results »\nproduce verb [T]\n(RESULT IN)\nto result in or discover something, especially proof: A lengthy police investigation failed to produce any evidence on which the suspect could be convicted.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »"}