{"id":291890,"name":"productivity","type":"noun","us_sound":"ˌproʊ.dəkˈtɪv.ə.t̬i","us_link":"../audio/p/eus73728.mp3","uk_sound":"ˌprɒd.ʌkˈtɪv.ə.ti","uk_link":"../audio/p/ukprod_016.mp3","content":"Add to word list\nAdd to word list\nC1 the rate at which a company or country makes goods, usually judged in connection with the number of people and the amount of materials necessary to produce the goods: Studies show that if a working environment is pleasant, productivity increases. a productivity bonus/incentive Productivity in the steel industry improved by five percent last year.\nMore examplesFewer examplesThe introduction of new working practices has dramatically improved productivity.Our main objective is to improve the company's productivity.The productivity figures are down/up on last week's.It's a question of striking the right balance between quality and productivity.The payback for reorganization should be increased productivity.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nAdd to word list\nAdd to word list\nthe rate at which a person, company, or country does useful work: A pleasant working environment increases productivity.\nAdd to word list\nAdd to word list\nthe rate at which a country, company, etc. produces goods or services, usually judged in relation to the number of people and the time necessary to produce them: The productivity agreement gives staff an extra 10% pay if the team reaches its sales targets.productivity increases/improves/goes up Studies show that if a working environment is pleasant, productivity increases. increase/improve/boost productivity an increase/decrease/fall in productivityproductivity gains/growth/improvement Many economists doubt that productivity growth can be credited to information technology.\nthe ability to do as much work as possible in a particular period: Think about which times of day your productivity is highest, and do the most difficult tasks then. The new phone has some useful apps for organizing information – it's a great productivity tool. See also\nmarginal productivity\nresource productivity"}