{"id":291868,"name":"producer","type":"noun","us_sound":"prəˈduː.sɚ","us_link":"../audio/p/producer.mp3","uk_sound":"prəˈdʒuː.sər","uk_link":"../audio/p/ukprod_011.mp3","content":"producer noun [C]\n(FILM/MUSIC)\nAdd to word list\nAdd to word list\nB2 a person who makes the practical and financial arrangements needed to make a film, play, or television or radio programme: a Hollywood/movie producer Compare\ndirector (FILM MAKER)\na person who makes the practical and financial arrangements needed to make a CD or other recording: a record producer\nMore examplesFewer examplesThe producer disliked the script and demanded a rewrite.a TV/theatre producer\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation\nstation break\nsubtitled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nproducer noun [C]\n(MAKER)\nC1 a company, country, or person that provides goods, especially those that are produced by an industrial process or grown or obtained through farming, usually in large amounts: egg producers gas/oil producers Australia is one of the world's main producers of wool.\nMore examplesFewer examplesWith fairtrade everyone benefits, both producers and consumers.one of the country's premier wine producers\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nproducer noun [C]\n(MAKER)\nAdd to word list\nAdd to word list\na company, country, or person that makes things, usually for sale, esp. things made by an industrial process or grown or obtained from the ground: a producer of automobiles/wheat\nAdd to word list\nAdd to word list\nPRODUCTION a country, company, or person that makes goods or that grows food in large amounts: a producer of sth The group is the world's biggest producer of copper, supplying around 6% of global output. a gas/oil/steel producer\nHR a person or company that is responsible for the practical and financial arrangements for a film, television programme, etc.: He is the creator and executive producer of the popular new TV series. a film/Hollywood/television producer"}