{"id":291887,"name":"productive","type":"adjective","us_sound":"prəˈdʌk.tɪv","us_link":"../audio/p/productive.mp3","uk_sound":"prəˈdʌk.tɪv","uk_link":"../audio/p/ukprod_014.mp3","content":"Add to word list\nAdd to word list\nB2 resulting in or providing a large amount or supply of something: In order to turn the deserts into fertile and productive land, engineers built an 800-mile canal. He had an amazingly productive five years in which he managed to write four novels. Opposite\nunproductive\nB2 having positive results: We had a very productive meeting - I felt we solved lots of problems. Theirs was a very productive partnership.\nThesaurus: synonyms, antonyms, and examples\nachieving the results that are hoped forsuccessfulThe operation was successful, and the tumour was removed.effectiveThis cream is one of the most effective acne treatments you can find.efficaciousDetractors claim the new law won't be any more efficacious than current legislation is. productiveWe had a productive conversation, and he's back on track now.\nSee more results »\neducation , language\n&#160; specialized relating to the ability to produce language, rather than just understand it: The English-speaking children's productive vocabularies ranged from 2 to 31 words. Compare\nreceptive specialized\nMore examplesFewer examplesThe interview would have been more productive if the questions had been framed more precisely.Perhaps her most productive period was her five-year stint as a foreign correspondent in New York.Team work at its best results in a synergy that can be very productive.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\nLearning & knowing\nLinguistics: terminology & vocabulary\nRelated word\nproductively\nAdd to word list\nAdd to word list\ncausing or providing a good result or a large amount of something: We had a very productive meeting – a lot of problems were solved. What was once desert has become productive farmland. productively adverb us\nYour browser doesn't support HTML5 audio\n/prəˈdʌk·tɪv·li/\nHer students worked less productively than the teacher hoped.\nAdd to word list\nAdd to word list\nPRODUCTION, ECONOMICS producing a large number of goods, crops, profit, etc. or doing a lot of work: productive farmland/sector/economy The only remaining option is to switch underemployed workers from agriculture to more productive sectors.productive worker/employee/citizen The idea was to reward France's highly productive workers with shorter working hours.\nWORKPLACE, MEETINGS achieving good results: The negotiations were reported to have been \"very productive.\" a productive day's worka productive meeting/conversation/discussion You can't have a productive discussion if people aren't listening to each other.\nPRODUCTION relating to production of goods: There is a great demand for water for productive purposes. The diagram shows the productive structure of the firm.\nSee also\nproductively\ntotal productive maintenance\nunproductive"}