{"id":291883,"name":"production","type":"noun","us_sound":"prəˈdʌk.ʃən","us_link":"../audio/p/production.mp3","uk_sound":"prəˈdʌk.ʃən","uk_link":"../audio/p/ukprod_013.mp3","content":"production noun\n(MAKING)\nAdd to word list\nAdd to word list\nB2 [ U ] the process of making or growing goods to be sold: Coke is used in the production of steel. We watched a video showing the various stages in the production of glass. The company's new model will be going into production early next year.\nB2 [ U ] the amount of something that is made or grown by a country or a company: Swedish industrial production has fallen steadily this year. Wheat production has risen over the years.\nMore examplesFewer examplesThe government has pledged to reduce the amount of chemicals used in food production.The drug is still being tested and will not go into commercial production for at least two years.Existing methods of production are expensive and inefficient.Prices of goods are governed by the cost of the raw materials, as well as by the cost of production and distribution.The company expects to resume production of the vehicle again after a two-month break.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nproduction noun\n(OF FILM/MUSIC)\nB2 [ C or U ] the activity of organizing the practical and financial matters relating to the preparation of a film, play, or television or radio programme: She's hoping to get into television production. Disney's latest production (= film) looks likely to be its most successful ever.\n[ C ] a particular series of performances of a theatre entertainment such as a play or opera: They're doing a new production of Macbeth at the National Theatre.\n[ U ] the preparation and general quality of a musical recording's sound, showing the way in which the music was recorded rather than the quality of the singing and the music: George Martin did the production on the Beatles records.\nMore examplesFewer examplesAll the major theatres now have sponsors, especially for high-cost productions.The local drama group is staging a production of the musical 'Grease'.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpectacles & performances\nRecording sounds and images\nproduction noun\n(BRINGING OUT)\n[ U ] formal the act of taking something out and showing it: Entry to the club is only permitted on production (= the showing) of a membership card.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nIdiom\nmake a production (out) of something\nproduction noun\n(ENTERTAINMENT)\nAdd to word list\nAdd to word list\n[ C/U ] a movie, television program, play, or other entertainment, or the work of organizing the practical matters involved in a show: [ C ] a terrific production of \"The Wizard of Oz\" [ U ] She’s hoping to get into television production.\nproduction noun\n(PROCESS)\n[ U ]\n&#160; biology (of living things) the process of making a natural substance, such as a hormone\nproduction noun\n(THING MADE)\n[ U ] the process of making or growing goods to be sold, or the amount of goods made or grown: mass production Agricultural production has increased dramatically this year.\nAdd to word list\nAdd to word list\nthe process of producing commodities (= oil, metals, crops, etc.) or manufacturing goods to be sold: production costs/processes/targets Many businesses have moved their manufacturing operations to Asia to lower their production costs.a decline/fall/increase in production Opec is expected to agree to an increase in production. energy/food/oil production\ngo into/out of production\nto start/stop making a product: The popular model is scheduled to go out of production by the end of the year.\n(also Production) the department in a company that makes goods: The launch date has been announced so it is vital that Production deliver on time.\nthe amount of goods or products that are made or grown by a company or country: UK wheat production is forecast to be 700,000 tonnes higher than last year. cut/expand/increase production\nthe activity of organizing the practical and financial details of a film, television programme, etc.: The production company that owns the format has made huge profits from its adoption by networks around the world.\nthe act of providing something to be examined: Refunds will only be given on production of a receipt. See also\nbatch production\ncontinuous production\nfactor of production\nindustrial production\njob production\njust in time\nmass production\nprimary production\nsecondary production"}