{"id":291876,"name":"product","type":"noun","us_sound":"ˈprɑː.dʌkt","us_link":"../audio/p/product.mp3","uk_sound":"ˈprɒd.ʌkt","uk_link":"../audio/p/ukprod_012.mp3","content":"product noun\n(THING MADE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] something that is made to be sold, usually something that is produced by an industrial process or, less commonly, something that is grown or obtained through farming: They do a range of skin-care products. The product is so good it sells itself. I'm trying to cut down on dairy products. See also\nby-product\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\n[ U ] a substance that is used on someone's hair in order to make it look or feel better, keep it in a particular style, etc.: How often should I wash my hair if I use product? I shower once a day and I try not to sleep with product in my hair. Product such as styling gel or mousse can leave residue on your hair that builds up over time. a/the product of something\na/the result of something: A figure like that is usually the product of many hours spent in the gym.\nSee more\nMore examplesFewer examplesCriticism was directed against the manufacturers of the product.This product contains no animal fat.The company is concentrating on developing new products.Their own-label vegetarian products have been a huge success.We export our products to countries as far afield as Japan and Canada.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair care\nproduct noun\n(IN MATHEMATICS)\n[ C ]\n&#160; mathematics\n&#160; specialized the result you get when two or more numbers are multiplied together: The product of 6 and 3 is 18.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nproduct noun\n(IN CHEMISTRY)\nchemistry\n&#160; specialized a substance formed in a chemical reaction: Pipettes can easily become contaminated with the products of previous reactions. Compare\nreactant\nSMART Vocabulary: related words and phrases\nChemistry: types of chemical\nacid salt\naerogel\nalkali metal\nalkaline\nalkalinity\nalkaloid\nantioxidant\ncarbohydrate\ncoolant\ninorganic\nketone\nlectin\nmelamine\nmethyl orange\nmonomer\nmonosaccharide\nmothball\npropellant\nsaline\nsulphide\nSee more results »\nproduct noun [C]\n(THING MADE)\nAdd to word list\nAdd to word list\nsomething that is made to be sold, esp. something produced by an industrial process or something that is grown or raised through farming: industrial products A new product can require two years to develop.\nproduct noun [C]\n(RESULT)\na result obtained from experiencing something: She’s a product of the city’s public schools.\nmathematics A product is the number you get when you multiply numbers: The product of 6 and 3 is 18.\nchemistry A product is also the substance that results from a chemical reaction between other substances.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; PRODUCTION something that is manufactured or grown to be sold, usually in large quantities: sell/launch/withdraw a product The manufacturers had to withdraw the product because of a design fault. We aim to develop more quality products over the coming year. oil/steel products agricultural/dairy products\n[ C ]\n&#160; FINANCE a service that customers can buy from a financial organization to invest or save money: financial/insurance/investment, etc. product Improvement of the bank's financial product range formed part of the takeover bid.\n[ U ]\n&#160; COMMERCE something that is available for sale: They took all products containing the chemical off the shelves. Large companies usually offer small retailers a deal where they only pay for the product sold during an agreed period. See also\naugmented product\nby-product\ncommercial product\ncommodity product\nconsumer products\ncopycat adjective\ncore adjective\nderivative product\ndifferentiated\nend product\nentry-level\nfinancial product\ngross product\nhigh-end\nhome product\nhousehold product\nindustrial adjective\ninsurance product\ninvestment product\nlow-end adjective\nme-too\nproprietary\nsubstitute product"}