{"id":292050,"name":"profiler","type":"noun","us_sound":"ˈproʊ.faɪ.lɚ","us_link":"../audio/p/cdo0319usprof1372.mp3","uk_sound":"ˈprəʊ.faɪ.lər","uk_link":"../audio/p/cdo0319ukprof1250.mp3","content":"profiler noun [C]\n(INFORMATION)\nAdd to word list\nAdd to word list\na person who predicts the likely behaviour or description of someone such as a criminal, based on the information that is available about them: Police are liaising closely with a criminal profiler who is advising them of the potential motives, lifestyles, and psychology of possible abductors. In all his years as a psychological profiler, he had rarely come across a spy whose outward life seemed so free of crisis or conflict.\na device, program, etc. that finds out information about people or things in order to create a description of what they are like: They use a facility called the \"investor profiler\" that asks questions about the customer's financial circumstances to build a picture of his or her attitude to risk and the purpose of the investment.\nMore examplesFewer examplesHe has worked for the FBI as a hostage negotiator and a profiler for 25 years. One line of inquiry for officers, based on information from a profiler, is that the murderer looks like someone who has local knowledge, a local person.In 20 years with the FBI his pioneering work as a profiler has helped solve many murders.These funds have been deliberately built so an investor goes through a risk profiler, to ensure they are matched with the correct fund.\nSMART Vocabulary: related words and phrases\nDetection & solving crimes\nall-points bulletin\nankle bracelet\nankle tag\nANPR\nAPB\nfingertip search\nforensic\nforensically\nforensics\ngumshoe\npsychological profile\npsychological profiling\nradar trap\nraid\nrandom breath test\nsurveil\ntighten\ntighten the net idiom\ntracker dog\ntruth serum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScience of psychology & psychoanalysis\nMeasuring, weighing, & counting devices\nprofiler noun [C]\n(COMPUTING)\na computer program that checks and reports on how another program is working: A coverage profiler lets you analyse the performance of your code, and detect code that is never called.\nMore examplesFewer examplesAMD offers a powerful code profiler, called CodeAnalyst, that's available for free download.They have created a commercial-development environment called Zend Studio that includes a sophisticated debugger, a profiler, and other features.The Profiler lists the performance characteristics of each of your script’s functions, making it easy to pinpoint problem areas and drill down to the offending lines of code.The IDE also included a code profiler that could report on which parts of the program were using the most time.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »"}