{"id":292058,"name":"profitable","type":"adjective","us_sound":"ˈprɑː.fɪ.t̬ə.bəl","us_link":"../audio/p/profitable.mp3","uk_sound":"ˈprɒf.ɪ.tə.bəl","uk_link":"../audio/p/ukprofi005.mp3","content":"Add to word list\nAdd to word list\nB2 making or likely to make a profit: Over the years it has developed into a highly profitable business. profitable investments The company had to eliminate 200 jobs to stay profitable. Opposite\nunprofitable\nin a way that produces or is likely to produce an advantage: I made profitable use of my time, mixing with a lot of different people and practising my Spanish. Opposite\nunprofitable\nMore examplesFewer examplesa highly profitable line of productsCustomers weren't willing to pay enough to make the products profitable.These sales figures are a good indication of another profitable year.The company remains moderately profitable, but it is not making as much money as it should.The discussion turned out to be really profitable.This did not prove to be a profitable line of enquiry.I think you need to find something more profitable to do with your time.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ndeficit\nlose\nlose your shirt idiom\nmargin\nmuck\nout-of-pocket\npi\npocket\nprofit from something\nprofit warning\nprofitability\nrake-off\ntrade surplus\nwinnings\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\nRelated words\nprofitability\nprofitably\nAdd to word list\nAdd to word list\nresulting in or likely to result in a profit or a benefit: a profitable business I try to make profitable use of my time. profitability noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌprɑf·ɪ·t̬əˈbɪl·ɪ·t̬i/\nHe revealed plans to restore the magazine’s profitability. profitably adverb us\nYour browser doesn't support HTML5 audio\n/ˈprɑf·ɪ·t̬ə·bli/\nWe can operate profitably within that market.\nAdd to word list\nAdd to word list\nCOMMERCE, FINANCE producing a profit: a profitable business/company They are now among the most profitable companies quoted on the New York Stock Exchange.highly/very profitable This is a highly profitable business. a profitable market/product profitable growthbe profitable for sb to do sth Consumers need to convince farmers that it can be profitable for them to grow organic food.\ngiving an advantage or useful result: The meeting had gone well, and he felt it had been a profitable morning."}