{"id":291995,"name":"professional","type":"adjective","us_sound":"prəˈfeʃ.ən.əl","us_link":"../audio/p/professional.mp3","uk_sound":"prəˈfeʃ.ən.əl","uk_link":"../audio/p/ukprod_023.mp3","content":"Add to word list\nAdd to word list\nB2 relating to work that needs special training or education: Chris, you're a nurse, so can I ask your professional opinion on bandaging ankles? Both doctors have been charged with professional misconduct (= bad or unacceptable behaviour in their work). Compare\namateur adjective\nB1 approving having the qualities that you connect with trained and skilled people, such as effectiveness, skill, organization, and seriousness of manner: It would look more professional if the letter was typed. She always looks very professional in her smart suits. You've done a very professional job stripping that floor!\nB1 used to describe someone who does a job that people usually do as a hobby: She's a professional dancer/photographer. He's a runner who's just turned professional.\nhaving the type of job that is respected because it involves a high level of education and training: Room for rent in shared house - would suit professional person. a bar full of young professional types in suits\nMore examplesFewer examplesWe're engaging the services of a professional administrator.He's one of the highest-earning professional golfers in the world.These two books will be especially useful for editors, journalists, and other professional users of the language.He was an amateur singer until the age of 40, when he turned professional.This was her final professional match, and she wanted to end her career in a blaze of glory.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nC1 a person who has the type of job that needs a high level of education and training: health professionals Compare\namateur adjective\ninformal someone who has worked hard in the same type of job for a long time and has become skilled at dealing with any problem that might happen: I thought the whole meeting was going to fall apart but you rescued it like a true professional! the consummate professional\nB2 a person who does a job that people usually do as a hobby: He's only been playing football as a professional for two years.\na person who plays a sport, especially a golf or tennis player, who is employed by a club to train its members in a particular sport\nMore examplesFewer examplesShe responded to the situation like a true professional.This tennis tournament is open to both amateurs and professionals.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nAdd to word list\nAdd to word list\na person who has a job that needs skill, education, or training: Don’t you wish you had hired a professional to paint your house? Many of these homes have been restored by young professionals.\ndone as a job, or relating to a skilled type of work: a professional athlete professional sports He spent his professional career at the University of Pennsylvania.\nProfessional also means having the qualities of skilled and educated people, such as effectiveness and seriousness of manner: Wearing jeans to work is not looked upon as being professional. professionally adverb us\nYour browser doesn't support HTML5 audio\n/prəˈfeʃ·ə·nəl·i/\nI always wanted to sing professionally.\nAdd to word list\nAdd to word list\n[ before noun ] related to work that needs a high level of education or special training: professional advice/judgments/opinions You should seek professional advice before doing this.a professional background/career/life She has spent the bulk of her professional life working in the public sector.professional experience/qualifications/training The importance of professional qualifications varies enormously between different industries. a professional association/body/organization professional services/skills/standards\nhaving the type of job that is respected because it involves a high level of education and training: Many of those who want to rent are single, professional people who do not want to share.\nhaving the qualities that you connect with trained people, such as being organized and showing a high standard of work: It would look more professional if the letter were typed. He has behaved in a very professional way. a professional environment/relationship\nsuitable for a person working in a particular profession: professional accountability/conduct/misconduct He is now facing charges of serious professional misconduct.\n(also informal pro) doing an activity or a job to earn money, rather than as a hobby: a professional athlete pro football/sports Compare\namateur adjective\na person who has the type of job that needs a high level of education and special training: It's important to gather a team of professionals such as a lawyer, an accountant, and a financial planner to help draw up a plan. health/health care/medical professionals IT/finance/marketing professionals dedicated/skilled/trained professionals\nsomeone who has worked hard in the same type of job for a long time, and has a lot of skill and knowledge: a true/consummate professional He's a real pro. If you have a large amount of money to invest, it's better to leave it to the pros.\nsomeone who does an activity or a job to earn money, rather than as a hobby: This will be his first game as a professional. Compare\namateur adjective See also\nhealth professional"}