{"id":292056,"name":"profit","type":"noun","us_sound":"ˈprɑː.fɪt","us_link":"../audio/p/profit.mp3","uk_sound":"ˈprɒf.ɪt","uk_link":"../audio/p/ukprofi003.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] money that is earned in trade or business after paying the costs of producing and selling goods and services: She makes a big profit from selling waste material to textile companies. A year ago the Tokyo company had a pretax profit of 35 million yen. Company profits are down from last year's figures. You don't expect to make much profit within the first couple of years of setting up a company. He sold his house at a huge profit. turn a profit\nto begin to earn a profit: He’s been in business five years, but has not yet turned a profit.\nSee more\n[ U ] the good result or advantage that can be achieved by a particular action or activity: There's no profit to be gained from endlessly discussing whose fault it was.\nMore examplesFewer examplesThe school summer fair made a clear profit of £500.They buy paintings at auctions and then resell them at a vast profit to collectors.We agreed before we did the deal that we'd both get an equal share of the profit.All our profits are re-invested in research and development.The successful branding and marketing of the new beer has already boosted sales and increased profits.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ndeficit\nka-ching\nlose your shirt idiom\nmargin\nout-of-pocket\npi\npocket\nprofit from something\nprofit warning\nprofitability\nrake-off\ntrade surplus\nwinnings\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvantage and disadvantage\nAdd to word list\nAdd to word list\nmoney that a business earns above what it costs to produce and sell goods and services: [ U ] Any profit made on the sale is taxable. [ C ] A lot of businesses are reaping huge profits.\nProfit can also mean benefit: [ U ] He could see little profit in arguing with them.\nearn money, or benefit: [ I ] It’s sickening that somebody would profit from her misfortune. [ T ] fml What will it profit us to make this bargain (= How will we benefit)?\nAdd to word list\nAdd to word list\nmoney that is earned in trade or business, especially after paying the costs of producing and selling goods and services: The group has had an uneven record in recent years, swinging back and forth between profits and losses.make/realize/turn a profit The company said it had made a profit of about £1.4bn on the deal.after-tax/pre-tax profit Pre-tax profits rose 22.3% to £13.7m. The expectation is that both turnover and trading profit will have increased during last year.sell sth at a profit A realized gain occurs when we sell an investment at a profit.profit on sth He will make a $431m profit on the sale.for profit Banks made new loans, then swiftly sold them off for profit, using the proceeds to extend still more.report profits In the year to March the company reported profits after tax of €900,000.profits fall/increase/rise Sales and profits rose last year. Concerns have been raised that a stagnating economy is hampering corporate profit growth. boost/increase profits an increase/jump/rise in profit a drop/fall in profit big/record/strong profits future/short-term/small profits annual/corporate/taxable profits\nbe in/come into profit\nto be earning, or start to earn, money from a trade or business rather than losing it: Some want it to be illegal to make anyone redundant if you are in profit.\nfirst-half, first-quarter, etc. profit\nprofits for the first half, first quarter, etc. of a financial year: The US entertainment giant showed how second-quarter profits had more than doubled.\npure profit\nprofit that does not need to have any costs taken away: Once overheads are covered, 55c of every $1 of sales is pure profit. See also\naccumulated profit\nattributable profit\nbook profit\nconsolidated profit\ndistributable profit\ndistributed profit\nfor-profit\ngross profit\nnet profit\noperating profit\nView all\npaper profit\nretained profit\ntaxable profit\nwindfall\nto earn money from something: profit by sth/doing sth Traders can profit by buying the stocks back later at lower prices.profit from sth/doing sth Many companies will profit from the fall in interest rates.\nto gain an advantage from something: profit from sth/doing sth I profited enormously from working with her."}