{"id":292099,"name":"profound","type":"adjective","us_sound":"prəˈfaʊnd","us_link":"../audio/p/profound.mp3","uk_sound":"prəˈfaʊnd","uk_link":"../audio/p/ukprofi013.mp3","content":"profound adjective\n(EXTREME)\nAdd to word list\nAdd to word list\nC2 felt or experienced very strongly or in an extreme way: His mother's death when he was aged six had a very profound effect on him. The invention of the contraceptive pill brought about profound changes in the lives of women. Those two lines of poetry express perfectly the profound sadness of loss. My grandfather has a profound mistrust of anything new or foreign. There was a note of profound irritation in his voice.\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfierily\nfit to burst idiom\nflamingly\nfulminating\ngrip\npenetratingly\npungently\nquiveringly\nrabidly\nreinforced\nsearing\ntempestuous\ntingle\ntorrid\nvirulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\nprofound adjective\n(SHOWING UNDERSTANDING)\nC2 showing a clear and deep understanding of serious matters: profound truths/wisdom The review that I read said that it was \"a thoughtful and profound film\". \"Dying is easy - it's living that's the problem.\" \"That was very profound of you, Steven.\"\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nwhip-smart\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAware\nprofound adjective\n(EXTREME)\nAdd to word list\nAdd to word list\nfelt or experienced strongly; extreme: The speech had a profound influence on her.\nprofound adjective\n(SHOWING UNDERSTANDING)\nshowing a clear and deep understanding of serious matters: You’re touching on a very profound question."}