{"id":291994,"name":"profession","type":"noun","us_sound":"prəˈfeʃ.ən","us_link":"../audio/p/profession.mp3","uk_sound":"prəˈfeʃ.ən","uk_link":"../audio/p/ukprod_022.mp3","content":"profession noun\n(WORK)\nAdd to word list\nAdd to word list\nB1 [ C, + sing/pl verb ] any type of work that needs special training or a particular skill, often one that is respected because it involves a high level of education: He left the teaching profession in 1965 to start his own business. The report notes that 40 percent of lawyers entering the profession are women. Teaching as a profession is very underpaid. He's a doctor by profession.\nB2 [ C, + sing/pl verb ] the people who do a particular type of work, considered as a group: There's a feeling among the nursing profession that their work is undervalued. the professions\njobs that need special training and skill, such as being a doctor or lawyer, but not work in business or industry\nMore examplesFewer examplesHe reached the heights of his profession at the age of 35.Her ambition and determination ensured that she rose to the top of her profession.He's very highly regarded within his profession.She was, by profession, a lawyer.Until recently secretarial work and nursing were very much pink-collar professions.\nprofession noun\n(STATEMENT)\n[ C ] a statement about what someone feels, believes, or intends to do, often made publicly: The energy companies' professions of commitment to the environment seem less believable every day. his professions of love\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nstatement\nSee more results »\nAdd to word list\nAdd to word list\n[ C/U ] any type of work, esp. one that needs a high level of education or a particular skill: [ C ] the medical/teaching profession [ U ] I’m a writer by profession.\nAdd to word list\nAdd to word list\na job that needs a high level of education or special training: What is it like to work in a profession where more than 97% of your colleagues are men? the accountancy/teaching/engineering profession the legal/medical/actuarial professionsb is sth by profession He's an architect by profession. She is a leading commercial lawyer who is highly respected within the profession.enter/go into/leave a profession We won't get people to enter a profession that doesn't reward effectiveness.\nthe people who do a particular type of work, considered as a group: There's a feeling among the nursing profession that their work is undervalued.\nthe professions\njobs that need special training and skill, such as being a doctor or lawyer, rather than jobs in business or industry: The struggle for equality in the military is not over yet, but women are making significant gains in this area, as they are in business, politics, and the professions.enter/go into the professions It was an environment where science was a dirty word and his fellow pupils were encouraged to go into the professions."}