{"id":292048,"name":"profile","type":"noun","us_sound":"ˈproʊ.faɪl","us_link":"../audio/p/profile.mp3","uk_sound":"ˈprəʊ.faɪl","uk_link":"../audio/p/ukprofi002.mp3","content":"profile noun [C]\n(DESCRIPTION)\nAdd to word list\nAdd to word list\nB2 a short description of someone's life, work, character, etc.\ninformation about a person's life, work, interests, etc. on a social networking website: You can post your relationship status on your Facebook profile.\nMore examplesFewer examplesa financial/social profilea detailed profile of the author\nSMART Vocabulary: related words and phrases\nAccounts and stories\nanecdote\nanother\nanti-narrative\nbe another story idiom\nbodice-ripper\nbrushstroke\ncautionary tale\ncommentary\nlore\nmisdescription\nmulti-stranded\nmyth\nmythic\nscenario\nsemi-legendary\nshaggy-dog story\nshort story\nsleeping beauty\nstrand\nwrite something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nInternet terminology\nprofile noun [C]\n(ATTENTION)\nC1 the amount of public attention and notice that something receives: We need to increase our company's profile in Asia. There is a growing number of women in high-profile positions (= positions which they are noticed) in the government.\nMore examplesFewer examplesSuch high profile positions can be very stressful.The key to success is to do more to raise the profile of the company.We'll maintain a high profile and ensure that people are aware of our activities.I don't think he's too pleased with you, so I'd keep a low profile if I were you.The team has an appalling public profile.\nSMART Vocabulary: related words and phrases\nMedia in general\nanti-press\nconsume\neditorially\nmainstream media\nmedia\nmedia event\nmedium\nMSM\nnon-broadcast\norgan\npress\npublishing\nthe Fourth Estate\nthe mass media\nunreported\nvehicle\nprofile noun [C]\n(SIDE VIEW)\na side view of a person's face: Drawing profiles is somehow easier than drawing the full face. a strong profile The actor is photographed in profile, smoking a cigarette.\nSMART Vocabulary: related words and phrases\nThe head & face\n-cheeked\n-chinned\n-faced\n-necked\ncheek\nchinless\nchiselled\nchop\ndimpled\nduck face\nfrontal\njaw\njowl\nmaxillary\nmaxillofacial\nmodiolus\nnucha\nvisage\nzygomatic\nzygomaticus\nSee more results »\nIdiom\nkeep a low profile\nto write or publish a short description of someone's life, work, character, etc.: Every week in the books section of the paper they profile a different author. This week we profile the 20-year-old singer-songwriter.\nto predict the likely behaviour or description of someone such as a customer or criminal, based on what information you have about them: Sales data can be used to profile customers' behaviour . He claims no officer would ever enforce the law by profiling a so-called \"type\" of person or people.\nMore examplesFewer examplesThis is the first in an occasional series that will profile local musicians, actors, and dancers. Each week we profile a reader and share her tips for looking fabulous.This is a great way to profile your users to see what they're interested in.The airline denied racially profiling passengers.Think of police \"profiling\" drivers and pulling over the wrong people.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\nprofile noun\n(SIDE VIEW)\nAdd to word list\nAdd to word list\n[ C/U ] a side view of a person’s face: [ C ] I’d seen her profile on a billboard. [ U ] A face in profile never looks at the viewer.\nprofile noun\n(DESCRIPTION)\n[ C ] a description of someone containing all the most important or interesting facts about the person: There’s a profile of producer Hal Willner in \"New York\" magazine.\nprofile noun\n(ATTENTION)\n[ C usually sing ] the amount of public attention that someone or something receives: He keeps a low profile and doesn’t go after headlines. She has had a high profile in the world of fashion for many years.\nprofile verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈproʊ·fɑɪl/\nGilbert was recently profiled by a Washington business magazine.\nAdd to word list\nAdd to word list\na short description of someone or something that gives important and useful details about them: a profile of sb/sth The website lists more than 1,000 profiles of small companies. A recruiting firm can view the candidate profiles, but candidates' identities are protected until a job offer appears.a credit/financial profile Homes are sold at higher interest rates to consumers with riskier credit profiles.\nthe amount of public attention that something or someone receives: The company's high profile helped them receive close to $10 million in state and local incentives. The Federation of Master Builders has been working to raise its profile.\nkeep a low profile\nto avoid attracting attention to yourself: The company has tried to keep a low profile since the controversy.\nSee also\nage profile\ncustomer profile\ndemographic profile\nhigh-profile\nlow-profile\nrisk profile\nto give a short description of someone or something with important and useful details about them: In her new report she profiles companies with real profits and proven business models.profile sb/sth in/on sth A number of businesswomen are profiled on the careers website."}