{"id":292213,"name":"programme","type":"noun","us_sound":"ˈproʊ.ɡræm","us_link":"../audio/p/program.mp3","uk_sound":"ˈprəʊ.ɡræm","uk_link":"../audio/p/ukprofi026.mp3","content":"programme noun [C]\n(BROADCAST)\nAdd to word list\nAdd to word list\nA2 a broadcast on television or radio: It's one of those arts programmes late at night. It's my favourite TV programme - I never miss an episode.\nMore examplesFewer examplesI heard a really interesting programme on the radio this morning.This programme's boring - shall I turn over to BBC?A new series of wildlife programmes has started on Monday evenings.Most children's television programmes aim to educate and entertain at the same time.Our special guest on the programme tonight is Robert de Niro.\nSMART Vocabulary: related words and phrases\nBroadcasting: programmes & other broadcasts\naction replay\nbinge-watch\nblooper\nbreakfast television\nbreaking news\ncommentary\nfiller\nfly on the wall idiom\ngame show\nGod slot\ngreen screen\nprocedural\nreality show\nreality TV\nrerun\nrom com\nsketch\nsoap\nsyndicate\nvox pop\nSee more results »\nprogramme noun [C]\n(BOOK)\na thin book or piece of paper giving information about a play or musical or sports event, usually bought at the theatre or place where the event happens: I looked in the programme to find out the actor's name. He collected football programmes.\nwhitemay/E+/GettyImages\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nprogramme noun [C]\n(PLAN)\nB2 a plan of activities to be done or things to be achieved: The school offers an exciting and varied programme of social events. The rail system is to put 20 million pounds into its modernization programme. I'm running three mornings a week - it's all part of my fitness programme.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\njournal\npack\nschedule\nscheduled\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nstagger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlans and arrangements\nIdiom\nget with the programme\nto tell a device or system to operate in a particular way or at a particular time: I've programmed the heating to come on at 6.00. be programmed to do something\nto always do or think a particular thing, although you do not try to: I'm programmed to wake up at seven.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual behaviour\nAdd to word list\nAdd to word list\nGOVERNMENT, MANAGEMENT an officially organized system of services, activities, or opportunities that help people achieve something: There is no graduate training programme for new recruits.a programme to do sth Housing Market Renewal is a programme to deal with low demand in housing areas. a building/development/research programme build/develop/finance a programme launch/carry out/initiate a programme\nCOMMUNICATIONS a broadcast on television or radio: watch/see a programme Did you see that new programme last night?a television/TV/radio programme There aren't too many TV programmes worth watching right now.a news/reality/history programme We listened to a news programme on the BBC World Service.broadcast/show a programme (about sth) They're always showing programmes about nasty people doing nasty things to each other.a programme on sth We listened to a new programme on Radio 4.\na planned series of related events or activities: A programme of meetings has been planned for October and November. organize/set up/plan a programme\nCompare\nprogramSee also\nchange programme\nemployee assistance programme\nemployee referral programme\nto plan for activities to be done or things to be achieved: be programmed for sth This project is programmed for completion in April.\nto write a series of instructions, using a computer language, to create or run a computer program: programme sth to do sth Computers have been programmed to unlock apartment doors or slow trains in the event of an earthquake.\nIT to use a piece of software to give instructions to a computer or piece of electronic equipment to make it perform one of a range of tasks: programme sth to do sth You can programme the DVD player to switch itself off.\nCompare\nprogram"}