{"id":292226,"name":"progress","type":"noun","us_sound":"ˈprɑː.ɡres","us_link":"../audio/p/eus73737.mp3","uk_sound":"ˈprəʊ.ɡres","uk_link":"../audio/p/ukprofi029.mp3","content":"Add to word list\nAdd to word list\nB1 movement to an improved or more developed state, or to a forward position: Technological progress has been so rapid over the last few years. I'm not making much progress with my Spanish. The doctor said that she was making good progress (= getting better after a medical operation or illness). The recent free elections mark the next step in the country's progress towards democracy. The yacht's crew said that they were making relatively slow progress. in progress B2 formal\nhappening or being done now: Repair work is in progress on the south-bound lane of the motorway and will continue until June.\nSee more\nMore examplesFewer examplesWe're making slow but steady progress with the decorating.The doctor will call next week to check on your progress.Alex is just plodding along at school, making very little progress.I have to report to my boss on progress every Friday.We need some sort of graph on which we can chart our progress.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\npunctuated equilibrium\nrebuild\nregenerate\nripen\nripeness\nspread\nSee more results »\nGrammar\nProgressProgress is an uncountable noun. We most commonly use it with the verb make: …\nB2 [ I ] to improve or develop in skills, knowledge, etc.: My Spanish never really progressed beyond the stage of being able to order drinks at the bar. Compare\nregress (RETURN TO WORSE STATE) formal\nC2 [ I ] to continue gradually: As the war progressed, more and more countries became involved. We started off talking about the weather and gradually the conversation progressed to politics.\nT to move something to a more advanced or developed state: I decided to do a postgraduate course because it's a good way to progress your career. I am anxious to progress discussions on the two projects as soon as possible.\n[ I ] to move forward: As you progress up the valley, views open up. There were no signs indicating that workers should not progress beyond that point.\nMore examplesFewer examplesAs his illness progressed, he made fewer entries in his diary.The building project is progressing well.Unfortunately this is a disease which progresses very rapidly.Whenever I talk to him we never seem to progress beyond the weather and holidays.He started as an apprentice but quickly progressed to foreman.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\npunctuated equilibrium\nrebuild\nregenerate\nripen\nripeness\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\nAdvancing and moving forward\nAdd to word list\nAdd to word list\nmovement toward an improved or more developed state, or to a forward position: The talks failed to make any progress toward a settlement. in progress\nIf something is in progress, it is happening or being done now: The construction work is already in progress.\nto move toward an improved or more developed state, or to a forward position: Construction is progressing well. As the game progressed I was bouncing in my chair. progression noun [ U ] us\nYour browser doesn't support HTML5 audio\n/prəˈɡreʃ·ən/\nThe show examines one woman’s progression from youth to old age.\nAdd to word list\nAdd to word list\nthe process of changing or developing towards an improved situation or condition: The managers were very pleased with the team's progress. \"We're addressing the problem,\" he said, \"and I think we're making progress.\"progress on sth We are making progress on improving our core business. \"There is no doubt we are making progress towards the goal,\" said Ford's CEO.\nto develop or change to an improved situation or condition: As things progressed in my career, I realized that starting my own company was a possibility.progress toward(s)/to sth We are progressing toward more significant environmental legislation.progress beyond sth The online auction company has failed to progress beyond a market share of 30% in Switzerland.progress rapidly/quickly/steadily She progressed steadily through the ranks to upper management. See also\nprogress payment\nprogress report"}