{"id":292196,"name":"program","type":"noun","us_sound":"ˈproʊ.ɡræm","us_link":"../audio/p/program.mp3","uk_sound":"ˈprəʊ.ɡræm","uk_link":"../audio/p/ukprofi026.mp3","content":"Add to word list\nAdd to word list\nA2 a series of instructions that can be put into a computer in order to make it perform an operation: a computer program She's written a program to find words that frequently occur together.\nA2 US and Australian English spelling of\nprogramme UK\nMore examplesFewer examplesThere is still a lot of software that comes without an uninstall program.My computer has a program which corrects my spelling.Double-click on the icon to start the program.Many software companies have adapted popular programs to the new operating system.The system came bundled with a word processor, spreadsheet and graphics program.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nBroadcasting: programmes & other broadcasts\nto write a series of instructions that make a computer perform a particular operation: [ + to infinitive ] She programmed the computer to calculate the rate of exchange in twelve currencies.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nprogram noun [C]\n(ACTIVITIES)\nAdd to word list\nAdd to word list\na group of activities or things to be achieved: a training program the university basketball program a pilot recycling program\nprogram noun [C]\n(BROADCAST)\na broadcast or series of broadcasts on television or radio: What’s your favorite program?\nprogram noun [C]\n(COMPUTER)\na series of instructions that make a computer perform an operation: a word processing program\nprogram noun [C]\n(THIN BOOK)\na thin book or piece of paper giving information about a play or musical or sports event\nprogram verb [T]\n(COMPUTER)\nto instruct a computerized device or system to operate in a particular way or at a particular time: The CD player can be programmed to play the songs in any order. programmable adjective us\nYour browser doesn't support HTML5 audio\n/ˈproʊˌɡræm·ə·bəl/\na programmable thermostat\nAdd to word list\nAdd to word list\nIT\n&#160; (also computer program) a series of instructions put into a computer so that it does particular tasks: load/download a program The service will prompt you to download the appropriate program.install/uninstall a program When I try to install a program, I get an error message.design/develop/write a program The company is trying to develop a program that will predict terrorist acts.run/execute/use a program The command allows computer users to run a program with administrator rights.\nGOVERNMENT, MANAGEMENT\n&#160; US (UK programme) an officially organized system of services, activities, or opportunities that help people achieve something: a government/state program The governor proposed a state $500 million program to build new schools.a health insurance/product-development/construction program The tax funds health insurance programs for the working poor. We had to end the bonus program for non-executive staff.a program to do sth A financial advisor analyzes clients' finances and prepares personalized programs to meet objectives. build/develop/finance a program launch/initiate a program Compare\nscheme noun\nUS (UK programme) a course of study, especially at a college or university: 20 years ago there were only two women in our program.Business/Nursing/Management program Ms. Boothe will enter the college's Business program next year.a Master's/graduate program The university has 40 different graduate programs.\nUS (UK programme) a planned series of related events or activities: A program of meetings has been planned for October and November. organize/set up/plan a program\nCOMMUNICATIONS\n&#160; US (UK programme) a television or radio show: On today's program, we'll have an interview with Bill Gates. Compare\nprogramme noun\nIT to write a series of instructions, using a computer language, to create or run a computer program: program sth to do sth They programmed the computer to predict future discoveries.\nIT\n&#160; (UK also programme) to use a piece of software to give instructions to a computer or piece of electronic equipment to make it perform one of a range of tasks: program sth to do sth You can use a Pocket PC or cell phone to program your DVR, grab MP3s you've already downloaded, and get stock quotes or weather reports. Compare\nprogramme verb"}