{"id":292240,"name":"progressive","type":"adjective","us_sound":"prəˈɡres.ɪv","us_link":"../audio/p/progressive.mp3","uk_sound":"prəˈɡres.ɪv","uk_link":"../audio/p/ukprogr002.mp3","content":"progressive adjective\n(GRADUAL)\nAdd to word list\nAdd to word list\nC1 developing or happening gradually: There's been a progressive decline in the standard of living over the past few years.\nThesaurus: synonyms, antonyms, and examples\nslowslowYou're so slow - hurry up!leisurelyWe took a leisurely drive along the quiet coast road.unhurriedI like the unhurried pace of life in the countryside.gentleStart off with a gentle jog, then gradually increase your speed.\nSee more results »\nMore examplesFewer examplesSummerhill school is noted for its progressive policies.The last few months have seen the progressive meltdown of the country's political system.The progressive form is often referred to as the continuous form of the verb.We are currently witnessing a progressive decline in the number of students entering higher education.The area has suffered a progressive reduction in house prices.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolve\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\njourney\nmature\nprogressively\npunctuated equilibrium\nrebuild\nregenerate\nripen\nspread\nSee more results »\nprogressive adjective\n(DISEASE)\nmedical\n&#160; specialized A progressive medical condition continues to develop, or gradually becomes worse or more serious. : Alzheimer's disease is a progressive brain condition. He was diagnosed with syringomyelia, a disease of the spinal cord that results in progressive weakening of the body. Compare\nnon-progressive (OF DISEASE)\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\nindustrial disease\ninfantile\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nprogressive adjective\n(MODERN)\nB2 Progressive ideas or systems are new and modern, encouraging change in society or in the way that things are done: progressive ideas/attitudes The left of the party is pressing for a more progressive social policy. a progressive school\nThesaurus: synonyms, antonyms, and examples\nmodernmodernThe building was made using modern construction techniques.up to dateThe hospital has some of the most up-to-date equipment in the country.latestShe always wears the latest fashions.cutting-edgeComputers have brought cutting-edge technology into the classroom.high-techDivers with high-tech equipment discovered the wreck of the ship.\nSee more results »\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\npeacock\nshabby chic\nsleekly\nsleekness\nsmartly\nthe avant-garde\nultra-modern\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nà la mode\nSee more results »\nprogressive adjective\n(TAX)\nfinance &amp; economics A progressive tax system is one in which the rate of tax is higher on larger amounts of money.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\nthe taxman\ntithe\ntop rate\nunprogressive\nSee more results »\nprogressive adjective\n(GRAMMAR)\nlanguage The progressive form of a verb is used to show that the action is continuing. It is formed with the verb \"be\" followed by the present participle (= -ing form of the verb): \"He's working hard at the moment\" is an example of the present progressive form of the verb \"work\". \"I was eating when the phone rang\" is an example of the past progressive.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nprogressive adjective\n(GLASSES)\nUS (UK varifocal) used to describe a lens (= a curved piece of glass) that allows you to see things clearly at different distances: Progressive lenses provide vision correction for both near and distance prescriptions, but in a single lens. They sell many types of glasses: rimless, progressive, tinted and so on.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »\nprogressive noun [C]\n(POLITICS)\npolitics a person who supports new ideas and social change, especially one who belongs to a political party Compare\nreactionary\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nprogressive noun [C]\n(GLASSES)\nprogressives [ plural ] US (UK varifocals)\nglasses with special lenses that let you see things clearly at different distances: Are those glasses progressives?\nSee more\nAdd to word list\nAdd to word list\nA progressive disease is one that gets increasingly worse.\nProgressive ideas or systems encourage change in society or in the way things are done: She worked for women’s rights, labor reforms, and other progressive causes. progressively adverb us\nYour browser doesn't support HTML5 audio\n/prəˈɡres·ɪv·li/\nMy eyesight has gotten progressively worse over the years.\nAdd to word list\nAdd to word list\ndeveloping or happening gradually: There's been a progressive decline in the standard of living over the last decade. Lomax promised 'a progressive return to our underlying growth rate' of 20% a year.\nMANAGEMENT, POLITICS used to describe ideas or systems that are new and modern, and that encourage change and development: We're looking for progressive ideas to move the company forward. progressive management practices The company leadership has politically progressive views.\nECONOMICS, TAX used to describe an economic system in which more advantages, especially tax advantages, are given to people with less money than to people with more money: The party says it will introduce a more progressive Budget.\nCompare\nregressive"}