{"id":292257,"name":"prohibiting","type":"verb","us_sound":"prəˈhɪb.ɪt","us_link":"../audio/p/prohibit.mp3","uk_sound":"prəˈhɪb.ɪt","uk_link":"../audio/p/ukprogr004.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nprohibit\nB2 [ T often passive ] to officially refuse to allow something: Motor vehicles are prohibited from driving in the town centre. The government introduced a law prohibiting tobacco advertisements on TV. Parking is strictly prohibited between these gates.\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\n[ T ] to prevent a particular activity by making it impossible: The loudness of the music prohibits serious conversation in most nightclubs.\nThesaurus: synonyms, antonyms, and examples\nto prevent something from happeningpreventVaccination will prevent the spread of the disease.avoidLabel the boxes to avoid confusion.stopThis should stop any further trouble.avertWe had to act quickly to avert disaster.prohibitBehavioural problems in the classroom prohibit learning.checkChildren are being vaccinated in an attempt to check the spread of the disease.\nSee more results »\nMore examplesFewer examplesIntermarriage between close relatives is prohibited in most societies.Smoking is prohibited in the building.A law has recently been passed prohibiting the consumption of alcohol in public places.The government prohibits the passage of foreign troops and planes across its territory.The law specifically prohibits acts of this kind.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nunsanctioned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: legislation & law-making\nPreventing and impeding"}