{"id":292305,"name":"projection","type":"noun","us_sound":"prəˈdʒek.ʃən","us_link":"../audio/p/projection.mp3","uk_sound":"prəˈdʒek.ʃən","uk_link":"../audio/p/ukprogr012.mp3","content":"projection noun\n(CALCULATION)\nAdd to word list\nAdd to word list\nC1 [ C ] a calculation or guess about the future based on information that you have: The company has failed to achieve last year's sales projections by 30 percent. Spending was well below projections.\nSMART Vocabulary: related words and phrases\nPredicting things and intuition\naugur\naugury\nbellwether\nbetcha\nbode\nhunch\ninkling\ninstinct\nintuit\nintuition\npremonitory\npresage\nprescience\nprescient\npresciently\nthe writing is on the wall idiom\nthere's no knowing/telling/saying idiom\nunforeseeable\nunintuitively\nunreasoning\nSee more results »\nprojection noun\n(IMAGE)\nC1 [ C or U ] the act of projecting a film or an image onto a screen or wall, or the film or image itself: A few chairs and rear projections supplied the scene.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nprojection noun\n(STICKING OUT)\n[ C ] something that projects from a surface or above the edge of something\nSMART Vocabulary: related words and phrases\nProtruding and sticking out\nbeetling\nbristly\nbug out\nbulbous\nbulge\njutting\nledge\nlug\nmale\noutcrop\noverhang\noverhanging\npeek\nproject\nprotrusion\nprotuberant\nproud\nstick\nstick out\nstick up\nSee more results »\nprojection noun\n(GEOMETRY)\n[ C ]\n&#160; art, architecture, mathematics\n&#160; specialized a drawing or image that represents a line, figure, or solid shown on a particular plane (= a flat or level surface that continues in all directions): CT scans can be reformatted in multiple projections, regardless of the original plane of scanning.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTables, graphs & diagrams\nprojection noun\n(PSYCHOLOGY)\n[ C or U ]\n&#160; psychology\n&#160; specialized the act of imagining that someone else feels a particular emotion or wants something when in fact it is you who feels this way; an example of this act: Projection is where you see in others what is really within yourself. The relative's negativity toward the patient involves a projection of the relative's own feelings of vulnerability from previous personal distress.\n[ C or U ]\n&#160; psychology\n&#160; specialized the act of expressing your feelings and wishes; an example of this act: the projection of repressed feelings The things we think we see objectively are really projections of our emotions, memories, and thoughts.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nJungian\nOedipus complex\npost-Freudian\npreconscious\nprofiler\nprojective\nprojectively\npsychiatric\npsychic\npsychologist\nstraitjacket\nsuperego\nunconscious\nSee more results »\nprojection noun [C]\n(CALCULATION)\nAdd to word list\nAdd to word list\nan amount or result expected in the future that is calculated from information already known: Sales projections made last year were too optimistic.\nprojection noun [C]\n(STICKING OUT)\nsomething that sticks out beyond the edge of something to which it is attached: It was a strange-looking house, with little projections off the sides.\nprojection noun [C]\n(IMAGE)\na picture that is made to appear on a surface, esp. by a special device for showing movies or other images on a screen or other surface: [ C ] A projection of his face appeared on the back wall.\nAdd to word list\nAdd to word list\na calculation or guess about the future based on information that you have: The strong sales caused the company to boost its industry sales projection for the year.a projection for sth The company's global projections for the year indicated that it would soon be the world's largest car company. It was too early to start making specific projections about plans or projects he would like to undertake. It revised revenue projections for the remainder of the financial year. Maguire believed that the growth projections used for marketing purposes were not achievable. budget/earnings/financial projections The President bragged that his push has resulted in 825,000 new jobs, more than 30% ahead of even the government's optimistic projections."}