{"id":292297,"name":"project","type":"noun","us_sound":"ˈprɑː.dʒekt","us_link":"../audio/p/project_01_00.mp3","uk_sound":"ˈprɒdʒ.ekt","uk_link":"../audio/p/ukprogr008.mp3","content":"Add to word list\nAdd to word list\nB2 a piece of planned work or an activity that is finished over a period of time and intended to achieve a particular purpose: the Kings Cross housing project a scientific research project Her latest project is a film based on the life of a 19th-century music hall star. My next project is decorating the kitchen.\nA2 a study of a particular subject done over a period of time, especially by students: He's doing a class project on pollution. In our third year at college everyone had to do a special project.\nMore examplesFewer examplesThe government has given the go-ahead for a multi-billion-pound road-building project.The cost of the project has increased dramatically since it began.A large portion of the company's profit goes straight back into new projects.Has she had any experience of managing large projects?I want to thank you all for the time and energy you have put into this project, and for your part in making it such a success.\nSMART Vocabulary: related words and phrases\nPlans and arrangements\naccommodation\nappointed\narrangement\narranger\nbackstop\nblueprint\ncounter-strategy\ncounter-tactic\ndesign\ndone\nexit strategy\nmaster plan\nnon-programme\npackage deal\nparty line\nplan of action\nplanning\npolicy\nTBA\nwalk-in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nproject verb\n(CALCULATE)\n[ T usually passive ] to calculate an amount or number expected in the future from information already known: [ + to infinitive ] Government spending is projected to rise by three percent next year.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nproject verb\n(THROW)\n[ T ] to throw or direct something forwards, with force: 90 percent of the projected missiles will hit their target. project your voice\nto sing or speak loudly and clearly: It's a big theatre so you really have to project your voice if you're going to be heard at the back.\nSee more\nSMART Vocabulary: related words and phrases\nThrowing\narm\ncast\nflick\nfling\nheave\nhurl\noutpitch\noverhand\npeg\npelt\nsling\nstone\nthread\nthrow\nthrow something in\ntoss\nunderarm\nunderhand\nwang\nwhang\nSee more results »\nproject verb\n(MAKE AN IMAGE)\n[ T ] to cause a film, image, or light to appear on a screen or other surface: Laser images were projected onto a screen.\n[ T ]\n&#160; psychology\n&#160; specialized to wrongly imagine that someone else is feeling a particular emotion or desire when in fact it is you who feels this way: I suspect he's projecting his fears onto you.\n[ T ] If you project a particular quality, that quality is what most people notice about you: Recently the president has sought to project a much tougher image.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nEmpathy and sensitivity\nShowing and demonstrating\nproject verb\n(STICK OUT)\n[ I + adv/prep ] to stick out over an edge or from a surface: The hotel dining room projects out over the water.\nSMART Vocabulary: related words and phrases\nProtruding and sticking out\nbeetling\nbristly\nbug out\nbulbous\nbulge\njutting\nledge\nlug\nmale\noutcrop\noverhang\noverhanging\npeek\nprojection\nprotrusion\nprotuberant\nproud\nstick\nstick out\nstick up\nSee more results »\nproject noun\n(PIECE OF WORK)\nAdd to word list\nAdd to word list\n[ C ] a piece of planned work or activity that is completed over a period of time and intended to achieve a particular aim: a research project construction projects Painting the bedroom is Steve’s next project.\nproject noun\n(BUILDING)\n[ C usually pl ] a housing project Idiom\nproject an image\nproject verb\n(CALCULATE)\n[ T ] to calculate an amount or result expected in the future from information already known: The hotels are projecting big profits. [ + (that) clause ] They project (that) 31 billion people will watch the World Cup.\nproject verb\n(STICK OUT)\n[ I ] to stick out beyond the edge of something: The hotel dining room projects (out) over the water.\nproject verb\n(MAKE AN IMAGE)\n[ T ] to cause a picture or light to appear on a surface: We don’t have a screen but we can project the slides onto the back wall.\nproject verb\n(THROW)\n[ T ] to throw something forward or into the air: The device allows you to scoop up a ball and project it some 140 feet.\n[ T ] To project is also to speak or sing loudly and clearly: Singers are used to projecting their voices.\nIdiom\nproject an image\nAdd to word list\nAdd to word list\na piece of planned work or an activity which is done over a period of time and intended to achieve a particular purpose: The date for starting the project will be set once financing is completed.set up/launch a project They set up the research project with help from the university.fund/pay for/finance a project Two local businesses funded the project. manage/run a project complete/finish a project a joint/large/major project a building/construction/development project See also\ncapital project\ngreenfield project\nECONOMICS, FINANCE to calculate an amount or number expected in the future from information already known: The amount was less than we had projected. The state is projecting a $275 million shortfall for the rest of the fiscal year.be projected (to do sth) Growth rate is projected for five years. The deficit is projected to rise to $17 million next year. The project controller said the highway was currently seeing between 20,000 and 24,000 vehicles a day, fewer than the 26,000 originally projected. The review projects that gas could end up accounting for more than 50% of generating supply by 2020.\nto plan for sth to happen or expect sth to happen: be projected to do sth The work is projected to start in November.\nto make other people see or feel a particular quality or idea in the way you behave: The candidate projects supreme confidence in his own views and abilities. He was told that arriving in his Rolls-Royce might project the wrong image .\nCOMMUNICATIONS to cause an image to appear on a screen or surface using a projector: project sth on/onto sth The digital video will be projected on a huge I-MAX screen."}