{"id":292311,"name":"projectively","type":"adverb","us_sound":"prəˈdʒek.tɪv.li","us_link":"../audio/p/cdo0623usproj3149.mp3","uk_sound":"prəˈdʒek.tɪv.li","uk_link":"../audio/p/cdo0623ukproj3171.mp3","content":"projectively adverb\n(GEOMETRY)\nAdd to word list\nAdd to word list\nmathematics , architecture\n&#160; specialized in a way that relates to or involves the way a line, figure, or solid is shown on a given plane (= a flat or level surface that continues in all directions): Assume that T (and therefore Q) is projectively connected, with Q compact. When two connections are projectively equivalent, their corresponding curves have identical shapes.\nMore examplesFewer examplesWe now turn to an analogous sufficient condition for the projectively convex matrix A to be dominant.\nprojectively adverb\n(PSYCHOLOGY)\npsychology\n&#160; specialized in a way that relates to or involves projection (= the act of imagining that someone else feels a particular emotion or wants something when in fact it is you who feels this way): It was her husband's passivity that she projectively hated most, because it was the part of herself she had most strongly repressed. They responded to the story projectively, with something similar to envy.\npsychology\n&#160; specialized in a way that relates to or involves projection (= the act of encouraging someone to express their feelings and desires): The drawings are used projectively as a way of identifying the issues. These psychological tests are usually scored either objectively or projectively.\nMore examplesFewer examplesThey projectively expect the other participants to share their false interpretation.People tend to form expectations projectively: they think that others are likely to choose the method they themselves prefer.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nFreudian\nJungian\npost-Freudian\npreconscious\nprofiler\nprojective\npsych\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nRelated word\nprojection"}