{"id":292624,"name":"promotion","type":"noun","us_sound":"prəˈmoʊ.ʃən","us_link":"../audio/p/promotion.mp3","uk_sound":"prəˈməʊ.ʃən","uk_link":"../audio/p/ukpromi014.mp3","content":"promotion noun\n(ENCOURAGE)\nAdd to word list\nAdd to word list\nB2 [ C or U ] activities to advertise something: a sales promotion There was a promotion in the supermarket and they were giving away free glasses of wine. Obviously as sales manager he'll be very involved in the promotion and marketing of the product.\nC1 [ U ] the act of encouraging something to happen or develop: the promotion of a healthy lifestyle\nMore examplesFewer examplesthe promotion of increased ecological awarenessa spring sales promotion\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\npromotion noun\n(RAISE)\nB2 [ C or U ] the act of raising someone to a higher or more important position or rank: Did Steve get/Was Steve given the promotion he wanted? The job offers excellent promotion prospects.\n[ U, C or U ] mainly UK If a sports team wins promotion, it moves to a higher division at the end of the season: River Plate's win last night has considerably increased their chances of promotion this season.\nMore examplesFewer examplesHer resignation has improved my chances of promotion.If you really want the promotion, you'll have to be more assertive.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromote\nreinstall\nreinstallation\nrelegate\nsecondment\nsticky floor\nsubordinate\nvault\nwilderness\nSee more results »\npromotion noun [C/U]\n(ADVANCE)\nAdd to word list\nAdd to word list\nthe advancement of someone to a more important rank or position: [ C/U ] She’s been recommended for a promotion.\npromotion noun [C/U]\n(ADVERTISEMENT)\nadvertising intended to increase the sales of a product or service\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; HR, WORKPLACE the process or fact of giving someone a higher or more important job: Employees worry that saying 'no' to the boss decreases their chances of advancement and promotion.get/receive a promotion Does working longer hours increase your chances of getting a promotion? She was recommended for promotion by her manager. The study showed that obese employees were repeatedly passed over for promotion. He was seen by management as a troublemaker rather than a candidate for promotion.\n[ C or U ]\n&#160; MARKETING\n&#160; (also product promotion) an advertisement, event, or other activity used to advertise a product or service, or the use of these advertisements, events, etc.: The supermarket has said it will extend the promotion for another week. The chain chose to concentrate very heavily on in-store promotions. We do product promotions using text messages. Heavy promotion of the country as a tourist destination has brought significant growth in the industry.\npromotions [ U ]\nMARKETING the activity of advertising products and services, or a department of a company that does this work: She found a dream job as director of publicity and promotions for a record company in St. Paul. His book can help your company decide how many dollars should be spent in promotions.\n[ U ] the activity of encouraging something to happen or develop: the promotion of sth These legislative developments will contribute to the promotion of foreign investment. Direct government promotion played a primary role in the development of e-commerce. He worked in a trade promotion unit in the federal Commerce Department. See also\ncross-promotion\nconsumer promotion\nsales promotion"}