{"id":292617,"name":"promote","type":"verb","us_sound":"prəˈmoʊt","us_link":"../audio/p/promote.mp3","uk_sound":"prəˈməʊt","uk_link":"../audio/p/ukpromi012.mp3","content":"promote verb\n(ENCOURAGE)\nAdd to word list\nAdd to word list\nB2 [ T ] to encourage people to like, buy, use, do, or support something: Advertising companies are always having to think up new ways to promote products. The Institute is intended to promote an understanding of the politics and culture of the Arab world. Greenpeace works to promote awareness of the dangers that threaten our planet today. It has long been known that regular exercise promotes all-round good health.\nMore examplesFewer examplesThe government should be playing a more prominent role in promoting human rights.The organization is working with young people to promote awareness of the dangers of unprotected sex.The band are currently touring to promote their new album.The city is trying to lose its industrial image and promote itself as a tourist centre.Cutting the bush back in the autumn will help promote growth in the spring.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\npromote verb\n(RAISE)\nB1 [ T often passive ] to raise someone to a higher or more important position or rank: If I'm not promoted within the next two years, I'm going to change jobs. She's just been promoted to senior sales rep. Opposite\ndemote\n[ T ] UK to move a sports team to a higher group: If Coventry City win this match, they'll be promoted to the Premier League.\n[ T often passive ] US If a student is promoted, he or she goes up to the next level in school.\nMore examplesFewer examplesIt is my considered opinion that he should be promoted.He's deluding himself if he thinks he's going to be promoted this year.She was very demotivated by being told she had little chance of being promoted.What's her official designation now she's been promoted?She has been promoted from deputy manager to senior manager.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nsticky floor\nsubordinate\nvault\nwilderness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nSchools in general\npromote verb [T]\n(ADVERTISE)\nAdd to word list\nAdd to word list\nto advertise something in order to sell it: The new model cars are being heavily promoted on television.\npromote verb [T]\n(ENCOURAGE)\nto encourage or support something, or to help something become successful: A new campaign has been launched to promote safe driving.\npromote verb [T]\n(ADVANCE)\nto advance someone to a more important rank or position: She was promoted to division manager last year.\nA student who is promoted advances to the next grade (= level of schooling).\nAdd to word list\nAdd to word list\nMARKETING to encourage people to buy or want something, through advertising, offers of lower prices, special events, etc.: Marks was there promoting his new book. The vaccine is being heavily promoted by its maker. The guide has been designed to promote sales of their financial products. Compare\nadvertise\nGOVERNMENT, COMMERCE, ECONOMICS to encourage the existence or development of something: promote growth/business/development promote efficiency/innovation promote trade/competition promote democracy/diversity\nHR, WORKPLACE to give someone a higher or more important job or rank: Before being promoted, she worked as a senior manager for 15 years.promote sb to sth In August, he was promoted to the homicide division.\nSTOCK MARKET to start listing (= giving the price of) a company's shares on a more important stock index (= system that shows changes of the average prices of shares on a particular stock market): promote sth to sth All eight companies are to be promoted to the FTSE 100 index."}