{"id":292552,"name":"prominent","type":"adjective","us_sound":"ˈprɑː.mə.nənt","us_link":"../audio/p/eus75887.mp3","uk_sound":"ˈprɒm.ɪ.nənt","uk_link":"../audio/p/ukpromi001.mp3","content":"prominent adjective\n(FAMOUS)\nAdd to word list\nAdd to word list\nC1 very well known and important: a prominent Democrat a prominent member of the Saudi royal family The government should be playing a more prominent role in promoting human rights.\nThesaurus: synonyms, antonyms, and examples\nknown and recognized by many peoplefamousShe went from poor and anonymous to rich and famous.well knownShe's a well-known artist.renownedThe area is renowned for its beauty.world-famousThey stayed in a world-famous hotel.celebratedHe's a celebrated writer of children's stories.legendaryHe once met the legendary singer, Eartha Kitt.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nMore examplesFewer examplesIt's worrying that such a prominent politician is so easily led.She is likely to play a prominent part in the forthcoming election campaign.Lady Thatcher remained a prominent political figure.\nSMART Vocabulary: related words and phrases\nFame and famous\nA-list\nA-lister\nacclaimed\nannal\nanyone\ncatapult\nfore\ngo down in the annals idiom\nhigh-profile\nhit the headlines idiom\nhousehold word\nlegend\nmarquee\nname\nnotoriety\nnotorious\nnotoriously\nworld-famous\nworld-renowned\nZ-list\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVery important or urgent\nprominent adjective\n(NOTICEABLE)\nsticking out from a surface: She has a prominent chin/nose.\nC2 Something that is in a prominent position can easily be seen or noticed: New books are displayed in a prominent position on tables at the front of the store.\nMore examplesFewer examplesThe shop front occupies a very prominent position on the main street.His photo stood in a prominent place on her desk.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVisible\nRelated word\nprominently\nAdd to word list\nAdd to word list\nvery noticeable, important, or famous: She plays a prominent role in the organization.\nIf something is prominent, it sticks out from a surface or can be seen easily: She has a prominent chin/nose. prominence noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈprɑm·ə·nəns/\nDespite his prominence, he was never able to make a living. prominently adverb us\nYour browser doesn't support HTML5 audio\n/ˈprɑm·ə·nənt·li/\nprominently displayed pictures"}