{"id":292564,"name":"promised","type":"verb","us_sound":"ˈprɑː.mɪs","us_link":"../audio/p/promise.mp3","uk_sound":"ˈprɒm.ɪs","uk_link":"../audio/p/ukpromi006.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npromise\npromise verb\n(SAY CERTAINLY)\nB1 [ I or T ] to tell someone that you will certainly do something: [ + to infinitive ] He promised faithfully to call me every week. [ + that ] The government have promised that they'll reduce taxes. [ + (that) ] Promise me (that) you won't tell him. I'll look for some while I'm at the shops but I'm not promising anything. Can I have that book back when you've finished because I've promised it (= I have said I will give it) to Sara. [ + two objects ] Her parents promised her a new car if she passed her exams. I've promised myself a long bath when I get through all this work. [ + speech ] \"I'll come round and see you every day,\" she promised. \"I won't do anything dangerous.\" \"You promise?\" \"I promise.\" \"I won't have time to take you shopping this afternoon.\" \"But you promised!\"\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nMore examplesFewer examples\"But listen, you must promise never to tell anyone.\" \"I promise.\"You have to stand up in court and promise to tell 'the truth, the whole truth and nothing but the truth'.I gave him my number and he promised to call me.I promised the babysitter that we'd be home by midnight.She's been promising to pay back the money for six months, but I reckon she's just stringing me along.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncommitment\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nSee more results »\npromise verb\n(BE EXPECTED)\npromise to be good, exciting, etc.\nB2 If something promises to be good, exciting, etc. it is expected to be good, exciting, etc.: It promises to be a really exciting game.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nGrammar\nPromisePromise is a noun and a verb. …\nIdiom\npromise someone the earth/moon"}