{"id":292553,"name":"prominently","type":"adverb","us_sound":"ˈprɑː.mə.nənt.li","us_link":"../audio/p/prominently.mp3","uk_sound":"ˈprɒm.ɪ.nənt.li","uk_link":"../audio/p/ukpromi002.mp3","content":"prominently adverb\n(EASILY SEEN)\nAdd to word list\nAdd to word list\nin a way that can easily be seen or noticed: A photograph of her daughter was prominently displayed on her desk. The newspaper featured the apology prominently on page 1.\nin a way that sticks out from a surface: I left the book lying around with a bookmark protruding prominently from the last chapter.\nMore examplesFewer examplesAll dentists will have to prominently display price lists and details of what services are available outside their surgery. Having spelling mistakes and typos highlighted so prominently is distracting to the reader.All ready-to-eat food should be prominently labelled with its calorie content.Veins stood out prominently on his forehead.\nSMART Vocabulary: related words and phrases\nVisible\ndiscernibly\nfront and centre\nfull\ngoldfish bowl\nhigh-visibility\nintervisibility\nlarge\nnoticeable\nout\nperceivable\nperceivably\nprominent\nrelief\nshow\nsore\nsplash\nstand\nstick out\nvisibility\nvisualize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApparent and obvious\nGeometry: describing angles, lines & orientations\nprominently adverb\n(IMPORTANTLY)\nin a way that is important; to a large extent: Both players feature prominently in the England team. Economic problems have figured prominently in the election.\nMore examplesFewer examplesWhen I interviewed him, he emphasised that he did not want his religious beliefs to feature prominently.The fact that the population is ageing has not factored prominently enough in debates about health funding.I wanted to know more about her after reading this powerful story in which she figures so prominently. Since before the fight for suffrage, women have been prominently involved in political protests.\nSMART Vocabulary: related words and phrases\nImportant and essential things\n-based\namenity\nbare\nbe-all\nbig league\nflagship\nfocal point\nfundament\ngrandaddy\nheavyweight\nhot button\nimperative\nneed\nnexus\nnub\nnucleus\npivot\nprecondition\nthe grandaddy of something idiom\nthe name of the game idiom\nSee more results »\nRelated word\nprominent"}