{"id":292618,"name":"promoted","type":"verb","us_sound":"prəˈmoʊt","us_link":"../audio/p/promote.mp3","uk_sound":"prəˈməʊt","uk_link":"../audio/p/ukpromi012.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\npromote\npromote verb\n(ENCOURAGE)\nB2 [ T ] to encourage people to like, buy, use, do, or support something: Advertising companies are always having to think up new ways to promote products. The Institute is intended to promote an understanding of the politics and culture of the Arab world. Greenpeace works to promote awareness of the dangers that threaten our planet today. It has long been known that regular exercise promotes all-round good health.\nMore examplesFewer examplesThe government should be playing a more prominent role in promoting human rights.The organization is working with young people to promote awareness of the dangers of unprotected sex.The band are currently touring to promote their new album.The city is trying to lose its industrial image and promote itself as a tourist centre.Cutting the bush back in the autumn will help promote growth in the spring.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\npromote verb\n(RAISE)\nB1 [ T often passive ] to raise someone to a higher or more important position or rank: If I'm not promoted within the next two years, I'm going to change jobs. She's just been promoted to senior sales rep. Opposite\ndemote\n[ T ] UK to move a sports team to a higher group: If Coventry City win this match, they'll be promoted to the Premier League.\n[ T often passive ] US If a student is promoted, he or she goes up to the next level in school.\nMore examplesFewer examplesIt is my considered opinion that he should be promoted.He's deluding himself if he thinks he's going to be promoted this year.She was very demotivated by being told she had little chance of being promoted.What's her official designation now she's been promoted?She has been promoted from deputy manager to senior manager.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromote\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nsubordinate\nwilderness\nwilderness years idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nSchools in general"}