{"id":292726,"name":"pronoun","type":"noun","us_sound":"ˈproʊ.naʊn","us_link":"../audio/p/pronoun.mp3","uk_sound":"ˈprəʊ.naʊn","uk_link":"../audio/p/ukpromi024.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a word that is used instead of a noun or a noun phrase: Pronouns are often used to refer to a noun that has already been mentioned. \"She\", \"it\", and \"who\" are all examples of pronouns.\nSomeone's pronouns are the way they choose to be referred to according to their gender identity: Her pronouns are \"she/her\", but she is also happy with \"they/them\". It might be helpful to share your pronouns when introducing yourself. Some people include their pronouns in the signature line of their emails. Related word\npronominal\nMore examplesFewer examplesIn the sentence 'This is my brother', 'this' is a demonstrative pronoun.In the sentence, \"She prides herself on doing a good job\", \"herself\" is a reflexive pronoun.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconjunction\nconnective\ncount noun\ncountable noun\ndefinite article\npart of speech\nprep\nrelative pronoun\nSee more results »\nGrammar\nPronounsWe use pronouns in place of nouns and noun phrases: …\nPronouns: indefinite (-body, -one, -thing, -where)Somebody, anyone, everything, etc. are indefinite pronouns. …\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nAdd to word list\nAdd to word list\ngrammar a word that is used instead of a noun or a noun phrase: Pronouns are often used to refer to a noun that has been previously mentioned. \"She,\" \"it,\" \"them,\" and \"who\" are all examples of pronouns.\ngrammar a word that is used instead of a noun or a noun phrase: Pronouns are often used to refer to a noun that has been previously mentioned. \"She,\" \"it,\" \"them,\" and \"who\" are all examples of pronouns."}