{"id":292739,"name":"pronouncing","type":"verb","us_sound":"prəˈnaʊns","us_link":"../audio/p/pronounce.mp3","uk_sound":"prəˈnaʊns","uk_link":"../audio/p/ukpromi025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\npronounce\npronounce verb [T]\n(MAKE SOUND)\nB1 to say a word or a letter in a particular way: How do you pronounce your surname? She pronounced his name so badly he didn't even recognize it. Sade, pronounced shah-day, is a singer.\nMore examplesFewer examplesHave I pronounced your name correctly?The year 1705 is usually pronounced seventeen o five.She pronounced Leicester phonetically as \"Ley-ces-ter', but really we say \"Lester\".Don't you hate the way she speaks, pronouncing each single consonant so precisely.The phonetic alphabet shows you how to pronounce unfamiliar words.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: phonology & phonetics\npronounce verb [T]\n(TO STATE)\nformal to say something officially or certainly: [ + obj + noun/adj ] He was taken to the hospital where he was pronounced dead on arrival. The jury pronounced him guilty. He gazed vacantly while the verdict and sentence were pronounced. She surveyed the building and pronounced herself pleased with their work. [ + that ] The government pronounced that they are no longer a nuclear state. \"Have I met him?\" \"You have indeed - I recall you pronounced the man (= said that he was) a fool.\" The dessert was tried and pronounced delicious.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nPhrasal verb\npronounce on/upon something"}