{"id":293082,"name":"proposal","type":"noun","us_sound":"prəˈpoʊ.zəl","us_link":"../audio/p/proposal.mp3","uk_sound":"prəˈpəʊ.zəl","uk_link":"../audio/p/ukpropo007.mp3","content":"Add to word list\nAdd to word list\nB2 a suggestion, sometimes a written one: Congress has rejected the latest economic proposal put forward by the President. [ + to infinitive ] There has been an angry reaction to the government's proposal to reduce unemployment benefit. Have you read Steve's proposals for the new project? [ + that ] There was anger at the proposal that a UN peacekeeping force should be sent to the area.\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nB2 an offer of marriage\nMore examplesFewer examples50 people voted against the new proposal.The members are agreed that the proposal should be rejected.They declared their support for the proposalI'll send you a fax with the details of the proposal.The management has refused to back our proposals.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeddings\nAdd to word list\nAdd to word list\na suggestion for a possible plan or action: The president’s proposal was to tax a percentage of Social Security benefits for high-income people.\nAdd to word list\nAdd to word list\na formal suggestion, plan, or idea, often a written one: a proposal for sth The Senate rejected the proposal for a rise in Brazil's minimum wage.a proposal to do sth Management has made proposals to cap overtime.make/put forward/submit a proposal Nine other firms submitted proposals for the Navy complex.approve/consider/reject a proposal Investors approved the merger proposal. a budget/spending proposal a merger/project/tax proposal\nINSURANCE an official document in which you give information about yourself and your property for an insurance agreement: Once you have completed the on-screen proposal form, the premium and cover details are sent to you by e-mail."}