{"id":293130,"name":"proprietary","type":"adjective","us_sound":"prəˈpraɪə.ter.i","us_link":"../audio/p/proprietary.mp3","uk_sound":"prəˈpraɪə.tər.i","uk_link":"../audio/p/ukpropo013.mp3","content":"Add to word list\nAdd to word list\nrelating to owning something, or relating to or like an owner: I just assumed he owned the place - he had a proprietary air about him.\nProprietary goods are made and sent out by a particular company whose name is on the product: proprietary medicines\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbear\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert to something\nshared ownership\nstake something out\nsurvey\nthey've\ntraditional owner\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nAdd to word list\nAdd to word list\nowned and legally controlled by a particular company: This is proprietary software, and you have no right to copy it without a license from the owner.\nAdd to word list\nAdd to word list\nLAW used in the names of companies in Australia, New Zealand, and South Africa: Tenneco Energy Australia Pty Ltd\nMARKETING, COMMERCE used to describe a product that is made and sold by a particular company whose name, or a name that it owns, is on the product: The products were developed using two proprietary and patented technologies. The company focused too heavily proprietary products as the source of competitive advantage. a proprietary brand/name a proprietary drug/medicine proprietary software/systems\nLAW relating to ideas or information that belong to one particular company and can only be used by them: proprietary content/data/information The equation used to produce the estimates is proprietary.\nrelating to an owner or to the fact of owning something: The employees have a proprietary interest in the company. Compare\ngeneric"}