{"id":293060,"name":"proportion","type":"noun","us_sound":"prəˈpɔːr.ʃən","us_link":"../audio/p/eus73747.mp3","uk_sound":"prəˈpɔː.ʃən","uk_link":"../audio/p/ukproof030.mp3","content":"proportion noun\n(AMOUNT)\nAdd to word list\nAdd to word list\nC1 [ C, + sing/pl verb ] the number or amount of a group or part of something when compared to the whole: Children make up a large proportion of the world's population. A higher proportion of men are willing to share household responsibilities than used to be the case. The report shows that poor families spend a larger proportion of their income on food.\nC2 [ S or U ] the number, amount, or level of one thing when compared to another: The proportion of women to men at my college was about five to one. The chart shows how weight increases in proportion to height (= the increase in weight depends on the increase in height). The level of crime in an area is almost always in direct proportion to the number of unemployed.\nMore examplesFewer examplesWhat proportion of people who are HIV-positive go on to develop AIDS?As people accumulate more wealth, they tend to spend a greater proportion of their incomes.Their generosity was in inverse proportion to their income .He might be small but he's perfectly in proportion.Hispanics make up a large proportion of the population of Miami.\nSMART Vocabulary: related words and phrases\nNumerical relationships\nabsolute maximum\nabsolute minimum\narithmetic progression\ncardinality\ncommensurable\ndifferential\nharmonic progression\nintersect\ninverse function\ninverse proportion\nlinear\nlinearly\npercentage\nproportional\nprorate\nprorated\nquantile\nrank correlation\nratable\nsubset\nSee more results »\nproportion noun\n(SIZE)\nC2 [ C or U ] the correct or most attractive relationship between the size of different parts of the same thing or between one thing and another: Your legs are very much in proportion to (= the right size for) the rest of your body. His feet seem very small in proportion to his body. My head was much nearer the camera than the rest of me so I'm all out of proportion. proportions [ plural ]\nthe size, shape, or level of something: a building of elegant proportions\nSee more\nSMART Vocabulary: related words and phrases\nNumerical relationships\nabsolute maximum\nabsolute minimum\narithmetic progression\ncardinality\ncommensurable\ndifferential\nharmonic progression\nintersect\ninverse function\ninverse proportion\nlinear\nlinearly\npercentage\nproportional\nprorate\nprorated\nquantile\nrank correlation\nratable\nsubset\nSee more results »\nproportion noun\n(IMPORTANCE)\n[ U ] used in a number of phrases to mean importance and seriousness: You have to keep a sense of proportion (= the ability to understand what is important and what is not). I think a certain amount of worry about work is very natural, but you've got to keep it in proportion (= judge correctly its seriousness).\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nweight\nworth\nSee more results »\nIdiom\nblow something out of proportion\nAdd to word list\nAdd to word list\na part or share of the whole, or the relationship between one thing and another in size, amount, or degree: [ C ] The proportion of the population that is over 65 has been growing. [ pl ] The occurrence of the disease has reached epidemic proportions.\nProportion is also the right relationship between one thing and another: [ U ] His anger was out of all proportion to the offense (= was much too strong).\nart Proportion is also the correct relationship of the parts of a work of art to each other, especially in their size.\nmathematics A proportion is also a equation (= mathematical statement) that shows two ratios (= comparisons) are equal.\nAdd to word list\nAdd to word list\n[ C ] the number or amount of part of something when compared to the whole: boost/increase the proportion of sth He pledged to boost the group's proportion of home sales from 5% to 10%.as a proportion of sth Last year, public spending as a proportion of GDP sank to its lowest since the mid-1960s. It will take a few years before one will be able to observe equal proportions of men and women in sales management. a high/large/significant proportion a low/small proportion\n[ S or U ] the number, amount, or level of one thing when compared to another: the proportion of sth to sth The proportion of international sales to net sales will continue to affect the company's operating results. Existing shareholders are allowed to buy new shares in proportion to their holdings.\nin direct proportion to sth\nused to say that two things are connected, so that an increase in one is directly related to an increase in the other: The level of crime in an area is almost always in direct proportion to the number of unemployed.\nproportions [ plural ]\nthe size, shape, or level of something: A fund that grows to massive proportions must adapt its investment strategy. The pensions underfunding problem is reaching crisis proportions."}