{"id":293085,"name":"propose","type":"verb","us_sound":"prəˈpoʊz","us_link":"../audio/p/propose.mp3","uk_sound":"prəˈpəʊz","uk_link":"../audio/p/ukpropo008.mp3","content":"propose verb\n(SUGGEST)\nAdd to word list\nAdd to word list\nB2 [ T ] to offer or suggest a possible plan or action for other people to consider: [ + that ] I propose that we wait until the budget has been announced before committing ourselves to any expenditure. [ + -ing verb ] He proposed dealing directly with the suppliers. She proposed a boycott of the meeting. He proposed a motion that the chairman resign.\n[ T ] to suggest someone for a position in, or as a member of, an organization: To be nominated for union president you need one person to propose you and another to second you.\nB2 [ I ] to ask someone to marry you: I remember the night your father proposed to me. propose a toast\nto ask people at a formal social occasion to express their good wishes or respect for someone by holding up their glasses, usually of alcohol, at the same time and then drinking from them: propose a toast to Now, if you'd all please raise your glasses, I'd like to propose a toast to the bride and groom.\nSee more\nMore examplesFewer examplesSomeone proposed a motion to increase the membership fee to £500 a year.Critics of the president have been pouring scorn on the plan ever since it was first proposed.Now, if you'd all please raise your glasses, I'd like to propose a toast to the bride and groom.She proposes an exchange of contracts at two o'clock.What the government is proposing encroaches on the rights of individuals.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nMaking appeals & requests\nWeddings\npropose verb\n(INTEND)\nB2 [ T ] formal to intend to do something: [ + to infinitive ] How do you propose to complete the project in such a short time? [ + -ing verb ] How do you propose tackling this problem? I do not propose to reveal details at this stage. What we are proposing is a radical change in approach.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nRelated word\nproposed\npropose verb\n(SUGGEST)\nAdd to word list\nAdd to word list\nto suggest or state (a possible plan or action) for consideration: [ + to infinitive ] She proposed to keep the schools open all summer. [ + that clause ] It has often been proposed that the president be elected by direct popular vote.\nIf you propose to someone, you ask that person to marry you: [ I ] She felt sure he was going to propose.\npropose verb\n(INTEND)\nfml to intend to do something: [ + to infinitive ] How do you propose to complete the project in such a short time?\nAdd to word list\nAdd to word list\nto give someone a plan or idea to consider: She proposed a tax reform designed to make basic insurance more affordable.propose to do sth He is proposing to reduce the government's inflation target from 2.5% to 2%.propose doing sth They have proposed building a development of small, eco-friendly houses.propose that He proposed that the trade authorities get together to try to resolve the issue.\nMEETINGS to suggest someone for a position or as a member of an organization: To be nominated as chairman, you need one person to propose you and another to second you.\nMEETINGS to formally suggest an idea at a meeting, and ask people to vote on it: He proposed a motion that the chairman resign. Compare\nsecond verb\npropose to do sth\nto intend to do something: How do you propose to complete the project in such a short time scale? proposed adjective\nDepartment administrators presented the council with the proposed changes to the tax break program."}