{"id":292895,"name":"property","type":"noun","us_sound":"ˈprɑː.pɚ.t̬i","us_link":"../audio/p/eus73744.mp3","uk_sound":"ˈprɒp.ə.ti","uk_link":"../audio/p/ukproof018.mp3","content":"property noun\n(THINGS OWNED)\nAdd to word list\nAdd to word list\nB1 [ U ] an object or objects that belong to someone: The club does not accept responsibility for loss of or damage to club members' personal property. Both books have \"Government property\" stamped inside them. Children need to be taught to have respect for other people's property.\nB2 [ C or U ] a building or area of land, or both together: He owns a number of properties on the south coast. The notice said \"Private property - keep off!\" Yes, I've bought my own house - I'm now a man/woman of property!\n[ U ]\n&#160; law\n&#160; specialized the legal right to own and use something\nMore examplesFewer examplesThe new tax system would be calculated on the value of property owned by an individual.Apparently he was sacked after he was caught stealing company property.The police impounded cars and other personal property belonging to the drug dealers.The fire resulted in damage to their property.In an auction, goods or property are sold to the highest bidder.\nSMART Vocabulary: related words and phrases\nBelongings and possessions\naccoutrements\nasset\nbelongings\ncapital assets\nchattel\neffect\nestate\nfor\nin the name of something idiom\nlost property\nlost property office\nlost-and-found\nmaterially\npersonal property\npersonalty\npossession\nresource\nstuff\nswag\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMortgages & real estate\nCourt cases, orders & decisions\nproperty noun\n(QUALITY)\n[ C ] a quality in a substance or material, especially one that means that it can be used in a particular way: One of the properties of copper is that it conducts heat and electricity very well. We value herbs for their taste, but we forget that they also have medicinal properties.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nproperty noun\n(THINGS OWNED)\nAdd to word list\nAdd to word list\n[ C/U ] a thing or things owned by someone; a possession or possessions: [ U ] The books are the property of the public library.\n[ C/U ] Property is also land and buildings: [ C ] He owns some valuable waterfront properties.\nproperty noun\n(QUALITY)\n[ C ] a quality that something has: Wool has excellent properties for clothing, since it can keep you warm while letting air in.\n[ C ]\n&#160; science A property is also a particular physical or chemical characteristic of a substance.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; LAW an object or objects that belong to someone: They haven't yet learnt to respect people's property. Accepting stolen property is against the law. The phones are considered to be the property of the company.\n[ C ]\n&#160; PROPERTY\n&#160; plural properties a building or area of land that someone owns: The number of properties coming on to the market in June increased at the fastest rate since May last year.buy/sell a property When the owner died, the family sold the property. a business/investment/residential property a hotel/retail/office property\n[ U ]\n&#160; PROPERTY buildings and land, considered as things to be bought and sold: They made their money in property. buy/invest in/own property The university owns a lot of property in this part of town. The expense to each property owner will be more than $200,000. Property prices are very high in that area.\nSee also\nartistic property\ncommercial property\ndistressed property\nimmovable property\nindustrial property\nintellectual property\ninvestment property\nliterary property\nmovable property\npersonal property\nView all\nprivate property\npublic property\nreal property"}