{"id":292892,"name":"properly","type":"adverb","us_sound":"ˈprɑː.pɚ.li","us_link":"../audio/p/properly.mp3","uk_sound":"ˈprɒp.əl.i","uk_link":"../audio/p/ukproof017.mp3","content":"properly adverb\n(CORRECTLY)\nAdd to word list\nAdd to word list\ncorrectly, or in a satisfactory way: It's still not working properly. I'm not properly dressed for this kind of weather. I think you should take it somewhere to have it repaired properly. Come on, Evie, speak properly - you're not a baby any more!\nMore examplesFewer examplesWe need to ensure that handwriting is properly taught in our primary schools.You obviously didn't read the instructions properly.It takes about five minutes to iron a shirt properly.The doctors are doing all that they can, but she's still not breathing properly.If you get bitten by a dog, you have to make sure the wound is properly cleaned, or an infection could set in.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nproperly adverb\n(SOCIALLY ACCEPTABLE)\nformal in a socially and morally acceptable way: Most vegetables should be eaten with a fork but asparagus can be properly eaten with the fingers.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nIdiom\nproperly speaking\nproperly adverb\n(SUITABLY)\nAdd to word list\nAdd to word list\nin a way that is right for a particular situation; suitably: If the plants are tended properly, they’ll thrive in this climate.\nproperly adverb\n(CORRECTLY)\nin a way that is considered to be correct; correctly: To learn to speak a language properly, you have to live in the country where that language is spoken.\nproperly adverb\n(ACCEPTABLY)\nin a way that follows socially acceptable standards: I expect you to behave properly at the restaurant."}