{"id":292794,"name":"propaganda","type":"noun","us_sound":"ˌprɑː.pəˈɡæn.də","us_link":"../audio/p/propaganda.mp3","uk_sound":"ˌprɒp.əˈɡæn.də","uk_link":"../audio/p/ukproof005.mp3","content":"Add to word list\nAdd to word list\nC2 information, ideas, opinions, or images, often only giving one part of an argument, that are broadcast, published, or in some other way spread with the intention of influencing people's opinions: political/wartime propaganda At school we were fed communist/right-wing propaganda. One official dismissed the ceasefire as a mere propaganda exercise.\nMore examplesFewer examplesHe was brought up on a diet of political propaganda from birth.The whole nation was force-fed government propaganda about how well the country was doing.It's now up to the government's propaganda machine to restore the prime minister's image.The official propaganda machine went into overdrive when war broke out.Her ideas have been shamelessly perverted to serve the president's propaganda campaign.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nthe real deal\nSee more results »\nRelated word\npropagandize\nAdd to word list\nAdd to word list\ninformation or ideas that are spread by an organized group or government to influence people’s opinions, esp. by not giving all the facts or by secretly emphasizing only one way of looking at the facts\nAdd to word list\nAdd to word list\ninformation, ideas, opinions, or images that give one part of an argument, which are broadcast, published, etc. in order to influence people's opinions: a propaganda campaign/tool/exercise The report is just a political propaganda tool.anti-government/anti-Western/anti-American propaganda In the cyber attack, the home pages of official websites were replaced with anti-government propaganda. Critics called the book a blatant piece of propaganda."}