{"id":292812,"name":"propagation","type":"noun","us_sound":"ˌprɑː.pəˈɡeɪ.ʃən","us_link":"../audio/p/usproof005.mp3","uk_sound":"ˌprɒp.əˈɡeɪ.ʃən","uk_link":"../audio/p/ukproof009.mp3","content":"propagation noun [U]\n(GROWING)\nAdd to word list\nAdd to word list\nthe act of producing a new plant from a parent plant: Students researched the propagation of plants at the city's botanical garden. We saw a demonstration on horticultural propagation at the greenhouse.\nformal the producing of young plants or animals: The Game and Fish Department focuses on propagation, and other agencies monitor and protect breeding areas.\nMore examplesFewer examplesThe local nursery set up a propagation process using cuttings. Students conducted experiments on the optimal conditions for propagation of tropical plants. Trees stressed by drought drop more seeds to ensure propagation.They are researchers pondering the propagation of seabirds.\nSMART Vocabulary: related words and phrases\nPlant reproduction\nanther\nasexual reproduction\nasexuality\nasexually\nbarren\nbarrenness\nbreeder\nchasmogamous\ngerminate\npalynology\npistillate\npollinate\npollination\npollinator\npropagate\nself-pollination\nsexlessly\nsiltation\nsporangium\nunfruitful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal reproduction\npropagation noun [U]\n(SPREADING)\nformal the act or process of spreading something, especially a harmful message or opinion, among a lot of people: The site is a platform for the propagation of the group’s ideology. They have allowed the propagation of hateful messages. A file isn’t always necessary for the propagation of a computer virus.\nphysics\n&#160; specialized the sending out or spreading of light or sound waves, movement, etc.: The aircraft were gathering data on radio wave propagation. light/sound/electromagnetic wave propagation See\npropagate\nMore examplesFewer examplesThe propagation of hate in social media must end. I oppose the propagation of nonsense. The system allows faster downloads and more rapid propagation throughout the network.In these conditions no sound propagation can take place.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclamation\npropagate\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nresensitize\nstatement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nIncreasing and intensifying"}