{"id":293094,"name":"proposition","type":"noun","us_sound":"ˌprɑː.pəˈzɪʃ.ən","us_link":"../audio/p/proposition.mp3","uk_sound":"ˌprɒp.əˈzɪʃ.ən","uk_link":"../audio/p/ukpropo011.mp3","content":"Add to word list\nAdd to word list\nC1 an offer or suggestion, usually in business: He wrote to me last week regarding a business proposition he thought might interest me. I've put my proposition to the company director for his consideration.\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nan idea or opinion: They were debating the proposition that \"All people are created equal\".\nmathematics, language\n&#160; specialized a statement or problem that must be solved or proved to be true or not true: Pythagoras's theorem is the mathematical proposition that in any right-angled triangle, the square on the hypotenuse is equal to the sum of the squares on the other two sides.\npolitics\n&#160; US specialized in some states of the United States, a new plan that is voted on by the people of a state: He proposed an unsuccessful state proposition. Under Proposition 71, the state will commit $3 billion to studying stem cells over the next 10 years.\nMore examplesFewer examplesSo how does my proposition strike you ?I'm afraid my mother-in-law's cooking is never a very tempting proposition.Doing the walk in the rain wasn't a very attractive proposition.It's a crazy idea, certainly not one of your better propositions.I've got a business proposition to put to you.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nIdeas, concepts and theories\nGuesses and assumptions\nInternational relations: United States politics & government\nto ask someone who you are not in a relationship with if they would like to have sex with you: I was propositioned by a complete stranger.\nAdd to word list\nAdd to word list\na suggestion or statement for consideration: The chairman was advised that it was a risky business proposition.\nAdd to word list\nAdd to word list\nan offer or suggestion about a business activity: put/make a proposition to sb I've put my proposition to the company director for his consideration.accept/back/consider a proposition I need more time to consider your proposition. The line, which has advanced high-speed InterCity trains, is considered to be a highly attractive proposition for the private sector. a risky/viable proposition a business/investment proposition a commercial/economic proposition\na statement containing an idea or opinion: The proposition that the real rate of interest will be lower in future because of lower and more stable inflation is a myth.\nLAW\n&#160; (also Proposition) in the US, a suggested change to state law that is voted on by people living in that state: proposition to do sth A proposition to increase the sales tax by a quarter cent to fund parks projects passed by 33 votes.\nSee also\ncustomer proposition\nunique selling proposition\nvalue proposition"}