{"id":293599,"name":"prostration","type":"noun","us_sound":"prɑːˈstreɪ.ʃən","us_link":"../audio/p/usprosp004.mp3","uk_sound":"prɒsˈtreɪ.ʃən","uk_link":"../audio/p/ukprose021.mp3","content":"prostration noun [C or U]\n(LYING)\nAdd to word list\nAdd to word list\nthe act or position of lying with the face down and arms stretched out, especially as a sign of respect or worship: Approaching the main statue, he threw himself in full prostration before it. Some people performed prostrations, a sign of respect for the teacher.\nMore examplesFewer examplesShe spent five minutes in prayer, following a precise series of bows and prostrations.Prostration during these services signifies religious surrender. Almost all the words for worship are about bowing down or prostration.\nSMART Vocabulary: related words and phrases\nPhysical gestures of respect\nbow\nbow down\nbow your head\nchest bump\ncurtsy\ndap\ndap someone up\ndoff\nelbow bump\nfistbump\ngenuflect\nhandshake\nhigh five\nprostrate\nsalaam\nsalute\ntake a bow\nvail\nYou can also find related words, phrases, and synonyms in the topics:\nReclining\nReligious practices\nprostration noun [C or U]\n(VERY TIRED)\nthe state of having no strength or ability to do anything, for example because you are very ill, very tired, or very upset: She was in a bad state of exhaustion, approaching prostration. It is a severe, flu-like illness, with fever, headache, muscle pain, and prostration. See\nprostrate\nMore examplesFewer examplesHe collapsed into coma-like prostration.They prefer pride to prostration, putting on a brave face for the outside world and crying in private.The company lurched from prosperity to prostration.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTired and making tired\nStrength of will and determination"}