{"id":293331,"name":"prosecution","type":"noun","us_sound":"ˌprɑː.səˈkjuː.ʃən","us_link":"../audio/p/prosecution.mp3","uk_sound":"ˌprɒs.ɪˈkjuː.ʃən","uk_link":"../audio/p/ukpropo028.mp3","content":"prosecution noun\n(LEGAL)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the act of prosecuting someone: A number of the cases have resulted in successful prosecution. Doctors guilty of neglect are liable to prosecution. the prosecution [ S, + sing/pl verb ]\nC2 the lawyers in a court case who represent the side that accuses someone of committing a crime: His plea of guilty to manslaughter was not accepted by the prosecution. The prosecution alleged that he lured the officer to his death by making an emergency call.\nMore examplesFewer examplesThe prosecution has to establish his guilt beyond reasonable doubt.Her lawyer accused the prosecution of founding its case on insufficient evidence.This afternoon the prosecution will call its star witness.During the trial, the prosecution was accused of withholding crucial evidence from the defence.The key witness for the prosecution was offered police protection after she received death threats.\nMore examplesFewer examplesThe loophole has allowed hundreds of drink-drivers to avoid prosecution.Those kids were lucky, they only narrowly escaped prosecution.\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecutorial\nreindict\nreindictment\nretry\nspecimen charge\nsummons\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLawyers & legal officials\nprosecution noun\n(ACTIVITIES)\n[ U ] formal the act of taking part in a planned set of activities, especially a war\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotraction\npush ahead\npush on\nrun on\nrun someone/something over\nspan\nspin\nSee more results »\nAdd to word list\nAdd to word list\nthe act of officially accusing someone of committing an illegal act, esp. by bringing a case against that person in a court of law: [ U ] She was granted full immunity from prosecution by the state in return for her testimony.\nlaw The prosecution refers to the lawyers in a trial who try to prove that a person accused of committing a crime is guilty of that crime.\nAdd to word list\nAdd to word list\n[ C or U ] the process of officially accusing someone in a court of law of committing a crime: face prosecution (for sth) The company faces prosecution for breaches of safety regulations.bring a prosecution against sb They decided to bring a private prosecution against the boy's alleged killers.\n[ S ] (also the prosecution) the lawyers who try to prove that a person accused of committing a crime is guilty: The prosecution claims that the company tried to mislead investigators by lying under oath. Compare\ndefence"}