{"id":293785,"name":"protest","type":"noun","us_sound":"ˈproʊ.test","us_link":"../audio/p/protest_01_00.mp3","uk_sound":"ˈprəʊ.test","uk_link":"../audio/p/ukprote007.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a strong complaint expressing disagreement, disapproval, or opposition: Protests have been made/registered by many people who would be affected by the proposed changes. A formal protest was made by the German team about their disqualification from the relay final. Conservation groups have united in protest against the planned new road.\nB2 [ C ] an occasion when people show that they disagree with something by standing somewhere, shouting, carrying signs, etc.: a public protest against the war a peaceful/violent protest\nPeopleImages/E+/GettyImages under protest\nIf something is done under protest, it is done unwillingly: I only went to the meeting under protest.\nMore examplesFewer examplesThe authorities have put tanks on the streets to discourage any protest.My letter of protest was just a drop in the ocean.They believe only in peaceable, non-violent protest.The lecturers joined the protest march to show solidarity with their students.One member of the committee resigned in protest at the changes.\nSMART Vocabulary: related words and phrases\nOpposing & against\nad hominem\nadversarial\nalienate\nalienated\nantagonistic\nanti-boycott\nantithetical\nconverse\ndiscordant\ninsurgent\nlark\nman the barricades idiom\nnimby\nnimbyism\nnon-confidence\nobject\nraise\nresistant\nversus\nvirulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplaining\nActivism & pressure groups\nUnwilling and reluctant\nB2 to show that you disagree with something by standing somewhere, shouting, carrying signs, etc.: A big crowd of demonstrators were protesting against cuts in health spending.especially US Outside, a group of students were protesting research cuts.\nB2 to say something forcefully or complain about something: Lots of people protested about the new working hours. They protested bitterly to their employers, but to no avail. [ + that ] A young girl was crying, protesting that she didn't want to leave her mother. All through the trial he protested his innocence (= strongly said he was not guilty).\nMore examplesFewer examplesWe protested about the changes for a long time, but in the end we had to submit.Demonstrators protested angrily following the jury's verdict.\"But I can't go to the dance without an escort, \" she protested.Students and workers were out on the streets protesting against the cuts.The students are holding a demonstration to protest against the increase in their fees.\nSMART Vocabulary: related words and phrases\nOpposing & against\nad hominem\nadversarial\nalienate\nalienated\nantagonistic\nanti-boycott\nantithetical\nconverse\ndiscordant\ninsurgent\nlark\nman the barricades idiom\nnimby\nnimbyism\nnon-confidence\nobject\nraise\nresistant\nversus\nvirulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplaining\nIdiom\nprotest too much\nAdd to word list\nAdd to word list\na strong complaint expressing disagreement, disapproval, or opposition: [ U ] Three board members walked out of the meeting in protest. [ C ] A protest against capital punishment was held outside the courthouse. [ U ] He paid the tax under protest to avoid a penalty.\nto express disagreement with, disapproval of, or opposition to something by complaining strongly about it: [ I/T ] Groups of students have been protesting (against) the tuition increase.\nAdd to word list\nAdd to word list\n[ C or U ] a strong complaint against something, or the act of complaining strongly about it: an angry/big/formal protest The chief executive of the troubled company gave up a £2.8m bonus package after big protests.in protest against/at sth He resigned in protest at the refusal to privatise the airline. The length of directors' contracts attracted a storm of protest from small shareholders at last year's annual meeting.\n[ C ] an occasion when people show that they disagree strongly with something by standing together and shouting and carrying signs, especially on the streets: hold/organize/stage a protest Shareholders held protests against the takeover bid outside the Stock Exchange.spark/trigger a protest The plan sparked days of street protests. a large/mass/peaceful protest a protest demonstration/march\nunder protest\nif something is done under protest, it is done unwillingly: In the cruise-ship industry, some companies are paying sales tax under protest, and some aren't paying at all.\n[ I or T ] to say or do something to show that you are against something: protest about/at sth Shareholders of the telecoms company are being urged to protest about a £10million bonus given to the chief executive.protest against sth Local entrepreneurs banded together and called a strike to protest against an increase in local taxes. US protest a proposal/decision\nto say very forcefully that something is true: protest that Industry lobbyists protest that the charges on small loans would drive lenders out of business."}