{"id":293663,"name":"protect","type":"verb","us_sound":"prəˈtekt","us_link":"../audio/p/protect.mp3","uk_sound":"prəˈtekt","uk_link":"../audio/p/ukprose024.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to keep someone or something safe from injury, damage, or loss: clothing that protects you against the cold It's important to protect your skin from the harmful effects of the sun. Surely the function of the law is to protect everyone's rights. Of course the company will act to protect its financial interests in the country if war begins. Patients' names have been changed to protect their privacy. Public pressure to protect the environment is strong and growing. Vitamin C may help protect against cancer.\n[ T ] If a government protects a part of its country's trade or industry, it helps it by taxing goods from other countries.\n[ T ] to provide someone with insurance against injury, damages, etc.\nMore examplesFewer examplesShe's always chasing cats out of the garden to protect her precious birds.This toothpaste has been clinically proven to protect your teeth.We're not doing enough to protect the environment from pollution.She packed the vase in tissue paper to protect it.The Red Cross's primary concern is to preserve and protect human life.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInvesting money\nTaxation\nEconomics\nInsurance\nRelated word\nprotected\nAdd to word list\nAdd to word list\nto keep someone or something safe from injury, damage, or loss: He says he was protecting his home and family. A citizens’ group worked to protect forest areas.\nAdd to word list\nAdd to word list\n[ I or T ] to keep someone or something safe from injury, damage, or loss: protect sb/sth from sth They produce a self-adhesive plastic cover designed to protect CDs from scratches.protect sb/sth against sth The company has been ordered to take corrective action to protect consumers against high-pressure sales tactics.protect against sth The investment does not insure profits or protect against losses in a declining market.protect sb's interests/investments/rights The agreement obliges WTO Members to protect the rights, including copyrights and trademarks, of citizens of all other Members. This material is protected by copyright.\n[ T ]\n&#160; ECONOMICS if a government protects part of its country's trade or industry, it helps it by taxing goods from other countries or limiting the amount of goods that can be imported: Import barriers protected the fledgling enterprises. a protected industry/market\n[ I or T ]\n&#160; INSURANCE to provide someone with insurance against injury, damage, or loss: Workers should take out insurance, whether to cover themselves against a particular illness or to protect their income.protect against sth Life annuities protect against the risk of people outliving their savings."}