{"id":293673,"name":"protection","type":"noun","us_sound":"prəˈtek.ʃən","us_link":"../audio/p/protection.mp3","uk_sound":"prəˈtek.ʃən","uk_link":"../audio/p/ukprose026.mp3","content":"Add to word list\nAdd to word list\nB2 the act of protecting or state of being protected: Their flimsy tent gave/offered little protection against the severe storm. Round-the-clock police protection is given to all senior politicians. New legislation still does not offer adequate protection for many endangered species. Always wear goggles as a protection for your eyes when using the machines. The insurance policy provides protection (= will make a financial payment) in case of accidental loss of life or serious injury. Synonyms\ncare (PROTECTION)\ncharge (CONTROL)\ncustody (CARE)\nguardianship\nguidance\nkeeping\nresponsibility (DUTY)\ntutelage formal\ninformal for\nprotection money\na method of preventing pregnancy or the spread of sexual disease that works by physically blocking substances such as sperm from coming into contact with the body : Did you use any protection? If you have an IUD, you still need to use some form of protection like condoms or dental dams to reduce the risk of sexually transmitted infections.\nMore examplesFewer examplesThe hut afforded little protection from the elements.Zoos fulfil an important function in the protection of rare species.The protection of the environment must be our first priority today.It's a wilderness area, under the protection of the Parks Department.The key witness for the prosecution was offered police protection after she received death threats.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPayment methods\nObstetrics: contraception\nAdd to word list\nAdd to word list\nthe condition or state of being kept safe from injury, damage, or loss: [ U ] Their tent offered little protection against the storm. [ C ] The proposed law is intended to provide legal protections for farm workers. [ U ] These laws may not provide enough protection for some endangered species.\nAdd to word list\nAdd to word list\nthe act of keeping someone or something safe from injury, damage, or loss, or the state of being protected in this way: We need protection from bad or incompetent doctors. Retailers believe the magnetic cards give the banks less protection against fraud. The package of employments rights included full legal protection from dismissal for strikers. copyright protection\nLAW a situation in which a company in financial difficulty gets special legal treatment to help it stay in business: Chapter 11 would grant protection from creditors while the company attempts to reorganize.\nECONOMICS a situation in which a government helps a part of its country's industry by taxing goods from other countries or by limiting the amount of goods that can be imported: Import protection has formed a key part of industrial development policies in many Asian economies.\nINSURANCE insurance against injury, damage, or loss: The insurance policy provides protection in case of accidental loss of life or serious injury. an income protection policy See also\nbankruptcy protection\nbrand protection\nconsumer protection\ncredit protection\ndata protection\nemployment protection\ninvestor protection\njob protection\npatent protection"}