{"id":294367,"name":"province","type":"noun","us_sound":"ˈprɑː.vɪns","us_link":"../audio/p/province.mp3","uk_sound":"ˈprɒv.ɪns","uk_link":"../audio/p/ukprove015.mp3","content":"province noun\n(REGION)\nAdd to word list\nAdd to word list\nC2 [ C ] one of the areas that a country or empire is divided into as part of the organization of its government, which often has some control over its own laws : the Canadian province of Alberta Asia Minor was Rome's richest province. Compare\nstate noun (COUNTRY)\nterritory (AREA)\none of the four areas into which Ireland has traditionally been divided: Connaught is Ireland's westernmost province. in the deep south of Ireland in the province of Munster the Province UK (also the province)\nNorthern Ireland: We are interested in the economic prosperity of both the Province and the Republic of Ireland. the provinces [ plural ]\nthe parts of a country that are not the capital city or near a large city: He didn't want to teach at a university in the provinces.\nSee more\nMore examplesFewer examplesHe was born in the China's northwest Shanxi province in 1950.The competition is not open to residents of Alaska, Hawaii and the province of Quebec.The majority of people in the province are in favour of devolution.an autonomous provinceOctavian ruled Rome's western provinces. An Ulster fry is a dish of fried food that is popular throughout the province of Ulster in Ireland.Catholics who seek closer links between the province and the rest of IrelandWe're not very sophisticated here in the provinces.\nSMART Vocabulary: related words and phrases\nTowns & regions: parts of countries\nat local/national level phrase\nbicoastal\nBreton\ncity state\ncollectorate\ncountywide\ndistrict\neasterner\ngreen belt\nmetropolitan borough\nmetropolitan county\nmulti-county\nnon-county\nnon-metropolitan county\nnortherner\nnorthwest\nregionalism\nsector\nsoutherner\nterritory\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries\nprovince noun\n(SUBJECT)\nsomeone's province formal\na subject or activity of special interest, knowledge, or responsibility: the province of Marketing is within the province of the sales department. Renaissance art is not really his province - he specializes in the modern period. I didn't feel it was my province to give legal advice. With this kind of interdisciplinary approach, everything is your province. This kind of spyware has largely been the province of internet fraudsters.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nkingdom\nleitmotiv\nscene\nscore\nspecialism\nsubject\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nprovince noun\n(REGION)\nAdd to word list\nAdd to word list\n[ C ] a division of a country that has its own government: The province of Quebec has voted several times on independence from Canada.\n[ C ] The provinces are the parts of a country outside its capital or most important city.\nprovince noun\n(SUBJECT)\n[ U ] fml a subject or activity of special interest, knowledge, or responsibility: Architecture is within the province of the art department."}