{"id":294418,"name":"provocatively","type":"adverb","us_sound":"prəˈvɑː.kə.t̬ɪv.li","us_link":"../audio/p/provocatively.mp3","uk_sound":"prəˈvɒk.ə.tɪv.li","uk_link":"../audio/p/ukprove027.mp3","content":"provocatively adverb\n(TO CAUSE THOUGHT)\nAdd to word list\nAdd to word list\nin a way that causes thought about interesting subjects: The comics featured stories that dealt provocatively with the environment, racism, and sex. A woman was provocatively cast in the lead role.\nMore examplesFewer examplesIn his films he uses silence brilliantly and provocatively.We like to leave the question of whether there is extraterrestrial life provocatively open.\nSMART Vocabulary: related words and phrases\nExciting and interesting\nabsorbing\nabsorbingly\naction-packed\nadventurous\nalley\neye-catchingly\nfancifully\nfascinating\nfascinatingly\nfascinator\npulsating\npunchy\nracy\nriveting\nrivetingly\nspectacularly\nwith bells on idiom\nzhuzh\nzing\nzingy\nSee more results »\nprovocatively adverb\n(TO CAUSE ANGER)\nin a way that causes an angry reaction, usually intentionally: He said that people would be allowed to protest peacefully, but not provocatively. The missiles are placed provocatively close to the border.\nMore examplesFewer examplesSince his election he has continuously and at times provocatively pressed his agenda.His report was provocatively entitled \"A Failed Experiment\".\nSMART Vocabulary: related words and phrases\nAnnoying\naccursed\naggravating\nannoying\nannoyingly\nball-ache\nexasperatingly\nfrustratingly\ngadfly\ngalling\ngallingly\nirritating\nirritatingly\nlimit\nmaddening\nmither\nsickeningly\nspiteful\nstupid\ntrying\nvexatious\nSee more results »\nprovocatively adverb\n(TO CAUSE DESIRE)\nin a way that is intended to cause sexual desire: He said that she was dressed provocatively. Related word\nprovocative\nMore examplesFewer examplesThey were dancing provocatively to pop music, to their parents' dismay.In magazines, teen idols pose provocatively in revealing outfits. The outfit was provocatively tight."}