{"id":294364,"name":"providing","type":"verb","us_sound":"prəˈvaɪd","us_link":"../audio/p/provide.mp3","uk_sound":"prəˈvaɪd","uk_link":"../audio/p/ukprove007.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nprovide\nprovide verb\n(SUPPLY)\nB1 [ T ] to give someone something that they need: This booklet provides useful information about local services. All meals are provided at no additional cost. The author provides no documentary references to support her assertions. We have concerns about whether the government will be able to provide viable social services for poorer families/provide poorer families with viable social services. Putting more police on patrol doesn't provide a real solution to the problem of increasing violence.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accommodate someoneaccommodateThere aren’t enough rooms to accommodate all the students.give accommodation toThe university gives free accommodation to nursing students.provide accommodation toWe only provide accommodation to first-year students.lodgeStudents will be lodged with host families.houseThe base can house up to 2,000 soldiers.put someone upI can put you up for a couple of nights.\nSee more results »\nMore examplesFewer examplesBonus payments provide an incentive to work harder.Do you think the state should provide free nursery education?A healthy diet should provide all your essential nutrients.They opened a shelter to provide temporary housing for the city's homeless.He was able to provide the police with some valuable information.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nprovide verb\n(LAW)\n[ + that ] formal (of a law or decision) to say that something must happen if particular conditions exist: Section 17 provides that all decisions must be circulated in writing.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwardship\nwitness to something\nwobbler\nSee more results »\nPhrasal verbs\nprovide against something\nprovide for someone\nprovide for something"}