{"id":294352,"name":"provide","type":"verb","us_sound":"prəˈvaɪd","us_link":"../audio/p/provide.mp3","uk_sound":"prəˈvaɪd","uk_link":"../audio/p/ukprove007.mp3","content":"provide verb\n(SUPPLY)\nAdd to word list\nAdd to word list\nB1 [ T ] to give someone something that they need: This booklet provides useful information about local services. All meals are provided at no additional cost. The author provides no documentary references to support her assertions. We have concerns about whether the government will be able to provide viable social services for poorer families/provide poorer families with viable social services. Putting more police on patrol doesn't provide a real solution to the problem of increasing violence.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto accommodate someoneaccommodateThere aren’t enough rooms to accommodate all the students.give accommodation toThe university gives free accommodation to nursing students.provide accommodation toWe only provide accommodation to first-year students.lodgeStudents will be lodged with host families.houseThe base can house up to 2,000 soldiers.put someone upI can put you up for a couple of nights.\nSee more results »\nMore examplesFewer examplesBonus payments provide an incentive to work harder.Do you think the state should provide free nursery education?A healthy diet should provide all your essential nutrients.They opened a shelter to provide temporary housing for the city's homeless.He was able to provide the police with some valuable information.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nprovide verb\n(LAW)\n[ + that ] formal (of a law or decision) to say that something must happen if particular conditions exist: Section 17 provides that all decisions must be circulated in writing.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nPhrasal verbs\nprovide against something\nprovide for someone\nprovide for something\nprovide verb\n(GIVE)\nAdd to word list\nAdd to word list\n[ T ] to give something that is needed or wanted to someone: The company provides medical benefits to all employees. I can provide you with directions to their house.\nprovide verb\n(STATE)\n(of a law or contract) to state that something must happen or be done: [ I ] The new statute provides for life imprisonment without parole. [ + that clause ] Many loan agreements provide that the interest rate will change. Phrasal verb\nprovide for someone\nAdd to word list\nAdd to word list\nto give something to a person, company, or organization, or to make it available for them to use: The government has pledged to provide over $1 billion in refinancing.provide sb with sth Customers, suppliers, and contractors will be provided with the specialist training they need to work on the project.provide sth for sb/sth The enhanced cashflow will also provide funds for expansion into television.provide sth to sb Our digital imaging centre provides a 3D scanning service to a wide range of customers in Europe, the Middle East, and Africa.be provided by sb/sth According to Census data provided by the state Department of Labor and Industry, Hispanic workers constitute about 3% of the work force.\nto produce something useful that can be used as part of a process or activity: A well-established management process should provide a framework for the integration of all business units and operations. It is hoped that the proposed 10-day sales-tax holiday will provide a boost to retail sales. provide an opportunity/advantage/basis\nprovided that\nif, or only if: ILO conventions allow schoolchildren to work during their holidays and free time provided that strict safety measures are taken.\nprovide that\nLAW a law or rule that provides that something must happen states officially that it must happen: Rule 222-2 provides that all notices of shareholder meetings shall be sent to shareholders not less than seven days before the date of the meeting. Phrasal verbs\nprovide against sth\nprovide for sth\nprovide for sb"}