{"id":294423,"name":"provoke","type":"verb","us_sound":"prəˈvoʊk","us_link":"../audio/p/provoke.mp3","uk_sound":"prəˈvəʊk","uk_link":"../audio/p/ukprove028.mp3","content":"provoke verb [T]\n(CAUSE REACTION)\nAdd to word list\nAdd to word list\nC2 to cause a reaction, especially a negative one: The prospect of increased prices has already provoked an outcry. Test results provoked worries that the reactor could overheat.\nMore examplesFewer examplesHer manifest lack of interest in the project has provoked severe criticism.The release from prison of two of the terrorists has provoked a public outcry.These murders have provoked outrage across the country.We have no intention of launching a pre-emptive strike, but we will retaliate if provoked.The prime minister's speech provoked an angry response from the shadow cabinet.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nprovoke verb [T]\n(MAKE ANGRY)\nC2 to make or try to make a person or an animal angry: It was a vicious-looking dog and I didn't want to provoke it. He was clearly trying to get at me but I refused to be provoked. I was provoked into the argument.\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoy\nbend\ngive someone the shits idiom\ngo too far idiom\ngoat\ngrate\nhack someone off\njoke\nnark\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\nset someone's teeth on edge idiom\ntit\ntroll\nSee more results »\nprovoke verb [T]\n(ANGER)\nAdd to word list\nAdd to word list\nto try to make a person or an animal angry or annoyed: He was trying to provoke me into a fight.\nprovoke verb [T]\n(CAUSE REACTION)\nto cause a particular reaction or feeling: I’m trying to make people think, provoke their emotions. His death provoked huge demonstrations."}