{"id":294303,"name":"prove","type":"verb","us_sound":"pruːv","us_link":"../audio/p/prove.mp3","uk_sound":"pruːv","uk_link":"../audio/p/ukprote030.mp3","content":"prove verb\n(SHOW)\nAdd to word list\nAdd to word list\nB2 [ T, L ] to show a particular result after a period of time: The operation proved a complete success. The dispute over the song rights proved impossible to resolve. [ L (+ to be) ] The new treatment has proved to be a disaster. prove yourself\nC2 to show that you are good at something: I wish he'd stop trying to prove himself all the time.\nMore examplesFewer examplesThe army has proved ineffective in protecting the civilian population.The policy of charging air travellers for vegetarian meals proved very unpopular.The government's claim that it would reduce taxes proved false.Such data will prove invaluable to researchers.Your daughter's attitude only goes to prove how much society has changed over the last 30 years.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nprove verb\n(SHOWING TRUTH)\nB1 [ T ] to show that something is true: [ + that ] They suspected that she'd killed him but they could never actually prove that it was her. [ + adj ] They proved him innocent/guilty. Under the present system, you're innocent until proven guilty. [ + question word ] \"I lost £30 on the bus.\" \"That just goes to prove what an idiot you are!\" Computers have been used to prove mathematical theorems. That theory was proved false. He's so aggressive - it's as if he's always trying to prove something.\nMore examplesFewer examplesIt will be very difficult to prove that they are guilty.The crime of rape is notoriously difficult to prove.She only bought that sports car to show off and prove she could afford one.The tape recordings provided enough evidence to prove he'd been involved in the conspiracy.The traces of petrol found on his clothing provided the forensic evidence proving that he had started the fire deliberately.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverify\nvindicate\nvindication\nvindicative\nvindicatory\nSee more results »\nRelated word\nproven\nprove verb\n(SHOW)\nAdd to word list\nAdd to word list\nto show after a time or by experience that something or someone has a particular quality: [ L ] The dispute over rights to the song could prove impossible to resolve. [ + to infinitive ] The new safety procedures have so far proven to be satisfactory. As a newcomer, I felt I had to prove myself (= show I am skilled).\nprove verb\n(MAKE CLEAR)\n[ T ] to make it clear that something is or is not true: They suspected she cheated, but they could never prove it. [ + (that) clause ] I had to take all my records to the bank to prove (that) the mistake was theirs. Under our legal system, you’re innocent until proven guilty. proven adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈpru·vən/\nYou can’t trust him – he’s a proven liar."}