{"id":294387,"name":"provision","type":"noun","us_sound":"prəˈvɪʒ.ən","us_link":"../audio/p/provision.mp3","uk_sound":"prəˈvɪʒ.ən","uk_link":"../audio/p/ukprove019.mp3","content":"provision noun\n(SUPPLY)\nAdd to word list\nAdd to word list\nC1 [ C or U ] the act of providing something: The provision of good public transport will be essential for developing the area. Of course there's provision in the plan for population increase. When designing buildings in this area, you have to make provision against earthquakes. provisions [ plural ]\nsupplies of food and other necessary things: provisions for the journey\nMore examplesFewer examplesThe council's provision for the elderly is barely adequate .Very few companies make childcare provision for working mothers.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFood - general words\nprovision noun\n(LAW)\n[ C ] a statement within an agreement or a law that a particular thing must happen or be done, especially before another can happen or be done: We have inserted certain provisions into the treaty to safeguard foreign workers. [ + that ] She accepted the job with the provision that she would be paid expenses for relocating.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nRafferty's rules\nself-regulation\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nprovision noun\n(FINANCE)\nin a company's accounts (= financial records), an amount of money that is kept in case of a possible future loss: The insurance company made a provision against claims over alleged pension fraud. make provision for something\nto make arrangements to deal with something, often financial arrangements: He hasn't made any provision for his retirement yet.\nSMART Vocabulary: related words and phrases\nAccounting\naccountancy\naccountant\naccounting\naccounts\nauditor\nbad debt\nbalance\nbalance sheet\nbill\nbudget\ncreative accounting\ndouble entry bookkeeping\nfalse accounting\nforensic accountant\nforensic accounting\nloss\ntreasurer\nunaudited\nunreconciled\nwrite something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nto supply someone or something with food and other necessary things Synonyms\nfurnish someone with something formal\npurvey formal\nsupply\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProviding & serving meals\nprovision noun\n(SOMETHING NEEDED)\nAdd to word list\nAdd to word list\n[ C/U ] something that is needed or wanted, or the act of considering the need for something and arranging for it: [ U ] When designing buildings in California, you have to make some provision for earthquakes. [ C ] Ample provisions for aircraft stability have been made.\n[ C/U ] Provisions are also supplies of food and other necessary items: [ pl ] Provisions had to be flown in by helicopter.\nprovision noun\n(AGREEMENT)\n[ C ] a statement in an agreement or a law that a particular thing must happen or be done: Her contract contains a provision covering additional expenses.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; ACCOUNTING, FINANCE in a company's accounts, an amount of money that is kept in case of a possible future loss or debt: The insurance company made a provision against claims over alleged pension fraud.a provision for sth The finance director revealed a $47m provision for finding and compensating victims of bad pensions advice.\n[ C or U ]\n&#160; LAW a part of a legal document that states that something must happen or be done: Employees may be asked to go to a new and different place of work under the provisions of a mobility clause.include/contain a provision Many contracts currently include a provision prohibiting supervisors from doing work done by union workers. anti-fraud/registration provisions statutory/legal provisions\n[ U ] the act of selling goods or services or making them available to be used: The Group remains fully committed to the provision of mortgage finance to individuals. service/pension/retirement provision\nmake provision(s) (for sth)\nto make plans for dealing with something that will or may happen in the future: If companies are to succeed in the long term, they must make provisions for coping with a diverse international marketplace. See also\nbad debt provision\ncall provision\nrestructuring provision\nsunset provision\ntax provision\nACCOUNTING, FINANCE to keep an amount of money available to be used in case of a possible future loss or debt: The company has revealed that it has provisioned £235m for asbestos-related claims."}