{"id":294474,"name":"proxy","type":"noun","us_sound":"ˈprɑːk.si","us_link":"../audio/p/proxy.mp3","uk_sound":"ˈprɒk.si","uk_link":"../audio/p/ukprowe005.mp3","content":"Add to word list\nAdd to word list\nauthority given to a person to act for someone else, such as by voting for them in an election, or the person who this authority is given to: a proxy vote My brother's voting for me by proxy in the club elections. Can I nominate someone as a proxy to sign for me?\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nAdd to word list\nAdd to word list\nauthority given to someone to act for you, as by voting as your representative in an election, or the person to whom this authority is given\nAdd to word list\nAdd to word list\n[ C or U ] a written document that officially gives someone the authority to do something for another person, for example by voting at a meeting for them: A creditor may give a proxy to any person of full age requiring him or her to vote for or against any specified resolution. proxy materials/cards/forms\n[ C or U ] a person who you choose to do something officially for you, for example to vote at a meeting or in an election when you are not able to vote yourself: Your proxy does not necessarily have to sign the form himself or herself. Any patron with a registered ballot book may participate in the minimum-bid auction in person Saturday, or via proxy. proxy votes/voting\nby proxy\nif you do something by proxy, you officially ask someone else to do it for you: New rules have ended the practice of allowing members to vote by proxy.\n[ C ] a situation, process, or activity to which another situation, etc. is compared, especially in order to calculate how successful or unsuccessful it is: a proxy for sth Wall Street typically uses volume growth as a proxy for the underlying health of a business."}