{"id":295575,"name":"psychical","type":"adjective","us_sound":"ˈsaɪ.kɪ.kəl","us_link":"../audio/p/usprovi021.mp3","uk_sound":"ˈsaɪ.kɪ.kəl","uk_link":"../audio/p/ukpsst_009.mp3","content":"psychical adjective [before noun]\n(SPECIAL ABILITY)\nAdd to word list\nAdd to word list\nrelating to special mental abilities or to events that cannot be explained by science, such as the ability to know what will happen in the future or the appearance of ghosts: The Society for Psychical Research is investigating reports of a ghost at the old vicarage. Many photographic images have been claimed, in their day, to be irrefutable proof of psychical activity.\nMore examplesFewer examplesHe submits to a test that claims to measure psychical capacity by studying the subject's effects on a random-number generator.The matter of life after death has fascinated both both psychical and scientific researchers. He cofounded the Parapsychology Laboratory and is generally recognized as the founder of modern studies of psychical phenomena.\nSMART Vocabulary: related words and phrases\nExtrasensory perception & telepathy\naugury\nclairvoyance\ndivination\nesp.\nextrasensory\nparapsychology\nprecognition\nprecognitive\nprediction\npremonition\npsychokinesis\npsychokinetic\nsecond sight\nsixth sense\ntelaesthesia\ntelekinetically\ntelepathic\ntelepathically\ntelepathy\ntelesthesia\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPredicting things and intuition\npsychical adjective [before noun]\n(MENTAL)\nrelating to or happening in the mind rather than in the body: Yoga was an effort to attain perfection through the control of the different elements of human nature, physical and psychical. Psychical blindness is a condition in which there is a total absence of visual memory-images. Related word\npsychic\nMore examplesFewer examplesIn this film fighting operates as a metaphor, on both the physical and psychical levels.There is a supposition that deep psychical drives manifest themselves in our behavior.Some psychologists have sought to reduce the notion of the ego to physiological as well as psychical factors.\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nFreudian\nJungian\npost-Freudian\npreconscious\nprofiler\nprojective\nprojectively\npsychiatric\npsychiatry\npsychic\npsychologist\nstraitjacket\nsuperego\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealthiness of mind"}