{"id":295674,"name":"psychological","type":"adjective","us_sound":"ˌsaɪ.kəˈlɑː.dʒɪ.kəl","us_link":"../audio/p/psychological.mp3","uk_sound":"ˌsaɪ.kəlˈɒdʒ.ɪ.kəl","uk_link":"../audio/p/ukpsst_018.mp3","content":"Add to word list\nAdd to word list\nB2 relating to the human mind and feelings: psychological problems He claims that the constant aircraft noise has a bad psychological effect on the residents. We are concerned with the physical and psychological well-being of our employees.\n(of an illness or other physical problem) caused by worry or sadness: I suspect his headaches are purely psychological.\n[ before noun ] A psychological film or book is one in which there is a lot of attention given to the way people influence each other's behaviour: a psychological thriller\nMore examplesFewer examplesHis early years in the refugee camp left a deep psychological scar.She claimed that the way she had been treated at work had caused her extreme emotional and psychological distress.They complained about the physical and psychological maltreatment of prisoners.I'm sure that she's not really ill, it's just psychological.the psychological damage suffered by orphaned children\nSMART Vocabulary: related words and phrases\nScience of psychology & psychoanalysis\nanalyse\nanalysis\nbehavioural science\nbehaviourist\ncathartic\ncertify\ncommittal\nJungian\nOedipus complex\npost-Freudian\npreconscious\nprofiler\nprojective\nprojectively\npsychiatric\npsychic\npsychologist\nstraitjacket\nsuperego\nunconscious\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nRelated word\npsychologically\nAdd to word list\nAdd to word list\nrelating to the study of the mind: psychological testing Her problems were psychological.\nPsychological also means having an effect on or involving the mind: psychological stress/well-being Her new novel is a psychological thriller. psychologically adverb us\nYour browser doesn't support HTML5 audio\n/ˌsɑɪ·kəˈlɑdʒ·ɪ·kli/\nGifted children are well-adjusted, popular, and psychologically healthy.\nAdd to word list\nAdd to word list\nrelating to the human mind and feelings: The experience of being fired has had lasting psychological effects. The rail disaster had a psychological impact on some investors."}