{"id":296204,"name":"publication","type":"noun","us_sound":"ˌpʌb.ləˈkeɪ.ʃən","us_link":"../audio/p/publication.mp3","uk_sound":"ˌpʌb.lɪˈkeɪ.ʃən","uk_link":"../audio/p/ukpsych014.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the act of making information or stories available to people in a printed or electronic form: The brochure will be ready for publication in September. Will you arrange the publication of the names of the winners? When is the publication date? (= When will the book be available to buy?)\nB2 [ C ] a book, magazine, newspaper, or document in which information or stories are published: Our latest publication is a magazine for health enthusiasts.\nMore examplesFewer examplesThere has been a delay in the book's publication.The manuscript was accepted for publication last week.a bimonthly/weekly publicationThe publication of the economic statistics was awkwardly timed for the government.a financial/scientific publication\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\nrubber stamp\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNewspapers & magazines\nAdd to word list\nAdd to word list\na book, magazine, newspaper, or document, or the act of making information or writing available, esp. in a printed form: [ C ] His writing appears frequently in French, Mexican, and Canadian publications. [ U ] The publication of the marathon finishers will be in next Sunday’s newspaper.\nAdd to word list\nAdd to word list\n[ U ] the act of making information, stories, or pictures available to people either in books, newspapers, magazines, etc. or online: They secured a High Court injunction to stop the publication of a misleading advertisement. The catalogue will be ready for publication in September. A new publication date of April 21 has been agreed.\n[ C ] a book, magazine, report, etc. that is published: The company placed ads in many different publications. print/online/trade publications monthly/weekly publications\n[ U ] the act of giving the public details about a particular thing: Their shares were pushed up nearly 8% after publication of the figures."}