{"id":296227,"name":"publish","type":"verb","us_sound":"ˈpʌb.lɪʃ","us_link":"../audio/p/publish.mp3","uk_sound":"ˈpʌb.lɪʃ","uk_link":"../audio/p/ukpsych019.mp3","content":"Add to word list\nAdd to word list\nB1 to make information available to people, especially in a book, magazine, or newspaper, or to produce and sell a book, magazine, or newspaper: She's just had an article published in their weekend supplement. The government publishes figures every six months showing how many people are unemployed. The names of the winners of the competition will be published in June. She was only 19 when her first novel was published.\nMore examplesFewer examplesHer publishers knew they were taking a gamble when they agreed to publish such an unusual novel.Newspapers publish these outrageous stories because they know what their public wants.She agreed not to publish the names of the people involved.Last week the commission published its long-awaited report on the problem of teenage pregnancies.Photographs were published of her in a compromising position with her bodyguard.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\nrubber stamp\ntypography\nunpublished\nxerography\nSee more results »\nRelated word\npublishing\nAdd to word list\nAdd to word list\nto make available to the public, usually by printing, a book, magazine, newspaper, or other document: [ T ] She was 29 when her first novel was published. [ T ] We plan to begin publishing a newsletter on the Internet.\nAdd to word list\nAdd to word list\nCOMMERCE to produce books, magazines, software, etc. and to make them available to the public by selling them: They publish a range of business books and software.\nCOMMUNICATIONS to print an article in a newspaper or magazine, or to make it available online: The journal does not publish correspondence from readers.publish an article/report/account The Economist published a lengthy article on the subject of debt. Papers presented at the conference are published online.\nCOMMUNICATIONS to make information available to the public: Sales figures are published monthly.publish sth in/on sth Details of the event are published on our website.\nCOMMERCE to print and sell the work of a particular writer: He was first published in the early 1980s. She was already a published author at the age of 23."}