{"id":296214,"name":"publicity","type":"noun","us_sound":"pʌbˈlɪs.ə.t̬i","us_link":"../audio/p/publicity.mp3","uk_sound":"pʌbˈlɪs.ə.ti","uk_link":"../audio/p/ukpsych016.mp3","content":"Add to word list\nAdd to word list\nB2 the activity of making certain that someone or something attracts a lot of interest or attention from many people, or the attention received as a result of this activity: He attracted a lot of adverse/bad publicity with his speech about unmarried mothers. Her first novel was published last year in a blaze of (= with a lot of) publicity. We have planned an exciting publicity campaign with our advertisers. The publicity generated by the court case has given a welcome boost to our sales. The normally publicity-shy director will be making several public appearances for the launch of the movie. The enormous publicity surrounding the case will make it very difficult to hold a fair trial. The pop group's arrival by hot-air balloon was just a publicity stunt (= an unusual way of attracting the public's attention).\nMore examplesFewer examplesTheir marketing strategy for the product involves obtaining as much free publicity as possible.The whole episode was a blatant attempt to gain publicity.They received a lot of adverse publicity about the changes.Lucia is going to do the publicity for the school play.a publicity gimmick\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nIdiom\nany publicity is good publicity\nAdd to word list\nAdd to word list\nthe activity of making certain that someone or something attracts a lot of interest or attention from many people, or the attention received as a result of this activity: The publicity surrounding the case made jury selection difficult. His speech attracted a lot of publicity.\nAdd to word list\nAdd to word list\nthe attention that a person, product, or organization receives from newspapers, television, etc. when something happens that people are interested in: get/receive/seek publicity The book didn't get much publicity when it was published.attract/avoid/generate publicity The new board chairman avoids publicity and contact with outsiders. The publicity surrounding big city bonuses has helped to fuel the public's anger.adverse/negative/unfavourable publicity The high-street chain's sales were hurt by all the negative publicity. bad/good publicity advance/free publicity\nthe business of making sure the public knows about a product, event, organization, etc.: The party hired a top PR firm to create publicity for their election ideas.a publicity budget/campaign/drive The bank has launched a $15 million publicity campaign to reposition itself in a difficult market. a publicity agent/department/manager publicity material/photos"}