{"id":296540,"name":"pull","type":"verb","us_sound":"pʊl","us_link":"../audio/p/pull.mp3","uk_sound":"pʊl","uk_link":"../audio/p/ukpueri015.mp3","content":"pull verb\n(MOVE TOWARDS YOU)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to move something towards yourself, sometimes with great physical effort: Could you help me move this bookcase over there? You pull and I'll push. He pulled the chair away from the desk. He pulled the heavy box across the floor to the door. [ + obj + adj ] He pulled the door open. The car was pulling a caravan. The sun was so strong we had to pull down the blinds. She pulled out the drawer.\nThesaurus: synonyms, antonyms, and examples\nto pull somethingpullPull your chair over here so you can see the screen. dragShe dragged the canoe down to the water.haulThey hauled the boat out of the water.towYou shouldn't drive fast when your car is towing a trailer.yankShe marched to the door and yanked it open.wrenchThe phone had been wrenched from the wall.\nSee more results »\nMore examplesFewer examplesLie on your back, clasp your knees and pull them down towards your chest.He pulled the knob and it just came off (in his hand).We watched in horror as they pulled the bodies from the wreckage.She dipped her oars into the water and pulled.When you pull the strings, the puppet's arms and legs move.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nretract\nretractable\nsuck\ntow\ntow-away\ntractive\ntrail\ntwitch\nyank\nSee more results »\npull verb\n(REMOVE)\nB1 [ T ] to take something out of or away from a place, especially using physical effort: He pulled off his sweater. The dentist pulled both teeth out. I spent the morning pulling up the weeds in the flowerbeds.\n[ T ] to remove or stop something that was going to be published or broadcast, especially because it is found to be offensive or not accurate: When officials realized the cultural gaffe, the company pulled the ad and apologized.\n[ T ] mainly US in sport, to take a player out of a game: The coach pulled his starting pitcher with one out in the fifth inning. The team decided to pull the goalie with one minute left to bring on an extra attacker.\nMore examplesFewer examplesI managed to pull the splinter out with a pair of tweezers.She used a pair of pliers to pull out the nails.I pulled up all my old raspberry canes.We used ropes and crampons to pull ourselves up the mountain.I quickly pulled off my clothes.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nretract\nretractable\nsuck\ntow\ntow-away\ntractive\ntrail\ntwitch\nyank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStop having or doing something\nRemoving and getting rid of things\nCompeting in sport\npull verb\n(MOVE)\nB2 [ I + adv/prep ] to move in the stated direction: During the last lap of the race one of the runners began to pull ahead. We waved as the train pulled out of the station. Our armies are pulling back on all fronts.\nThesaurus: synonyms, antonyms, and examples\nto go backwardsreverseThe road ahead was blocked by a tree so I had to reverse. backI backed into the drive.back upI backed up into an empty parking space.retreatShe retreated hastily back up the stairs.pull backUN peacekeepers have pulled back from the border.withdrawThe British army withdrew from Dunkirk in 1940.\nSee more results »\npull yourself along, up, etc.\nB2 [ T ] to take hold of something and use effort to move your body forwards or up: He put his hands on the side of the pool and pulled himself out of the water.\nSee more\nMore examplesFewer examplesThe guard waved his flag and the train pulled away from the station.The car pulled in at the roadside.He shook his fist at the driver who pulled out in front of him.When he reached out my automatic response was to pull away.The leader is pulling well ahead of the other runners now.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\nmove\npass\nround\nrove\nseethe\nshove\nslip\nSee more results »\npull verb\n(ATTRACT)\n[ T ] to attract a person or people: The show has certainly pulled (in) the crowds.\n[ I or T ] UK informal to succeed in starting a sexual relationship with someone: He certainly knows how to pull women. Did Tracy pull at the nightclub last night?\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizingly\ntempt\ntemptation\ntemptingly\ntickle someone's fancy idiom\nSee more results »\npull verb\n(INJURE)\nC2 [ T ] to injure a muscle by stretching it too much: I pulled a muscle in my back lifting some drawers. He pulled a hamstring.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nSMART Vocabulary: related words and phrases\nInjuring and injuries\nat-risk\nbe in the wars idiom\nbite\nboo-boo\nbrain damage\ndisable\nharm\ninjure\ninjury\nlesion\nlesional\nreinjury\nscarred\nscathe\nsprain\nstrain\ntrample\ntrauma\ntwist\nvictim\nSee more results »\npull verb\n(DISHONEST)\n[ T ] slang to perform a dishonest action: The gang that pulled the bank robbery were all arrested. No one's gonna pull that kind of trick on me!\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfiddle\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nput something across/over someone\nracket\nSee more results »\npull verb\n(INTERNET)\n[ T ]\n&#160; internet &amp; telecoms\n&#160; specialized to get information from the internet, after asking or searching for it: Companies should encourage customers to pull information from their website, thus putting the customer in control. Compare\npush verb (INTERNET) specialized\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFinding and discovering\nIdioms\nlike pulling teeth\nnot pull any/your punches\npull an all-nighter\npull something out of the bag/hat\npull your socks up\npull someone up short\npull your weight\npull a fast one\npull a gun, knife, etc. on someone\npull out all the stops\nMore idioms\npull rank\npull strings\npull the other leg/one (it's got bells on)!\npull the plug\npull the rug/carpet from under someone's feet\npull the strings\npull up short\nPhrasal verbs\npull something/someone apart\npull something apart\npull someone/something aside\npull at something\npull away\npull back\npull someone back\npull something back\npull something down\npull someone down\nMore phrasal verbs\npull down something\npull in/pull into somewhere\npull someone in\npull something off\npull off\npull something on\npull on\npull out\npull (someone/something) out\npull over\npull through (something)\npull (someone) through (something)\npull together\npull something together\npull yourself together\npull someone up\npull something up\npull up\npull noun\n(MOVEMENT TOWARDS YOU)\n[ C usually singular ] the act of pulling something towards yourself: Give the rope a hard pull.\nIvan/Moment/GettyImages\n[ C ] something that you pull to make something work or to open something: a curtain pull a drawer pull\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nretract\nretractable\nsuck\ntow\ntow-away\ntractive\ntrail\ntwitch\nyank\nSee more results »\npull noun\n(ATTRACTION)\n[ C ] something that attracts people: \"How can we persuade people to come to the meeting?\" \"A glass of wine is quite a good pull.\"\n[ U ] the physical or emotional power to attract something: The greater the mass of an object, the greater its gravitational pull. The movie's all-star cast should give it a lot of pull.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizingly\ntempt\ntemptation\ntemptingly\ntickle someone's fancy idiom\nSee more results »\npull noun\n(INFLUENCE)\n[ U ] influence: He's still got quite a bit of pull in the club - he could probably get you elected.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\npull noun\n(IN CRICKET)\n[ C ]\n&#160; sports\n&#160; specialized in cricket, an attacking hit in which the batter (= the player trying to hit the ball) moves the bat (= stick) horizontally and hits the ball to the left side for a right-handed batter or to the right side for a left-handed batter: A beautiful pull sent the ball speeding across the ground to the square leg boundary. She was an excellent batter, particularly fond of pulls, hooks, and cut shots.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdiom\nbe on the pull\npull verb\n(MOVE TOWARD YOU)\nAdd to word list\nAdd to word list\n[ I/T ] to move something toward yourself, sometimes with great physical effort: [ I ] Could you help me move this bookcase over there? You pull and I’ll push. [ T ] Alice lay down and pulled a blanket over her. [ I ] The little girl pulled at his sleeve (= moved it slightly and repeatedly toward her).\npull verb\n(REMOVE)\n[ T ] to take something out of or away from a place, esp. using physical effort: [ M ] The dentist had to pull two of my teeth out. [ M ] I spent the morning pulling up weeds in the garden. She’s asking companies to pull their ads from the program. pulls a weapon on\nSomeone who pulls a weapon on you takes it from a hidden place and points it at you.\npull verb\n(BRING BEHIND YOU)\n[ I/T ] to hold or be attached to the front of something and cause it to move with you: [ T ] The car was pulling a trailer. [ I ] Elise sat on the sled while Carol pulled.\npull verb\n(MOVE IN A DIRECTION)\n[ I always + adv/prep ] to move or move something in the stated direction: Her car pulled out into traffic. The sun was so strong we had to pull down the blinds. He pulled off his wet clothes and laid them out to dry. pull up a chair\nIf you pull up a chair, you move a chair so you can sit with other people: Pull up a chair and join us.\npull verb\n(MOVE YOUR BODY)\n[ I/T ] to move your body or a part of your body: [ I ] He started yelling at the referee and had to be pulled away by teammates. [ T always + adv/prep ] He pulled his arm out just as the doors were closing. [ T always + adv/prep ] She pulled herself up onto the rock.\npull verb\n(OPERATE A DEVICE)\n[ T ] to operate a device that makes a piece of equipment work: She took out a quarter, dropped it into the slot machine, and pulled the lever.\npull verb\n(ATTRACT)\n[ T ] to attract a person or people: She was able to pull more votes than the other candidates. [ M ] The networks are grabbing for any edge that pulls in viewers.\npull verb\n(INJURE)\n[ T ] to injure a muscle by stretching it too much: Marie pulled a hamstring and couldn’t play in the finals.\npull verb\n(BE DISHONEST)\n[ T ] slang to perform an action that is dishonest or intended to deceive: Mikey was pulling his usual stunt of feeding most of his lunch to the cat. Why would you try to pull a trick/prank like that on her?\nIdioms\npull a fast one\npull someone’s leg\npull out all the stops\npull strings\npull the plug\npull the rug out (from under someone)\npull the wool over someone’s eyes\npull yourself together\npull your weightPhrasal verbs\npull (someone/something) through (something)\npull something together\npull away\npull back\npull back (something)\npull down something\npull down something\npull off something\npull out (someone/something)\npull over (someone/something)\nMore phrasal verbs\npull together\npull up\npull up something\npull noun\n(INFLUENCE)\n[ U ] infml influence, esp. with important people: The manufacturer used political pull to get the application approved.\nAdd to word list\nAdd to word list\nto stop providing something or take something away from someone or something: A major partner has threatened to pull all sponsorship. The first step is to pull the advertising for the defective product.pull sth from/out of sth Candies with more than .2 parts per million of lead would be pulled from stores. Elderly savers began to pull their money out of the accounts.\nto attract interest from customers: If it doesn't pull big audiences, what's the point of the festival? A programme with a few star names is sure to pull the crowds.\npull sth/a rabbit out of the hat informal\nto do something unexpected that improves a difficult situation: If they want to survive the crisis, they'll need to pull something out of the hat pretty quickly. The company's in real trouble, and they don't seem to have any rabbits to pull out of the hat.\npull the plug on sth informal\nto stop an activity from continuing: If costs rise any higher, we'll have to pull the plug on the whole project.\npull strings\nto use your personal influence to make things happen: She may be retired, but she can still pull strings in the city. Don't you know anyone who can pull a few strings for us?\npull the strings\nto be the person who is in control of things: He's decided to put in the money himself, rather than let the investors pull the strings Don't ask me. I'm not the one who's pulling the strings.\npull your weight\nto work as hard as other people or as hard as expected and needed: Everyone is expected to pull their weight on this project. Phrasal verbs\npull ahead\npull back\npull sth down\npull down sth\npull sb/sth in\npull sth off\npull out\npull sb/sth out\npull together\npull sth together\n[ U ] influence or power over other people: These people have a lot of pull in government circles. I'm afraid I don't have that much pull with the management.\n[ S ] the ability to attract people: Money has a strong pull for institutions and individuals alike. He tried teaching, but the pull of scientific discovery was greater than that of the academic world."}