{"id":296694,"name":"pulse","type":"noun","us_sound":"pʌls","us_link":"../audio/p/pulse.mp3","uk_sound":"pʌls","uk_link":"../audio/p/ukpueri025.mp3","content":"pulse noun\n(REGULAR BEAT)\nAdd to word list\nAdd to word list\nC1 [ C ] the regular beating of the heart, especially when it is felt at the wrist or side of the neck: The child's pulse was strong/weak. Exercise increases your pulse rate. take someone's pulse\nto hold someone's wrist and count how many times the heart beats in one minute\n[ C ] a short period of energy that is repeated regularly, such as a short, loud sound or a short flash of light: The data, normally transmitted electronically, can be changed into pulses of light.\n[ C or U ] the action of switching power on and off again quickly on a food processor (= an electric machine that cuts and mixes food) to mix food: Give the mixture a pulse or two until it is broken down. Set the food processor to pulse, adding olive oil and herbs.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanterograde\nanti-platelet\nblood donor\nblood vessel\ncapillary\nerectile\nimmunoglobulin\nintravascular\nintravenously\njugular\njugular vein\nplatelet\nvasoactive\nvasoconstriction\nvasodilation\nVEGF\nveined\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nPhysics: energy, force & power\nPreparing food\npulse noun\n(FOOD)\npulses [ plural ]\n&#160; food &amp; drink\n&#160; specialized\nseeds such as beans or peas that are cooked and eaten: Pulses include peas, lentils, and chickpeas.\nGANCINO/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBeans & pulses\naduki\nadzuki\naquafaba\nazuki\nbean\nfava bean\nflageolet\nFrench bean\nfrijole\ngarbanzo bean\npea\npetits pois\npigeon pea\npinto\npinto bean\nsoya bean\nsplit pea\nstring bean\nsugar pea\nsugar snap pea\nSee more results »\nIdioms\nhave/keep your finger on the pulse\nset someone's pulse racing\n[ I ] to move or beat with a strong, regular rhythm: I could feel the blood pulsing through my veins.\n[ I or T ] to mix food by switching a food processor (= an electric machine for cutting or mixing food) on and off again quickly: Place the prawns in a food processor and pulse to a coarse paste.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nsway\nthrash\ntremulously\nvibrate\nvibration\nvibratory\nwaggle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing food\nAdd to word list\nAdd to word list\nbiology a regular rhythm made by blood being moved through your body by your heart, esp. when it is felt at the wrist or side of the neck\nphysics A pulse is also a single burst of light or some other form of energy that is sudden and strong.\nto move with a regular beat: The music pulses with soul, Creole, and Cuban rhythms.\nhave/keep your finger on the pulse (of sth)\nAdd to word list\nAdd to word list\nto be or remain completely aware of what is happening in a situation: He is a talented journalist with his finger on the pulse of the younger generation. Most good agents keep their fingers on the pulse of the housing market."}