{"id":296810,"name":"pumped","type":"adjective","us_sound":"pʌmpt","us_link":"../audio/p/cdo0319uspump1387.mp3","uk_sound":"pʌmpt","uk_link":"../audio/p/cdo0319ukpump1263.mp3","content":"pumped adjective\n(EXCITED)\nAdd to word list\nAdd to word list\nexcited about something that is going to happen: Everyone was so pumped before the game. We were pretty pumped, to say the least.\nThesaurus: synonyms, antonyms, and examples\nfeeling happy and enthusiasticexcitedThe kids are really excited about going on holiday.thrilledWe were thrilled to hear our first grandchild had been born.pumpedUS The players were pumped that they were going to finals.jazzedUS She's totally jazzed that she gets to go on the cruise.exhilaratedI've never seen fans so exhilarated by a win.overexcitedThe kids were overexcited and starting to play up.\nSee more results »\nMore examplesFewer examplesHe used words like \"ecstatic\" and \"pumped\" to describe his reaction to the news.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzestful\nzestfully\nSee more results »\npumped adjective\n(MUSCLES)\n(of muscles) larger than usual because they have filled with blood temporarily after weight training: They crowded around him, feeling his perfectly pumped muscles. There are a lot of scenes of pumped, sweaty, male bodies disporting themselves in locker rooms. When the glycogen is replaced by blood, the muscles are said to be pumped.\n(of a person) having big muscles: A pumped guy with tattoos came over.\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\ncross-trainer\njerk\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nPilates\nresistance training\nSpinning\nstability ball\nstar jump\nsuperheavyweight\nSwiss ball\ntai chi\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBig and quite big"}