{"id":296897,"name":"punctuation","type":"noun","us_sound":"ˌpʌŋk.tʃuˈeɪ.ʃən","us_link":"../audio/p/punctuation.mp3","uk_sound":"ˌpʌŋk.tʃuˈeɪ.ʃən","uk_link":"../audio/p/ukpumme016.mp3","content":"Add to word list\nAdd to word list\nB1 (the use of) special symbols that you add to writing to separate phrases and sentences to show that something is a question, etc.: His letter was completely without punctuation.\nMore examplesFewer examplesYou'll be marked down for poor spelling and punctuation.He had written the letter in appalling handwriting with almost no punctuation.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\nstroke\ntilde\nunbracketed\nuncapitalized\nSee more results »\nGrammar\nPunctuationThe most common punctuation marks in English are: capital letters and full stops, question marks, commas, colons and semi-colons, exclamation marks and quotation marks. …\nPunctuation: capital letters (B, D) and full stops (.)We use capital letters to mark the beginning of a sentence and we use full stops to mark the end of a sentence: …\nPunctuation: question marks (?) and exclamation marks (!)We use question marks to make clear that what is said is a question. When we use a question mark, we do not use a full stop: …\nPunctuation: commas (,)We use commas to separate a list of similar words or phrases: …\nPunctuation: colons (:) and semi-colons (;)We use colons to introduce lists: …\nPunctuation: quotation marks (‘…’ or “…”)Quotation marks in English are ‘…’ or “…”. In direct speech, we enclose what is said within a pair of single or double quotation marks, although single quotation marks are becoming more common. Direct speech begins with a capital letter and can be preceded by a comma or a colon: …\nPunctuation: dashes ( – ) and other punctuation marksDashes are more common in informal writing. They can be used in similar ways to commas or semi-colons. Both single and multiple dashes may be used: …\nPunctuation: numerals and punctuationIn British English the date is usually given in the order day, month, year. …\nSaying email and internet addressesWhen we speak email and web addresses, we say each word separately. To avoid confusion, we sometimes spell out each letter of a word: …\nSymbols and typographic conventions. …\nAdd to word list\nAdd to word list\nspecial marks that are placed in a text to show the divisions between phrases and sentences, or the use of these marks: Check your spelling and punctuation."}