{"id":296983,"name":"punitive","type":"adjective","us_sound":"ˈpjuː.nə.t̬ɪv","us_link":"../audio/p/eus73780.mp3","uk_sound":"ˈpjuː.nɪ.tɪv","uk_link":"../audio/p/ukpumme027.mp3","content":"Add to word list\nAdd to word list\nlaw\n&#160; formal or specialized intended as a punishment: punitive action The UN has imposed punitive sanctions on the invading country. She is suing the newspaper for $5 million punitive damages, claiming they knew the article about her was untrue. Compare\ncompensatory\nused to describe costs that are so high they are difficult to pay: The president has threatened to impose punitive import duties/tariffs on a variety of foreign goods.\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosting too much\nRelated word\npunitively\nAdd to word list\nAdd to word list\nintended as a punishment: No punitive action was taken against Dawkins after he smashed the backboard during warmups.\nAdd to word list\nAdd to word list\nused to describe costs that are so high they are difficult to pay, and that are often used to punish someone or limit their activities: The President has threatened to impose punitive import duties on a range of foreign goods.\nintended as a punishment: punitive action/measures The company will not take punitive action against the striking workers. The UN has imposed punitive sanctions on the invading country. punitively adverb uk/ˈpjuːnətɪvli/\nPeople who are self-employed are often charged punitively high interest rates.\npunitives\n→\npunitive damages"}