{"id":296965,"name":"punish","type":"verb","us_sound":"ˈpʌn.ɪʃ","us_link":"../audio/p/punish.mp3","uk_sound":"ˈpʌn.ɪʃ","uk_link":"../audio/p/ukpumme022.mp3","content":"punish verb [T]\n(CRIME)\nAdd to word list\nAdd to word list\nB1 to cause someone who has done something wrong or committed a crime to suffer, by hurting them, forcing them to pay money, sending them to prison, etc.: Those responsible for these crimes must be brought to court and punished. He punished the class by giving them extra work. The oil company was found guilty on ten counts of pollution, and was punished with a $250 million fine. See also\npunitive\nto punish anyone who commits a particular crime: Drunken driving can be punished with a prison sentence.\nMore examplesFewer examplesEven minor infringements of the law will be severely punished.Instead of simply punishing them, the system encourages offenders to modify their behaviour.He said that when he was a boy, his father used to take a stick to him to punish him.They were punished by being made to stand out in the cold.She was punished for smoking on school premises.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsort\nsort something out\nspare the rod and spoil the child idiom\nSee more results »\npunish verb [T]\n(TREAT BADLY)\nto use or treat something badly, violently, or without care: He really punishes that horse of his.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\ntap\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nunderused\nSee more results »\nAdd to word list\nAdd to word list\nto cause people who have done something wrong or committed a crime to suffer by making them do something they don’t want to do or sending them to prison: She was punished for being late to school. punishable adjective us\nYour browser doesn't support HTML5 audio\n/ˈpʌn·ɪ·ʃə·bəl/\nSwimming in the Potomac is punishable by a fine. punishment noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈpʌn·ɪʃ·mənt/\n[ C ] Serving your community is seen as a punishment these days."}