{"id":297083,"name":"pupil","type":"noun","us_sound":"ˈpjuː.pəl","us_link":"../audio/p/pupil.mp3","uk_sound":"ˈpjuː.pəl","uk_link":"../audio/p/ukpunst008.mp3","content":"pupil noun [C]\n(STUDENT)\nAdd to word list\nAdd to word list\nA2 a person, especially a child at school, who is being taught: a second-year pupil a primary-school pupil The school has over 400 pupils. There is a very relaxed atmosphere between staff and pupils at the school. Her school report described her as a very promising pupil.\nsomeone who is being taught a skill, especially painting or music, by an expert: The painting is believed to be by a pupil of Titian.\nMore examplesFewer examplesThe stupid behaviour of one pupil has brought discredit on the whole school.All pupils are expected to attend school assembly.The government has pooh-poohed the idea that primary schools will begin to select pupils.The vast majority of pupils attend state-funded schools.The artist himself did not paint the backgrounds to his pictures - they were done by his pupils.\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\npupil noun [C]\n(EYE PART)\nthe circular black area in the centre of an eye, through which light enters: Pupils contract in bright light, and dilate in darkness.\nRolando Caponi/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nThe eye & surrounding area\nbeadily\nbeetling\nblink\nbrow\nchoroid\nciliary\ncone\nconjunctiva\ncornea\ncrow's feet\nepiretinal membrane\nextraocular\nhazel\norbital\npalpebral\npeeper\npupillary\nretina\nretinal\nsclera\nSee more results »\npupil noun [C]\n(STUDENT)\nAdd to word list\nAdd to word list\na person who is being taught, esp. a child at school\npupil noun [C]\n(EYE PART)\nthe circular, black area in the center of the eye that gets larger and smaller and lets in light"}