{"id":297174,"name":"purchase","type":"verb","us_sound":"ˈpɝː.tʃəs","us_link":"../audio/p/purchase.mp3","uk_sound":"ˈpɜː.tʃəs","uk_link":"../audio/p/ukpunst013.mp3","content":"Add to word list\nAdd to word list\nB2 to buy something: Tickets must be purchased two weeks in advance. Except under clearly defined circumstances, it is illegal in Britain for a company to purchase its own shares. She purchased her first house with the money. Synonyms\nacquire\nbuy (PAY FOR)\npick something up (BUY)\nsnap something up informal\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\nMore examplesFewer examplesThe land has been purchased by the army.Members will have the opportunity to purchase additional shares in the company at a big discount.Tickets can be purchased in advance from the box office.People wishing to purchase advance tickets should ring our booking line.Life insurance is obligatory when purchasing a house.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nretail therapy\nROBO\nROPO\nsend\nsend (off/away) for/to something\nslate\nSee more results »\npurchase noun\n(BUYING)\nB2 [ C ] something that you buy: How do you wish to pay for your purchases? a major purchase\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\nB2 [ C or U ] the act of buying something: New restrictions have been placed on the purchase of guns. A house is the most expensive purchase that most people ever make. No purchase is necessary for you to enter this competition. This product may be frozen. If required, freeze on day of purchase.\nMore examplesFewer examplesa costly purchaseI've just received a memo from Clark authorizing the purchase of six more computers.Keep your receipt as proof of purchase.Take your purchases to the sales clerk, and he will wrap them for you.Researchers analysed the purchases of 6300 households.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmarque\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\npurchase noun\n(HOLD)\n[ S or U ] a firm hold that allows someone or something to be pulled or lifted without sliding or falling: Dancers use a special powder on their shoes to help them get a better purchase on the floor.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nonto\npinion\nseize\ntaken\nSee more results »\nAdd to word list\nAdd to word list\nto buy something: To qualify for this fare, you must purchase your ticket 21 days in advance. purchaser noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈpɜr·tʃə·sər/\nSoftware purchasers have reported problems with the product.\nPurchase can also mean the act of buying: [ U ] You can apply the value of your old car to the purchase of a new one.\nAdd to word list\nAdd to word list\n[ C ] something that you buy: How do you wish to pay for your purchases?a big/major purchase A car is a major purchase.\n[ C or U ] the act of buying something: No purchase is necessary for you to enter this competition. If you wish to make a purchase, we will require your credit card details. Tax on the purchase of medical equipment can be reclaimed. This product may be frozen. If required, freeze on day of purchase. Similar products are available for purchase in the gift shop. house/ticket/share purchase See also\nadvance purchase fare\nbond purchase agreement\ncompulsory purchase\ncompulsory purchase order\ncounterpurchase\nhire purchase\nimpulse purchase\nmoney-purchase\npoint of purchase\nproof of purchase\nformal to buy something: Tickets must be purchased two weeks in advance.purchase sth for $100/£2000, etc. The company was purchased for £3.5 billion.purchase sth at sth Class A shares may be purchased at the offering price.purchase sth from sth The batteries can be purchased from any electrical store. See also\noffer to purchase\noption to purchase\nrepurchase verb"}