{"id":297188,"name":"pure","type":"adjective","us_sound":"pjʊr","us_link":"../audio/p/pure.mp3","uk_sound":"pjʊər","uk_link":"../audio/p/ukpunst016.mp3","content":"pure adjective\n(NOT MIXED)\nAdd to word list\nAdd to word list\nB1 not mixed with anything else: a pure cotton shirt pure orange juice pure English honey a pure Arab horse\nA pure colour is not mixed with any other colour: a swan's pure white plumage\nA pure sound is clear and perfect: the pure vocal tones of the choirboy\nB1 clean and free from harmful substances: The mountain air was wonderfully pure. Tap water is never chemically pure. Opposite\nimpure\nThesaurus: synonyms, antonyms, and examples\nfree from dirtcleanAre these clothes clean?immaculateThe whole house was immaculate.spotlessHe was wearing a spotless white shirt.spick and spanTheir house is always spick and span.pureI love the pure mountain air.\nSee more results »\nMore examplesFewer examplesa shirt made of pure cottonHe was wearing a suit made from pure silk.Is this plate pure gold?This is a pedigree poodle - her bloodline is pure.Her singing voice has a pure, crystalline quality.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-natural\nnon-toxic\norganically\nrawness\nrefined\nunbleached\nunnatural\nunnaturally\nunprocessed\nuntamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of colour\nDescribing qualities of sound\nClean & tidy\nUnspoilt\npure adjective\n(COMPLETE)\nB2 [ before noun ] complete; only: It was pure coincidence/chance that we met. This last month has been pure hell. Her face had a look of pure delight. The president dismissed the newspaper reports as pure speculation.\n[ before noun ] used to refer to an area of study that is studied only for the purpose of developing theories about it, not for the purpose of using those theories in a practical way: pure mathematics pure economics pure and simple\nused after a noun to mean \"and nothing else\": He is motivated by greed, pure and simple.\nSee more\nMore examplesFewer examplesHis face wore a look of pure contentment.It was pure coincidence that I remembered his phone number.She gave him a look of pure hate.That article was based on pure supposition.The projected sales figures are pure guesswork on our part.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubjects & disciplines\npure adjective\n(MORALLY GOOD)\nbehaving in a way that is morally good, especially in things related to sex: I'm trying to think only pure thoughts. He invited me up to his flat for coffee, but I didn't think that his motives were entirely pure. In many cultures, it is considered important for a woman to keep herself pure (= not to have sex) until she marries. Opposite\nimpure (BAD) literary or humorous\nThesaurus: synonyms, antonyms, and examples\nmorally rightgoodShe is a good woman who goes out of her way to help others.virtuousI believe that humans are, despite their flaws, capable of virtuous conduct.righteousHe refused to stray from the righteous path.honestHe was a hardworking, honest family man who was only trying to do his duty.upstandingI’m sure most of them are honest, upstanding members of society.\nSee more results »\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightly\nrightness\nsaintly\nself-forgetful\nthe road to hell is paved with good intentions idiom\nuprightly\nuprightness\nupstanding\nvirtuous\nvirtuously\nSee more results »\nIdiom\nbe as pure as the driven snow\npure adjective\n(NOT MIXED)\nAdd to word list\nAdd to word list\n[ -er/-est only ] not mixed with anything else: The scarf is pure silk. It was a moment of pure joy. The mountain air was fresh and pure (= not polluted).\npure adjective\n(MORALLY GOOD)\n[ -er/-est only ] morally good, or relating to someone’s inner character: His motives were pure, but his approach was tactless.\npure adjective\n(COMPLETE)\n[ not gradable ] complete; only: Getting the job was pure luck.\npurity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈpjʊr·ət̬·i/\nthe quality or state of not being mixed with anything else: The purity of the city’s water is checked regularly at its reservoirs. purity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈpjʊr·ɪ·t̬i/\nthe quality of having good morals and a good character: purity of heart"}