{"id":297328,"name":"purport","type":"verb","us_sound":"pɝːˈpɔːrt","us_link":"../audio/p/purport.mp3","uk_sound":"pəˈpɔːt","uk_link":"../audio/p/ukpurit008.mp3","content":"Add to word list\nAdd to word list\nto pretend to be or to do something, especially in a way that is not easy to believe: They purport to represent the wishes of the majority of parents at the school. The study purports to show an increase in the incidence of the disease. The tape recording purports to be of a conversation between the princess and a secret admirer.\nThesaurus: synonyms, antonyms, and examples\nto act as if something is true when it is notpretendShe pretended not to know about the surprise.make believeHe's just going to make believe that things are fine in spite of the divorce.play at somethingUK The children are playing at cops and robbers.role-playDuring class, we role-played being a customer and a salesperson to learn words related to shopping. fakeShe's only faking being ill.feignThe police questioned him about the break-in, but he feigned ignorance.\nSee more results »\nSMART Vocabulary: related words and phrases\nSeeming and purporting to be\napparent\nappear\nappearance\nas if/though idiom\nby the look(s) of things idiom\ncome across\ncome off\nformal\noutward\noutwardly\noutwardness\nparallax\npass\npass for sb/sth\nseemingly\nsemblance\nsuperficial\nsuperficiality\nsuperficially\nsurface\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFaking & pretending\nthe general meaning of someone's words or actions: I didn't read it all but I think the purport of the letter was that he will not be returning for at least a year.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbe a badge of something idiom\nconnotation\ni.e.\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nAdd to word list\nAdd to word list\nto claim that something is true, but without proof: The story purports to explain the origin of the game of chess."}