{"id":297338,"name":"purpose","type":"noun","us_sound":"ˈpɝː.pəs","us_link":"../audio/p/purpose.mp3","uk_sound":"ˈpɜː.pəs","uk_link":"../audio/p/ukpurit009.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] why you do something or why something exists: The purpose of the research is to try to find out more about the causes of the disease. His only purpose in life seems to be to enjoy himself. Her main/primary purpose in suing the newspaper for libel was to clear her name. I came to Brighton for/with the express purpose of seeing you. Letters whose sole purpose is to make a political point will not be published. She had the operation entirely for cosmetic purposes. a multi-purpose kitchen knife I can see no useful purpose in continuing this conversation. All my efforts were to no purpose (= failed). He gave her a sum of money which she used to good purpose (= well).\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\non purpose\nB1 If you do something on purpose, you do it intentionally, not by accident: I didn't do it on purpose - it was an accident.\nSee more\nC2 [ U ] determination or a feeling of having a reason for what you do: I've always admired her for her strength of purpose. Parenthood would give him a sense of purpose.\n[ C ] a need: We haven't yet managed to find new premises that are suitable for our purposes. The fabric I bought isn't exactly what I wanted, but it will serve my purposes (= fulfil my needs). serve a purpose\nC2 to have a use: These small village shops serve a very useful purpose.\nSee more\nMore examplesFewer examplesThis room has a dual purpose, serving as both a study and a dining room.Let's try to concentrate on the main purpose of this meeting.The money is intended to be used for specific purposes.The paper charged her with using the company's money for her own purposes.You probably think I'm here to deliver your newsletter, but actually I've come for a very different purpose.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\nthought\ntowards\nundedicated\nundirected\nunfocused\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrength of will and determination\npurpose noun\n(REASON)\nAdd to word list\nAdd to word list\n[ C/U ] an intention or aim; a reason for doing something or for allowing something to happen: [ C ] For budgeting purposes, you really have to start estimating costs now. [ C ] The delay really served no good purpose and may have harmed the negotiation. on purpose\nIf you do something on purpose, you do it intentionally: This is the second time in a row that he didn’t show up, and I believe he did it on purpose.\n[ C/U ] Purpose is also determination: [ U ] The project gave him a renewed sense of purpose.\npurpose noun\n(RESULT)\n[ C ] an intended result or use: This budget is designed to meet one purpose and one purpose only, to do what is best for the economy.\nAdd to word list\nAdd to word list\n[ C ] the reason for doing something or the reason that something exists: sb's purpose in doing sth My purpose in calling this meeting was to remind everyone of some basic rules.with/for the purpose of (doing) sth He learnt Chinese for the express purpose of starting a business there. I went to the conference with the sole purpose of advertising our services.for tax/business/insurance purposes He pays himself a small salary for tax purposes. I can see no useful purpose in speaking to him again. You need to assure shareholders that their investment is being used to good purpose.\n[ U ] determination or a feeling of having a reason for what you do: You need a strong sense of purpose to start your own company.\n[ C ] a need of a particular person or organization: We haven't yet managed to find new premises that are suitable for our purposes. This fabric isn't ideal, but it will serve our purposes. See also\ngeneral-purpose\nmulti-purpose\non purpose\nintentionally, not by accident: I know you didn't delete the database on purpose, but please be more careful.\nserve a purpose\nto have a use: These small village shops serve a very useful purpose.\nbe to no purpose\nto be completely unsuccessful: All my efforts were to no purpose."}