{"id":297311,"name":"purple","type":"adjective","us_sound":"ˈpɝː.pəl","us_link":"../audio/p/purple.mp3","uk_sound":"ˈpɜː.pəl","uk_link":"../audio/p/ukpurit004.mp3","content":"purple adjective\n(COLOUR)\nAdd to word list\nAdd to word list\nA2 of a dark reddish-blue colour: purple plums a dark purple bruise purple with rage (mainly UK purple in the face)\ndark red in the face because of anger: By this point, and purple with rage, all I could think of saying was, \"I think we'll have to agree to disagree.\"\nSee more purple patch\nUK a period of success: Often a company will go through a purple patch of achievement because of a talented director at the helm. United could have extended their lead during a purple patch following the goal.\nMore examplesFewer examplesHer face was covered in purple blotches.He admired the queen's resplendent purple robes.Her face was covered in purple blotches.\nSMART Vocabulary: related words and phrases\nCommon colours\nblue\nbluely\nblueness\nbluey\nbluish\nbrown\nbrownish\ngreen\ngreenish\ngreenly\norange\norangeness\npink\npinkish\npinkness\npurpleness\npurplish\nreddish\nyellowish\nyellowness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess and achievements\npurple adjective\n(STYLE)\nUK used to describe a piece of writing that is complicated or sounds false because the writer has tried too hard to make the style interesting: Despite occasional patches of purple prose, the book is mostly clear and incisive. The prose is quite purple, filled with ridiculous adjectives and unnecessary descriptions. She shuns the purple passage in favour of concise, striking images.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\nfancily\nfinicky\nhigh-tech\nindirectly\ninsolubility\nmultilayer\nonerousness\nornate\nornately\nover-elaborate\ntortuous\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult to understand\npurple adjective\n(POLITICS)\nUS used to describe an area where a similar number of people usually vote Republican and Democrat, so that a small number of votes can change the result in elections: This group of voters has potential to tip the balance in two or more purple states. She has to run against a Democrat in a district that’s mighty purple. Compare\nblue state\nred state\nMore examplesFewer examplesHe's pretty moderate. He's able to win in a purple state.Democrats fear they are about to get punished by their constituents in the \"purple\" districts.Some people think this is a good opportunity for Dems, even though the district isn't quite as purple as some other targets.The party also pulled out big victories across state legislatures, flipping six chambers, turning others purple, and shoring up its supermajorities.\nSMART Vocabulary: related words and phrases\nInternational relations: United States politics & government\nanti-Republican\nbattleground state\nbicameral\nblue state\ncaucus\nconfederacy\nG-man\ngubernatorial\nhomeland security\nHouse Committee\nimpeach\njoint resolution\noverride\nsecret service\nsecretary\nSecretary of State\nsenate\nthe Articles of Confederation\nthe GOP\nthe Republican Party\nSee more results »\nRelated word\npurpleness\nA2 a dark reddish-blue colour: Purple is my favourite colour. The evening sky was full of purples and reds.\nbeyhan yazar/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesI like rich jewel colours, such as purple, blue and green.Arrayed before him were 40 schoolchildren in purple and green.The evening sky was deep pink, with tints of purple and red in it.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ncarmine\ndun\nearth tone\nemerald\npuce\nrust\nsaffron\nsalmon pink\nsanguine\nsapphire\nsky blue\nslaty\ntangerine\ntaupe\nverdure\nSee more results »\nAdd to word list\nAdd to word list\n(of) the color that is a mixture of red and blue: a purple dress [ C ] The walls are a pale purple."}