{"id":297431,"name":"pursuing","type":"verb","us_sound":"pɚˈsuː","us_link":"../audio/p/pursue.mp3","uk_sound":"pəˈsjuː","uk_link":"../audio/p/ukpurit022.mp3","content":"Add to word list\nAdd to word list\npresent participle of\npursue\npursue verb [T]\n(FOLLOW)\nto follow someone or something, usually to try to catch him, her, or it: The car was pursued by helicopters. The hunters spent hours pursuing their prey. He was killed by the driver of a stolen car who was being hotly pursued by the police.\nThesaurus: synonyms, antonyms, and examples\nto chase someone or somethingchaseHe felt like a dog chasing its tail.give chaseHe saw two men breaking into a car and gave chase on foot when they fled. pursueHe was pursued down the corridor by a camera crew.run afterLeaping to his feet, he ran after the bus.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nMore examplesFewer examplesShe said that she was tired of being pursued by crowds of journalists.He ran down the street, hotly pursued by two police officers.The disgraced minister walked swiftly from the car to his house pursued by a whole posse of reporters.He'd been pursuing her for months and then she finally agreed to go out with him.I don't think we should pursue this matter any further.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisherman\nfishhook\nfishing line\nfishing rod\nfly fishing\nfox hunt\noverfishing\npiscatory\npoach\npoaching\npointer\npredation\nquarry\nspear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPursuing\npursue verb [T]\n(TRY TO GET)\nto try very hard to persuade someone to accept a job: The company has been pursuing Holton for some time, but so far he has rejected all their offers.\nto try to discover information about a subject: We will not be pursuing this matter any further. The police are currently pursuing several lines of inquiry into the case. I don't think this idea is worth pursuing any further. The press has pursued this story relentlessly.\nto try very hard to persuade someone to have a relationship with you: He's been pursuing her for months and yet she's so clearly not interested.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\nRelationships: finding a partner\npursue verb [T]\n(TRY TO DO)\nC1 If you pursue a plan, activity, or situation, you try to do it or achieve it, usually over a long period of time: He decided to pursue a career in television. We need to decide soon what marketing strategy we should pursue for these new products. Michael Evans is leaving the company to pursue his own business interests. She is ruthless in pursuing her goals.\nMore examplesFewer examplesThe company is aggressively pursuing new business opportunities.The government is pursuing a policy of containment.He used to play with a group but now he's pursuing a solo career.We should pursue every avenue in the search for an answer to this problem.The government pursued every diplomatic channel to free the hostages.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »"}