{"id":297472,"name":"push","type":"verb","us_sound":"pʊʃ","us_link":"../audio/p/push.mp3","uk_sound":"pʊʃ","uk_link":"../audio/p/ukpurit029.mp3","content":"push verb\n(USE PRESSURE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to use physical pressure or force, especially with your hands, in order to move something into a different position, usually one that is further away from you: Can you help me move this table? You push and I'll pull. The window sticks - you have to push hard to open it. He helped me push my car off the road. He pushed his plate away from him, refusing to eat any more. She pushed her hair out of her eyes. I tried to push the door open but it was stuck. It isn't clear whether he fell off the balcony or was pushed. To turn the television on, you just push (= press) this button. He pushed the money into my hand (= forcefully gave me the money), saying, \"Please take it.\" We pushed the boat off from (= moved the boat forward by using pressure against) the river bank.\nMore examplesFewer examplesOur car broke down and we had to push it off the road.Why will supermarket trolleys never move in the direction that you push them?I pushed the wheelchair up the ramp and into the supermarket.The wind was pushing the boat further and further out to sea.If we push the table back against the wall, we'll have more room.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush off\nrib\nshoulder\nthrust\nupend\nupset\nwrangle\nSee more results »\npush verb\n(MOVE WITH FORCE)\nB1 [ I or T, usually + adv/prep ] to move forcefully, especially in order to cause someone or something that is in your way to move, so that you can go through or past them: Stop pushing - wait your turn. She pushed through the crowd. I'm sorry - I didn't mean to push in front of you. The celebrities pushed past the waiting journalists, refusing to speak to them. In the final lap of the race, he managed to push (= move strongly) ahead. Weeds push (= grow strongly) up through the cracks in the concrete. They pushed (= forcefully made) their way to the front.\n[ I usually + adv/prep ] When an army pushes in a particular direction, it moves forward in that direction: The invading troops have pushed further into the north of the country.\nMore examplesFewer examplesI tried to push past her but she barred my way.In the end she used brute force to push him out.The children were pushing and jostling in the line.As he went by, he deliberately pushed me.We managed to push our way through the crowd.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush off\nrib\nshoulder\nthrust\nupend\nupset\nwrangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nAttacking & invading\npush verb\n(PERSUADE WITH FORCE)\nB2 [ T ] to forcefully persuade or direct someone to do or achieve something: Her parents pushed her into marrying him. The school manages to push most of its students through their exams. If we want an answer from them by Friday, I think we're going to have to push them for it. [ + to infinitive ] We had to push them to accept our terms, but they finally agreed to the deal. You'll never be successful if you don't push yourself (= work) harder.\nMore examplesFewer examplesI don't think he really wants to go, he's been pushed into it.The police have finally pushed her into testifying against him.She'll have to push herself if she wants to pass the exam.I try not to push my kids too hard, it only puts them off.She's pushed her body to the absolute limit and now she's exhausted.\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »\npush verb\n(ADVERTISE)\n[ T ] informal to advertise something repeatedly in order to increase its sales: They're really pushing their new car.\nMore examplesFewer examplesThey're really pushing that new toothpaste.During the interview she used every opportunity to push her latest novel.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\npush verb\n(SELL DRUGS)\n[ T ] informal to sell illegal drugs: He was arrested for pushing drugs to schoolchildren.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\npush verb\n(INTERNET)\n[ T ]\n&#160; internet &amp; telecoms\n&#160; specialized to send information over the internet without receiving a request for it first Compare\npull verb (INTERNET) specialized\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nIdioms\nbe pushing up (the) daisies\npush your luck\npush the boat outPhrasal verbs\npush someone around\npush ahead\npush along\npush someone/something aside\npush something back\npush for something\npush (something) forward\npush yourself forward\npush in\npush off\nMore phrasal verbs\npush on\npush someone out\npush someone/something over\npush something through\npush (someone) toward(s) something\npush something up/down\npush noun\n(PRESSURE)\nB1 [ C ] the act of moving someone or something by pressing them with your hands or body: Get on the swing and I'll give you a push. I gave the door a hard push, but it still wouldn't open. I can order all these goods at the push of a button (= by pushing a button).\nMore examplesFewer examplesThey had to give the car a push to start it.Go on - give it a good hard push!You can't expect to get everything you need at the push of a button.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush off\nrib\nshoulder\nthrust\nupend\nupset\nwrangle\nSee more results »\npush noun\n(STRONG MOVEMENT)\n[ C ] a strong movement towards a place: The army is continuing its push (= advance) towards the capital.\nSMART Vocabulary: related words and phrases\nAdvancing and moving forward\nadvance\nadvancing\nballistically\nbeeline\ncome\ncome over\ncome up\ncruise\ngain\nghost\nglide\nhead\nlead\nmake for somewhere/something\nmake towards something/someone\nproceed\nprogress\npull\nrun\nslide\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\npush noun\n(ATTEMPT)\n[ C ] a determined attempt to get an advantage over other companies in business: The company plans to make a big push into the European market next spring. [ + to infinitive ] The hotel is making a major push to attract customers.\nSMART Vocabulary: related words and phrases\nEffort and expending energy\nassiduity\nassiduous\nassiduously\nassiduousness\nbe running on empty idiom\nburn\neffort\neffortful\neffortfully\nelbow grease\nfight\nhamster wheel\nkill\nperseverance\nplough\nplough through something\nput something in/put something into something\nrearguard action\nstruggle\nswing\nSee more results »\npush noun\n(ENCOURAGEMENT)\nC1 [ S ] encouragement to make someone do something: My mother had always wanted to learn how to paint - she just needed a gentle push.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nstoke\nurge\nSee more results »\npush noun\n(ADVERTISING)\n[ S ] a lot of advertising: This film is unlikely to attract large audiences unless it gets/it is given a big push in the media.\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ncustomer relationship management\ndetoxify\ndifferentiator\ndogfooding\nflyer\no.n.o.\noff-brand\non-brand\noverexpose\noverexposure\ntie (something) in\ntout\nunadvertised\nunbilled\nunbranded\nSee more results »\nIdioms\nat a push\nget the push\ngive someone the push\nif/when push comes to shove\npush verb\n(USE FORCE AGAINST)\nAdd to word list\nAdd to word list\n[ I/T ] to put a continuing force against something to cause it to move forward or away from you: [ I ] We should be able to move this table if we both push together. [ T ] She pushed her plate away.\n[ I/T ] To push is also to cause something to move or change in a stated direction: [ M ] Rising demand tends to push prices up.\npush verb\n(MOVE FORCEFULLY)\n[ I/T ] to move forcefully through a group of people or things: [ I ] Stop pushing and wait your turn! [ T always + adv/prep ] Rescuers pushed their way through the rubble to reach survivors.\npush verb\n(PERSUADE FORCEFULLY)\n[ T ] to try to persuade someone forcefully to do or accept something: She’s pushing me for an answer. The administration is pushing its new trade agreement with Mexico. infml This restaurant is pushing its carrot soup today (= trying to get people to order it).\nPhrasal verbs\npush someone around\npush back something\npush for something\npush off\npush on\npush noun [C]\n(FORCEFUL MOVEMENT)\na force put or pressed against something that causes it to move forward or away from you: She gave her daughter a push on the swing.\npush noun [C]\n(FORCEFUL PERSUASION)\nan attempt to persuade someone forcefully to do or accept something: [ + to infinitive ] Florida is making a major push to attract more tourists. Idiom\nwhen push comes to shove\nAdd to word list\nAdd to word list\n[ I or T ] to press a switch or something similar: When I push the 'call' button, my phone makes a strange noise.\n[ T ] to force someone to move away from a place: Small farmers are saying they have been pushed off their land by the supermarket.\n[ T ] to try hard to make someone do what you want, especially when they do not really want to do it: She feels the sales rep pushed her into buying the vehicle.push sb for sth If we want an answer from them by Friday, I think we're going to have to push them for it.push sb to do sth We had to push them to accept our terms, but they finally agreed to the deal.\npush yourself\nto use a lot of effort and determination to achieve something: You'll never be successful if you don't push yourself.\n[ T ]\n&#160; MARKETING\n&#160; informal to try hard to make people buy something, especially by advertising it repeatedly: We need to really push this product in the spring, ready for the summer season.\nbe pushed for time\nto not have much time to do something: If you're pushed for time, we could meet tomorrow instead.\nPhrasal verbs\npush ahead\npush sth back\npush sth down\npush for sth\npush sth out\npush sth through\npush sth up\n[ S ]\n&#160; MARKETING an effort to make something more successful, for example by advertising it a lot or giving it extra money: The event is part of a major push by the hotel to attract customers.get a push This film is unlikely to attract large audiences unless it gets a big push in the media.give sth a push This is an economy that needs the Fed to step in and give it a push.\n[ C ] a determined effort to get an advantage over other companies in business: make a push into sth The company plans to make a big push into the European market next spring.\ngive sb the push\nWORKPLACE, HR\n&#160; UK informal to tell someone that they no longer have a job, especially because they have done something wrong: I have no idea why they gave me the push.\nget the push\nWORKPLACE, HR\n&#160; UK informal to be told that you no longer have a job, especially because you have done something wrong: Sounds like he hasn't come to terms with getting the push."}