{"id":297555,"name":"put","type":"verb","us_sound":"pʊt","us_link":"../audio/p/put.mp3","uk_sound":"pʊt","uk_link":"../audio/p/ukpushc016.mp3","content":"put verb\n(MOVE)\nAdd to word list\nAdd to word list\nA1 [ T + adv/prep ] to move something or someone into the stated place, position, or direction: Where have you put the keys? Put your clothes in the cupboard. He put salt into the sugar bowl by mistake. She put her bag on the table. She put her hands over her eyes. I put my arm around him to comfort him. We always put the cat out (= outside the house) at night. Every night, she puts out her clothes (= takes them from where they are kept so that they are ready) for the next day. If we put the chairs a little closer together (= move them nearer to each other), we should be able to get another one around the table. If you put together (= mix) yellow and blue paint you get green. The prisoners were put up against (= moved into a position next to) a wall and shot.\nMore examplesFewer examplesI've put the beer in the fridge to chill.Why don't we put the bed against the wall?Aha, that's where I put my keys!Throw your gun down and put your hands in the air.I emptied the closet and put my belongings into the black overnight case.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nput verb\n(WRITE)\nA2 [ T + adv/prep ] to write something: She puts her name in all her books. Put an X next to the name of the candidate you want to vote for. I've put the date of the party down in my diary. He asked me to put my objections (down) on paper. It was an interesting article but I wish they'd put in more information (= included more information) about the costs.\nMore examplesFewer examplesPut your name at the top of each sheet.I put something about my previous work experience.This is where you have to put your family details.Put the address in the top, right-hand corner.She put that she wanted to work in the media.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nput verb\n(EXPRESS)\nC2 [ T usually + adv/prep ] to express something in words: She wanted to tell him that she didn't want to see him any more, but she didn't know how to put it. We're going to have to work very hard, but as Chris so succinctly put it, there's no gain without pain. Why do you always have to put things so crudely? Has everyone had a chance to put their point of view? put a price/value/figure on something\nto say what you think the price or value of something is: The agent has put a price of £720,000 on our house.\nSee more to put it bluntly, simply, mildly, etc.\nused to describe the way you are expressing an event or opinion: To put it bluntly, you're going to have to improve.\nSee more\nMore examplesFewer examplesTo put it simply - I think she's wrong.\"What's her new boyfriend like?\" \"Well, how shall I put it? He's unusual.\"You really should try to put things a bit more tactfully - you've upset her now.This sentence is rather confusing - how can we put it a bit more clearly?On yesterday's programme, we heard the actor put his views on media harassment very forcefully.\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nevery\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nobserve\nphrase\nquoth\nsay\nspoken\nstring\ntalk sense idiom\nthink\nverbalize\nvolunteer\nSee more results »\nput verb\n(CONDITION)\nB2 [ T ] to cause someone or something to be in the stated condition or situation: Are you prepared to put your children at risk? This puts me in a very difficult position. What has put you in such a bad mood? This election is a chance for the country to put a new government in (= elect a new government). It's broken into so many pieces, it'll be impossible to put it back together again (= repair it). Let's give her the chance to put her ideas into practice. The terrorists were put on trial (= their case was judged in a court of law) six years after the bombing. Wilson was put out (of the competition) (= was defeated) by Clarke in the second round. [ + adj ] How much did it cost to have the television put right (= repaired)? I originally thought he was Australian, but he soon put me straight (= corrected me) and explained he was from New Zealand. I know she's gone forever, but I just can't put her out of my mind/head (= forget her). He's putting me under pressure to change my mind.\nMore examplesFewer examplesThat walk has put some colour in your cheeks.If you can't control your dog, put it on a lead!My doctor's put me on a course of antibiotics.The doctor put me on a low-salt diet to reduce my blood pressure.We put up our tents and made a small fire.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nput verb\n(OPERATION)\n[ T usually + adv/prep ] to bring into operation; to cause to be used: When the drugs failed to cure her, she put her faith/trust in herbal medicine. The school puts a lot of emphasis on teaching children to read and write. He's putting pressure on me to change my mind. The events of the last few weeks have put a real strain on him. In the story of Sleeping Beauty, the wicked fairy puts a spell/curse (US hex) on the baby princess. You know it was your fault, so don't try to put the blame on anyone else. The government is expected to put a new tax on cars. The new tax will put 15 percent on fuel prices (= increase them by 15 percent). She's never put a bet/money on a race before. He put everything he had into (= he used all his abilities and strength in) the final game. The more you put into something, the more you get out of it (= the harder you work at something, the more satisfying it is). They put (= invested) a lot of money into the family business. The president is trying to put through (= bring into operation) reforms of the country's economic system. They've got to put an end to/a stop to their fighting (= to stop fighting).\nMore examplesFewer examplesThe latest education reforms have put extra pressure on teachers.Johnson was influential in persuading the producers to put money into the film.Their constant arguments were putting a strain on their marriage.She tried to cure the pain in my knee by putting manual pressure on the joint.You must try to put a curb on your spending habits.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nput verb\n(JUDGE)\n[ T + adv/prep ] to judge something or someone in comparison with other similar things or people: I'd put him among the top six tennis players of all time. Drama critics have put her on a level/par with the great Shakespearean actresses. He always puts the needs of his family first/last (= they are the most/least important thing to him).\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nput verb\n(SAIL)\n[ I + adv/prep ] to travel in a boat or ship across the sea: Our mast broke, so we had to put about (= turn round) and return to port. The ship put in at (= stopped at) Cape Town for fresh supplies. We put to sea (= began our journey by sea) at dawn.\nSMART Vocabulary: related words and phrases\nSailing & boating\nage of sail\naweigh\nbale\nbargee\nbargeman\nbear away\nmaritime\nocean-going\noutsail\nportage\nrafter\nrafting\nsail\nsailing\nsea legs\nseafaring\nseamanship\nseaworthy\nshipboard\nunder sail idiom\nSee more results »\nGrammar\nPutThe irregular verb put means ‘move something into a particular place’. The past simple form is put and the -ed form is put: …\nIdioms\nput your back into something\nput yourself in someone's place/position/shoes\nput someone to something\nput it about\nput it there!\nput one over on someone\nput the shot\nput the squeeze on someonePhrasal verbs\nput something about/around\nput something across/over someone\nput something across\nput yourself across\nput something aside\nput something at something\nput something away\nput someone away\nput something back\nput something before someone\nMore phrasal verbs\nput something behind you\nput something by\nput something/someone down\nput something down\nput someone down\nput (something) down (somewhere)\nput someone down somewhere\nput someone down as something\nput someone down for something\nput something down to something\nput something/someone forward\nput something forward\nput something in\nput something in/put something into something\nput (something) in\nput in for something\nput something into something\nput something off\nput someone off\nput someone off (something)\nput someone off (something/someone)\nput something on\nput someone on\nput someone on something\nput someone onto something\nput something out\nput someone out\nput yourself out\nput out\nput something over/across\nput someone through something\nput someone through\nput something to someone\nput something together\nput something towards something\nput something up\nput up something\nput something/someone up\nput someone up\nput up\nput someone up to something\nput up with something/someone\nbe put upon\nput verb\n(MOVE)\nAdd to word list\nAdd to word list\n[ T always + adv/prep ] to move something or someone into the stated place, position, or direction: She put her arm around him. Put your clothes in the closet. When you set the table, put the soup spoons next to the knives. She put her coffee cup on the table. The movie was so scary that she put her hands over her eyes. put someone to bed\nIf you put someone to bed, you dress the person in the clothes worn for sleeping and see that the person gets into bed: I’ll call back after I put the kids to bed.\nput verb\n(WRITE)\n[ T always + adv/prep ] to write down or record: Put your name on the list if you want to go. Put an answer in the space provided.\nput verb\n(EXPRESS)\n[ T ] to express something in words: She wanted to tell him that she didn’t want to see him any more, but she didn’t know how to put it. He has difficulty putting his feelings into words.\n[ T ] If you put something in a particular way, you express it that way: To put it bluntly, Pete, you’re just no good at the job. Dad was annoyed, to put it mildly.\nput verb\n(CONDITION)\n[ T ] to cause something to be in the stated condition or situation: Are you prepared to put your children at risk? This puts me in a very difficult position. What put you in such a bad mood?\nput verb\n(JUDGE)\n[ T always + adv/prep ] to judge something or someone in comparison with other similar things or people: I’d put him among the top six tennis players of all time. The value of the painting has been put at $1.5 million. He always puts his family first. Idioms\nI wouldn’t put it past someone (to do something)\nput a damper on something\nput down roots\nput an end to something\nput your feet up\nput your finger on something\nput your foot down\nput your foot in your mouth\nput in a good word for someone\nput your heads together\nMore idioms\nput someone in his/her place\nput yourself in someone’s place\nput someone on\nput someone/something out of your mind\nput the brakes on something/someone\nput the squeeze on something/someone\nput someone/something through his/her/its paces\nput someone/something to the test\nput two and two together\nput words in someone’s mouth\nPhrasal verbs\nput something across\nput something before someone/something\nput something behind someone\nput someone down\nput something down\nput something into something\nput someone off\nput someone on something\nput someone out\nput something over on someone\nMore phrasal verbs\nput someone through\nput someone through something\nput someone to something\nput something to someone\nput something toward something\nput someone up to something\nput aside something\nput aside something\nput away something\nput away something\nput away someone\nput back something\nput down something/someone\nput down something\nput down someone\nput down something\nput forward/forth something\nput in something\nput in (something)\nput in something\nput in something\nput off something/someone\nput on something\nput on something\nput on something\nput on something\nput on something/someone\nput out something\nput out something\nput out something\nput out something\nput out something\nput together something\nput together something\nput up something\nput up something\nput up something\nput up something\nput up someone\nput up something\nput up with someone/something\nAdd to word list\nAdd to word list\n[ T ] to move something into a particular place: Can you put the file on my desk when you've finished with it, please? We put the money in the safe at the end of each day.\n[ T ] to write down or record information: Put your full name at the top of the form. It's a good report, but you haven't put in anything about the costs. You can save a lot of time and effort by putting your accounts on a computer.\n[ T ] to express something in words: I hate these designs, but I don't know how to put it in a tactful way. We're going to have to work very hard, but as Chris so succinctly put it, there's no gain without pain.\n[ T ] to cause someone or something to be in a particular condition or situation: put sb in a difficult/awkward/embarrassing, etc. position This puts me in a very difficult position.put sth into effect/practice Let's give her the chance to put her ideas into practice. I don't know what the problem is, but we have two days to put it right.put sb under pressure/strain/stress He put me under pressure to change my mind.put sb out of business/work/a job Unemployment benefits for those put out of work have been extended for six months.\n[ T ] to officially begin using something: The government is expected to put a new tax on cars. The government put through a law requiring equal access to buildings for disabled people.\n[ T ] to judge something or someone in comparison with other similar things or people: put sb/sth among sb/sth His four-year deal put him among the country's highest earners.put sb/sth first/tenth/50th, etc. Washington's quarterly rate of one foreclosure for every 436 households put it 21st among states.\nput a price/value/figure on sth\nto say what you think the price or value of something is: They've put a price of €2 million on the factory.\nto put it bluntly/simply/briefly, etc.\nto express something in a particular way: To put it bluntly, you're going to have to improve. Phrasal verbs\nput sth across\nput yourself across\nput sth aside\nput sth at sth\nput sth away\nput sth back\nput sth before sb\nput sth before sth\nput sth by\nput sth down\nMore phrasal verbs\nput sth/sb forward\nput sth in\nput sth in/into sth\nput in for sth\nput sth off\nput sth out\nput sb out\nput sth over\nput sb through\nput sth to sb\nput sth together\nput sth up\n→\nput option"}