{"id":297661,"name":"puzzle","type":"noun","us_sound":"ˈpʌz.əl","us_link":"../audio/p/puzzle.mp3","uk_sound":"ˈpʌz.əl","uk_link":"../audio/p/ukputz_002.mp3","content":"Add to word list\nAdd to word list\nC2 [ S ] a situation that is difficult to understand: Scientists have been trying to solve this puzzle for years. The situation remains a puzzle to all of us.\nA2 [ C ] a game or toy in which you have to fit separate pieces together: The building blocks are like the pieces of a puzzle. a jigsaw puzzle\nDorling Kindersley/GettyImages\na problem or question that you have to answer by using your skill or knowledge: a crossword puzzle a puzzle book\nMore examplesFewer examplesShe had a complex personality that was a real puzzle to me.This puzzle has astronomers scratching their heads.Planning the camera shots can be like putting together a puzzle.Why don't you sit down and draw or do a puzzle?I spent hours reasoning out the solution to the puzzle.\nSMART Vocabulary: related words and phrases\nConfusion, confusing and feeling confused\naddled\nall of a doodah idiom\nall over the place idiom\nalphabet soup\nat sea idiom\ndazedly\nDelphic\ndisarray\ndiscombobulation\ndisordered\nmuddily\nmuddle\nmuddle something up\nmuddle-headed\nmuddled\ntopsy-turvy\nturmoil\nunaccountable\nunaccountably\nunexplained\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous games & activities\nC1 [ T ] to cause someone to feel confused and slightly worried because they cannot understand something: The findings of the survey puzzle me - they're not at all what I would have expected. [ + question word ] It puzzles me why she said that. Synonym\nflummox informal\n[ I + adv/prep ] to try to solve a problem or understand a situation by thinking carefully about it: Management are still puzzling about how the accident could have happened. Scientists are puzzling over the results of the research.\nMore examplesFewer examplesThe events of that night have been puzzling me for a long time.Experts were puzzled by the reports.What puzzles me is why he should have left without telling me.The games have cunning solutions, designed to keep you puzzling for just long enough to be satisfying.He had been puzzling for days about how to get into the files.\nSMART Vocabulary: related words and phrases\nPuzzle and confuse\naddle\nbaffle\nbedazzle\nbefuddle\nbemuse\ncloud\nconfuse\ndiscombobulate\ndisorientate\ndo someone's head in idiom\nflummox\nfox\nloop\nravel\nsearch\nthrow\nthrow (someone) a curve (ball)/curveball idiom\nthrow someone off balance idiom\ntie\ntie someone (up) in knots idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nConfusion, confusing and feeling confused\nPhrasal verb\npuzzle something out\nAdd to word list\nAdd to word list\nsomething that is difficult to understand: Their son is a puzzle to them. The police are trying to solve the puzzle of who sent them the letter.\nA puzzle is also a game or toy in which you have to fit separate pieces together, or a problem or question which you have to answer by using your skill or knowledge: a jigsaw/crossword puzzle puzzled adjective us\nYour browser doesn't support HTML5 audio\n/ˈpʌz·əld/\nShe looked puzzled, then suspicious."}