{"id":298022,"name":"quadruple","type":"verb","us_sound":"kwɑːˈdruː.pəl","us_link":"../audio/q/quadruple.mp3","uk_sound":"kwɒdˈruː.pəl","uk_link":"../audio/q/ukqed__019.mp3","content":"Add to word list\nAdd to word list\nto become four times as big, or to multiply a number or amount by four: The number of students at the college has quadrupled in the last ten years. We expect to quadruple our profits this year.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ncoefficient\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nrecursion\nround something down\nsubtraction sign\ntable\ntimes\ntreble\nSee more results »\nfour times as big: a quadruple measure We have had quadruple the number of applicants we expected.\ninvolving four parts, people, places, etc.: a quadruple fracture of his thumb\n[ before noun ]\n&#160; music\n&#160; specialized with four beats (= emphases) in a bar (= one of the small equal parts into which written music is divided): The prologue consists of 11 slow bars in quadruple time. The quadruple metre is established by the vocal part.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\npurely\nquintuple\nsolitarily\nsolitary\ntrilateral\ntrilaterally\ntriply\nunit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTechnical music terms\nBeats or lengths of musical notes\nAdd to word list\nAdd to word list\nto become or make something four times greater: [ I ] The number of students at the college quadrupled in the last ten years.\nconsisting of four parts, or four times greater in amount, number, or size: My father had quadruple bypass heart surgery.\nAdd to word list\nAdd to word list\nto become four times as much or as many, or to make something four times as much or as many: The stock has more than quadrupled over the last three years. Its share price has quadrupled since going public last June.quadruple to sth Since then, sales have quadrupled to about 10,000 a month.quadruple from sth to sth Sales nearly quadrupled from 4 million gallons a year to 14 million.quadruple in size/value/price During his time at the top, the company quadrupled in size.\na size, amount, price, etc. four times as big as something else: This figure is roughly quadruple the amount authorized in 2002.\nfour times the size, amount, price, etc.: a quadruple jump in sales"}