{"id":298172,"name":"quality","type":"noun","us_sound":"ˈkwɑː.lə.t̬i","us_link":"../audio/q/eus73797.mp3","uk_sound":"ˈkwɒl.ə.ti","uk_link":"../audio/q/ukquali007.mp3","content":"quality noun\n(STANDARD)\nAdd to word list\nAdd to word list\nB1 [ C or U ] how good or bad something is: a shop advertising top quality electrical goods The food was of such poor/low quality. Their products are of very high quality. I only buy good-quality wine. The quality of the picture on our television isn't very good.\nThesaurus: synonyms, antonyms, and examples\nof bad qualitybadThe food wasn’t as bad as I’d expected.poorTheir efforts produced extremely poor results.low/poor/bad qualityTheir sausages are made with low-quality meat.mediocreThe striker has been dropped after a mediocre performance.inferiorThe copies are of inferior quality.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nB1 [ U ] a high standard: He's not interested in quality. All he cares about is making money. quality of life\nthe level of enjoyment, comfort, and health in someone's life: My quality of life has improved tremendously since I moved to the country.\nSee more\nMore examplesFewer examplesWhat the problem comes down to is 'Will the consumer be willing to pay more for a higher quality product?'Is there any significant difference in quality between these two items?Price alone is not a reliable indicator of quality.Poor quality is the unacceptable face of increased productivity.These improvements in quality are the first fruits of our investment.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nprestige\nqualitative\nstar\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuitable and acceptable\nquality noun\n(CHARACTERISTIC)\nB2 [ C ] a characteristic or feature of someone or something: leadership qualities He has a lot of good qualities but being organized isn't one of them. [ + to infinitive ] I don't think he has the right qualities to be a teacher. This cheese has a rather rubbery quality to it (= it is like rubber).\nMore examplesFewer examplesHer singing voice has a pure, crystalline quality.There's a dreamlike quality to the final stages of the film.Her voice had an extraordinary hypnotic quality.Her beauty had an incandescent quality to it.Cyril's most impressive quality was his innate goodness.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\njib\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nB1 [ before noun ] of a high standard: This is a quality product.mainly UK The story received little coverage in the quality papers (= more serious newspapers).\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\n[ after verb ] informal very good: That gig was quality.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nshining\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformal words for good\nquality noun\n(EXCELLENCE)\nAdd to word list\nAdd to word list\n[ U ] the degree of excellence of something, often a high degree of it: Our company guarantees the quality of our merchandise.\n[ U ] Quality often refers to how good or bad something is: The fabric was of the highest quality.\nquality noun\n(CHARACTERISTIC)\n[ C ] a characteristic or feature of someone or something: We’re looking for someone who loves children and has the qualities of a good teacher.\nquality adjective\n(EXCELLENT)\nof a high standard; excellent: This is a quality product.\nAdd to word list\nAdd to word list\n[ C or U ] how good or bad something is: quality of sth We constantly seek to improve the quality of service we give to our customers. This raises questions about the quality of management within the company. We've been very happy with the quality of work they have delivered in recent months.good/top/high quality British toys used to be good quality, not cheap mass-produced stuff. They sell organic products of the highest quality.poor/low quality We were shocked at the poor quality of some of the furniture.improve/decline in quality His line manager believes his work had declined in quality.picture/build/sound quality This type of TV delivers stunning picture quality.\n[ U ] a high standard: They claim their brand name is a guarantee of quality. The company is committed to quality.\n[ C, usually plural ] a good feature of a person's character: She has demonstrated great leadership qualities in continuing the company's success through a very difficult year. Personal qualities and commitment are more important for the job than educational qualifications. Inspectors normally need a degree, but exceptions are occasionally made for candidates with the right qualities.\n[ C ] a characteristic or feature of something, that makes it different from other things: What qualities would you expect a German car to have? We will combine the best qualities of both companies with a focus on our future, not our past. See also\ncredit quality\nfair average quality\nhigh-quality\nlow-quality\nMARKETING of a high standard: We ensure that only quality products are sold on our website. a reputation for making quality fuel-efficient vehicles"}