{"id":298167,"name":"qualifying","type":"verb","us_sound":"ˈkwɑː.lə.faɪ","us_link":"../audio/q/qualify.mp3","uk_sound":"ˈkwɒl.ɪ.faɪ","uk_link":"../audio/q/ukquali004.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nqualify\nqualify verb\n(FINISH TRAINING)\nB2 [ I or T ] to successfully finish a training course so that you are able to do a job; to have or achieve the necessary skills, etc.: She hopes to qualify (as a lawyer) at the end of the year. [ + obj + to infinitive ] This course qualifies you to teach in any secondary school.\nMore examplesFewer examplesHe qualified as a vet last year.It takes three years to qualify as a social worker.What do you need to do to qualify as a speech therapist.It took her nine years to qualify as an architect.The course would qualify you to work abroad.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\nqualify verb\n(HAVE RIGHT)\nB2 [ I or T ] to have the legal right to have or do something because of the situation you are in, or to cause someone to have such a right: She doesn't qualify for maternity leave because she hasn't been in her job long enough. To qualify for the competition you need to be over 18. Being a single parent qualifies you for extra benefits. [ + obj + to infinitive ] figurative He thinks the fact that he's worked here longer than the rest of us qualifies him (= gives him the right) to tell us all what to do.\nMore examplesFewer examplesHe had to show that he had a well-founded fear of persecution on religious or political grounds to qualify as a refugee.Will we qualify for legal aid?Do you think Scotland will qualify for the European Championship finals?The area qualifies for designation as a site of special scientific interest.If you work for 16 or more hours a week, you may qualify for Working Families Tax Credit.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nqualify verb\n(GET INTO COMPETITION)\nB2 [ I ] to succeed in getting into a competition: Nigeria was the first team to qualify for the World Cup. England has to win tonight's qualifying match to advance to the next round of the competition. Our goal has always been to reach the qualifying rounds of the Champions League.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nqualify verb\n(LIMIT)\n[ T ] to limit the strength or meaning of a statement: I'd like to qualify my criticisms of the school's failings, by adding that it's a very happy place.\n[ T ]\n&#160; language\n&#160; specialized In grammar, a word or phrase that qualifies another word or phrase limits its meaning and makes it less general: In the sentence \"He walked quickly along the road\", \"quickly\" and \"along the road\" qualify \"walked\".\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstraitly\nstranglehold\nstunt\nsuffocatingly\ntempered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: grammatical terms"}