{"id":298161,"name":"qualified","type":"adjective","us_sound":"ˈkwɑː.lə.faɪd","us_link":"../audio/q/qualified.mp3","uk_sound":"ˈkwɒl.ɪ.faɪd","uk_link":"../audio/q/ukquali002.mp3","content":"qualified adjective\n(TRAINED)\nAdd to word list\nAdd to word list\nB1 having finished a training course, or having particular skills, etc.: Tim is now a qualified architect. What makes you think that you are qualified for this job? [ + to infinitive ] I'm not qualified to give advice on such matters.\nMore examplesFewer examplesIf you want a qualified accountant, their services don't come cheap.A qualified teacher, he moonlighted as a cabbie in the evenings to pay the rent.He might have told you he was a qualified electrician, but the truth is quite otherwise.He is well qualified for the job, but he does lack personality .My starting salary as a newly qualified teacher wasn't enough to support a family.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nrecertify\nredundancy\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkilled, talented and able\nqualified adjective\n(LIMITED)\nlimited: There seems to be qualified support for the idea.\nSMART Vocabulary: related words and phrases\nLack of freedom to act\nbe in bondage to something idiom\nbe locked in something\nbondage\nbound\nboxed in\ndisempowered\ndisempowering\ndisenfranchisement\nheel\nlock\nnon-voluntary\nparalytic\nregimented\nservitude\nshackle\nsomeone's hands are tied idiom\ntethered\nthumb\ntie\nunder someone's thumb idiom\nSee more results »\nAdd to word list\nAdd to word list\nhaving the standard of skill, knowledge, or ability that is necessary for doing or being something: She was extraordinarily well qualified to run the State Department.\nAdd to word list\nAdd to word list\nHR having successfully finished a course of study or training, or having particular skills: a qualified accountant/teacher/engineer As a qualified accountant, she had plenty of experience of applying strict financial disciplines. Teachers often have big problems finding other jobs, even though they're highly qualified.qualified for sth His military expertise made him uniquely qualified for the position.qualified to do sth I can't think of anyone better qualified to take over."}