{"id":298156,"name":"qualification","type":"noun","us_sound":"ˌkwɑː.lə.fəˈkeɪ.ʃən","us_link":"../audio/q/qualification.mp3","uk_sound":"ˌkwɒl.ɪ.fɪˈkeɪ.ʃən","uk_link":"../audio/q/ukquali001.mp3","content":"qualification noun\n(TRAINING)\nAdd to word list\nAdd to word list\nB1 [ C ] an official record showing that you have finished a training course or have the necessary skills, etc.: You'll never get a good job if you don't have any qualifications. Do you have any teaching/legal/medical/secretarial/academic qualifications?\nB2 [ C or U ] an ability, characteristic, or experience that makes you suitable for a particular job or activity: Some nursing experience is a necessary qualification for this job. [ + to infinitive ] One of the qualifications you need to work here is a sense of humour!\nMore examplesFewer examplesCandidates with a qualification in Chemistry have exemption from this course.The preparatory certificate is the minimum qualification required to teach English in most language schools.No formal qualifications are required for the work - you'll get on-the-job training.With her qualifications and experience, she would seem to be ideally suited to the job.Please list your educational qualifications and work experience.\nSMART Vocabulary: related words and phrases\nQualifications: school & vocational\nA level\nAS level\nbac\nbaccalaureate\nbona fides\ncertified\nCSE\ndiploma\nGCE\nGCSE\nHNC\nHND\nHSC\nHSED\nmatric\nOrdinary level\nparaprofessional\nrecertification\nVantage\nWaystage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\nqualification noun\n(COMPETITION)\nC1 [ U ] success in getting into a competition: The win earned them qualification for the World Cup finals.\nSMART Vocabulary: related words and phrases\nParts & stages of competitions\na game in hand idiom\nadded time\nbracket\ncup tie\nevent\nfinal\nfull time\nhalf\nhand\nkick\nkick off\nlap\nlap of honour phrase\nleg\nquarter\nsqueaky-bum time\ntimeout\nvictory\nvictory lap\nwalkover\nSee more results »\nqualification noun\n(LIMIT)\n[ C ] an extra piece of information that limits the effect of something that you say or write: [ + that ] The doctor said I can leave hospital today, but with the qualification that I have to come back every day to get the dressing changed.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nqualification noun\n(SKILL)\nAdd to word list\nAdd to word list\n[ C usually pl ] knowledge, skill, or some other characteristic that gives a person the ability or the right to do or have something: I assume my qualifications for the job will be considered along with theirs.\n[ C usually pl ] A qualification is also a level of skill or ability that you have to achieve to be allowed to do something: Passing the advanced Red Cross life-saving course is a qualification for all our lifeguards.\nqualification noun\n(LIMITATION)\n[ C/U ] the act of limiting the use or range of a statement you make, or a particular limitation to a statement: [ U ] I can recommend Helen Hefferman for this position without qualification.\nAdd to word list\nAdd to word list\n[ C ] an official record showing that you have successfully finished a course of training or study, have the skills necessary to do something, etc.: Salary will depend on qualifications and experience.gain/get/obtain a qualification Graduates are encouraged to gain professional qualifications.teaching/coaching/surveying qualifications Do you have any teaching qualifications? formal/academic/vocational qualificationsa qualification in sth A degree or equivalent qualification in tourism is desirable. I wasn't very good at school and left at 15 with no qualifications. Knowledge and character rather than paper qualifications are important in a successful manager.\n[ C ] an ability, characteristic, or experience that makes you suitable for a particular job or activity: He listed his experience of project management as a qualification for the job. She has all the right qualifications for this difficult assignment.qualification to do sth Eternal optimism is the qualification you need above all to be a technology fund manager. See also\nbona fide occupational qualification"}