{"id":298236,"name":"quantity","type":"noun","us_sound":"ˈkwɑːn.t̬ə.t̬i","us_link":"../audio/q/eus73803.mp3","uk_sound":"ˈkwɒn.tə.ti","uk_link":"../audio/q/ukquali019.mp3","content":"Add to word list\nAdd to word list\nB1 the amount or number of something, especially that can be measured: Police found a large/small quantity of drugs in his possession. We consumed vast quantities of food and drink that night. The (sheer) quantity (= large amount) of equipment needed for the trip is staggering. They are now developing ways to produce the vaccine in large quantities and cheaply. This recipe is only for four, so I usually double the quantity if I'm cooking for my family. It's quality not quantity that really counts.\nMore examplesFewer examplesThis quantity of lasagne will feed six people.Forensic examination revealed a large quantity of poison in the dead man's stomach.He consumes vast quantities of chips with every meal.The quantities given in the recipe should be enough for four servings.Erupting volcanoes discharge massive quantities of dust into the stratosphere.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquota\nration\nsmall-scale\nso much idiom\nstrength\nSee more results »\nGrammar\nAmount of, number of or quantity of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nAmount of or number of?We use amount of with uncountable nouns. Number of is used with countable nouns: …\nA quantity of or quantities of?Quantity is more formal than amount or number. A quantity of or quantities of can be followed by a countable noun or an uncountable noun. They are most commonly used with an adjective such as huge, big, large, small: …\nAdd to word list\nAdd to word list\nthe amount or number of something, or a particular amount or number: [ C ] a large/small quantity [ C ] She served each of us a vast quantity of spaghetti.\nAdd to word list\nAdd to word list\n[ C ] an amount or number of something, especially one that can be measured: quantity of sth A sudden surge in the quantity of stock available would almost certainly depress the price.huge/large/vast quantity Asian central banks have been buying huge quantities of Treasury bonds.in large/small quantities Supermarkets, being able to buy in large quantities, can offer their customers the best prices.\n[ U ] used to talk about how much there is of something, rather than its quality: Our focus is on quality, not quantity. While quantity is of course important, quality must remain the highest priority.\n[ C or U ] a large amount or number of something: Poorer people can't afford to bulk buy and save by purchasing in quantity. The sheer quantity of detail makes the book a valuable tool.a quantity of sth Officers seized computer equipment as well as a quantity of cash and drugs in the raids.\nSee also\nbill of quantities\neconomic order quantity\nequilibrium quantity"}