{"id":298265,"name":"quarantine","type":"noun","us_sound":"ˈkwɔːr.ən.tiːn","us_link":"../audio/q/quarantine.mp3","uk_sound":"ˈkwɒr.ən.tiːn","uk_link":"../audio/q/ukquali021.mp3","content":"quarantine noun\n(PEOPLE OR ANIMALS )\nAdd to word list\nAdd to word list\n[ C or U ] a specific period of time in which a person or animal that has a disease, or may have one, must stay or be kept away from others in order to prevent the spread of the disease: The doctor said I could go home as long as I agreed to stay in quarantine for at least seven days. Owners risk having to leave their pets abroad or put them in quarantine if they fail to follow the rules. The government announced mandatory quarantines for high-risk travellers returning from countries with Ebola outbreaks.\n[ U ] mainly US a general period of time in which people are not allowed to leave their homes or travel freely, so that they do not catch or spread a disease: I’ve been doing a lot of baking during quarantine. The country has been hit hard, with many people under quarantine and food supplies scarce. The couple created a podcast to showcase their quarantine life while raising funds for people affected by the pandemic. Compare\nlockdown\nSMART Vocabulary: related words and phrases\nFevers & infectious diseases\nague\nanti-malaria\nanti-malarial\nanti-plague\nanti-typhoid\ndelirious\nglandular fever\nheatstroke\nhelicobacter pylori\nHPV\nLassa fever\nleishmaniasis\nmeasles\nmumps\nnotifiable\nscarlatina\nscarlet fever\nsleeping sickness\nsunstroke\nyeast infection\nSee more results »\nquarantine noun\n(PLANTS OR PRODUCTS)\n[ C or U ] a period of time in which something such as a product or plant that is infected or poisonous, or that contains substances that could be dangerous, is kept in a place where it cannot harm anyone or anything until it is no longer dangerous or can be dealt with safely: Oregon has imposed an emergency quarantine on oak firewood from California to slow the spread of the fungus. Please note that certain pharmaceutical items are subject to quarantine and customs restrictions in some countries. If a radiation alarm is confirmed for a shipment, Radiation Protection agents will order it to be put into quarantine.\nquarantine noun\n(PLACES)\n[ C or U ] a period of time in which people or animals are not allowed to enter or leave a particular area or building where some or all of those in it have been affected by a harmful substance or disease, until the danger of harming others has passed: Two farms north of the city were placed under quarantine due to an anthrax outbreak among livestock. The office was put into a brief quarantine on Friday after an editor opened a Halloween card with a powdery substance. Patients taking radioactive iodine must stay in quarantine in hospital for 24 hours to avoid exposing other people to radiation.\nquarantine verb\n(PEOPLE OR ANIMALS)\n[ I or T ] to stay away from others for a period of time because you have a disease, or may have one, in order to prevent the spread of the disease: All international arrivals, regardless of where they are from, must quarantine upon their arrival. The government is looking into how long those who have been exposed to COVID-19 need to quarantine. A friend of mine had symptoms but instead of quarantining himself he decided to carry on as normal.\n[ T ] to keep a person or animal away from others because they have a disease, or may have one, in order to prevent the spread of the disease: It's not uncommon to quarantine passengers after a widespread illness appears to be present on board a plane. The dogs are being quarantined for 10 days because it was not clear whether they are up to date on rabies shots. Two weeks ago, authorities quarantined 1,222 cattle that had eaten feed containing cattle byproducts.\nSMART Vocabulary: related words and phrases\nZoology: veterinary medicine\naltered\nanimal doctor\nanti-rabies\ncastrate\ncastrated\ncastration\ncollar\ndistemper\nfoam\nlame\nleptospirosis\nmange\nmangy\nneutered\nnosema\nput something to sleep idiom\nput something/someone down\nrescue centre\nscrapie\nveterinary\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFevers & infectious diseases\nquarantine verb\n(PLANTS OR PRODUCTS)\n[ T ] to keep something such as a product or plant that is infected or poisonous, or that contains substances that could be dangerous, in a place where it cannot harm anyone or anything until it is no longer dangerous or can be dealt with safely: If the traps capture a certain number of flies in a particular area, fruit from that area is quarantined until the end of the season. After a single bag of rice tested positive for melamine, the company decided to quarantine the entire shipment. The items were quarantined after a reported exposure to asbestos\nquarantine verb\n(PLACES)\n[ T ] to prevent people or animals from entering or leaving a particular area or building where some or all of those in it have been affected by a harmful substance or disease, until the danger of harming others has passed: Ranches with confirmed cases of foot-and-mouth disease are quarantined until at least 10 days after all livestock are vaccinated. The hotel has been quarantined due to an outbreak of legionnaire’s disease\nAdd to word list\nAdd to word list\na period of time during which a person or animal that might have a disease is kept away from other people or animals so that the disease cannot spread: The horse had to spend several months in quarantine when it reached this country. quarantine verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkwɑr·ənˌtin, ˈkwɔr-/\nHe was quarantined with mumps, which is highly contagious.\nAdd to word list\nAdd to word list\na period of time during which an animal or person that might have a disease is kept away from other people or animals so that the disease cannot spread: be/keep sth/put sth in quarantine About 6,000 hogs are being kept in quarantine pending further testing. Australian airports have introduced quarantine regulations in a bid to prevent the spread of the disease.\nto keep an animal or person away from other animals or people to prevent them from spreading a disease: The worker was quarantined for five days and directed to wear a mask to protect others."}