{"id":298284,"name":"quarrel","type":"noun","us_sound":"ˈkwɔːr.əl","us_link":"../audio/q/eus75898.mp3","uk_sound":"ˈkwɒr.əl","uk_link":"../audio/q/ukquali023.mp3","content":"Add to word list\nAdd to word list\nB2 an angry disagreement between two or more people or groups: They had a bitter quarrel about/over some money three years ago and they haven't spoken to each other since. We have no quarrel with the people of your country (= we have no reason to disagree with or dislike them). They seem to have patched up their quarrel (= finished their disagreement and started to be friendly). Synonyms\nargument (DISAGREEMENT)\ndisagreement\ndispute\nrow (ARGUMENT) mainly UK\nrun-in (ARGUMENT) informal\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nMore examplesFewer examplesDon't let one little quarrel come between you.Eventually, the duelling politicians agreed to end their quarrel.She's always raking up that old quarrel.They had a quarrel last night and now they're not on speaking terms with each other.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndisagreement\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\nspat\nsquabble\nSee more results »\nB2 to have an angry disagreement with someone: What did you quarrel about/over? She quarrelled with everyone in the village. Synonyms\nargue (DISAGREE)\ndisagree\ndispute\nrow mainly UK informal\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nalienation\nargue with someone\nargumentatively\nbandy\nbet\nbone\nconflict\ncross swords idiom\nhammer\nlock horns idiom\npiggy in the middle\nprovocateur\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nPhrasal verb\nquarrel with something\nAdd to word list\nAdd to word list\nan angry disagreement between people, groups, or countries: A big family quarrel left Judith and me in tears.\nto disagree with someone in an angry, often loud way: We heard our neighbors quarreling about/over money. Phrasal verb\nquarrel with something"}