{"id":298441,"name":"quaternary","type":"adjective","us_sound":"ˈkwɑː.t̬ɚ.ner.i","us_link":"../audio/q/cdo0318usquat3971.mp3","uk_sound":"kwəˈtɜː.nər.i","uk_link":"../audio/q/epd23470.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time from about 2.5 million years ago to the present, in which modern humans appeared: Layers of basalt, formed during the Quaternary period, extend from north to south and east to west. Quaternary glaciation\nMore examplesFewer examplesThe earlier of the two geological epochs of the Quaternary period is termed the Ice Age in the northern hemisphere.The group will investigate coastal processes and assess these in the context of late Quaternary and Holocene conditions.Although Citlaltépetl is a Quaternary volcano with historic activity, it is at present in a dormant stage.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Quaternary\nthe period of time from about 2.5 million years ago to the present, in which modern humans appeared: The last 2 million years of the Earth's history is known as the Quaternary. He achieved an international reputation as a student of the Quaternary and his book The Great Ice Age became a classic.\nMore examplesFewer examplesThree lakes within the study area fluctuated in size and depth during the late Quaternary. During the Quaternary, they were invaded from time to time by thick wedges of debris flows.In many geomorphological histories the Quaternary was often treated in less detail and the Holocene seldom referred to at all.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}