{"id":298540,"name":"queen","type":"noun","us_sound":"kwiːn","us_link":"../audio/q/queen.mp3","uk_sound":"kwiːn","uk_link":"../audio/q/ukquart015.mp3","content":"queen noun [C]\n(WOMAN)\nAdd to word list\nAdd to word list\nA2 a woman who rules a country because she has been born into a royal family, or a woman who is married to a king: How long did Queen Victoria reign? The Queen is meeting the prime minister today.\nany woman who is considered to be the best at what she does: She's the reigning queen of crime writers.\nThesaurus: synonyms, antonyms, and examples\nsomeone famouscelebrityThe magazine is all about the lives of celebrities.celebWhich celeb recently spent $60,000 on an engagement ring?slebUK She was last spotted interviewing a minor sleb on the red carpet.starHer ambition was always to become a movie star.superstarRock superstar Elton John grew up working class in England.legendHe became a legend in his own lifetime.\nSee more results »\nMore examplesFewer examplesThe queen may have privilege but she has no real political clout.The queen, in full ceremonial dress, presided over the ceremony.The queen will attend the official opening of the theatre in June.The queen outlasted all her children.The country was without a ruler after the queen died.\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmiss\nmister\nmonarch\nmonarchist\nroyalist\nroyally\nRt. Hon.\nShah\nsheikh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGood and excellent things\nqueen noun [C]\n(GAMES)\nthe most powerful piece on the board in the game of chess\nAnthony Bradshaw/ Photographer's Choice/GettyImages\nin a set of playing cards, a card with a picture of a queen on it. It is usually worth less than a king.\ncaptivecookie/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\nendgame\nforfeit\ngambit\nmove\npawn\npin\nqueenside\nre-roll\nresign\nrook\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCard games\nqueen noun [C]\n(INSECTS)\nin a group of insects, a single large female that produces eggs: a queen bee a queen ant a queen wasp\nSMART Vocabulary: related words and phrases\nInsect names\nanopheles\nant\naphid\nbeastie\nbedbug\ndragonfly\ndust mite\nearwig\nearworm\nelm bark beetle\nhousefly\ninsect\njigger\nladybird\nlepidopterist\nsow bug\nspider mite\nstick insect\nswallowtail\ntermite\nSee more results »\nqueen noun [C]\n(GAY MAN)\nslang offensive a gay man, especially an older man, whose way of behaving is noticeable and artificial: James is such an old queen.\nAdd to word list\nAdd to word list\na woman who rules a country because she has been born into a family which by tradition or law has the right to rule, or the title given to such a woman: Queen Elizabeth II\nA queen is also a woman who is considered to be the best in some way: the reigning queen of crime writers a beauty queen\nIn the game of chess, the queen is the most powerful piece on the board.\nA queen is also a playing card with a picture of a queen on it: the queen of hearts\nIn a group of insects, a queen is a large female that produces eggs: a queen bee"}