{"id":298657,"name":"query","type":"noun","us_sound":"ˈkwɪr.i","us_link":"../audio/q/query.mp3","uk_sound":"ˈkwɪə.ri","uk_link":"../audio/q/ukquart022.mp3","content":"Add to word list\nAdd to word list\nB2 a question, often expressing doubt about something or looking for an answer from an authority: If you have any queries about your treatment, the doctor will answer them. Synonyms\nenquiry UK\nquestion\nMore examplesFewer examplesWhat was their response to your query?He could always do something useful instead of wasting my time with footling queries.Most of the job involves sorting customers out who have queries.I've got a query about my tax.We have received many written queries about the product.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nto ask questions, especially in order to check if something is true or correct: A few students have queried their marks. [ + question word ] She queried whether three months was long enough. [ + speech ] \"Any chance of a cup of tea?\" he queried hopefully. Synonyms\nask (QUESTION)\nquestion\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuestioning people & asking questions in general\nAdd to word list\nAdd to word list\na question, often one expressing doubt about something or looking for information query verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkwɪr·i, ˈkwer·i/\nLawyers queried Ann about what she wore that day.\nAdd to word list\nAdd to word list\na question, often expressing doubt about something or looking for an answer from someone: Email your comments, queries, or suggestions to us at this address. We regret that we cannot answer every query. If you have any queries, please don't hesitate to ask.a query about sth I have a query about the second item on the agenda. See also\nPDQ\nsearch query\nto express doubt about something or ask for more information: Someone in the accounts department had queried his expense claim. The Revenue is unlikely to query such an arrangement unless the sums are particularly large in relation to your income.query whether/why/how He queries whether there is really sufficient demand to warrant another model."}