{"id":298710,"name":"question","type":"noun","us_sound":"ˈkwes.tʃən","us_link":"../audio/q/question.mp3","uk_sound":"ˈkwes.tʃən","uk_link":"../audio/q/cdo0216quesuk1582.mp3","content":"question noun\n(ASKING)\nAdd to word list\nAdd to word list\nA1 [ C ] a sentence or phrase used to find out information: The police asked me questions all day. Why won't you answer my question? \"So where is the missing money?\" \"That's a good question.\" (= I don't know the answer.) There will be a question-and-answer session (= a period when people can ask questions) at the end of the talk.\nA2 [ C ] in an exam, a problem that tests a person's knowledge or ability: Answer/Do as many questions as you can.\nMore examplesFewer examplesShe adroitly avoided the question.She asked the question expecting an affirmative.I'm afraid you've completely misunderstood the question.I don't think that question is relevant, counselor.You can find the answer to almost any question in cyberspace.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nquestion noun\n(PROBLEM)\nB2 [ C ] any matter that needs to be dealt with or considered: This raises the question of teacher pay. What are your views on the climate change question?\nB2 [ U ] doubt or confusion: There's no question about (= it is certain) whose fault it is. Whether children are reading fewer books is open to question (= there is some doubt about it). Her loyalty is beyond question (= there is no doubt about it). There's no question that he's guilty. someone/something in question C2 formal\nthe person or thing that is being discussed: I stayed at home on the night in question.\nSee more\nMore examplesFewer examplesThe question of security is high on the agenda for this afternoon's meeting.The committee has deliberated the question at great length.There is a wide diversity of opinion on the question of unilateral disarmament.Both projects are on ice until the question of funding is resolved.Leaving aside the question of cost, how many people do we need on the job?\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUncertainty\nGrammar\nQuestionsA question is anything we write or say which requires a response. In writing, questions are usually followed by a question mark: …\nResponding to wh-questionsWh-questions ask for information and we do not expect a yes-no answer to a wh-question. We expect an answer which gives information: …\nAdding emphasis to wh-questionsWe can add emphasis to wh-questions in speaking by stressing the auxiliary verb do. We usually do this when we have not already received the information that we expected from an earlier question, or to show strong interest. …\nNegative wh-questionsWhen we ask negative wh-questions, we use the auxiliary verb do when there is no other auxiliary or modal verb, even when the wh-word is the subject of the clause: …\nAdding a wh-word at the end of a statement to make a questionIn speaking, we can sometimes turn wh-questions into statement questions: …\nIntonation and wh-questionsThe intonation of wh-questions is normally falling. The falling intonation is on the most important syllable: …\nPrepositions and particles with wh-questionsWe can use wh-words and phrases after prepositions in more formal questions: …\nQuestions: alternative questions (Is it black or grey?)An alternative question gives a choice of two or more answers in the question and includes or: …\nForming alternative questionsWe usually form alternative questions with an auxiliary verb (be, do or have) + subject + main verb or with a modal verb + subject + main verb: …\nDifferent types of alternative questionWe can also ask alternative questions using or not? This is a very direct question and sometimes it can express annoyance or impatience: …\nReduced alternative questions (tea or coffee?)Sometimes in informal speaking, we make alternative questions shorter by just saying the alternatives: …\nResponding to alternative questionsWe can answer an alternative question in different ways, but we do not normally answer yes: …\nQuestions: echo and checking questionsWe use echo questions to repeat part of what we have just heard when we don’t fully understand or when we want to confirm what we have heard. We use rising or fall-rising intonation: …\nQuestions: follow-up questionsIn conversation, we often ask short questions about something that somebody else has just said. There are a number of types. …\nQuestions: statement questions (you’re over 18?)We can use statements (declaratives) to ask yes-no questions. In writing we know they are questions because they have question marks. In speaking we know they are questions because of the context, and often because of their intonation: …\nQuestions: two-step questionsIn speaking, we sometimes ask two questions together. The first question is just an introduction for the listener. We use these especially when we don’t want to be too direct: …\nTwo-step yes-no questionsWe sometimes use yes-no questions one after the other. The first question is an introduction to the topic and the speaker usually knows the answer. The second question is more specific. …\nPre-questions in two-step questionsSometimes we ask if we can ask a question. This is very polite: …\nTwo-step questions that suggest the answerWe also use two-step questions to first ask a question and then suggest an answer with a rising or fall-rising intonation. The speaker is quite sure of the answer and wants the listener to confirm it: …\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nQuestions: yes-no questions (Are you feeling cold?)Questions that need either a yes or a no answer are called yes-no questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nQuestions: short formsIn informal situations, especially in speaking, we can reduce questions rather than using complete clauses. Short questions can be clauses, phrases or even single words: …\nQuestions: typical errorsIn wh-questions, the word order changes from subject + (auxiliary/modal) + main verb to wh-word + auxiliary/modal verb + subject + main verb: …\nForming yes-no questionsWe form yes-no questions with an auxiliary verb (be, do or have) + subject + main verb or with a modal verb + subject + main verb: …\nResponding to yes-no questionsOther ways of saying yes and no include yeah, yep, mm, okay, and nah, nope. These are informal: …\nNegative yes-no questionsWe usually use negative yes-no questions to check or confirm something we believe or expect to be the case, or when we consider that something is the best thing to do: …\nIntonation and yes-no questionsThe intonation of yes-no questions is normally either rising [ri↗sing arrow] or fall-rising [dow↘n u↗p arrow] intonation depending on the meaning. If we do not know the answer, we use rising intonation. If we more or less know the answer and are looking for confirmation, we use fall-rising intonation: …\nQuestions: wh-questionsWh-questions begin with what, when, where, who, whom, which, whose, why and how. We use them to ask for information. The answer cannot be yes or no: …\nForming wh-questionsWe usually form wh-questions with wh- + an auxiliary verb (be, do or have) + subject + main verb or with wh- + a modal verb + subject + main verb: …\nYou seeWe commonly use you see in speaking when we want to share knowledge with our listener or listeners. When we use you see, we assume that the listener or listeners do not have the knowledge that we want them to have: …\nIdioms\nbe a question of doing something\nbe out of the question\nB2 to ask a person about something, especially officially: Several men were questioned by police yesterday about the burglary. 68 percent of those questioned in the poll thought noise levels had increased.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\nB2 to express doubts about the value or truth of something: I questioned the wisdom of taking so many pills. [ + question word ] Results from a study questioned whether treatment with the drug really improved survival. She gave me a questioning look (= as if she wanted an answer from me).\nMore examplesFewer examplesAll my attempts to question the authorities on the subject were met by evasion and prevarication.Police have released a picture of the man they want to question.A man is being questioned in relation to the attempted murder last night.Under a quarter of people questioned said that they were happily married.When questioned on TV, the minister retracted his allegations.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuspecting & questioning\nGrammar\nYou seeWe commonly use you see in speaking when we want to share knowledge with our listener or listeners. When we use you see, we assume that the listener or listeners do not have the knowledge that we want them to have: …\nquestion noun\n(SOMETHING ASKED)\nAdd to word list\nAdd to word list\n[ C ] a word or words used to find out information: May I ask you a personal question? Our help line will answer your questions about patient care.\nquestion noun\n(PROBLEM)\n[ C/U ] a matter to be dealt with or discussed, or a problem to be solved: [ C ] Your article raises the question of human rights. [ C ] It’s simply a question of getting your priorities straight. [ C ] The question is, are they telling the truth? [ U ] I was at home on the night in question.\n[ C/U ] In an exam, a question is a problem that tests a person’s knowledge: [ C ] Answer as many questions as you can.\nquestion noun\n(DOUBT)\n[ U ] doubt or uncertainty: He’s competent – there’s no question about that. Her loyalty is beyond question.\nquestion verb [T]\n(ASK)\nto use a word or words to find out information: Mom’s always questioning me about my friends. The police questioned several men about the burglary.\nIf you question something, you express doubt or uncertainty about it: [ + question word ] The book questions whether people today are better off than their parents were.\nAdd to word list\nAdd to word list\n[ C ] a sentence or phrase that asks for information: ask (sb) a question Can I ask a question, Gail?answer a question Not one assistant correctly answered all the questions they were asked.have a question Does anybody have any questions?\n[ C ] a subject or problem: We return to the question of whether pay for performance really motivates employees. One very difficult question is how to charge market prices for energy.\n[ C, U ] a feeling of doubt about something: There is some question as to what is the best strategy. The ethics of some of his business deals are open to question.raise questions about sth His evidence raised questions about the credibility of a key eyewitness. See also\nscaled question\nbring/call sth into question\nto express doubt about something: If somebody calls something into question, then let's stop and review it.\nto make people feel doubt about something: The chief executive's popularity has sunk to levels that bring his legitimacy into question.\nin question\nthat is being discussed: For shareholders of the company in question the idea of a takeover must be appealing.\nif something is in question, no-one knows what is going to happen to it: The automaker's future remains in question.\nout of the question\nif something is out of the question, it definitely will not or cannot happen: A pay rise is out of the question.\nto ask someone questions about something: He does not know why authorities decided to question him.question sb about/on sth Employers are not legally allowed to question job candidates about their plans to have children.\nto express doubts about something: Increasingly, the return on huge software investments made to improve efficiency was being questioned."}