{"id":298717,"name":"questioned","type":"verb","us_sound":"ˈkwes.tʃən","us_link":"../audio/q/question.mp3","uk_sound":"ˈkwes.tʃən","uk_link":"../audio/q/ukquart024.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nquestion\nB2 to ask a person about something, especially officially: Several men were questioned by police yesterday about the burglary. 68 percent of those questioned in the poll thought noise levels had increased.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\nB2 to express doubts about the value or truth of something: I questioned the wisdom of taking so many pills. [ + question word ] Results from a study questioned whether treatment with the drug really improved survival. She gave me a questioning look (= as if she wanted an answer from me).\nMore examplesFewer examplesAll my attempts to question the authorities on the subject were met by evasion and prevarication.Police have released a picture of the man they want to question.A man is being questioned in relation to the attempted murder last night.Under a quarter of people questioned said that they were happily married.When questioned on TV, the minister retracted his allegations.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuspecting & questioning\nGrammar\nYou seeWe commonly use you see in speaking when we want to share knowledge with our listener or listeners. When we use you see, we assume that the listener or listeners do not have the knowledge that we want them to have: …"}