{"id":298752,"name":"queue","type":"noun","us_sound":"kjuː","us_link":"../audio/q/cue.mp3","uk_sound":"kjuː","uk_link":"../audio/q/ukcsa__023.mp3","content":"Add to word list\nAdd to word list\nB1 mainly UK (US usually line) a line of people, usually standing or in cars, waiting for something, or a lot of people who want something: Are you in the queue for tickets? There was a long queue of traffic stretching down the road. If you want tickets you'll have to join the queue.disapproving It makes me mad when someone jumps the queue (= goes straight to the front). There's a queue of companies wanting to sell the product.\nYellow Dog Productions/Stone/GettyImages\ncomputing, internet &amp; telecoms\n&#160; specialized a series of pieces of data, files to be printed, calls, etc. that are waiting to be dealt with by a computer, telephone system, etc.: I turned the printer off and cleared the print queue. If the printer queue is blocked, a user can clear their own documents from the queue, but not anybody else's. With the new system, the calls will stack up in a queue, rather than callers being forced to call back because they keep getting a busy signal.\nMore examplesFewer examplesForm an orderly queue.There was a queue of people waiting patiently for the bus to arrive.When the doors opened she barged her way to the front of the queue.I was waiting in the bus queue when two men pushed in in front of me.She was at the head of the queue but I was at the tail end.\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\nfile\ninterrow\nline\nrank\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nCommunications - general words\nB2 [ I ] to wait in a line of people, often to buy something: Dozens of people were queueing up to get tickets. We had to queue for three hours to get in.\n[ I ] to want very much to do something: [ + to infinitive ] There are thousands of young women queueing up to be models. It is one of several big German companies queueing for a listing on the New York Stock Exchange.\n[ T ]\n&#160; computing, internet &amp; telecoms\n&#160; specialized to arrange pieces of data, files to be printed, calls, etc. in a series so they can be dealt with one after the other by a computer, telephone system, etc.: If more than the maximum number of print jobs are submitted at the same time, the software queues the excess jobs. During peak periods calls can be queued rather than callers hearing a busy tone.\nMore examplesFewer examplesWe queued for half an hour waiting for a free space in the car park.He queued for two hours and all for nothing - there were no seats left.Queue here for signed copies of his book.\nSMART Vocabulary: related words and phrases\nWaiting\nawait\nbacklogged\nbang around\nbreath\nhang\nhang around\nhover\nloiter\nlounge\nlurking\nmark time idiom\nmill\nmill around\nsit\ntwiddle\ntwiddle your thumbs idiom\nwait\nwait and see idiom\nwait around\nwait for someone/something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWanting things\nComputer concepts\nCommunications - general words\nAdd to word list\nAdd to word list\na line of people or things waiting for something: There was a long queue for tickets at the theater. queue verb [ I ] us\nYour browser doesn't support HTML5 audio\n/kju/\nFans queued up to buy tickets.\nAdd to word list\nAdd to word list\nUK (US line) a line of people who are waiting for something: There was a huge queue of people stretching down the road from the bank.\nUK (US line) a number of people who want to do or have something: Rarely does a company that is suffering from such mismanagement attract a queue of eager buyers. She would not be a preferential creditor and would have to join the queue of other creditors.be at the front/back of the queue It's public-sector workers who are always at the back of the queue when pay rises are being handed out.be the first/last in the queue Fortunately, they were first in the queue of creditors.\nIT a list of jobs that a computer has to do: a print queue\nCOMMUNICATIONS\n&#160; UK a number of people who are waiting to speak to someone on the phone: Please hold, you are in a queue and your call will be answered as soon as possible. See also\ndole queue\n[ I ] to join a line of people who are waiting for something: Private investors would regularly queue outside their banks in order to rush their application forms in before the deadline.\n[ I ] to join a number of people who are waiting for or to do something: Competitors queue up to steal clients and key employees.\n[ T ]\n&#160; IT to arrange tasks in order: The server will not allow me to queue print jobs."}