{"id":298781,"name":"quick","type":"adjective","us_sound":"kwɪk","us_link":"../audio/q/quick.mp3","uk_sound":"kwɪk","uk_link":"../audio/q/ukquibb003.mp3","content":"Add to word list\nAdd to word list\nA2 happening or done with great speed, or lasting only a short time: It's a quick journey. I had a quick coffee and left the house. I only had time for a quick glance at the paper this morning. He scored three goals in quick succession (= one after the other in a short time). Could I have a quick word (= speak to you for a short time)? Quick as lightning (= very quickly), he snatched the book and ran out of the room. Synonyms\nexpeditious formal\nfast (QUICK)\nrapid\nspeedy\nswift\nThesaurus: synonyms, antonyms, and examples\ncontinuing for less time than usualshortHe received a short jail sentence.quickI need to make a quick phone call - I'll be right back.briefWe had a brief chat this morning.short and sweetThe business meeting was short and sweet.momentaryIt was just a momentary lapse in judgment - I won't do it again.\nSee more results »\nA1 doing something fast: I tried to catch him but he was too quick for me.\nThesaurus: synonyms, antonyms, and examples\nfastfastI tried to catch him, but he was too fast for me.quickI tried to catch him, but he was too quick for me.promptA prompt reply would be very much appreciated.speedyEveryone is hoping for a speedy resolution to the conflict.swiftThe teacher's swift action saved his life.\nSee more results »\nbe quick to do something\nto do something fast, sometimes too fast: She was quick to point out that it wasn't her fault.\nSee more\nB1 used to describe someone who is clever and understands or notices things quickly: She was quick at understanding what we wanted her to do. He has a quick mind. Donna's quick thinking (= ability to solve problems with speed) averted what could have been a disaster. See also\nquick-witted a quick study US informal\nsomeone who is able to learn things quickly: He's a quick study and easily grasps all the details of a discussion.\nSee more quick and dirty\nproduced or done quickly and therefore not perfect: The original solution was admittedly quick and dirty.\nSee more\nMore examplesFewer examplesThe journey was quite quick because the road was clear .I'll give the walls a quick coat of paint.They had a quick confab to decide on a possible design.After stopping for a quick drink, they continued on their way.Her movements were deft and quick.\nSMART Vocabulary: related words and phrases\nShort in time\nabbreviated\nat a moment's/two hours'/three weeks', etc. notice idiom\nawhile\nbe short notice idiom\nbite-sized\nblink\nbout\nbriefly\ndose\nin abbreviated form\nin small doses idiom\nin the blink of an eye idiom\ninstant\njiffy\nshort-stay\nshortness\nsnatched\nsplit second\ntick\ntransient\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFast and rapid\nIntelligence\nRelated word\nquicknessGrammar\nFast, quick or quickly?Fast and quick mean moving with great speed. Fast is both an adjective and an adverb. Quick is an adjective and the adverb form is quickly. …\nused for telling someone to do something quickly: Quick! Close the door before the cat comes in!\nSMART Vocabulary: related words and phrases\nExpressions telling people to hurry up\nalready\nc'mon\ncome\ncome along\ncome on\ngee\nget weaving idiom\njump\njump to it idiom\nlook\nlook lively/sharp! idiom\nmake\nmake it quick/fast idiom\nmake it snappy idiom\nmove\nskate\nsnappy\ntime is of the essence idiom\nweave\nwriggle\nSee more results »\nquickly: We bought it quick, before someone else could. Synonym\npromptly\nSMART Vocabulary: related words and phrases\nFast and rapid\n(at) full speed/tilt/pelt idiom\napace\nas fast as your legs would carry you idiom\nas if it is going out of style idiom\nat a rate of knots idiom\nfleet\nhypersonic\nin the twinkling of an eye idiom\nJack Robinson\nlickety-split\nlight speed\nprompt\nsmartly\nsouped-up\nspanking\nspeed of light\nspread like wildfire idiom\nstreak\nsuper-express\nwildfire\nSee more results »\nthe area of flesh under your nails: He's bitten his nails to the quick.\nSMART Vocabulary: related words and phrases\nThe hand\ncarpal\ncarpometacarpal\ncarpus\ncuticle\ndexterity\ndexterous\nfinger\nfingertip\nknuckle\nleft-handed\nleft-hander\nlittle finger\nmetacarpus\nminimus\nnail\nopposable\npalm\npalmar\nphalangeal\npinkie\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe foot\nGrammar\nFast, quick or quickly?Fast and quick mean moving with great speed. Fast is both an adjective and an adverb. Quick is an adjective and the adverb form is quickly. …\nAdd to word list\nAdd to word list\ndone, happening, or moving fast; lasting only a short time: She cast a quick glance in the mirror. You’re back already – that was quick! He made a quick profit. [ + to infinitive ] John was quick to point out the error. quick adverb us\nYour browser doesn't support HTML5 audio\n/kwɪk/\nnot standard We bought it quick, before someone else could. quick exclamation us\nYour browser doesn't support HTML5 audio\n/kwɪk/\nQuick! Close the door before the dog gets out! quickly adverb us\nYour browser doesn't support HTML5 audio\n/ˈkwɪk·li/\nEmergency workers were on the scene quickly. quickness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈkwɪk·nəs/\nShe moves with quickness, balance, and grace."}