{"id":298848,"name":"quiet","type":"adjective","us_sound":"ˈkwaɪ.ət","us_link":"../audio/q/quiet.mp3","uk_sound":"ˈkwaɪ.ət","uk_link":"../audio/q/ukquibb015.mp3","content":"Add to word list\nAdd to word list\nA2 making very little noise: She spoke in a quiet voice so as not to wake him. It's so quiet without the kids here. Please be quiet (= stop talking)! Could you keep quiet while I'm on the phone, please? She was as quiet as a mouse (= very quiet). I didn't even know she'd come in. Note: Do not confuse with quite.\nThesaurus: synonyms, antonyms, and examples\nmaking little or no noisequietThere was a quiet tapping at the door.silentThe stadium fell silent after the goal was scored.soft\"Come here!\" he said in a soft voice.muffledI could hear muffled voices from the next room.faintThere was the faint sound of traffic in the distance.\nSee more results »\nA2 having little activity or excitement and few people: a quiet, peaceful little village It was a quiet wedding, with just a few friends and relations. Business is quiet during the holidays.\nThesaurus: synonyms, antonyms, and examples\nhaving little activity or excitementquietWe live in a very quiet neighbourhood.peacefulHe needed a peaceful place to write his novels.sleepyThey retired to a sleepy little village.tranquilThe hotel is in a tranquil rural setting.restfulOur holiday was quiet and restful.\nSee more results »\nB1 A quiet person is one who does not talk much: He was a quiet, almost taciturn, young man.\nThesaurus: synonyms, antonyms, and examples\nnot speaking much or oftenquietShe's a quiet little thing.taciturnHer father was a shy, taciturn man.abruptHe is criticised for being too abrupt with his clients.curtShe was very curt with him.terseI don't appreciate how terse she is in meetings.\nSee more results »\nkeep (something) quiet\nC2 to try to stop other people from finding out about a fact: keep quiet about Davies kept quiet about the amount of money being spent.\nSee more\nMore examplesFewer examplesThe party turned out to be a quiet affair.If you don't have anything constructive to say, I'd rather you kept quiet.The evening was very pleasant, albeit a little quiet.She has a quiet dignity about her.That'll do, Timothy! Please just sit down and keep quiet.\nSMART Vocabulary: related words and phrases\nSilence & quiet\ncricket\ncrickets idiom\ndeafening\ndeafeningly\nhushed\ninaudibly\nkeep it down idiom\nkeep something down\nmuffled\nmuted\nquietness\nradio silence\nsilent\nsilently\nsoundlessly\nsubdued\ntrail\ntrail away/off\nunder your breath idiom\nunmute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeaceful and tranquil\nNot saying much\nRelated word\nquietnessGrammar\nQuiet or quite?Quiet /kwaɪət/ and quite /kwaɪt/ are spelt and pronounced differently, and have different meanings. …\nB2 the state of being silent: Let's have some quiet! I go camping for some peace and quiet (= absence of activity and excitement).\nSMART Vocabulary: related words and phrases\nSilence & quiet\ncricket\ncrickets idiom\ndeafening\ndeafeningly\nhushed\ninaudibly\nkeep it down idiom\nkeep something down\nmuffled\nmuted\nquietness\nradio silence\nsilent\nsilently\nsoundlessly\nsubdued\ntrail\ntrail away/off\nunder your breath idiom\nunmute\nSee more results »\nIdiom\non the quiet\nto (cause someone to) become calmer or less noisy: The barking dogs quieted when they recognized me.\nThesaurus: synonyms, antonyms, and examples\nto become calm or make someone calmcalm downDad was really angry and it was a long time before he calmed down.calmHe calmed the crying baby.settle downChildren, settle down and take your seats!simmer downOkay, simmer down - no one's trying to upset you.cool down/offWhy don't you go for a walk and cool off?chill outMum, chill out! I'll be home before midnight, I promise!\nSee more results »\nSMART Vocabulary: related words and phrases\nFalling silent and not speaking\nbe (on) non-speakers idiom\nbite\nbite something back\nbite your tongue idiom\nbutton your lip idiom\nclam\nclam up\ndraw\nhave nothing to say for yourself idiom\nmouth\nradio silence\nsilence is golden idiom\nspeak\nspeechlessly\nspeechlessness\nstick\nstick in someone's throat idiom\ntight-lipped\ntongue-tied\nwordless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalming and relaxing\nquiet adjective\n(MAKING NO NOISE)\nAdd to word list\nAdd to word list\nmaking very little or no noise: Our new dishwasher is very quiet. Be quiet (= Stop making noise)!\nA quiet person is one who does not talk much: a shy, quiet child\nquiet adjective\n(WITHOUT ACTIVITY)\n[ -er/-est only ] without much activity or many people: a quiet neighborhood a quiet candlelit dinner\nquiet noun [U]\n(SILENCE)\nthe state of being silent: Let’s have some quiet in here!\nquiet noun [U]\n(ABSENCE OF ACTIVITY)\nthe absence of activity and excitement: After a hard day at work, all she wanted was some peace and quiet.\nquiet verb [I/T]\n(BECOME LESS NOISY)\nto become or cause to become calmer or less noisy: [ T ] He quieted the crowd by raising his hand. [ I ] After a great deal of crying, the baby quieted down. [ M ] I tried to quiet him down.\nAdd to word list\nAdd to word list\nif business is quiet, there is not much activity: The foreign exchange markets were relatively quiet. The FTSE 100 fell 23 to 4719.4 as traders braced themselves for a quiet period due to today's US Thanksgiving holiday."}