{"id":299314,"name":"quit","type":"verb","us_sound":"kwɪt","us_link":"../audio/q/quit.mp3","uk_sound":"kwɪt","uk_link":"../audio/q/ukquint006.mp3","content":"Add to word list\nAdd to word list\nB1 to stop doing something or leave a job or a place: Would you quit your job if you inherited lots of money? [ + -ing verb ] I'm going to quit smoking. Quit wasting my time! Press Q to quit the program.\nThesaurus: synonyms, antonyms, and examples\nto end something or cause it to endstopStop pulling your brother's hair this instant!quitQuit poking your sister, will you?haltWe halted the assembly line to check the equipment.discontinueThe lab has discontinued this line of research due to ethical concerns.ceaseAll operations at the company will cease, and the assets will be auctioned off.\nSee more results »\nMore examplesFewer examplesI don't know why she quit her job.Despite opposition from his family, he quit school and became an actor.The nicotine patches are designed to help people quit smoking.He's dropped several hints to the boss that he'll quit if he doesn't get a promotion.Quit teasing your brother like that.\nSMART Vocabulary: related words and phrases\nRetiring & resigning\nabdicate\nabdication\nattrition\nbow\nbow out\nchuck\nchuck something in\nget off\ngolden handcuffs\ngolden handshake\ngolden parachute\nhand in your notice phrase\npension\nretire\nretired\nretiree\nretirement\nretiring\nserve out\nturnover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStop having or doing something\nPhrasal verb\nquit on someone\nAdd to word list\nAdd to word list\nto leave a job or a place, or to stop doing something: [ I ] Her assistant quit without an explanation. [ T ] I quit working to be at home with the kids. [ T ] Quit worrying about him – he’ll be fine!\nAdd to word list\nAdd to word list\nHR, WORKPLACE\n&#160; informal to leave your job: quit your job (as sth) Unable to drive, Lee was forced to quit his job. Mr. Turner quit his job as a loan officer to take up dairy farming. If she hates her job, why doesn't she quit?\ninformal to leave a place or stop an activity: He hates Britain and wants to quit for good. I would love to quit magazine work.quit doing sth As many as a third of producers have indicated that they intend to quit milking cows unless returns improve.\nIT to close a program on a computer: If a window appears asking you whether to quit any open applications, click Continue."}