{"id":299322,"name":"quite","type":"adverb","us_sound":"kwaɪt","us_link":"../audio/q/quite.mp3","uk_sound":"kwaɪt","uk_link":"../audio/q/ukquint007.mp3","content":"Add to word list\nAdd to word list\nB1 completely: The two situations are quite different. The colours almost match but not quite. I enjoyed her new book though it's not quite as good as her last one.UK formal Are you quite sure you want to go? Quite honestly/frankly, the thought of it terrified me. not quite\nB2 used to express that you are not certain about something: I don't quite know what to say.\nSee more\nUK used to show agreement with someone's opinion: \"You'd think he could spare some money - he's not exactly poor.\" \"Quite.\" quite a/some something\nused to emphasize the degree or amount of something, or to say that someone or something is impressive, interesting, or unusual: They have been working on this for quite some time.\nSee more quite the best, worst, etc. mainly UK formal old-fashioned\nused for emphasis: It was quite the worst dinner I have ever had.\nSee more\nMore examplesFewer examplesYou've made your position quite clear .There's quite a collection of toothbrushes in the bathroom.If you compare house prices in the two areas, it's quite amazing how different they are.I'm not quite sure how to get there - I'd better consult a map.She always coveted power but never quite achieved it.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords & phrases expressing agreement & acceptance\nGrammar\nQuiet or quite?Quiet /kwaɪət/ and quite /kwaɪt/ are spelt and pronounced differently, and have different meanings. …\nQuiteQuite is a degree adverb. It has two meanings depending on the word that follows it: ‘a little, moderately but not very’ and ‘very, totally or completely’: …\nQuite + gradable adjectives and adverbsWhen we use quite with a gradable adjective or adverb, it usually means ‘a little, moderately but not very’. It has a similar meaning to ‘rather’ or ‘fairly’: …\nQuite + non-gradable adjectives and adverbsWhen we use quite with a non-gradable adjective or adverb (an extreme adjective or adverb has a maximum and/or minimum, for example right – wrong), it usually means ‘very’, ‘totally’ or ‘completely’: …\nQuite + nounsWe can use quite + a/an before a noun to give it more emphasis or importance: …\nQuite a bit, quite a few, quite a lotWe often use quite with a bit, a few and a lot to refer to large amounts and quantities: …\nQuite + verbsIn informal speaking, we often use quite with like, enjoy, understand and agree to talk about our opinions or preferences. Depending on the context, it can mean ‘a bit’, ‘a lot’ or ‘totally’. We usually put it in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nNot quite meaning ‘not completely’We often use not quite to mean ‘not completely’. We can use it with adjectives, adverbs, nouns, non-finite clauses, prepositional phrases and wh-clauses: …\nA2 a little or a lot but not completely: I'm quite tired but I can certainly walk a little further. There was quite a lot of traffic today but yesterday was even busier. It was quite a difficult job. He's quite attractive but not what I'd call gorgeous. It would be quite a nuisance to write to everyone.\nMore examplesFewer examplesShe seemed quite chirpy this morning.Three hours is quite a chunk out of my working day.The journey was quite quick because the road was clear .Shall we call in on Miranda? You know she lives quite close-by.She was quite affable at the meeting.\nSMART Vocabulary: related words and phrases\nSome and quite\n(a) sort of idiom\na piece/slice/share of the pie idiom\nbit\ncertain\ndegree\nfaintly\nfairly\nha'porth\nhalfway\nlittle\nmildly\npie\npretty\nrather\nremotely\nseveral\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nGrammar\nQuiet or quite?Quiet /kwaɪət/ and quite /kwaɪt/ are spelt and pronounced differently, and have different meanings. …\nQuiteQuite is a degree adverb. It has two meanings depending on the word that follows it: ‘a little, moderately but not very’ and ‘very, totally or completely’: …\nQuite + gradable adjectives and adverbsWhen we use quite with a gradable adjective or adverb, it usually means ‘a little, moderately but not very’. It has a similar meaning to ‘rather’ or ‘fairly’: …\nQuite + non-gradable adjectives and adverbsWhen we use quite with a non-gradable adjective or adverb (an extreme adjective or adverb has a maximum and/or minimum, for example right – wrong), it usually means ‘very’, ‘totally’ or ‘completely’: …\nQuite + nounsWe can use quite + a/an before a noun to give it more emphasis or importance: …\nQuite a bit, quite a few, quite a lotWe often use quite with a bit, a few and a lot to refer to large amounts and quantities: …\nQuite + verbsIn informal speaking, we often use quite with like, enjoy, understand and agree to talk about our opinions or preferences. Depending on the context, it can mean ‘a bit’, ‘a lot’ or ‘totally’. We usually put it in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nNot quite meaning ‘not completely’We often use not quite to mean ‘not completely’. We can use it with adjectives, adverbs, nouns, non-finite clauses, prepositional phrases and wh-clauses: …\nquite adverb [not gradable]\n(VERY)\nAdd to word list\nAdd to word list\nto a large degree: School is quite different from what it once was. quite a\nQuite a is used before some nouns to emphasize the large number, amount, or size of the subject referred to: We’ve had quite a lot of rain this year. There were quite a few (= a lot) of people waiting in line. She had quite a bit (= a lot) to say to him when he finally showed up. I hadn’t seen Rebecca in quite a while (= for a long time).\nquite adverb [not gradable]\n(COMPLETELY)\ncompletely: Quite frankly, the thought of performing terrifies me. I’m not quite done yet. I’m not quite sure I understand.\nquite adverb [not gradable]\n(REALLY)\nreally or truly: Winning this contest was quite an accomplishment. It was quite a remarkable speech."}