{"id":299450,"name":"quote","type":"verb","us_sound":"kwoʊt","us_link":"../audio/q/quote.mp3","uk_sound":"kwəʊt","uk_link":"../audio/q/ukquint025.mp3","content":"quote verb\n(SAY)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to repeat the words that someone else has said or written: He's always quoting from the Bible. \"If they're flexible, we're flexible\", the official was quoted as saying. She worked, to quote her daughter, \"as if there were no tomorrow\". Can I quote you on that (= can I repeat to other people what you have just said)?\nC1 [ T ] If you quote a fact or example, you refer to it in order to add emphasis to what you are saying: [ + two objects ] Quote me one organization that doesn't have some bad managers.\nMore examplesFewer examplesIn all future letters on this subject, please quote our reference JW/155/C/1991.I can't quote the exact statistics for you offhand, but they're there for you to see in the report.The article quoted an unnamed source from the White House.At the beginning of his speech he quoted a line from 'Macbeth'.I think it's a crazy idea, but don't quote me on that.\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusive\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nquotable\nquotably\nquote... unquote idiom\nref\nrefer to someone/something\nreference\nreferent\nreported speech\ntouch\nSee more results »\nquote verb\n(GIVE PRICE)\nC2 [ T ] to give a price, especially one that will be charged for doing a piece of work: The architect has quoted £90,000 to build a patio.\nSMART Vocabulary: related words and phrases\nEstimating value\nappraise\nappraiser\nbook value\ncost\ncosting\nde-index\nest.\neuro\nfigure\ngoodwill\nindex of leading economic indicators\npricelessly\npricing\nput a figure on it idiom\nput something at something\nquantity surveyor\nre-estimate\nrecommended retail price\nunderestimate\nvalue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNegotiating prices\nIdiom\nquote... unquote\nquote noun\n(PRICE)\nC2 [ C ] the price that a person or company says they will charge to do a piece of work: I asked several companies to give me a quote for the building work. Synonym\nquotation\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNegotiating prices\nquote noun\n(SYMBOLS)\nquotes [ plural ]\nthe symbols “ ” or ‘ ’ that are put around a word or phrase to show that someone else has written or said it: You need to make sure that any quotes in your document are coded properly.\nSee more\nquote verb\n(REPEAT WORDS)\nAdd to word list\nAdd to word list\n[ I/T ] to repeat words that someone else has said or written: [ T ] She quoted him as saying he couldn’t care less. [ I ] He illustrated by quoting from Winston Churchill’s speech.\n[ I/T ] If you quote a fact or example, you refer to it to provide proof of something: [ T ] The judge quoted several cases to support his opinion. quote, unquote\nYou say quote or quote, unquote to show you are repeating the words of someone else: He hailed the performance as, quote, an extraordinary achievement. She moved to New York City knowing that that's where she had to live to, quote, unquote, make it in the music world.\nquote verb\n(STATE A PRICE)\n[ T ] to state a price or amount that something will cost: The roofer quoted $3000 to fix the roof.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE to tell a customer how much a job, service, or product will cost: quote sb sth A law firm in Washington D.C. quoted me a fee of $25,000 to get the paperwork done.quote for sth Some insurers will even decline to quote for new business if the home is in a risky area.\n[ T ]\n&#160; STOCK MARKET, FINANCE to give the current price of a company's shares or of a currency: The old system allows market makers to quote prices at which they will buy and sell large blocks of shares through all conditions.quote sth at $1.50/£2.25/75p, etc. The British pound was quoted at $1.5117, down from $1.5135 in New York.\n[ T ]\n&#160; STOCK MARKET\n&#160; UK to record a company's name on a stock exchange so that its shares can be traded there: quote sth on sth The Footsie is an average of the share prices of the biggest 100 companies quoted on the stock market. Compare\nlist verb\na statement of how much a job, service, or product will cost: Most quotes are valid for a month. If you already have a UK medical policy, ask for a quote for offshore cover.a quote for (doing) sth The quotes for the building work varied from $15,000 to $70,000."}