{"id":299444,"name":"quotation","type":"noun","us_sound":"kwoʊˈteɪ.ʃən","us_link":"../audio/q/quotation.mp3","uk_sound":"kwəʊˈteɪ.ʃən","uk_link":"../audio/q/ukquint024.mp3","content":"quotation noun [C]\n(SAID)\nAdd to word list\nAdd to word list\nC2 a phrase or short piece of writing taken from a longer work of literature, poetry, etc. or what someone else has said: At the beginning of the book there's a quotation from Abraham Lincoln.\nMore examplesFewer examplesHer speech was larded with literary quotations.The title is a quotation from Shakespeare.He gave me a book of funny quotations.\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nindirect speech\nquotable\nquotably\nquote\nquote... unquote idiom\nrefer to someone/something\nreference\nreferent\nreported speech\ntouch\nSee more results »\nquotation noun [C]\n(PRICE)\nC2 the price that a person or company says they will charge to do a piece of work: We decided to go with the lowest quotation.\nSMART Vocabulary: related words and phrases\nCosts & expenses\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\ncash flow\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNegotiating prices\nquotation noun [C]\n(SHARES)\nmainly UK the fact that a company's shares are being traded on a particular stock market: Changes in the listing rules have reduced the advantage of obtaining a quotation on this stock market.\nquotation noun [C]\n(REPEATED WORDS)\nAdd to word list\nAdd to word list\nliterature a group of words from a book, play, speech, etc., that are repeated by someone who did not write them: A quotation from Shakespeare prefaces the novel.\nquotation noun [C]\n(PRICE)\nthe price that a person says they will charge: He called back to say the price quotes were \"not accurate.\"\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a statement of how much a job, service, or product will cost: a quotation for sth You can request a quotation for professional indemnity insurance online.get/give sb/ask for a quotation Get at least three quotations for the work. Written quotations are available on request. Compare\nestimate noun\n[ C ]\n&#160; STOCK MARKET\n&#160; UK the price of a company's shares on a stock market at a particular time: In a few years, trading securities will be digital and people will be able instantly to get stock-price quotations. By publishing quotations, the market maker raises the profile of the security.\n[ C, U ]\n&#160; STOCK MARKET if a company's shares have a quotation on a particular stock market, they are being traded on it: A quotation on the London market is a logical next step. In 2005 the company withdrew its shares from public quotation . See also\napplication for quotation\nnominal quotation"}