{"id":402113,"name":"wage","type":"noun","us_sound":"weɪdʒ","us_link":"../audio/w/wage.mp3","uk_sound":"weɪdʒ","uk_link":"../audio/w/ukvulva021.mp3","content":"Add to word list\nAdd to word list\nB1 a particular amount of money that is paid, usually every week, to an employee, especially one who does work that needs physical skills or strength, rather than a job needing a college education: a very low/high wage an hourly/daily/weekly/annual wage He gets/earns/is paid a good wage, because he works for a fair employer. The job pays very low wages. Compare\nearnings\npay noun\nremuneration formal\nsalary\nstipend\nMore examplesFewer examplesIs she paid a regular wage or is it by commission only?Deadlock over wage levels has prevented an agreement being reached.There will be an increase in tax for those earning in excess of twice the national average wage.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nto fight a war or organize a series of activities in order to achieve something: Doesn't the president need Congress' permission to wage war on another country? They've been waging a long campaign to change the law.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nwage noun [U]\n(MONEY)\nAdd to word list\nAdd to word list\nan amount of money that is paid to an employee, esp. for each hour worked: an hourly wage\nwage verb [T]\n(FIGHT)\nto begin and continue a war, a fight, or a plan to achieve something: A desperate medical battle is being waged against the virus.\nAdd to word list\nAdd to word list\nan amount of money that is paid, usually every week, to an employee for their work: a daily/hourly/weekly wage This deal represents an hourly wage rate of $9.83.a high/low wage We pay the highest wages of any theatrical employer in the world.earn/get a wage Some college education is required to earn a decent wage in the United States.a wage cut/increase/rise The employees accepted a 4% wage rise. If you are a good employer, you will pay a fair wage. His 15 stores employ 200 workers at an average wage of $7.40 an hour.fair/good/low wages They provided fair wages and steady jobs. Compare\nsalary See also\nbasic wage\nguaranteed wage\nliving wage\nminimum wage\nmoney wages\nreal wages"}