{"id":402367,"name":"waited","type":"verb","us_sound":"weɪt","us_link":"../audio/w/wait.mp3","uk_sound":"weɪt","uk_link":"../audio/w/ukwaist004.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nwait\nA1 to allow time to go by, especially while staying in one place without doing very much, until someone comes, until something that you are expecting happens or until you can do something: I waited for her outside while she went in to see the doctor. The dentist kept me waiting for ages. [ + to infinitive ] There were a lot of people waiting to use the phone.\nThesaurus: synonyms, antonyms, and examples\nto wait waitWe need to wait in line for the tickets.wait forWe're waiting for the bus.awaitWe are awaiting the committee's decision.stayStay there until I get back.remainPlease remain in your seats until the plane has come to a complete stop.hang onHang on, I'll be ready in a minute.\nSee more results »\nto be done or to happen at a later time: The meeting will have to wait until tomorrow, because I'm too busy now. The paperwork can't wait until tomorrow (= is urgent and must be done now). no waiting UK (US no standing)\nused on signs to mean vehicles are not allowed to park, even for short periods of time: The sign by the side of the road said \"no waiting!\"\nMore examplesFewer examplesIn hindsight, it would have been better to wait.A small group of children waited outside the door.She was very tense as she waited for the interview.I hate waiting for public transport.We can buy our duty-free while we're waiting at the airport.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nhold\nnon-rotating\nnon-tenured\noutstay\noverstay\noverwinter\nrest\nspot\nstand\nstay on\nstay put idiom\nstick\nstick around\nstop in\ntarry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWaiting\nDelaying and wasting time\nRoads: lights, signs & markings on roads\nGrammar\nExpect, hope or wait?We use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nExpectWe use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nHopeWe use hope when we do not know whether something will happen or not but we want it to happen. We use hope in the following patterns: …\nWaitWe use wait when we refer to letting time pass because we are expecting that something is going to happen. We use wait in the following main patterns: …\nExpect, hope or wait: typical errorsWe don’t use wait or wait for to say that we believe that something will happen. We use expect: …\nWait or wait for?Wait means ‘stay in the same place or not do something until something else happens’. We can use it with or without for: …\nIdioms\ncan't wait\nwait your turn\nwait a minute/moment/second\nwait and see\nwait at table(s)\nwait for it\nwait in the wings\nwait till/until ...\n(just) you waitPhrasal verbs\nwait around\nwait behind\nwait for someone/something\nwait for someone\nwait something for someone\nwait in\nwait on someone/something\nwait on someone\nwait on something\nwait something out\nMore phrasal verbs\nwait up"}