{"id":402418,"name":"wake","type":"verb","us_sound":"weɪk","us_link":"../audio/w/wake.mp3","uk_sound":"weɪk","uk_link":"../audio/w/ukwaist008.mp3","content":"Add to word list\nAdd to word list\nA1 to (cause someone to) become awake and conscious after sleeping: Did you wake at all during the night? Please wake me early tomorrow. I woke up with a headache. Jane's hand on my shoulder woke me out of/from a bad dream. Synonyms\nawake literary\nawaken literary\nbestir yourself formal or humorous\nrouseSee also\nwake (someone) up (STOP SLEEPING)\nMore examplesFewer examplesYou won't wake him - he's such a heavy sleeper.We woke at dawn.We were woken in the night by the wail of ambulance sirens.Try not to wake the whole house when you come in!She eased the key into the lock, anxious not to wake anyone.\nSMART Vocabulary: related words and phrases\nAnimal physiology: not sleeping & not unconscious\nanti-sleep\nbe in the land of the living idiom\ncome round\nget up\ninsomnia\nkeep someone up\nknock\nknock up\nland\nnight owl\nsit (someone) up\ntoss\nwait up\nwakeful\nwakefulness\nwaken\nwakey-wakey\nwaking\nwhite night\nwoke\nSee more results »\nGrammar\nWake, wake up or awaken?Wake and wake up are verbs which mean ‘stop sleeping or end someone else’s sleep’. They are used in everyday language. …\nIdioms\nwake up!\nwake up and smell the coffeePhrasal verbs\nwake (someone) up\nwake up to something\nwake noun [C]\n(WATER)\nthe waves that a moving ship or object leaves behind: The wake spread out in a v-shape behind the ship.\n_laurent/E+/GettyImages\nMore examplesFewer examplesSeveral governments have adopted tough new anti-terrorist legislation in the wake of the attacks.Eastern traders found their way across Europe in the wake of the Roman army.Safety procedures are being reviewed in the wake of the accident.A lot of new investment has been attracted to the region in the wake of the government's announcement.The road remains closed in the wake of Monday's landslide.\nSMART Vocabulary: related words and phrases\nWaves\nbore\nbreaker\nchoppy\ncomber\ncrest\ndumper\nheavy\noverfall\nroller\nrough\nroughness\nspume\nstanding wave\nsurf\nswell\ntidal wave\ntsunami\nwave\nwhite horses\nwhitecaps\nSee more results »\nwake noun [C]\n(FUNERAL)\nan occasion when the family and friends of a dead person meet in order to look at the dead body the night before it is buried, or when they meet after a dead person has been buried to drink and talk about the person's life\nSMART Vocabulary: related words and phrases\nFunerals\ncatafalque\nclosed-casket\ncortege\nfuneral\nfuneral director\nfuneral home\nfuneral parlour\nfunerary\nfunereally\ngreen burial\nhearse\nlie\nmorgue\nmortician\nmortuary\nobsequies\nopen-casket\nsend\nsend something off\nundertaking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemembering people who have died\nIdioms\nin the wake of something\nleave something in your wake\nwake verb [I/T]\n(STOP SLEEPING)\nAdd to word list\nAdd to word list\nto become awake and conscious after sleeping, or to cause someone to stop sleeping: [ I ] Did you wake at all during the night? [ T ] The noise of the storm woke the kids. waken verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈweɪ·kən/\n[ T ] He tried to waken her, but she didn’t stir. Idiom\nwake up to somethingPhrasal verbs\nwake up (someone)\nwake up (someone)\nwake noun [C]\n(WATER)\nan area of water whose movement has been changed by a boat or ship moving through it: fig. The storm left a massive amount of destruction in its wake.\nwake noun [C]\n(GATHERING)\na gathering held before a dead person is buried, at which family and friends talk about the person’s life"}