{"id":402487,"name":"walk","type":"verb","us_sound":"wɑːk","us_link":"../audio/w/walk.mp3","uk_sound":"wɔːk","uk_link":"../audio/w/ukwaist017.mp3","content":"walk verb\n(MOVE ON FOOT)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to move along by putting one foot in front of the other, allowing each foot to touch the ground before lifting the next: I walked home. A cat was walking along the top of the fence. He walks two miles to work every morning. See also\njaywalk mainly US\nsleepwalk\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nB1 [ T ] to go with someone to a particular place, for example because you want to protect them from danger, or show them the way: walk someone to something He offered to walk her home/to the station.\nB1 [ T ] to take an animal, especially a dog, for a walk: She walks the dog for an hour every afternoon. a walking disaster, encyclopedia, etc.\nsomeone who seems to be a human form of disaster, encyclopedia, etc.: You broke another pair of glasses? You're just a walking disaster!\nSee more\nMore examplesFewer examplesWe'd better walk a bit quicker - it's going to take forever if we go at this pace.We walked along the beach collecting small crabs in a bucket.He walks with a limp.We were just walking along, chatting.I walked backwards towards the door.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhiking\nhoof it idiom\nrace walking\nrambler\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\ntrekking pole\nwalkable\nwalkabout\nwalkies\nwalking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking someone somewhere or telling them the way\nwalk verb\n(FREE TO GO)\n[ I ] to not be charged with a crime, or to be allowed to leave a court after being found not guilty of a crime: If police don't get the right evidence, he'll walk.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nwalk verb\n(LEAVE)\n[ I ] to suddenly leave a job or other situation because you have not been given what you want: Pay essential workers $650 a week or we walk. \"Get real or we walk\" UK warns Brussels as Brexit trade deal talks resume. You give me twenty percent discount on the price or I walk.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull out\npull something off\npush along\nsea\nturf something out\nvacate\nvamoose\nwalk off (somewhere)\nwalk out\nSee more results »\nwalk verb\n(SPORTS)\n[ I ]\n&#160; sports\n&#160; specialized In cricket, if a batter (= the player who tries to hit the ball) walks, they choose to leave the field without waiting for the umpire (= the person who makes certain that the rules are obeyed) to make a decision about whether they are out (= their turn to bat is finished): He nicked an outswinger to the keeper and walked without waiting for the umpire to lift his finger. The batter refused to walk, even though all the fielders knew that he had hit it.\n[ I or T ]\n&#160; sports\n&#160; specialized in baseball, to receive four balls outside the hitting area and be allowed to go to first base, or to throw the ball outside the hitting area four times so that the batter is allowed to go to first base: The first batters either missed or walked. He would have had a perfect game, except he walked a batter in the final inning.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppish\nuppishly\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nwalk verb\n(DO EASILY)\n[ T ] UK informal to pass or win something, such as an exam or game, easily: She'll walk the interview - the job is practically hers already.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngrade\nkill\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nSee also\nwalk/be on eggshellsIdioms\nwalk all over someone\nwalk free\nwalk it\nwalk on air\nwalk right into something\nwalk the walkPhrasal verbs\nwalk away\nwalk away with something\nwalk back something\nwalk in on someone\nwalk into something\nwalk off (somewhere)\nwalk something off\nwalk off with something\nwalk out\nwalk through something\nMore phrasal verbs\nwalk someone through something\nA2 [ C ] a journey that you make by walking, often for enjoyment: go for/take a walk He went for/took a walk around the block, to get some air. They went on a ten-mile walk to raise money for charity. Every afternoon she takes her grandfather out for a walk. See also\nboardwalk US\ncatwalk\ncrosswalk US\nsidewalk US\nspacewalk\nC1 [ C ] a path or route where people can walk for enjoyment: Do you know any nice walks around here?\n[ S ] a way of walking: He has a strange waddling sort of walk.\n[ S ] walking speed: She slowed the horses to a walk. a short, five-minute, ten-minute, etc. walk\na journey that takes a short time, five minutes, ten minutes, etc. when you walk: a short, five-minute, ten-minute, etc. walk away The school is only a five-minute walk away.\nSee more\n[ C ] in baseball, an occasion when a batter is allowed to go to first base after the pitcher has thrown the ball outside the hitting area four times\nMore examplesFewer examplesI went for a walk to try to sober up.I always like to take a walk after lunch.Shall we brave the snow and go for a walk ?It says in the guide that this area of the countryside offers some of the best walks in England.He neglects that poor dog - he never takes him for walks or gives him any attention.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhiking\nhoof it idiom\nrace walking\nrambler\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\ntrekking pole\nwalkable\nwalkabout\nwalkies\nwalking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nIdioms\na walk in the park\nwalk of life\nAdd to word list\nAdd to word list\nto move along by putting one foot in front of the other, or to move a distance in this way: [ I ] I walked home. [ I ] We just walked past a famous actress. [ I ] They walked all around Chinatown. [ I ] I walk to work every morning. [ T ] It’s not that far – you can walk it in half an hour. [ T ] We must have walked miles today.\nTo walk someone to a particular place is to walk with the person until the place has been reached: [ T ] He offered to walk her home.\nTo walk an animal, esp. a dog, is to bring it outside with you to walk.\nphrasal verb walk all over someone\nto be unkind to someone and treat that person without respect: You shouldn’t let him walk all over you like that.\nphrasal verb walk away/off with something\nto win something easily: The German soccer team is once again favored to walk away with the championship.\nphrasal verb walk off with something\nto take something without asking: Who walked off with my drink?\nphrasal verb walk out\nto leave an event before it is finished because you are not enjoying it or because you do not agree with it: It was such a bad movie that I felt like walking out in the first fifteen minutes.\nIf workers walk out, they go on strike (= stop working at their jobs in order to express a complaint): Airline pilots are threatening to walk out next week.\nphrasal verb walk out on someone/something\nto suddenly end your relationship or involvement with someone or something: You can't afford to walk out on your job.\nphrasal verb walk (someone) through something\nto practice something, or to show someone how to do something from beginning to end: They can walk you through the process one more time, to give you some practice and confidence. Idiom\nwalk the walk\nan act of moving along by putting one foot in front of the other, or moving a distance in this, esp. for pleasure or exercise: He went for/took a walk around the block. Idiom\nwalks of life\nwalk all over sb informal\nAdd to word list\nAdd to word list\nto treat someone badly: The unions accused management of walking all over their staff.\nwalk off the job US\nto stop working because you are angry or unhappy about something: Autoworkers walked off the job after the unions failed to reach an agreement over pay.\nwalk the plank informal\nto be forced to leave your job because of something bad you have done: The expenses scandal gave several ministers no option but to walk the plank.\nwalk the talk informal\nto do the things you have said you would do, especially when you reach a position of power: Business groups are waiting to see if the incoming Governor will walk the talk on promises to boost the state's economy. Compare\ntalk the talk\nwalk the walk informal\nto do the things you have planned and promised to do: The country has yet to see whether the new leader can walk the walk. Compare\ntalk the talk Phrasal verbs\nwalk into sth\nwalk out\nwalk out on sth\nwalk of life\nused to refer to the job you do or the part of society you belong to: We employ people from all walks of life."}