{"id":402519,"name":"wall","type":"noun","us_sound":"wɑːl","us_link":"../audio/w/wall.mp3","uk_sound":"wɔːl","uk_link":"../audio/w/ukwaist029.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] a vertical structure, often made of stone or brick, that divides or surrounds something: The walls in this apartment are so thin you can hear just about every word the neighbours say. The walls look a bit bare - can't we put some pictures up? We had to climb over a ten-foot wall to get into the garden. The Berlin Wall came down in 1989.\nthenakedsnail/Moment/GettyImages\n[ C ] any outer part of a hollow structure in the body: the wall of the uterus/stomach an artery wall\n[ C ] a mass of people or things formed in such a way that you cannot get through or past them: The demonstrators formed a solid wall to stop the police from getting past them.\n[ C ] in football, a row of players who stand ten yards away from where a free kick is taken in order to make scoring directly from the free kick more difficult: Rooney curved the free kick past the Newcastle defensive wall and inside the far post.\nImage Source/GettyImages\n[ S ] literary a large, powerful, usually fast moving mass of something: After the rains, the houses were washed away by a wall of mud/water.\n[ S ] a way of feeling or behaving that completely prevents two groups of people from communicating with or understanding each other: There is a wall of mistrust between the two groups.\nMore examplesFewer examplesBooks on every conceivable subject lined one wall.The east wall of the mosque is covered with a beautiful mosaic.The fall of the Berlin wall marked the end of an era.The walls are constructed of concrete.The paint on the outside walls has weathered badly.\nSMART Vocabulary: related words and phrases\nParts of buildings: walls & parts of walls\nalcove\nbalcony\nbaseboard\ncavity wall\nchimney breast\ncwtch\ndado\ndamp course\ndamp-proof\ndamp-proofing\nparapet\npartition\nparty wall\npebbledash\nplasterboard\nveranda\nwainscot\nwainscoted\nwainscoting\nwallboard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body\nGroups of people\nMasses and large amounts of things\nDifficult things and people\nIdioms\ndrive someone up the wall\ngo to the wall\nhit the wall\noff the wall\nwalls have ears\nAdd to word list\nAdd to word list\na vertical structure that divides or encloses something: The walls of the fortress were more than eighteen inches thick. We’d like the walls painted white.\nA wall of people or things is a mass of them formed in such a way that you cannot get through or past them:\ngo to the wall UK informal\nAdd to word list\nAdd to word list\nif a business goes to the wall, it goes bankrupt: After twelve months of big losses, the company went to the wall. See also\nChinese wall\nhit the wall\nparty wall"}