{"id":404269,"name":"welcome","type":"verb","us_sound":"ˈwel.kəm","us_link":"../audio/w/welcome.mp3","uk_sound":"ˈwel.kəm","uk_link":"../audio/w/ukweedk029.mp3","content":"welcome verb [T]\n(ENCOURAGE)\nAdd to word list\nAdd to word list\nB2 to be pleased about and encourage or support something: The new appointment has been widely welcomed.\nMore examplesFewer examplesWe welcome the government's affirmation of its intention to act.The peace initiative was welcomed by both sides.They said they welcomed the trial as a chance to vindicate themselves.This move towards improving childcare facilities has been widely welcomed.He welcomes the opportunity to put forward his side of the story.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nwelcome verb [T]\n(MEET)\nB1 to meet and speak to someone in a friendly way when they arrive: be warmly welcomed The visitors were warmly welcomed by the head of the department. Browning stood at the door, welcoming newcomers with a large smile and a pat on the arm. Please welcome (= please clap for) our guest of honour, George Taylor.\nMore examplesFewer examplesLet's string up a banner in the garden to welcome him home.The president welcomed the Queen with the usual courtesies.The flight attendant welcomed us aboard.He welcomed me with a wide smile and a warm handshake.She rose from her chair to welcome us.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nwelcome adjective\n(MEETING)\nB1 If someone is welcome, you are pleased when they visit you: Come and see us whenever you're in town - you're always welcome/you'll always be welcome.welcome guest Their tradition is that the traveller is a welcome guest. make someone feel welcome (UK also make someone welcome)\nB1 to show someone that you are pleased that they are with you: Dylan and Grace made us feel very welcome.\nSee more\nMore examplesFewer examplesShe would never feel welcome in this city with its cold, unsmiling inhabitants.His phone call was a welcome intrusion into an otherwise tedious morning.The publicity generated by the court case has given a welcome boost to our sales.After a hard day at the office, a hot bath is a welcome restorative.The arrival of the fresh medical supplies was a welcome sight for the beleaguered doctors working in the refugee camps.\nSMART Vocabulary: related words and phrases\nLiked, or not liked, by many people\nacquire\nan acquired taste idiom\nanti-popular\nbe the new rock and roll idiom\nbe welcome to idiom\ncult\nhigh-traffic\nin someone's bad books idiom\nin someone's good books idiom\nlimb\nlose ground phrase\nlow-traffic\npopularize\nresurge\nrock and roll\nsought after\ntop-rated\ntrend\nviral\nwell thought of\nSee more results »\nwelcome adjective\n(PLEASED)\nB2 If something is welcome, you are pleased to have or do it: welcome change/break/relief The holiday was a welcome change/break/relief.welcome chance/opportunity She offered him the welcome chance/opportunity to do something different. A nice cup of tea would be very welcome. be welcome to do something\nB1 used to tell someone that they can certainly do something: Anyone who is interested is welcome to come along.\nSee more\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomely\nhomey\nindulgent\nindulgently\njovial\nsensually\nsensuous\nsensuously\nserendipitous\nsweeten\nSee more results »\nIdioms\nbe welcome to\nyou're welcome\nwelcome noun\n(MEETING)\nB1 [ C or U ] the way in which someone is met and spoken to when they arrive in a place: be given a warm welcome They were given a warm (= very friendly) welcome.hero's/heroine's welcome The leader of the political protests returned to a hero's/heroine's welcome after seven years in exile.speech of welcome/welcome speech She referred to his previous visit in her speech of welcome/welcome speech. outstay your welcome\nC2 mainly UK (US usually overstay your welcome) to stay too long: I left after two days - I didn't want to outstay my welcome.\nSee more\nMore examplesFewer examplesWe enjoyed a warm welcome from our American friends.The singer received an emotional welcome from crowds of young girls.His welcome included brass bands and cheerleaders.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nwelcome noun\n(REACTION)\n[ S ] a reaction to a decision or suggestion: give something a welcome Their supporters gave the decision a guarded/cautious welcome.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nA2 said as a greeting to someone arriving at a place: Welcome - please come in.welcome home/back Welcome home/back - we've missed you!welcome to Welcome to Cambridge.\nMore examplesFewer examplesWelcome home - it's lovely to see you.Welcome - I hope you will enjoy your visit to our city.\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\ng'day\ngod\nhello\nhello stranger idiom\nhiya\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nwish\nSee more results »\nwelcome verb [T]\n(MEET)\nAdd to word list\nAdd to word list\nto meet or speak to someone in a friendly way when that person comes to the place where you are: We went next door to welcome our new neighbors. The prime minister of Canada welcomed the president warmly.\nwelcome verb [T]\n(SUPPORT)\nto be pleased about or support something: Baseball fans welcomed the end of the players’ strike. She welcomed the opportunity to explain herself. welcome noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈwel·kəm/\nWe were given a warm welcome.\nwelcome adjective\n(SUPPORTED)\n\"You’re welcome\" is a polite answer when someone thanks you: \"Thanks for taking care of our cat.\" \"You’re welcome.\"\nwelcome adjective\n(MET)\n(of someone who visits) received in a friendly way: You’ll always be welcome here."}