{"id":404293,"name":"welfare","type":"noun","us_sound":"ˈwel.fer","us_link":"../audio/w/welfare.mp3","uk_sound":"ˈwel.feər","uk_link":"../audio/w/ukwelde003.mp3","content":"welfare noun [U]\n(HELP)\nAdd to word list\nAdd to word list\nC2 help given, especially by the state or an organization, to people who need it, especially because they do not have enough money: welfare benefits Your taxes pay for welfare benefits such as unemployment and sickness pay.welfare officer UK After her month's sick leave, she was summoned to see the company's welfare officer. on welfare US\nreceiving financial help from the state because you are poor or have not been employed for a long time: Over 53,000 families in the region are currently on welfare.\nSee more\nMore examplesFewer examplesIt is widely acknowledged that the welfare system is under-resourced.The whole scheme is intended to wean people off welfare dependency.He argues that the Congress and President Clinton trampled the constitutional rights of legal immigrants in the new welfare reform law.Since being made redundant, he has been receiving welfare.The lobbyists are seeking reforms to the welfare system.\nSMART Vocabulary: related words and phrases\nSocial security & state benefits\nAFDC\nanti-welfare\nbasic income\nbe on relief idiom\nbenefit\nclaim\nfamily allowance\nfamily credit\ngiro\nhousing benefit\nincome support\nmeans test\nsign (something) off\nsocial security\nsocial welfare\nUBI\nunemployment\nunemployment benefit\nuniversal basic income\nwelfare state\nSee more results »\nwelfare noun [U]\n(HEALTH AND HAPPINESS)\nB2 physical and mental health and happiness, especially of a person: welfare of The police are very concerned for the welfare of the missing child. These organizations have fought very hard for the rights and welfare of immigrants. animal welfare\nSMART Vocabulary: related words and phrases\nHealth in general\nattachment\nconstitutional\nexcess deaths\nexcess mortality\nfunctioning\nhealth\nhealthful\nhealthfully\nhealthily\nhealthy\nhygienic\nnon-carcinogenic\nnon-medical\npublic health\nsanitarily\nsanitary\nsanitation\nscraping\nshape\nwellness\nSee more results »\nwelfare noun [U]\n(HEALTH AND HAPPINESS)\nAdd to word list\nAdd to word list\nphysical and mental health and happiness: We were concerned for our parents’ welfare when we heard about the storm in Florida.\nwelfare noun [U]\n(HELP)\nsocial studies help given, esp. money, by a government to people who are poor and who do not have jobs: welfare benefits The family had to go on welfare.\nAdd to word list\nAdd to word list\nthe general state of health or degree of success of a person, business, country, etc.: Their GDP figures look good, but perhaps at a cost to their overall economic welfare. We are a progressive employer concerned with employee welfare.\nECONOMICS help given, especially by the state or another organization, to people who need it, especially because they are poor: welfare services/programs/workers Some people fear the euro will weaken their welfare system.\nECONOMICS\n&#160; US (UK social security) a system of payments by the government to people who are ill, poor, or have no job: on welfare She is a single parent on welfare."}