{"id":404305,"name":"well","type":"adverb","us_sound":"wel","us_link":"../audio/w/well.mp3","uk_sound":"wel","uk_link":"../audio/w/ukwelde004.mp3","content":"well adverb\n(IN A GOOD WAY)\nAdd to word list\nAdd to word list\nA1 in a good way, to a high or satisfactory standard: The documentary presented both sides of the problem very well. The concert was advertised well enough but ticket sales were poor. a well-cut suit a well-paid jobwell put Her points were well put (= expressed in a good or intelligent way).well taken His point about the need to reduce waste was well taken (= it was accepted as a good criticism).well spent They took two hours to discuss the plans and considered it time well spent (= it had been a useful discussion).as well as I can't do it as well as Marie can.\nMore examplesFewer examplesI think she coped very well under the circumstances.Your painting has come out really well.The tyres on my car don't cope very well on wet roads.We're getting on quite well with the decorating.My golf was terrible today - I just didn't strike the ball well.\nSMART Vocabulary: related words and phrases\nGood, better and best\nall is well idiom\nat the best of times idiom\nbe the last word in something idiom\nbetter\nbetter still phrase\nburnished\ngold standard\ngood\nhigh-quality\nknock something into a cocked hat idiom\nleave someone/something in the dust idiom\nmiles idiom\nnext-best\nsecond\nsound\nsuper good\ntopper\nunsurpassed\nup your game idiom\nuplift\nSee more results »\nwell adverb\n(TO A GREAT DEGREE)\nA2 very much, to a great degree, or completely: Knead the dough well, then divide it into four pieces. He could well imagine how much his promise was going to cost him. I can't catch the bus - there are no buses after midnight, as you well know.well enough He plays the piano well enough (= to a satisfactory standard).\nC1 used to emphasize some prepositions: well above/below The results are well above/below what we expected.well away from Keep well away from the edge of the cliff. It cost well over £100. Stand well clear of the doors!\nB2 used to emphasize some adjectives: well aware The police are well aware of the situation.well worth The museum is well worth a visit.leave something well alone Some machines look more like cheap, plastic toys - leave these well alone.\nUK slang very: well good The film was well good.well hard Watch out for those two - they're well hard (= strong and willing to use violence).\nMore examplesFewer examplesShe's well aware of her strengths and weaknesses as an artist.The scheme was well thought out.The instructions on the fireworks said \"Light the blue touchpaper, and stand well clear.\"Tickets are selling well for the group's upcoming concert tour.She managed to complete her last film well within budget.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nwell adverb\n(REASONABLY)\nB2 with good reason: She might well be the best person to ask.can't very well I can't very well (= it would not be acceptable to) refuse their generous offer.\nMore examplesFewer examplesThis might well be our last chance to see each other before Christmas.You might well wonder what happened to all the food we prepared.It's just as well you brought an umbrella. It's going to rain.You can't very well take it back to the shop now that you've worn it.You'd be as well to confirm the bookings before you arrive.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ndefinition\nexplain\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\nwell adverb\n(IN ADDITION)\nas well (as)\nA1 in addition (to): Invite Emily - and Scott as well.\nSee more Grammar\nWellWell is a discourse marker, adverb or adjective. …\nWell as a discourse markerIn speaking, we often use well at the start of what we say. Its main function is to show that we are thinking about the question that we have been asked: …\nWell as an adverbWe use well as an adverb when something is done to a good standard or in a good way: …\nWell as an adjectiveWe use well as an adjective, normally after a linking verb such as be, look or get, to mean ‘in good health’: …\nAlso, as well or too?Also, as well and too are adverbs and mean ‘in addition’. …\nAlsoAlso is commonly used in writing, but is less common in speaking. Also occupies different positions in a sentence. …\nAs wellAs well is much more common in speaking than in writing, and is more common in speaking than also. …\nTooWe usually put too in end position: …\nLinking negativesWe use either not also, as well or too to connect two negative ideas: …\nAlso, as well and too: typical errorWe don’t use as well at the beginning of a clause. As well usually comes at the end of a clause: …\nAs well (as)As well is an adverb which means ‘also’, ‘too’ or ‘in addition’. We usually use as well at the end of a clause: …\nAs well (as) meaning ‘in addition’As well is an adverb which means ‘also’, ‘too’ or ‘in addition’. We usually use as well at the end of a clause: …\nMight as well and may as wellWe use might as well and may as well informally to mean that something is worth doing only because other things are not happening. Might as well is more common: …\nAs wellWe use as well and the phrase just as well when we say that something is probably a good thing: …\nAdding with as well as and in addition toAs well as is more common than in addition to. In addition to is more formal and used more in writing than in speaking: …\nMay as well and might as wellWe can use may as well and might as well for making suggestions. We can use them to say what we think is the easiest or most logical course of action when we cannot see a better alternative. They are both fairly informal. Might as well is more common than may as well: …\nIdioms\nall is well\nall very well\nbe all very well\nbe just as well\nmay/might as well\nwell and truly\nwell away\nwell done\nwell in (with)\nwell out of something\nA1 healthy; not ill: He hasn't been very well lately.look well When she came home from school she really didn't look well.get well I'm sorry you're ill - I hope you get well soon. They sent a get well card.\nMore examplesFewer examplesHe didn't feel very well after getting off the bike.I'm very well thank you.She wasn't feeling well, so I don't think she gave of her best tonight.She wasn't feeling well, so she went home early.I'm not well. I'd better not go out.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nGrammar\nWellWell is a discourse marker, adverb or adjective. …\nWell as a discourse markerIn speaking, we often use well at the start of what we say. Its main function is to show that we are thinking about the question that we have been asked: …\nWell as an adverbWe use well as an adverb when something is done to a good standard or in a good way: …\nWell as an adjectiveWe use well as an adjective, normally after a linking verb such as be, look or get, to mean ‘in good health’: …\nA1 used to introduce something you are going to say, often to show surprise, doubt, slight disagreement, or anger, or to continue a story: Well, what shall we do now? Well now/then, how are we going to arrange things? \"Who was that?\" \"Well, I can't remember her name.\" \"He's decided to give up his job and move to Seattle with her.\" \"Well, well - that's what love does for you.\" Well, really, that was thoughtless of him! Well? What did you do next? Well, after that we went camping in the mountains.oh well Well/Oh well, it doesn't matter - I can always buy another one.very well Very well, if you insist I'll meet him next week.\nMore examplesFewer examplesWell now, what are we doing about that?Oh well, never mind.Well, well. Who'd have thought things would turn out like this.Well? How did your exam go?Well really! How rude!\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nmean\nnow\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nWellWell is a discourse marker, adverb or adjective. …\nWell as a discourse markerIn speaking, we often use well at the start of what we say. Its main function is to show that we are thinking about the question that we have been asked: …\nWell as an adverbWe use well as an adverb when something is done to a good standard or in a good way: …\nWell as an adjectiveWe use well as an adjective, normally after a linking verb such as be, look or get, to mean ‘in good health’: …\na deep hole in the ground from which you can get water, oil, or gas See also\nstairwell\nExamples\nBy this time all the wells had run dry.Sinking more wells is the best way of supplying the population with clean drinking water.Flames spouted out from the oil wells.The well ran dry.The cottage has a well in the front garden.\nSMART Vocabulary: related words and phrases\nParts of watercourses\nartesian well\nbackwater\nbasin\nconfluence\ndrainage basin\nestuarine\nfirth\ninterbasin\ninterchannel\nlock\nlock-keeper\nmeander\nmooring\nmouth\nnarrows\nreach\nspring\ntributary\nwater table\nweir\nSee more results »\n(of liquid) to appear on the surface of something or come slowly out from somewhere: well (up) out of Dirty water welled (up) out of the damaged pipe.well up As she read the letter tears welled up in her eyes.figurative Conflicting emotions welled up in his heart. Synonym\nswell\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nwell adjective\n(HEALTHY)\nAdd to word list\nAdd to word list\nhealthy: I don’t feel well. I feel better now. Idiom\nwell done\nwell adverb\n(IN A GOOD WAY)\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ in a good way; to a high or satisfactory standard: The car was well designed. She manages people very well. I can’t sing as well as Jessica (= She sings better). His point about reducing waste is well taken (= accepted as a fair criticism). The two hours of discussion was time well spent (= it was a useful discussion). I want to congratulate you on a job well done.\nwell adverb\n(TO A GREAT DEGREE)\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ to a great degree; much or completely: I know her well. Put in two eggs and stir well. He sent away for tickets well in advance (= very early). I knew perfectly well what time it was. I knew her pretty well when I lived in Iowa City.\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ Well is used with some prepositions and adverbs for emphasis: Keep the children well away from the edge of the pool. It costs well over $100.\ncomparative better us/ˈbet̬·ər/ | superlative best us/best/ Well is used with a few adjectives for emphasis: The museum is well worth a visit.\nwell adverb\n(REASONABLY)\n[ not gradable ] with good reason: I couldn’t very well say no.\nwell noun [C]\n(HOLE)\na deep hole in the ground from which water, oil, or gas can be obtained: an oil well well water\nwell verb [I]\n(COME TO SURFACE)\n(of a liquid) to come to the surface or into view: As she read the letter, tears welled in her eyes. fig. He could feel the anger well up inside him.\nwell exclamation\n(EXCLAMATION)\nused to introduce something you are about to say, or to connect one statement with the next, or to show doubt or disagreement, annoyance, surprise, or understanding: Well, what happened next? He started yelling at me, and well, I was scared at first. Well, what are you going to do now that you’ve lost your job? Oh well, there’s not much we can do about it now.\nAdd to word list\nAdd to word list\nNATURAL RESOURCES a deep hole in the ground from which you can get water: These two tributaries of the Yellowstone River supply water for farms and wells in two states. It is an 8-mile round trip to fetch clean water from a well.\nNATURAL RESOURCES, PRODUCTION →\noil well"}