{"id":404590,"name":"wet","type":"adjective","us_sound":"wet","us_link":"../audio/w/wet.mp3","uk_sound":"wet","uk_link":"../audio/w/ukwet__001.mp3","content":"wet adjective\n(NOT DRY)\nAdd to word list\nAdd to word list\nA2 covered in water or another liquid: a wet floor a wet umbrella wet hairget wet My bike got wet in the rain.soaking wet I had to ride my bike in the rain and got soaking (= very) wet.all wet informal You poor thing - you're all (= very) wet.\nThesaurus: synonyms, antonyms, and examples\nfull of or covered with liquidwetThe washing is still wet.moistYou must try this carrot cake - it's so moist and delicious.dampThe towels are still damp.soakedYour clothes are soaked!soakingIt rained in the middle of the night, and when we woke up our sleeping bags were soaking wet.\nSee more results »\nB1 Wet paint, ink, or a similar substance has not had time to dry and become hard: The paint's still wet. a notice saying \"Wet paint!\"\nA2 used to describe weather or periods of time when rain falls: We've had wet weather all week. This is the first wet day for two months.it is wet The presentation will take place indoors if it's wet.\nThesaurus: synonyms, antonyms, and examples\nrainyrainyAnother rainy afternoon - you'll have to stay indoors and play, I'm afraid.wetWe're in for a wet morning, with showers lasting well into the afternoon.showeryIt will be showery overnight, but clear by morning.drizzlyIt was a grey, drizzly day.\nSee more results »\nbe wet through\nto be completely wet: Come in quickly - you're wet through.\nSee more\nMore examplesFewer examplesWe got so wet that our clothes clung to us.The tyres on my car don't cope very well on wet roads.Level the wet cement before it sets.My book got wet and all the pages have stuck together.The wood was wet and would not burn.\nSMART Vocabulary: related words and phrases\nWet weather & wetness\nclammily\nclamminess\ndamp\ndamply\ndampness\ndankly\ndouse\nflooded\nmoisten\nmonsoon\nrehydration\nsaturation\nsemi-dry\nsleety\nslobbery\nsoak\nsoaked\nsodden\nsoggily\nwaterlogged\nSee more results »\nwet adjective\n(WEAK)\nUK used to describe someone who has a weak character and does not express any forceful opinions: Don't be so wet.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakling\nweakly\nweakness\nweedy\nwetly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDoubt & ambivalence\nRelated words\nwetly\nwetnessIdioms\na wet weekend\nbe wet behind the ears\nto make something wet: Wet the powder thoroughly and mix to remove lumps. He wetted a dishcloth and tried to rub the mark away.\nThesaurus: synonyms, antonyms, and examples\nto cover in or fill with liquidwetWet the flannel before you wipe the child's face.moistenHe licked his lips to moisten them.dampenUse a dampened paper towel to clean the cooker. saturateFully saturate the ground after planting seeds. soakSoak the clothes with detergent overnight.\nSee more results »\nwet yourself\nto urinate in your clothes by accident: I was so desperate - I thought I was going to wet myself. As a child she used to wet herself when she got excited. I'd accidentally sat in a pool of water and it looked like I had wet myself. One of the boys had wet himself and the teacher was helping him change his clothes. I was so nervous on my first day at school I wet myself. wet the/your bed\nto urinate in your bed by accident: She still sometimes wets the bed at night.\nSee more\nSMART Vocabulary: related words and phrases\nWet weather & wetness\nclammily\nclamminess\ndamp\ndamply\ndampness\ndankly\ndouse\nflooded\nmoisten\nmonsoon\nrehydration\nsaturation\nsemi-dry\nsleety\nslobbery\nsoak\nsoaked\nsodden\nsoggily\nwaterlogged\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: urine & urinating\nIdiom\nwet your whistle\nwet noun\n(WATER)\n[ U ] liquid, especially water: Don't put your newspaper down in the wet. the wet mainly UK\nwet weather: Don't leave it out there in the wet.\nSMART Vocabulary: related words and phrases\nWater in general\naquatically\naqueous\nbathwater\nbathymetric\nbathymetrically\nbathymetry\nbrackish\nbriny\ndistilled water\ngrey water\nhydrosphere\nhypersaline\nhypersalinity\nnon-turbulent\noverwater\npool\nrainwater\nsalt water\nsoft water\nstorm surge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrecipitation: rain\nwet noun\n(PERSON)\n[ C ] UK disapproving someone who has a weak character and does not express any forceful opinions: Come on Tom, don't be such a wet!\n[ C ] UK disapproving a member of the Conservative Party in Britain with no strong or extreme opinions\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakling\nweakly\nweakness\nweedy\nwetly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGovernment ministers & civil servants\nAdd to word list\nAdd to word list\nwith liquid in, on, or around something; not dry: I stepped in a puddle of water and got my shoes wet.\nIf paint, ink, etc., is wet, it has not had time to dry.\nWet weather is weather with rain. wetness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈwet·nəs/\nA lot of the wetness will evaporate before the rain reaches the plant’s roots.\nA person, esp. a child, who wets something causes it to become wet by urinating: He still sometimes wets his bed."}