{"id":404746,"name":"whatever","type":"pronoun","us_sound":"wɑːˈt̬ev.ɚ","us_link":"../audio/w/whatever.mp3","uk_sound":"wɒtˈev.ər","uk_link":"../audio/w/ukwet__022.mp3","content":"whatever pronoun, determiner\n(NOT IMPORTANT WHAT)\nAdd to word list\nAdd to word list\nB2 it is not important what is; it makes no difference what (is): We'll go whatever the weather. Whatever happens, you know that I'll stand by you. Whatever else may be said of him, Mr Meese is not scared of a fight. Whatever the outcome of the war, there will be no winners. Whatever the reason, more people are emigrating to Australia today than at any time since the 1950s.\nMore examplesFewer examplesI tend to doubt the wisdom of separating a child from its family whatever the circumstances.She has vowed to remain true to the president whatever happens.This range of jackets is styled to look good whatever the occasion.He was taught at school to keep a stiff upper lip, whatever happens.Whatever you think of him, you have to admire his determination.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhand\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\ntooth\nwhen\nSee more results »\nwhatever pronoun, determiner\n(ANYTHING)\nB1 anything or everything: I eat whatever I want and I still don't seem to put on weight. \"What can we do tonight?\" \"It's up to you - whatever you want.\" Whatever I say I always seem to get it wrong. Don't, whatever you do, tell Patrick (= you certainly should not tell him). Do whatever you want - it won't affect me. \"So, I'll bring red wine.\" \"Sure, whatever (= bring that or anything else).\" Apparently he \"discovered himself\" in India, whatever that means (= I do not know what that means).\nMore examplesFewer examplesTolerant of human frailty in whatever form, she almost never judged people.You can eat whatever you like as long as it's in moderation.It's a very permissive school where the children are allowed to do whatever they like.This range of jackets is styled to look good whatever the occasion.He's got the committee firmly under his thumb - they agree to whatever he asks.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nwhatever pronoun\n(SURPRISE)\nused instead of the word \"what\" to add emphasis to a phrase, usually expressing surprise: Whatever is he doing with that rod? Whatever's that yellow thing on your plate? Whatever did you say that for? Whatever does she see in him - he's horrible! Whatever made him buy that jacket?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nEmphatic questions with whatever and what on earthWe can ask emphatic questions using whatever or what on earth to express shock or surprise. We stress ever and earth: …\nwhatever adverb\n(EMPHASIS)\n→\nwhatsoever : There is no evidence whatever to show that this is in fact the case.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nSee more results »\nwhatever adverb\n(DISRESPECT)\ninformal something that is said to show that you do not respect or care about what someone is saying, especially someone who is asking you to agree with them or agree to do something: \"Bryce, could you do what I ask you to once in a while?\" \"Whatever.\"\nSMART Vocabulary: related words and phrases\nExpressions meaning 'it isn't important to me'\nbe all the same to someone idiom\nbe no skin off someone's nose idiom\nbig deal\nbully\nbully for someone idiom\ndamn\nfig\nheck\nmeh\nmonkey\nnot care/give a fig idiom\nnot care/give a sod idiom\nnot care/give tuppence idiom\nshit\nso what? idiom\nThat's not saying much. idiom\ntoss\ntough\ntough luck idiom\ntuff\nSee more results »\nwhatever pronoun\n(SOMETHING UNKNOWN)\nAdd to word list\nAdd to word list\nsomething whose particular nature or type you do not know: Whatever happens, you’ll be all right. You seem to criticize me whatever I do.\nwhatever pronoun\n(ANYTHING)\nanything or everything: Give him whatever he wants.\nwhatever adverb [not gradable]\n(NOT IMPORTANT WHAT)\nused to say that something is not important or makes no difference: \"Can I dress casually or do I have to dress up?\" \"Whatever.\""}