{"id":404829,"name":"wheelhouse","type":"noun","us_sound":"ˈwiːl.haʊs","us_link":"../audio/w/cdo0123uswhee2620.mp3","uk_sound":"ˈwiːl.haʊs","uk_link":"../audio/w/cdo0123ukwhee2961.mp3","content":"wheelhouse noun\n(ON BOAT)\nAdd to word list\nAdd to word list\n[ C ] (also wheel-house, wheel house) a structure with a roof on a boat that provides shelter for the person who is controlling the direction of the boat: The boat was hit by a 12-foot wave that broke over the wheelhouse. On another trip, I took a cargo boat, sleeping on the wheel-house roof. I was alone in the wheel house when the ship was sighted.\nMore examplesFewer examplesHe was perched on top of the wheelhouse of the severely listing ship.They could just make out the figure of the helmsman in the wheelhouse.In the wheelhouse where the captain sits, shoals of fish show up as yellow blips on radar screens.There was no communication link between the divers and the wheelhouse.\nSMART Vocabulary: related words and phrases\nParts of ships & boats\nabaft\nbilge water\nboathook\nboiler room\nbowline\ncleat\ncockpit\ncouchette\nescape hatch\nkeel\npaddle\nperiscope\npropeller\nspar\nsteerage\nstem\nstrop\nsun deck\nsuperstructure\ntopsail\nSee more results »\nwheelhouse noun\n(SKILL)\nsomeone's wheelhouse [ S ] informal\nUS an area that someone is interested in and skilled at: Finding new ways of advertising our products has always been my wheelhouse. I first needed to figure out what was in my wheelhouse. Unfortunately, for most of the time I had been working outside my wheelhouse.\nIn baseball, if a pitcher throws the ball in a batter's wheelhouse, they throw the ball to a place where the batter can hit it powerfully: The ball was up and right in the hitter's wheelhouse. I got a pitch in my wheelhouse but I hit it right at the second baseman.\nMore examplesFewer examples\"We're going to stay in our wheelhouse and carry on doing do what we do well,\" she said.This recipe looks right in my wheelhouse! It's one of those restaurants where you can't easily tell what their wheelhouse is - steak or fish?\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nspeciality\nwhat someone is (really) made of idiom\nwizardry\nworkmanship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders"}