{"id":404931,"name":"when","type":"adverb","us_sound":"wen","us_link":"../audio/w/when.mp3","uk_sound":"wen","uk_link":"../audio/w/ukwheel011.mp3","content":"Add to word list\nAdd to word list\nA1 at what time; at the time at which: \"I did tell you about it.\" \"When? I don't remember.\" When are you going? When's the baby due? We'll go when you're ready. Tell me when to start. Ask him when he's next coming home. When do you expect to have the project completed (by)? She was only 20 when she had her first baby. He was shocked when I told him. I hate it when there's no one in the office. I went there when I was a child. I was just getting into the bath when the phone rang.\nMore examplesFewer examplesI rang them yesterday to check when they were arriving.So when did you start collecting antique glass?She was 74 years of age when she wrote her first novel.What did you miss most about England when you were living in France?Who will be in charge of the department when Sophie leaves?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nyes\nSee more results »\nGrammar\nAs, when or while?As, when and while are conjunctions. In some uses as, when and while can mean the same, but they can also have slightly different meanings. We use them to introduce subordinate clauses. …\nAsWe can use as to introduce two events happening at the same time. After as, we can use a simple or continuous form of the verb. The continous form emphasises an action that interrupts or occurs during the progress of another action: …\nWhenWe can use when to introduce a single completed event that takes place in the middle of a longer activity or event. In these cases, we usually use a continuous verb in the main clause to describe the background event: …\nWhile and asWe can use while or as to talk about two longer events or activities happening at the same time. We can use either simple or continuous verb forms: …\nWhen and while without a subjectWe can use when and while without a verb, or without a subject + auxiliary verb be: …\nIf or when?We use if to introduce a possible or unreal situation or condition. We use when to refer to the time of a future situation or condition that we are certain of: …\nRelative pronouns: when, where and whyIn informal language, we often use where, when or why to introduce defining relative clauses instead of at which, on which or for which. …\nWhenWhen is a wh-word. We use when to ask questions, as a conjunction and to introduce relative clauses. …\nWhen as a question wordWe can use when to ask for information about what time something happens: …\nWhen as a conjunctionWe use when as a conjunction meaning ‘at the time that’. The clause with when is a subordinate clause (sc) and needs a main clause (mc) to complete its meaning. If the when-clause comes before the main clause, we use a comma. …\nWhen as a relative pronounWe can use when as a relative pronoun in relative clauses: …\nSince when?We can use since when to ask at what time something began. We often use it as a response when we are surprised that something has begun: …\nWhen or if?We use when to refer to a future situation or condition that we are certain of, whereas we use if to introduce a possible or unreal situation. …\nWhen or since?We use when to mean ‘(at) the time that’. We use since to refer to a particular time in the past until another time or until now: …\nWhen: typical errorsBe careful not to use when instead of if: …\nwhat/which time: \"Did you know Lucy was back in England?\" \"Is she - since when?\"\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nyes\nSee more results »\nGrammar\nWhenWhen is a wh-word. We use when to ask questions, as a conjunction and to introduce relative clauses. …\nWhen as a question wordWe can use when to ask for information about what time something happens: …\nWhen as a conjunctionWe use when as a conjunction meaning ‘at the time that’. The clause with when is a subordinate clause (sc) and needs a main clause (mc) to complete its meaning. If the when-clause comes before the main clause, we use a comma. …\nWhen as a relative pronounWe can use when as a relative pronoun in relative clauses: …\nSince when?We can use since when to ask at what time something began. We often use it as a response when we are surprised that something has begun: …\nWhen or if?We use when to refer to a future situation or condition that we are certain of, whereas we use if to introduce a possible or unreal situation. …\nWhen or since?We use when to mean ‘(at) the time that’. We use since to refer to a particular time in the past until another time or until now: …\nWhen: typical errorsBe careful not to use when instead of if: …\nIdiom\nsince when\nwhen conjunction\n(CONSIDERING THAT)\nB2 considering the fact that: How can you say you don't like something when you've never even tried it! You can't complain about being lonely when you don't make any effort to meet people. Why is she training to be a teacher when she doesn't even like children? I don't suppose I can really call myself a vegetarian when I eat fish.\nMore examplesFewer examplesIt's pointless to invite him when you know he won't come.Why did you buy a fishing rod when you could have borrowed mine?Why should I do the exam when I know I've failed the course already?You shouldn't judge them when you don't know the full story.I shouldn't get upset by his comments when I know he's only joking.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nSee more results »\nwhen conjunction\n(ALTHOUGH)\nB2 despite the fact that: He says he doesn't have any money when in fact he has thousands of dollars in his account. I don't understand how he can say that everything's fine when it's so obvious that it's not.\nMore examplesFewer examplesHe placed a bet on his team when he knows they're likely to lose.They claimed to know each other when in fact they've never met before.It was good of you to offer me a lift when I know you don't like driving at night.It was thoughtless of you to cook steak when you know I'm a vegetarian.She says she enjoys watching horror films when in fact she gets really scared by them.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nSee more results »\nGrammar\nIf or when?We use if to introduce a possible or unreal situation or condition. We use when to refer to the time of a future situation or condition that we are certain of: …\nWhenWhen is a wh-word. We use when to ask questions, as a conjunction and to introduce relative clauses. …\nWhen as a question wordWe can use when to ask for information about what time something happens: …\nWhen as a conjunctionWe use when as a conjunction meaning ‘at the time that’. The clause with when is a subordinate clause (sc) and needs a main clause (mc) to complete its meaning. If the when-clause comes before the main clause, we use a comma. …\nWhen as a relative pronounWe can use when as a relative pronoun in relative clauses: …\nSince when?We can use since when to ask at what time something began. We often use it as a response when we are surprised that something has begun: …\nWhen or if?We use when to refer to a future situation or condition that we are certain of, whereas we use if to introduce a possible or unreal situation. …\nWhen or since?We use when to mean ‘(at) the time that’. We use since to refer to a particular time in the past until another time or until now: …\nWhen: typical errorsBe careful not to use when instead of if: …\nwhen conjunction, adverb [not gradable]\n(AT WHAT TIME)\nAdd to word list\nAdd to word list\nat what time; at the time at which: When is supper going to be ready? When did the American Civil War begin? I was just getting into the shower when the phone rang.\nwhen conjunction\n(CONSIDERING THAT)\nconsidering the fact that: I can’t really call myself a vegetarian when I eat fish.\nwhen conjunction\n(ALTHOUGH)\ndespite the fact that: He says he hasn’t got any money when the truth is he’s got plenty."}