{"id":404942,"name":"whenever","type":"adverb","us_sound":"wenˈev.ɚ","us_link":"../audio/w/whenever.mp3","uk_sound":"wenˈev.ər","uk_link":"../audio/w/ukwheel013.mp3","content":"Add to word list\nAdd to word list\nB1 every or any time: I blush whenever I think about it. Whenever I go there they seem to be asleep. I try to use olive oil whenever possible. \"Will it be okay if I do it tomorrow?\" \"Sure, whenever (= then or at any other time).\" Do it in a spare moment at the weekend or whenever - it really doesn't matter. I'm talking about last July or whenever it was you got back from India.\nMore examplesFewer examplesThere's a night safe outside the bank, so you can deposit money whenever you wish.It's funny how Alec always disappears whenever there's work to be done.Just because I'm lending you my dress for tonight doesn't mean you can borrow it whenever you want to.He goes to the opera whenever he can.Come and see us whenever you're in town - you're always welcome.\nSMART Vocabulary: related words and phrases\nAlways & never\nagain\nall along idiom\nall-time\nalong\nalways\naye\never\nfail\nhell\nin all my (born) days idiom\nin/through all the years idiom\ninvariably\nkingdom\nmonth\non demand idiom\nperpetual\nperpetually\ntill/until kingdom come idiom\ntill/until the cows come home idiom\nworld\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: relative forms\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nused instead of \"when\" to add emphasis to a phrase, usually expressing surprise: Whenever do you get the time to do these things? Whenever did Jane see a fortune teller?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhat/where/how/why the devil idiom\nwhen\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nwhenever conjunction\n(EVERY TIME)\nAdd to word list\nAdd to word list\nevery or any time: I’m embarrassed whenever I think about it. I try to let the kids out to play whenever possible.\nwhenever conjunction, adverb [not gradable]\n(NOT IMPORTANT WHEN)\nused to say that the time something is done is not important or makes no difference: \"Will it be okay if we meet tomorrow instead of today?\" \"Sure, whenever.\""}