{"id":404991,"name":"wherever","type":"adverb","us_sound":"werˈev.ɚ","us_link":"../audio/w/wherever.mp3","uk_sound":"weəˈrev.ər","uk_link":"../audio/w/ukwheel023.mp3","content":"Add to word list\nAdd to word list\nB1 to or in any or every place: We can go wherever you like. Wherever I go I always seem to bump into him. All across Europe, wherever you look, marriage is in decline and divorce rates are soaring. Wherever you choose to live there are always going to be disadvantages. He lives in Overington, wherever that is.\nB2 in every case: Wherever possible I use honey instead of sugar.\nMore examplesFewer examplesShe has an annoying predisposition to find fault wherever she goes.He has to go wherever his job takes him.Geothermal power is generated wherever water comes into contact with hot rocks below the earth's surface.Water is pumped out through pipes that carry it to wherever it is to be used.Soldiers must go wherever the army assigns them.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhere\nwhereby\nwhereof\nwheresoever\nwhich\nwhichever\nwhither\nwhoever\nwhom\nwhose\nwhosoever\nwot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlways & never\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nused instead of \"where\" to add emphasis to a phrase, usually expressing surprise: Wherever did you find that hat! Wherever did you get that idea! Wherever does he get the money from to go on all these exotic journeys?\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhere\nwhereby\nwhereof\nwheresoever\nwhich\nwhichever\nwhither\nwhoever\nwhom\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nAdd to word list\nAdd to word list\nto or in any or every place: We can go wherever you like.\nWherever can also mean in all types of situations: We try to save money wherever possible, for instance by using coupons when we buy groceries."}