{"id":404948,"name":"where","type":"adverb","us_sound":"wer","us_link":"../audio/w/where.mp3","uk_sound":"weər","uk_link":"../audio/w/ukwheel014.mp3","content":"Add to word list\nAdd to word list\nA1 to, at, or in what place: Where does he live? \"I put it on your desk.\" \"Where? I can't see it.\" Where are we going? Now where did I put my glasses? Where's the party being held? Could you tell me where Barker Drive is, please? Where did you put my umbrella? I've left my keys somewhere and I don't know where. You found my diary - where on earth was it? I've been meaning to ask you where you get your hair cut. Bradford, where Bren comes from, has a lot of good curry restaurants. She lived in Rome for a couple of years, where she taught English. You see where Mira is standing? Well, he's behind her. I like to have him next to me where I can keep an eye on him. I read it somewhere - I don't know where (= in which book, newspaper, etc.).\nB2 used when referring to a particular stage in a process or activity: You reach a point in any project where you just want to get the thing finished. I've reached the stage where I just don't care any more.\nin what situation: You're not available on the 12th and Andrew can't make the 20th - so where does that leave us? Where do you see yourself five years from now?\nMore examplesFewer examplesIt's difficult choosing where to live.You should put the money in a savings account where it will earn interest.Look where you're going!There were dirty marks on her trousers where she had wiped her hands.She's past the age where she needs a babysitter.\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwherefore\nwhich\nwhy\nworld\nyes\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: relative forms\nGrammar\nRelative pronouns: when, where and whyIn informal language, we often use where, when or why to introduce defining relative clauses instead of at which, on which or for which. …\nWhereWhere is a wh-word. We use where to ask questions, as a conjunction and to introduce relative clauses. …\nWhere as a question wordWe can use where to ask for information about place: …\nEmphatic questions with wherever and where on earthWe can ask emphatic questions using wherever or where on earth to express shock or surprise. We stress ever and earth: …\nWhere as a conjunctionWe use where as a conjunction meaning ‘in the place that’ or ‘in situations that’. The clause with where is a subordinate clause and needs a main clause to complete its meaning. If the where clause comes before the main clause, we use a comma: …\nWhere as a relative pronounWe can use where as a relative pronoun: …\nIdioms\nbe where it's at\nknow/see where someone is coming from\nwhere conjunction, adverb [not gradable]\n(WHAT PLACE)\nAdd to word list\nAdd to word list\nto, at, or in what place: Where did she go to college? I forget where I put the car keys. I read it somewhere – I don’t know where (= the exact place).\nWhere can be used to mean at what stage: You reach a point where you just want to get the thing finished. Idioms\nwhere someone is coming from\nwhere to turn"}