{"id":405005,"name":"whether","type":"conjunction","us_sound":"ˈweð.ɚ","us_link":"../audio/w/whether.mp3","uk_sound":"ˈweð.ər","uk_link":"../audio/w/ukwheel026.mp3","content":"Add to word list\nAdd to word list\nB1 (used especially in reporting questions and expressing doubts) if, or not: I wasn't sure whether you'd like it. She asked me whether I was interested in working for her. I'm wondering whether to have the fish or the beef. I doubt whether it'll work. I was merely questioning whether we have the money to fund such a project.whether or not It all depends on whether or not she has the time. Anyway, it's a good story, whether or not it's true. whether...or\nB1 (used to introduce two or more possibilities) it is not important if: whether ... or not I'm going, whether she likes it or not.\nSee more\nMore examplesFewer examplesHe called for checks to discover whether corrupt officials are being bribed to connive in shoddy construction.The authorities debated whether to build a new car park.We need to consider whether the disadvantages of the plan outweigh the advantages.She asked the man sitting opposite whether he'd mind if she opened the window.She doubts whether she'll ever be able to fulfil her ambition.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nsuppose\nunless\nGrammar\nWhether not ifWe use whether and not if after prepositions: …\nI doubt if, I don’t know whetherWe use if or whether to introduce clauses after verbs of doubting: …\nIf, whether: typical errorsWe use whether, not if, before to-infinitives: …\nIf or whether? …\nIf and whether: indirect questionsWe can use if or whether to report indirect yes-no questions and questions with or. If is more common than whether: …\nWhetherWhether is a conjunction. …\nWhether in indirect questionsWe use whether in indirect yes-no questions and questions with or. We can’t leave out whether (or if): …\nWhether … orWe use whether … or to introduce a clause giving two options or alternatives: …\nWhether … or notWe use whether … or not or whether or not to give an opposite alternative: …\nAdd to word list\nAdd to word list\n(used to refer to one or more possibilities or to express uncertainty) if: I didn’t know whether he was too busy or (whether) he just didn’t want to see me. I wasn’t sure whether (or not) you’d like it. Idiom\nwhether or not"}