{"id":405025,"name":"whichever","type":"determiner","us_sound":"wɪˈtʃev.ɚ","us_link":"../audio/w/whichever.mp3","uk_sound":"wɪˈtʃev.ər","uk_link":"../audio/w/ukwhich001.mp3","content":"Add to word list\nAdd to word list\nB2 any one from a limited set: We can go to the seven o'clock performance or the eight - whichever is best for you. Either Thursday or Friday - choose whichever day is best for you.\nMore examplesFewer examplesPlease strike out whichever option does not apply to you.Take whichever of these chocolates you like.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhoever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nB2 it is not important which: It's going to be expensive whichever way you do it. Whichever option we choose there'll be disadvantages.\nMore examplesFewer examplesHe can choose whichever dates suit him.Whichever route he decides to take, he won't be here before 6.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhand\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\ntooth\nwhen\nwhereas\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nAdd to word list\nAdd to word list\nused to say that among various possibilities, there is no important difference or that you are free to choose the one you like: We can go either Thursday or Friday, whichever is best for you. Taxpayers could take their choice between the standard deduction and itemizing, and use whichever produced a better result. It’s going to be expensive whichever way you do it."}