{"id":405024,"name":"which","type":"determiner","us_sound":"wɪtʃ","us_link":"../audio/w/which.mp3","uk_sound":"wɪtʃ","uk_link":"../audio/w/ukwheel030.mp3","content":"which determiner, pronoun\n(QUESTION)\nAdd to word list\nAdd to word list\nA1 (used in questions and structures in which there is a fixed or limited set of answers or possibilities) what one or ones: Which party would you prefer to go to - Anna's or Dan's ? Which doctor did you see - Seward? Which time suits you better - 12.30 or one o'clock? \"Jacinta was there with her boyfriend.\" \"Which one? She has several.\" Which is mine? The smaller one? See if you can guess which one is me in my old school photo. It's either Spanish or Portuguese that she speaks, but I've forgotten which. Which of the desserts did you have? Which of your parents do you feel closer to?\nMore examplesFewer examplesWhich side are you on?Is there a particular sequence in which you have to perform these tasks?Why don't you play about with the different fonts on the computer and see which one you want to use?Which of these jackets do you prefer?Which town shall we visit next? Bristol or Bath?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwhere\nwherefore\nwhy\nworld\nyes\nSee more results »\nwhich determiner, pronoun\n(ADDS INFORMATION)\nB1 used to add extra information to a previous clause, in writing usually after a comma: That bar on Milton Street, which by the way is very nice, is owned by Trevor's brother. She says it's Charlotte's fault, which is stupid, and that she blames her. Anyway, that evening, which I'll tell you more about later, I ended up staying at Rachel's place. It's the third in a sequence of three books, the first of which I really enjoyed. He showed me round the town, which was very kind of him. The picking of the fruit, for which work they receive no money, takes about a week.\nMore examplesFewer examplesHe said the police assaulted him while he was in custody, a claim which the police deny.His mother lives in the next street to us, which is a little too close for comfort.She appears to actually like the man, which I find incredible.He's got pink walls and a green carpet, which to my mind looks all wrong.The bomb, which killed 15 people, was the worst of a series of terrorist outrages.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nWhichWhich is a wh-word. We use which to ask questions and to introduce relative clauses. …\nWhich as a question wordWe use which in questions as a determiner and interrogative pronoun to ask for specific information: …\nWhich in relative clausesWe use which in relative clauses to refer to animals and to things: …\nWhich + ofWe use of with which before other determiners (the, those, your) and pronouns (yours, them): …\nwhich pronoun\n(USED TO REFER)\nA2 used as the subject or object of a verb to show what thing or things you are referring to, or to add information about the thing just mentioned. It is usually used for things, not people: These are principles which we all believe in. You know that little Italian restaurant - the one which I mentioned in my letter? Is that the film in which he kills his mother? The death of his son was an experience from which he never fully recovered. It isn't a subject to which I devote a great deal of thought.\nMore examplesFewer examplesThe band played a familiar tune which had everyone clapping along.It's a disease which affects mainly older people.The cliffs on which the houses are built are starting to crumble.He denied all responsibility for the rumours which have been circulating.These plants need a rich soil which retains moisture.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronouns: whichWe use which in relative clauses to refer to animals and to things. We use it to introduce defining and non-defining relative clauses. We always use which to introduce relative clauses when they refer to a whole sentence or clause: …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nRelative pronouns: typical errorsWe can’t use that instead of who, whom or which in non-defining relative clauses: …\nWhichWhich is a wh-word. We use which to ask questions and to introduce relative clauses. …\nWhich as a question wordWe use which in questions as a determiner and interrogative pronoun to ask for specific information: …\nWhich in relative clausesWe use which in relative clauses to refer to animals and to things: …\nWhich + ofWe use of with which before other determiners (the, those, your) and pronouns (yours, them): …\nIdiom\nwhich is which\nwhich pronoun, adjective [not gradable]\n(QUESTION)\nAdd to word list\nAdd to word list\n(used in questions and statements having a limited number of possibilities) what one or ones: Which train do you want to take – the one in the morning or the one in the afternoon? She had trouble deciding which of her dresses to wear to the party. She speaks Spanish or Portuguese, but I’ve forgotten which. Idioms\nwhich is which\nwhich way to turn\nwhich pronoun\n(USED TO REFER)\nused to show what particular thing is being referred to: It was a subject which he had never thought much about. The club to which he belonged had just become too expensive.\nwhich pronoun\n(ADDS INFORMATION)\nused to add extra information about something mentioned earlier, in writing following a comma: She said it would be done by March, which I doubt. The training, for which you will be paid, takes four weeks."}