{"id":405091,"name":"while","type":"conjunction","us_sound":"waɪl","us_link":"../audio/w/while.mp3","uk_sound":"waɪl","uk_link":"../audio/w/ukwhich004.mp3","content":"while conjunction\n(DURING)\nAdd to word list\nAdd to word list\nA2 (also formal whilst, uk/waɪlst/ us/waɪlst/) during the time that, or at the same time as: I read it while you were drying your hair. While I was in Italy I went to see Alessandro. I thought I heard him come in while we were having dinner. \"I'm going to the post office.\" \"While you're there can you get me some stamps?\"\nMore examplesFewer examplesI thought I'd take advantage of the sports facilities while I'm here.I found these photos while I was cleaning out my cupboards.I'm acting as deputy while the boss is away.I didn't drink at all while I was pregnant.I gained a lot of weight while I was on holiday.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nwhile conjunction\n(ALTHOUGH)\nB2 (also formal whilst) despite the fact that; although: While I accept that he's not perfect in many respects, I do actually like the man. While I fully understand your point of view, I also have some sympathy with Michael's.\nMore examplesFewer examplesWhile your work has improved greatly, there are still some areas that concern me.While I'd like to accept your offer, I'm unable to at the present time.While I admire your courage, it's sometimes better not to get involved.While I'd be willing to help you on this occasion, I may not always be able to in future.While I'm reluctant to make a fuss, I feel I really must complain.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nwhile conjunction\n(BUT)\nB1 compared with the fact that; but: He gets £50,000 a year while I get a meagre £20,000! Tom is very extrovert and confident while Katy's shy and quiet. I do all the housework while he just does the dishes now and again.\nMore examplesFewer examplesWalnut is a hard wood, while pine is soft.He likes football, while I prefer rugby.I get 25 days holiday a year, while she gets over 50.Simon will have steak, while I'll have the fish.He wanted to go the party, while I wanted to stay in.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nGrammar\nAs, when or while?As, when and while are conjunctions. In some uses as, when and while can mean the same, but they can also have slightly different meanings. We use them to introduce subordinate clauses. …\nAsWe can use as to introduce two events happening at the same time. After as, we can use a simple or continuous form of the verb. The continous form emphasises an action that interrupts or occurs during the progress of another action: …\nWhenWe can use when to introduce a single completed event that takes place in the middle of a longer activity or event. In these cases, we usually use a continuous verb in the main clause to describe the background event: …\nWhile and asWe can use while or as to talk about two longer events or activities happening at the same time. We can use either simple or continuous verb forms: …\nWhen and while without a subjectWe can use when and while without a verb, or without a subject + auxiliary verb be: …\nWhile and whilstWhile and whilst mean the same when we use them as conjunctions. They both mean ‘during the time that something else happens’, or ‘in contrast with something else’. While is much more common than whilst, and whilst sounds more formal: …\nIdiom\nwhile sb is at it\na while\nB1 a length of time: I only stayed for a short while.quite a while You were there quite a while (= a long time), weren't you?a while ago \"When did that happen?\" \"Oh, it was a while ago (= a long time ago).for a while I haven't seen him for a while (= for a long time).in a while I'll be fine in a while (= soon). It will take a little while to settle in. It was quite stressful at first but after a while, I started to enjoy the work.\nMore examplesFewer examplesI lived on my own for a while but I missed the companionship of others.I'm going to concentrate on my writing for a while.We had tea, and afterwards we sat in the garden for a while.We made a deliberate decision to live apart for a while.My suitcase began to feel really heavy after a while.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nIdiom\nall the while\nwhile noun [U]\n(LENGTH OF TIME)\nAdd to word list\nAdd to word list\na length of time: He only had to wait a short while. It was a while before any waiter took their order. That happened a while ago (= did not happen recently). I haven’t seen him for a while (= a long time). She’s getting dressed, and she’ll be ready in just a little while (= soon).\nwhile conjunction\n(DURING)\nduring the time that, or at the same time as: I read it while you were drying your hair. \"I’m going to the post office.\" \"While you’re there can you get me some stamps?\"\nwhile conjunction\n(ALTHOUGH)\ndespite the fact that; although: While I know he’s not perfect, I do like him.\nwhile conjunction\n(BUT)\ncompared with the fact that; but: Tom is very outgoing, while Ken’s shy and quiet."}