{"id":405377,"name":"whistle","type":"verb","us_sound":"ˈwɪs.əl","us_link":"../audio/w/whistle.mp3","uk_sound":"ˈwɪs.əl","uk_link":"../audio/w/ukwhisk007.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to make a high sound by forcing air through a small hole or passage, especially through the lips, or through a special device held to the lips: He whistled as he worked. On the days when she wore a skirt the men on the building site would whistle at her. Someone was whistling Beatles tunes outside my window. The referee whistled and the game was over.\n[ I + adv/prep ] to make a long, high sound while moving quickly through or past something: She heard the wind whistling through the trees and the howl of a distant wolf. I stepped out of the building and immediately a bullet whistled past my head.\n[ I ] When birds whistle, they sing in high musical notes: The birds were whistling in the early morning quiet.\nMore examplesFewer examplesHe whistled to call his dogs.She always whistles in the bath.He was whistling a merry tune.\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncheer\ncrow\ncrunch\nembouchure\nglug\ngroan\ngrowl\nlaugh, shout, scream, etc. your head off idiom\nmewl\nraspberry\nsquall\nululation\nunsounded\nvocalization\nwail\nwhoop\nwolf whistle\nyelp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nAnimal (non-human) sounds\nB2 the sound made by someone or something whistling: I recognized my father's tuneless whistle. It sounded like the whistle of an old-fashioned steam train. She listened to the whistle of the wind through the trees.\nan object that you hold to your lips and blow through in order to make a loud, high sound: The referee blew his whistle for half-time.\nDorling Kindersley/GettyImages\nSMART Vocabulary: related words and phrases\nSounds made by humans with their mouths\ncatcall\ncaterwauling\ncheer\ncrow\ncrunch\nembouchure\nglug\ngroan\ngrowl\nlaugh, shout, scream, etc. your head off idiom\nmewl\nraspberry\nsquall\nululation\nunsounded\nvocalization\nwail\nwhoop\nwolf whistle\nyelp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nMusical instruments\nIdiom\nthe final whistle\nAdd to word list\nAdd to word list\nto make a musical sound by forcing the breath through a small passage between the lips or through a special device: [ I ] I whistled to my dog and she came running back. [ I ] fig.The wind whistled through the trees.\nA whistle is also a device that makes a loud, high sound when you blow into it."}