{"id":405400,"name":"white","type":"adjective","us_sound":"waɪt","us_link":"../audio/w/white.mp3","uk_sound":"waɪt","uk_link":"../audio/w/ukwhisk009.mp3","content":"white adjective\n(COLOUR)\nAdd to word list\nAdd to word list\nA1 of a colour like that of snow, milk, or bone: a white T-shirt white walls a black and white dog He's white-haired now.\nPeter Gardner/Dorling Kindersley/GettyImages\nC2 having a pale face because you are not well, or you are feeling shocked: She was white, and her lips were pale.\nA2 used in the names of various food and drink products, many of which are not pure white but slightly cream, yellow, grey, or transparent: white bread white chocolate white flour white sugar white wine\nMore examplesFewer examplesThe bride's hair was adorned with pearls and white flowers.Factory chimneys belched dense white smoke into the sky.I like the contrast of the white trousers with the black jacket.The book's cover has white lettering on a blue background.It was a seaside town filled with small white bungalows.\nSMART Vocabulary: related words and phrases\nBlack, white & grey\nblackness\ncoaly\ndove grey\ndusty\nebony\ngreyish\ngreyly\ngreyness\ngunmetal grey\ninky\njet black\nlily-white\npearl\npearly\npitch darkness\npitchy\nsable\nsnow white\nsombrely\nsooty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColourless or causing colour to fade\nVarious qualities of food\nwhite adjective\n(COFFEE)\nwith milk or cream added: I start the day with a cup of white coffee.UK \"How do you like your coffee?\" \"White and no sugar, please.\"\nSMART Vocabulary: related words and phrases\nWarm drinks\nAmericano\narabica\nAssam\nbabyccino\nbed-tea\ncoffee maker\ncongou\ncrema\ncuppa\nDarjeeling\ninfusion\nIrish coffee\njasmine tea\njoe\nKeepCup\nrobusta\nrooibos\nRosie Lee\nsencha\nstewed\nSee more results »\nwhite adjective\n(PEOPLE)\nB1 belonging to the group of people with skin that is pale in colour, who come from or whose family originally came from Europe: He had a black mother and a white father. a predominantly white neighbourhood\nMore examplesFewer examplesThe first white settlers journeyed across America in covered wagons.They claimed that white workers are being paid more than there black counterparts.The South African team now includes both black and white players.Her mother had prohibited her from marrying a white man.White people are at greater risk of getting skin cancer.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nashy\nblush\ncolouring\ncraggily\ncraggy\ncutaneous\nmole\npallor\npore\nsanguine\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbed\ntattooist\nwrinkle\nSee more results »\nRelated word\nwhitenessIdioms\n(as) white as a sheet\nwhiter than white\nwhite noun\n(COLOUR)\nA2 [ U ] a colour like that of snow, milk, or bone: In some countries it is traditional for a bride to wear white.\nIana Kunitsa/Moment/GettyImages whites [ plural ]\nwhite clothes, either worn for a particular activity or job, or put together to be washed at the same time: tennis whites A girl in tennis whites was hurrying across the grass towards them.\nSee more white of the eye\nthe part of the eye that is white: Don't shoot until you see the whites of their eyes (= until the people are very close to you).\nSee more egg white (also white of an egg)\nthe transparent part of an egg that surrounds the yolk and becomes white when cooked: Beat four egg whites into stiff peaks.\nSee more\nMore examplesFewer examplesWe decorated our house completely in white.She always dresses in white.The vase stands out against the white of the wall.\nSMART Vocabulary: related words and phrases\nBlack, white & grey\nblackness\ncoaly\ndove grey\ndusty\nebony\ngreyish\ngreyly\ngreyness\ngunmetal grey\ninky\njet black\nlily-white\npearl\npearly\npitch darkness\npitchy\nsable\nsnow white\nsombrely\nsooty\nSee more results »\nwhite noun\n(PERSON)\n[ C ] a person with skin that is pale in colour, who comes from or whose family originally came from Europe: The neighbourhood is populated mainly by whites.\nSMART Vocabulary: related words and phrases\nThe skin, & skin colour\n-skinned\nalbino\nanti-wrinkle\nashy\nblush\ncolouring\ncraggily\ncraggy\ncutaneous\nmole\npallor\npore\nsanguine\nskin tone\nsubcutanea\nsunbath\nsunbathe\nsunbed\ntattooist\nwrinkle\nSee more results »\nwhite adjective, noun [C/U]\n(COLOR)\nAdd to word list\nAdd to word list\n(of) a color like that of snow, milk, or bone: white hair a white shirt [ C ] We used a bright white on the ceilings.\nThe white of an egg is the part of an egg that becomes white when cooked.\nwhite adjective [-er/-est only]\n(PALE SKIN)\nbelonging to a race whose skin is pale in color; Caucasian: There were many white faces in the crowd."}