{"id":405494,"name":"whitewashing","type":"noun","us_sound":"ˈwaɪt.wɑː.ʃɪŋ","us_link":"../audio/w/cdo0318uswhit5595.mp3","uk_sound":"ˈwaɪt.wɒʃ.ɪŋ","uk_link":"../audio/w/cdo0318ukwhit1588.mp3","content":"whitewashing noun\n(HIDING)\nAdd to word list\nAdd to word list\n[ S or U ] disapproving an attempt to stop people finding out the true facts about a situation: This is a politically correct whitewashing of the region's troubles.\nMore examplesFewer examplesThat was a whitewashing. They had all the information and they did nothing.There were protests over the alleged whitewashing of the country's wartime past in school textbooks.He accused the District Attorney of whitewashing by not asking hard questions of at least one witness.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivate\nprivately\nprivileged\npseudonym\npseudonymization\nunrevealed\nunsourced\nunstated\nuntraceable\nwrap\nSee more results »\nwhitewashing noun\n(RACISM)\n[ U ] informal disapproving the practice of using only white actors, models, or performers, especially the practice of using a white actor to play a character who is not white: Her casting to play a Native American character led to accusations of whitewashing.\nMore examplesFewer examplesI've witnessed a certain whitewashing of jazz, a tendency to book non-African American performers to please white audiences.A black supermodel accused some glossy magazines this week of adopting an unwritten \"whitewashing\" policy.\nwhitewashing noun\n(DEFEAT)\n[ C ] informal a severe defeat, especially one in which the defeated player or team does not score any points: The team has shown encouraging signs of progress since their Six Nations whitewashing.\nMore examplesFewer examplesThe game looked even to start with but turned into a whitewashing.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\ngolden goal\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nstraight\nstrike\ntreble\nSee more results »\nwhitewashing noun\n(PAINTING)\n[ U ] the action of painting walls or buildings using whitewash (= a white liquid): The vandals should pay for whitewashing of the walls.\nMore examplesFewer examplesIs there a workman who could do the whitewashing for us?Whitewashing and plastering of homes was traditionally women's work in Mexico.\nSMART Vocabulary: related words and phrases\nPaints, dyes & pigments\nannatto\nbrazilwood\ncolourant\ndip dye\ndyer\nenamel\nhenna\nlacquer\nlogwood\nmarbling\nnon-drip\npaint\npaint thinner\nsienna\nspray gun\nthinner\ntinted\ntopcoat\nturpentine\nvarnish\nSee more results »"}