{"id":405572,"name":"who","type":"pronoun","us_sound":"huː","us_link":"../audio/w/who.mp3","uk_sound":"huː","uk_link":"../audio/w/cdo0216whouk2279.mp3","content":"who pronoun\n(QUESTIONS)\nAdd to word list\nAdd to word list\nA1 used especially in questions as the subject or object of a verb, when asking which person or people, or when asking what someone's name is: Who did this? Who's she? Who are all those people? She asked me if I knew who had got the job. Who (also formal whom) do you want to talk to? I don't know who to ask to the party.\nused with verbs that relate to knowing, when you want to say that something is not known: who knows \"Are they going to get married?\" \"Who knows?\" (= It is not possible to know at the moment.)who can tell Who can tell what will happen now?\nMore examplesFewer examplesWho told you you could park there?Who have you invited to the party?Who won the match?Who did you vote for in the last election?Who is the president of France?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nyes\nSee more results »\nwho pronoun\n(USED TO REFER)\nA2 used as the subject or object of a verb to show which person you are referring to, or to add information about a person just mentioned. It is used for people, not things: I think it was your dad who phoned. She's one of those people who love to be the centre of attention. He called James, who was a good friend as well as the family doctor. The other people who (also that) live in the house are really friendly. This is Gabriel, who I told you about.\nMore examplesFewer examplesWe need a mayor who is tough enough to clean up this town.There seems to be some confusion over who is actually giving the talk.She's part of a team of scientists who are engaged on/upon cancer research.Have the police got the man who did it yet?People who work in the trade can buy their books at a discount.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nWho, whomWho and whom are wh-words. We use them to ask questions and to introduce relative clauses. …\nWho as a question wordWe use who as an interrogative pronoun to begin questions about people: …\nEmphatic questions with whoever and who on earthWe can ask emphatic questions using whoever or who on earth to express shock or surprise. We stress ever and earth: …\nWho in relative clausesWe use who as a relative pronoun to introduce a relative clause about people: …\nWhomWhom is the object form of who. We use whom to refer to people in formal styles or in writing, when the person is the object of the verb. We don’t use it very often and we use it more commonly in writing than in speaking. …\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronouns: whoWe use who in relative clauses to refer to people, and sometimes to pet animals. We use it to introduce defining and non-defining relative clauses: …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nRelative pronouns: typical errorsWe can’t use that instead of who, whom or which in non-defining relative clauses: …\nIdiom\nwho's who\nabbreviation for\nthe World Health Organization\nSMART Vocabulary: related words and phrases\nMedical places & organizations\nA &amp; E\naccident and emergency\naid station\nbiotech\nbirth centre\nblood bank\nclinic\nconsulting room\ndispensary\ninstitutional\nmadhouse\nmaternity ward\nNICU\nNIH\nnon-hospital\nout of hours idiom\noutpatients\nPICU\nsocialized medicine\nward\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNamed organizations & societies & their members\nwho pronoun\n(ASKING)\nAdd to word list\nAdd to word list\nused esp. in questions to ask which person or people, or to ask someone’s name: Who did this? Who’s she? Note: In formal speech or writing, \"whom\" is the form of \"who\" used when it is the object of a verb or preposition.\nwho pronoun\n(ADDING INFORMATION)\nused as the subject or object of a verb when referring to a particular person or when adding information about a person just mentioned: The other people who live in the house are really friendly. This is Frank, who I told you about. Note: In formal speech or writing, \"whom\" is the form of \"who\" used when it is the object of a verb or preposition. Idioms\nwho cares\nwho needs something\nwho would have thought"}