{"id":405578,"name":"whoever","type":"pronoun","us_sound":"huːˈev.ɚ","us_link":"../audio/w/whoever.mp3","uk_sound":"huːˈev.ər","uk_link":"../audio/w/ukwhodu002.mp3","content":"whoever pronoun\n(PERSON)\nAdd to word list\nAdd to word list\nB2 the person who: Whoever uprooted that tree ought to be ashamed of themselves. Could I speak to whoever is in charge of International Sales, please?\nMore examplesFewer examplesYou roll/throw the dice and whoever gets the highest score goes first.There's a reward for whoever finishes first.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nwhoever pronoun\n(ANYONE)\nB2 any person who: Can whoever leaves last please lock the door? He says he bought the car from Frank, whoever Frank is. (= I do not know who Frank is.)\nMore examplesFewer examplesI shall go out with whoever I please.This is a win-win situation for her, because whoever wins this match, she's still going to be champion.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhichever\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nwhoever pronoun\n(SURPRISE)\nused in questions as a way of expressing surprise: Whoever told you that? Whoever could that be phoning at this time?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhat/where/how/why the devil idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nGrammar\nHowever, whatever, whichever, whenever, wherever, whoeverIf we add -ever to wh-words like how, what, which, when, where and who, we change their meaning. …\nEmphatic questions with whoever and who on earthWe can ask emphatic questions using whoever or who on earth to express shock or surprise. We stress ever and earth: …\nwhoever pronoun\n(PERSON)\nAdd to word list\nAdd to word list\nthe person who: Whoever broke the window will have to pay for it. Note: In formal speech or writing, \"whomever\" is the form of \"whoever\" used when it is the object of a verb or preposition.\nwhoever pronoun\n(ANYONE)\nany person who: The picketers were shouting at whoever entered the building. Whoever they are, I don’t want to see them! Note: In formal speech or writing, \"whomever\" is the form of \"whoever\" used when it is the object of a verb or preposition.\nwhoever pronoun\n(WHAT PERSON)\n(used in place of who for emphasis in questions) what person or persons: Whoever would believe such a ridiculous story?"}