{"id":405588,"name":"wholesale","type":"adjective","us_sound":"ˈhoʊl.seɪl","us_link":"../audio/w/wholesale.mp3","uk_sound":"ˈhəʊl.seɪl","uk_link":"../audio/w/ukwhodu008.mp3","content":"wholesale adjective, adverb\n(SELLING)\nAdd to word list\nAdd to word list\nof or for the selling of goods in large amounts at low prices to shops and businesses, rather than the selling of goods in shops to customers: wholesale prices a wholesale supplier/business We only sell wholesale, not to the public. Compare\nretail noun\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nsell out\nsell something off\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nwholesale adjective, adverb\n(COMPLETE)\noften disapproving (especially of something bad or too extreme) complete or affecting a lot of things, people, places, etc.: wholesale changes wholesale destruction\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nplain\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nthe price at which goods are sold to shops by the people who produce them, rather than the price which the customer usually pays in the shop: I bought my coat direct from the factory at wholesale. Compare\nretail noun\nSMART Vocabulary: related words and phrases\nCosts & expenses\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\ncash flow\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nwholesale noun [U]\n(SELLING)\nAdd to word list\nAdd to word list\nthe activity of selling goods, usually in large amounts, to businesses which then sell them to the public wholesaler noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈhoʊlˌseɪ·lər/\nwholesale adjective\n(COMPLETE)\ninvolving everyone or everything; complete: What the system needs is wholesale reform.\nAdd to word list\nAdd to word list\nthe activity of selling goods to stores, other businesses, etc. rather than to the public: He raised prices slightly for wholesale and retail. Compare\nretail\nrelating to the activity of selling goods or services to stores, other businesses, etc. rather than to the public: Producer prices are a gauge of costs at the wholesale level.a wholesale price/rate The wholesale market price of gasoline is starting to rise.wholesale sales/trade During August, total wholesale sales dropped 0.9%.a wholesale business/company He set up a wholesale business and internet site. He takes his produce daily to the wholesale market in Bradford. Squeezed between manufacturers and retailers is the wholesale sector. The bank plans to exit wholesale banking to concentrate on its core personal financial services business. Compare\nretail\nif something is sold wholesale, it is sold to stores, other businesses, etc. rather than to the public: Breeders who sell puppies wholesale to a broker or pet store must obtain a USDA license. All of her furniture was bought wholesale.\nCompare\nretail"}