{"id":405609,"name":"whom","type":"pronoun","us_sound":"huːm","us_link":"../audio/w/cdo0318uswhom5598.mp3","uk_sound":"huːm","uk_link":"../audio/w/cdo0216whomuk2282.mp3","content":"Add to word list\nAdd to word list\nB2 used instead of \"who\" as the object of a verb or preposition: I met a man with whom I used to work. He took out a photo of his son, whom he adores. There were 500 passengers, of whom 121 drowned. To whom do you wish to speak?\nMore examplesFewer examplesHis strongest criticism is reserved for his father, whom he disliked intensely.They have two grown children, both of whom live abroad.He was very contemptuous of 'popular' writers, whom he described as having no talent.Many of our distant cousins, whom we hadn't seen for years, came to my sister's wedding.She disliked the president, whom she once described as an 'insufferable bore'.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhichever\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nGrammar\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronouns: whomWe use whom in formal styles or in writing to refer to people when the person is the object of the verb. It is much more common in writing than in speaking: …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nRelative pronouns: typical errorsWe can’t use that instead of who, whom or which in non-defining relative clauses: …\nWho, whomWho and whom are wh-words. We use them to ask questions and to introduce relative clauses. …\nWho as a question wordWe use who as an interrogative pronoun to begin questions about people: …\nEmphatic questions with whoever and who on earthWe can ask emphatic questions using whoever or who on earth to express shock or surprise. We stress ever and earth: …\nWho in relative clausesWe use who as a relative pronoun to introduce a relative clause about people: …\nWhomWhom is the object form of who. We use whom to refer to people in formal styles or in writing, when the person is the object of the verb. We don’t use it very often and we use it more commonly in writing than in speaking. …\nwhom pronoun\n(ADDING INFORMATION)\nAdd to word list\nAdd to word list\nused as the object of a verb or after a preposition when referring to a particular person or when adding information about a person just mentioned: The Kenyans have three runners in the race, any of whom could win. He took out a photo of his son, whom he adores.\nwhom pronoun\n(ASKING)\nused esp. in questions as the object of a verb or after a preposition, when asking which person or people, or when asking what someone’s name is: Of whom can it truly be said that they have never been dishonest?"}