{"id":405689,"name":"whose","type":"pronoun","us_sound":"huːz","us_link":"../audio/w/whose.mp3","uk_sound":"huːz","uk_link":"../audio/w/ukwhodu027.mp3","content":"Add to word list\nAdd to word list\nB1 used especially in questions when asking about which person owns or is responsible for something: Whose is this bag? Whose bag is this?\nMore examplesFewer examplesWhose are these shoes.I didn't know whose money it was.Do you know whose car that is?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nGrammar\nQuestions: interrogative pronouns (what, who)We use interrogative pronouns to ask questions. They are: who, which, whom, what and whose. These are also known as wh-words. Questions using these are called wh-questions: …\nInterrogative pronouns: usesWe use who and whom on their own: …\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronoun: whoseWe usually use whose as a relative pronoun to indicate possession by people and animals. In more formal styles we can also use it for things. …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nRelative pronouns: typical errorsWe can’t use that instead of who, whom or which in non-defining relative clauses: …\nWholeWhole is a determiner. We use whole before nouns and after other determiners (my, the, a/an, their) to talk about quantity. We use it to describe the completeness of something: …\nWhoseWhose is a wh-word. We use whose to ask questions and to introduce relative clauses. …\nWhose as a question wordWe use whose to ask a question about possession: …\nWhose in relative clausesWe use whose to introduce a relative clause indicating possession by people, animals and things: …\nB1 used for adding information about a person or thing just mentioned: Cohen, whose short film won awards, was chosen to direct the movie . There was a picture in the paper of a man whose leg had been blown off. They meet in an old house, whose basement has been converted into a chapel. Fraud detectives are investigating the company, three of whose senior executives have already been arrested.\nMore examplesFewer examplesThe scheme is designed to help children whose parents have fallen on hard times.It's an Australian company whose logo features a red kangaroo.It's very difficult to integrate yourself into a society whose culture is so different from your own.There's no profit to be gained from endlessly discussing whose fault it was.You can't sit on the fence any longer - you have decide whose side you're on.\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nthat\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhich\nwhichever\nwhom\nwhomever\nwhosoever\nwot\nSee more results »\nGrammar\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronoun: whoseWe usually use whose as a relative pronoun to indicate possession by people and animals. In more formal styles we can also use it for things. …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nRelative pronouns: typical errorsWe can’t use that instead of who, whom or which in non-defining relative clauses: …\nWholeWhole is a determiner. We use whole before nouns and after other determiners (my, the, a/an, their) to talk about quantity. We use it to describe the completeness of something: …\nWhoseWhose is a wh-word. We use whose to ask questions and to introduce relative clauses. …\nWhose as a question wordWe use whose to ask a question about possession: …\nWhose in relative clausesWe use whose to introduce a relative clause indicating possession by people, animals and things: …\nAdd to word list\nAdd to word list\nused to ask which person owns or is responsible for something, or to say who is responsible for something: Whose bag is this? I don’t care whose fault it is.\nSometimes whose refers to a thing, not a person: That’s the house whose kitchen is painted purple."}