{"id":405830,"name":"widget","type":"noun","us_sound":"ˈwɪdʒ.ɪt","us_link":"../audio/w/cus02279.mp3","uk_sound":"ˈwɪdʒ.ɪt","uk_link":"../audio/w/epd30424.mp3","content":"Add to word list\nAdd to word list\ninformal any small device whose name you have forgotten or do not know Synonyms\nappliance\ncontraption\ndevice (MACHINE)\ngadget\ngizmo informal\nan imagined small product made by a company: Let's assume the company makes ten cents profit on every widget they sell.\na piece of software that is used on a page of a website to give the user changing information of a particular type in a small area of the computer screen: This new widget will bring fresh content to your website every hour.\nSMART Vocabulary: related words and phrases\nObjects - general words\nAmericana\nartefact\nblank\ncolumn\nconversation piece\ncurio\nentity\nephemera\nextrusion\nforensics\ngewgaw\nnon-abstract\nobject\nphenomenon\npiece\nshape\nsnow globe\nsuch and such\ntchotchke\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nComputer programming & software\nAdd to word list\nAdd to word list\nINTERNET, IT a small computer program, usually connected with an image, that can be added to a website to allow the user to do something. For example, you might click on a widget to find out weather or stock market information: The survey showed that more than 300 million widgets were used on the web last month. Widgets let you display Twitter updates on your website or social network page.\nIT one of many small computer programs that make up what you see on a computer screen, and that allow you to take particular actions. A widget might be a button that you click on, or a scroll bar (= strip at the side of the screen used for moving its contents up, down, or sideways), etc.: This short video shows someone trying every widget on the application's interface.\nPRODUCTION an imaginary product, used in explanations, school books, etc. as an example of a company's typical product: What if a hypothetical company, Futuristic, Inc. has a 250% increase in demand for Widget A that it is not prepared to handle. One area of e-commerce that is expected to grow rapidly is online business-to-business auctions which allow, say, widget producers and widget users to make direct deals.\nUK informal a small tool or other useful object that you do not know the name of: The company offers a huge range of widgets for customers who need to mend their gadgets and small appliances. The helmet has a clever widget attached that will record your experience as you cycle down the mountain."}