{"id":405980,"name":"wild","type":"adjective","us_sound":"waɪld","us_link":"../audio/w/wild.mp3","uk_sound":"waɪld","uk_link":"../audio/w/ukwi___023.mp3","content":"wild adjective\n(NOT CONTROLLED)\nAdd to word list\nAdd to word list\nB2 uncontrolled, violent, or extreme: a wild party wild dancing The audience burst into wild applause.go wild When I told him what I'd done, he went wild (= became very angry).wild with The children were wild with excitement (= were extremely excited). Her eyes were wild/She had a wild look in her eyes (= her eyes were wide open, as if frightened or mentally ill). His hair was wild (= long and untidy) and his clothes full of holes. There have been wild (= extreme) variations in the level of spending. They get some wild weather (= many severe storms) in the north. It was a wild (= stormy or very windy) night, with the wind howling and the rain pouring down.\nslang very unusual, often in a way that is attractive or exciting: Those are wild trousers you're wearing, Maddy.\nMore examplesFewer examplesMost parents try to steer a middle course between imposing very strict discipline and letting their kids run wild.Ben took a wild slash at the ball and luckily managed to hit it.The drunk took a wild swing at Harry.When he runs his fingers through my hair, it drives me wild!Peter used to throw really wild parties.\nSMART Vocabulary: related words and phrases\nUncontrolled\nall hell breaks loose idiom\namok\namuck\ncorybantic\ncrazily\nmadding\nmaniacal\nmaniacally\nnon-regulated\nout of hand idiom\nspread like wildfire idiom\nsquirrelly\ntearaway\nunbridled\nuncheckable\nwayward\nwaywardly\nwaywardness\nwig out\nwigged out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nViolent or aggressive\nInformal words for good\nwild adjective\n(NATURAL)\nA2 used to refer to plants or animals that live or grow independently of people, in natural conditions and with natural characteristics: wild grasses a herd of wild horses These herbs grow wild in the area.\nB2 Wild land is not used to grow crops and has few people living in it: a wild, mountainous region\nMore examplesFewer examplesThe field was ablaze with poppies and wild flowers.I had a rather alarming encounter with a wild pig.Most wild animals won't attack unless they are provoked.The zebra is a wild African horse with black and white stripes.The river is fringed with wild flowers.\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-natural\nnon-toxic\norganically\npure\nrawness\nunaffectedly\nunbleached\nunnatural\nunnaturally\nunprocessed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: deserts, prairies & wildernesses\nwild adjective\n(NOT THOUGHT ABOUT)\nwild accusation/guess/rumour\nC2 something that you say that is not based on facts and is probably wrong: He's clearly very paranoid and making wild accusations.\nSee more\nRelated word\nwildnessIdioms\na wild ride\nbe wild about something/someone\nwild horses wouldn't drag me\nin the wild\nin natural conditions, independent of humans: Animals would produce more young in the wild than they do in the zoo. This is the only place these huge lizards are found in the wild. Tragically, only 5,000 of these magnificent animals survive in the wild. In the wild, these creatures range far and wide during breeding season, looking for partners to mate with. He wouldn't last long if forced to fend for himself in the wild. I would so love to see an elephant in the wild. in the wilds (of somewhere)\nin an area that is far from where people usually live and difficult to get to, and that is not considered easy to live in: She lives somewhere in the wilds of Borneo.\nSee more\nSMART Vocabulary: related words and phrases\nNatural and artificial\nanti-natural\nartificial\nartificiality\nartificially\nbiodynamic\ndollishly\nfake\nfalse\nfreshness\nGod-given\nnon-natural\nnon-toxic\norganically\npure\nrawness\nunaffectedly\nunbleached\nunnatural\nunnaturally\nunprocessed\nSee more results »\nwild adjective, adverb [-er/-est only]\n(NATURAL)\nAdd to word list\nAdd to word list\nliving or growing independently of people, in natural conditions, and with natural characteristics: wild turkeys These herbs grow wild.\nwild adjective [-er/-est only]\n(NOT CONTROLLED)\nextreme or violent and not controlled: He led a wild life. When I told him what I’d done, he went wild (= became angry). I’ll make a wild guess (= one not based on careful thought).\nslang Wild also means excellent, special, or unusual: The music they play is just wild.\nYour wildest dreams are your hopes or thoughts about the best things that could happen in your future: Never in my wildest dreams did I think I’d win. Idiom\nwild about something\nwild noun [U]\n(NATURAL)\nplaces that have few towns or roads, are difficult to get to, and lack conveniences: In Kenya we saw elephants and lions in the wild."}