{"id":406062,"name":"will","type":"modal verb","us_sound":"wɪl","us_link":"../audio/w/will.mp3","uk_sound":"wɪl","uk_link":"../audio/w/ukwildl007.mp3","content":"will modal verb\n(FUTURE)\nAdd to word list\nAdd to word list\nA2 (also 'll) used to talk about what is going to happen in the future, especially things that you are certain about or things that are planned: Clare will be five years old next month. The train leaves at 8:58, so we'll be in Scotland by lunchtime. I'll see him tomorrow./I'll be seeing him tomorrow. Will Susie be there? It won't be easy to find another secretary. There'll be trouble when she finds out.\nMore examplesFewer examplesThe doctor will call next week to check on your progress.The choir will be performing the Hallelujah Chorus at the concert.The photos will be ready for collection on Tuesday afternoon.Representatives of the member states will be meeting next week.All our computer equipment will be replaced in the near future.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuture\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nSee more results »\nwill modal verb\n(ABLE/WILLING)\nA1 (also 'll) used to talk about what someone or something is able or willing to do: I'll give you a lift. Ask Gabriela if she'll take them. I've asked her but she won't come. The car won't start. This lasagne will feed six people.\nMore examplesFewer examplesThe photocopier will collate the documents for you.Your father will come for you at 4 o'clock.In the event of a strike, the army will take over responsibility for firefighting.The government will only say it is not in the general interest to reveal any more information.Oh, for crying out loud, why won't you listen to me!\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\npoised\nprepared\nraring\nreadily\nreadiness\nripe\nSee more results »\nwill modal verb\n(REQUEST)\nA2 used to ask someone to do something: Will you give me her address? Will you give that to Tony when you see him, please?\n(also 'll) used as a polite way of inviting someone to do something, or of offering someone something: Will you join us for a cup of coffee, Evie? Will you come in for a while? You'll have some cake, won't you, Charlie?\nMore examplesFewer examplesWill you give me a hand with this box?When you've finished that book will you lend it to me?Will you pass me the salt please?Will you give me a call when you get this message?Will you play that song again please?\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\nwill modal verb\n(IF)\nA2 (also 'll) used in conditional sentences with 'if': If he's late again, I'll be very angry. I'll wait with Christopher if his mother isn't here when you go.\nMore examplesFewer examplesIf you see Alan on your wanderings, will you tell him he's wanted in the office?If we back down on this issue, our reputation will be compromised.If the two sides conflict with each other again, it will be disastrous for party unity.If a plane window breaks the cabin will rapidly decompress.If we continue to deplete the earth's natural resources, we will cause serious damage to the environment.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuture\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nSee more results »\nwill modal verb\n(LIKELY)\n(also 'll) used to refer to what is likely: That'll be Scott at the door. That'll be his mother with him. As you all will know, election day is next week.\nMore examplesFewer examplesYou will have heard about the plans for next week.You will probably have already made plans for the weekend.That'll be Tony on the phone.As you will have guessed by now, David and I are engaged.You will be aware that things haven't been going well.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\nwill modal verb\n(ORDER)\n(also 'll) used when angry to tell someone to do something: Will you stop being such a pain! You'll go upstairs and you'll go straight to bed like your father told you!\nMore examplesFewer examplesYou will do as you are told!Will you shut up!Will you stop doing that and pay attention!You'll finish your dinner if you want any dessert.You'll tidy your room before you go out.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nexpect\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nwill modal verb\n(ALWAYS)\n(also 'll) used when referring to something that always or usually happens: Accidents will happen. Fruit will keep longer in the fridge. The product with the better-known brand name will always sell better. She's 85 now, but she will insist on doing all her own housework.\nMore examplesFewer examplesMy children will always come before my career.I'm afraid physics will always be a closed book to me.People will file lawsuits at the drop of a hat these days.Tight jeans will only emphasize any extra weight that you are carrying.An empty bottle will float.\nSMART Vocabulary: related words and phrases\nAlways & never\nagain\nall along idiom\nall-time\nalong\nalways\naye\never\nfail\nhell\nin all my (born) days idiom\nin/through all the years idiom\ninvariably\nkingdom\nmonth\non demand idiom\nperpetual\nperpetually\ntill/until kingdom come idiom\ntill/until the cows come home idiom\nwhenever\nSee more results »\nGrammar\nBe going to or will?Will is often used in a similar way to be going to. Will is used when we are talking about something with absolute certainty. Be going to is used when we want to emphasise our decision or the evidence in the present: …\nWill and shall: formWill and shall are modal verbs. They are used with the base form of the main verb (They will go; I shall ask her). Shall is only used for future time reference with I and we, and is more formal than will. …\nWill and shall: usesWe use will and shall to make predictions and to state facts about the future: …\nWillWill comes first in the verb phrase in a statement (after the subject and before another verb). It is often contracted to ’ll in informal situations: …\nWill: formWill comes first in the verb phrase in a statement (after the subject and before another verb). It is often contracted to ’ll in informal situations: …\nWill: usesOne of the main uses of will is to refer to things in the future that we think are certain: …\nWill and shallWe use will for all persons, but we often use shall with I and we. Will (’ll) is generally less formal than shall when used with I and we: …\nWill: typical errorWe use will or ’ll to express intentions or decisions, or to make offers, not the present simple: …\nIdiom\nwill do\nwill noun\n(MENTAL POWER)\nB2 [ C or U ] the mental power used to control and direct your thoughts and actions, or a determination to do something, despite any difficulties or opposition: From an early age she had a very strong will. [ + to infinitive ] After six months in hospital she began to lose the will to live (= the desire and determination to stay alive).\nThesaurus: synonyms, antonyms, and examples\nthe ability to keep doing something difficultperseveranceA years-long political scandal broke last week thanks to the dogged perseverance of local reporters.determinationAfter years of hard work and determination, she was finally promoted to CEO.persistenceHe was known for his persistence in the pursuit of justice.stick-to-it-ivenessUS This type of work requires a long-term commitment and a lot of stick-to-it-iveness.single-mindednessHer single-mindedness helped her win six US Open singles titles. doggednessTheir sheer doggedness and ambition helped them ignore criticism and carry on.\nSee more results »\nC1 [ S ] what someone wants to happen: It was God's will. Against their will (= although they did not want to), they were forced to hand over the money. The government has failed to impose its will upon regional communities (= to make them do as it wants). See also\nfree will\nMore examplesFewer examplesA good leader must have a strong will.\"The will of man is by his reason swayed.\"Her will turned out to be stronger than his.He succeeded by sheer strength of will.She was always trying to impose her will on other people.\nSMART Vocabulary: related words and phrases\nStrength of will and determination\naggressiveness\nbitter\nbloody-mindedness\ncharacter-building\ndetermination\nfibre\ninflexibility\ninsusceptible\nintransigence\ninveteracy\nmettle\npushiness\nrecalcitrance\nresiliently\nresolution\nresolve\nsingle-mindedness\ntoughness\nunsusceptible\nwilfulness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGoals and purposes\nwill noun\n(DOCUMENT)\nC2 [ C ] an official statement of what a person has decided should be done with their money and property after their death: Have you made a will yet? She left me some money in her will.\nMore examplesFewer examplesHe was struck out from his father's will.He left me his racehorses in his will.When she remarried, she made a new will.\nSMART Vocabulary: related words and phrases\nInheriting & bequeathing\nadvance directive\nassign\nbeneficiary\nbequeath\nbequest\ncadger\nexecutor\nheir\nheir apparent\nheiress\nheirless\ninherit\ninheritance\npartible\npass something down\npatrimony\npond life\npond scum\ntestament\ntestate\nSee more results »\nIdioms\nat will\nwhere there's a will there's a way\nwith a will\nwill verb\n(MAKE HAPPEN)\n[ + obj + to infinitive ] If you will something to happen, you try to make it happen by the power of your thoughts: She willed herself to remember his name.\n[ I or T ] formal to want something: Stay or go, as you will.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nwill verb\n(LEAVE)\n[ T ] to arrange to give money or property to others after your death\nSMART Vocabulary: related words and phrases\nInheriting & bequeathing\nadvance directive\nassign\nbeneficiary\nbequeath\nbequest\ncadger\nexecutor\nheir\nheir apparent\nheiress\nheirless\ninherit\ninheritance\npartible\npass something down\npatrimony\npond life\npond scum\ntestament\ntestate\nSee more results »\nwill modal verb\n(FUTURE)\nAdd to word list\nAdd to word list\nused only with the base forms of verbs when referring to the future: Claire will be five years old next month. Note: The negative contraction is won’t.\nwill modal verb\n(INTENTION)\npast tense would us/wʊd, wəd/ used to express your intentions: This time I will learn from my mistakes. Note: The negative contraction is won’t.\nwill modal verb\n(REQUEST)\npast tense would us/wʊd, wəd/ used to ask or tell someone to do something: Will you give me her address, please? You will do it because I said so!\npast tense would us/wʊd, wəd/ Will can be used as a polite way of inviting someone to do something, or of offering someone something: Will you come in? Note: The negative contraction is won’t.\nwill modal verb\n(CAN)\npast tense would us/wʊd, wəd/ used to refer to what is possible; to be able to do something: This car will seat six people comfortably. Note: The negative contraction is won’t.\nwill modal verb\n(ACCEPTANCE)\npast tense would us/wʊd, wəd/ used to say that behavior which usually happens is acceptable because it is expected: Boys will be boys. Idioms\nat will\nwill have\nwill noun\n(MENTAL POWER)\n[ C/U ] the mental power used to control and direct your thoughts and actions, or a determination to do something, despite any difficulties or opposition: [ C ] He’ll need an iron will to stick to that diet. [ U ] After six months in the hospital, she lost the will to live (= the desire and determination to stay alive).\n[ C/U ] Someone’s will is also what the person wants to happen: [ U ] I went there against my will.\nwill noun\n(DEATH PLAN)\n[ C ] your official statement of what should be done with your money and property after you die: Your will isn’t valid until you sign it.\nwill verb [T]\n(MENTAL POWER)\nto try to make something happen by using your thoughts: She willed herself to remain optimistic.\nwill verb [T]\n(DEATH PLAN)\nto officially arrange for someone to receive part or all of your money or property after your death: She willed the house to her brother.\nAdd to word list\nAdd to word list\na legal document in which someone states what should be done with their money and property when they die: leave/change/make a will About 75% of adults surveyed have not made a will. His parents died without leaving a will. Compare\nliving will\nto state in a will who should get your money and property when you die: will sth to sb Property willed to her by her grandparents remains in their names until the estates are settled.will sb sth She had willed her new husband all her property."}