{"id":406295,"name":"window","type":"noun","us_sound":"ˈwɪn.doʊ","us_link":"../audio/w/window.mp3","uk_sound":"ˈwɪn.dəʊ","uk_link":"../audio/w/ukwinde007.mp3","content":"window noun\n(GLASS)\nAdd to word list\nAdd to word list\nA1 [ C ] a space usually filled with glass in the wall of a building or in a vehicle, to allow light and air in and to allow people inside the building to see out: Is it all right if I open/close the window? He caught me staring out of the window. I saw a child's face at the window. She has some wonderful plants in the window (= on a surface at the bottom of the window). I was admiring the cathedral's stained-glass windows. Have you paid the window cleaner (= person whose job is to clean the outside of windows)? window frames a window ledge\nolaser/E+/GettyImages\n[ S ] literary something that makes it possible for you to see and learn about a situation or experience that is different from your own: The film provides a window on the immigrant experience.\n[ C ] a transparent rectangle on the front of an envelope, through which you can read the address written on the letter inside\nsubjug/iStock/Getty Images Plus/GettyImages\n[ C ] the decorative arrangement of goods behind the window at the front of a shop, in addition to the window itself: How much is the jacket in the window? The shop windows are wonderful around Christmas time.\nMore examplesFewer examplesWe have a clear view of the ocean from our hotel window.It's a bit cool in here, isn't it? I think I'll close the window.Would you like an aisle seat or would you prefer to be by the window?Car windows are usually made from toughened glass.The explosion shattered nearby windows and wrecked two cars.\nSMART Vocabulary: related words and phrases\nParts of buildings: windows & parts of windows\narchitrave\nbay window\nbi-fold\nbow window\ncasement\nglass something in/over\nglaze\nglazed\nglazing\nlattice window\nmulti-paned\npane\npicture window\nreglaze\nrose window\nskylight\nstorm window\ntransom\ntriple glazing\nwindow ledge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpportunity\nCommunications - the postal system\nwindow noun\n(COMPUTER)\nB1 [ C ] a separate area on a computer screen that shows information and can be moved around: to minimize/maximize a window\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nwindow noun\n(OPPORTUNITY)\n[ C ] a period when there is an opportunity to do something: I'm busy this week but there might be a window on Friday. If a window of opportunity (= an opportunity) should present itself, I'd take advantage of it.\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhave a field day idiom\nhay\nheadroom\niron\nit's now or never idiom\npass\nplatform\nroom for manoeuvre idiom\nscope\nshop window\nsmell blood idiom\nthe American dream\nthe run of something idiom\nSee more results »\nIdiom\ngo out (of) the window\nwindow noun [C]\n(OPENING)\nAdd to word list\nAdd to word list\nan opening in the wall of a building or vehicle, usually covered with glass, to let light and air in and to allow people inside to see out: to open/close a window From her bedroom window she could see a lovely garden.\nIn a store, a window is the large glass-covered front behind which goods for sale are usually shown: We walked along Fifth Avenue, looking in the shop windows.\nA window is also a period when there is an unusual opportunity to do something: If a window of opportunity presents itself, I’d be a fool not to take advantage of it.\nwindow noun [C]\n(COMPUTER)\nan area of a computer screen that shows a particular type of information\nAdd to word list\nAdd to word list\nIT one of the separate areas that can be opened and moved around on a computer screen to use particular programs: The information appeared in a new window. click on/close/open a window maximize/minimize/move a window enlarge/reduce a window Compare\ntab noun\na short period in between other activities when there is an opportunity to do something: I have a window on Thursday morning, so we could meet then. The difficult economic conditions provide a window of opportunity for longterm investors.\nCOMMERCE the large area of glass at the front of a store behind which goods are displayed: Could I try on the dress in the window? Stores don't tend to put anything above a size 8 in their window displays.\nSee also\ndiscount window\ndrive-up window"}