{"id":406420,"name":"wing","type":"noun","us_sound":"wɪŋ","us_link":"../audio/w/wing.mp3","uk_sound":"wɪŋ","uk_link":"../audio/w/ukwinde023.mp3","content":"wing noun [C]\n(FOR FLYING)\nAdd to word list\nAdd to word list\nB1 the flat part of the body that a bird, insect, or bat uses for flying, or one of the flat, horizontal structures that stick out from the side of an aircraft and support it when it is flying: the delicacy of a butterfly's wings I could see the plane's wing out of my window.\nshene/Moment/GettyImages\n[ usually plural ] the wing of a chicken eaten as food: We sat there eating wings and watching a ball game. Wednesday nights at the bar you can get a kilo of hot (= spicy) wings for $5. Cut each chicken wing into 2 pieces at the joint. See also\nbuffalo wings\ngrandriver/E+/GettyImages take wing literary\nIf a bird takes wing, it flies away: As I approached the bird, it took wing.\nto suddenly develop, freely and powerfully: She walked in the hills, letting her thoughts take wing.\nSee more on the wing literary\nA bird that is on the wing is flying: When they are on the wing, you can really see their dramatic markings.\nSee more\nMore examplesFewer examplesThe poor bird couldn't fly because it had a broken wing.With one wing damaged, the model airplane spiralled downwards.A close inspection revealed minute cracks in the aircraft's fuselage and wings.I've nearly finished making my plane - I just have to glue the wings on.The hummingbird beats its wings at great speed.Vending machines provide the only food for guests - including microwave pizzas, sandwiches and barbecued chicken wings.\nSMART Vocabulary: related words and phrases\nAir travel: parts of aeroplanes\naileron\naisle\naltimeter\nautopilot\nbulkhead\nfinny\nfixed-wing\nflaperon\nflight deck\nmulti-engine\nnose\nnose cone\npropeller\nsafety belt\nshell\nskid\nspoiler\nstabilizer\nstarboard\ntail light\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous animal body parts\nCuts of meat\nwing noun [C]\n(POLITICAL GROUP)\nC2 a group within a political party or organization whose beliefs are in some way different from those of the main group: left wing The president is on the left wing of the Democratic party.right wing The extreme right wing of the party has dominated the discussion.\nMore examplesFewer examplesHe criticized what he described as the 'neanderthal tendencies' of the right wing of the party.He's on the right wing of the party.Many people consider Sinn Fein to be the political wing of the IRA.Religious fanatics have formed an unholy alliance with right wing groups.During the last decade the left wing of the party has held the whip hand.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nwing noun [C]\n(PART OF BUILDING)\na part of a large building that sticks out from the main part, often having been added at a later date: The maternity department will be in the new wing of the hospital. The west wing of the house is still lived in by Lord and Lady Carlton, while the rest of the house is open to the public.\nSMART Vocabulary: related words and phrases\nParts of buildings in general\naddition\nannex\nannexe\ndownstairs\nelevation\nextension\nfaçade\nfoundation\nfrontage\nJuliet balcony\nman cave\nmulti-chambered\norgan loft\nsuperstructure\nwing noun [C]\n(PART OF CAR)\nUK (US fender) one of the four parts at the side of a car that go over the wheels: There's a dent in the left wing.wing mirror Look in your wing mirror.\nIoannis Tsotras/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nThe exterior of vehicles\narticulated\ncab\ncoachwork\ncrumple zone\nfifth wheel\nfinny\nfog light\nfootboard\nfrunk\nhigh beams\nL-plate\nnearside\nrear light\nrunner\nsidelight\nsunroof\ntailgate\ntire\ntow bar\nturn signal\nSee more results »\nwing noun [C]\n(SPORTS)\n(in various team games, such as football and hockey) either of the two sides of the sports field, or a player whose position is at either of the two sides of the field: Zinoli passes the ball to Pereira out there on the wing.left/right wing He played left/right wing for Manchester United.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nhalf\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nrink\nsideline\nskatepark\nupright\nSee more results »\nwing noun [C]\n(THEATRE)\nthe wings [ plural ]\nthe sides of a stage that cannot be seen by the people watching the play: in the wings I was in the wings waiting for my cue to come on stage.\nSee more\nIdioms\non a wing and a prayer\ntake someone under your wing\nwing it\nto perform or speak without having prepared what you are going to do or say: I didn't have time to prepare for the talk, so I just had to wing it.\nSee more\nwing noun [C]\n(STRUCTURE FOR FLYING)\nAdd to word list\nAdd to word list\none of the movable, usually long and flat, parts on either side of the body of a bird, insect, or bat that it uses for flying, or one of the long, flat, horizontal structures that stick out on either side of an aircraft: The duck flapped its wings and took off.\nwing noun [C]\n(POLITICAL GROUP)\na group within a political party or organization whose beliefs are in some way different from those of the main group: She’s in the conservative wing of the party.\nwing noun [C]\n(PART OF BUILDING)\na section of a large building that connects to a side of the main part: His office is in the west wing of the White House."}