{"id":406502,"name":"winner","type":"noun","us_sound":"ˈwɪn.ɚ","us_link":"../audio/w/winner.mp3","uk_sound":"ˈwɪn.ər","uk_link":"../audio/w/ukwinde030.mp3","content":"Add to word list\nAdd to word list\nA2 someone who wins a game, competition, or election: There'll be a prize for the winner. The winner of this match will play Aston Villa in the semifinals. And to find out who are the lucky winners of our competition, Samantha is going to draw some names out of the bag. See also\nbreadwinner\ninformal (US also game-winner) in sport, a goal or point that causes a player or team to win a game: Neil Eaves scored the winner in the last minute of the match.\ninformal something that is extremely successful and popular: That lemon tart was a winner, wasn't it?UK I think they're onto a winner with this latest product (= it will succeed).\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that becomes popular, wealthy, or has achieved a lotsuccessThe new TV series was a wild success. a roaring successHer third album was a roaring success and went platinum.hitDinner was a hit with the kids.triumphThe court verdict was a triumph for all abuse victims.winWhat can we do to get a win out of this situation?\nSee more results »\nMore examplesFewer examplesShe announced the winner of the competition to an excited audience.The judges went into a huddle to decide the winner.The overall winner, after ten games, will receive $250 000.Tears ran down her face as she stood on the winner's podium.He read out the names of all the winners.\nSMART Vocabulary: related words and phrases\nWinners & losers\nall-American\nbe a slam dunk idiom\nco-champion\nco-leader\nco-winner\ncup holder\ndark horse\ndead man walking idiom\nelevator club\nleader\nloser\nmatch\nrecord holder\nrunner-up\nslam dunk\nsuperstar\ntitle race\ntitlist\nvictor\nyo-yo club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nGood and excellent things\nAdd to word list\nAdd to word list\ninfml In sports, a winner is also a goal or point that causes a person or a side to win a game: Eaves scored the winner in the final seconds of the game.\ninfml A winner is also something that is extremely successful and popular: That chocolate cake was a winner.\nAdd to word list\nAdd to word list\na person or company that is successful in a particular situation such as a competition, a market, or an election: The winner will receive a digital camera. The clear winners in this ecommerce-friendly budget are small businesses.\nsomething that is very successful and popular: I think we're onto a winner with this product. Analysts at London's smaller banks successfully picked the stock market's winners and losers. Compare\nloserSee also\nbreadwinner"}