{"id":406541,"name":"winter","type":"noun","us_sound":"ˈwɪn.t̬ɚ","us_link":"../audio/w/eus75004.mp3","uk_sound":"ˈwɪn.tər","uk_link":"../audio/w/ukwinni009.mp3","content":"Add to word list\nAdd to word list\nA1 the season between autumn and spring, lasting from November to March north of the equator and from May to September south of the equator, when the weather is coldest: I think you tend to eat more in (the) winter. Last winter we went skiing. It's been a surprisingly mild winter. a winter/winter's day winter weather/snow See also\nwintertime\nMore examplesFewer examplesDelicate plants need to be kept in a greenhouse during the winter.Everywhere looks so grey and depressing in winter.We need to conserve our supplies so we can get through the winter.The road is open now, but it is often blocked by snow in the winter.We tend to get cold winters and warm, dry summers in this part of the country.\nSMART Vocabulary: related words and phrases\nThe seasons\nautumn\nautumnal\nautumnally\nclock\ndead\nestival\nfall\nin the dead of night/winter idiom\nmidsummer\nmonsoon\nseason\nseasonal\nseasonality\nseasonally\nspring\nspring fever\nsummer\nturn the clocks forward phrase\nvernal\nwintertime\nSee more results »\n(especially of a bird) to spend the winter in a particular place: Birds migrate so that they can winter in a warmer country. A lot of older people from northern states winter in Florida or Arizona.\nSMART Vocabulary: related words and phrases\nChanging homes & moving\n(furniture) remover phrase\nanti-immigrant\nanti-immigration\nasylum seeker\ndeinstitutionalize\ndiaspora\ngreener pastures idiom\nimmigrant\nimmigration\nmigrant\nmigrate\nmover\npasture\nrelocate\nrelocation\nremoval\nremovalist\nremover\nsettle\nstake\nSee more results »\nAdd to word list\nAdd to word list\nthe season when the weather is coldest between fall and spring, lasting from November to March north of the equator and from May to September south of the equator: [ C ] last/next/this winter [ U ] My grandparents often vacation in Florida for part of the winter."}