{"id":406610,"name":"wipe","type":"verb","us_sound":"waɪp","us_link":"../audio/w/wipe.mp3","uk_sound":"waɪp","uk_link":"../audio/w/ukwinni012.mp3","content":"Add to word list\nAdd to word list\nB2 to slide something, especially a piece of cloth, over the surface of something else, in order to remove dirt, food, or liquid: Do you have some paper towels that I can wipe the floor with? I'll just get a sponge and wipe the crumbs off the table. Don't wipe your nose on your sleeve! Someone has wiped their dirty hands on my nice clean towel!\nThesaurus: synonyms, antonyms, and examples\nto clean somethingcleanDid you clean the kitchen?washYou need to wash your hands before supper.clean upClean up this mess!clean outI spent the weekend cleaning out the kitchen cabinets.wipeShe wiped the mirrors until they shone.wipe downWe wipe down the tables after every customer leaves.\nSee more results »\nMore examplesFewer examplesDon't wipe your grubby hands on my clean towel!Please wipe your feet before you come into the house.She wiped her floury hands on a cloth.She wiped her eye make-up off with a cotton wool pad.The nurse wiped my fevered brow.\nSMART Vocabulary: related words and phrases\nCleaning generally\nbrush someone/something off\ncleaner\ncleaning\ncleanse\ncleansing\nhoovering\nmop\npick\npick someone/something up\npurification\npurifier\nrinse\nscrub\nsluice something down/out\nspring-cleaning\nsqueegee\nsteam-clean\nsterilization\nsterilizing\nswab\nSee more results »\nIdioms\nwipe something off the map\nwipe the floor with someone\nwipe the slate clean\nwipe the smile off someone's facePhrasal verbs\nwipe something down\nwipe something off something\nwipe something out\nwipe out\nwipe something up\na piece of soft, wet cloth or paper that you use for wiping: baby wipes\nan act of wiping: I'd better give the floor a quick wipe before someone slips on it.\nSMART Vocabulary: related words and phrases\nToiletry & perfumes\naftershave\nagarbatti\nair freshener\nbath bomb\nbath salts\nbinturong\ncarbolic soap\nemery board\nmusk\npowder puff\nsanitary\nshave\nshower gel\nSPF\nswab\ntoilet soap\ntoothpick\ntowelette\nwax melt\nylang-ylang\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEquipment used for cleaning\nCleaning generally\nAdd to word list\nAdd to word list\nto slide something over the surface of something else, in order to remove dirt, food, or liquid: Please wipe your feet before you come into the house. She gently wiped and cleaned her scraped knee. [ M ] Just take the sponge in the sink and wipe the table off. Phrasal verb\nwipe out something\nAdd to word list\nAdd to word list\nif someone or something wipes a computer's, phone's, etc. memory, it removes all the data from the memory: The virus wipes the memory of any computer that downloads the file. Phrasal verbs\nwipe sth off sth\nwipe sth out"}