{"id":406669,"name":"wiretap","type":"verb","us_sound":"ˈwaɪr.tæp","us_link":"../audio/w/eus30033.mp3","uk_sound":"ˈwaɪə.tæp","uk_link":"../audio/w/epd33334.mp3","content":"Add to word list\nAdd to word list\nto secretly listen to people by connecting a listening device to their telephone, or to attach a listening device to a telephone for this purpose: The police chief was accused of illegally wiretapping politicians, government officials, and journalists. We have laws to protect us from people wiretapping our phones.\nMore examplesFewer examplesFederal authorities were secretly wiretapping his phone.The court gave permission to have his phone wiretapped to gather evidence. Three phone lines were also wiretapped, he said.\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\nasset\nindustrial espionage\ninsider\nintel\nintelligence\nMI5\noperative\nscout\nsecret service\nsleuthing\nsnoop\nsnoopy\nspook\nspy\ntail\ntap\nthe CIA\nSee more results »\na device secretly attached to a telephone for listening to people's telephone conversations: The government put a wiretap on his phone. Legally placing a bug or wiretap is a complicated process for federal authorities.\nMore examplesFewer examplesThe FBI applied for authorization to install a wiretap on his business phones.Wiretaps recorded the defendants discussing Client 9 between Feb. 11 and Feb. 14.The raids were conducted after telephone wiretaps picked up conversations in which some of the men expressed a willingness to commit suicide attacks.\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\nasset\nindustrial espionage\ninsider\nintel\nintelligence\nMI5\noperative\nscout\nsecret service\nsleuthing\nsnoop\nsnoopy\nspook\nspy\ntail\ntap\nthe CIA\nSee more results »\nAdd to word list\nAdd to word list\nto secretly listen to people by connecting a listening device to their telephone, or to attach a listening device to a telephone for this purpose: [ T ] The court gave permission to have his phone wiretapped to gather evidence. wiretap noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈwɑɪər·tæp/\nThe government put a wiretap on his phone."}