{"id":406630,"name":"wired","type":"adjective","us_sound":"waɪrd","us_link":"../audio/w/uswillo028.mp3","uk_sound":"waɪəd","uk_link":"../audio/w/cald4uk1678.mp3","content":"wired adjective\n(TECHNOLOGY)\nAdd to word list\nAdd to word list\nconnected to a computer or other device by a wire: All sorts of wired and wireless devices are now Internet-enabled. I had to rely on access to a wired network connection with my laptop, which sometimes involved a long wait. Compare\nwireless adjective\nusing computers and the internet: A wired organization is potentially more open to change. In this digital age, children are born to be wired. We are now raising a wired generation.\nMore examplesFewer examplesA wireless alarm is harder to tamper with and easier to install than a traditional wired model.He had to plug in a wired headset in order to communicate while driving.a wired mouseYou can get schools wired but then they need continuing technical support.In today's wired global economy, the physical location of a company is less important.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\ndata projector\nelectronic organizer\nflat screen\ngamepad\nhard drive\nmainframe\nmicrochip\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nprinter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCords, ropes, cables & string\nInternet terminology\nwired adjective\n(EXCITED)\ninformal, informal (UK also wired up) nervous or excited, for example because of a future event, or because you have drunk coffee or taken drugs: I was totally wired before the interview. I find that eating something can help if I'm too wired on caffeine. Sometimes, for no apparent reason, all the children may become wired up.\nMore examplesFewer examples We are totally wired about working with these new clients.Withdrawal symptoms include extreme anxiety, paranoia, brain fog and feeling wired.He was wired on amphetamines.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nwired adjective\n(CONTAINING WIRE)\ncontaining wire to make it stronger or to give it shape: a wired bra The skirts had wired hems to form a stiff circle.\nMore examplesFewer examplesa reinforced wired windowThe ribbon is lightly wired to keep its shape.\nSMART Vocabulary: related words and phrases\nBecoming and making stronger\naggrandize\nboil up\nbolster\ncement\ncharacter-building\ndeepen\nharden\nhardening\ninvigoration\njell\npower (something) up\nreinforce\nreinforcement\nrestoke\nrestrengthen\nsharpen\nsolidification\nsolidify\nsoup\nsoup something up\nSee more results »"}