{"id":406705,"name":"wisdom","type":"noun","us_sound":"ˈwɪz.dəm","us_link":"../audio/w/wisdom.mp3","uk_sound":"ˈwɪz.dəm","uk_link":"../audio/w/ukwinni020.mp3","content":"Add to word list\nAdd to word list\nB2 the ability to use your knowledge and experience to make good decisions and judgments: I certainly hope to gain a little wisdom as I grow older. He hosts a weekly radio programme in which he dispenses wisdom (= gives his opinions) on a variety of subjects. I tend to doubt the wisdom of separating a child from its family whatever the circumstances. Did we ever stop to question the wisdom of going to war? Before I went off to university my father gave me a few words of wisdom. Conventional/Received/Popular wisdom has it (= most people think) that women are more emotional than men, but in my experience it often isn't the case.\nMore examplesFewer examplesI was rather quiet as I didn't feel I had much wisdom to impart on the subject.I questioned the wisdom of taking so many pills.According to received wisdom, exposure to low level radioactivity is harmless.I feel that I have benefited greatly from her wisdom.What other astonishing nuggets of wisdom do you have for us?\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIntelligence\nIdioms\nin his/her/their wisdom\nwith the wisdom of hindsight\nAdd to word list\nAdd to word list\nthe ability to make good judgments based on what you have learned from your experience, or the knowledge and understanding that gives you this ability\nWisdom also means the quality of being a good judgment: I question the wisdom of separating a child from his brothers and sisters whatever the circumstances."}