{"id":406711,"name":"wise","type":"adjective","us_sound":"waɪz","us_link":"../audio/w/wise.mp3","uk_sound":"waɪz","uk_link":"../audio/w/ukwinni021.mp3","content":"Add to word list\nAdd to word list\nB2 approving having or showing the ability to make good judgments, based on a deep understanding and experience of life: I think you made a wise choice. \"I never drink more than three glasses of wine.\" \"How wise.\" Looking at the weather, I think we made a wise decision not to go to the coast this weekend.wise to I think it would be wiser to wait and see how much money you have left before you make any decisions.older and wiser I never used to save money but now I'm a little older and wiser I can see the point of it. Was it Thomas More who said that the wise man learns from the experience of others?\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nwise to something informal\nunderstanding a dishonest situation or way of doing something: get wise to something People are getting wise to the tricks politicians use in campaign advertisements.\nSee more\nMore examplesFewer examplesThe painting depicts the three wise men kneeling in adoration of the baby Jesus.You'd be wise to take a detour to avoid the roadworks.I didn't think it wise to proffer an opinion.I should have listened to my father's wise counsel, and saved some money instead of spending it all.You'd be wise to keep quiet.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nIdioms\nbe none the wiser\nto be wise after the event\n-wise suffix\n(IN THIS WAY)\nin this way or in this direction: clockwise lengthwise\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nround\nthither\nto\nup\nward\nSee more results »\n-wise suffix\n(RELATING TO)\ninformal relating to a particular thing: What shall we do food-wise - do you fancy going out to eat? Money-wise, of course, I'm much better off than I used to be. What do we need to take with us clothes-wise? We were very lucky weather-wise yesterday.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nas\ncover\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nrelate\nsay\nsomething\nthereof\ntowards\nvis-à-vis\nSee more results »\nAdd to word list\nAdd to word list\nhaving or showing good judgment, or the ability to make good judgments, based on what you have learned from your experience: a wise man/woman [ + to infinitive ] They decided that it was wiser to wait until they were making a little more money before buying a house. wisely adverb us/ˈwɑɪz·li/\nSpend your money wisely. Idiom\nwise to something\nrelating to: Moneywise, of course, I’m much better off than I used to be."}