{"id":406756,"name":"wished","type":"verb","us_sound":"wɪʃ","us_link":"../audio/w/wish.mp3","uk_sound":"wɪʃ","uk_link":"../audio/w/ukwinni025.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nwish\nwish verb\n(FEEL SORRY)\nB1 [ I + (that) ] used with the past simple to express that you feel sorry or sad about a state or situation that exists at the moment: I wish (that) I was/were a bit taller. I wish (that) you were coming with me, Peter.\nB1 [ I + (that) ] used with the past perfect to express that you feel sorry or sad about a particular action in the past: I wish (that) I hadn't eaten so much. I bet she wishes (that) she'd never got involved in the whole mess.\nMore examplesFewer examplesI almost wish I hadn't invited him.I wish I hadn't overindulged so much last night.He wished he was more muscular.He now wishes he'd never tried to fix the toaster himself.I wish I'd never volunteered to do the washing up.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nwish verb\n(WANT)\nB2 [ I or T ] formal to want to do something: As you wish, Sir. It will be done. [ + to infinitive ] I wish to make a complaint. Passengers wishing to take the Kings Cross train should board now. I don't wish to worry you but he did say he'd be back by midnight. [ + obj + adj ] Sometimes I was so depressed that I wished myself dead. I wish (that)...\nused to express anger at someone's behaviour: I wish she'd shut up for a minute and let someone else talk. I wish you'd look at me when I'm trying to talk to you!\nMore examplesFewer examplesI wish you'd stop making cheap jokes about my friends.I wish you'd do something about your bedroom - it's a real mess.I wish they wouldn't fight in front of the kids.I wish I could find the time to do more reading.I do wish you'd stop going off with my car without asking me beforehand.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions of anger\nwish verb\n(HOPE)\nB1 [ T + two objects ] to hope or express hope for another person's success or happiness or pleasure on a particular occasion: We wish you every success in the future. I didn't even see her to wish her a happy birthday/wish a happy birthday to her. I wished her a safe journey and waved her off. wish someone well\nto hope someone will succeed: I wished him well with his new venture.\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHoping and hopefulness\nwish verb\n(MAGIC)\n[ I or T ] to hope that something you want will be made real because of good luck or magical powers: [ + that ] I remember blowing out the candles on my birthday cake and wishing that John Lee would be my boyfriend. If I could wish myself anywhere in the world (= go anywhere as a result of making a wish) right now it would be somewhere hot and sunny. He's funny, bright, handsome - everything a girl could wish for really. \"Your job must be very glamorous.\" \"I wish!\" (= not at all.) \"By the time I'm 40, I'll be rich.\" \"You wish!\" (= There is no chance of that happening.)\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nenchantment\nescapology\nevil\nhex\nmagic word\nmagical\nmagically\nmugwort\nmystic\nthe evil eye idiom\nwand\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWanting things\nwish verb\n(GREET)\n[ T ] Indian English to welcome someone with particular words or a particular action: He wishes me every morning.\nSMART Vocabulary: related words and phrases\nWelcoming, greeting & greetings\nafternoon\nair kiss\naloha\nayup\nbid someone/something adieu\ng'day\ngod\nhello\nhello stranger idiom\nhiya\nhowdy\nlady\nmerry Christmas! idiom\nmind\nmorning\nnamaskar\npleased\npoke\npress the flesh idiom\nwish\nSee more results »\nGrammar\nWishWhen we use wish followed by a verb in the to-infinitive form, wish means the same as want, but it is more formal. We do not normally use wish in the continuous form when we use it with a to-infinitive: …\nWish + to-infinitiveWhen we use wish followed by a verb in the to-infinitive form, wish means the same as want, but it is more formal. We do not normally use wish in the continuous form when we use it with a to-infinitive: …\nWish + indirect object + direct objectWe use wish with two objects, an indirect object + a direct object (underlined), for expressions of good wishes and hopes that good things will happen to people: …\nWish + that-clauseWe use wish with a that-clause when we regret or are sorry that things are not different. We imagine a different past or present: …\nWish + verb forms in the that-clauseThe verb forms we use in that-clauses after wish are similar to the verb forms in conditional clauses after if. We use a past verb form for present and future meanings. …\nWish + wouldWe can use wish + would if we are annoyed about something that is or is not happening, or about something that will or will not happen: …\nIdiom\nI/you wouldn't wish something on anyone/my/your worst enemyPhrasal verb\nwish something away"}