{"id":406959,"name":"without","type":"preposition","us_sound":"wɪˈðaʊt","us_link":"../audio/w/without.mp3","uk_sound":"wɪˈðaʊt","uk_link":"../audio/w/ukwispy024.mp3","content":"Add to word list\nAdd to word list\nA2 not having or doing something, or lacking something: I left without my umbrella. You look nice without make-up. He went without my knowledge. I couldn't have done it without you. She's strong without being bossy. Do start without me.formal He's not without (= he does have some) good qualities. This is without a doubt (= certainly) the best Chinese food I've ever had. You shouldn't drive for more than three hours without taking a break. Without wanting to be rude (= I don't want to be rude, but), don't you think you need a haircut? See also\ndo without (something)\ngo without (something)\nMore examplesFewer examplesA long wool coat is a classic no wardrobe should be without.You can't work continuously for six hours without a break!They had been debating for several hours without reaching a conclusion.I don't know how it's possible for a person to disappear without trace.He never goes out without his security men in attendance .\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\nhole\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\ntaken\nunaccompanied\nSee more results »\nGrammar\nWithoutThe preposition without means ‘not having something’ or ‘lacking something’: …\nAdd to word list\nAdd to word list\nnot having or doing (something), or not having the use or help of (someone or something): He came out without a coat. He looks younger without the moustache. Thanks for your help – I couldn’t have done it without you. You shouldn’t drive for more than three hours without taking a break. That was without (a) doubt/without question (= certainly) the best vacation I’ve ever had. When you have no money, you just have to learn to do without. Idioms\nwithout fail\nwithout further ado"}