{"id":406944,"name":"within","type":"preposition","us_sound":"wɪˈðɪn","us_link":"../audio/w/within.mp3","uk_sound":"wɪˈðɪn","uk_link":"../audio/w/ukwispy023.mp3","content":"Add to word list\nAdd to word list\nB1 inside or not further than an area or period of time: Two thirds of Californians live within 15 miles of the coast. In 1992 cross-border controls within the EU were dismantled. For orders within the UK, please enclose £2.50 for post and packing. The resort lies within easy reach of (= not far from) the ski slopes. We recommend that this wine should be consumed within six months. Within hours of the tragedy happening, an emergency rescue team had been assembled. The tickets should reach you within the week (= before the end of this week). He's very highly regarded within his profession. The target was now within range and so she took aim and fired. He could sense that his goal was within reach (= it could be reached). The cathedral spire was now within sight (= it could be seen). We came within five points of beating them (= we would have beaten them if we had had five more points).\ninside the limits of something, for example the law or a set of rules, and allowed by it: I was acting within the law (= legally). She managed to complete her last film well within budget. I am within my rights to refuse their request.\nMore examplesFewer examplesHe saw her as his main adversary within the company.The electricity company guarantees connection within 24 hours.Saturday staff needed - Inquire within.She's very good at keeping the peace within the family.If we plan carefully, we should be able to stay within our budget.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\nspace\ntime signature\nup\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn & at\nGrammar\nWithinWithin is a preposition. …\nWithin: spaceWithin means ‘inside or not further than a particular area or space’: …\nWithin: timeWe can use within to refer to time: …\nIdiom\nfrom within\nAdd to word list\nAdd to word list\ninside or not beyond (a particular area, limit, or period of time): Most Californians live within 20 miles of the coast. The tickets should reach you within a week. The company has always acted within the law (= legally). Idioms\nwithin an inch of something\nwithin limits\nwithin reason"}