{"id":406887,"name":"withdrawal","type":"noun","us_sound":"wɪðˈdrɑː.əl","us_link":"../audio/w/eus75009.mp3","uk_sound":"wɪðˈdrɔː.əl","uk_link":"../audio/w/ukwispy014.mp3","content":"withdrawal noun\n(TAKING OUT)\nAdd to word list\nAdd to word list\nC2 [ C or U ] when you take money out of a bank account: The bank became suspicious after several large withdrawals were made from his account in a single week.\n[ C or U ] the process or action of a military force moving out of an area: The commander-in-chief was given 36 hours to secure a withdrawal of his troops from the combat zone.\nMore examplesFewer examplesThe UN will dictate the terms of troop withdrawal from the region.The general has ordered a partial withdrawal of troops from the area.Customers will not be charged for withdrawals.The last withdrawal from the account was on 10 August.The minimum withdrawal you can make from the cash machine is ten pounds.\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclear\nclearance\ndebit\ndip into something\ndraw\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nResponding to an attack\nwithdrawal noun\n(NOT AVAILABLE)\nC2 [ U ] the act or process of taking something away so that it is no longer available, or of someone stopping being involved in an activity: Doctors demanded the withdrawal of the drug (from the market) after several cases of dangerous side-effects were reported. Her sudden withdrawal from the championship caused a lot of press speculation about her health.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nscratch\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nSee more results »\nwithdrawal noun\n(NO CONTACT)\n[ U ] behaviour in which someone prefers to be alone and does not want to talk to other people: Withdrawal is a classic symptom of depression.\nSMART Vocabulary: related words and phrases\nShy and modest\naw shucks\nbackward\nbashful\nbashfully\nbashfulness\nhumility\ninadequacy\ninadequate\ninhibited\ninhibition\nmousy\nretiring\nself-conscious\nself-consciously\nself-consciousness\nself-deprecating\nshyness\nunassuming\nwallflower\nwithdrawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot being friendly\nAdd to word list\nAdd to word list\nan act of taking something back, removing something, or moving something back: [ C ] a troop withdrawal [ C ] He had made several large withdrawals from his bank account (= He had taken out a lot of money). [ C ] Her sudden withdrawal from the competition surprised everyone.\nWithdrawal also means the physical and mental effects experienced when a person stops using a drug.\nAdd to word list\nAdd to word list\nBANKING, FINANCE the act of taking money out of an account, or the amount of money taken: The savings account only allows you to make three withdrawals a year. There's a cash withdrawal limit of €500 per day. There are large early withdrawal penalties attached to this mortgage. Compare\ndeposit noun\n[ U ] the act of stopping something from happening or being available: withdrawal of sth The withdrawal of corporate sponsorship had a damaging impact on the company's performance. withdrawal of an offer/support\n[ U ]\n&#160; COMMERCE the process of removing a product from the market, either temporarily or permanently, because there is a problem with it: The company is still struggling to rebuild its image following the withdrawal of its new cancer drug on safety grounds. The cost of the product withdrawal was estimated at over $10 million.\n[ U ] the state of no longer being involved in something: withdrawal from sth The scandal led to her withdrawal from politics.\n[ U ] the act of officially changing something you previously said: withdrawal of an allegation/statement/complaint See also\nin-service withdrawal"}