{"id":406885,"name":"withdraw","type":"verb","us_sound":"wɪðˈdrɑː","us_link":"../audio/w/withdraw.mp3","uk_sound":"wɪðˈdrɔː","uk_link":"../audio/w/ukwispy013.mp3","content":"withdraw verb\n(REMOVE)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to take or move out or back, or to remove: This credit card allows you to withdraw up to £200 a day from ATMs. The UN has withdrawn its troops from the country. Eleven million bottles of water had to be withdrawn from sale due to a health scare. Once in court, he withdrew the statement he'd made to the police (= he claimed it was false). All charges against them were withdrawn after the prosecution's case collapsed.formal After lunch, we withdrew into her office to finish our discussion in private. She had to withdraw from the competition because of a leg injury. Following his nervous breakdown, he withdrew from public life and refused to give any interviews.\nThesaurus: synonyms, antonyms, and examples\nto go backwardsreverseThe road ahead was blocked by a tree so I had to reverse. backI backed into the drive.back upI backed up into an empty parking space.retreatShe retreated hastily back up the stairs.pull backUN peacekeepers have pulled back from the border.withdrawThe British army withdrew from Dunkirk in 1940.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nMore examplesFewer examplesThe Soviet Union became anxious to withdraw its soldiers from the Afghan imbroglio.On Wednesday night the UN issued its toughest ultimatum to date, demanding that all troops withdraw from the city.Trade sanctions will only be lifted when the aggressor nation withdraws its troops.We are committed to withdrawing our troops by the end of the year.To the mortification of the show's organizers, the top performers withdrew at the last minute.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nscratch\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWithdrawing money\nwithdraw verb\n(STOP CONTACT)\n[ I ] to stop talking to other people and start thinking thoughts that are not related to what is happening around you: As a child, she frequently withdrew into her own fantasy world. After the accident, he withdrew into himself and refused to talk to family or friends.\nSMART Vocabulary: related words and phrases\nShy and modest\naw shucks\nbackward\nbashful\nbashfully\nbashfulness\nhumility\ninadequacy\ninadequate\ninhibited\ninhibition\nmousy\nretiring\nself-conscious\nself-consciously\nself-consciousness\nself-deprecating\nshyness\nunassuming\nwallflower\nwithdrawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot being friendly\nAdd to word list\nAdd to word list\nto take something back, or to remove something: [ T ] He asked that his name be withdrawn from nomination for a Golden Globe Award. [ T ] Democrats threatened to withdraw (= stop giving) their support of the tax bill. [ T ] I have to withdraw (= take out) some money from an ATM machine.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; BANKING to take money out of an account: This account allows you to withdraw a maximum daily amount of $500.withdraw cash/funds/savings The economic crisis saw people queuing to withdraw their savings.\n[ T ]\n&#160; COMMERCE to stop selling a product or offering a service, usually because of a problem or fault: The product was withdrawn from the market on safety grounds. The brewery said there was no connection between their decision to withdraw one of their local beers and the dispute with their main competitor.\n[ T ] to remove something that you previously agreed to provide: withdraw funding/support The opposition threatened to withdraw support for the government's pension plans.withdraw an application/bid/offer Morgan Stanley withdrew the job offer.\n[ I ] to stop being involved in a situation, having a particular responsibility, or belonging to an organization: withdraw from (doing) sth Despite the stock market crash, only one corporate investor has withdrawn from the deal.withdraw as sth He withdrew as a candidate for the Democratic presidential nomination.\n[ T ] to tell people officially that something you said earlier is not true or correct: withdraw a remark/claim/statement She was advised to withdraw her statement. The Foreign Office withdrew advice to holidaymakers not to travel to some areas in the Far East. withdraw an accusation/allegation/complaint"}