{"id":406876,"name":"with","type":"preposition","us_sound":"wɪð","us_link":"../audio/w/with.mp3","uk_sound":"wɪð","uk_link":"../audio/w/ukwispy012.mp3","content":"with preposition\n(COMPANY)\nAdd to word list\nAdd to word list\nA1 used to say that people or things are in a place together or are doing something together: I was with Sylvia at the time. He lives with his grandmother. He's impossible to work with. I'm going to France with a couple of friends. Ingrid Bergman starred with Humphrey Bogart in the movie \"Casablanca\". I left my books with Sandra. Ice cream with your apple pie? Mix the butter with the sugar and then add the egg. I'll be with you (= I will give you my attention) in a second. She's staying with her parents (= at their house) for a few months. He's been with the department (= working in it) since 2010.\nMore examplesFewer examplesI can't play chess with him. He's completely out of my class!She's having an affair with a married man.I should like some time to confer with my lawyer.She's running around with Micky and his friends these days.Why don't you take him along with you when you go?\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntogether\ntow\ntwin\ntwo-way\nunison\nSee more results »\nwith preposition\n(METHOD)\nA2 using something: He was shot at close range with a pistol. She wiped her lipstick off with a tissue. Join the two pieces together with glue. Please handle this package with care. They set up a business with the help of a bank loan.\nMore examplesFewer examplesThe wires were fastened together with a plastic clip.The concrete is strengthened with steel rods.Rub the wood down with fine sandpaper till it is smooth.He scooped the sand into a bucket with his hands.Seal the package up with sticky tape.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nwith preposition\n(DESCRIPTION)\nA1 having or including something: a tall woman with dark hair He's married with three children. They were divided into two groups, with no girls in one group and no boys in the other. He spoke with a soft Irish accent. We're an international company with offices in Paris, New York, and Sydney. Two coffees please, one with milk and one without. He arrived in Los Angeles with nothing but the clothes he was wearing. He woke up with a terrible headache. I was second in the race with a time of 14.2 seconds. With a bit of luck, we should be back in time for dinner. Both their children graduated with degrees in economics.\nused at the beginning of various phrases written at the end of a letter: With best wishes from Charles. With love, Roberta.\nincluding: With your contribution, that makes a total of £45.\nMore examplesFewer examplesMany of the TV programmes are broadcast with subtitles for the deaf.He spoke with great depth of feeling.She was diagnosed with diabetes.He's been in bed all week with flu.Suddenly, the building echoed with the sound of gunfire.\nSMART Vocabulary: related words and phrases\nHaving and owning - general words\nacquire\nacquisition\nattach\nattach something to something\nbe endowed with something idiom\nbearer\ncarry\nholder\nlay\nlord/master/mistress/king/queen of all you survey idiom\nmake something (all) your own idiom\nmistress\nnot/never want for anything idiom\nrevert\nrevert to something\nshared ownership\nstake\nstake something out\nsurvey\nthey've\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncluding and containing\nWritten greetings\nwith preposition\n(RELATIONSHIP)\nB2 relating to or in the case of a person or thing: How are things with you? Russia has just drawn up a trade agreement with Norway. This hasn't got anything to do with you (= this is not something you should be interested in). The government's policies have not been popular with (= among) the voters. He's very careless with his money. She talked a lot about her relationship with Charlotte.\nMore examplesFewer examplesRick's more involved with the financial end of things.They've been engaged in a legal battle with the council for several months.The police have found no evidence of a terrorist link with the murder.I'm having problems with my computer.Unions bargain with employers for better rates of pay each year.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nwith preposition\n(CONTAINING/COVERING)\nB1 used to show what is on or in something: She laid the table with the best china. Her blouse was spattered with blood. The room was littered with toys. The trucks were laden with food and medicine. She filled the jug up with cream.\nMore examplesFewer examplesHow much of the earth's surface is covered with water?She spread her toast with a thick layer of butter.I scattered the whole lawn with grass seed.Under her bed, they found a bag stuffed with money.The platform was crammed with people trying to board the train.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nwith preposition\n(CAUSE)\nB2 because of or caused by someone or something: He winced with pain. I was trembling with fear. She's been at home with a bad cold for the past week. I can't work with all that noise going on. Hopes were dashed in the war-torn capital with the news that no aid would be arriving that week. With exams approaching, it's a good idea to review your class notes.(what) with (What) with all the excitement and confusion, I forgot to say goodbye to her.\nMore examplesFewer examplesShe went crimson with embarrassment.Her face crumpled with laughter.The car was forced to retire from the race with a damaged gearbox.Eventually, the metal buckled with the pressure that was being exerted against it.I couldn't catch what the announcer said, with all the other noise going on.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nwith preposition\n(OPPOSITION)\nagainst something: I ended up having an argument with her. She has fought a constant battle with depression throughout her career. The two countries went to war with one another over oil prices. A truck had collided with a car.\nMore examplesFewer examplesStudents clashed with police after demonstrations at five universities.It's difficult for a small supermarket to compete with the big supermarkets.He struggled with his attacker who then ran off.He had a couple of scrapes with the police and ended up in court.We battled with the elements to get the roof fixed.\nSMART Vocabulary: related words and phrases\nOpposing & against\nad hominem\nadversarial\nalienate\nalienated\nantagonistic\nanti-boycott\nantithetical\nconverse\ndiscordant\ninsurgent\nlark\nman the barricades idiom\nnimby\nnimbyism\nnon-confidence\nprotest\nraise\nresistant\nversus\nvirulent\nSee more results »\nwith preposition\n(SEPARATION)\nused with words showing separation: I'd rather not part with my cash. He decided to put his failed marriage behind him and make a clean break with the past.\nMore examplesFewer examplesHis plans represented a break with tradition.He split up with his girlfriend after they had a row in public.Their decision to not call their daughter Jane was a break with family tradition.She was reluctant to part with her favourite jumper.She's just broken up with her boyfriend.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nwith preposition\n(AND)\nand, or followed by: I'd like a steak and fries with apple pie for dessert. $200 is payable immediately with a further $100 payable on delivery.\nMore examplesFewer examplesThere will be a screening of the film with a talk by the director afterwards.They were offered a free meal, with wine.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nwith preposition\n(COMPARISON)\nused in comparisons: I have nothing in common with my brother. This cake's very light compared with the last one you made.\nMore examplesFewer examplesThis road is quite busy compared with ours.The hotel certainly compared favourably with the one we stayed in last year.The family in the television programme could not be credibly compared with a real one.I thought I was badly treated but my experiences pale in comparison with yours.The regeneration of the city's downtown dock front will put it on a par with Nice or Cannes.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\nwith preposition\n(SUPPORT)\nsupporting someone or something: If you want to go for a promotion, I'll be with you all the way. You have to decide where you stand on this issue - you're either with me or against me. Opposite\nagainst\nMore examplesFewer examplesI need to know that you're with me before I stand for election.You're either with us or against us on this issue.Are you with me on this?The opposition were with the government on the decision to go to war.Many backbenchers decided not to vote with the government on this issue.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nwith preposition\n(DIRECTION)\nin the same direction as something: The wind was with me on the home stretch and I ran well. Opposite\nagainst (IN OPPOSITE DIRECTION)\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ninto\nmultidirectional\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nwest\nSee more results »\nwith preposition\n(TIME)\nat the same rate or time as something: This wine will improve with age. Stopping distances for cars vary with the speed they are travelling at.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\nfly\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nSee more results »\nwith preposition\n(UNDERSTANDING)\nbe with someone informal\nto understand what someone is saying: You look puzzled - are you with me?\nSee more\nwith preposition\n(DESPITE)\ndespite something: With all her faults, she's still a really good friend.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nrate\nseeing (that)\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nwith preposition\n(EXPRESSIONS)\nused to express a wish or instruction: Away with you! (= Go away!) Off to bed with you! (= Go to bed!) On with the show! (= Let it continue.) Down with school! (= We don't want/like it.)\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstand\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: expressions telling people to stop doing something\nInstructions and orders\nGrammar\nWith: other usesWith is used with the following words: …\nWithWith is a preposition. …\nWith meaning ‘in the same place as’With means ‘in the same place as someone or something’ or ‘accompanying’: …\nWith: reactions and feelingsWith often follows adjectives which refer to reactions and feelings: …\nWith meaning ‘using’We use with to refer to what we use to do something: …\nWith meaning ‘having’We use with to mean ‘having’ or ‘possessing’: …\nWith meaning ‘because of’We use with to mean ‘because of’ or ‘as a result of’. This is especially common in speaking: …\nIdioms\nwhat's with something?\nwith that\nwith preposition\n(TOGETHER)\nAdd to word list\nAdd to word list\nused of people or things that are together or doing something together: She’s in the kitchen with Dad. He’s an impossible person to work with. I think I’ll have some ice cream with my pie. I’ll be with you (= I will give you my attention) in a moment. She’s been with the magazine (= working for it) for two years.\nwith preposition\n(USING)\nusing (something) or by means of (something): I bought it with my gift certificate. The label on the box says, \"Handle with care.\" He caught the crabs with a large net.\nwith preposition\n(HAVING)\nhaving or possessing (someone or something): I’d like a room with an ocean view. He’s married with three children. The doctor spoke with a German accent. We’re a multinational company with offices in London, Paris, and New York. With a little luck, we should be back in time for dinner. Both their children graduated with degrees in economics.\nWith can also mean including: With your contribution, we have a total of $450.\nwith preposition\n(RELATING TO)\nrelating to or in the case of (a person or thing): How are things with you? That has nothing to do with the subject. Her books are popular with teenage girls. He’s very careless with his money. The trouble with this skirt is that it wrinkles too easily. What’s the matter with her?\nwith preposition\n(CAUSED BY)\nbecause of or caused by (something): He was trembling with fear. She’s at home with a bad cold. His confidence was bolstered with the support of a lot of friends and relatives. With all the excitement and confusion, I forgot to say goodbye to her.\nwith preposition\n(AGAINST)\nagainst (something): The company faces a long battle with the software giant. I always end up arguing with him about politics.\nwith preposition\n(SUPPORTING)\nsupporting (someone or something): If you want to go for a promotion, I’ll be with you all the way. Where do you stand on this issue – are you with us or against us?\nwith preposition\n(DESPITE)\ndespite (something): With all her faults, she’s still one of the best teachers we’ve ever had.\nwith preposition\n(AND)\nand; followed by: I’d like a hamburger and French fries with a small salad. Two hundred dollars is payable immediately, with a further $100 payable on delivery. Idioms\nwith a vengeance\nwith all due respect\nwith all my heart\nwith child\nwith your eyes closed\nwith flying colors\nwith it\nwith open arms\nwith the naked eye"}