{"id":407323,"name":"wonder","type":"verb","us_sound":"ˈwʌn.dɚ","us_link":"../audio/w/wonder.mp3","uk_sound":"ˈwʌn.dər","uk_link":"../audio/w/ukwoman008.mp3","content":"wonder verb\n(QUESTION)\nAdd to word list\nAdd to word list\nB1 [ I ] to ask yourself questions or express a wish to know about something: [ + question word ] Shouldn't you phone home? Your parents will be wondering where you are. He's starting to wonder whether he did the right thing in accepting this job. [ + speech ] Will this turkey be big enough for eight, I wonder? \"Have you decided where you're going next summer?\" \"I've been wondering about (= considering) going to Florida.\"\nB1 used in phrases, at the beginning of a request, to make it more formal and polite: We were wondering if/whether you'd like to have dinner with us some time? [ + question word ] I wonder whether you could pass me the butter? I wonder if you could give me some information about places to visit in the area?\nMore examplesFewer examplesI wonder what the future holds for you and me.She wondered who'd sent her the mysterious email.I was wondering if you'd like to come to the cinema with me this evening?I wonder what it was about her upbringing that made her so insecure.When did he last brush his teeth, she wondered.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreflection\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\nwonder verb\n(SURPRISE)\n[ I ] formal to feel or express great surprise at something: [ + (that) ] I don't wonder (that) she burst into tears after the way you spoke to her.\nSMART Vocabulary: related words and phrases\nSurprised\naback\nagape\naghast\namazed\nappalled\nflabbergasted\nflat-footed\ngobsmacked\ngoggle-eyed\nheadlight\nhorror of horrors idiom\njaw\nnot know what has hit you idiom\nnot know what hit you idiom\nopen-eyed\nopen-mouthed\npalpitation\nstalk\nyou have (got) to be kidding idiom\nyour eyes pop out of your head idiom\nSee more results »\nIdiom\nI shouldn't wonder\n[ U ] a feeling of great surprise and admiration caused by seeing or experiencing something that is strange and new: The sight of the Grand Canyon stretching out before them filled them with wonder. The boys gazed in wonder at the shiny red Ferrari.\n[ C usually plural ] an object that causes a feeling of great surprise and admiration: We spent a week visiting the wonders of Ancient Greek civilization. With all the wonders of modern technology, why has no one come up with a way to make aircraft quieter?\n[ C ] informal an extremely useful or skilful person: Our new babysitter's a wonder - she'll come at very short notice and the kids love her.\nMore examplesFewer examplesSpace travel is one of the wonders of modern science.Running works wonders for the metabolism.In his poems everyday reality is invested with a sense of wonder and delight.After five years with the company she hadn't been promoted - small wonder then that she decided to quit her job.The baby looked with wonder at the Christmas tree.\nSMART Vocabulary: related words and phrases\nFeelings of surprise and amazement\namazement\nastonishment\nbewilderment\nfuture shock\nincredulity\nshock\nstupefaction\nsurprise\nwonderment\nYou can also find related words, phrases, and synonyms in the topics:\nGood and excellent things\nExperts and specialists\nSuccessful (things or people)\nIdioms\nwork/do wonders\nit's a wonder\nlittle/small wonder\nno wonder\nwonders never cease\nwonder verb\n(QUESTION)\nAdd to word list\nAdd to word list\nto think about things in a questioning and sometimes doubting way: [ I ] I often wonder about those kids. [ + question word ] I wonder what he is doing here. [ I ] Don’t you ever wonder if she’s happy?\nwonder noun [C/U]\n(SURPRISE)\na feeling of great surprise and admiration, or someone or something that causes such feelings: [ U ] People simply stared at her in wonder. [ C ] She’s a wonder! [ U ] If you didn’t study, no wonder you failed the test. [ C ] Among the wonders of medicine is anesthetic. Idiom\nit's a wonder"}