{"id":407390,"name":"wood","type":"noun","us_sound":"wʊd","us_link":"../audio/w/wood.mp3","uk_sound":"wʊd","uk_link":"../audio/w/ukwoman020.mp3","content":"wood noun\n(MATERIAL)\nAdd to word list\nAdd to word list\nA2 [ C or U ] a hard substance that forms the branches and trunks of trees and can be used as a building material, for making things, or as a fuel: He gathered some wood to build a fire. She attached a couple of planks of wood to the wall for shelves. Mahogany is a hard wood and pine is a soft wood. The room was heated by a wood-burning stove.\nevpv/iStock/Getty Images Plus/GettyImages\n[ C ] a type of golf club (= long, thin stick) with a rounded wooden end, used for hitting the ball over long distances: He likes to use a number 2 wood to tee off.\nDarryl Brooks/EyeEm/GettyImages\nMore examplesFewer examplesHe was chopping wood in the yard.The house was built of wood but faced with brick.A flute is made of wood or metal in three jointed sections.In cheap furniture, plastic is often used to simulate wood.Screw this piece of wood to the wall.\nSMART Vocabulary: related words and phrases\nTypes of wood\nAmerican elm\nAtlantic white cedar\nbalsa wood\nbark\nbasswood\nblack locust\nboxwood\ncork\nknotty\nlumber\nmatchwood\nMDF\nmulga\noaken\npaulownia\npiny\npitch pine\nponderosa pine\nsoftwood\nthree-ply\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nwood noun\n(GROUP OF TREES)\nA2 [ C ] (also woods [ plural ]) an area of land covered with a thick growth of trees: an oak wood We went for a walk in the woods after lunch. See also\nwoodland\nAleksander/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe wood lies on the southern extremity of the estate.The cottage is situated in the middle of a wood at the end of a narrow potholed lane.From the top of the hill we could see our house and the woods beyond.The police searched the woods for the missing boy.We go for a ramble through the woods every Saturday.\nSMART Vocabulary: related words and phrases\nForestry\nafforestation\nagroforestry\narborist\nbrush\ncut down\ndeforest\ndeforestation\ndisafforest\nlogging\nlumberjack\nold growth\nranger\nreafforest\nslash-and-burn\nthe treeline\nundercut\nunderstorey\nwoodcutter\nwoodsy\nwoody\nSee more results »\nIdioms\nbe out of the woods\nfrom the wood\nnot see the wood for the trees\nmade of wood: Solid wood furniture is sturdy and durable. We sanded and polished the wood floor in the living room. Much of the original 18th-century wood panelling was destroyed in the fire. See also\nwooden (WOOD)\nSMART Vocabulary: related words and phrases\nTypes of wood\nAmerican elm\nAtlantic white cedar\nbalsa wood\nbark\nbasswood\nblack locust\nboxwood\ncork\nknotty\nlumber\nmatchwood\nMDF\nmulga\noaken\npaulownia\npiny\npitch pine\nponderosa pine\nsoftwood\nthree-ply\nSee more results »\nwood noun\n(HARD MATERIAL)\nAdd to word list\nAdd to word list\n[ C/U ] the hard substance that forms the inside part of the branches and trunk of a tree, used to make things or as a fuel: [ C ] He makes tables and other things from different kinds of wood.\nwood noun\n(GROUP OF TREES)\n[ C ] woods: Beyond them lay a dense wood."}