{"id":407540,"name":"woodsy","type":"adjective","us_sound":"ˈwʊd.zi","us_link":"../audio/w/cdo0623uswood4747.mp3","uk_sound":"ˈwʊd.zi","uk_link":"../audio/w/cdo0623ukwood4780.mp3","content":"woodsy adjective\n(GROUP OF TREES)\nAdd to word list\nAdd to word list\nhaving many trees: The college is located on a woodsy campus in upstate New York. Park rangers have warned of bear encounters at the other, woodsier campsite.\ntypical of an area that has many trees: The town planners thought that pavements would ruin the town's woodsy feel. The new development is all designed around a woodsy theme.\nMore examplesFewer examplesEvery morning they go on a 10-mile bike ride through the woodsy recreational area a short distance from their home. She spent the summer at an artist's retreat in a woodsy area of North Wales.Performances take place in the unique woodsy setting of the National Park.This woodsy lodge has very nice rooms overlooking the river.\nSMART Vocabulary: related words and phrases\nForestry\nafforestation\nagroforestry\narborist\nbrush\ncut down\ndeforest\ndeforestation\ndisafforest\njungle\nlogging\nold growth\nranger\nreafforest\nreafforestation\nslash-and-burn\nthe treeline\ntree-lined\nundercut\nunderstorey\nwoodcutter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: the countryside\nwoodsy adjective\n(MATERIAL)\nlike a wood, or making you think of a wood, especially because of the way something smells or tastes: The scented candles gave the cottage a woodsy smell. Rosemary imparts a fresh, woodsy flavour and odour to many dishes.\nMore examplesFewer examplesThe mild, smoky flavour of the cheese complements the woodsy mushrooms.The fennel seeds on the meat added some texture and wonderful woodsy aromas on the grill.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\naromatic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsniff\nstink\nwaft\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlavours & tastes\nCompare\nwoodyRelated word\nwood"}