{"id":407702,"name":"word","type":"noun","us_sound":"wɝːd","us_link":"../audio/w/word.mp3","uk_sound":"wɜːd","uk_link":"../audio/w/ukwoodl025.mp3","content":"word noun\n(LANGUAGE UNIT)\nAdd to word list\nAdd to word list\nA1 [ C ] a single unit of language that has meaning and can be spoken or written: Your essay should be no more than two thousand words long. Some words are more difficult to spell than others. What's the word for bikini in French? It's sometimes difficult to find exactly the right word to express what you want to say. the F-word, C-word, etc.\nused to refer to a word, usually a rude or embarrassing one, by saying only the first letter and not the whole word: You're still not allowed to say the F-word on TV in the US So how's the diet going - or would you rather I didn't mention the d-word? I know Maisie very well and I know that she would never say the C-word. Surely he didn't say the F-word? Am I allowed to mention the E-word and ask when your exams start?\nMore examplesFewer examplesI was fumbling for the right word.You haven't listened to a word I've said!Write the amount in both words and figures.Annotated editions of Shakespeare's plays help readers to understand old words.Cross out any words that are not on the list.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonymous\nbuzzword\ncognate\ncoinage\nhomographic\nhomography\nhomonymic\nhomonymy\nhomophonic\npalindrome\npragmatics\nproductive\nproductively\nreceptive\nreceptively\nSee more results »\nword noun\n(TALKING)\nB2 [ S ] a short discussion or statement: The manager wants a word. Could I have a word (with you) about the sales figures? Could you have a quiet word with Mike (= gently explain to him) about the problem? words [ plural ]\ndisapproving discussion, rather than action: So far there have been more words than action on the matter of childcare provision. exchange words\nIf two or more people exchange words, they talk to each other for a short time: Nurses went busily up and down, sometimes pausing to exchange words. We exchanged a few words as we were coming out of the meeting. There is no evidence the pair even exchanged words on that occasion, let alone knew each other well.\nIf two people or groups exchange words, they have an argument with each other: Words were exchanged and then someone threw a punch. Angry words were exchanged outside the meeting room. He became agitated and exchanged words with the man. Synonym\nhave words have words\nIf two people or groups have words, they have an argument with each other: I think they had words after we left. I don't know if Amber is talking to me - we had words this morning. Synonym\nexchange words have words with someone\nmainly UK to speak angrily to someone because they have done something wrong : Her father would have had words with her about that. At the end of the game I had words with the referee but I immediately apologized afterwards. Synonym\ntell someone off a good word\na statement of approval and support for someone or something: If you see the captain could you put in a good word for me? The critics didn't have a good word to say about the performance. She doesn't have a good word to say about her hometown. No one seemed to have a good word to say for her - even her daughter. Beth had evidently put in a good word for us and we were greeted very warmly when we arrived.\nMore examplesFewer examplesCould I have a word with you in private?Incidentally, I wanted to have a word with you about your expenses claim.Can I have a little word with you?When you've got a minute, I'd like a brief word with you.Could I have a quick word ?\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion\nInformal talking & conversation\nArguing & disagreeing\nChastising & rebuking\nBacking, supporting & defending\nword noun\n(NEWS)\n[ U ] news or a message: Has there been any word from Paul since he went to New York? We got word of their plan from a former colleague. Word of the discovery caused a stir among astronomers.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nword noun\n(PROMISE)\n[ S ] a promise: I said I'd visit him and I will keep my word. You have my word - I won't tell a soul. Synonyms\nassurance (PROMISE)\nbond (PROMISE)\ncommitment\nguarantee\noath (PROMISE)\npledge\npromise (SAY CERTAINLY)\nundertaking (PROMISE) formal\nvow\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncommitment\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nSee more results »\nword noun\n(ORDER)\n[ S ] an order: We're waiting for the word from head office before making a statement. The troops will go into action as soon as their commander gives the word. At a word from their teacher, the children started to put away their books.\nSMART Vocabulary: related words and phrases\nInstructions and orders\nas per instructions idiom\nbrief\nbriefing\ncharge\nclarion call\ncommandment\ncounter-order\ndictate\ndiktat\ndoctor's orders\nfiat\nimperatively\ninterdict\nmarching orders\norder\norders are orders idiom\nunbriefed\nwalkthrough\nwith\nSee more results »\nIdioms\nbreathe/say a word\nby word of mouth\nfrom the word go\ngive your word\nhave a word in someone's ear\nin a word\nin someone's words\nin your own words\nin words of one syllable\na man/woman of his/her word\nMore idioms\n(upon) my word!\nnot get a word in edgeways\nput in a good word for someone\nput the word out\nput words in/into someone's mouth\ntake someone's word for it\ntake the words out of someone's mouth\nword for word\nword gets around\nword has it\n(the) word is\nyour word is your bond\n(the) word is/gets out\nwords fail me\n(a) word to the wise\nto choose the words you use when you are saying or writing something: He worded the reply in such a way that he did not admit making the original error. Synonyms\nformulate\nphrase See also\nreword\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nevery\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nobserve\nphrase\nquoth\nsay\nspoken\nstring\ntalk sense idiom\nthink\nverbalize\nvolunteer\nSee more results »\nRelated word\nworded\nused, especially in African American and hip-hop culture, to say that something is true or that you agree with something : \"I just wanna be left alone to do my thing.\" \"Word.\"\nused, especially in African American and hip-hop culture, to ask if something is really true: \"He got accepted at all three of the schools he applied to.\" \"Word?\" \"Yeah.\"\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nword noun\n(LANGUAGE UNIT)\nAdd to word list\nAdd to word list\n[ C ] a single unit of language that has meaning and can be spoken or written: The word \"environment\" means different things to different people. She spoke so fast I couldn’t understand a word (= anything she said).\nword noun\n(BRIEF STATEMENT)\n[ C usually sing ] a brief discussion or statement: Could I have a word with you? Let me give you a word of advice. Tell us what happened in your own words (= say it in your own way).\nword noun\n(NEWS)\n[ U ] news or a message: We were excited when word of the discovery reached us.\nword noun\n(PROMISE)\n[ U ] a promise: You have my word – I won’t tell a soul. She wouldn't give me her word if she didn't mean to keep it.\nword noun\n(ORDER)\n[ C usually sing ] an order or request: If you want me to leave, just say/give the word. worded adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈwɜrd·əd/\na strongly worded letter Idioms\nbreathe a word\nman of his word\nthe word is\nword for word\nword of mouth\nword verb [T always + adv/prep]\n(LANGUAGE UNIT)\nto choose the words with which to express something: His description was carefully worded to cover various possibilities.\nwords and figures differ\nAdd to word list\nAdd to word list\nBANKING, MONEY\n&#160; (also words and figures do not agree) →\namounts differ\nwords per minute\n→\nwpm"}