{"id":407788,"name":"worker","type":"noun","us_sound":"ˈwɝː.kɚ","us_link":"../audio/w/worker.mp3","uk_sound":"ˈwɜː.kər","uk_link":"../audio/w/ukwordp016.mp3","content":"Add to word list\nAdd to word list\nA2 someone who works in a particular job or in a particular way: factory/social/construction workers a good/tireless/skilled worker\nsomeone who works for a company or organization but does not have a powerful position: Many companies still treat their management staff better than their workers. workers\n[ plural ]\n&#160; politics\n&#160; specialized members of the working class (= a social group that consists of people who own little or no property and who have to work, usually doing physical work, to get money): He preached to anyone who would listen that the workers of the world were being abused by the wealthy.\nSee more\nin bees and some other types of insects, a female that cannot produce young but collects food for the other insects: Some workers gather pollen and nectar. Others make honey and guard the hive.worker bee Worker bees gather both pollen and nectar from flowers to feed to the larvae and other members of the colony. In late July all the female worker wasps - the only ones that sting - are out feeding on nectar and other insects.\nMore examplesFewer examplesI spoke to an aid worker who had recently returned from the field.Jack has been a loyal worker in this company for almost 50 years.Michael is a very careful worker.The postal workers have come out in support of their pay claim.There's not enough interaction between the management and the workers.\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ncutter\ndrudge\nlabour force\nlabour market\nmachinist\nmanpower\nrelay\nrouseabout\nsalaryman\nskeleton staff\nslogger\nthe shop floor\nworkforce\nworkhorse\nworking group\nworking party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmployees & colleagues\nInsect names\nAdd to word list\nAdd to word list\na person who is paid for using effort to do something: clerical/factory/farm workers skilled/unskilled workers\nAdd to word list\nAdd to word list\na person who works for a company or organization: Some of the region's employers have developed shortages of high-tech workers. Employers will require more money if they are to retrain older workers. a skilled/unskilled/semi-skilled worker migrant/seasonal/casual workers a temporary/full-time/part-time worker blue-collar/white-collar/pink-collar workers low-paid/low-skilled/low-wage workers undocumented/illegal/transient workers a factory/construction/farm worker private-sector/public-sector workers a contract/freelance/self-employed worker a key/core workerhire/employ/recruit workers The company knowingly hired illegal workers.lay off/sack/fire workers Across the country, automobile plants are laying off workers.\na person who works in a particular way: a good/hard/lazy worker Employers realize they must compete for good workers. See also\nassembly worker\nco-worker\nguest worker\nhome worker\nknowledge worker\nmanual worker\nmobile worker\nnomadic worker\nportfolio worker\nthe workers\nused to refer to all the people within a company or organization who do ordinary jobs, rather than the managers: Lawyers for the workers say that companies are denying claims that they should have paid. Union officials were called in by the workers when they did not receive annualized payments for overtime."}