{"id":407762,"name":"work","type":"noun","us_sound":"wɝːk","us_link":"../audio/w/work.mp3","uk_sound":"wɜːk","uk_link":"../audio/w/ukwordp005.mp3","content":"work noun\n(ACTIVITY)\nAdd to word list\nAdd to word list\nA1 [ U ] an activity, such as a job, that a person uses physical or mental effort to do, usually for money: do work I've got so much work to do.hard work Carrying heavy loads around all day is hard work.start/finish work What time do you start/finish work? Aileen does most of the work around the house. What sort of work are you experienced in? She tends to wear quite dressy clothes for work. Roger's work involves a lot of travelling.\nA2 [ U ] the material used by someone at work, or what they produce: I'll have to take this work home with me and finish it there. All the furniture is the work of residents here.\nMore examplesFewer examplesIn common with many mothers, she feels torn between her family and her work.You need to have agile fingers to do this kind of work.We had a disagreement over the fee for the work.We've finished decorating upstairs but the downstairs still needs some work.They pay me next to nothing but I really enjoy the work.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nwork noun\n(PLACE)\nA1 [ U ] a place where a person goes specially to do their job: to work Do you have far to travel to work each day?at work Thousands of people are seriously injured at work every year.for work When does she leave for work?\nMore examplesFewer examplesIt's at least an hour's commute to work.I like the convenience of living so near work.She had a crash on the way to work.I've been getting a lot of aggravation at work recently.We back up our computer files at work on a daily basis.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nwork noun\n(CREATION)\nB2 [ C ] something created as a result of effort, especially a painting, book, or piece of music: work by The museum has many works by Picasso as well as other modern painters. the poetic works of Tagore\nMore examplesFewer examplesThis novel is his best work to date.The mature works of Haydn, Mozart, Beethoven and Schubert belong to the Classical period.The museum's collection includes works of art from all around the world.The exhibition juxtaposes Picasso's early drawings with some of his later works.In a coda to the main exhibition are various works which were once attributed to Rembrandt.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe visual arts in general\nwork noun\n(SURGERY)\n[ U ] informal surgery (= a medical operation) that is done to improve someone's appearance: She denies having had any cosmetic surgery, but I think she's definitely had some work done.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nhysterectomy\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nreplacement\nresected\nresection\nrhino\nrhinoplasty\nSee more results »\nwork noun\n(EVERYTHING)\nthe works informal\neverything that you might want or expect to find in a particular situation: The bridegroom was wearing a morning suit, gloves, top hat - the works.\nSee more\nwork noun\n(FACTORY)\nworks [ C ] plural works\nan industrial building, especially one where a lot of people are employed: a steel/iron works\nSee more\nwork noun\n(MACHINE)\nworks [ plural ]\nthe parts of a machine, especially those that move: If you take the back off this clock, you can see its/the works.\nSee more\nwork noun\n(PHYSICS)\n[ U ]\n&#160; physics\n&#160; specialized force multiplied by distance moved\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nGrammar\nWork (noun)Work is an uncountable noun when it means something we do that takes an effort, often as part of a job or for study: …\nWork as an uncountable nounWork is an uncountable noun when it means something we do that takes an effort, often as part of a job or for study: …\nWork as a countable nounWork as a countable noun means something created, especially a book or painting or piece of music or sculpture: …\nIdioms\nall work and no play (makes Jack a dull boy)\nbe at work\nbe in work\nbe out of work\nget/set to work\nhave your work cut out (for you)\nin the works\nwork verb\n(HAVE EFFECT)\nB1 [ I usually + adv/prep ] to be effective or successful: work in practice Her idea for reorganizing the department will never work in practice.work in The tablets will start to work in a few minutes.work for Some people think I'm weird doing meditation, but it works for me and that's all that matters.work well Arguably, the monarchy worked well for many centuries.\nMore examplesFewer examplesThe argument that sanctions should be given more time to work is seductive but fatally flawed.In conclusion, I submit that the proposal will not work without some major changes.The opposition claimed that the government's education policy was not working.My new diet seems to be working. I've lost weight already.These tactics worked well in the last match.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\ntake\nwork a treat idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nwork verb\n(DO JOB)\nA1 [ I or T ] to do a job, especially the job you do to earn money: Where do you work?work at He works at the hospital.work as She worked as a cleaner at the hospital.work for Mike works for a computer company.work in I work in management training.work with Have you any experience of working with children who have learning difficulties? It's not unusual for a junior doctor to work a 70 or sometimes an 80-hour week. See also\nwork to rule (work-to-rule) work out of something\nto have a particular place as your place of work: At that time, our New York staff was working out of a former warehouse in Lower Manhattan.\nSee more\n[ T ] to make a person or animal do a job: work hard The instructors worked us very hard on the survival course. Many of the animals were worked to death.\nMore examplesFewer examplesHe works for a company that makes software.She works three afternoons a week at the library.She has worked as an estate agent among other things.I worked as an artist's model when I was a student.I'm working late this evening.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nwork verb\n(OPERATE)\nA2 [ I or T ] If a machine or device works, it operates, especially correctly and without failure, and if you work it, you make it operate: Our phone isn't working. You need a team of about twelve people to work a furnace this size.work off/on The pump works off/on (= uses) wind power.work by The pump is worked by (= uses to operate) wind power.get something to work I can't get the radio to work.\nMore examplesFewer examplesYou're welcome to it - I can never get it to work properly.Dust particles must have got into the motor, which is why it isn't working properly.How do you work this machine?It's a common-or-garden washing machine with just the basic functions, but it works perfectly well.The machine works according to the principle of electromagnetic conduction.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPerforming a function\nwork verb\n(SUCCEED IN BECOMING)\n[ I or T, + adv/prep ] to succeed gradually in becoming something or cause a person or thing to become something, either by making an effort or by making many small movements: work your way up something He started as a technician and worked his way up through the company to become managing director.work your way through something Eventually she worked her way through (= read) the huge amount of technical papers. Vibration tends to make nuts and screws work themselves loose. The screws had worked loose over time.\nMore examplesFewer examplesSidney ruthlessly worked his way up from the position of junior clerk to chairman of the company.She is now a senior executive having worked her way up through the company.The splinter had worked its way under his skin.It will take all weekend to work through this pile of marking.She plans to work her way to the top.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\nkill\npan\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nwork verb\n(ARRANGE)\n[ T ] informal to arrange for something to happen, especially by not using official methods and/or by being clever: work it I don't know how she worked it, but she retired at 50.work things (out) Can we work things (out) so that there's always someone here to answer the phone during office hours?\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nwork verb\n(SHAPE)\n[ T ] to shape, change, or process a substance: Working iron requires higher temperatures than bronze.work something into something Gently work the butter into the flour until there are no lumps left.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIndustrial processing\nCreating and producing\nIdioms\nwork a treat\nwork like a charm\nwork wonders/miracles\nwork your fingers to the bone\nwork like a dog\nwork till/until you drop\nwork your way around to somethingPhrasal verbs\nwork against/for someone\nwork at something\nwork something off\nwork on something\nwork on someone\nwork something out\nwork out\nwork someone out\nwork (something) out\nwork someone over\nMore phrasal verbs\nwork through something\nwork up something\nwork someone up\nwork (yourself) up to something\nused to refer to work of a particular type: homework paperwork\nused to refer to a skill or activity using a particular type of material: Girls and boys study woodwork and metalwork at this school.\nused to name things made of a particular material: stonework ironwork\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: construction work & workers\nwork verb\n(DO A JOB)\nAdd to word list\nAdd to word list\n[ I/T ] to do a job, esp. a job you do to earn money: [ T ] She works long hours. [ T ] Richie worked the night shift. [ I ] Designers worked with the director. [ I ] Mike works for a computer company. [ I ] Medics were working on him for an hour. [ I ] She worked on the project with Luce. [ I ] Anna works well with others. [ I ] I have to work on Saturday.\nwork verb\n(PERFORM AS INTENDED)\n[ I/T ] to perform as intended or desired, or to cause something to do what it was intended to do: [ I ] The medicine ought to work right away. [ I ] Our plan worked perfectly. [ T ] I don’t know how to work this computer. [ T ] He knows how to work the system (= get what he wants from it).\nwork verb\n(HAVE EFFECT)\n[ I always + adv/prep ] (of a condition or fact) to have an effect, esp. one that either helps or causes difficulties: Time was working against us. Jimmie has a lot working in his favor.\nwork verb\n(MAKE OBJECT)\n[ T ] to shape something with your hands: She carefully works the clay. Idioms\nwork like a dog\nwork the land\nwork your way up\nwork wondersPhrasal verbs\nwork someone/yourself up\nwork out\nwork out\nwork out something\nwork out something\nwork through something\nwork up something\nwork up to something\nwork noun\n(FORCE)\n[ U ]\n&#160; physics force used on an object multiplied by the distance it moves the object, measured in joules\nwork noun\n(PLACE)\n[ U ] the place where a person regularly goes to do his or her job: I had to leave work early. Does it take long to commute to work?\nwork noun\n(OBJECT)\n[ C ] an object produced as a result of effort, esp. something intended to be art: The museum is showing works by 20th-century artists.\nwork noun\n(DO A JOB)\n[ U ] the use of effort to do or make something that has value, and for which you are usually paid: outdoor/office/manual work Steve’s out of work again (= not employed). Idioms\nat work\nin the works\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; HR, WORKPLACE to do a job, especially to earn money: Do you work? He works as a computer technician. My brother works for a large American corporation. How many people work at your company? work full-time/part-time/from home work an eight-hour day/hard/long hours work in a bank/factory/an office\n[ I ] to spend time and effort doing something: We were working on the presentation all night. The two countries worked together on developing the technology. Multinationals will have to work with governments to achieve the best balance between openness and security.\n[ I ] to try hard to achieve or improve something: work at/on sth You need to work on your communication skills. I'm not very confident on the phone, but I'm prepared to work at it.be working towards sth Our firm is working towards being a paperless environment.\n[ I ] to be effective or successful: The plan seemed to work well. The current system isn't working, so we'll need to look at an alternative.\n[ I ]\n&#160; WORKPLACE, IT if a machine or piece of equipment works, it operates as expected: My computer isn't working. I can't get this printer to work.\n[ T ]\n&#160; WORKPLACE, IT\n&#160; informal to operate a machine or piece of equipment: He doesn't even know how to work a photocopier.\n[ T ]\n&#160; COMMERCE to go around a particular area that you are responsible for, especially in a sales job: His sales were better when he was working the London area.\n[ I ] to have a good or bad effect: The terms they're offering don't work for us. His poor command of English worked against him in the interview. Her previous sales experience worked in her favour.\n[ T ] to change the shape of a material to make something else with it: work leather/metal\nwork a mine\nNATURAL RESOURCES to dig for coal, minerals, etc.: These men have been working the mines all their lives.\nwork sb hard\nto make someone use a lot of effort: He works his trainees really hard.\nwork it so (that) informal\nto arrange for something to happen in a way that is useful for you: I'm going to try and work it so I can spend the weekend in New York after the conference.\nwork the land formal\nto prepare the soil to grow crops on it: We're here to thank those who work the land to feed us.\nwork the system\nto know how to deal with a system or organization to get the result you want: People who know how to work the system can significantly reduce their tax bill.\nwork things out\nto deal with a situation successfully, especially when there is a problem: I'll try to work things out with our suppliers.\nwork your way up sth (also work your way up to sth)\nto do a series of jobs at different levels in an organization until you reach a position at the top of the organization: She joined the company as a sales rep but worked her way up to managing director.work your way up the ladder/hierarchy/ranks I'd like to stay here and work my way up the audit career ladder. Phrasal verbs\nwork out\nwork sth out\nwork sth up\nHR the job that someone does, usually to earn money: full-time/part-time work Many pensioners will have to consider part-time work to supplement their retirement plans.find/get/look for work The government's initiative helps the unemployed find work. He's been out of work for six months now. permanent/regular/temporary work paid/unpaid/voluntary work badly paid/well-paid work give up/go back to/return to work\nWORKPLACE a place, such as an office, a factory, etc., where someone goes to do their job: The Managing Director always arrived at work early and stayed late. She claimed her stress was the result of the bank's hostile work environment. be at/go to/leave work What time do you go to work in the morning?\nWORKPLACE the responsibilities that are part of your job: start/finish/stop work I don't finish work until 6.30 pm. I need to take some time off work to look after my son. Analysts refer to various sources of information to help them make investment decisions in their day-to-day work. The government launched an inquiry into the work of the Monetary Policy Committee. do/enjoy/hate your work factory/manual/office work administrative/clerical/secretarial work\nWORKPLACE the tasks that need to be completed: do/produce/take on work The department can't take on any more work until this project is finished. I always end up taking work home at the weekend.\nthe mental or physical effort involved in doing or achieving something: The builders started work on the new offices last week.carry out/put in work The whole team put in a lot of hard work to win the contract. We need to set to work on reviewing our claims system. The finance department has been hard at work on its year-end report. Management still has a lot of work to do to ensure the company's future. The committee's report was a very good piece of work. good/hard work innovative/major/outstanding work\nworks\n[ plural ] UK the activity of building or repairing something: engineering/repair works The road was closed for essential repair works.\nworks\n[ C ]\n&#160; PRODUCTION an industrial building where materials or goods are manufactured: Residents protested about the waste produced by the nearby industrial works. a chemical/gas/steel works the works foreman/manager/supervisor the works close down/open\nhave your work cut out for you informal\nto have something very difficult to do: The government has its work cut out for it trying to reduce the national deficit.\nin the works\nin the process of being planned or discussed: Protesters claim the proposed cuts had been in the works for months. See also\ncasual\ncontingent work\nmake-work\nout of work\npiecework\npublic works\nwelfare to work\nwork in progress"}