{"id":407805,"name":"working","type":"adjective","us_sound":"ˈwɝː.kɪŋ","us_link":"../audio/w/working.mp3","uk_sound":"ˈwɜː.kɪŋ","uk_link":"../audio/w/ukwordp021.mp3","content":"working adjective [before noun]\n(JOB)\nAdd to word list\nAdd to word list\nB1 relating to work: a 37-hour working week Working conditions/practices in the mill have hardly changed over the last 20 years. She has a difficult working relationship with many of her employees.\nhaving work: These tax changes will affect 90 percent of the working population.\nMore examplesFewer examplesThe union wants to see a reduction in working hours.Insistence on better working conditions by the union has resulted in fewer employee absences.The introduction of new working practices has dramatically improved productivity.These figures mean that almost 15 percent of the working population is unemployed.We found it impossible to acclimatize ourselves to the new working conditions.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nworking adjective [before noun]\n(MACHINE)\noperating: It has taken about five years to restore the aircraft to (full) working condition/order.\nThe working parts of a machine are those that move and make it work: It is essential that all working components are well lubricated.\nMore examplesFewer examplesI'm not sure if the machine is in working order.They are restoring the engine to working condition.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nSee more results »\nworking adjective [before noun]\n(USEFUL)\nB2 used to refer to a plan, idea, or knowledge that is not complete but is good enough to be useful: We have a working theory/hypothesis about what caused the crash, which we will test. She's fluent in French and English and has a working knowledge of Spanish.\nThesaurus: synonyms, antonyms, and examples\nusefulusefulThese useful gadgets should find a home in every kitchen.helpfulThey gave us some really helpful advice.valuableHe was able to provide the police with some valuable information.invaluableThe Internet is an invaluable resource for teachers.constructiveIt was a very constructive discussion.\nSee more results »\nSMART Vocabulary: related words and phrases\nEfficient and effective\nbe firing on all cylinders idiom\nbusinesslike\nclockwork\ncome together\ncut through something\ndeveloped\ndispatch\nefficiently\nergonomic\nergonomically\nergonomics\nhigh-functioning\nseamless\nseamlessly\nsmoothly\nsnappily\nsnappy\nwork wonders/miracles idiom\nworkable\nworth your salt idiom\nSee more results »\nworking adjective [not gradable]\n(DOING A JOB)\nAdd to word list\nAdd to word list\nrelating to your job and its surroundings: Employees are unhappy with working conditions.\nA working person is employed: working mothers\nworking adjective [not gradable]\n(PERFORMING AS INTENDED)\nperforming as intended and doing what it is supposed to do: The mechanic finally got the car back in working order.\nIf you have a working knowledge of something, you have enough practical experience to be able to use it or do it: a working knowledge of English\nAdd to word list\nAdd to word list\nused to describe people who work and earn money: Too many working people are piling up debt on high-interest credit cards. When employers ignore health and safety regulations, working men and women are needlessly put at risk. Child care costs can be a significant burden for a working couple with children. working couples/families/mothers\nused to describe someone who does a job that usually is not very well paid and usually does not need a very high level of education: a working man/woman In our celebrity-obsessed culture, the values of the ordinary working man are being ignored.\nrelating to someone's job, or to work in general: Older people encounter much prejudice about their ability to adapt to new working methods. My manager and I have developed a close working relationship. a working environment/culture\nused to describe a plan, idea, or knowledge that is not complete but that is satisfactory for now: The working title of her book is \"Attracting Wealth\". Applicants will need a working knowledge of French and Spanish. a working assumption/hypothesis/definition\nused to describe a machine or the parts of a machine that move and operate it: After three failed prototypes, we finally have a working model.\nMEETINGS used to describe a meal at which you also work or discuss business: a working breakfast/lunch/dinner Over a working lunch the HR team and a local architect studied office refurbishment plans.\nbe in (good) working order\na machine or piece of equipment that is in good working order works safely and effectively: All our vehicles are in good and efficient working order. See also\nhard-working\n[ U ] the activity of doing work: Our method of working involves one-to-one feedback.\nworkings\n[ plural ] the way in which a machine or system works, and the parts and processes involved: You will need to develop a strong understanding of the internal workings of the organization.\nSee also\ncollaborative working\nflexible working"}