{"id":407798,"name":"workhorse","type":"noun","us_sound":"ˈwɝːk.hɔːrs","us_link":"../audio/w/usworka006.mp3","uk_sound":"ˈwɜːk.hɔːs","uk_link":"../audio/w/ukwordp018.mp3","content":"Add to word list\nAdd to word list\na person who does a lot of work, especially of a type that is necessary but not interesting: a willing/reliable workhorse She's a work horse - you have to be on top of things when you work with her.\na machine that operates without failing for long periods, although it might not be very interesting or exciting: The steam engine was the workhorse of the Industrial Revolution. In the convoy were heavy equipment transporters - 48-wheeled Army work horses designed to carry tanks.\na member of a sports team who always does a lot of hard work to help the team: He is the squad's main workhorse. She was the workhorse of the 2012 Games who won more medals than anyone on her team. He is a work horse with a great approach to the game.\n(also work horse) a large horse that is used for doing heavy work, such as pulling a cart (= a vehicle used for carrying goods) or a plough (= a large farming tool with blades that digs the soil in fields so that seeds can be planted): The two horses were workhorses - they could pull a great deal of weight when they pulled logs out of the forest, but they were slow. She grew up around work horses in the Midwest. Compare\ncarthorse\nworking horse\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ncutter\ndrudge\nlabour force\nlabour market\nmachinist\nmanpower\nrelay\nrouseabout\nsalaryman\nskeleton staff\nslogger\nthe shop floor\nworker\nworkforce\nworking group\nworking party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nCompetitors & participants in sports & games\nHorses & similar animals\nAnimal farming - general words\nAdd to word list\nAdd to word list\na machine, piece of equipment, or vehicle that you can trust to work well and that you can use to do a lot of work: The company has begun to look at how its workhorse, the 737, may develop in the future.\ninformal someone who works very hard or who works very long hours"}