{"id":407860,"name":"world","type":"noun","us_sound":"wɝːld","us_link":"../audio/w/world.mp3","uk_sound":"wɜːld","uk_link":"../audio/w/ukworks006.mp3","content":"world noun\n(THE EARTH)\nAdd to word list\nAdd to word list\nA1 [ S ] the earth and all the people, places, and things on it: Different parts of the world have very different climatic conditions. Which bridge has the longest span in the world? News of the disaster shocked the (whole/entire) world. We live in a changing world and people must learn to adapt. She's a world authority on foetal development. a world record/championship\nMore examplesFewer examplesPeople from different cultures have different conceptions of the world.The richer countries of the world should take concerted action to help the poorer countries.I'm flirting with the idea of taking a year off and travelling round the world.He's one of the highest-earning professional golfers in the world.The museum's collection includes works of art from all around the world.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nworld noun\n(GROUP/AREA)\nB1 [ C usually singular ] a group of things such as countries or animals, or an area of human activity or understanding: the Muslim world the modern/industrialized world the animal world stars from the rock music world Unexpected things can happen in the world of subatomic particles.\nMore examplesFewer examplesThis argument may seem arcane to those not closely involved in the world of finance.He was considered as something of a maverick in the publishing world.They are unable to see beyond the narrow world of the theatre.Stars from the world of entertainment turned out to celebrate his 40th year in show business.She was a key figure in the international art world.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTopics & areas of interest\nworld noun\n(PLANET)\n[ C ] a planet or other part of the universe, especially one where life might or does exist: There was a man on the news last night who believes we've been visited by beings from other worlds.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nIdioms\nat one with the world\nbe worlds apart\ndo someone the world of good\nfor all the world\ngo/come down in the world\ngo/come up in the world\nhave the world at your feet\nin a world of your own\nmake a world of difference\nmake the world go around/round\nMore idioms\na man/woman of the world\nmean the world to someone\nnot for the world\nout of this world\nput the world to rights\nthe ways of the world\nwhat, how, why, etc. in the world\nwhat's the world coming to?\nthe world and his wife\nthe world is someone's oyster\na world of difference\nworld noun\n(THE EARTH)\nAdd to word list\nAdd to word list\n[ U ] the planet on which human life has developed, esp. including all people and their ways of life: People from all over the world will be attending the conference. The rapid growth of computers has changed the world.\n[ U ] The world can also mean the whole physical universe: The world contains many solar systems, not just ours.\nworld noun\n(WHOLE AREA)\n[ C ] all of a particular group or type of thing, such as countries or animals, or a whole area of human activity or understanding: the animal/plant world the business world the world of entertainment In the world of politics, the president’s voice is still the most powerful in the nation.\nworld noun\n(LARGE DEGREE)\n[ U ] a large degree; a lot: There’s a world of difference between the two hotels.\nIdioms\nin a world of your own\nin the world\nman of the world\nAdd to word list\nAdd to word list\na particular area of activity: Our world of work is changing rapidly. the world of advertising/the internet the business/corporate world"}