{"id":407934,"name":"worried","type":"adjective","us_sound":"ˈwɝː.id","us_link":"../audio/w/worried.mp3","uk_sound":"ˈwʌr.id","uk_link":"../audio/w/ukworks014.mp3","content":"Add to word list\nAdd to word list\nA2 unhappy because you are thinking about problems or unpleasant things that might happen: She was sitting behind her desk with a worried expression/look on her face. They don't seem particularly worried about the situation. You had me worried (= you made me feel anxious) back there - I thought for a second that you wouldn't be able to stop in time. He was worried sick (= extremely worried) when he heard that there had been an accident.\nThesaurus: synonyms, antonyms, and examples\nafraidafraidShe was afraid of the dark.frightenedDon't be frightened, my dog is quite friendly.scaredAre you scared of spiders?petrifiedHe got to the top of the tree and was absolutely petrified he'd fall.terrifiedI'm terrified of flying.panic-strickenShe was panic-stricken when her little boy disappeared.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nworriedworriedI'm worried that he's not going to graduate.concernedAren't you concerned that she might tell someone?perturbedHe didn't seem unduly perturbed by the news.fretfulShe got a fretful night's sleep after the dreadful news.anxiousAll this waiting is making me anxious.apprehensiveHe's a bit apprehensive about leaving home.\nSee more results »\nMore examplesFewer examplesInvestors were seriously worried when the stock market began to crash.We were flooded with calls from worried parents.I'm worried about David.I've never seen her worried or anxious in any way - she's so laid-back.Despite his public support, privately he was worried.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nwired\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nRelated word\nworriedly\nAdd to word list\nAdd to word list\nanxious because you're thinking about problems or other unpleasant things that are happening or may happen: We were very worried when he did not answer his phone. She had a worried look on her face."}