{"id":407930,"name":"worry","type":"verb","us_sound":"ˈwɝː.i","us_link":"../audio/w/worry.mp3","uk_sound":"ˈwʌr.i","uk_link":"../audio/w/ukworks018.mp3","content":"worry verb\n(PROBLEM)\nAdd to word list\nAdd to word list\nA2 [ I ] to think about problems or unpleasant things that might happen in a way that makes you feel unhappy and frightened: Try not to worry - there's nothing you can do to change the situation.don't worry Don't worry, she'll be all right.worry about It's silly worrying about things which are outside your control. [ + (that) ] She's worried (that) she might not be able to find another job.\nB2 [ T ] to make someone feel unhappy and frightened because of problems or unpleasant things that might happen: You worried your mother by not writing. [ + that ] It worries me that he hasn't phoned yet. The continued lack of rain is starting to worry people.\nMore examplesFewer examplesDon't worry about a thing. I'll take care of it all.My elderly mother worries that she's a burden to me.Sometimes I worry about the future.She'd worried quite needlessly about whether there would be enough food.You needn't worry - I'm not going to mention it to anyone.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nwired\nworried\nworriedly\nworrier\nworrywart\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\nworry verb\n(ANIMAL)\n[ T ] If a dog worries another animal, it chases and frightens it and might also bite it: Any dog caught worrying sheep in these fields will be shot.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nmigrate\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPursuing\nIdioms\ndon't worry your pretty little head\nnot to worryPhrasal verb\nworry at something\nB1 [ C ] a problem that makes you feel unhappy and frightened: health/financial worries Keeping warm in the winter is a major worry for many old people.\nB2 [ C or U ] a feeling of being unhappy and frightened about something: Unemployment, bad health - all sorts of things can be a cause of worry. It was clear that Anna had no worries about her husband's attempts to flirt. Synonyms\nalarm (WORRY)\nconcern (WORRY)\nconsternation\ndistress\npreoccupation\nMore examplesFewer examplesShe was nearly demented with worry when her son didn't come home.I wanted to make amends for the worry I've caused you.Where on earth have you been? We've been frantic with worry.Some people glide effortlessly through life with no real worries.That's my kind of holiday - no phone, no TV and no worries.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nangst\nanti-stress\nanxiety\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult things and people\nno worries\nused to tell someone that a situation is acceptable, even if something has gone wrong: \"Oh, I'm sorry I got your name wrong!\" \"No worries.\"\nSee more\nAdd to word list\nAdd to word list\nto think about problems or unpleasant things that make you anxious, or to make someone feel anxious: [ I ] If you get a monthly train ticket, you won’t have to worry about buying a ticket every day. [ I ] My mother always worries about me when I don’t come home by midnight. [ I ] \"Will you be all right walking home?\" \"Don’t worry – I’ll be fine.\" [ + that clause ] She worried that she might not be able to find another job. [ T ] A lot of things worried him about his roommate. worry noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈwɜr·i, ˈwʌr·i/\n[ C ] Fortunately, right now we don’t have any worries about money."}