{"id":407969,"name":"worship","type":"verb","us_sound":"ˈwɝː.ʃɪp","us_link":"../audio/w/worship.mp3","uk_sound":"ˈwɜː.ʃɪp","uk_link":"../audio/w/ukworks025.mp3","content":"worship verb\n(RELIGION)\nAdd to word list\nAdd to word list\nC1 [ T ] to have or show a strong feeling of respect and admiration for God or a god: On the island the people worshipped different gods.\n[ I ] to go to a religious ceremony: They socialize together and worship in the same mosque. The poll showed that over 40 percent of Americans worship on a weekly basis.\nMore examplesFewer examplesThe churches were built to worship God.We need a place to worship.We only worship one god.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\nglory\ngodliness\ngodly\nPharisee\npiety\npious\npiously\npraise\nworshipper\nSee more results »\nworship verb\n(ADMIRE)\nC1 [ T ] to love, respect, and admire someone or something very much, often without noticing the bad qualities of that person or thing: Her parents worship her. As a child, I worshipped my older brother.\nThesaurus: synonyms, antonyms, and examples\nto admire someone or somethingadmireI've always admired her for her generous spirit.respectI respect her for what she has achieved, but I would have approached it very differently.think highly ofEveryone thinks highly of him.hold someone in high esteemHer colleagues in Washington hold her in very high esteem.hold someone in high regardHe contributed much to the life of York, and was held in high regard there.look up toShe was my older sister and I looked up to her.\nSee more results »\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\ngaga\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nSee more results »\nIdioms\nworship at the shrine/altar of something\nworship the ground someone walks on\nworship noun\n(RELIGION)\nC2 [ U ] the act of worshipping God or a god, often through praying or singing: act of worship Daily acts of worship do not occur in very many schools. Christian/Sikh/Muslim worship For Jews, the synagogue is the centre for community worship and study.place of worship Local people have complained about improperly dressed tourists entering places of worship (= buildings for religious ceremonies or private prayer).\nMore examplesFewer examplesMen have always played an active part in leading worship while women have been confined to more passive roles.They were engaged in an act of worship.Worship is an important part of his daily life.\nSMART Vocabulary: related words and phrases\nWorshipping a god\nadoration\nadore\nchurchgoing\ndeification\ndeify\ndevotional\ndevotionally\ndevout\ndevoutly\ndevoutness\nglory\ngodliness\ngodly\nPharisee\npiety\npious\npiously\npraise\nworshipper\nSee more results »\nworship noun\n(ADMIRATION)\n[ U ] disapproving a lot of love or admiration for a particular thing or person, often when this is considered too much: We're in an era of fitness and health worship.\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\ndotty\nendearment\never-loving\nfall for someone\nfall in love idiom\ngaga\nlurve\nmadly\nmoon\nmoon over someone/something\npash\nshine\nsteal\ntreasure\nSee more results »\nworship noun\n(TITLE)\nHis, Your, etc. Worship UK formal\nused as a title of respect when speaking to or about a mayor or a magistrate: His Worship the Mayor will present the awards.\nSee more\nworship verb\n(PRAY)\nAdd to word list\nAdd to word list\n[ I/T ] -p- | -pp- to pray to God or a god: [ I ] They went on a pilgrimage to India to worship at the holy Buddhist shrines there.\n[ I/T ] -p- | -pp- To worship is also to go regularly to a place for religious ceremonies: [ I ] They work for the same company, socialize together, and worship at the same church.\nworship verb\n(ADMIRE)\n[ T ] to feel a lot of love and admiration for someone or something: As kids, we worshiped our Aunt Martha, who let us sleep late and took us to great places.\nworship noun [U]\n(PRAYER)\nA house/place of worship is a building for religious ceremonies and prayer."}