{"id":407991,"name":"worst","type":"adjective","us_sound":"wɝːst","us_link":"../audio/w/worst.mp3","uk_sound":"wɜːst","uk_link":"../audio/w/ukworks029.mp3","content":"Add to word list\nAdd to word list\nA2 superlative of\nbad : of the lowest quality, or the most unpleasant, difficult, or severe: the worst That was the worst meal I've ever eaten. \"It was the worst moment of my life,\" she admitted.worst enemy He is my worst enemy.\nMore examplesFewer examplesThe newspaper commissioned a series of articles on the worst excesses of the fashion industry.He's his own worst critic .This is one of the worst natural disasters ever to befall the area.The government's economic policies have led us into the worst recession for years.I'm not exaggerating - it was the worst meal I've ever eaten in my life.\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ndownscale\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\nsort\ntawdrily\ntawdriness\ntawdry\nthinness\ntrinket\nwretched\nSee more results »\nIdiom\nbe your own worst enemy\nB1 the most unpleasant or difficult thing, person, or situation: the worst That was the worst I've seen him play in several years.\nMore examplesFewer examplesThis essay's the worst you've ever done. I think you should do it over.The worst of her criticism was reserved for journalists, photographers and others of their ilk.The Northern Line is the worst on the London Underground.The bomb, which killed 15 people, was the worst of a series of terrorist outrages.He's not fully recovered, but he's over the worst .\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhalf\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse\nSee more results »\nIdioms\nat your worst\nat worst\ndo your worst\nfear the worst\nif the worst comes to the worst\nB2 the most badly: worst hit Small businesses have been worst hit by the recession.worst affected Roads in rural areas were worst affected by the snow. The students voted him the school's worst-dressed teacher. worst of all\nB2 used to emphasize what is worst about a situation: We had no food or light, but worst of all, we had no water.\nSee more\nMore examplesFewer examplesThe United Nations is sending humanitarian aid to the areas worst affected by the conflict.Doctors tried to attend to the worst injured soldiers first.A straw poll of local inhabitants concluded that British tourists were the worst dressed and Italians the most stylish.The worst affected areas are without power.\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhalf\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse\nSee more results »\nto defeat someone in a fight or argument: He was worsted in a fight with a bigger boy.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nsew\nslaughter\nstomp on someone/something\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nAdd to word list\nAdd to word list\nof the lowest quality, or the most unpleasant, difficult, or severe; superlative ofbad and badly: That was the worst meal I’ve ever eaten. worst noun [ U ] us\nYour browser doesn't support HTML5 audio\n/wɜrst/\nNone of my brothers were very good in sports, but I was easily the worst. Idiom\nat worst"}