{"id":407957,"name":"worse","type":"adjective","us_sound":"wɝːs","us_link":"../audio/w/worse.mp3","uk_sound":"wɜːs","uk_link":"../audio/w/ukworks022.mp3","content":"Add to word list\nAdd to word list\nA2 comparative of\nbad : more unpleasant, difficult, or severe than before or than something else that is also bad: worse than The conditions they're living in are worse than we thought.get worse If the rain gets any worse we'll have to go back.even worse His manners are even worse than his sister's.much worse The heat is much worse in the daytime. Opposite\nbetter get worse\nB1 to become more ill, or to become a more severe condition: My cold seems to be getting worse.\nSee more\nMore examplesFewer examplesI thought the book's writing was dreadful, and its conception even worse.The (traffic) congestion in the city gets even worse during the summer.If the symptoms get worse, consult your doctor.Company losses were 50 percent worse than in the corresponding period last year.My arguments with the boss got worse and worse, and it all culminated in my deciding to change jobs.\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhalf\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse off\nSee more results »\nIdioms\nmake matters worse\nworse luck\nC1 something that is more unpleasant or difficult: By the third month of the expedition they had endured many hardships, but worse was to follow.see worse \"What about the bride's dress - wasn't it terrible?\" \"I don't know, I've seen worse.\" Opposite\nbetter\nMore examplesFewer examplesThe rain was heavy then, but worse was to come.His speech was a bit boring, but I've heard worse.\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhalf\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse off\nSee more results »\nIdioms\nbe none the worse\nfor the worse\nthe worse for drink\nthe worse for wear\nB1 comparative of\nbadly : He did worse than he was expecting in the exams. He was treated much worse than I was. Opposite\nbetter\nMore examplesFewer examplesI always come off worse when we argue.He played the violin even worse than his sister.He couldn't have done the job worse if he'd tried.I'm not very good at sewing, but she did it even worse than me.\nSMART Vocabulary: related words and phrases\nWorse and worst\naggravating\naggravation\nat your worst idiom\nbe in a different league idiom\ncan't hold a candle to idiom\nhalf\nhold\nleague\nmatch\nnot be a patch on something idiom\nnot be in the same league idiom\nnot half as idiom\nnot in the same league idiom\nnot the same idiom\nstick\nstick someone with something\nto top it all idiom\ntopper\nvillain\nworse off\nSee more results »\nAdd to word list\nAdd to word list\nmore unpleasant, difficult, or severe than before or than something else; comparative ofbad: Annette may be bad at math, but Bill is even worse. If this sore throat gets any worse, I’ll have to see a doctor. worse noun [ U ] us\nYour browser doesn't support HTML5 audio\n/wɜrs/\n\"How was the movie?\" \"I’ve seen worse.\" worsen verb [ I/T ] us\nYour browser doesn't support HTML5 audio\n/ˈwɜr·sən/\n[ I ] The next day his fever went up and his condition worsened. Idiom\nworse off\ncomparative ofbadly: The storm grew worse. Walking only made the cough worse."}