{"id":407998,"name":"worth","type":"adjective","us_sound":"wɝːθ","us_link":"../audio/w/worth.mp3","uk_sound":"wɜːθ","uk_link":"../audio/w/ukworth001.mp3","content":"worth adjective\n(MONEY)\nAdd to word list\nAdd to word list\nB1 having a particular value, especially in money: Our house is worth £200,000. Heroin worth about $5 million was seized.\ninformal having a particular amount of money: She must be worth at least half a million. be worth it\nto be of reasonable or good value for the price: Four days' car hire costs £150, which is well worth it for the freedom it gives you.\nMore examplesFewer examples\"I paid £2,000 for this car.\" \"You've been had, mate. It's not worth more than £1,000.\"Thieves broke the shop window and carried off jewellery worth thousands of pounds.Buying those shares was a very far-sighted move - they must be worth ten times their original value now.Any painting by Van Gogh is worth a fortune.The country exports goods worth $600 million per annum.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nworth adjective\n(IMPORTANCE)\nbe worth something\nB1 to be important or interesting enough to receive a particular action: I think this matter is worth our attention. When you're in Reykjavík, the National Museum is worth a visit.\nMore examplesFewer examplesThis is a movie worth seeing for its effects alone.Only a few people are successful as sports professionals, but it's worth giving it a go.We need to assess whether the project is worth doing.It's a steep climb to the top of the mountain, but the view is worth it.You could ask him if he's willing - it's worth a try.\nbe worth having/doing something\nto be important or useful to have or do: There's nothing worth reading in this newspaper. If you are a young, inexperienced driver, it is worth having comprehensive insurance. It's worth remembering that prices go up in February. worth it\nenjoyable enough or producing enough advantages to make the necessary effort, risk, pain, etc. seem acceptable: It was a long climb to the top of the hill, but it was worth it for the view from the top. Don't tire yourself out, Geri, it's really not worth it. After the plastic surgery I had two black eyes and my face was very swollen. But I knew it would be worth it. Forget him, sweetheart, - he's just not worth it.\nSMART Vocabulary: related words and phrases\nUseful or advantageous\na place in the sun idiom\nadvantageous\nadvantageously\nall-singing\namiss\nasset\nfodder\nfoil\nfruitfully\nfruitfulness\ngainfully\npracticality\npreferential\nproductive\nproductively\nwholesome\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure\nGrammar\nWorth or worthwhile?Worth and worthwhile are adjectives. …\nIdioms\nbe worth your/its weight in gold\nbe worth your while\nfor all you are worth\nfor what it's worth\nif it/a thing is worth doing, it's worth doing well\nmake something/it worth your while\nnot worth the paper something is printed/written on\nwhat's it worth (to you)?\nworth your salt\nworth noun\n(MONEY)\n[ U ] the amount of money that something can be sold for; value: The estimated worth of the plastics and petrochemical industry is about $640 billion. £20, $100, etc. worth of something\nthe amount of something that you could buy for £20, $100, etc.: $4 million worth of souvenirs and gift items have been produced for the event.\nMore examplesFewer examplesHe bought a dollar's worth of stamps.He tried to read books of real worth.She got her money's worth out of that coat.The lorry contained thousands of pounds worth of contraband.I've got £20,000 worth of cover for the contents of my house.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nworth noun\n(IMPORTANCE)\n[ U ] the importance or usefulness of something or someone: He felt as though he had no worth. She has proved her worth on numerous occasions. The study proved that women were paid less than men holding jobs of comparable worth.\nMore examplesFewer examplesHe proved his worth to the team by scoring two goals in the final.He behaved like a person of great worth.His worth to the school was incalculable.The anti-lock brakes proved their worth when the car was nearly involved in an accident.It was hard to assess the worth of his contribution to the discussion.\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nweight\nSee more results »\nworth noun\n(AMOUNT)\na month's, a year's, etc. worth of something\nan amount of something that will last a month, a year, etc. or that takes a month, a year, etc. to do: a month's worth of grocery shopping I've done three hour's worth of work this morning.\nSMART Vocabulary: related words and phrases\nMeasurements of volume: informal\n-ful\narmload\nbasin\nbasketful\nbucketful\neyeful\nfistful\nforkful\nglass\nglassful\njugful\nplate\npocketful\npot\nscoop\nspoonful\ntablespoonful\ntankful\ntbs\ntruckload\nSee more results »\nIdiom\nget your money's worth\nworth noun [U]\n(MONEY)\nAdd to word list\nAdd to word list\nthe amount of money that something can be sold for: The estimated worth of her jewels alone is about $30 million.\nA particular amount of money’s worth of something is the amount of money that it costs: $20 worth of gasoline\nworth noun [U]\n(IMPORTANCE)\nthe importance or usefulness of something or someone: a sense of personal worth Some people are modest to the point of not realizing their true worth.\nworth noun [U]\n(AMOUNT)\nan amount of something that will last a stated period of time or that takes a stated amount of time to do: We got a week’s worth of diapers at the supermarket. When the computer crashed, we lost six month’s worth of work.\nIdioms\nworth it\nworth your while\nworth adjective [not gradable]\n(IMPORTANCE)\nimportant or useful enough to have or do: There are only two things worth reading in this newspaper – the TV listings and the sports page. I don’t think it’s worth talking about any more.\nworth adjective [not gradable]\n(MONEY)\nhaving a value in money of: They’re asking $10,000 for the car, but I don’t think it’s worth that much. It is an expensive restaurant, but for special occasions it’s worth it (= the value of what you get is equal to the money spent).\nIf a person is worth a particular amount of money, the person has that amount or owns things that would cost that amount: She must be worth at least half a million.\nAdd to word list\nAdd to word list\nhaving a particular value: The shares are worth 262p. Tax cuts worth $10 billion should give businesses a boost.\nowning a particular amount of money: As owner of almost 25% of the company, she's worth an estimated $10 billion.\nbe worth it\nto be of reasonable or good value for the price: He says the $349 cost was well worth it.\nenjoyable enough or producing enough advantages to make the necessary effort, risk, etc. seem acceptable: We believe the extra time and attention to detail is worth it. It's been hard work but worth it.\nbe worth doing\nuseful, important, or good enough to be a suitable reward for the money or time spent or the effort made: Many income funds are worth considering since the total return is often better than from a growth fund. It is worth keeping an eye on rates over the coming weeks.\nbe worth sth\nto be important or interesting enough to be a reason for doing something: worth a look/try This investment could be risky but it's worth a try.\nthe value of something: They were forced to sell their shares for one-tenth of their worth.\nthe amount of something that you can buy with a particular amount of money: $10/€50/£300, etc. worth of sth She bought $200 worth of clothes. See also\ncomparable worth\nnet worth"}