{"id":408039,"name":"would","type":"modal verb","us_sound":"wʊd","us_link":"../audio/w/wood.mp3","uk_sound":"wʊd","uk_link":"../audio/w/ukwoman020.mp3","content":"would modal verb\n(FUTURE)\nAdd to word list\nAdd to word list\nB1 (also 'd) used to refer to future time from the point of view of the past: He said he would see his brother tomorrow. They knew there would be trouble unless the report was finished by the next day. We realized it wouldn't be easy to find another secretary. would have\nused to refer back to a time in the past from a point of view in the future: We thought they would have got home by five o'clock, but there was no reply when we phoned.\nMore examplesFewer examplesSuch a policy would not be constitutional.What time would it be convenient for me to come round?Changing the course of the river would cause serious environmental damage to the whole valley.I was curious to know what would happen next.The chief's son would inherit all his dominions.\nwould modal verb\n(INTENTION)\n(also 'd) used to refer to an intention from the point of view of the past: He said he would always love her . They promised that they would help. There was nobody left who would (= was willing to) do it. I asked him to move his car but he said he wouldn't (= he refused).\nMore examplesFewer examplesThe president continued by saying that his country was a free country and would always remain so.I would like to express my thanks for your kindness.She promised faithfully that she would never leave him.My dad said he would help with the costs of buying a house.We would like to announce the appointment of Julia Lewis as head of sales.\nwould modal verb\n(POSSIBILITY)\nB1 (also 'd) used to refer to a situation that you can imagine happening: I would hate to miss the show. I'd go myself but I'm too busy. It would have been very boring to sit through the whole speech.\nB1 (also 'd) used with if in conditional sentences (= sentences that refer to what happens if something else happens): What would you do if you lost your job? If I'd had time, I would have gone to see Graham.\nMore examplesFewer examplesIf she ever left him he would be heartbroken.My mother would worry herself to death if she knew what I was doing.A nuclear holocaust would leave few survivors.If you were offered an overseas posting, would you take it?If he forgot to pay his rent, his landlady would send him a reminder.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsolidly\nsquarely\nwatertight\nyou can bet your life idiom\nSee more results »\nwould modal verb\n(REQUEST)\nA1 (also 'd) used in polite requests and offers: Would you mind sharing a room? Would you like me to come with you? Would you like some cake?\nMore examplesFewer examplesWould you like to borrow this book?May I conduct you to your table, sir, or would you prefer to have a drink at the bar first?Would you like an aisle seat or would you prefer to be by the window?Is that enough potato, or would you like some more?Someone's at the door - would you answer it please?\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\ncould\nmagic word\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon\npardon (me) idiom\nproblem\nsay\nwelcome\nwonder\nyou're welcome idiom\nSee more results »\nwould modal verb\n(WILLINGNESS)\nB1 past simple of\nwill : used to talk about what someone was willing to do or what something was able to do: The car wouldn't start this morning.\nMore examplesFewer examplesThis new computer system would save us a lot of time when doing the accounts.Such a policy would enhance the company's profile abroad.Thick carpet would reduce the echo in this hallway.She would let you use her computer if you asked.I wouldn't get involved if I were you.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\npoised\nprepared\nraring\nreadily\nreadiness\nshape\nSee more results »\nwould modal verb\n(FREQUENCY)\nB2 (also 'd) used to talk about things in the past that happened often or always: He would always turn and wave at the end of the street.\ndisapproving (also 'd) used to suggest that what happens is expected because it is typical, especially of a person's behaviour: \"Madeleine called to say she's too busy to come.\" \"She would - she always has an excuse.\"\nMore examplesFewer examplesHe would always begin his lectures with a joke.They would often go for a drink together on Wednesdays.He would always smoke a cigar after dinner.She would often forget where she'd put her glasses.He would say that! He's always got a reason for being late.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregular\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nstatedly\nunsynchronized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypifying, illustrating and exemplifying\nwould modal verb\n(OPINION)\nC1 (also 'd) used to express an opinion in a polite way without being forceful: I would think we need to speak to the headteacher about this first. It's not what we would have expected from a professional service.\nMore examplesFewer examplesI would class her among/with the top ten American novelists.I would suggest that you were not adequately prepared for the interview.We would describe the standard of the food as poor.I'd have hoped for a better choice of wine to go with the meal.She'd describe her reaction to the film as one of disappointment.\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nwould modal verb\n(ADVISE)\n(also 'd) used after \"I\" when giving advice: I wouldn't (= I advise you not to) worry about it, if I were you.\nMore examplesFewer examplesIf you're unsure of your legal rights, I would check with a lawyer.I wouldn't set off at five o'clock. You'll get caught in the rush hour traffic.I would add more salt to that.I would wear something more formal, if I were you.I wouldn't touch that, it's hot.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nadviser\nagony uncle\nbrain trust\nclinic\nconsultant\nconsulting\ncounselling\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\nsteer\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nwould modal verb\n(REASON)\n(also 'd) used after \"why\" when giving or asking the reason for something: Why would anyone want to eat something so horrible?\nMore examplesFewer examplesHe came to see you. Why else would he come?Why would he run away from the scene of the crime if he wasn't guilty?Why would you drive, when you could take the train?Why would anyone do such a thing?They must have split up. Why else would he be moving out?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhat/where/how/why the devil idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nwould modal verb\n(PROBABILITY)\n(also 'd) used to refer to what is very likely: \"The guy on the phone had a Southern accent.\" \"That would be Tom.\"\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\ntip\nSee more results »\nGrammar\nShould and wouldWe use should as a more formal alternative to would with I and we in conditional clauses. …\nWouldWould comes first in the verb phrase (after the subject and before another verb): …\nWould: formWould comes first in the verb phrase (after the subject and before another verb): …\nWould: usesWe often use would to make requests. It is a more polite and indirect form of will. …\nWould or will?We can use would as a more formal or polite alternative to will in requests. We often use the phrase would you mind + -ing in polite requests. …\nWould likeWe use would like or ’d like to say politely what we want, especially when making offers and requests: …\nUsed toWe use used to when we refer to things in the past which are no longer true. It can refer to repeated actions or to a state or situation: …\nUsed to: meaning and formWe use used to when we refer to things in the past which are no longer true. It can refer to repeated actions or to a state or situation: …\nUsed to or would?We can use used to or would to talk about people’s habits in the past. When we use them both together, used to most commonly comes first, as it sets the scene for the actions being reported: …\nUsed to or be used to?Used to refers to actions and situations in the past which no longer happen or are no longer true. It always refers to the past: …\nwould modal verb\n(FUTURE)\nAdd to word list\nAdd to word list\nused to refer to future time after a verb in the past tense: He said he would see his brother tomorrow. They hoped they would go to France for their next vacation.\nwould modal verb\n(INTENTION)\nused to express an intention or plan after a verb in a past tense: He said he would love her forever. They promised that tomorrow they would help.\nwould modal verb\n(REQUEST)\nused as a form of will in requests and offers: \"Would you like some cake?\" \"Yes, I would.\" Would you pick up a newspaper on your way home?\nwould modal verb\n(POSSIBLE)\nused to refer to a possibility or likelihood: I would hate to miss the show.\nWould is used with if in sentences that show what will happen if something else happens: What would you do if you lost your job?\nwould modal verb\n(ALWAYS)\nused to suggest that in the past something happened often or always: In summer my dad would sit on the back porch after supper and read the newspaper.\nwould\n(WILL)\npast simple of will : The car wouldn’t start this morning."}