{"id":408114,"name":"wrangler","type":"noun","us_sound":"ˈræŋ.ɡlɚ","us_link":"../audio/w/cdo0318uswran5656.mp3","uk_sound":"ˈræŋ.ɡlər","uk_link":"../audio/w/epd30756.mp3","content":"wrangler noun [C]\n(CARES FOR ANIMALS)\nAdd to word list\nAdd to word list\nmainly US someone who controls and looks after animals, especially horses or cows on a ranch (= a large farm in North or South America): I'm working as a horse wrangler - I've been riding all my life. The kids can watch actual wranglers at work at a ranch just south of the campground. He worked as a tourist guide and crocodile wrangler.\nMore examplesFewer examplesTo help deal with the problem of the wild horses, wranglers will be rounding up more than 10,000 in the area this year.He talked about the dangers of his work as a snake wrangler.The buffalo, with constant urging from the wranglers, made steady progress toward the corrals.\nSMART Vocabulary: related words and phrases\nPeople who work with animals\napiarist\nbeekeeper\nbreeder\nbuckaroo\ncowboy\ncowman\ndogcatcher\ndrover\ngaucho\ngoatherd\nherdsman\njackaroo\njillaroo\nmahout\nostler\nshepherd\nshepherdess\nstable boy\nwhisperer\nSee more results »\nwrangler noun [C]\n(CONTROLS STH)\na person who deals with or controls something or someone, often when this is difficult: She's now his co-producer and general wrangler on the film set. His key skill is as an information wrangler.\nMore examplesFewer examplesWorking with so many babies on the movie, she said she felt more like a child wrangler than an actress.A whip in parliament is a kind of vote wrangler.A bike wrangler collects and returns bicycles that have been taken outside the boundary of the park.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nSee more results »\nwrangler noun [C]\n(STUDENT)\nat the University of Cambridge, a student of mathematics who has passed their final examinations with first class honours (= the highest possible level): He had a distinguished undergraduate career, being a Wrangler in Part II of the Mathematical Tripos. The student attaining the highest marks was called the senior wrangler.\nMore examplesFewer examplesIn 1890, Sylvia Fawcett obtained the top score in the Cambridge Mathematical Tripos, but was not given the title of senior wrangler, as at that time only men were eligible. Watson, second wrangler of 1759, later delivered lectures upon chemistry.\nSMART Vocabulary: related words and phrases\nMarks & results\n2:1\n2:2\nB, b\nC, c\nclass\ncontinuous assessment\nformatively\nGPA\ngrade boundary\ngrade-point average\nhonor student\npass\npass rate\npassing grade\npositive\npositivity\nsecond class\nstraight As\nstraight-A\nthird\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStudents & pupils\nRelated word\nwrangle"}