{"id":408112,"name":"wrangle","type":"noun","us_sound":"ˈræŋ.ɡəl","us_link":"../audio/w/wrangle.mp3","uk_sound":"ˈræŋ.ɡəl","uk_link":"../audio/w/ukworth021.mp3","content":"Add to word list\nAdd to word list\nan argument, especially one that continues for a long time: a lengthy wrangle about/over costs The joint venture ended in a legal wrangle between the two companies. I had a wrangle with a web designer who had ignored pretty much everything I told him. Synonym\nrun-in (ARGUMENT) informal\nMore examplesFewer examplesThe wrangle was finally resolved amicably.A mother from Cleveland is at the centre of a court wrangle over her child.The armed forces have been engaged in a bitter wrangle with the authorities over pay.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndisagreement\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\nspat\nsquabble\nSee more results »\nwrangle verb\n(ARGUE)\n[ I ] to argue with someone about something, especially for a long time: They had been wrangling with the authorities about parking spaces. The two companies are still wrangling over the details of their proposed collaboration.\nMore examplesFewer examplesGovernment, environmentalists, and utilities wrangle over how to cut pollution from the nation's power plants.They wrangled about whether companies should be required to treat stock options as a business cost.\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nalienation\nargue with someone\nargumentatively\nbandy\nbet\nbone\nconflict\ncross swords idiom\nhammer\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nwrangle verb\n(DEAL WITH)\n[ T ] mainly US to take care of, control, or move animals, especially large animals such as cows or horses: The young rancher goes wrangling cattle to earn some money. He sold most of his belongings and drove to Wyoming to wrangle horses at a ranch.\n[ T + adv/prep ] to move a person or thing somewhere, usually with difficulty or using force: She wrangled the children into their seats in the back of the car. They were arrested and wrangled into the police car.\n[ I or T ] informal to take care of or deal with someone or something, usually when this is difficult: I was raised in a house where my father worked long hours, and my mother stayed home, wrangling kids, cooking, cleaning, washing clothes. She has to wrangle classes of over 30 students. He was wrangling with the issue of whether to sign the contract or not.\nMore examplesFewer examplesThe men acted as porters and wrangled the heavily-packed llamas.I dreaded the thought of having to wrangle two huge suitcases on my own.He starts his new job soon and won't be around to help wrangle the kids.She continues to pursue interesting projects whilst wrangling two small children.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nsheep shearing\nsheepdog\nshepherd\nslaughter\nstable\nsubtherapeutic\nteaser\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPushing and shoving\nControlling and being in charge\nwrangle verb\n(GET)\n[ T ] to succeed in getting something by persuading someone or by being clever in some way: Breaking with usual hospital practice, he wrangled permission to follow his patients into the operating theatre. She managed to wrangle an invitation to the White House concert. Synonym\nwangle\nMore examplesFewer examplesIt looks as though the company has wrangled a good deal with the banks.Somehow they managed to wrangle funds for the trip.It was remarkable that some of the least powerful countries on earth managed to wrangle any concessions at all out of the Americans at the World Trade Organization negotiations.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nRelated word\nwrangling\nAdd to word list\nAdd to word list\nto argue, often in a noisy or angry way: We have been wrangling with the management for weeks over parking spaces for employees."}