{"id":408124,"name":"wrap","type":"verb","us_sound":"ræp","us_link":"../audio/w/rap.mp3","uk_sound":"ræp","uk_link":"../audio/w/ukramsh028.mp3","content":"Add to word list\nAdd to word list\nB1 to cover or surround something with paper, cloth, or other material: She wrapped the present and tied it with ribbon. Wrap the chicken in foil and cook it for two hours.\nThesaurus: synonyms, antonyms, and examples\nto put something over someone or somethingcoverI covered her with a blanket to keep her warm.spreadI spread peanut butter on my bread.smother something in/with somethingThe chicken was absolutely smothered in butter sauce.coatCoat the cherries in chocolate.plasterHis laptop cover was completely plastered with stickers.cakeHis shoes were caked in mud.\nSee more results »\nB2 to cover someone with a piece of material in order to protect them: She wrapped the baby in a blanket. He wrapped a towel around his shoulders.\nMore examplesFewer examplesTake your purchases to the sales clerk, and he will wrap them for you.Once wrapped, the gross weight of the package is 2 kg.The package was wrapped in plain brown paper.She came downstairs after her shower, wrapped in a towel.His head was wrapped in swathes of bandages.\nSMART Vocabulary: related words and phrases\nEnclosing, surrounding and immersing\nbeleaguer\nbeleaguered\nbeset\nborder\nbox someone/something in\ndunk\nfence something off\nflooding\ngather\ngift wrap\ngift-wrapped\ngirdle\nsiege\nsteep\nsteep something/someone in something\nsubmersion\nsurround\nswaddle\nswallow\nswamp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWrapping, packing and loading\nIdioms\nbe wrapped up in something/someone\nwrap someone (up) in cotton wool\nwrap someone around your little finger\nwrap yourself in the flag\nwrapped (up) in secrecyPhrasal verbs\nwrap something around someone/something\nwrap (someone) up\nwrap something up\nwrap noun\n(FOOD)\n[ C ] a sandwich made with one piece of very thin bread that is folded around a filling\nCaziopeia/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSandwiches & snacks\navocado toast\nbanh mi\nBLT\nBombay mix\nbreakfast bar\ndevils on horseback\ndouble-decker\nelephant ear\nfairy bread\nfinger chip\nmuffuletta\nmunchies\nnacho\nnibble\nopen-faced\nsarnie\nshrimp chip\nslider\nsloppy joe\nsnack mix\nSee more results »\nwrap noun\n(COVERING)\n[ U ] material that is used to cover or protect objects: plastic wrap gift wrap\n[ C ] a piece of paper folded to make a small envelope, used for carrying something such as a drug in the form of a powder: People were selling wraps of cocaine and marijuana on the street. They found 13 heroin wraps in his pocket. Synonym\nbindle\n[ C ] a loose piece of clothing that is worn tied around the body: a beach wrap\nGrant Faint/The Image Bank/GettyImages\n[ C ] a long piece of cloth worn around the shoulders for warmth or decoration, usually by women: a chiffon/silk wrap\nWestend61/GettyImages\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsubstratum\nsuperstratum\ntar paper\nuncover\nvein\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral and miscellaneous containers\nDrugs - general words\nDresses, suits & gowns\nCoats, jackets & cloaks\nIdioms\nit's a wrap\ntake the wraps off something\nunder wraps\nused to describe a piece of clothing in which one part is pulled over so that it partly covers another part when the clothing is fastened around the body : She showed off her baby bump for the first time in a sleek grey wrap dress. She wore a white, knee-length skirt and matching wrap top, teamed with high- heeled cowboy boots. She's wearing a black scoop-necked T-shirt and a simple, black ankle-length wrap skirt.\nMore examplesFewer examplesThe American R&amp;B singer also included an African-print wrap dress with matching turban among a number of outfit changes.The wrap top is fantastic because it accentuates a small waist and gives a hint of a cleavage.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoluminously\nvoop neck\nwaisted\nwashable\nwasp waist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClothing - general words\nAdd to word list\nAdd to word list\nto cover something or someone with paper, cloth, or other material: She wrapped the present and tied it with a ribbon. Wrap the chicken in foil and cook it for two hours. If you wrap yourself in this blanket, you will stay warm.\nIf you wrap your fingers or arms around something, you hold it tightly: She sat back in her chair and wrapped her arms around her knees. Idiom\nwrap someone around your little fingerPhrasal verbs\nwrap up something/someone\nwrap up something\na piece of clothing that a person, esp. a woman, wears around the shoulders to keep warm or as a stylish addition to a suit, coat, etc.: [ C ] a silk/woolen wrap\nWrap is material that is used to cover or protect something, such as food: [ U ] Put some plastic wrap around the leftover meat.\nAdd to word list\nAdd to word list\nto put paper, cloth, or other material around something: She wrapped the gift in tissue paper and a red bow.wrap sth in sth I got the dealer to deliver the car wrapped in a ribbon. Phrasal verb\nwrap sth up\npaper, cloth, or other material that is used to cover something: The company decided to serve hamburgers in wraps made mainly of paper. foil/plastic wrap\nkeep sth/be under wraps\ninformal to keep something secret or to be secret: The firm kept its troubles under wraps.\ntake the wraps off sth\nto make something that was secret known to other people or the public: Apple took the wraps off the new model of the iMac yesterday. See also\nbubble wrap\ngift wrap\nshrink-wrap"}