{"id":408199,"name":"wreck","type":"verb","us_sound":"rek","us_link":"../audio/w/wreck.mp3","uk_sound":"rek","uk_link":"../audio/w/ukwreat004.mp3","content":"Add to word list\nAdd to word list\nC2 to destroy or badly damage something: The explosion shattered nearby windows and wrecked two cars. Our greenhouse was wrecked in last night's storm.\ninformal to spoil something completely: He has been warned that his behaviour might wreck his chances of promotion.\nMore examplesFewer examplesThe man is demented - he's going to wreck the whole operation.The storm wrecked our garden shed.The children have wrecked my camera.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDamaging and spoiling\nC2 a vehicle or ship that has been destroyed or badly damaged: Divers exploring the wreck managed to salvage some coins and jewellery. The burned-out wrecks of two police cars littered the road.\nC2 informal someone who is in bad physical or mental condition: The stress she had been under at work reduced her to a nervous/quivering wreck.\nMore examplesFewer examplesThe wrecks of cars litter the desert road.We go diving around the old wreck.They are trying to raise the wreck.\nSMART Vocabulary: related words and phrases\nNavigation & shipwrecks\nastrolabe\ncelestial navigation\nchannel\nchart\ncircumnavigate\ncircumnavigation\ndead reckoning\nfoghorn\nlane\nlightship\nlodestar\nnarrows\nnavigability\npassage\npilot\nquadrant\nsea lane\nsextant\nsubmersible\nyaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot fit & healthy\nAdd to word list\nAdd to word list\nto destroy or badly damage something: The explosion wrecked one house and shattered nearby windows. A prison record would wreck his chances of becoming a lawyer.\na vehicle or ship that has been destroyed or badly damaged\nA wreck can also be something that is badly in need of repair: We bought this old wreck of a house and fixed it up.\nA person who is described as a wreck is in bad physical or mental condition: Coping with three kids and a mother in the hospital, she’s a nervous wreck.\nAdd to word list\nAdd to word list\nto destroy or badly damage something: Several protesters set out to wreck the company's headquarters.\nto spoil a chance, plan, etc.: be wrecked by sth The deal was wrecked by the recent turmoil in the debt markets. Backbenchers were accused of plotting to wreck the government's plans.\nsomething that has been destroyed or badly damaged: The property is a wreck."}