{"id":408368,"name":"writing","type":"noun","us_sound":"ˈraɪ.t̬ɪŋ","us_link":"../audio/w/eus75037.mp3","uk_sound":"ˈraɪ.tɪŋ","uk_link":"../audio/w/ukwreat030.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] a person's style of writing with a pen on paper that can be recognized as their own: Do you recognize the writing on the envelope?\nA2 [ U ] something that has been written or printed: She complained that the writing was too small to read.\nB2 [ U ] the written work, such as stories or poems, of one person or a group of people: She is studying women's writing at the turn of the century.\nB2 [ U ] the activity of creating pieces of written work, such as stories, poems, or articles: creative writing I did a course in creative writing.\nA1 [ U ] the skill or activity of producing words on a surface: Teachers focus on speaking and writing in the afternoon classes. in writing\nB2 in written form: All bookings must be confirmed in writing.\nSee more writings [ plural ]\nthe written works of a person, especially when they have been published as books: writings of the writings of Karl Marx\nSee more\nMore examplesFewer examplesCan you decipher the writing on this envelope?Her writing is full of passion and energy.My daughter is just starting to learn how to do joined-up writing at school.The writing on the tombstone was barely visible.This is a book that clearly explicates Marx's later writings.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPieces of writing\nGrammar\nSpeech into writingBoth speech and writing can be formal or informal. Whether language is formal or informal depends on who our readers and listeners are, for what purpose we use the language and the situation in which we use it. For example, an official notice would be written in formal English, whereas the same information would be more commonly written informally by an individual in a less public situation: …\nIdiom\nthe writing is on the wall\nAdd to word list\nAdd to word list\na person’s style of forming letters and words with a pen or pencil, or something written: Do you recognize the writing on the envelope? There was writing in the margins of many pages in the book.\nWriting is also articles, poems, books, etc.: fiction/nonfiction writing travel writing\nWriting is also the activity of creating stories, poems, or articles: He talked about the experience of teaching writing through interactive television. Idiom\nin writing"}