{"id":408341,"name":"write","type":"verb","us_sound":"raɪt","us_link":"../audio/w/right.mp3","uk_sound":"raɪt","uk_link":"../audio/w/ukrider015.mp3","content":"Add to word list\nAdd to word list\nA1 [ I or T ] to make marks that represent letters, words, or numbers on a surface, such as paper or a computer screen, using a pen, pencil, or keyboard, or to use this method to record thoughts, facts, or messages: When you fill in the form, please write clearly/legibly in black ink. [ + speech ] \"I hope to see you next Saturday,\" she wrote. Why not write (down) your ideas on a piece of paper before you start?\nA2 [ I or T ] to send a letter or message to someone, giving them information or expressing your thoughts or feelings: She hasn't written to me (US also written me) recently. [ + two objects ] I wrote my sister a letter. [ + to infinitive ] My mother wrote to give me details about the party. [ + -ing verb ] The travel company has written giving information about the trip.\n[ T ] (also write something out) to put all the information that is needed on a document: Please will you write (out) your name and address in full. [ + two objects ] I wrote him a cheque for £50.\nB1 [ T ] to create and record something, such as a book, poem, song, or computer program, on paper or on a computer: She writes children's books/poems. Adam designed and wrote the software. He wrote music for films and TV shows. The book is very well written.\nB1 [ I ] to have the job of creating books, stories, or articles that will be published: She writes for a national newspaper.\n[ + that ] to say something in a book, newspaper, magazine, or document: In the article, he writes that the problems in the refugee camps are getting worse.\n[ I ]\n&#160; computing\n&#160; specialized to record information in the memory of a computer: There was a problem writing to the disk in the A drive.\nMore examplesFewer examplesPlease write in ink, not in pencil.He wrote a letter of thanks to the hospital.He writes in a formal and rather stilted style.I've written twice and received no reply, so I might change tack and call her.She sat at her desk writing letters.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\nOperating computers\nIdioms\nnothing to write home about\nwritten all over someone's face\nwritten in the starsPhrasal verbs\nwrite back\nwrite something down\nwrite in\nwrite someone in\nwrite something into something\nwrite something off\nwrite someone/something off\nwrite off/away for something\nwrite someone out of something\nwrite something up\nMore phrasal verbs\nwrite someone up\nwrite verb [I/T]\n(CREATE)\nAdd to word list\nAdd to word list\nto create something for other people to read or use, such as a book, poem, letter, or piece of music: [ T ] to write a poem/a story/a textbook [ T ] They wrote some of the best songs of the 70s. [ T ] They have written computer software to handle our sales records. [ T ] Hammond wrote a letter to his mother/wrote his mother a letter. [ I ] He writes well and is always a pleasure to read.\nTo write is also to put letters, words, numbers, or symbols on a paper, screen, or other surface using a pen, pencil, keyboard (= the keys of a computer), etc.: [ T ] Please write your name on the dotted line.\nSomeone whose job is to write creates articles, stories, or books to be published: [ I ] She writes for the New York Times.\nTo write also means to express an idea or opinion in an article, book, etc.: [ + that clause ] He writes that our highways are getting safer. Phrasal verbs\nwrite down something\nwrite in\nwrite in someone\nwrite off something\nwrite off someone/something\nwrite out something\nwrite up something/someone\nAdd to word list\nAdd to word list\n[ I or T ] to put letters, numbers or symbols on a piece of paper or a computer screen, using a pen, pencil or keyboard: Write your name and address on the form. The negative figures were written in red.\n[ I or T ] to create a document in order to supply information or communicate with someone: He wrote a letter of complaint to the Customer Services Department. A report written by the finance committee made several cost-cutting recommendations. written communication/confirmation/statement\n[ T ] (also write sth out) to put all the necessary information on a form: They wrote me a cheque for $5,000 in compensation.\n[ T ]\n&#160; INSURANCE to provide insurance: The bank does not write its own insurance but offers building and contents cover through a third party.\n[ T ]\n&#160; IT to record data in the memory of a computer or a disk: write sth to sth The file failed to write to disk because it was too large.\n[ T ]\n&#160; IT to create a computer program: The computer package was specially written for market research purposes.\nPhrasal verbs\nwrite sth back\nwrite sth down\nwrite sth into sth\nwrite sth off\nwrite sb/sth off\nwrite sth up"}