{"id":408385,"name":"wrong","type":"adjective","us_sound":"rɑːŋ","us_link":"../audio/w/wrong.mp3","uk_sound":"rɒŋ","uk_link":"../audio/w/ukwriti004.mp3","content":"wrong adjective\n(NOT CORRECT)\nAdd to word list\nAdd to word list\nA1 not correct: Three of your answers were wrong. That clock is wrong - it's 12.30, not 12.15. Some of his facts are questionable, others are plainly (= completely) wrong. Synonyms\nerroneous formal\nfallacious formal\nfalse (NOT CORRECT)\nincorrect\nuntrueOpposite\nright (CORRECT)\nThesaurus: synonyms, antonyms, and examples\nwrongwrongThat's the wrong answer. Read the question again.incorrectThe information on the website is incorrect.erroneousNo one could explain how the erroneous information had got into the report.inaccurateTheir estimation of the cost was wildly (= extremely) inaccurate.\nSee more results »\nA2 If someone is wrong, they are not correct in their judgment or statement about something: You were wrong about the time - the bank closed at 3.30. He's wrong in thinking that we will support the project financially. prove someone wrong\nto show by your actions that someone's judgment of you was not correct: I thought she couldn't do it, but she proved me wrong.\nMore examplesFewer examplesI got eight correct answers and two wrong ones in last week's exam.On the last question, she guessed wrong.He doesn't have the humility to admit when he's wrong.I'd marked her down as a Labour Party supporter, but I was completely wrong.I'm hopeless at physics, and it's the same with chemistry - I get it all wrong.\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregularly\nliberal\nliberally\nquarrel\nwrongheaded\nwrongheadedly\nwrongly\nSee more results »\nwrong adjective\n(NOT SUITABLE)\nC1 not suitable or correct, or not as it should be: She's the wrong person for the job. We must have taken a wrong turning. I'm sorry, you've got the wrong number (= this is not the phone number you wanted). Opposite\nright (SUITABLE)\nSomething that is wrong is not considered to be socially acceptable or suitable: She got in with the wrong crowd (= a group of people who behaved badly) at university.\nB1 If you ask someone what is wrong, you want to know what is worrying or upsetting them: You've been quiet all evening. Is there anything wrong? What's wrong with you today? the wrong way around\n(mainly UK also the wrong way round) If something is the wrong way around, the part that should be at the front is at the back: You've got your skirt on the wrong way round.\nThesaurus: synonyms, antonyms, and examples\nin the opposite to a forward directionbackwardsUK The dog growled and I took a step backwards.backHe leant back on the sofa.in reverseI put the car in reverse.the wrong way aroundThe batteries are in the wrong way around.back to frontUK He always wears his baseball cap back to front.\nSee more results »\nMore examplesFewer examplesThere are fears that the weapons might fall into the wrong hands.I realized I was looking at it from the wrong angle.We realized we had taken the wrong road and had to double back.I got into drugs because I was hanging around with the wrong people.He put the wheel on the wrong way around.\nSMART Vocabulary: related words and phrases\nUnsuitable and unacceptable\namiss\nbe in bad, poor, the worst possible, etc. taste idiom\nbeneath your dignity idiom\nbeyond\nbeyond the pale idiom\nincorrect\nincorrectly\nindecent\nineligibility\nineligible\nover-extravagant\nraffish\nraffishly\nraffishness\nroom\nunsuitable\nunsuitably\nunsuited\nunsupportable\nunwarrantable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nBackwards, sideways and back and forth\nwrong adjective\n(NOT MORAL)\nB2 not considered morally acceptable by most people: Children should be taught that violence is wrong. It was wrong of her to lie to you. What's wrong with having a little fun? Opposite\nright\nMore examplesFewer examplesDo you think it's wrong to use aborted foetuses for medical research?\"Was it wrong of me to go to the police?\" \"Oh no, I'm sure you did right.\"It's wrong to treat animals as if they had no feelings.You didn't do anything wrong, - you should have a clear conscience .He argued that it was wrong to invest in the arms trade.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nnefariousness\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\ntrespass\nturpitude\nunconscionable\nunconscionably\nunethical\nSee more results »\nwrong adjective\n(NOT WORKING)\nB1 [ after verb ] not working correctly: Something's wrong with the television - the picture's fuzzy. The doctors are still trying to find out what's wrong.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak down\nbroken\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nIdioms\ncatch someone on the wrong foot\nget the wrong end of the stick\nget/fall into the wrong hands\ngo down the wrong way\nin the wrong place at the wrong time\nsend/give out (all) the wrong signals\nA2 informal in a way that is not correct: You've spelled my name wrong. See also\nwrongly get something wrong B1 informal\nto make a mistake in the way you answer or understand something: I spent hours doing that problem and I still got the answer wrong. You've got it all wrong - it was your boss that she was annoyed with and not you! go wrong\nB2 If a situation or event goes wrong, it becomes unpleasant and is not a success: Our marriage began to go wrong after we had our first child.\nto make a mistake: These shelves are very easy to put together - you can't go wrong. I thought I'd done this correctly - I just can't understand where I went wrong.\nB1 UK If a machine goes wrong, it stops working correctly: Our TV keeps going wrong.\nMore examplesFewer examplesEverything went wrong when we tried to expand the business.We were having a pleasant meal, but when she mentioned politics, everything went wrong.I don't know what went wrong with their relationship.\nMore examplesFewer examplesI've tied the knots all wrong.I got the time wrong.I wrote the number down wrong.\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse\nfalse negative\nfalse positive\nfalsely\niniquity\ninvalidly\nirregularly\nliberal\nliberally\nquarrel\nwrongheaded\nwrongheadedly\nwrongly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nMaking mistakes\nMachines - not functioning\nIdiom\ndon't get me wrong\n[ U ] what is considered to be morally unacceptable: He has no sense of right and wrong. I was brought up to tell the truth and know right from wrong. As far as her parents are concerned, she can do no wrong (= she is perfect in every way).\n[ C ] formal an unfair action: He has done us a great wrong. She was trying to right (= do something to make better) the wrongs of the past. in the wrong\nIf someone is in the wrong, they have made a mistake or done something that is bad or illegal: The driver was unquestionably in the wrong.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nnefariousness\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\ntrespass\nturpitude\nunconscionable\nunconscionably\nunethical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBad and wrong behaviour\nWrong\nIdiom\ntwo wrongs don't make a right\nto treat someone in an unfair or unacceptable way: She felt deeply wronged by his accusations.\nSMART Vocabulary: related words and phrases\nTreating people or animals badly\nabuser\nanti-harassment\nat the hands of someone idiom\nbatten\nbatten on someone\nhit someone where it hurts idiom\nill-treat\nill-treatment\nill-used\nimpose\npick\npick on someone\nprey\nprey on something\nput someone through something\ntyrannize\ntyranny\nuncared for\nuse\nvictimization\nSee more results »\nwrong adjective\n(NOT CORRECT)\nAdd to word list\nAdd to word list\nnot correct or not accurate: Three of your answers were wrong. That clock is wrong – it’s 12:30, not 12:15. I dialed the wrong number.\nwrong adjective\n(NOT SUITABLE)\nnot suitable or desirable, or not as it should be: It was the wrong time to ask for a raise. She was just the wrong person for the job.\nwrong adjective\n(IMMORAL)\n[ not gradable ] not morally acceptable: He believes that censorship is wrong.\nwrong adjective\n(NOT WORKING)\n[ not gradable ] not working correctly: Something’s wrong with the dishwasher – it’s leaking again. wrong adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/rɔŋ/\nIt doesn’t work – what am I doing wrong? Idiom\nin the wrong place at the wrong time\nwrong verb [T]\n(TREAT UNFAIRLY)\nto treat someone in an unfair or unacceptable way: He felt he had been wronged, but everyone else blamed him for what happened.\nTo wrong someone is also to judge someone unfairly and express uncertainty about that person’s character: That reporter wronged her, saying she was an unfit mother.\nwrong noun\n(IMMORAL ACT)\n[ C/U ] behavior or an act that is morally unacceptable; evil or an evil act: [ U ] She has a keen sense of right and wrong. [ C ] It’s impossible to exaggerate the wrongs caused by slavery.\nwrong noun\n(ACT THAT IS NOT CORRECT)\nbehavior or an act that is not correct: If there's been a wrong, physicians (= doctors) want it made right. Idiom\nin the wrong"}