{"id":408431,"name":"wrought","type":"adjective","us_sound":"rɑːt","us_link":"../audio/w/eus74022.mp3","uk_sound":"rɔːt","uk_link":"../audio/w/ukrooke022.mp3","content":"Add to word list\nAdd to word list\nmade or done in a careful or decorative way: The new album contains some carefully wrought new songs and a number of familiar hits. Her poems are well-wrought and intensely personal. Synonym\nshaped\nMore examplesFewer examplesOhlson's beautifully wrought book is firmly centred in the inner city of Cleveland, Ohio.The same is true of \"Aguacero\", a finely wrought painting by Marcelo Pombo.I enjoy a cunningly wrought visual gag as much as the next person.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nnot standard (only as a past participle and in the past tense) caused (something to happen): A recurring theme is the environmental change wrought by a slowly warming planet. She says the new visa rules wrought havoc at the local consulate.\nMore examplesFewer examplesOn Boxing Day, a tsunami wrought havoc across South Asia.The changes he wrought go far beyond two massive election victories.Seeing the damage wrought in his home county gave him a sense of what it must have been like for New York officials to witness the destruction in lower Manhattan.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspark\nSee more results »\nwrought\n(CAUSED)\nAdd to word list\nAdd to word list\npast simple and past participle of wreak\nwrought adjective [not gradable]\n(MADE)\nbrought into being; made: She’s modest about what she has wrought."}