{"id":84228,"name":"cabinet","type":"noun","us_sound":"ˈkæb.ən.ət","us_link":"../audio/c/cabinet.mp3","uk_sound":"ˈkæb.ɪ.nət","uk_link":"../audio/c/ukbysta017.mp3","content":"cabinet noun\n(GOVERNMENT)\nAdd to word list\nAdd to word list\n[ C usually singular, + sing/pl verb ] (usually Cabinet) a small group of the most important people in government, who advise the President or Prime Minister and make important decisions: The Cabinet meet/meets every Thursday. The President is completing the selection of his new Cabinet. a cabinet postUK a cabinet reshuffle (= changes in the Cabinet).UK a cabinet minister\nMore examplesFewer examplesThe president has accused two cabinet ministers of working secretly to undermine him.She needs to persuade the hard-liners in the cabinet.The cabinet will also attend the meeting ex-officio.The Minister wished it to be known that he had left the cabinet of his own volition.It is rumoured that she wants to get back into the cabinet.\nSMART Vocabulary: related words and phrases\nGovernment ministers & civil servants\naide\nam\nattorney general\nbackbencher\nchamberlain\nfunctionary\ngovernment\nHome Secretary\ninterministerial\nkitchen cabinet\nprivate member\nprivate secretary\nPrivy Councillor\nprocurator\npublic servant\nSurgeon General\nsyndic\ntown clerk\nundersecretary\nvizier\nSee more results »\ncabinet noun\n(FURNITURE)\nA2 [ C ] a piece of furniture with shelves, cupboards, or drawers, used for storing or showing things: Valuable pieces of china were on display in a glass-fronted cabinet. a bathroom/filing cabinet\nFirmafotografen/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nFurniture for storage\nairing cupboard\nalmirah\nbookcase\nbookshelf\nbroom closet\ncubby\ncubbyhole\ncupboard\ncwtch\ndrawer\nhot press\nhutch\nlocker\nottoman\nshelf\nshelves\ntrophy cabinet\nwalk-in\nwardrobe\nWelsh dresser\nSee more results »\ncabinet noun [C]\n(FURNITURE)\nAdd to word list\nAdd to word list\na piece of furniture with shelves or drawers that is used for storing useful things or showing decorative things: a medicine cabinet\nA filing cabinet is a set of large drawers in which papers can be stored.\ncabinet noun [C]\n(GOVERNMENT)\npolitics &amp; government a small group of people within a government who give advice to the highest leader, such as the president or prime minister: In the US, the Secretary of Defense is a member of the president’s Cabinet.\nAdd to word list\nAdd to word list\nGOVERNMENT a small group of the most important people in a government, who meet regularly to make the main decisions: As president he holds the reins of power, including the power of appointing the Cabinet. a cabinet appointment/member/post Cabinet minister"}