{"id":84365,"name":"cache","type":"noun","us_sound":"kæʃ","us_link":"../audio/c/cache.mp3","uk_sound":"kæʃ","uk_link":"../audio/c/ukbysta022.mp3","content":"cache noun\n(STORE)\nAdd to word list\nAdd to word list\n[ C ] a hidden store of things, or the place where they are kept: an arms cache a cache of explosives/weapons/drugs\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\ncache noun\n(MEMORY)\n[ C or U ] (also cache memory) an area or type of computer memory in which information that is often in use can be stored temporarily and got to especially quickly: 256 Kb secondary cache\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\ncache verb\n(HIDE)\n[ T ] to put something in a hidden or safe store: We have supplies cached at sites all over the country. The squirrels pull off the cones and drop them to the ground, then collect and cache them for winter.\nMore examplesFewer examplesAbout 4,000 to 5,000 salmon eggs are cached in each nest. Electrical crews began caching transformers and other equipment in safe areas.Weapons and explosives were cached inside the bag.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\ncache verb\n(KEEP IN MEMORY)\n[ I or T ] to store information in a cache (= a type of computer memory for storing information temporarily and getting to it quickly): Links to cached pages are listed as well as links to live web pages. Most service providers improve customer response times by caching.\nMore examplesFewer examplesAll browsers create temporary files that speed up your internet surfing by caching parts of web pages that you access.The story is no longer posted on the website but is cached online by search engines.The tool lets you specify what types of data you want cached.It downloads code over the network, caches it, and runs it in a secure environment.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nAdd to word list\nAdd to word list\na secret or hidden store of things, or the place where they are kept: Authorities believe the robber was after a hidden cache of $2,500 kept in a box under the counter.\nAdd to word list\nAdd to word list\nan area or type of computer memory in which information that is often in use can be stored temporarily, so that you can get to it quickly: Set your browser so that the cache is automatically cleared out frequently.\nIT, INTERNET to store computer information temporarily so that a user can get to it quickly: All browsers speed up your Web surfing by caching components of Web pages you access."}