{"id":84908,"name":"caisson","type":"noun","us_sound":"ˈkeɪ.sən","us_link":"../audio/c/cdo0318uscais0713.mp3","uk_sound":"ˈkeɪ.sən","uk_link":"../audio/c/cdo0318ukcais0237.mp3","content":"caisson noun [C]\n(STRUCTURE)\nAdd to word list\nAdd to word list\nengineering\n&#160; specialized a structure that goes under water or under ground and keeps water out, used in building and repairing things such as bridges: The tower rests on caissons reaching down 110 feet into bedrock.\nduncan1890/DigitalVision Vectors/Getty Images /GettyImages\nMore examplesFewer examplesThousands of people worked on the Brooklyn Bridge. Many bodies are buried underneath those caissons.The foundation work, which involves drilling 34 steel and concrete caissons, is expected to take a year.190,000 cubic yards of concrete went into the bridge's anchorages, caissons, towers and highway approaches.The Jefferson Memorial was built in the late 1930s and early 1940s atop pilings and caissons sunk into an artificial mud flat that is about 100 feet deep.\nSMART Vocabulary: related words and phrases\nCivil engineering in general\nbrownfield\nbuilt environment\ncivil engineer\ncivil engineering\ngeotechnical\ngeotechnology\nlineman\nlinesman\nplanning\nplanning permission\npurpose-built\nquantity surveyor\nreclamation\nredevelop\nstructural engineer\nsubsea\nsurveyor\ntown planner\ntown planning\ntrig point\nSee more results »\ncaisson noun [C]\n(BOX)\nmilitary\n&#160; specialized in the past, a large box or a vehicle pulled by a horse, used for carrying ammunition (= bullets, etc.) needed for a battle\nNoDerog/iStock/Getty Images Plus/GettyImages\nExamples\nA caisson is the horse-drawn vehicle that once carried ammunition in battle and carries coffins afterward.There were caissons loaded with cartridges, musket balls and flints.For officers of the rank of colonel or higher, a riderless horse follows the caisson to the gravesite.The dead carried from the battlefield on a caisson were covered with a flag."}