{"id":85263,"name":"calculus","type":"noun","us_sound":"ˈkæl.kjə.ləs","us_link":"../audio/c/calculus.mp3","uk_sound":"ˈkæl.kjə.ləs","uk_link":"../audio/c/ukcajun018.mp3","content":"calculus noun\n(CALCULATION)\nAdd to word list\nAdd to word list\n[ U ]\n&#160; mathematics\n&#160; specialized an area of advanced mathematics in which continuously changing values are studied: Did you do calculus at A level? It is essential to understand functions and derivatives, key building blocks in calculus.\n[ singular ] a way of calculating, judging, or deciding something in a complicated situation: There is a very tricky political calculus involved here. The piece about jury screening discusses the decision-making calculus itself. The new legislation changes the calculus for car manufacturers.\nMore examplesFewer examplesMany people are terrified of learning calculus.If turnout were to increase by just a few percent, that would change the calculus of our elections.\nSMART Vocabulary: related words and phrases\nBranches & types of mathematics\nalgebra\nCartesian\nderivative\ndifferentiate\ndifferentiation\nEuclidean\ngame theory\ngeodetics\ngeometric\ngeometrically\ngeometry\nmathematician\nmathematics\nmensuration\nmental arithmetic\nnon-Euclidean\nnon-mathematical\nnon-mathematician\nnumber theory\ntrigonometry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\ncalculus noun\n(MEDICAL)\n[ C ]\n&#160; medical\n&#160; specialized plural calculi a mass of a hard mineral substance that is formed in the body, for example in the kidneys or gall bladder: Stones that form in the kidney or bladder are called urinary calculi. See also\ngallstone\nkidney stone\n[ U ]\n&#160; medical\n&#160; specialized a hard substance that forms on the teeth: The disease process begins when plaque on the tooth hardens to tartar, which hardens further to become calcified tartar, or calculus. Compare\ntartar\nMore examplesFewer examplesMeasures to remove biliary tract calculi can be considered, although from the present study stones recurred in 12 of 12 patients.A 70-year-old male with gout and known renal calculi presents with left flank pain.Because your body is fighting off the calculus, periodontal disease is stressing the entire immune system.The body attacks the calculus below the gum line, leading to inflammation and bleeding gums.\nSMART Vocabulary: related words and phrases\nDisorders of the urinary system\nADPKD\nARPKD\nautosomal dominant polycystic kidney disease\nautosomal recessive polycystic kidney disease\nbedwetting\nCKD\ncontinence\ncystitis\ncystocele\ndyscalculia\nhypospadias\nincontinence\nincontinent\nkidney stone\nmembranous nephropathy\nproteinuria\nrenal failure\nstress incontinence\nurethral stricture\nurge incontinence\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nProblems with bones, joints & teeth\nAdd to word list\nAdd to word list\nmathematics the mathematical study of continually changing values\nmathematics the mathematical study of continually changing values"}