{"id":85243,"name":"calculate","type":"verb","us_sound":"ˈkæl.kjə.leɪt","us_link":"../audio/c/calculate.mp3","uk_sound":"ˈkæl.kjə.leɪt","uk_link":"../audio/c/ukcajun012.mp3","content":"Add to word list\nAdd to word list\nB2 to judge the number or amount of something by using the information that you already have, and adding, taking away, multiplying, or dividing numbers: The cost of the damage caused by the recent storms has been calculated as/at over £5 million. The new tax system would be calculated on the value of property owned by an individual. [ + question word ] At some stage we need to calculate when the project will be finished. [ + that ] He's calculated that it would take him two years to save up enough for a car. Synonym\ncompute formal\nMore examplesFewer examplesHe's written a piece of software which calculates your tax returns for you.Calculate the result to two decimal places.I'll just calculate the total.I'm trying to calculate how long the project will take to complete.The computer will calculate your position with pinpoint accuracy.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nroot\nsum\nsum total\nwork something out\nSee more results »\nPhrasal verb\ncalculate on something\nAdd to word list\nAdd to word list\nto judge the amount or value of something by using information and esp. numbers: [ + question word ] We tried to calculate how fast he was moving when the car crashed. I calculated the total cost to be over $9000. [ + that clause ] Lieutenant Chilton calculated that six men had been lost. calculation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˌkæl·kjəˈleɪ·ʃən/\n[ C ] The original calculations ignored weather conditions.\nAdd to word list\nAdd to word list\nto find an amount or number using mathematics: calculate according to/based on/on the basis of Their pension will be calculated on the basis of their earnings and length of service.calculate that It has been calculated that the economy shrank by 2% last quarter.\nto form an opinion about something: They are already in the lead and are calculating that, in all probability, they will win the election."}