{"id":85300,"name":"calendar","type":"noun","us_sound":"ˈkæl.ən.dɚ","us_link":"../audio/c/cdo0318uscale0719.mp3","uk_sound":"ˈkæl.ən.dər","uk_link":"../audio/c/ukcajun020.mp3","content":"Add to word list\nAdd to word list\nA2 a printed table showing all the days, weeks, and months of the year: An old calendar for 2012 was still hanging on the wall of her office.\nfilo/DigitalVision Vectors/GettyImages\nUS a book with a separate space or page for each day, in which you write down your future arrangements, meetings, etc.: He wrote the date of the meeting in his calendar.\nsamsonovs/iStock/Getty Images Plus/Getty Images /GettyImages\nthe system used to measure and arrange the days, weeks, months, and special events of the year according to a belief system or tradition: the Christian/Jewish/Chinese calendar\na list of events and dates within a particular year that are important for an organization or for the people involved in a particular activity: the political/school calendar\nMore examplesFewer examplesLet me look at the calendar and see which weekends are free.I've marked his birthday on the calendar.The calendar is looking quite busy for March.I'm counting down the days on the calendar till he's back.I need a desk calendar for work.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ndatebook\ndeadline\nHegira\nHejira\nitinerary\njournal\nmake time idiom\npack\nprogramme\nschedule\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nsqueeze someone/something in\nSee more results »\nto plan an event to take place on a particular date: The house calendared an anti-terrorism bill in November. Plans are made, and don’t work out. Appointments are calendared, then cancelled.\nMore examplesFewer examplesI just calendared a meeting for the 18th but I have to move it to the 30th.Hearings should be calendared within 120 days of the complaint.They want the meeting calendared for May.the end of the calendared school year\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nin someone's crosshairs idiom\nplanner\nprovision\npurpose\npurposefully\npurposely\nput the cart before the horse idiom\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nAdd to word list\nAdd to word list\na printed table showing the arrangement of the days, weeks, and months of the year\nA calendar is also a list of meetings or things you have to do at particular times: My calendar is pretty crowded over the next few weeks.\nA calendar is also a system for deciding the beginning and end of years, their total length, and the parts into which they are divided: The Gregorian calendar is used today in most parts of the world.\nAdd to word list\nAdd to word list\na table showing all the days, weeks, and months of the year: a desk/wall calendar The date Dec. 31 is circled in red on the calendar\nUS ( UK diary) a book, with pages for each day, in which you write down what you have to do: I've noted the date in my calendar.\nIT a computer program showing planned activities with their dates and times: I can access the calendars of everybody in the department. There's nothing in his calendar for today. To submit events directly to the online calendar, please enter a user name and email address on the form below.\na list of events and dates within a year that are important to an organization or to the people involved in a particular activity: the academic/court/election, etc. calendar With just weeks left in the legislative calendar, there has been no vote yet on this most important issue."}