{"id":85403,"name":"calico","type":"noun","us_sound":"ˈkæl.ə.koʊ","us_link":"../audio/c/calico.mp3","uk_sound":"ˈkæl.ɪ.kəʊ","uk_link":"../audio/c/ukcajun027.mp3","content":"calico noun\n(CLOTH)\nAdd to word list\nAdd to word list\n[ U ] UK a heavy plain cloth made from cotton: Hospitalized servicemen wore an approximation of uniform in blue calico. a calico shopping bag\nKameleon007/iStock / Getty Images Plus/GettyImages\n[ U ] US cotton cloth with a printed pattern: His shirt, jacket, and trousers were of striped calico. I found a picture of my grandmother in a calico dress.\nMore examplesFewer examplesHer great-aunt was dressed in starched calico from neck to foot.A young woman was deported for stealing two pieces of printed calico.a red and white spotted calico hat\nSMART Vocabulary: related words and phrases\nTextiles made from natural fibres\nbamboo\nbombazine\nburlap\ncambric\ncamel\ndistaff\nfaille\nfelt\nfishnet\nflannelette\nnankeen\nneedlecord\nnetting\noilskin\norgandie\nterry\nticking\ntowelling\ntulle\ntweed\nSee more results »\ncalico noun\n(CAT)\n[ C ] US (also calico cat); (UK tortoiseshell and white cat, tortie and white) a cat with white, black, brown, and orange fur: We've had three cats in our married life, and we have a calico now. A small calico cat was sitting on the windowsill above the kitchen sink. Compare\ntabby\ntortoiseshell\nMore examplesFewer examplesThe cat was a calico named CC.I have one cat that is a calico, and I have one that has long black-and-white hair.Generally, cloned animals look identical, but calicos are a strange exception. Having the same DNA as another calico cat does not always produce the same coat pattern.\nSMART Vocabulary: related words and phrases\nFelines (cats)\nBengal tiger\nbig cat\ncat\ncat-sit\ncat-sitter\njaguar\nkitten\nleopard\nlion\nlioness\nmarmalade cat\npanther\nPersian cat\npuma\npuss\npussy\ntom\ntomcat\ntortie\nwildcat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescriptions of animal (non-human) markings\nAdd to word list\nAdd to word list\na cotton cloth with a printed pattern"}