{"id":85558,"name":"called","type":"verb","us_sound":"kɑːl","us_link":"../audio/c/call.mp3","uk_sound":"kɔːl","uk_link":"../audio/c/ukcalip004.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncall\ncall verb\n(NAME)\nB1 [ T + obj + noun ] to give someone or something a name, or to know or address someone by a particular name: They've called the twins Edward and Thomas. What's that actor called that we saw in the film last night? His real name is Jonathan, but they've always called him Johnny. What's her new novel called? I wish he wouldn't keep calling me \"dear\" - it's so patronizing! call someone names\nC2 If a person, especially a child, calls someone names, he or she addresses that person with a name that is intended to be offensive: Tom's worried that if he wears glasses at school the other children will call him names.\nMore examplesFewer examplesMars is sometimes called the Red Planet because of its distinctive colour.I think he was called Blake, if I remember correctly.He was most uncivil to your father - called him an old fool.What have they decided to call their new baby?\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInsults & abuse\ncall verb\n(PHONE)\nA2 [ I or T ] to use a phone to talk to someone: He called (you) last night when you were out. She called (me) this morning at the office and we had a brief chat. I've been calling all morning but I can't get through. Do you think we should call the police? call collect US ( also reverse (the) charges)\nto make a phone call that is paid for by the person who receives it\nMore examplesFewer examplesIf I'm not home when you call, leave a message on the machine .I gave him my number and he promised to call me.Probably the best thing to do is to call them before you go.I tried calling you but the line was busy.You could always call Susie and see if she might babysit.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\ncall verb\n(CONSIDER)\n[ T + obj + noun ] to consider someone or something to be: He knows a lot of people, but only one or two that he'd call close friends. One sandwich and a lettuce leaf - I don't call that a meal! I'm not calling you a liar - I'm just suggesting that you misunderstood the facts of the situation. call something your own\nto consider something as belonging to you: I don't aspire to anything very grand - I just want a place I can call my own.\nMore examplesFewer examplesSome people call English a mongrel language because it is a mixture of old German and French.How can you call those barbarians your friends?It's a suburb of Manchester really - I wouldn't call it Manchester proper.He's quite attractive but not what I'd call gorgeous.He had a few tufts of hair on his chin, but you could hardly call it a beard.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\ncall\nconjecture\nconsider\ndeem\nfall\nguess\njump\njump to conclusions idiom\nmark\nmark someone down as something\nmisjudge\nmisjudgment\npluck\npresuppose\nspeculate\nsupposably\nsurmise\nthink of something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving and owning - general words\ncall verb\n(SHOUT/CRY)\nB1 [ I or T ] to say something in a loud voice, especially in order to attract someone's attention, or (of animals) to make a loud, high sound, especially to another animal: Someone in the crowd called (out) his name. Did you call? [ + speech ] \"Hey, you! Come over here!\" she called. The blackbird called to its mate.\nThesaurus: synonyms, antonyms, and examples\nto shoutshoutThere's no need to shout, I can hear you just fine.yell\"What are you doing?\" he yelled.bellow\"Listen to me!\" he bellowed.hollerUS She came running inside, hollering about being chased by a bear.call\"I'm up here,\" he called.\nSee more results »\ncall for order (also call something to order)\nto ask people in a meeting to stop talking so that the meeting can continue: She called for order/called the meeting to order.\nMore examplesFewer examplesShe sometimes calls out in her sleep.I thought I heard you call from upstairs.I called to her but she didn't hear me.\"We're over here!\" she called.I thought I heard someone call my name.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nlung\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\ncall verb\n(ASK TO COME)\nC1 [ I or T ] to ask someone to come to you: She called me over to where she was sitting. I keep the bedroom door open in case the children call (for) me in the night. I was called to an emergency meeting this morning. At school she was always being called into the headteacher's office.\nThesaurus: synonyms, antonyms, and examples\nto ask someone to come to youcallThe children called for him at night.call outPlease avoid calling out the doctor unless it is an emergency.send forSomeone has already sent for a doctor.summonI was summoned to the headmaster's office.summonsIf you are summonsed and do not attend court, you may be found guilty of contempt of court. hailShe walked to the corner and hailed a cab.\nSee more results »\nMore examplesFewer examplesI thought I heard my daughter calling for me.He was called to the phone.She called me over and showed me the report.You can't just call people across the office and expect them to come running!He called me into his office and asked me to explain my decision.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall\ncall (something) out\ncall someone in\nconvene\nconvoke\nfriend\ninvite\ninvite someone over\ninvitee\nplus one\nrecall\nresummon\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\ncall verb\n(VISIT)\n[ I ] to visit someone, especially for a short time: The electrician must have called (round) this morning when we were out - there's a note on the door mat.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\ncall verb\n(DECIDE ON)\nC1 [ T ] to decide officially to have a particular event or take particular action: The managing director has called a meeting to discuss pay levels. The papers are predicting that the prime minister will call an election in the spring. It's reckoned that the unions will call a strike if management will not agree to their demands. They had to call a halt to (= end) the match because of the heavy rain.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nIdioms\ncall someone's bluff\ncall your shot\ncall a spade a spade\ncall into question\ncall it a day\ncall it a night\ncall it quits\ncall the shots\nsomething is calling youPhrasal verbs\ncall back\ncall someone back\ncall by\ncall for someone\ncall for something\ncall forth something\ncall someone in\ncall something in\ncall someone/something off\ncall something off\nMore phrasal verbs\ncall (in) on someone\ncall on someone\ncall on something\ncall (something) out\ncall someone out\ncall someone up\ncall something up"}