{"id":85539,"name":"call","type":"verb","us_sound":"kɑːl","us_link":"../audio/c/call.mp3","uk_sound":"kɔːl","uk_link":"../audio/c/ukcalip004.mp3","content":"call verb\n(NAME)\nAdd to word list\nAdd to word list\nB1 [ T + obj + noun ] to give someone or something a name, or to know or address someone by a particular name: They've called the twins Edward and Thomas. What's that actor called that we saw in the film last night? His real name is Jonathan, but they've always called him Johnny. What's her new novel called? I wish he wouldn't keep calling me \"dear\" - it's so patronizing! call someone names\nC2 If a person, especially a child, calls someone names, they address that person with a name that is intended to be offensive: Tom's worried that if he wears glasses at school the other children will call him names.\nSee more\nMore examplesFewer examplesMars is sometimes called the Red Planet because of its distinctive colour.I think he was called Blake, if I remember correctly.He was most uncivil to your father - called him an old fool.What have they decided to call their new baby?\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\nform of address\ngiven name\ngood name\nidentity\nilk\npet name\nplace name\npseudonym\npseudonymity\npseudonymous\ntrademark\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nSee more results »\ncall verb\n(PHONE)\nA2 [ I or T ] to use a phone to talk to someone: He called (you) last night when you were out. She called (me) this morning at the office and we had a brief chat. I've been calling all morning but I can't get through. Do you think we should call the police? call collect US ( also reverse (the) charges)\nto make a phone call that is paid for by the person who receives it: She got his phone number from another inmate and called collect.\nSee more\nMore examplesFewer examplesIf I'm not home when you call, leave a message on the machine .I gave him my number and he promised to call me.Probably the best thing to do is to call them before you go.I tried calling you but the line was busy.You could always call Susie and see if she might babysit.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\ncall verb\n(CONSIDER)\n[ T + obj + noun ] to consider someone or something to be: He knows a lot of people, but only one or two that he'd call close friends. One sandwich and a lettuce leaf - I don't call that a meal! I'm not calling you a liar - I'm just suggesting that you misunderstood the facts of the situation. call something your own\nto consider something as belonging to you: I don't aspire to anything very grand - I just want a place I can call my own.\nSee more\nMore examplesFewer examplesSome people call English a mongrel language because it is a mixture of old German and French.How can you call those barbarians your friends?It's a suburb of Manchester really - I wouldn't call it Manchester proper.He's quite attractive but not what I'd call gorgeous.He had a few tufts of hair on his chin, but you could hardly call it a beard.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nguess\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nsuspect\nSee more results »\ncall verb\n(SHOUT/CRY)\nB1 [ I or T ] to say something in a loud voice, especially in order to attract someone's attention, or (of animals) to make a loud, high sound, especially to another animal: Someone in the crowd called (out) his name. Did you call? [ + speech ] \"Hey, you! Come over here!\" she called. The blackbird called to its mate.\nThesaurus: synonyms, antonyms, and examples\nto shoutshoutThere's no need to shout, I can hear you just fine.yell\"What are you doing?\" he yelled.bellow\"Listen to me!\" he bellowed.hollerUS She came running inside, hollering about being chased by a bear.call\"I'm up here,\" he called.\nSee more results »\ncall for order (also call someone/something to order)\nto ask people in a meeting to stop talking so that the meeting can continue: She called for order/called the meeting to order.\nSee more\n[ T ] in American football, to say what the next play will be: The coach calls the plays from the sideline.\n[ T ] US to describe a sports game as it is happening, especially on radio or television: He called the game for ABC. See also\ncommentate\nMore examplesFewer examplesShe sometimes calls out in her sleep.I thought I heard you call from upstairs.I called to her but she didn't hear me.\"We're over here!\" she called.I thought I heard someone call my name.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nlung\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nBroadcasting in general\ncall verb\n(ASK TO COME)\nC1 [ I or T ] to ask someone to come to you: She called me over to where she was sitting. I keep the bedroom door open in case the children call (for) me in the night. I was called to an emergency meeting this morning. At school she was always being called into the headteacher's office.\nThesaurus: synonyms, antonyms, and examples\nto ask someone to come to youcallThe children called for him at night.call outPlease avoid calling out the doctor unless it is an emergency.send forSomeone has already sent for a doctor.summonI was summoned to the headmaster's office.summonsIf you are summonsed and do not attend court, you may be found guilty of contempt of court. hailShe walked to the corner and hailed a cab.\nSee more results »\nMore examplesFewer examplesI thought I heard my daughter calling for me.He was called to the phone.She called me over and showed me the report.You can't just call people across the office and expect them to come running!He called me into his office and asked me to explain my decision.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall (something) out\ncall someone in\nconvene\nconvoke\nfriend\ninvite\ninvite someone over\ninvitee\nplus one\nrecall\nresummon\nsave\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\ncall verb\n(VISIT)\n[ I ] to visit someone, especially for a short time: The electrician must have called (round) this morning when we were out - there's a note on the door mat.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\ncall verb\n(DECIDE ON)\nC1 [ T ] to decide officially to have a particular event or take particular action: The managing director has called a meeting to discuss pay levels. The papers are predicting that the prime minister will call an election in the spring. It's reckoned that the unions will call a strike if management will not agree to their demands. They had to call a halt to (= end) the match because of the heavy rain.\n[ T ] If a sports official calls something, they make a decision about an action by a player or about a shot (= a kick, hit, or throw of the ball): [ + obj + adv ] The line judge called the ball out. The third base umpire called Nixon out at third. Baseball umpires still call balls and strikes.\n[ T ] In cricket, if an umpire (= official) calls a bowler (= the player throwing the ball ), they decide that they have bowled a no-ball (= thrown the ball in a way that is not allowed): The umpire called him for throwing. The umpire called Waqar for a second over-shoulder-high bouncer to Smith in his next over.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefereeing & judging in sport\nCricket\nSee also\ncall in sickIdioms\ncall someone's bluff\ncall your shot\ncall a spade a spade\ncall into question\ncall it a day\ncall it a night\ncall it quits\ncall the shots\nsomething is calling youPhrasal verbs\ncall back\ncall someone back\ncall by\ncall for someone\ncall for something\ncall forth something\ncall someone in\ncall something in\ncall someone/something off\ncall something off\nMore phrasal verbs\ncall (in) on someone\ncall on someone\ncall on something\ncall (something) out\ncall someone out\ncall someone up\ncall something up\ncall noun\n(PHONE)\nA2 [ C ] the act of using the phone: I got a call from an old college friend last night. If there are any calls for me, could you write them down next to the phone? I've just got a couple of calls to make. That decorator you called about painting the house - did he ever return your call? The radio station received a lot of calls complaining about the show's bad language. Before six o'clock, calls are charged at peak rate.\nMore examplesFewer examplesWill you excuse me? I've got to make a phone call.The phone company were unable to trace the call.Please confine your use of the phone to business calls.He told my boss that I'd been making long-distance calls at work!We had to make five calls to technical support just to get the new computer working.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\ncall noun\n(ANIMAL)\nB1 [ C ] the sound an animal makes or the sound of someone shouting something: The whale has a very distinctive call. She could hear calls for help from inside the burning building. I'll be in the next room, so give me a call if you need any help.\nMore examplesFewer examplesI thought I heard a call from the bedroom.the wolf's callthe call of the brown owlCould you give me a call when he arrives?Was that a call for help?\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nlung\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\ncall noun\n(DEMAND)\n[ U ] the fact of people wanting or needing a particular thing: There's not much call for fur coats these days.formal I certainly don't think there's any call for that sort of language, young lady!\nC1 [ C ] a demand for something to happen: Management have so far ignored the union's calls for stricter safety regulations.\nThesaurus: synonyms, antonyms, and examples\nthe act of asking for somethingrequestHer request for information was denied.applicationHis application for bail was granted.appealThe leader made an appeal for unity.callWith calls for action mounting, policymakers are beginning to pay attention.demandWe will never give in to terrorists’ demands.\nSee more results »\nSMART Vocabulary: related words and phrases\nFeelings of desire\nappetite\ncaprice\ncarnality\ncarnally\ncompulsion\ndream\nentitled\nhankering\nhunger\nimpulse\nimpulse buy\nimpulse buying\nitchy\ntemptation\nthirst\nurge\nvaulting\nwhim\nwhimsy\nyen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\ncall noun\n(VISIT)\nC1 [ C ] a short visit, especially an official one made by someone whose job is connected with health: Doctor Seward is out on a call this morning. The nurse has got a few calls to make this afternoon.old-fashioned I thought I'd pay a call on (= visit) an old friend of mine this weekend.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: doctors & health workers generally\ncall noun\n(DECISION)\n[ C ] informal a decision: It was a tough call, but eventually I decided to give up my job. The decision to extend Army tours from one year to 15 months was a good call. More investment? That's got to be your call - you're the one that's paying!\n[ C ] informal a decision by a sports official about an action by a player or a shot (= a throw, hit, or kick of the ball): At the start of the second set, he challenged a questionable line call. The refs made a number of controversial calls.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefereeing & judging in sport\nGrammar\nThing and stuffWe use the general noun thing more commonly in speaking than in writing. …\nThingWe use the general noun thing more commonly in speaking than in writing. …\nStuffStuff is one of the most common nouns in speaking. It is more informal than thing. It is not at all common in writing. …\nIdioms\ncall of nature\na close call\ngood call\non call\ncall verb\n(NAME)\nAdd to word list\nAdd to word list\n[ T ] to give someone or something a name, or to know or address someone by a particular name: They can’t decide whether to call their new baby Carol or Alice. His name is Anthony, but everyone calls him Tony. call someone names\nTo call someone names is to use rude or insulting words to describe someone: Politicians waste a lot of time calling each other names and criticizing each other.\ncall verb\n(TELEPHONE)\n[ I/T ] to telephone someone: [ I ] I called last night and left a message. [ T ] Jenny called me and invited us over for the weekend. call someone collect\nIf you call someone collect, you telephone someone who agrees to pay for the cost of talking to you\ncall verb\n(SAY)\n[ I/T ] to say something in a loud voice, esp. in order to get someone’s attention: [ T ] “Answer ‘Here!’ when I call your name,” the teacher said. call the roll\nIf you call the roll you read aloud the names of all the people on a list to make certain that each person is present: The teacher calls the roll at the beginning of each day.\ncall verb\n(ASK TO COME)\n[ I/T ] to ask someone to come to you: [ I ] I ran to Jonathan as soon as I heard him call. [ T ] You’d better call an ambulance. [ M ] Susan, would you call in the next patient, please?\ncall verb\n(CONSIDER)\n[ T ] to consider someone or something to be something: I wouldn’t call him a friend – he’s just someone I met. The umpire called him safe on a close play.\ncall verb\n(ASK FOR)\n[ T ] to ask for or demand something, or to decide officially to have a particular event: The mayor called a meeting of local organizations to discuss budget priorities.\nIdioms\ncall a halt to something\ncall it a day\ncall it quits\ncall the shotsPhrasal verbs\ncall back (someone)\ncall for someone\ncall for something\ncall forth something\ncall in\ncall in someone\ncall off something\ncall on someone\ncall on someone\ncall out (something)\nMore phrasal verbs\ncall out something\ncall up (someone)\ncall up someone\ncall noun\n(BEING ASKED TO COME)\n[ C ] a visit that someone makes, esp. as part of a job: The locksmith is out on a call right now. on call\nPeople who work in medicine and other important activities are said to be on call when they are available to make visits or to speak to someone on the telephone at any time: Dr. Menendez is on call for the next 24 hours.\ncall noun\n(DECISION)\n[ C ] a decision: I really don’t know what to do – it’s your call.\ncall noun\n(CAUSE)\n[ C/U ] a reason or cause: [ U ] There’s no call for you to get so angry – I was just kidding.\ncall noun\n(SOUNDS)\n[ C ] a loud sound made by a person or animal: Where we camp, near the river, you can hear the call of the wolf almost every night.\n[ C ] the characteristic cry of a bird: Students tried to imitate the calls of their favorite birds.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMUNICATIONS to phone someone: I'll tell Mr Baker you called. Would you like me to pass on any message? Please call us as soon as possible so that we can resolve this issue.\ncall collect US (also reverse (the) charges)\nCOMMUNICATIONS to make a phone call that is paid for by the person who receives it: To call collect from overseas, you need to reach an international operator.\n[ T ] to ask or demand that a particular action should be taken or that a particular event should happen: call an election/meeting/strike An emergency meeting of the board was called for the next day.\ncall for order (also call sb/sth to order)\nMEETINGS, LAW to ask people in a meeting or law court to be quiet so that the meeting or legal action can continue: The senator called the Judiciary Committee meeting to order. A deputy called for order in the courtroom.\n[ T ]\n&#160; FINANCE\n&#160; (also call sth in) to say officially that borrowed money must be paid back: call (in) a debt/loan The contract gives the lender the right to call a loan if the borrower sells the property.\ncall (in) a bond\nFINANCE to pay back money to a person or organization holding a bond before the date when the bond matures (= when it would normally be paid back): When interest rates plunge, a company may decide to call a bond.\n[ T ] to ask someone to come to a place: call sb in/into/over He was called into a manager's office and told that, after 26 years of service, he was no longer needed. She called me over and asked if I was interested in applying for the job.\n[ I ] to visit a person or place for a short time: A salesman called at my home.\n[ T ] informal to say that a particular event or action will happen in the future: He claims to have called the downturn in the economy nearly four years ago.\n[ T ]\n&#160; LAW to make someone say what they know about a situation, in a court of law or to a government official or group: The committee can call witnesses and compel them to answer questions. Phrasal verbs\ncall back\ncall (sb) back\ncall sth back\ncall for sth\ncall in\ncall sb in\ncall sth in\ncall sth off\ncall on/upon sb\ncall on/upon sth\nMore phrasal verbs\ncall (sb) up\ncall sth up\n[ C ]\n&#160; COMMUNICATIONS an act of communicating with someone by phone: a phone/telephone call I'm expecting a phone call from him this morning.a local/international/long-distance call The company is dropping international call charges to over 20 countries.make/place a call We're not allowed to make private calls at work.get/receive/take a call Thank you for taking my call.return sb's call He was busy when I contacted him and he didn't return my calls. See also\ncold-call\nconference call\ncourtesy call\ntoll call\n[ C ] a short visit, especially one for a particular or official purpose: a customer/sales callpay a call on sb While I was in the area, I took the opportunity of paying a call on one of my clients. See also\ncourtesy call\n[ C ] a demand for something to happen: a call for sth Yesterday there were renewed calls for a change in the law.\n[ C or U ] a situation in which people or businesses want or need a particular thing: a call for/on sth Energy efficiency and conservation could lead to a reduced call for exports.no call for sth There is no call for such luxuries in the present economic climate. He was finding that there were a numbers of calls on his time in his new role.\n[ C ]\n&#160; STOCK MARKET a demand made by a company to shareholders for payment of money they owe for shares for which they have paid only part of the price: Shareholders received notice of a call of 40 cents per share on all partly paid-up shares.\nFINANCE a demand for money that is owed to be paid back: Your loan may contain a call provision if you fall behind on your payments. See also\ncash call\nmargin call\n[ C ]\n&#160; FINANCE\ncall option\nat/on call\nFINANCE, STOCK MARKET used to describe a loan that must be paid back immediately upon the request of the financial organization lending the money: Many banks have money market loans at call with discount houses.\nBANKING used to describe a bank account from which you can take money out when you ask for it: All our accounts are at-call accounts that require no minimum deposit or balance.\non call\nHR available to work when needed: He is on call round-the-clock two weeks each month."}