{"id":85554,"name":"callback","type":"noun","us_sound":"ˈkɑːl.bæk","us_link":"../audio/c/cdo1121uscall0751.mp3","uk_sound":"ˈkɔːl.bæk","uk_link":"../audio/c/cdo1121ukcall0787.mp3","content":"callback noun [C]\n(PHONE CALL)\nAdd to word list\nAdd to word list\na phone call made to someone who called you earlier: If you don't get through after a few attempts, send an email requesting a callback. I'm still awaiting a callback from technical support. They have no website and refuse to give consumers a callback number.\nMore examplesFewer examplesI spoke to someone in customer services, resulting in a callback from a manager about the problem.You can call us on this number or request a callback at a time convenient for you.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n3G\n4G\n5G\naeroplane mode\nairplane mode\narea code\nautodial\nbuzz\ncaller ID\ndialling tone\nDirectory Enquiries\noff the hook idiom\npick someone/something up\npocket dial\nprank call\nprank caller\nprepay\nroam\ntelecoms\ntelephone\nSee more results »\ncallback noun [C]\n(FOR JOB)\na request to come for another audition (= a short performance to try to get a job as an actor, etc.) or job interview (= a meeting in which you are asked questions to see if you are suitable for a job); the second audition or interview itself: I received a callback from my first audition! With no experience, I couldn't even get an interview, let alone a callback. When she went to the callback, there was only one other person there.\nMore examplesFewer examplesThey found that Black people were much less likely to receive a callback or a job offer than similarly qualified White people.She went to an open casting call, got a callback and got the part.About 20 people from the session will be selected to go to callbacks.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: casting, roles & scripts\ncallback noun [C]\n(REFERENCE)\nsomething that refers to or reminds you of something that happened in the past or earlier in a story: The new album is a definite callback to the style that made the keyboardist famous 30 years ago. This is one of my favourite TV callbacks: the song they dance to on their first date is the same one they play when they get married many seasons later.\nMore examplesFewer examplesThe callbacks to relationships established in earlier episodes make for a satisfying ending.It would be a great callback if we bring back the character with the same outfit and hair she had in season 1.So much that happened this summer feels like a callback to last year.\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nindirect speech\nquotably\nquote\nquote... unquote idiom\nrefer to someone/something\nreference\nreferent\nreferential\nreported speech\ntouch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemembering, reminding and reminders\ncallback noun [C]\n(IN COMPUTING)\ncomputing\n&#160; specialized a piece of code (= a computer instruction) that tells another piece of code to perform an action at a particular later time: If the callback raises an exception, go to the last step. a callback function/mechanism/method\nMore examplesFewer examplesIt is possible to directly access and receive a callback from an SMTP server to duplicate and capture e-mail messages. If a file is deleted outside of the FileSystem API, getFile() seems to error, which prevents the callback function from working.To avoid forcing application programmers to continually poll for data, some form of callback mechanism is required.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\ngarbage collector\ninstaller\nprogrammer\nspam filter\nspambot\nspeech recognition software\nspellchecker\nsplash screen\nspyware\nSee more results »\nAdd to word list\nAdd to word list\nHR a request for someone to return to a place, especially for a job interview: His job applications netted only three callbacks.\nCOMMUNICATIONS a phone call a person makes to someone who has called them earlier: Callers often forget to leave contact information for a callback.\nCOMMERCE\n&#160; (also recall) a request by a manufacturer for a product to be returned because something is wrong with it: There is a callback on all brands of the company's dog food.\nHR\n&#160; US a request by a company for an employee who has lost their job with the company to return to work: The company has not committed to how many workers will return, but the callbacks will continue in phases.\nHR a request by an employer for an employee to return to work after their usual working hours, especially to deal with an emergency: The department has just started the process of updating their emergency callback system."}