{"id":85812,"name":"calvinist","type":"adjective","us_sound":"ˈkæl.və.nɪst","us_link":"../audio/c/uscalif012.mp3","uk_sound":"ˈkæl.vɪ.nɪst","uk_link":"../audio/c/ukcalip024.mp3","content":"Add to word list\nAdd to word list\nrelating to the Christian teachings of John Calvin, especially the belief that God controls what happens on earth: Calvinist doctrine He was one of five sons born to a Calvinist preacher and his wife .\nhaving severe moral standards and considering pleasure to be wrong or not necessary: Her parents have very Calvinist attitudes. Driven by a deeply ingrained Calvinist work ethic, he is notorious for his hatred of holidays.\nMore examplesFewer examplesHe continued to spread Calvinist theology around Scotland, preaching from Edinburgh.She reached into her deep, Calvinist faith in a moment of crisis. US culture remains Calvinist in some form or other to this day.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\ndenominational\ndenominationally\necclesiastical\necumenical\necumenically\nLatinize\nLatinized\nLow Church\nLutheran\nMethodism\nPentecostalist\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nRelated word\nCalvinism\nsomeone who follows the Christian teachings of John Calvin, especially the belief that God controls what happens on earth: His parents were deeply religious Calvinists. He was born in Scotland in 1795 and brought up as a strict Calvinist.\nMore examplesFewer examplesHe was the child of extremely strict Dutch Calvinists who disapproved of \"trivial\" entertainments, like movies. In 1566, militant Calvinists smashed religious images in Catholic churches.\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\nEpiscopalian\nevangelist\nfakir\nFranciscan\nfundamentalist\nMohammedan\nMoonie\nmoral majority\nMormon\nMoslem\nSeventh-Day Adventist\nShia\nShiite\nSikh\nsisterhood\nSee more results »"}