{"id":85955,"name":"camelot","type":"noun","us_sound":"ˈkæm.ə.lɑːt","us_link":"../audio/c/cdo0319uscame0278.mp3","uk_sound":"ˈkæm.ə.lɒt","uk_link":"../audio/c/cdo0319ukcame0245.mp3","content":"Add to word list\nAdd to word list\nin legends (= traditional stories) about ancient Britain, the castle of King Arthur, and the knights who helped and advised him: The legend of Camelot, King Arthur and the Round Table has inspired writers all over the world.\na name used to refer to the White House when John F. Kennedy was president, the people who worked with him, and the feelings of hope and belief about what they could achieve: His ties to the Kennedy clan go back to the age of Camelot. He recalled the Camelot era of President John Kennedy and the civil rights movement.\na name for a place, time, or group of people, especially a country or government, when there is a lot of excitement, hope, and belief about what can be achieved: This early piece of Thai writing describes an ideal kingdom - a Camelot.\nMore examplesFewer examplesHe envisaged a multi-million-dollar movie about the myth of Camelot.His good looks bring back memories of President John F. Kennedy. Is it possible that we could once again experience Camelot?The influx of talent into the Bush White House is a Republican Camelot of sorts, a chance for a new generation of conservative intellectuals to put their theories into practice.The country's Camelot was unravelling; the judiciary, the press, the trade unions, which had all tasted freedom in the early years of the republic, had been shackled. The early months of the rendition programme, a CIA officer told Ms Mayer, was the \"Camelot of counterterrorism\".\nSMART Vocabulary: related words and phrases\nInternational relations: United States politics & government\nanti-Republican\nbattleground state\nbicameral\nblue state\ncaucus\nconfederacy\ngubernatorial\nhomeland security\nHouse Committee\nIndependence Day\njoint resolution\noverride\npentagon\nsecret service\nsecretary\nSecretary of State\nsenate\nsenator\nthe Articles of Confederation\nthe GOP\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExcitement, interest, energy and enthusiasm\nRepublics & kingdoms"}