{"id":86057,"name":"camouflage","type":"noun","us_sound":"ˈkæm.ə.flɑːʒ","us_link":"../audio/c/camouflage.mp3","uk_sound":"ˈkæm.ə.flɑːʒ","uk_link":"../audio/c/ukcambo017.mp3","content":"Add to word list\nAdd to word list\n[ U ] the use of leaves, branches, paints, and clothes for hiding soldiers or military equipment so that they cannot be seen against the area around them: a camouflage jacket\nandreafidone/iStock/Getty Images Plus/GettyImages\n[ S or U ] the way that the colour or shape of an animal or plant appears to mix with its natural environment to prevent it from being seen and attacked: The lizard's light brown skin acts as (a) camouflage in the desert sand.\nzahoor salmi/Moment/GettyImages\n[ S or U ] something that is meant to hide something, or behaviour that is intended to hide the truth: Using smoke as (a) camouflage, the army advanced up the hill. He believed that her kindness was merely a camouflage for her real intentions.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmilitary\nmufti\nparamilitary\npsych ops\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescriptions of animal (non-human) markings\nHiding and disguising\nto use leaves, branches, paints, or clothes to hide soldiers or military equipment so that they cannot be seen against the area around them: The troops had camouflaged themselves so effectively that the enemy didn't notice them approaching. The tent was camouflaged to avoid detection by infiltrating enemy soldiers.\n(of an animal or plant) to have a colour or shape that makes it appear to mix with its natural environment so that it cannot be seen or attacked: Often albino animals don't live long since they are unable to camouflage themselves. Textbooks use pictures of peppered moths camouflaged on tree trunks as evidence for natural selection.\nto hide something, or to hide the truth about something: He camouflaged the payments by listing them as \"building materials\". Some industries' losses are camouflaged by gains in other industries.\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflaged\ncloak\ndrown\nhole up (somewhere)\nillusion\nillusionistically\nillusively\nillusorily\nobscure\nsecrete\nshroud\nshut someone/something out\nsidle\nskulk\nsmokescreen\nstash\ntuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescriptions of animal (non-human) markings\nAdd to word list\nAdd to word list\na condition in which the appearance of someone or something when placed against a background makes the person or thing difficult or impossible to see: The leafhopper is a little green insect that uses camouflage to blend in with the colors of the leaves.\nIn military use, camouflage is an appearance designed to hide soldiers and equipment on the ground, esp. from being seen by enemy aircraft, by making them look like their surroundings.\nto hide soldiers and equipment on the ground from enemies by making them look like their surroundings: The guns are dug in and camouflaged. fig.Her quiet voice camouflages the fierce competitor within her."}