{"id":86068,"name":"camp","type":"noun","us_sound":"kæmp","us_link":"../audio/c/camp.mp3","uk_sound":"kæmp","uk_link":"../audio/c/ukcambo018.mp3","content":"camp noun\n(TENTS/BUILDINGS)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a place where people stay in tents or other temporary structures: We pitched/set up camp (= put up our tents) by the lakeside.\nphanasitti/iStock/Getty Images Plus/GettyImages\nB2 [ C ] an area where people are kept temporarily for a particular reason: a labour/prison/refugee camp\nB2 [ C or U ] a place where soldiers stay when they are training or fighting a war: an army camp\nMore examplesFewer examplesNight had fallen by the time we got back to the camp.an internment campa prisoner of war campThe play has its setting in a wartime prison camp.He shunts his kids off to a camp every summer.\nSMART Vocabulary: related words and phrases\nCamping\nbackpack\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\ntent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccommodating people\nPlaces involved in military activity\ncamp noun\n(OPINION)\n[ C, + sing/pl verb ] a group of people who share an opinion, especially a political one: The pro-independence camp are demanding a referendum. The party is divided into two distinct camps over the legislation.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nA2 [ I ] to put up a tent and stay in it for a short while, for example while on holiday: We camped on one of the lower slopes of the mountain.\n[ I or T ] mainly US (UK usually encamp) to put a group of tents or temporary shelters in one place, or to put someone in a group of tents or temporary shelters: Troops were camped only 25 miles from the capital.\nSMART Vocabulary: related words and phrases\nCamping\nbackpack\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\ntent\nSee more results »\nPhrasal verbs\ncamp it up\ncamp out\n(of a man) behaving and dressing in a way that some people think is typical of a gay man: What's the name of that amazingly camp actor with the high voice and a funny walk?\nusing bright colours, loud sounds, unusual behaviour, etc. in a humorous way: Their shows are always incredibly camp and flamboyant.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nstudiedly\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\nSee more results »\ncamp noun\n(TENTS/BUILDINGS)\nAdd to word list\nAdd to word list\n[ C/U ] a place where people stay in tents or other temporary structures: [ U ] We set up camp for the night near a stream.\n[ C/U ] A camp is also a place in the countryside organized for people, esp. children, to visit or live for a while to enjoy nature: [ C/U ] We sent our son away to (a) summer camp.\n[ C/U ] A camp is also a place where people, esp. military people, are trained, where military prisoners are kept, or where people have to live temporarily.\ncamp noun\n(GROUP)\n[ C ] a group of people who share an opinion, esp. a political one: Voters in the governor’s camp will believe whatever he says about the state budget.\ncamp verb [I]\n(STAY IN TENTS/BUILDINGS)\nto set up a tent or other temporary structure to give you shelter outside while you sleep or rest: We camped in a valley between the two mountains. We used to go camping out west when I was a child.\nPhrasal verb\ncamp out"}