{"id":86257,"name":"can","type":"modal verb","us_sound":"kæn","us_link":"../audio/c/can.mp3","uk_sound":"kæn","uk_link":"../audio/c/ukcamsh002.mp3","content":"can modal verb\n(ABILITY)\nAdd to word list\nAdd to word list\nA1 to be able to: Can you drive? She can speak four languages. Can you read that sign from this distance? The doctors are doing all that they can, but she's still not breathing properly. Do the best you can - I realize the circumstances are not ideal. If the party is awful, we can always leave (= that would be one possible solution to our problem). \"She's really furious about it.\" \"Can you blame her (= I'm not surprised)?\"\nThesaurus: synonyms, antonyms, and examples\nto be able to do somethingable toI wasn't able to work out what she was trying to say.canCan you make out what she is trying to say?be capable of (doing)You are capable of a lot more than you think you are.know how to\"Do you know how to swim?\" \"Of course I know how to swim.\"\nSee more results »\ncan do US informal\nused to say that you can and will do something: \"Will you mail this letter for me, please?\" \"Can do.\"\nSee more\nMore examplesFewer examplesI don't know how he can afford a new car on his salary.Cats can see in the dark.The water's not deep here - look, I can touch the bottom.I doubt whether I can finish the work on time.Computers can perform millions of calculations every second.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\ncan modal verb\n(PERMISSION)\nA1 to be allowed to: Can I use your bike, John? You can park over there. You can have a piece of cake after you've eaten your vegetables!\ninformal sometimes used to tell someone angrily to do something: If you carry on being horrible to your sister, Sophie, you can just go to bed!\nMore examplesFewer examplesIf you finish early you can go home.She can come whenever she likes, as far as I'm concerned.Finish up your dinner and you can have dessert.How early can you get off this afternoon?Anyone can go - you don't have to be invited.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving orders & commands\ncan modal verb\n(REQUEST)\nA1 used to request something: If you see Brett, can you tell him I'm in town next weekend? Can you make a little less noise, please? I'm trying to work.\nMore examplesFewer examplesI can't get the cork out of the bottle - can you try?Excuse me, can I just get past?It's freezing in here - can I close the window?Please can I have a go on your bike?Andrew, can you help me install this software?\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\ncan modal verb\n(POSSIBILITY)\nA2 used to express possibility: You can get stamps from the local newsagents. You can get very nasty skin diseases from bathing in dirty water. Smoking can cause cancer. Noise can be quite a problem when you're living in a flat. He can be really annoying at times (= he is sometimes very annoying).\nMore examplesFewer examplesCouples who are childless can feel excluded from the rest of society.Children can choke on peanuts.Clearance of a cheque can take up to a week.You can get travel concessions if you are under 26.Not making a will can have serious consequences for the people you might wish to benefit.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\ncan modal verb\n(OFFER)\nA1 used in polite offers of help: Can I help you with those bags? I'm afraid Ms Ferguson has already left the office. Can I be of any help?\nMore examplesFewer examplesIs there anything I can do to help?You can go instead of me, if you want.You look lost - can I help you?What a lot of bags! Can I carry something for you?\"If you like I can do some shopping for you.\" \"That's a very kind offer.\"\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\nmagic word\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon (me) idiom\nproblem\nsay\nthank you\nwelcome\nwonder\nwould\nyou're welcome idiom\nSee more results »\nGrammar\nCanCan comes first in the verb phrase (after the subject and before another verb): …\nCan, could or may: typical errorsCould in the present only expresses weak possibility. Can expresses strong possibility: …\nCan: formsCan comes first in the verb phrase (after the subject and before another verb): …\nCan: usesWe often use can to ask for or give permission: …\nCan: pastThe past of can is could: …\nCan: typical errorsWe write cannot as one word: …\nCan, could or may?When we talk about possibility, we use can, could and may, but they are different in meaning. …\nPossibilityWhen we talk about possibility, we use can, could and may, but they are different in meaning. …\nPermissionWe use can, could and may to ask for permission. We use can and may, but not could, to give permission. May is less common: …\nRequestsWhen we make requests, we can use can or could (but not may). Could is more polite than can: …\ncan noun\n(CONTAINER)\nA2 [ C ] (also tin can); (UK also tin) a closed metal container, especially cylinder-shaped, in which some types of drink and food are sold: a can of soup/beans\nMarielle, Bruno/GettyImages\n[ C ] (UK also tin) the amount of food or drink that is contained in a can: You'll need a can of tuna for this recipe.\n[ C ] (UK also tin) a metal container for liquids, usually with a lid and handle: a can of paint See also\ngarbage can\njerrycan\noilcan\ntrash can\nwatering can\nSMART Vocabulary: related words and phrases\nContainers for liquids and gases\naerosol\namphora\nbottle\nbucket\ncanister\nchurn\ngrowler\nhip flask\nhot-water bottle\nhottie\nhowler\noxygen tank\nsiphon\nsprayer\nsqueeze bottle\nstoup\nstubby\nThermos\ntin can\ntinnie\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements of volume: informal\ncan noun\n(HEADPHONES)\ncans [ plural ] slang\n→\nheadphones : I was wearing cans so I didn't hear anything.\nSee more\ncan noun\n(PRISON)\nthe can [ S ] US\ninformal for prison: He spent ten years in the can for armed robbery. He'd already spent five years in the can for money laundering. These are terrible people. I hope they get thrown in the can. So how long was she in the can for? As far as I know, she's still in the can.\nSMART Vocabulary: related words and phrases\nPrisons & parts of prisons\napproved school\nBastille\nboot camp\nborstal\nbrig\nclink\ngaol\ngaoler\nhalfway house\nHMP\nopen prison\npanopticon\npenal colony\npenitentiary\nprison\nstraightjacket\nstraitjacket\nthe gulag\nwarder\nyoung offender institution\nSee more results »\ncan noun\n(TOILET)\nthe can US\ninformal for toilet: \"Where's Mike?\" \"He's in the can.\" How long has Dad been in the can? Wait right here - I've got to go to the can. When he get out of the can, can you tell him I need to speak to him? Where's the can? He's been in the can for, like, twenty minutes.\nSMART Vocabulary: related words and phrases\nParts of buildings: the toilet\nbathroom\nbedpan\nbog\nchamber pot\ncistern\ncloakroom\nflushable\ngent\nhoney bucket\njohn\nladies phrase\nlatrine\nlitter\npotty\npotty chair\npowder room\nprivy\npublic convenience\nWC\nwomen's room\nSee more results »\nIdioms\ncan of worms\nin the can\ncan verb [T]\n(FOOD)\nto put food and drink into a closed metal container without air: He works in a factory where they can fruit.\nSMART Vocabulary: related words and phrases\nPreserving & storing food\naluminium foil\nbeeswax wrap\nbin\nbiscuit tin\nbread basket\ndefrost\nflash-freeze\nfoil\nfood technology\nfreeze-dried\npickling\nplastic wrap\npotted\npreserving\nprocessed\nTupperware\nultra-pasteurized\nultra-processed\nunrefrigerated\nunsulphured\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIndustrial processing\ncan verb [T]\n(STOP)\nmainly US informal to stop doing something or making noise: Hey, can it, would you? I'm trying to sleep.\nThesaurus: synonyms, antonyms, and examples\nto end something or cause it to endstopStop pulling your brother's hair this instant!quitQuit poking your sister, will you?haltWe halted the assembly line to check the equipment.discontinueThe lab has discontinued this line of research due to ethical concerns.ceaseAll operations at the company will cease, and the assets will be auctioned off.\nSee more results »\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\ncan noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\na metal container, esp. a closed, cylindrical container in which food and drink are packaged: a gas/watering can The vending machine has soda in cans.\nA can is also the amount of food or drink that a can holds: I had a can of soup for lunch.\ncan verb [T]\n(CONTAIN)\nto preserve food by putting it into a can or into a jar (= glass container) from which the air is removed: They can all kinds of fruit.\nslang If you get canned, you are dismissed from your job: No, I’m not on vacation – I got canned last week.\ncan modal verb\n(ABLE)\nto be able to: She can speak four languages. We’re doing the best we can, but we won’t make our deadline.\ncan modal verb\n(PERMIT)\nto be allowed or to have permission: You can park on the street. You can do it by yourself.\nCan is also used to request something: Can you help me lift this box? Can I have a tissue, please? Note: Can is usually used in standard spoken English when asking for permission. It is acceptable in most forms of written English, although in very formal writing, such as official instructions, may is often used instead: Persons under 14 unaccompanied by an adult may not enter.\ncan modal verb\n(BE POSSIBLE)\nused to express possibility in the present: You can get stamps at the post office.\ncan modal verb\n(OFFER)\nused in polite offers of help or by someone who provides service, as in a store: Can I help you with those bags?\nAdd to word list\nAdd to word list\nPRODUCTION to put food or drink into a closed metal container to preserve it: canned dog foods.\nHR\n&#160; US informal to remove someone from their job: After becoming partner in May of last year, she was canned five months later."}