{"id":86342,"name":"canary","type":"noun","us_sound":"kəˈner.i","us_link":"../audio/c/canary.mp3","uk_sound":"kəˈneə.ri","uk_link":"../audio/c/ukcamsh008.mp3","content":"Add to word list\nAdd to word list\n[ C ] a small, yellow bird that is well known for its singing, sometimes kept as a pet: She had a canary in a birdcage.\nJuTi/iStock/Getty Images Plus/GettyImages\n[ U ] (also canary yellow [ C or U ]) a bright yellow colour: I don't know what compelled me to buy a blazer in a shocking shade of canary. This stylish toaster is available in in mint green, canary yellow, and lavender blue. Hot pinks, canary yellows, lime greens and electric blues give a jaunty air to his art.\nMore examplesFewer examplesThere were parrots and canaries in cages, singing loudly.In the street market you'll find pet canaries, rabbits, flowers, plants, postcards and books.The phone comes in a host of ultra-bright shades including Electric Lime, Azure and Canary. The eye shadow is available in every imaginable shade from pea green to canary yellow.\nSMART Vocabulary: related words and phrases\nBirds commonly kept as pets\nbudgie\ncockatoo\ngalah\nhoming pigeon\nIndian mynah\nlorikeet\nmacaw\nmynah\nparakeet\nparrot\npigeon\nracing pigeon\nrosella\nsulphur-crested cockatoo\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nIdioms\ncanary in a coalmine\nsing like a canary\n(also canary yellow) bright yellow in colour: All anyone remembers about my performance is that I wore a canary jacket. The butterfly is bright yellow, almost a canary shade. She drove up in a canary yellow sportscar.\nMore examplesFewer examplesI don't want my hair to go that canary colour.I got a new bicycle, and it was canary yellow.Terry wore white jeans, a crisp white shirt and a canary yellow V-necked sweater. Wonderful canary yellow crocuses are in bloom outside.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ndun\nearth tone\nemerald\npeach\npuce\nsaffron\nsanguine\nsapphire\nsepia\nsky blue\nslaty\ntangerine\ntaupe\ntea rose\nverdure\nSee more results »\nAdd to word list\nAdd to word list\na small, yellow bird, popular as a pet in a cage"}