{"id":86388,"name":"cancer","type":"noun","us_sound":"ˈkæn.sɚ","us_link":"../audio/c/cancer.mp3","uk_sound":"ˈkæn.sər","uk_link":"../audio/c/ukcamsh013.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] a serious disease that is caused when cells in the body grow in a way that is uncontrolled and not normal, killing normal cells and often causing death: He died of liver cancer. cancer of the cervix/stomach breast/bowel/lung cancer cancer cells a cancer patient It was a secondary cancer. See also\ncarcinogen\n[ C ] a harmful activity that spreads quickly: Drug abuse is a cancer that is destroying our society.\nMore examplesFewer examplesThere's still no cure for cancer.This new drug could be an important step in the fight against cancer.Early detection of the cancer improves the chances of successful treatment.He died last week after a long fight with cancer.The survival rate for people who have this form of cancer is now more than 90%.\nSMART Vocabulary: related words and phrases\nCancer\nacinic cell carcinoma\nacral lentiginous melanoma\naggressive\naggressively\naggressiveness\nbenignant\nbilateral acoustic neurofibromatosis\nbilateral acoustic schwannoma\nbrachytherapy\nbrain tumour\ninoperable\nlymphoma\nmalignantly\nmeningioma\nmetastasis\nmetastatic\nprecancerous\nSCC\nWaldenstrom macroglobulinaemia\nWilms' tumour\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult things and people\nRelated word\ncancerous\na constellation (= group of stars) said to look like a crab (= a sea creature with five pairs of legs and a hard shell): Praesepe is a faint cluster of stars in the constellation of Cancer.\n[ C or U ] the fourth sign of the zodiac, relating to the period from 22 June to 22 July and represented by a crab, or a person born during this period: If your birthday is July 10 then your zodiac sign is Cancer. My sister is a Cancer.\nMore examplesFewer examplesAstronomers have discovered a fifth planet orbiting a star in the constellation Cancer.You can spot Venus near the star cluster in Cancer.Both players were born under the star sign of Cancer.\nSMART Vocabulary: related words and phrases\nAstronomy\nalbedo\nAndromeda\nAquarius\nAries\nasteroid\ngalactic\ngalaxy\nGemini\ngeostationary orbit\ngibbous\nnova\nobservatory\norbit\norbital\nOrion\nstellar\nsubstellar\nsunspot\nsupergiant\nsupermassive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSigns of the zodiac\ncancer noun [C/U]\n(DISEASE)\nAdd to word list\nAdd to word list\na disease in which cells in the body grow without control, or a serious medical condition caused by this disease: [ U ] He died from cancer of the stomach. cancerous adjective us\nYour browser doesn't support HTML5 audio\n/ˈkæn·sər·əs/\nSurgeons removed a cancerous growth from her lung.\nthe fourth sign of the zodiac, covering the period June 22 to July 22 and represented by a crab, or a person born during this period"}