{"id":86727,"name":"cannon","type":"noun","us_sound":"ˈkæn.ən","us_link":"../audio/c/cannon.mp3","uk_sound":"ˈkæn.ən","uk_link":"../audio/c/ukcandy017.mp3","content":"cannon noun [C]\n(GUN)\nAdd to word list\nAdd to word list\nplural cannons or or cannon a large, powerful gun, usually attached to two or four wheels, that was used in the past to fire heavy stone or metal balls: The 5,000-pound cannon predates the Civil War. The cannon were positioned on the field of battle.\nPhotitos2016/iStock/Getty Images Plus/GettyImages\nplural cannons or or cannon a gun fastened to an aircraft: A burst of fire was discharged by the jet's 20mm cannon.\nMore examplesFewer examplesThey could hear the peal of bells and the roar of cannon. The U. S., Jefferson felt, was safe from Napoleon's cannons and muskets.A shell shot out of the cannon and whizzed through the sky.If anything looked suspicious, they did not hesitate to blow it up with a grenade, a cannon or the main gun of a tank.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\ncannonade\ncannonball\ncock\nconcealed carry idiom\ndischarge\ngo off\ngunpoint\ngunsmith\nkick\nmachine gun\nmortar\nplug\npot\nsalvo\nsemiautomatic\nshoot something down\nshoot up\nshooter\nsniper\nSee more results »\ncannon noun [C]\n(HIT)\nUK (US carom) in snooker or billiards, an occasion when the ball hits two other balls one after the other: In snooker, a cannon can be used to improve your position.\nMore examplesFewer examplesA cannon in English billiards has a scoring value of 2 points.\nSMART Vocabulary: related words and phrases\nSnooker, pool & billiards\nbaize\nbilliard\nbilliard ball\nbreak\nbreak (something) off\ncarom\ncue\ncue ball\nframe\nmiscue\npocket\npool\npot\nrack\nre-rack\nre-spot\nsnooker\nsnooker ball\ntriangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\n[ I usually + adv/prep ] mainly UK to knock or hit against someone or something forcefully and suddenly, usually at an angle: I was rushing along the corridor when I cannoned into someone coming out of a side door.\n[ I usually + adv/prep ] UK (US carom) to hit someone or something and bounce back at an angle: The ball cannoned off the defender's shins and into the net.\n[ I or T ] UK (US carom) in snooker or billiards, to cause the ball to hit two other balls one after the other: He cannoned the cue ball off one red into another. If the player strikes the opponent's ball, cannons onto the red ball and then goes in off it, 4 points are scored.\nMore examplesFewer examplesBecause she wasn't looking where she was going, she almost cannoned into another girl.Their car cannoned off the kerb, tyres squealing.He beat the goalkeeper only to see the ball cannon back off the post.The cue ball cannoned in off a yellow.What do you call a shot where you intentionally cannon the cue ball off of one red into another red so that the second red goes into a pocket?\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\nbump\ncarom\ncatch\ncollision\ncrash\nhead-on\njog\nplough into something/someone\npost-crash\nrun (something) into something/someone\nrun someone/something down\nscuff\nslam\nsmash something up\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBouncing\nSnooker, pool & billiards\nAdd to word list\nAdd to word list\na large, powerful gun fixed onto a ship or onto a structure on land"}