{"id":86803,"name":"canonized","type":"verb","us_sound":"ˈkæn.ə.naɪz","us_link":"../audio/c/uscanad030.mp3","uk_sound":"ˈkæn.ə.naɪz","uk_link":"../audio/c/ukcandy027.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncanonize\ncanonize verb [T]\n(WORSHIP)\n(in the Roman Catholic Church) to announce officially that a dead person is a saint: In Guatemala, the pope canonized Pedro de San Jose de Betancurt, Central America's first saint. Joan of Arc was eventually canonized in 1920. Many would like to see him canonized (as) a saint.\nto praise and admire someone very much, especially in a way that is too much or that they do not deserve: The rebel leader was canonized by left-wingers in the late 1960s. Although many denounced him, the press canonized him as a new \"American hero\". He was history's most canonized basketball player.\nMore examplesFewer examplesMargaret was a deeply pious woman who was subsequently canonized.Pope John Paul II canonized Juan Diego, the 16th-century Aztec whose vision of the Virgin Mary helped spread Catholicism to Mexico.Rather than canonize him for the strength and dignity he displayed in his dying days, I prefer to remember him when he was in his prime.Selfless fathers and father figures are being celebrated, even canonized, on America's movie screens.\nSMART Vocabulary: related words and phrases\nReligious ceremonies & prayers\nalleluia\namen\nanoint\nanointed\nanointment\ncommunion\nconfirm\nconfirmation\nconsecrate\nconsecration\nlitany\nliturgical\nliturgically\nliturgy\nthanksgiving\nthe Lord's Prayer\nunchristened\nunction\nunprogrammed\nvespers\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPraising and applauding\ncanonize verb [T]\n(OFFICIALLY APPROVE)\nto accept something as belonging to a canon (= an official list) of respected works, ideas, etc.: This view is based on the conception that the main function of criticism is to define and canonize the genuine classics of literature.\nreligion\n&#160; specialized in Christianity, to officially approve something according to religious authority: The convention stunned the Church by canonizing the ordination of women.\nMore examplesFewer examplesTime and again, Freud would settle on a position only to reverse or enlarge the theory just as his advocates began to canonize it. The Bible is always interpreted within the context of Holy Tradition, which gave birth to it and canonized it.\nSMART Vocabulary: related words and phrases\nApproving & approval\naccepting\naffirmation\napprobate\napprobation\napproval\nbe here for someone idiom\nblessing\nbody positive\ncountenance\nhere\nnice\nnice one! idiom\nrelegitimize\nroyal assent\nseal\nseal of approval idiom\nself-affirmation\nthumb\nvote\nvote something up or down idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiterature\nRelated word\ncanonization"}