{"id":86776,"name":"canonical","type":"adjective","us_sound":"kəˈnɑː.nɪ.kəl","us_link":"../audio/c/uscanad029.mp3","uk_sound":"kəˈnɒn.ɪ.kəl","uk_link":"../audio/c/ukcandy026.mp3","content":"canonical adjective\n(IN RELIGION)\nAdd to word list\nAdd to word list\nreligion\n&#160; formal or specialized related to or according to a rule, principle, or law, especially in the Christian Church: a canonical rule The Pope indicated that he would not consider any applications for canonical pardon.\nMore examplesFewer examplesThe canonical excommunication of the bishops for their illegal ordinations was considered.The infallibility of the canonical scriptures rested on the authority of councils and church tradition. The canonical implications are not clear.In Roman Catholicism, is there any canonic difference between a delegate and a commissary?\nSMART Vocabulary: related words and phrases\nReligious beliefs & atheistic beliefs\nagnostic\nagnosticism\nAnglicanism\nanimist\nanti-Catholic\nanti-Catholicism\nheresy\nheretical\nheretically\nhumanistic\nhumanistically\nideologically\nmysticism\northodoxy\nreligiously\ntheodicy\ntheologically\nthis-worldly\ntransmigration\nunbelieving\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRules & laws\ncanonical adjective\n(OF ARTIST, WORK)\nconsidered to be among the best and most important, and worth studying: The space will allow canonical works by these artists to be always on view. the canonical writers of American literature His reworked version of the score became the canonic version.\nrelating to the book, TV show, film, etc. that its fans like and base their own stories, activities, etc. on: Some ideas in fandom deviate a long way from the canonical material. Canonical works are those that are considered authoritative by the fan community. Related word\ncanon\nMore examplesFewer examplesI think Hemingway is easily the most overrated canonical writer in history. This is the canonical text on film criticism.Goethe is thought of as a canonical figure of Western culture.They study canonical films of all genres.Notre Dame du Haut is one of Le Corbusier's most canonical works.He combines research into highly obscure aspects of opera with reflections on such canonic works as Die Zauberflöte.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfiction\nfictionality\nfictionally\nfictive\nfictively\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nnonsense verse\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe visual arts in general\nCinema - general words\nWriting, reading & studying music\nAdmirable and admired"}