{"id":87004,"name":"canvas","type":"noun","us_sound":"ˈkæn.vəs","us_link":"../audio/c/canvas.mp3","uk_sound":"ˈkæn.vəs","uk_link":"../audio/c/ukcant_011.mp3","content":"Add to word list\nAdd to word list\n[ U ] strong, rough cloth used for making tents, sails, bags, strong clothes, etc.\nAndy Crawford/Dorling Kindersley/GettyImages\n[ C ] a piece of this cloth used by artists for painting on, usually with oil paints, or the painting itself: These two canvases by Hockney would sell for £1,500,000.\nadamkaz/E+/GettyImages under canvas\nin a tent: I love sleeping under canvas.\nSee more the canvas\nin boxing and wrestling, the floor of the ring (= the area where fighters compete): He hit the canvas for the second time from a right hook. The Mexican attempted to get up off the canvas but the fight was stopped.\nMore examplesFewer examplesA left hook spun Jones round and sent him crashing to the canvas. The young boxer was knocked to the canvas in his debut bout.\n[ C ] in the sport of rowing (= making a boat move through water by pushing against the water with poles with flat ends), the covered part at the front of the boat, used as a way of measuring how far a boat is in front of another one: The Swiss team had pulled a canvas in front at the halfway point. It was a close race all the way but the French eight won by a canvas.\nSMART Vocabulary: related words and phrases\nTextiles made from natural fibres\nbamboo\nbombazine\nburlap\ncalico\ncambric\ndistaff\nfaille\nfelt\nfishnet\nflannelette\nnankeen\nneedlecord\nnetting\noilskin\norgandie\nterry\nticking\ntowelling\ntulle\ntweed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPainting & drawing materials\nPictures\nFighting sports\nSurfaces on which sports take place\nRowing\nAdd to word list\nAdd to word list\nstrong, rough cloth made from cotton or other fibers, used for making tents, sails, strong bags, or work clothes\nCanvas is also the cloth artists paint on, or such a painting itself: [ C ] Two valuable canvases hung in the room."}