{"id":87065,"name":"capacity","type":"noun","us_sound":"kəˈpæs.ə.t̬i","us_link":"../audio/c/eus70693.mp3","uk_sound":"kəˈpæs.ə.ti","uk_link":"../audio/c/ukcant_021.mp3","content":"capacity noun\n(AMOUNT)\nAdd to word list\nAdd to word list\nB2 [ U or C ] the total amount that can be contained or produced: The stadium has a seating capacity of 50,000. The game was watched by a capacity crowd/audience of 50,000 (= the place was completely full). The generators each have a capacity of (= can produce) 1,000 kilowatts. The larger cars have bigger capacity engines (= the engines are bigger and more powerful). All our factories are working at (full) capacity (= are producing goods as fast as possible). We are running below capacity (= not producing as many goods as we are able to) because of cancelled orders.\nMore examplesFewer examplesThe last five years have seen a huge increase in the country's export capacity.The company has expanded its premises with a new 10,000 sq ft factory and plans to double capacity.They are trying to operate beyond the capacity of the airport.\nSMART Vocabulary: related words and phrases\nMeasurements of volume\ncentilitre\ncl\ncubic\ndecilitre\ndl\nfl.\ngal\ngallon\nheaped\nheaping\nlitre\nmeasure\nmillilitre\nml\npint\npt\nqt\nquart\nteaspoon\ntin\nSee more results »\ncapacity noun\n(ability)\n[ S ] someone's ability to do a particular thing: She has a great capacity for hard work. [ + to infinitive ] It seems to be beyond his capacity to follow simple instructions. Do you think it's within his capacity to do the job without making a mess of it? He suffered a stroke in 2008, which left him unable to speak, but his mental capacity wasn't affected. Synonyms\nability\ncapability (ABILITY)\npowers\nMore examplesFewer examplesShe had an immense capacity for love.He lacked the capacity to listen.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nwhat someone is (really) made of idiom\nwheelhouse\nwizardry\nworkmanship\nSee more results »\ncapacity noun\n(POSITION)\nC1 [ S ] formal a particular position or job: She guides tourists at the Martin Luther King Jr. Birth Home in her capacity as a National Park Service ranger. She was speaking in her capacity as a novelist, rather than as a television presenter.\ncapacity noun [C/U]\n(AMOUNT)\nAdd to word list\nAdd to word list\nthe amount that can be held or produced by something: [ C ] The stadium has a seating capacity of 50,000. [ U ] The theater was full to capacity that night.\ncapacity noun [C/U]\n(ABILITY)\n[ C ] the ability to do something in particular: He has an enormous capacity for work.\ncapacity noun [C/U]\n(POSITION)\n[ C ] a particular position or job; a role: She was speaking in her capacity as a judge.\nAdd to word list\nAdd to word list\n[ S or U ] the total amount or number of things or people that something can hold: a capacity of sth The tanks have a capacity of 1000 litres.capacity audience/crowd The rally drew a capacity crowd of 15,000 people (= the place, which held 15,000 people, was completely full). See also\ndeadweight (carrying) capacity\n[ S or U ]\n&#160; PRODUCTION the total amount of something that can be produced: cut/expand/increase capacity They aim to expand capacity by 3 million barrels a day. All our factories are now working at full capacity. See also\nexcess capacity\nspare capacity\n[ S or U ] the ability of a person or organization to do something: capacity to do sth \"Every industry has the capacity to go green,\" he says.capacity for sth Most people have little capacity for creativity in solving problems at work. See also\nlegal capacity\n[ S ]\n&#160; WORKPLACE a particular position or job: sb's capacity as sth In her capacity as portfolio manager, she has primary responsibility for making day-to-day investment decisions. He attends Board meetings in an advisory capacity."}