{"id":87190,"name":"capitalism","type":"noun","us_sound":"ˈkæp.ə.t̬əl.ɪ.zəm","us_link":"../audio/c/capitalism.mp3","uk_sound":"ˈkæp.ɪ.təl.ɪ.zəm","uk_link":"../audio/c/ukcant_028.mp3","content":"Add to word list\nAdd to word list\nC2 an economic and political system in which property, business, and industry are controlled by private owners rather than by the state, with the purpose of making a profit: The former communist embraced capitalism and started his own company. She wrote that capitalism was devastating the environment. Their form of conservatism stresses limited government, free-market capitalism and personal responsibility. Compare\ncommunism\nsocialism\nMore examplesFewer examplesHe claimed that his party offered a \"Third Way\" between capitalism and socialism.The paper showed a picture of homeless people sleeping on the streets with the caption underneath \"the unacceptable face of capitalism\".She spoke with passion against the evils of capitalism.With capitalism, people are motivated by the idea of personal profit and success.He is fiercely left-wing and always protesting about the dire effects of capitalism and globalization.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government an economic system based on private ownership of property and business, with the goal of making the greatest possible profits for the owners capitalist adjective us\nYour browser doesn't support HTML5 audio\n/ˈkæp·ɪ·t̬əl·ɪst/ (also capitalistic, us/ˌkæp·ɪ·t̬əlˈɪs·tɪk/)\nThe US has a capitalist economy. capitalist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈkæp·ɪ·t̬əl·ɪst/\nAnyone can be a capitalist.\nAdd to word list\nAdd to word list\nECONOMICS, POLITICS the economic, political, and social system that is based on property, business, and industry being privately owned, and is directed towards making the greatest possible profits for private people and organizations: Under capitalism, people are motivated by the idea of personal profit and success. The treaty was an attempt to strike a balance between free-market capitalism and the protection of the global environment. See also\ncrony capitalism\npopular capitalism\nstate capitalismCompare\ncommunism"}