{"id":87191,"name":"capitalist","type":"noun","us_sound":"ˈkæp.ə.t̬əl.ɪst","us_link":"../audio/c/capitalist.mp3","uk_sound":"ˈkæp.ɪ.təl.ɪst","uk_link":"../audio/c/ukcant_029.mp3","content":"Add to word list\nAdd to word list\nsomeone who supports capitalism (= an economic and political system in which property, business, and industry are controlled by private owners rather than by the state, with the purpose of making a profit): He describes himself as a \"former socialist and reluctant capitalist\".\nsomeone who has a large amount of money invested (= given hoping to get more back) in business: Many of these capitalists have been able to benefit from privatization. See also\nventure capitalist\nMore examplesFewer examplesI'm a capitalist, but I believe it would be right for the city to subsidize high-speed internet access.The former communist party now welcomes capitalists.He argues that the interests of capitalists do not necessarily coincide with the interests of society as a whole.High interest rates are good for capitalists as they allow them to accumulate wealth.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRich people\nC2 based on the system of capitalism (= an economic and political system in which property, business, and industry are controlled by private owners rather than by the state, with the purpose of making a profit): a capitalist economy/country She writes that the capitalist system has never worked for the poor. See also\nanti-capitalist\nnon-capitalist\npost-capitalist\npre-capitalist\nMore examplesFewer examplesA liberal capitalist society offers more freedom for the business of making money.In post-war America and other capitalist nations, government-controlled industries were usually restored to private ownership.To share wealth equally is not the way of a capitalistic society.He was very critical of capitalistic Western societies.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratically\ndemocratization\ndemocratize\ndespotic\ndespotically\nkleptocratic\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\npolice state\npost-apartheid\npre-fascist\npure democracy\nregime\nSee more results »\nAdd to word list\nAdd to word list\nPOLITICS a person who supports capitalism: He is broadly perceived as a free-market capitalist.\nECONOMICS a person who invests large amounts of money in a business or businesses: What is profitable for the individual capitalist may not be beneficial for the system as a whole. See also\nventure capitalist\nECONOMICS, POLITICS based on the system of capitalism: Competition, free enterprise, and profit are the values at the heart of the global capitalist system. a capitalist society/democracy/economy a capitalist country/nation/state"}