{"id":87181,"name":"capital","type":"noun","us_sound":"ˈkæp.ə.t̬əl","us_link":"../audio/c/capital.mp3","uk_sound":"ˈkæp.ɪ.təl","uk_link":"../audio/c/ukcant_027.mp3","content":"capital noun\n(CITY)\nAdd to word list\nAdd to word list\nA2 [ C ] a city that is the centre of government of a country or smaller political area: Australia's capital city is Canberra.\n[ C ] the most important place for a particular business or activity: London used to be the financial capital of the world.\nMore examplesFewer examplesIn defiance of the ceasefire, rebel troops are again firing on the capital.Fighting around the capital has intensified in the last few hours.More people live in the capital than in the whole of the rest of the country.There is strong support here for the tough economic reforms ordained in the federal capital, Prague.\nSMART Vocabulary: related words and phrases\nTowns & regions: towns, cities & villages (general)\naerotropolis\nanti-city\nanti-urban\nbackwater\nCantabrigian\ncentral city\ncivic\nconurbation\ndormitory town\ngarden city\nmetro\nmunicipal\nnative place\nnon-municipal\nopen city\nretirement community\nretirement village\nsmall-town\nsmoke\nurbanite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlaces and locations\ncapital noun\n(LETTER)\nA2 [ C ] (also capital letter) a letter of the alphabet in the form and larger size that is used at the beginning of sentences and names: Please print your name in capitals. A proper noun should start with a capital.\nEskay Lim/EyeEm/GettyImages\nMore examplesFewer examplesNames always start with capitals.If you write your emails in capitals, it looks as though you are shouting.The company's trademark is written in capitals.If the text is in capitals, it is difficult to read.For some reason, she always writes in capitals.It's considered rude to use capital letters in an email because it looks like YOU ARE SHOUTING.The poet e. e. cummings wrote his name with small letters, not capital letters.Don't forget to put a capital letter on a proper name, like the name of a place or person.Every sentence should begin with a capital letter.Romantic, written with a capital letter, refers to a specific movement in art and literature.\nSMART Vocabulary: related words and phrases\nLettering & alphabets\nall caps\nalphabet\nalphabetical\nalphabetically\nascender\nBraillist\ncamel case\nhieroglyph\nideogram\nIPA\nLatinize\nLatinized\nmulti-character\nnon-phonetic\nnotation\npaleographical\nroman\nsentence case\nstenography\ntitle case\nSee more results »\ncapital noun\n(MONEY)\n[ U ] money and possessions, especially a large amount of money used for producing more wealth or for starting a new business: She leaves her capital untouched in the bank and lives off the interest. We put $20,000 capital into the business, but we're unlikely to see any return for a few years.\nMore examplesFewer examplesThe central bank has announced controls on capital outflows.I want to start my own business if I can raise the capital.We're only a small business and don't have the capital to compete with the big boys.They'll need to raise £1 million in venture capital if they're to get the business off the ground.She leaves her capital untouched in the bank and lives off the interest.\nSMART Vocabulary: related words and phrases\nAccounting\naccountancy\naccountant\naccounting\naccounts\nauditor\nbad debt\nbalance\nbalance sheet\nbudget\ncreative accounting\ndouble entry bookkeeping\nexpense account\nfalse accounting\nforensic accountant\nforensic accounting\nloss\ntreasurer\nunaudited\nunreconciled\nwrite something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInterest & capital\nAmounts of money\ncapital noun\n(COLUMN)\n[ C ]\n&#160; architecture\n&#160; specialized the top part of a column\nSMART Vocabulary: related words and phrases\nParts of buildings: arches, columns & beams\nabutment\narch\narchitrave\narchway\nbeam\nbeamy\ncolonnade\nCorinthian\nDoric\nionic\njoist\nkeystone\nplinth\nportico\nsoffit\ntorus\ntruss\nvault\nvaulted\nSee more results »\nGrammar\nPunctuationThe most common punctuation marks in English are: capital letters and full stops, question marks, commas, colons and semi-colons, exclamation marks and quotation marks. …\nPunctuation: capital letters (B, D) and full stops (.)We use capital letters to mark the beginning of a sentence and we use full stops to mark the end of a sentence: …\nIdiom\nmake capital out of something\ncapital adjective\n(LETTER)\n(of a letter of the alphabet) in the form and larger size that is used at the beginning of sentences and names: Do you write \"calvinist\" with a capital \"C\" or not?\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\nbracket\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\ntilde\nunbracketed\nuncapitalized\nSee more results »\ncapital adjective\n(CRIME)\n(of a crime) that can be punished by death; (of a case) involving a crime that can be punished by death: In some countries, importing drugs is a capital offence. She could face charges of treason, a capital crime. As a prosecutor she tried over 800 cases, including capital cases. See also\ncapital punishment\nMore examplesFewer examplesHe was told he would be charged with rape, which in that country is a capital offence.He was convicted of capital murder.At that time, people found guilty of capital crimes died by hanging.The committee will study the impact of race, religion, gender, and other factors in capital cases.She was accused of perjury in a capital trial.\nSMART Vocabulary: related words and phrases\nDeath penalties\nbehead\nboots on the ground idiom\ncapital punishment\nchair\ncondemn\ncondemn someone to (do) something\ncrucify\ndeath sentence\ndeath warrant\ndecapitate\ndecapitation\nelectrocute\nfiring squad\ngas chamber\ngibbet\nguillotine\nhang\nhanging\nstake\nthe electric chair\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\ncapital adjective\n(EXCELLENT)\nUK old-fashioned very good or excellent: That's a capital idea!\nThesaurus: synonyms, antonyms, and examples\nextremely pleasant, enjoyable, or likableexcellentThe food was excellent, thank you.wonderfulHave a wonderful trip!terrificThat's such terrific news, congratulations!fabulousI love her dress, it's fabulous.greatThe film was great.\nSee more results »\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nIdiom\nwith a capital A, B, etc.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; grammar\n&#160; (also capital letter) a form of a letter used to begin sentences and names of people, places, and organizations: THIS SENTENCE IS PRINTED IN CAPITALS/CAPITAL LETTERS.\ncapital noun\n(CITY)\n[ C ]\n&#160; politics &amp; government a city which is the center of government for a country or other political area\ncapital noun\n(MONEY)\n[ U ] wealth, esp. money used to produce more wealth through investment or a new business: She invested well, and can live on the interest without touching the capital.\ncapitalization noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌkæp·ɪ·t̬əl·əˈzeɪ·ʃən/\nRules of capitalization vary from language to language. capitalize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkæp·ɪ·t̬əlˌɑɪz/\nThe names of streets are always capitalized.\ncapital adjective [not gradable]\n(OF DEATH)\n(of a crime) that can be punished by death: a capital offense\nAdd to word list\nAdd to word list\n[ U ]\n&#160; FINANCE, ECONOMICS money that is used for investment or for starting a business: attract/borrow/raise capital Low-tax policies are used by some countries to attract capital.invest/inject capital The UK parent company decided not to inject further capital into the failing business. foreign/private capital Investors are finding that there has been a satisfactory return on capital.\n[ U ]\n&#160; ACCOUNTING, FINANCE the total amount of money and property that an individual or company owns: tie up/release capital Most of our capital is tied up in property.\n[ U ]\n&#160; FINANCE, ECONOMICS money that is lent or borrowed and will have to be paid back: Our mortgage is interest-only, so we're not paying off any of the capital.\n[ U ]\n&#160; ECONOMICS, POLITICS people who own the businesses, land, industries, and other forms of wealth in society, considered as a group: There's a real conflict arising between the demands of capital and labour.\n[ C ] (also capital city) the city where a country or state has its central government: What's the capital of China? See also\nauthorized share capital\ncalled-up share capital\ncirculating capital\ncore capital\ncost of capital\ncustomer capital\ndebt capital\nequity capital\nfixed capital\nflight capital\nView all\nhuman capital\nintellectual capital\nknowledge capital\nloan capital\nnominal capital\noperating capital\nordinary capital\npaid-in capital\npreference capital\npreferred capital\nreturn on capital\nrisk capital\nshare capital\nsocial capital\nTier 2 capital\nuncalled capital\nventure capital\nworking capital"}