{"id":87517,"name":"capture","type":"verb","us_sound":"ˈkæp.tʃɚ","us_link":"../audio/c/capture.mp3","uk_sound":"ˈkæp.tʃər","uk_link":"../audio/c/ukcapit026.mp3","content":"capture verb [T]\n(CATCH)\nAdd to word list\nAdd to word list\nB2 to take someone as a prisoner, or to take something into your possession, especially by force: Two of the soldiers were killed and the rest were captured. Rebel forces captured the city after a week-long battle.\nThesaurus: synonyms, antonyms, and examples\nto find and take a person who has done something wrongcatchThey were caught trying to smuggle cigarettes across the border.arrestHe was arrested on suspicion of causing criminal damage to property.place/put under arrestThe suspect was placed under arrest and charged with armed assault.captureThe soldiers were captured by enemy forces.apprehendThe police have apprehended two individuals in connection with the crime.nabThe cops nabbed him as he tried to get away.\nSee more results »\nto succeed in getting something when you are competing with other people: The Democratic Party candidate captured 70 percent of the vote.\nMore examplesFewer examplesSeveral attempts were made to capture the animal.One suspect has already been captured.Eleven rebel fighters were killed and two trucks were captured.He was captured by enemy forces and sent to a prison camp for the rest of the war.Three of the gang's members were captured and sent to prison.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\ncapture verb [T]\n(RECORD)\nB2 to represent or describe something very accurately using words or images: It would be impossible to capture her beauty in a painting.\nB2 to record or take a picture of something using a camera: A passer-by captured the whole incident on film.\ncomputing\n&#160; specialized If a computer or similar machine captures information, it takes it in and stores it.\nSMART Vocabulary: related words and phrases\nRepresentation in art & in general\nanti-realism\nanti-realist\nCalvary\ncomplementary\nconfederate\nmimesis\nnaturalistically\nnon-figurative\nnon-representational\nnon-symbolic\nportray\nportrayal\nrealism\nrealist\nrepresentation\nsmellscape\nstylized\nsymbolic\nsymbolism\nsymbolization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nKeeping and storing things\nComputer concepts\ncapture verb [T]\n(INTEREST)\nC1 If something captures your imagination or attention, you feel very interested and excited by it: The American drive to land a man on the Moon captured the imagination/attention of the whole world.\nSMART Vocabulary: related words and phrases\nMaking people excited and interested\nabsorbed\nanimate\nbe someone's bag idiom\nbedazzle\nbreathe\nbreathe (new) life into sth idiom\nengage\nintoxicate\nintrigue\noccupy\noverexcite\noverstimulate\nstir\nstretch\nsweep someone along\ntalk something up\ntantalize\nthe Thames\nthrill\nwhip\nSee more results »\ncapture noun\n(CATCHING)\n[ U ] that act of taking someone as a prisoner, or taking something into your possession, especially by force: People who commit cybercrime often evade capture. They witnessed the capture of the city by rebel troops.\n[ U ] the process of collecting a natural product so that it can be stored or used: Rainwater capture will ensure water conservation is a priority. See also\ncarbon capture\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\ncapture noun\n(RECORDING)\n[ C or U ] the act of recording an image, sound, or other information using a computer or camera, or the image or other information that is recorded: The device is designed for the capture of visual images. A screen capture of the incident was circulated online. See also\nmotion capture specialized\n[ C ] a photograph; used especially when commenting on a photograph on social media: We are sharing this great capture of a rainbow over the city. Nice capture!\n[ U ] (of a computer or similar machine) the act of taking in and storing information: It is important to ensure accuracy in the capture of machine interpretable data. The company develops information capture software. See also\ndata capture\nMore examplesFewer examplesThe time taken for capture of the image is 20 milliseconds.Video capture requires a video capture device. The device enables the double-sided capture of complete cheque images in a single pass.All teleconferences will be encrypted with a highly secure system that prevents the capture of audio, data and video by third parties.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\ncapture verb [T]\n(POSSESS)\nAdd to word list\nAdd to word list\nto take someone as a prisoner, or to take something into your possession: These birds were captured in the wild in 1987.\ncapture verb [T]\n(RECORD)\nto record sound or images, or to express a feeling: She captured the incident on video. Those songs capture the romantic mood of the movie. capture noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈkæp·tʃər, -ʃər/\nThey were shown on TV soon after their capture. Idiom\ncapture someone's attention\nAdd to word list\nAdd to word list\nto succeed in getting something when you are competing with others: capture a large share/10%/30% of the market It was predicted that the internet could capture 5% of the US retail market within three years. They have captured a major position in a worldwide market. A corporation can profit by capturing resources more cheaply.\nIT if a computer, camera, or other machine captures information, it changes it into a form that it can process and store: New digital video technology makes it possible to capture and store an almost limitless volume of footage at minimal cost. capture data/images/information\nENVIRONMENT, SOCIAL RESPONSIBILITY to catch and collect the carbon dioxide produced by machines and processes so that it is not released into the environment: Coal-fired power stations must be retrofitted to capture carbon dioxide.\nIT the process of changing information into a form that a computer or other machine can process and store: document/image/information capture They develop software tools for document capture and image enhancement.\nENVIRONMENT, SOCIAL RESPONSIBILITY the act of catching and collecting carbon dioxide so that it is not released into the environment: Facilities are required to plan for the capture of carbon dioxide in compliance with federal standards.\nthe act of winning or getting control of something: The channel may increase subscription fees to pay for its €240 million capture of Champions League screening rights.\nSee also\ncarbon capture\ndata capture\ndigital capture"}