{"id":87507,"name":"captive","type":"noun","us_sound":"ˈkæp.tɪv","us_link":"../audio/c/captive.mp3","uk_sound":"ˈkæp.tɪv","uk_link":"../audio/c/ukcapit023.mp3","content":"Add to word list\nAdd to word list\na person or animal whose ability to move or act freely is limited by being kept in a space; a prisoner, especially a person held by the enemy during a war: When the town was recaptured, we found soldiers who had been captives for several years. hold/take someone captive\nto keep someone as a prisoner or make someone a prisoner: The terrorists were holding several diplomats captive.\nSee more Synonyms\ndetainee\ninmate\nprisoner\nSMART Vocabulary: related words and phrases\nPeople held in prison\ncellmate\nco-prisoner\ncon\nconvict\ndead\ndead man walking idiom\ndetainee\ndetenu\ngaolbird\nhostage\ninmate\ninternee\njailbird\nlag\nlifer\npolitical prisoner\npow\nprisoner\nprisoner of conscience\nprisoner of war\n(of a person or an animal) having limited ability to move or act freely because of being kept in a space: Wildlife officials say double fences would help prevent the spread of disease between wild and captive animals. If it is successful, captive breeding could restore the population to 200 in seven years.\n(of a prisoner) held by the enemy during a war: The government handed him over to rebels in return for captive soldiers. News that the soldiers were captive after being held at gunpoint caused panic.\nMore examplesFewer examplesThe ponds will be stocked with small fish that will be fed to captive birds.The vaccine has already been tested on captive herds of deer.It's a famous tale about forbidden love between an Egyptian military leader and a captive African princess.\nSMART Vocabulary: related words and phrases\nLack of freedom to act\nbe in bondage to something idiom\nbe locked in something\nbondage\nbound\nboxed in\ndisempowering\ndisenfranchisement\nheel\nlock\nnon-voluntary\nnonindependence\nqualified\nregimented\nservitude\nshackle\nsomeone's hands are tied idiom\ntethered\nthumb\ntie\nunder someone's thumb idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople held in prison\nAdd to word list\nAdd to word list\na prisoner, esp. a person held by the enemy during a war captivity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kæpˈtɪv·ɪ·t̬i/\nMost animals bred in captivity would probably not survive in the wild.\n(being) without the ability to escape: The soldiers were held captive for three months. When selling to people in their homes, you’ve got a captive audience (= people who cannot leave).\nAdd to word list\nAdd to word list\nnot having a choice about what services, goods, etc. you buy because there is only one or there are only a few available in the place where you are: In the cinema, advertisers know that they have a captive audience. Long-distance airline passengers are the perfect captive market. Utility companies could be fined for overcharging captive customers or undercharging consumers who have a choice of supplier."}