{"id":87981,"name":"card","type":"noun","us_sound":"kɑːrd","us_link":"../audio/c/card.mp3","uk_sound":"kɑːd","uk_link":"../audio/c/ukcarap020.mp3","content":"card noun\n(PERMISSION)\nAdd to word list\nAdd to word list\nB1 [ C ] a small, rectangular piece of card or plastic, often with your signature, photograph, or other information proving who you are, that allows you to do something, such as make a payment, get money from a bank, or enter a particular place: I don't have any cash - can I put this on (= pay using) my (credit/charge) card? A lot of shops won't accept cheques unless you have a cheque card with you. The bank's closed now, but I can get some money out with my (cash) card. I don't have any change for the phone but I do have a (phone) card, if that's of any use. You usually have to show your (membership) card at the door. See also\nphone card\nrailcard\nscorecard\nMore examplesFewer examplesThis credit card allows you to withdraw up to £200 a day from cash dispensers.Unfortunately, I didn't have my credit card with me or I'd certainly have bought it.Put your plastic card in the slot, and the machine will read it and identify who you are.Entry to the club is only permitted on production of a membership card.The introduction of identity cards has been opposed by the campaign for civil liberties.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\ncard noun\n(GAME)\nA2 [ C ] (also playing card) one of a set of 52 small rectangular pieces of stiff paper each with a number and one of four signs printed on it, used in games: After dinner, Ted got out a pack of cards John shuffled (= mixed up) the cards before he dealt them (out) (= gave them to the players). Whist is my favourite card game. a card table\nIan Dikhtiar/EyeEm/GettyImages cards A2 [ plural ]\nany of a range of games played with cards, such as poker, whist, and bridge: I've never been much good at cards.\nSee more\nMore examplesFewer examplesWe played cards all evening.I bought a new pack of cards.I had really good cards in my hand.I dealt the cards to all the players.She laid all her cards face up on the table.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\ncard noun\n(GREETINGS)\nA2 [ C ] a rectangular piece of stiff paper, folded in half, with a picture on the front and often a message printed inside, sent on a special occasion: anniversary/get-well cards It's Steve's birthday on Thursday - I must send him a card.\nJamie Grill/GettyImages\n[ C ] a\npostcard\nMore examplesFewer examplesI've circulated a good luck card for everyone to sign.He's so cheap he didn't even buy me a card for my birthday.I wonder who this card is from.Even if she didn't want to send a present, she could at least have sent a card.I had posted the card two months previously.\nSMART Vocabulary: related words and phrases\nLetters, notes and cards\naerogramme\nair letter\nbillet-doux\nchain letter\nChristmas card\ncorrespondence\nget-well card\ngreetings card\nhandbill\nhate mail\ninvitation\njunk mail\nplace card\npoison-pen letter\npostcard\nPPS\nPS\nrejection\nround robin\nwire\nSee more results »\ncard noun\n(INFORMATION)\nB1 [ C ] (also business card) a small, rectangular piece of stiff paper with information printed on it, especially a person's job title, business address, and phone number: Here, let me give you my (business) card.\nPisan Kumpree/iStock/Getty Images Plus/GettyImages\n[ C ] (also trading card) a small, rectangular piece of stiff paper with a picture of someone or something, especially a sports player, and information about them, for people to collect and exchange with other people: I can't believe I'm playing against guys whose cards I collected as a kid. a football/baseball card\nluvemakphoto/iStock Editorial/Getty Images /GettyImages\nMore examplesFewer examplesShe handed me a business card with her name neatly embossed on it.He has all his friends' names and addresses on a card index.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCard games\ncard noun\n(STIFF PAPER)\n[ C or U ] (a piece of) thick stiff paper\nSMART Vocabulary: related words and phrases\nPublishing: paper & stationery\nA3\nA5\nacid-free\nassembler\nbackspace\nballpoint pen\nchalk\nfoolscap\nfountain pen\ngift wrap\ngrammage\nhanging chad\nnotepad\npropelling pencil\npulp\nquill\nquire\nqwerty\nream\nvellum\nSee more results »\ncard noun\n(COMPUTER)\nB1 [ C ] a thin plate inside a computer that contains very small electronic circuits and controls certain operations of the computer: a graphics/sound card\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\ncard noun\n(PERSON)\n[ C ] old-fashioned informal a funny or strange person: You're such a card, Patrick!\nSMART Vocabulary: related words and phrases\nStrange, suspicious and unnatural things and people\nalien\nanomaly\nanti-alien\nBermuda Triangle\ncorn circle\nflake\ngrotesque\nkook\nkryptonite\nloiterer\nMartian\nperviness\nquirk\nscrewball\nsicko\nsociopath\nsociopathic\nspaceman\nweirdo\nwhack job\nSee more results »\nIdioms\nbe on the cards\nyour best/strongest/trump card\nhave a card up your sleeve\nkeep/hold your cards close to your chest\nput/lay your cards on the table\nthe race/gender, etc. card\nto ask someone to show you a document, especially an identity card, in order to prove how old they are\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\ncard noun [C]\n(INFORMATION)\nAdd to word list\nAdd to word list\na small, rectangular piece of stiff paper or plastic with information on it that shows who you are or allows you to do something: a library/membership/business card I used my credit/debit/charge card to pay for the groceries.\ncard noun [C]\n(GAME)\n(also playing card) one of a set of 52 small, rectangular pieces of stiff paper, each with a number or letter and one of four symbols printed on it, used in games: a deck of cards\ncard noun [C]\n(GREETING)\na rectangular piece of stiff paper, folded in half, usually with a picture on the front and often a message printed inside, sent on a special occasion: a birthday/anniversary/get-well card\nA card is also a postcard.\nIdioms\nin the cards\nlay your cards on the table\nthe cards are stacked against someone\ncard verb [T]\n(GET INFORMATION)\nto ask someone to show you a document that shows how old the person is\nAdd to word list\nAdd to word list\nCOMMERCE, BANKING a small rectangular piece of plastic given to a customer by a bank or store that allows them to make payments, take money from their account, etc.: pay with a/use a/pay by card You can pay by credit or debit card. Most businesses won't accept cheques without a card. He lost his wallet and had to cancel all his cards. Would you rather pay cash or put it on your card? When she tried to get money from the machine, her card was refused.\nWORKPLACE a small piece of plastic or stiff paper with your signature, photograph, and often other electronic information on it that proves who you are, allows you to enter a particular place, etc.: You have to swipe your card to get into the building. The new style of driver's licence comes with a photo ID card.\nWORKPLACE, MEETINGS\n&#160; (also business card) a small card that has your name, company name, and the job you do printed on it: He shook my hand politely and gave me his card.\nIT a small electronic object that is part of a computer or can be connected to it, making it able to do a particular thing: If you have your own computer, you can hire ethernet cards from the college to connect to the network. An audio interface can be a simple card that plugs into your computer to allow you to route the sound out to your speakers. See also\naffinity card\nbank card\ncash card\ncharge card\ncheque card\ncredit card\ndebit card\nexpansion card\ngold card\ngraphics card\nView all\ngreen card\ngreetings card\nID card\nidentity card\nindex card\nloyalty card\nmembership card\nmemory card\nnetwork card\npayment card\nrailcard\nSIMM\nsmart card\nsound card\nstore card\nstored value card\nswipe card\ntime card\ntop-up card"}