{"id":88217,"name":"careful","type":"adjective","us_sound":"ˈker.fəl","us_link":"../audio/c/careful.mp3","uk_sound":"ˈkeə.fəl","uk_link":"../audio/c/ukcardi016.mp3","content":"Add to word list\nAdd to word list\nA2 giving a lot of attention to what you are doing so that you do not have an accident, make a mistake, or damage something: Be careful with the glasses. Be careful where you put that hot pan. Be careful to look both ways when you cross the road. Michael is a very careful worker. After careful consideration of your proposal, I regret to say that we are unable to accept it. He's in a really foul temper so be careful (about/of) what you say to him.\nThesaurus: synonyms, antonyms, and examples\navoiding riskcarefulBe careful! I don't want you to fall!cautiousShe's a very cautious driver.play it safeI think I'll play it safe and take the earlier train.risk-averseRisk-averse investors will want to stay away from the company's initial public offering.charyI'm a bit chary of accidentally offending our hosts.better safe than sorryIt's probably nothing more than a headache, but we'll order a round of tests - better safe than sorry.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\npaying close attention to detailcarefulAfter careful consideration, we are unable to accept your proposal.thoroughHe seems like he's not paying attention, but don't be fooled - he's very thorough. meticulousThis book is the result of years of meticulous research.methodicalI appreciated his methodical approach to the work.\nSee more results »\nMore examplesFewer examplesThe path's very steep, so be careful you don't fall.Be careful with that vase - it's very fragile.You'll cut yourself on that knife if you're not careful.Events like these take months of careful planning.The burglars were careful not to leave any tracks behind them.\nSMART Vocabulary: related words and phrases\nCautious and vigilant\nabundance\nan abundance of caution idiom\naskance\nattentive\nattentively\ndiligent\ndiscreet\ndue diligence\ngingerly\nguarded\nmindful\nminutely\nnarrowly\nonce\nonce bitten, twice shy idiom\nsemi-conservative\nslowly\nsnuffly\nsuper-cautious\nsuper-conservative\nSee more results »\nAdd to word list\nAdd to word list\ngiving attention to something in order to avoid esp. an accident or problem: Norman is a careful driver. Give my suggestion careful consideration. [ + question word ] He’s in a really bad mood so be careful what you say to him. [ + question word ] Be careful where you put that hot pan. [ + to infinitive ] Be careful to look both ways when you cross the street."}