{"id":88204,"name":"career","type":"noun","us_sound":"kəˈrɪr","us_link":"../audio/c/career.mp3","uk_sound":"kəˈrɪər","uk_link":"../audio/c/ukcardi012.mp3","content":"Add to word list\nAdd to word list\nB1 the job or series of jobs that you do during your working life, especially if you continue to get better jobs and earn more money: He's hoping for a career in the police force/as a police officer. When he retires he will be able to look back over a brilliant career (= a working life that has been very successful). It helps if you can move a few rungs up the career ladder before taking time off to have a baby. I took this new job because I felt that the career prospects were much better. Judith is very career-minded/-oriented (= gives a lot of attention to her job). Compare\ncalling formal\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\nMore examplesFewer examplesShe made her career in the theatre.During a successful business career, she accumulated a great amount of wealth.Many women sacrifice interesting careers for their family.She manages to successfully combine family life and a career.His political career ended when he was found to have been accepting bribes.\nhaving a job or position as part of the career that you are trained for and are normally paid to do, rather than being chosen for it as a member or supporter of a government or political party: The White House asked the Senate to approve 60 political and career appointees, including a new housing secretary. a career diplomat/ambassador\ndoing something regularly for most of your life, especially as your main way of making money: Even though he already has begun his campaign for re-election, he insists he is not a career politician. The perpetrator was a career criminal with a long series of drugs convictions.\nMore examplesFewer examplesRewarding supporters with jobs abroad is done by presidents of both parties, but career diplomats dislike the practice.He was a career ambassador who retired from the US foreign service in 2019.She recommended a politically independent career prosecutor for the top federal law-enforcement post. So far there is only one confirmed political appointee; career civil servants are running most of the department.He said he feared becoming a career criminal if he spent much longer in prison.Her father was a career soldier and a strict disciplinarian.The candidate was a career businessman with little political experience.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobless\njoblessness\njobseeker\nlabour-intensive\nlackey\nrecertify\nredundancy\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\n(especially of a vehicle) to move fast and in a way that is out of control: The coach careered down a slope and collided with a bank.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscud\nshoot\nstampede\nton\ntrot\nSee more results »\ncareer noun [C]\n(JOB)\nAdd to word list\nAdd to word list\na job for which you are trained and in which it is possible to advance during your working life, so that you get greater responsibility and earn more money: He’s hoping for a career in social work. She left college to pursue an acting career.\ncareer verb [I always + adv/prep]\n(MOVE)\n(esp. of a vehicle) to move fast and without control: The bus careered down a slope and hit a telephone pole.\ncareer adjective [not gradable]\n(JOB)\ndone as a job all your life: a career politician\nAdd to word list\nAdd to word list\nthe job or series of jobs that you do during your working life, especially when this involves making progress to better jobs or is in a particular profession: a career in sth He's hoping for a career in web design.a career as sth I worked there early in my career as civil engineer.a career with sth Sharon enjoyed a long career with the BBC. pursue/make/have a career It is not easy to make a career in broadcasting. a brilliant/successful/distinguished career a political/medical/academic career You should continue learning throughout your professional career. See also\ndual career\nportfolio career\nrelated to your job: career opportunities/prospects I took this new job because I felt that the career prospects were much better.career choice/option For him, art was a way of life, not a career choice.career-minded/-oriented Sean is very career-oriented and ambitious.\nspending all or most of your working life in the same job or field: a career diplomat/soldier/criminal\nUS →\ncareers"}