{"id":88194,"name":"care","type":"noun","us_sound":"ker","us_link":"../audio/c/care.mp3","uk_sound":"keər","uk_link":"../audio/c/ukcardi010.mp3","content":"care noun\n(PROTECTION)\nAdd to word list\nAdd to word list\nB2 [ U ] the process of protecting someone or something and providing what that person or thing needs: The standard of care at our local hospital is excellent. Mira's going to be very weak for a long time after the operation, so she'll need a lot of care. Nurseries are responsible for the children in their care. Synonyms\ncharge (CONTROL)\ncustody (CARE)\nguardianship\nguidance\nkeeping\nprotection\nresponsibility (DUTY)\n[ U ] used as a combining form: skincare/healthcare/childcare take care of someone/something\nB1 to protect someone or something and provide the things that that person or thing needs: Take good care of that girl of yours, Patrick - she's very special.\nSee more in care UK (also take/put into care)\nChildren who are in care or who have been taken/put into care are not living with their natural parents but instead with a national or local government organization or another family: Both children were taken into care when their parents died.\nSee more care in the community UK\na system in which people with mental illness or reduced mental ability are allowed to continue living in their own homes, with treatment and help, and are not kept in hospital: These people are supposed to be getting care in the community, but it's just not happening.\nSee more\nMore examplesFewer examplesAntenatal clinics provide care for pregnant women.These nurses specialize in the care of the dying.Babies need constant care.The standard of care at our local hospital is excellent.Nurseries are responsible for the children in their care.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: treating & caring for people\ncare noun\n(ATTENTION)\nB1 [ U ] serious attention, especially to the details of a situation or thing: She painted the window frames with great care so that no paint got onto the glass. You need to take a bit more care with your spelling. The roads are icy, so drive with care. Take care on these busy roads (= drive with attention so that you do not have an accident). [ + to infinitive ] Take care not to (= make certain that you do not) spill your coffee. [ + that ] Take care (= make certain) that you don't fall. The parcel had a label on it saying \"Handle with care\".\nMore examplesFewer examplesThey took care to be as tactful as possible.She took a lot of care over the wording of her speech.You need to take more care with your handwriting.Take care that you get there on time.Make sure he takes care if he insists on going up that ladder.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\ncare noun\n(DEAL WITH)\ntake care of something\nC1 to deal with something: If you can see to the drinks for the party, I'll take care of the food.\nSee more\ncare noun\n(WORRY)\nC2 [ C or U ] a feeling of worry or anxiety: She seemed weighed down by all her cares.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nangst\nanti-stress\nanxiety\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nIdioms\ncare of\nhave a care\nhave all the cares of the world on your shoulders\ntake care (of yourself)\nwithout a care in the world\ncare verb [I]\n(WORRY)\nB1 to think that something is important and to feel interested in it or upset about it: She's never cared very much about her appearance. [ + question word ] I really don't care whether we go out or not. I don't care how much it costs, just buy it. \"Was Lorna happy about the arrangements?\" \"I don't know and I don't care.\" Your parents are only doing this because they care about (= love) you. I couldn't care less C1 UK informal (also US I could care less)\nused to emphasize rudely that you are not interested in or worried about something or someone: \"Mike's really fed up about it.\" \"I couldn't care less.\"\nSee more for all I care informal\nused to say that you are not interested in or worried about what someone else is doing: You can go to the match with Paula, for all I care.\nSee more as if I care informal\nused to say that you are not interested in or worried about something that has happened or that someone has said: He said he didn't approve of what I'd done, as if I cared.\nSee more who cares? B2 informal\nused to emphasize rudely that you do not think something is important: \"It looks as if we are going to lose.\" \"Who cares?\".\nSee more\nMore examplesFewer examples\"I don't care - you choose, \" he said, with an airy wave of the hand.\"I don't care what you think\", she flung (back) at him.You could be the Queen of England, for all I care - you're not coming in here without a ticket.I don't care about fashion, I dress how I please.I don't care if he likes it or not - I'm coming!\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzealously\nzestful\nzestfully\nSee more results »\ncare verb [I]\n(WANT)\nformal used in polite offers and suggestions: Would you care for a drink? [ + to infinitive ] Would you care to join us for dinner?\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nPhrasal verbs\ncare for someone\nnot care for someone/something\ncare noun\n(HELP)\nAdd to word list\nAdd to word list\n[ U ] the process of providing for the needs of someone or something: The quality of care at this hospital is very good. Trees on city property don’t get any care.\ncare noun\n(ATTENTION)\n[ U ] serious attention, esp. to the details of a situation or a piece of work: She painted the window frames with great care. Idiom\n(in) care of\ncare verb\n(WORRY)\nto be interested in something, or to be anxious or upset about something: [ I ] Don’t you care about what happens to the children? [ I ] I really don’t care if we go or not (= It doesn’t matter to me). [ + question word ] I don’t care how much it costs, just buy it.\ncare verb\n(WANT)\n[ I ] fml (used in polite offers and suggestions) to want something: [ + to infinitive ] Would you care to join us for dinner? Phrasal verbs\ncare for someone/something\ncare for something/someone\nAdd to word list\nAdd to word list\nattention that is given to something or someone, so that they are looked after, protected, or dealt with in the right way: There will be some mistakes no matter how much care goes into the first draft.take care over sth People are taking more care over where they invest their money.take care to do sth Take care to prepare for your interview by listing all the personal qualities and experience you have which suit you for the job.\ncare of\nCOMMUNICATIONS\n&#160; ( abbreviation c/o) used in addresses when the person you are writing to is staying or working somewhere that is not the place where they usually live or work: You can send packages to me care of my hotel. Address your letters to Write On, c/o BBC, Broadcasting House, London.\ntake care of sth/sb\nto look after or protect something or someone: Take care of your home: it's your largest asset. People are doing this job to put food on the table and take care of their children.\nto deal with or be responsible for something: He suggested she could help run the firm and take care of the finances. I'll take care of all the travel arrangements.\nSee also\nchildcare\ncustomer care\nhealthcare\npersonal care"}