{"id":88196,"name":"cared","type":"verb","us_sound":"ker","us_link":"../audio/c/care.mp3","uk_sound":"keər","uk_link":"../audio/c/ukcardi010.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncare\ncare verb [I]\n(WORRY)\nB1 to think that something is important and to feel interested in it or upset about it: She's never cared very much about her appearance. [ + question word ] I really don't care whether we go out or not. I don't care how much it costs, just buy it. \"Was Lorna happy about the arrangements?\" \"I don't know and I don't care.\" Your parents are only doing this because they care about (= love) you. I couldn't care less C1 UK informal (US I could care less)\nused to emphasize rudely that you are not interested in or worried about something or someone: \"Mike's really fed up about it.\" \"I couldn't care less.\" for all I care informal\nused to say that you are not interested in or worried about what someone else is doing: You can go to the match with Paula, for all I care. as if I care informal\nused to say that you are not interested in or worried about something that has happened or that someone has said: He said he didn't approve of what I'd done, as if I cared. who cares? B2 informal\nused to emphasize rudely that you do not think something is important: \"It looks as if we are going to lose.\" \"Who cares?\".\nMore examplesFewer examples\"I don't care - you choose, \" he said, with an airy wave of the hand.\"I don't care what you think\", she flung (back) at him.You could be the Queen of England, for all I care - you're not coming in here without a ticket.I don't care about fashion, I dress how I please.I don't care if he likes it or not - I'm coming!\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzealously\nzestful\nzestfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressions meaning 'it isn't important to me'\nLacking interest and enthusiasm\ncare verb [I]\n(WANT)\nformal used in polite offers and suggestions: Would you care for a drink? [ + to infinitive ] Would you care to join us for dinner?\nSMART Vocabulary: related words and phrases\nWanting things\nache for something\nacquisitive\nambitious\nambitiously\nangle for something\ndesperate\nexpense\nhave your eye on something idiom\nhunger\nhunger after/for something\nhungrily\nimpulse\npine\nseeker\nset your heart on something/doing something idiom\nset your sights on something idiom\nshook\nshopping list\nsight\nsomeone's heart's desire idiom\nSee more results »\nPhrasal verbs\ncare for someone\nnot care for someone/something"}