{"id":88600,"name":"carom","type":"verb","us_sound":"ˈker.əm","us_link":"../audio/c/cdo1121uscaro0801.mp3","uk_sound":"ˈkær.əm","uk_link":"../audio/c/cdo1121ukcaro0825.mp3","content":"Add to word list\nAdd to word list\nUS (UK cannon) to hit something and bounce back, especially at an angle: She had her final shot carom off the back of the rim. Kids run wild and beach balls carom around the lobby.\nUS (UK cannon) to move or change in an uncontrolled way between different places, things, or subjects: We must not give the virus the chance to carom wildly through human hosts as it does in a flock of chickens or ducks. The book has 84 short chapters that carom from one issue to the next and fail to tackle anything in much depth.\nMore examplesFewer examplesIf you're not careful your ball will carom left off the severely sloped fairway into the rough.After losing one of its propellers, the plane caroms off a neighbour's palm tree.Vehicles striking the guardrails or sheer mountainsides can carom across the traffic lanes. The kids grab their food and carom away in different directions.Bounding about the stage, she caroms from girlish giddiness to boyish bluster and back again.The plot caroms between the self-consciously camp and the unapologetically bizarre.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\nbump\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough into something/someone\npost-crash\nrun (something) into something/someone\nrun someone/something down\nscuff\nslam\nsmash something up\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBouncing\nChanging\ncarom noun\n(IN GAMES)\n[ C ] US (UK cannon) in billiards or pool, an occasion when the ball hits two other balls one after the other: A carom can be useful in pool and they’re deadly if used at the right time.\n[ U ] US (also carom billiards) a game similar to billiards played on a table without pockets: The place is mainly a spot for people to play cards or three-ball pocketless carom billiards.\nyongsuk son/iStock/Getty Images Plus/GettyImages\n[ C ] US a rebound (= an occasion when something such as a ball bounces back after hitting a hard surface), especially at an angle: The ball took a carom, shooting back toward the right-field line.\nMore examplesFewer examplesSometimes two balls are extremely close to being at the correct angle for a carom but not quite.The truckers have a transport office where they relax and play carom, a sort of cross between draughts and billiards.Ronaldo took the carom and buried it in the net.\nSMART Vocabulary: related words and phrases\nSnooker, pool & billiards\nbaize\nbilliard\nbilliard ball\nbreak\nbreak (something) off\ncannon\ncue\ncue ball\nframe\nmiscue\npocket\npool\npot\nrack\nre-rack\nre-spot\nsnooker\nsnooker ball\ntriangle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\nBouncing\ncarom noun\n(SEED)\n[ C or U ] (also carom seed) a seed that is used as a spice, especially in South Asian cooking: The seeds are known as bishop's weed, ajwain and carom. Carom seeds, or ajwain as they are called in India, are somewhat similar to thyme in flavour, though more pungent. Synonym\najwain\nMore examplesFewer examplesThe fish is covered with a thick batter of gram flour and spiced with carom seeds and chaat masala, a spice mix.\nSMART Vocabulary: related words and phrases\nHerbs & spices\naji\najwain\nAleppo pepper\nallspice\nancho\ncinnamon\ncoarse salt\ncommon salt\ncondiment\ncoriander\niodized salt\nItalian parsley\njalapeño\nkitchen salt\nkonjac\npumpkin spice\npurslane\nras el hanout\nred pepper\nsage\nSee more results »"}