{"id":88811,"name":"carrier","type":"noun","us_sound":"ˈker.i.ɚ","us_link":"../audio/c/carrier.mp3","uk_sound":"ˈkær.i.ər","uk_link":"../audio/c/ukcarpe007.mp3","content":"carrier noun [C]\n(TRANSPORT)\nAdd to word list\nAdd to word list\na person or thing that carries something\na company that operates aircraft\nused as a combining form, especially in phrases that refer to military vehicles of a type that carry other vehicles or groups of soldiers: an armoured troop-carrier a freight carrier\ninformal for\naircraft carrier\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nAir travel: aviation\nArmy & military vehicles\ncarrier noun [C]\n(PHONE COMPANY)\n(also phone carrier) a company that provides mobile phone services to people so they can make calls, send messages, etc.: You can transfer your existing mobile phone number to a new carrier. Only your carrier limits the number of characters you can receive in text messages. People are willing to change phone carriers in order to save a few dollars. They used the new high-speed data networks that cell phone carriers had built. The company is one of Japan's biggest mobile phone carriers.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\ncarrier noun [C]\n(BAG)\nUK (also carrier bag) (US shopping bag) a large plastic or paper bag with handles, used to carry things that you have bought, especially one given to you in a shop\nAnthonyRosenberg/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nBags in general\nbag\nbag for life\nbagful\ncarry (something) on\ndoggy bag\nfeedbag\nman bag\nnosebag\npacket\nparty bag\npencil case\npolybag\npouch\nself-seal\nself-sealing\nshopper\nshopping trolley\nstring bag\nwheelie bag\nZiploc\nSee more results »\ncarrier noun [C]\n(SPREAD)\nsomeone who does not suffer from a disease but has the infection or genetic fault that causes it and can give the disease to someone else: There are an estimated 1.5 million HIV carriers in the country.\nSMART Vocabulary: related words and phrases\nPassing on illness & causing disease\naerosolize\ncommunicability\ncommunity transmission\ncontact tracer\ncontact tracing\nepidemic\nharbour\ninfect\ninfected\nnon-communicable\nnon-infected\nnon-infectious\nnoncarrier\nnoncontagious\ntransferable\ntransmissibility\ntransmissible\ntransmit\ntransmittable\nunhygienic\nSee more results »\ncarrier noun [C]\n(TRANSPORT)\nAdd to word list\nAdd to word list\na person or thing that carries or delivers something: She’s got a job as a letter carrier.\ncarrier noun [C]\n(SPREAD)\nmedical a person who can give a disease to other people but may not show any signs of having the disease\nAdd to word list\nAdd to word list\nTRANSPORT a company that transports goods or people from one place to another: The company loses fewer drivers because it is a shorter-haul carrier whose drivers are typically away overnight rather than weeks on end. Sioux Railway is the ninth largest rail carrier in the nation.\nTRANSPORT a company that operates aircraft: The Dallas-based carrier will offer same-plane service with one or more stops to 27 cities. Etihad Airways is Abu Dhabi's national carrier. low-cost/low-fare/no-frills carrier\nINSURANCE a company or organization that provides insurance: The company will pay $2 million of the settlement, with the rest from its insurance carrier and other parties.\nCOMMUNICATIONS a company that provides a communications service such as a phone, television, or internet service: Number portability allows you to transfer your existing cell phone number to a new carrier. a mobile/mobile phone/cellphone carrier In 1984 AT&amp;T became the largest long-distance carrier. See also\nbulk carrier\ncommon carrier\ncontract carrier\nfree carrier\nlimited carrier\nprivate carrier\npublic carrier"}