{"id":89076,"name":"case","type":"noun","us_sound":"keɪs","us_link":"../audio/c/case.mp3","uk_sound":"keɪs","uk_link":"../audio/c/ukcartr008.mp3","content":"case noun\n(SITUATION)\nAdd to word list\nAdd to word list\nB1 [ C ] a particular situation or example of something: extreme case She was suffering from an extreme case of sunburn.in each case We have lots of applications from people who want to study here and in each case we consider the candidate very carefully. Over a hundred people were injured, in several cases seriously. Jobs are hard to find but in his case that's not the problem because he has so much experience. I wouldn't normally agree but I'll make an exception in this case. The number of new cases of the illness appears to be declining. in that case\nB2 because of the mentioned situation: There's no coffee left? In that case I'll have tea.\nSee more (not) the case\nB1 (not) true: If that is the case then I will be very disappointed.\nSee more in any case\nB2 also: I don't want to go and in any case, I haven't been invited.\nSee more (just) in case\nB1 because of a possibility of something happening, being needed, etc.: I don't think I'll need any money but I'll bring some just in case.\nSee more in case of something formal\nif something happens, or in preparation for when something happens: The camping area has ready access to water, in case of fire.\nSee more in the case of someone/something\nin connection with someone or something, or in the situation of something: The law will apply equally to men and women except in the case of maternity leave.\nSee more a case of something\nused when a situation is of a particular type: She doesn't want to work full-time, it's a case of having to.\nSee more a case in point (also case in point)\nan example that shows that what you are saying is true or helps to explain why you are saying it: Lack of communication causes serious problems and their marriage is a case in point.\nSee more as is the case\nin the same way that it happens: As is often the case with children, Amy was completely better by the time the doctor arrived.\nSee more as the case might be (also whatever the case might be)\none of the stated possibilities that is true: When the election is called in April, or June, as the case might be, we shall be ready for it.\nSee more\nMore examplesFewer examplesWe don't usually accept late applications, but in this case we will make an exception.The newspaper photo apparently showed him in Rome but it was a case of mistaken identity .As is often the case with children, Amy was completely better by the time the doctor arrived.He may possibly decide not to come, in which case there's no problem.In special cases the manager will stretch the rules .\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nsample\nshowpiece\nspecimen\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSituations and circumstances\ncase noun\n(PROBLEM)\nB2 [ C ] a problem, a series of events, or a person being dealt with by police, doctors, lawyers, etc.: on the case The detective on the case (= responsible for solving it) has been suspended from duty. Several social workers have looked into the child's case. When he first went for treatment at the hospital he seemed to be a hopeless case (= a person who could not be cured).\nB2 [ C ] a matter to be decided by a judge in a law court: a murder case The case will go before the European Court next month. She accused her employer of unlawful dismissal and won/lost her case.\nMore examplesFewer examplesHe has been cited as the co-respondent in the divorce case.The court's decision on this case will turn the clock back 50 years.The lack of evidence means that the case is unlikely to go to court.The jury took five days to deliberate on the case.His lawyers have decided not to proceed with the case.\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncasualty\nconvalescent\nday patient\ndonor\nepileptic\ngeriatric\nhealth tourist\ninvalid\nmedical tourist\nnon-responder\norgan donor\noutpatient\npatient\nsick\nsufferer\nunder\nvictim\nwounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nDetection & solving crimes\ncase noun\n(CONTAINER)\nA2 [ C ] a container or box for storing something in: The telescope comes with a case. She took her violin out of its case. The flag is on display inside a glass case. See also\nbookcase\nbriefcase\npencil case\npillowcase\nUK a large, rectangular container with a handle, for carrying clothes and possessions while travelling: Will you bring your cases out to the car? He went upstairs to pack his case. Synonym\nsuitcase\ns-cphoto/iStock/Getty Images Plus/GettyImages\na box holding twelve or more bottles of wine or another type of drink, or the bottles and their contents: He bought his brother a case of wine for his birthday. Can you get some more lemonade? We've drunk the whole case.\nMore examplesFewer examplesThe crown, decorated with diamonds and other precious stones, was exhibited in a special case.Inside the small wooden case is a gold-chain necklace.Don't forget to put the thermometer back in its case.I emptied the closet and put my belongings into the black overnight case.\"Can you lift this case?\" \"It depends on how heavy it is.\"I've lashed your case to the roof rack.The boys brought a few cases of beer.\nSMART Vocabulary: related words and phrases\nGeneral and miscellaneous containers\nBall jar\nbin\nbindle\nbiscuit tin\ncaddy\ndrum\nflowerpot\ngeocache\ngift box\ngunnysack\npacking case\npaintbox\npallet\npiggy bank\nplanter\nuncase\nurn\nvivarium\nworkbasket\nworkbox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContainers for carrying personal possessions\ncase noun\n(ARGUMENT)\nC2 [ S ] arguments, facts, and reasons in support of or against something: There's a good case for/against bringing in new regulations. The case against cigarette advertising is becoming stronger all the time. She's very busy so don't overstate the case - just give her the facts.\nMore examplesFewer examplesThe case against her was circumstantial.You can argue the case either way.The shareholders seem to think that the executive board is overstating the case for a merger.They paid a high-powered attorney to plead their case .Once again he tried to press his case for promotion.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ndefinition\nexplain\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\ncase noun\n(GRAMMAR)\n[ C or U ]\n&#160; language\n&#160; specialized (also grammatical case) in some languages, any of the various forms of a noun, pronoun, or adjective that show the work it does in a sentence, for example by a special word ending: The definite article is not standard before a noun in the vocative case. \"He\" and \"him\" express different grammatical cases. Cases can evolve as a language evolves (for instance, in Ancient Greek, the locative case merged with the dative case). See also\nablative\naccusative\ndative\ngenitive\nlocative\nnominative\nvocative\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\ncase noun\n(WRITING)\n[ C or U ] specialized each of the two forms, capital or small, in which a letter of the alphabet may be written or printed: upper-case/lower-case letters\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLettering & alphabets\nPunctuation\nGrammar\nIn case (of)In case is a conjunction or adverb. In case of is a preposition. …\nIdioms\nbe on the case\nget off someone's case\nget on someone's case\nmake a case for something\ncase the joint\nto look at a place with the intention of stealing from it later: He looked around shiftily, as if he was casing the joint.\nSee more\ncase noun [C]\n(SITUATION)\nAdd to word list\nAdd to word list\na particular situation or example of something: We don’t normally accept credits from courses taken at another university, but we’ll make an exception in your case. It was a case of not knowing what to say. She said I refused to answer the question, but that is not the case (= that is not accurate). in case\nIn case means if something else should happen: I think we should leave a little early, in case there’s a lot of traffic. in case of something\nIn case of something means if something should happen, esp. something unusual or unexpected: In case of fire, go immediately to the nearest emergency exit.\ncase noun [C]\n(PROBLEM)\nan item or particular matter that is being dealt with as a problem to be solved, or a person considered in this way: Your skin problem may be a mild case of eczema. He is a sad case – out of work and with few friends to help him.\ncase noun [C]\n(ARGUMENT)\narguments, facts, and reasons in support of or against something: He presented the case against cutting the military budget.\nlaw In a court of law, a case is a matter to be decided by a judge or jury (= group of people): She claimed the city’s negligence caused her accident, but she lost the case.\ncase noun [C]\n(CONTAINER)\na container used for protecting or storing things: an eyeglass case a case of seltzer\ncase noun [C]\n(GRAMMAR)\ngrammar the form a noun, pronoun, or adjective takes depending on its relationship to other words in a sentence: The possessive case of a noun is usually formed with the ending -’s.\nAdd to word list\nAdd to word list\na container or box for storing, showing, or carrying something: The store had a display case full of antique jewellery. The laptop is sold with a padded carrying case. packing cases\na box holding twelve bottles of wine or another type of alcoholic drink, or the twelve bottles and their contents: a case of beer/wine There is a 5% discount if you buy a case.\narguments and reasons why something is right or wrong, should or should not be done, etc.: a case for/against sth There's a good case for bringing in new regulations.make/argue a case The study makes the case for increasing flexible working.a good/strong case The union believes it has been vindicated and has a very strong case.\nLAW a matter to be decided by a judge in a court of law: a libel/fraud/discrimination casewin/lose a case She accused her employer of unlawful dismissal and won her case.settle/drop a case The parties agreed to settle the case on the basis of the carrier's limitation fund. See also\nbasket case\nbusiness case\ntest case"}