{"id":89146,"name":"cash","type":"noun","us_sound":"kæʃ","us_link":"../audio/c/cache.mp3","uk_sound":"kæʃ","uk_link":"../audio/c/ukbysta022.mp3","content":"Add to word list\nAdd to word list\nA2 money in the form of notes and coins, rather than cheques or credit cards: Do you have any cash on you? Will you pay by credit card or in cash? He says he wants cash in advance before he'll do the job.informal I'm a bit short of/strapped for cash (= I do not have much money) at the moment. See also\nCOD\nhard cash\nmkos83/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThis credit card allows you to withdraw up to £200 a day from cash dispensers.Do you wish to be paid in cash or by cheque?I don't have any cash - can I put this on my credit card?He gave me a large amount of cash.Can you lend me some cash?\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nto exchange a cheque, etc. for cash: Would you cash a cheque for me?\nMore examplesFewer examplesSorry, we can't cash cheques here.I cashed my insurance policy.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank balance\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\nelectronic banking\ngiro\ninvestment bank\npay\nsafe deposit box\nstatement\nstress test\nsuperbank\nthe Square Mile\nSee more results »\nPhrasal verbs\ncash in on something\ncash out sth\ncash up\nAdd to word list\nAdd to word list\nmoney in the form of bills and coins: Are you going to pay by credit card or cash?\nto get cash in exchange for esp. a check: Can I cash a traveler’s check here? Phrasal verbs\ncash in something\ncash in on something\ncash out (something)\nAdd to word list\nAdd to word list\nMONEY money in the form of notes and coins, rather than cheques, bank cards, etc.: in cash Many tradespeople prefer to be paid in cash. How would you like to pay, card or cash? We were forced to pay cash since the card machine was not working.take/accept cash Be warned: most gas stations in the area take cash only.\nFINANCE money rather than shares, bonds, etc.: The buying company will offer cash or shares in their company in return for shares in the company it wants to buy. The account has the ability to hold cash and investments.\nMONEY, FINANCE money in general, especially money that is available to use immediately: I'm a bit short of cash at the moment.raise/get/have cash A rights issue is an occasion when a company issues new shares to raise cash.need/spend/save cash Do you need cash for a business idea?\nSee also\nall-cash\nbulk cash\ndigital cash\ne-cash\nhard cash\nnon-cash\npetty cash\nready cash/money\nvault cash\nto exchange something for cash: cash a cheque/paycheck/traveller's chequecash a bond/voucher There are some tax aspects to consider when you cash the bond. Phrasal verbs\ncash in\ncash out\ncash up"}