{"id":89314,"name":"cast","type":"noun","us_sound":"kæst","us_link":"../audio/c/cast.mp3","uk_sound":"kɑːst","uk_link":"../audio/c/ukcartr026.mp3","content":"cast noun\n(ACTORS)\nAdd to word list\nAdd to word list\nB2 [ C, + sing/pl verb ] the actors in a film, play, or show: cast of characters The play's cast of characters is on the second page of the programme. main cast After making two guest appearances, she was promoted to the main cast for the show's second season. supporting cast Part of the film's success lies in the strength of the supporting cast (= the actors who were not playing the main parts). After the final performance the director threw a party for the cast.\nSMART Vocabulary: related words and phrases\nCinema & theatre: casting, roles & scripts\nbilling\nbit part\ncallback\ncast list\ncasting couch\ncharacterization\nchorus\ndialogue\nexit\nHarlequin\nmiscast\noff script\non script\nopposite\ntable read\ntapescript\nteleplay\ntheatre\ntitle role\ntypecast\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: actors & performers\ncast noun\n(SHAPE)\n[ C ] an object made by pouring hot liquid into a container and leaving it to become solid\n[ C ] another word for\nplaster cast\namriphoto/E+/GettyImages in a cast (UK also in plaster)\nIf a part of your body is in a cast, it has a plaster cast around it to protect it while a broken bone repairs itself: My leg was in a cast for about six weeks.\nSee more\nSMART Vocabulary: related words and phrases\nModels & moulds\ncardboard cutout\ndie\ndiorama\nmock\nmock something up\nmodel\nmould\nprecast\nrecreation\nscale\nsection\ntruckle\nwireframe\nYou can also find related words, phrases, and synonyms in the topics:\nMedical dressings, supports & devices\ncast verb\n(ACTORS)\nC2 [ T ] to choose actors to play particular parts in a play, film, or show: He was often cast as the villain. In her latest movie she was cast against type (= played a different character than the one she usually played or might be expected to play).figurative They like to cast the opposing political party as (= to say that they are) the party of high taxes. See also\ntypecast\nMore examplesFewer examplesThey cast a group of schoolchildren in the roles.He always seemed to be cast as the villain.The cast all lined up on stage to take their bow.His latest movie featured an all-star cast.It's one of those old Hollywood epics with a cast of thousands.The cast were in overdrive, rehearsing for the first performance.The movie's all-star cast should give it a lot of pull.\nSMART Vocabulary: related words and phrases\nCinema & theatre: casting, roles & scripts\nbilling\nbit part\ncallback\ncast list\ncasting couch\ncharacterization\nchorus\ndialogue\nexit\nHarlequin\nmiscast\noff script\non script\nopposite\ntable read\ntapescript\nteleplay\ntheatre\ntitle role\ntypecast\nSee more results »\ncast verb\n(LIGHT)\nC2 [ T usually + adv/prep ] to send light or shadow (= an area of darkness) in a particular direction: The moon cast a white light into the room. The tree cast a shadow over/on his face.figurative Her arrival cast a shadow over/on the party (= made it less pleasant). cast light on something\nto provide an explanation for a situation or problem, or information that makes it easier to understand: The discovery of the dinosaur skeleton has cast light on why they became extinct.\nSee more\nSMART Vocabulary: related words and phrases\nGiving out light\nafire\nalbedo\nbeam\nbeamy\nbioluminescence\nburnished\nflicker\ngleam\nglimmer\nglitter\nglow\nluminescent\nluminously\nnoctilucent\nnon-glare\nnon-luminous\nout-glitter\nreflected ray\nshine\nwink\nSee more results »\ncast verb\n(LOOK)\ncast a look, glance, smile, etc.\nto look, smile, etc. in a particular direction: She cast a quick look in the rear mirror.\nSee more cast an/your eye over something\nto look quickly at something: Could you cast an eye over this report for me?\nSee more\ncast verb\n(THROW)\n[ T + adv/prep ] literary to throw something: The knight cast the sword far out into the lake.\n[ I or T ] (in fishing) to throw something, such as a line, into the water to catch fish with: He cast the line to the middle of the river.\nSMART Vocabulary: related words and phrases\nThrowing\narm\nflick\nfling\nheave\nhurl\noutpitch\noverhand\npeg\npelt\nproject\nsling\nstone\nthread\nthrow\nthrow something in\ntoss\nunderarm\nunderhand\nwang\nwhang\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHunting & fishing\ncast verb\n(DOUBT)\ncast doubt/suspicion on someone/something\nC2 to make people feel less sure about or have less trust in something or someone: New evidence has cast doubt on the guilty verdict.\nSee more\ncast verb\n(REMEMBER)\ncast your mind back\nC2 to try to remember: If you cast your mind back, you might recall that I never promised to go.\nSee more\ncast verb\n(VOTE)\ncast a/your vote\nC2 to vote: All the votes in the election have now been cast and the counting has begun.\nSee more\ncast verb\n(SHAPE)\n[ T ] to make an object by pouring hot liquid, such as melted metal, into a shaped container where it becomes hard\nSMART Vocabulary: related words and phrases\nIndustrial processing\ncanning\ncutting room\ndesalinate\ndesalination\ndie-cast\nfluoridate\nmould\nnurdle\nplastic\nprocess\nprocessing\nraw material\nrefine\nrefinement\nsmelt\nsmelting\ntan\ntreat\nunworked\nwork\nSee more results »\ncast verb\n(MAGIC)\ncast a spell\nC2 to use words thought to be magic, especially in order to have an effect on someone: The old woman cast a spell on the prince and he turned into a frog.\nSee more\ncast verb\n(SKIN)\n[ T ] If a snake casts its skin, the outer layer of old skin comes off its body.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nSee also\ncast aspersions (on someone/something) formalIdioms\ncast someone adrift\ncast someone/something adrift\nbe cast away\nbe cast in the same mould\ncast your net wide\ncast pearls before swinePhrasal verbs\ncast around\ncast someone/something aside/away/off\ncast off\ncast on\ncast someone/something out\ncast verb [T]\n(CAUSE TO APPEAR)\nAdd to word list\nAdd to word list\nto cause something to appear, as if by throwing something: People complained about the shadows cast by the new skyscraper. fig. A new scientific study may cast some light on (= help to explain) why women live longer than men.\nIn the sport of fishing, if you cast something, such as a line or a net, you throw it far into the water: We watched the trout fishermen casting their lines.\ncast verb [T]\n(CHOOSE ACTORS)\nto choose actors to play particular parts in a play, movie, or show, or to choose an actor for a part: They are casting the show in New York right now. She’s been cast as a young doctor in an upcoming movie.\ncast verb [T]\n(SHAPE)\nto make an object by pouring liquid, such as melted metal, into a shaped container to become hard: The bronze statue is being cast next week.\ncast verb [T]\n(VOTE)\nto give a vote: Altogether, 358 votes were cast. Idiom\ncast doubt on someone/somethingPhrasal verbs\ncast about\ncast off\ncast noun [C]\n(COVERING)\na hard covering used to keep a broken bone in the correct position and protect it until it heals\ncast noun [C]\n(CHOSEN ACTORS)\nall the actors in a movie, play, or show\ncast noun [C]\n(SHAPE)\nan object made in a particular shape by pouring a liquid substance into a container having that shape and letting the liquid harden\ncast a/your vote (also cast a/your ballot)\nAdd to word list\nAdd to word list\nto vote: Building society members can today cast their votes on the biggest merger in building society history."}