{"id":89428,"name":"casual","type":"adjective","us_sound":"ˈkæʒ.uː.əl","us_link":"../audio/c/casual.mp3","uk_sound":"ˈkæʒ.ju.əl","uk_link":"../audio/c/ukcaste007.mp3","content":"casual adjective\n(INFORMAL)\nAdd to word list\nAdd to word list\nB1 Casual clothes are not formal or not suitable for special occasions: He was dressed in casual clothes--sneakers, blue jeans, and a t-shirt.\nMore examplesFewer examplesHis casual behaviour was wholly inappropriate for such a formal occasion.His clothes were artfully arranged to look stylishly casual.Everyone else was in jeans and casual gear and I had my office clothes on - I stuck out like a sore thumb.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nfrilly\nribbed\nribby\nruche\nruched\nruck (something) up\nvoop neck\nwaisted\nwashable\nwasp waist\nwasp-waisted\nSee more results »\ncasual adjective\n(NOT INTERESTED)\nnot taking or not seeming to take much interest: The psychologist's attitude seemed far too casual, even brutal. Security around the conference hotel seemed almost casual. Although close to tears, she tried to make her voice sound casual.\nSMART Vocabulary: related words and phrases\nLacking interest and enthusiasm\napathetic\napathy\naridity\nblah\nblankly\nhalf-heartedly\nhell\nincurious\nincuriously\nnonchalant\nnonchalantly\nnonconcern\npassionless\npolitely\nunromantically\nunserious\nunseriousness\nvacant\nvacantly\nyour heart isn't in it idiom\nSee more results »\ncasual adjective\n(TEMPORARY)\nC2 [ before noun ] not regular or fixed: casual sex They were having casual sex but it never became a serious relationship. casual labour/labourers/workers\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobless\njoblessness\njobseeker\nlabour-intensive\nlackey\nrecertify\nredundancy\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTemporary\ncasual adjective\n(CHANCE)\nB2 [ before noun ] not serious or considered, or done by chance: casual observer To a casual observer, everything might appear normal. It was just a casual comment - I didn't mean it to be taken so seriously.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\neven-money\nfluke\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nRelated word\ncasually\ncasual adjective\n(NOT SERIOUS)\nAdd to word list\nAdd to word list\nnot serious or careful in attitude; only partly interested: a casual glance at a magazine Even to the casual observer, the forgery was obvious.\ncasual adjective\n(INFORMAL)\nnot formal; relaxed in style or manner: We have a small office and I am very casual and wear slacks and sports shirts and things like that.\ncasual adjective\n(TEMPORARY)\nnot regular or frequent; temporary or done sometimes: casual laborers\nCasual also means slight: He was only a casual acquaintance – I didn’t know him well.\ncasual adjective\n(NOT PLANNED)\nnot intended or planned: a casual remark casual conversation casually adverb us\nYour browser doesn't support HTML5 audio\n/ˈkæʒ·ə·wə·li/\nWe were told to dress casually for the walking tour.\nAdd to word list\nAdd to word list\nHR used to describe work that is not permanent, or workers that are not employed permanently but only when a company needs them: casual employee/worker/labourer Most casual workers are paid by the day or hour.casual work/jobs/labour After leaving school she had a range of casual jobs. She does not intend necessarily to give up work but may work on a casual basis.\nWORKPLACE casual clothes are informal: casual clothes/dress/attire Research shows that 90% of US companies now allow casual dress regularly. The style of dress in the office could best be described as business casual rather than formal.\n[ C ]\n&#160; HR a worker who is not employed permanently but only when a company needs them: On the whole, semi-skilled and unskilled positions are filled by casuals.\ncasuals [ plural ]\nWORKPLACE informal clothing: Last January, the firm dispensed with any requirement to wear business suits and about half the staff now opt for casuals."}