{"id":89435,"name":"casualty","type":"noun","us_sound":"ˈkæʒ.uː.əl.ti","us_link":"../audio/c/casualty.mp3","uk_sound":"ˈkæʒ.ju.əl.ti","uk_link":"../audio/c/ukcaste009.mp3","content":"casualty noun\n(INJURED)\nAdd to word list\nAdd to word list\nC2 [ C ] a person injured or killed in a serious accident or war: suffer casualties The rebels suffered heavy casualties. The train was derailed but there were no casualties, police said.\nMore examplesFewer examplesThe number of casualties in both wars was appallingly high.Hospitals are on standby ready to deal with casualties being flown in from the crash site.They were warned to expect a heavy air attack and therefore many casualties.George was a casualty in that nasty motorway pile-up last year.So far, only one casualty has been rescued from the scene of the explosion.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\npush\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: people who receive medical treatment\ncasualty noun\n(BADLY AFFECTED)\n[ C ] a person or thing that suffers as a result of something else happening: She lost her job in 2011, a casualty of the recession. The first casualty of the reorganization will be the bus service, which will be stopped altogether.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\ncasualty noun\n(HOSPITAL)\nC2 [ U ] UK (US emergency room) the part of a hospital where people who are hurt in accidents or suddenly become ill are taken for urgent treatment: She had to be rushed to casualty.\nSMART Vocabulary: related words and phrases\nMedical places & organizations\nA &amp; E\naccident and emergency\naid station\nbiotech\nbirth centre\nblood bank\nclinic\nconsulting room\ndispensary\ngroup practice\nmadhouse\nmaternity ward\nNICU\nNIH\nnon-hospital\nout of hours idiom\noutpatients\nPICU\nsocialized medicine\nward\nSee more results »\nAdd to word list\nAdd to word list\na person hurt or killed in a war or other destructive event, or something prevented by an event: The number of casualties from Sunday's tsunami continues to rise. New team uniforms were a casualty of the budget cuts.\nAdd to word list\nAdd to word list\nsomething or someone that suffers or fails because of an event: a casualty of sth Nonprofit groups may find funding for their projects among the first casualties of the budget problem. Relationships can become a casualty of workplace stress.the first/latest/major casualty Smith is the latest casualty in a series of sackings at the organization.\nLAW a person who is killed or injured in an accident, attack, etc.: cause/inflict casualties Food products have been contaminated, causing human casualties and considerable economic loss. reduce/minimize/prevent casualties sustain/suffer casualties\nINSURANCE property that is damaged or destroyed in an accident, or the accident that causes this: The hirer was liable for the collision, unless the casualty was proved to have been caused by the failure of the boat's owners to make it seaworthy."}