{"id":89588,"name":"catalogue","type":"noun","us_sound":"ˈkæt̬.əl.ɑːɡ","us_link":"../audio/c/catalog.mp3","uk_sound":"ˈkæt.əl.ɒɡ","uk_link":"../audio/c/ukcaste017.mp3","content":"catalogue noun\n(LIST)\nAdd to word list\nAdd to word list\nB2 [ C ] a book with a list of all the goods that you can buy from a shop: a mail-order catalogue\nHanna Siamashka/iStock/Getty Images Plus/GettyImages\n[ C ] a list of all the books, paintings, etc. that exist in a place\nMore examplesFewer examplesDo you often buy goods from mail-order catalogues?Our autumn catalogue is now available from our usual stockists.Granddad was browsing through a seed and plant catalogue.I've sent off for a catalogue, as I can't get in to their Cambridge shop nowadays.If you order goods from the catalogue, they usually arrive within the week.\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nhit list\nhonor roll\nhonours list\nindices\ninventory\nrecital\nregistrable\nroll of honour\nroster\nrota\nthe White Pages\nwait list\nwaiting list\nwedding list\nwhitelist\nSee more results »\ncatalogue noun\n(BAD EVENTS)\n[ S ] A catalogue of unwanted events is a series of them: The whole holiday was a catalogue of disasters. a catalogue of errors/crimes/complaints\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\nchain reaction\nchapter\ncycle\ninline\nlinearity\nlinearly\nlitany\nmerry-go-round\npriority\nprocession\nsecondly\nsequence\nsequencing\nstring\ntrain\nwave\nSee more results »\nto record something, especially in a list: Many plants become extinct before they have even been catalogued.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmisclassification\nmisclassify\nmiscode\nmislabel\nmisorder\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\nAdd to word list\nAdd to word list\na book that contains a list of all the products that you can buy from a company, including descriptions and prices for each product: The auction house produces a catalogue full of colour photographs for each sale, available two weeks beforehand.\n(also mail order catalogue) a book that contains pictures and prices of products that customers can order and that the company delivers to their homes: Vertbaudet is a children's clothing catalogue. \"Internet sales haven't replaced catalogue sales but have brought in new customers,\" he said. The best advice is to buy charity Christmas cards direct from the catalogue. See also\nback catalogue\ncard catalogue\nonline catalogue\nto make a written record of things in the form of a list in a particular order: They will be hiring an archivist to continue the work of cataloguing the family's possessions."}