{"id":89659,"name":"catapult","type":"noun","us_sound":"ˈkæt̬.ə.pʌlt","us_link":"../audio/c/catapult.mp3","uk_sound":"ˈkæt.ə.pʌlt","uk_link":"../audio/c/ukcaste022.mp3","content":"Add to word list\nAdd to word list\na device that can throw objects at a high speed: In the past, armies used catapults to hurl heavy stones at enemy fortifications. On that type of aircraft carrier, a catapult was used to help launch aircraft.\nZargonDesign/ iStock / Getty Images Plus/GettyImages\nUK (US slingshot) a Y-shaped stick or piece of metal with a piece of elastic (= material that stretches) attached to the top parts, used especially by children for shooting small stones\niamwayclick/ iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nArms & munitions in general\nair-to-air\nair-to-ground\nammo\nammunition\nanti-aircraft\nchain mail\nchemical weapon\nconventional\ndenuclearize\ngunship\nmustard gas\nnerve gas\noffensively\nordnance\npoison gas\nsarin\nstab vest\nweapons of mass destruction\nweapons-grade\nWMDs\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHand weapons\nToys & dolls\nto throw someone or something with great force: When the two vehicles collided, he was catapulted forwards. be catapulted into something\nto suddenly experience a particular state, such as being famous: The award for best actress meant that almost overnight she was catapulted into the limelight.\nSee more\nSMART Vocabulary: related words and phrases\nThrowing\narm\ncast\nflick\nheave\nhurl\noutpitch\noverhand\npeg\npelt\nproject\nshy\nsling\nstone\nthread\nthrow something in\ntoss\nunderarm\nunderhand\nwang\nwhang\nSee more results »\nAdd to word list\nAdd to word list\nto become famous or important very suddenly, in the process moving beyond others who had been more famous or important: The album of hit songs catapulted her almost overnight into national stardom.\nSomething or someone that is catapulted is thrown forward with great force or speed."}