{"id":89728,"name":"catch","type":"verb","us_sound":"kætʃ","us_link":"../audio/c/catch.mp3","uk_sound":"kætʃ","uk_link":"../audio/c/ukcaste029.mp3","content":"catch verb\n(TAKE HOLD)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to take hold of something, especially something that is moving through the air: catch hold of He caught hold of my arm. I managed to catch the glass before it hit the ground. We saw the eagle swoop from the sky to catch its prey. Our dog ran past me and out of the house before I could catch it. We placed saucepans on the floor to catch (= collect) the drops of water coming through the roof. The batsman was caught (out) (= someone in the other team caught the ball when he hit it).\nThesaurus: synonyms, antonyms, and examples\nto take hold of something throwncatchCatch the ball!pounceThe veteran striker pounced and lashed home a goal.snagUS He snagged the line drive for the last out in the inning.gloveIt's a pop fly to left field, and the outfielder gloves it easily.interceptShe intercepted the pass and scored a goal.\nSee more results »\nMore examplesFewer examplesJenny stood with her feet slightly apart, ready to catch the ball.He caught the rope and knotted it around a post.She caught the ball in mid-air.He caught me at the precise moment that I fainted.She bought a net to catch butterflies.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\ncatch verb\n(STOP ESCAPING)\nB1 [ T ] to find and stop a person or animal that is trying to escape: Great pressure was put on the police to catch the terrorists as soon as possible. [ + -ing verb ] Two armed men were caught trying to cross the frontier at night. They were happy because they had caught a lot of fish that day.figurative I can see you're busy right now, so I'll catch you (= speak to you) later.\nThesaurus: synonyms, antonyms, and examples\nto find and take a person who has done something wrongcatchThey were caught trying to smuggle cigarettes across the border.arrestHe was arrested on suspicion of causing criminal damage to property.place/put under arrestThe suspect was placed under arrest and charged with armed assault.captureThe soldiers were captured by enemy forces.apprehendThe police have apprehended two individuals in connection with the crime.nabThe cops nabbed him as he tried to get away.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take a wild or loose animalcatchThe dog got out, but we caught her.netWe netted a ton of fish downstream.trawlCommercial fisheries trawl these waters for cod.trollThey troll for tuna far offshore. lassoThe cowboys learned at a young age how to lasso horses and steers.trapThe turtles are trapped for their flesh.\nSee more results »\nMore examplesFewer examplesPolice set up roadblocks on all roads out of the town in an effort to catch the bombers.Soldiers who deserted and were caught were shot.The robber was caught when someone tipped off the police.Thousands of illegal immigrants are caught and deported every year.I caught the dog by the collar and dragged it out of the room.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\ncatch verb\n(DISCOVER)\nB2 [ T ] to discover, see, or realize something, especially someone doing something wrong: [ + -ing verb ] He caught her reading his old love letters. If the virus is caught (= discovered) in time, most patients can be successfully treated. catch someone's attention, imagination, interest, etc.\nB2 to make someone notice something and feel interested: A ship out at sea caught his attention.\nSee more be caught without something\nto not have something, especially when it is needed: He doesn't like to be caught without any biscuits in the house.\nSee more you won't catch someone doing something (or you won't catch someone somewhere)\nsaid to mean that you will certainly not see someone doing a particular thing or in a particular place: You won't catch me at work after four o'clock.\nSee more\nMore examplesFewer examplesShe was fired after she was caught stealing from her employer.She was caught driving at 120 mph.I caught him looking through my private papers.He caught me staring out of the window.It's embarrassing to be caught telling a lie.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\ncatch verb\n(GET TRANSPORT)\nA1 [ T ] to travel or be able to travel on an aircraft, train, bus, etc.: He always catches the 10.30 a.m. train to work.\n[ T ] to be in time to travel on or do something: She was worried that she'd arrive too late to catch the last bus home.catch the post You'll have to run if you want to catch the post (= send something before the post has been collected).\nMore examplesFewer examplesWe caught the ferry across to Ireland.We caught the overnight flight from LA and got to New York at five this morning.She caught the train to Edinburgh.Do you get out of breath running to catch a bus?We arrived at the airport just in time to catch the plane.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAt the right time\ncatch verb\n(BECOME INFECTED)\nA2 [ T ] to get an illness, especially one caused by bacteria or a virus: catch a cold He caught a cold on holiday. A lot of children in the school caught measles last term.\nMore examplesFewer examplesDon't come too near me - you might catch my cold.Don't go out with wet hair, you might catch a chill.I'm feeling a bit feverish - I hope I haven't caught the flu.I don't know exactly what's wrong with her - she's caught some sort of virus.A lot of children in the school caught measles last term.\nSMART Vocabulary: related words and phrases\nPassing on illness & causing disease\naerosolize\ncommunicability\ncommunity transmission\ncontact tracer\ncontact tracing\nepidemic\nharbour\ninfect\ninfected\nnon-communicable\nnon-infected\nnon-infectious\nnoncarrier\nnoncontagious\ntransferable\ntransmissibility\ntransmissible\ntransmit\ntransmittable\nunhygienic\nSee more results »\ncatch verb\n(SEE/HEAR)\n[ T ] to manage to hear or see something, so you understand or remember it: I couldn't catch what the announcer said, with all the other noise going on. Did you catch the car's number plate?\n[ T ] to go to a place in order to see or watch something, such as a film or show: Here are some of the exhibitions you should catch this summer. I was home in time to catch the evening news.US Would you like to catch a movie some time? catch sight of/catch a glimpse of\nto manage to see something for a short time: We caught sight of a rabbit as it hopped into the bushes.\nSee more\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naurally\nbe all ears idiom\ncloth ears\near\nearshot\neavesdrop\neavesdropper\neavesdropping\ngrommet\nhark\nhearing\nlend\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing the eyes\ncatch verb\n(STICK)\nC2 [ I or T ] to stick somewhere, or to make something stick somewhere: The sleeve of my jacket (got) caught on the door handle and ripped. Her hair got caught (up) in her hairdryer.\nSMART Vocabulary: related words and phrases\nTearing and breaking into pieces\napart\nasunder\nbobble\nbobbly\nbreak into pieces\nchip\ncrack\ndismantle\nfall apart\nfall to pieces idiom\nfragment\nfragmentation\nfragmented\nrip\nsnag\nsplinter\nsplit\nsunder\ntear something apart\ntear something up\nSee more results »\ncatch verb\n(HIT)\n[ T ] to hit something, especially without intending to: caught in the crossfire Medical teams were caught in the crossfire of the opposing armies. His head caught the edge of the table as he fell.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\ncannon\ncollision\ncrash\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\ncatch verb\n(INVOLVE)\nget caught up in something\nC2 to become involved in something, often without wanting to: They were having an argument and somehow I got caught up in it.\nSee more\ncatch verb\n(BREATHE)\ncatch your breath\nto stop breathing for a moment, or to begin to breathe correctly again after running or other exercise: I had to sit down and catch my breath.\nSee more\ncatch verb\n(BE TOUCHED BY)\ncatch the sun UK\nIf you have caught the sun, the sun has made your skin a slightly darker brown or red colour: You've caught the sun on the back of your neck.\nSee more catch the light\nIf something catches the light, a light shines on it and makes it look shiny: She was wearing a spectacular silver gown whose sequins caught the light.\nSee more\ncatch verb\n(BURN)\ncatch fire\nB1 to start burning: For reasons which are not yet known, the factory caught fire late yesterday evening.\nSee more\n[ I ] to begin to burn: This wood's too wet, the fire won't catch.\nSMART Vocabulary: related words and phrases\nBurning, burnt & on fire\nafire\naflame\nblaze\nburn (something) down\nburn sb up\nburned out\nburnt out\ncombustible\ncombustion\nconsume\nflare\nfrazzled\nincinerate\ninflammable\non fire idiom\npost-burn\nreignite\nscald\nself-immolation\nunburnable\nSee more results »\nIdioms\ncatch a break\ncatch and face\ncatch someone's eye\ncatch someone napping\ncatch someone red-handed\ncatch someone with their pants/trousers downPhrasal verbs\ncatch on\ncatch someone out\ncatch (someone) up\ncatch up\ncatch someone up on something\ncatch up with someone\ncatch noun\n(CATCHING STH)\n[ C ] an act of catching a ball or other object that is moving through the air: I missed the catch and threw the ball back to him rather crossly. She grabbed the glass just before it hit the floor. \"Good catch,\" he said.\n[ U ] the activity of throwing and catching something, usually a ball, for fun: We didn't have a ball so we played catch with a lime. I remember games of catch in the playground when I was growing up.\n[ C ] in sports such as cricket and baseball, an act of ending an opponent's turn to hit the ball by taking hold of a ball that they have hit before it touches the ground: Crowe made a fine catch in the outfield. She dived full length and pulled off an amazing catch.\n[ C ] a fish or an amount of fish caught: The fishermen were disappointed with their catch that day. One of my best catches was a big silver salmon.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous games & activities\nCricket\nBaseball & rounders\ncatch noun\n(PROBLEM)\n[ S ] a hidden problem or disadvantage: what's the catch Free food? It sounds too good to be true. What's the catch?\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nchill\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nstumbling block\nteaser\nteething troubles\nthorn in your flesh/side idiom\ntie someone up\nSee more results »\ncatch noun\n(NOTICING STH)\n[ C ] an act of noticing a mistake or problem and doing something to correct or solve it: Thanks for pointing out that the picture has the wrong caption. Good catch! A car stopped for a traffic offence turned out to be stolen, so that was a good catch.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPerceptive\ncatch noun\n(FASTENING DEVICE)\n[ C ] a small device on a door, window, bag, etc. that keeps it fastened\nSMART Vocabulary: related words and phrases\nBuilding: locks & locksmithing\nbolt\ncombination\ncombination lock\ndeadbolt\ndeadlock\nfastener\nfob\nkey chain\nkey fob\nkey ring\nkeycard\nkeyhole\nlock\nlockbox\nlocksmith\nmaster key\nmortise lock\npadlock\nskeleton key\nYale lock\nSee more results »\ncatch noun\n(SUITABLE PARTNER)\n[ C ] informal a person who is considered to be very suitable as a romantic or marriage partner: My mother considered a doctor to be a good catch. Her new boyfriend's not much of a catch really, is he?\ncatch noun\n(STIFFNESS)\n[ C or U ] Indian English a feeling of stiffness in part of your body: She would complain of catch in the joints during winter.\nSMART Vocabulary: related words and phrases\nProblems with bones, joints & teeth\nanti-plaque\nanti-rachitic\nanticaries\narthrosis\nbruxism\ncaries\ncarpal tunnel syndrome\ndislocate\nfissure\ngrowing pains\nhousemaid's knee\nkyphosis\nlordosis\nmaxillofacial\nmyelomeningocele\nossification\nossify\ntartar\ntennis elbow\ntrigger finger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral bodily disorders\ncatch verb\n(TAKE HOLD)\nAdd to word list\nAdd to word list\n[ I/T ] to take or get hold of a moving object, or to hold and prevent someone from getting away: [ I ] She tossed him the car keys and yelled, “Catch!” [ T ] He sneaked into the fairgrounds without paying and hoped nobody would catch him.\ncatch verb\n(DISCOVER)\n[ T ] to discover, find, or become aware of something: If the disease is caught in time, most patients get well quickly. I hope I catch all the mistakes in my term paper.\ncatch verb\n(SEE)\n[ T ] to see or hear something or someone, or to understand: I’m sorry, I didn’t quite catch what you said.\ncatch verb\n(TRAVEL)\n[ T ] to travel or be able to travel on a train, bus, aircraft, etc.: He always caught the 6:05 train out of Grand Central.\ncatch verb\n(BECOME INFECTED)\n[ T ] to get an illness: I caught a cold. Idioms\ncatch your breath\ncatch someone’s eye\ncatch fire\ncatch someone off guard\ncatch sight of someone/something\ncaught up in something\nsomeone wouldn’t be caught deadPhrasal verbs\ncatch on\ncatch on\ncatch up\ncatch up\ncatch up on something\ncatch noun\n(PROBLEM)\n[ C ] infml a hidden problem or disadvantage: That sales price sounds too good to be true – there must be a catch to it somewhere.\ncatch noun\n(DEVICE)\n[ C ] a small device with a movable part that is used to fasten something: The catch on the bracelet is broken.\ncatch noun\n(TAKING HOLD)\n[ C/U ] the act of taking hold of something that is thrown or comes through the air: [ C ] The ball was hit well, but the centerfielder made a leaping, one-handed catch to end the game.\n[ C/U ] Catch is also the activity of throwing and receiving a ball with another person: [ U ] My kids are always begging me to play catch.\ncatch sb off guard/by surprise\nAdd to word list\nAdd to word list\nto surprise someone and cause difficulty for them: A lot of taxpayers will be caught off guard by their new tax liability\ncatch sb's eye/catch the eye of sb\nto get someone's attention, or to be noticed by someone: The high-profile plan has caught the eye of a national audience.\nbe/get caught up in sth\nto become involved in something, often without wanting to: The firm was caught up in the near-collapse of one of the world's largest hedge funds. Phrasal verbs\ncatch on\ncatch sb out\ncatch up\na hidden problem or disadvantage: The catch is that during the calendar year you can only make six withdrawals from your account.\na new employee that a company is very pleased to have because they are very valuable: He is a super-bright economist who is a real catch for the department."}