{"id":89765,"name":"catchup","type":"noun","us_sound":"ˈkætʃ.ʌp","us_link":"../audio/c/cbedus01360.mp3","uk_sound":"ˈkætʃ.ʌp","uk_link":"../audio/c/cbeduk01360.mp3","content":"catchup noun\n(WITH NEWS, LEVEL)\nAdd to word list\nAdd to word list\n[ C ] UK (also catch-up) a meeting or conversation in which people discuss what has happened since the last time that they met: I'm seeing my boss for a catch-up next week. Whether it's an after-work dinner, a catchup with friends or family, or a romantic meal for two, this restaurant has what you need.\n[ C or U ] mainly US (also catch-up) the process of reaching the same standard, stage, or level as someone or something else: These companies have a lot of catch-up to do, and whole product lines to replace with modern technology. This is a much needed catch-up after years of underinvestment. play catch-up\nto try to reach the same standard, stage, or level as others after you have fallen behind them: They raced ahead into new markets, leaving other companies to play catch-up. England had to play catchup, twice overcoming one-goal deficits.\nMore examplesFewer examplesAre you guys free for a catchup on Friday?We need to get together and have a catch-up soon.Much of the big rise in unemployment is merely a catchup to where it would have been heading all along.While there is no doubt that the per capita incomes of the Hispanic community still fall far behind those of whites, several studies show catchup taking place as the community grows and becomes more diverse.The core issue is how to promote \"achievement catch-up\" for minority and low-income students.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncheck in\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npick\npick someone/something up\npropagation\nradio silence\nrapporteur\nreach\nring\ntinkle\ntransmit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nBeing or appearing similar or the same\nCompeting and contending (non-sporting)\nCompeting in sport\ncatchup noun\n(TELEVISION)\n[ U ] (also catch-up) →\ncatch-up TV : You can watch it on catch-up.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\nghost image\ngoggle-box\nHD\nHDTV\nhigh def\nplasma screen\nreceiver\nreveal\nsmart TV\nsquare-eyed\nsubtitler\nsweep\ntelegenic\nthe small screen phrase\nSee more results »\ncatchup noun\n(SAUCE)\n[ U ] US another spelling of\nketchup : The burger has catchup and mustard.\nSMART Vocabulary: related words and phrases\nSauces, dressings, dips & pickles\naioli\naji\nAlfredo\napple sauce\narrowroot\ncustard\ncustard powder\ndashi\ndeglaze\ndemi-glace\nmint sauce\nmirin\nmiso\nmolasses\nMornay\nsalsa\nsambal\nscalloped\nsecret sauce\nshoyu\nSee more results »\nused to describe something that helps you reach the same standard, stage, or level as others, usually after you have missed something such as lessons or opportunities to practise: If there is a shortfall, you may be required to make hefty catch-up payments. catchup classes/sessions See also\ncatch-up TV\nMore examplesFewer examplesThe catch-up programme was introduced in 2001, when pupils who were performing below national standards at 11 were given extra lessons.We want to encourage former female employees to come back to us and offer them catchup training.Districts also have experimented with extended school days and catchup courses for lagging students.There will be regular feedback and catch-up sessions.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\nchancer\nclose-run\ncompetition\ncompetitive\ndare\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\njostle\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\ntake something on\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things"}