{"id":89823,"name":"category","type":"noun","us_sound":"ˈkæt̬.ə.ɡri","us_link":"../audio/c/category.mp3","uk_sound":"ˈkæt.ə.ɡri","uk_link":"../audio/c/ukcatch011.mp3","content":"Add to word list\nAdd to word list\nB2 (in a system for dividing things according to appearance, quality, etc.) a type, or a group of things having some features that are the same: There are three categories of accommodation - standard, executive, and deluxe.\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nMore examplesFewer examplesThere's a prize for the fastest three runners in each category.Each category has several subdivisions.He's running in the veterans category.The produce is sorted into categories according to quality.There are sporty people and non-sporty people, and I'm definitely in the second category.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\nclassification\nderivative\nfood group\nform\ngenre\nmark\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubclassification\nsubstance\nupdate\nSee more results »\nAdd to word list\nAdd to word list\na grouping of people or things by type in any systematic arrangement: The light trucks weigh less than 5,000 pounds and are in a category that includes minivans, pickups, and sport utility vehicles. categorization noun [ U ] us/ˌkæt̬·ɪ·ɡər·əˌzeɪˈʃən/\nI admire the careful categorization of his files. categorize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkæt̬·ɪ·ɡəˌrɑɪz/\nThe books are categorized by subject.\nAdd to word list\nAdd to word list\na group of people or things that have similar features: a category of sth The use of the four categories of customer is to ensure that marketing messages are effective. Four of the six job categories that gained the most workers in the last 10 years pay below the state average. At just under five pounds, it's one of the lightest laptops in its category. See also\nproduct category"}