{"id":90197,"name":"caucus","type":"noun","us_sound":"ˈkɑː.kəs","us_link":"../audio/c/eus70729.mp3","uk_sound":"ˈkɔː.kəs","uk_link":"../audio/c/ukcatsu009.mp3","content":"Add to word list\nAdd to word list\n(a meeting of) a small group of people in a political party or organization who have a lot of influence, or who have similar interests: The new Senator has expressed her intention to join the Women's Caucus and the Progressive Caucus. During a private caucus last Wednesday, more than 200 G.O.P. lawmakers argued for four hours over the proposal.\nin the US, a meeting held to decide which candidate a political group will support in an election: The initial selection is made, not by the electorate, but by party caucuses or committees.\nMore examplesFewer examplesThe Canadian Prime Minister expelled her from the Liberal caucus.At the time he was head of the Congressional Black Caucus. The Arizona Representative wouldn't comment to reporters on what he said in the caucus.Not only was he the choice of his party's nominating caucus, but he had served longer at the national level than his rival candidates.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nOfficial meetings\nin the US, to be a member of a country's law-making group and meet with other members of your own or other parties to discuss and support a particular cause: The Senate was tied 49-49 between the two parties, with two independents caucusing with the Democrats. Both parties caucused to plan their strategies, then returned to the bargaining table.\nin the US, to attend a meeting of a local political party or group, especially in order to decide which candidate to support in an election: He and his 18-year-old daughter both caucused for Obama.\nMore examplesFewer examplesThere was a risk of him crossing the aisle and caucusing with the Republicans.He had threatened to quit caucusing with the Democrats if he lost the chairmanship of the committee.Republicans were caucusing in the cafeteria.The Senator said they were caucusing to work on the financial package and would continue until they were ready to vote on a budget.The last 100 days before people start voting and caucusing are crucial in a campaign.Minnesotans are rebellious. Instead of caucusing for a candidate, many insist on fighting on an issue.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nPolitics - general words\nElections\nVoters & candidates in elections\nAdd to word list\nAdd to word list\npolitics &amp; government a meeting of the people who run a political party to plan activities and to decide which people the party will support in an election\npolitics &amp; government A caucus is also a group of people within a larger organization, esp. Congress, who have similar interests: the Congressional Black Caucus\nAdd to word list\nAdd to word list\nPOLITICS a group of people with influence or an interest in something who meet to consider a particular issue or problem: He added that his caucus would fight to restore the governor's health care plan.\nMEETINGS in the US, a meeting held to decide which person a political party will support in an election: party/Democratic/Republican caucus The amendment would have eliminated the party caucus system for choosing candidates."}