{"id":90336,"name":"cause","type":"noun","us_sound":"kɑːz","us_link":"../audio/c/cause.mp3","uk_sound":"kɔːz","uk_link":"../audio/c/ukcatsu018.mp3","content":"cause noun\n(REASON)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the reason why something, especially something bad, happens: The police are still trying to establish the cause of the fire. She had died of natural causes. I wouldn't tell you without (good) cause (= if there was not a (good) reason). I believe we have/there is just cause (= a fair reason) for taking this action.\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\nC2 [ U ] a reason to feel something or to behave in a particular way: He's never given me any cause for concern.\nMore examplesFewer examplesOne common cause of homelessness is separation or divorce.They are demanding an inquiry into the cause of the accident.I don't really think he had any cause to complain.Sugar is a major cause of tooth decay.Forensic scientists are examining the wreckage for clues about the cause of the explosion.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMotives and reasons\ncause noun\n(PRINCIPLE)\nC1 [ C ] a socially valuable principle that is strongly supported by some people: They are fighting for a cause - the liberation of their people. I'll sponsor you for £10 - it's all in a good cause.\nMore examplesFewer examplesHer study has considerably advanced the cause of equal rights.Environment protesters have made common cause with local people to stop the motorway being built.He has always shown great dedication to the cause.Vegetarianism is one cause she does not espouse.He has probably done more to further the cause of interracial harmony than any other person.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nB2 to make something happen, especially something bad: The difficult driving conditions caused several accidents. [ + obj + to infinitive ] The bright light caused her to blink. Most heart attacks are caused by blood clots. [ + two objects ] I hope the children haven't caused you too much trouble. Synonyms\nbring\ninflict\nvisit something on/upon someone old use or formal\nwreak formal\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\nMore examplesFewer examplesSitting hunched over a computer all day can cause problems.Some types of paint on toys can cause lead-poisoning in children.The bomb was designed to cause the maximum amount of damage.He's always trying to cause trouble between us.Smoking can cause respiratory diseases.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nbecause: I'll host the party cause I've got plenty of room at my house. I try to practise my French every day, cause I'm not very good at it. Synonym\ncos UK not standard\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\nbecause\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nview\nwith a view to doing something idiom\nSee more results »\ncause noun\n(REASON)\nAdd to word list\nAdd to word list\n[ C/U ] something without which something else would not happen: [ C ] The investigation will determine the cause of the airplane accident. [ C ] She studied the causes of human behavior.\n[ C/U ] Cause is also reason for doing or feeling something: [ U ] He had just cause to feel disturbed by these events. [ U ] There is no cause for alarm.\ncause noun\n(PRINCIPLE)\n[ C ] an idea or principle strongly supported by some people: He devoted himself to charitable causes and gave away millions of dollars. cause verb [ T ] us\nYour browser doesn't support HTML5 audio\n/kɔz/\nThe wind and rain caused several accidents."}