{"id":90703,"name":"ceiling","type":"noun","us_sound":"ˈsiː.lɪŋ","us_link":"../audio/c/ceiling.mp3","uk_sound":"ˈsiː.lɪŋ","uk_link":"../audio/c/ukcaval029.mp3","content":"ceiling noun\n(TOP OF A ROOM)\nAdd to word list\nAdd to word list\nA2 [ C ] the inside surface of a room that you can see when you look above you\ndejan Jekic/ iStock / Getty Images Plus/GettyImages\nExamples\nI got a crick in my neck from painting the ceiling.The ceiling was embellished with flowers and leaves.On the bathroom ceiling, some pieces of plaster had fallen away.There was no air conditioning, just a ceiling fan turning slowly.I want the light fittings to be flush with the ceiling.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\ndais\ndecking\ndownstairs\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\nmulti-levelled\nrostrum\nrunway\nsoapbox\nsplit-level\nstorey\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nceiling noun\n(LIMIT)\nC2 [ C usually singular ] an upper limit, usually relating to money: They have imposed/set a ceiling on pay rises. See also\nglass ceiling\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat out phrase\ngive a hundred percent idiom\nleast\nlimit\nmass\nmax out\nmaximal\nmaximally\nmaximum\nmin.\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRange and limits\nAdd to word list\nAdd to word list\nthe upper surface of a room that you see when you look above you: The kitchen ceiling needs painting.\nA ceiling is also an upper limit put on something that varies: There is a 10% ceiling on rent increases.\nAdd to word list\nAdd to word list\nthe highest level, number, or amount something is allowed to reach: Before the bidding started he had set himself a ceiling price beyond which he would not go.a debt/spending/production ceiling They agreed on a spending ceiling over the next five years of between 1.2% to 1.3%.the ceiling on sth The good news is that the ceiling on teachers' earnings has been removed.the ceiling for sth We will keep within the ceiling for public spending and do better if we can.place/put a ceiling on sth Ceilings are placed on interest rates by the government to provide firms with cheap capital.set/impose a ceiling The staff ceiling was originally set at 35 but has slowly risen to 50.reach/exceed a ceiling The $7.4 trillion national debt ceiling is likely to be reached in the next few days.lower/raise a ceiling The budget restrictions, signed into law in July, lowered the ceiling on how much districts' budgets can grow annually. See also\nglass ceiling"}