{"id":91052,"name":"censor","type":"noun","us_sound":"ˈsen.sɚ","us_link":"../audio/c/censor.mp3","uk_sound":"ˈsen.sər","uk_link":"../audio/c/ukceleb028.mp3","content":"Add to word list\nAdd to word list\na person responsible for examining books, films, works of art, or communications, and deciding whether to prevent parts or the whole of them from being seen or made available to the public because they are considered to be offensive or harmful, or because they contain information that someone wishes to keep secret, often for political reasons: Military censors prevented the publication of some details. a government censor\na computer tool used to hide parts of a text, image, recording or communication, or to prevent it from being shared: They try to filter out offensive posts using automatic censors.\nthe part of a person’s mind that stops them from doing or saying things that they want to do or say, if those things would be unsuitable: The show was accused of exploiting insecure people who lack an internal censor.\nMore examplesFewer examplesGame censors refused to give the new video game a classification.Early in his career the director fell foul of government censors.I can imagine that what he said will cause outrage but we do not want to act as censors.Censors include automatic filters that block posts containing sensitive keywords.Religion sometimes plays the role of censor to the urgings of our subconscious.\nSMART Vocabulary: related words and phrases\nPeople who analyse and judge\nadjudicator\narbiter\nbasher\nclass warrior\nco-investigator\ncriticaster\nempiricist\nexaminer\nexternal examiner\nfinal arbiter\njudge\njury\nmoderator\nmonitor\npanel\npanellist\nrating agency\nreferee\nreviewer\nstar chamber\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nMind and personality\nto prevent part or the whole of a book, film, work of art, document, or other kind of communication from being seen or made available to the public, because it is considered to be offensive or harmful, or because it contains information that someone wishes to keep secret, often for political reasons: The book was heavily censored when first published. Is it possible to censor the internet? censor yourself\nto stop yourself from doing or saying things that you want to do or say, but that you know would be unsuitable: She is brutally frank, and doesn't censor herself in any way. I don't censor myself and if people don't like what I write, well, they can stop reading it. I don't like having to censor myself. It makes for very dull writing. His perceived reluctance to censor himself may yet turn out to be his great strength. Her views proved to be very controversial and, in time, she learned to censor herself.\nMore examplesFewer examplesThe editors censored my comments that were critical of the press.He objected to the list of websites being censored.Officials deny they are censoring the news media.If offensive language is used, the post may be removed or censored.He believes rap should be a way to express yourself without having to censor yourself.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndecertification\ndecertify\ndisallow\ndisqualification\ndisqualify\noff-limits\nout of bounds idiom\noutlaw\nprohibit\nprohibition\nunapproved\nunauthorized\nunkosher\nunsanctioned\nverboten\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvoiding action\nAdd to word list\nAdd to word list\nto remove parts of something, such as a book, movie, or letter, that you do not want someone to see or hear: She opposes efforts to censor the Internet.\na person who censors something"}