{"id":91069,"name":"censure","type":"noun","us_sound":"ˈsen.ʃɚ","us_link":"../audio/c/censure.mp3","uk_sound":"ˈsen.ʃər","uk_link":"../audio/c/ukceleb030.mp3","content":"Add to word list\nAdd to word list\nstrong criticism or disapproval: His dishonest behaviour came under severe censure.\nSMART Vocabulary: related words and phrases\nDisapproving & criticizing\nanathematize\nanimadversion\naspersion\naw\nbackbite\nboo\ncriticism\ndeprecate\ndim\nfulminate\nniggle\nnot hold with something\nobloquy\nopprobrious\nopprobriously\nopprobrium\npeanut gallery\npersonalize\nsatirize\ntear\nSee more results »\nto express strong criticism or disapproval: Ministers were censured for their lack of decisiveness during the crisis. The likelihood is that he will be severely censured and possibly also fined. Synonyms\nattack (CRITICIZE)\ncastigate formal\nchastise (CRITICIZE) formal\ncondemn\ncriticize\ndamn (BLAME)\ndecry formal\ndenounce (CRITICIZE)\nexcoriate formal\nrail formal\nrevile formal\nslam informal\nThesaurus: synonyms, antonyms, and examples\nto show disapproval of someone or somethingcriticizeHe criticized the government's handling of the crisis.attackShe wrote an article attacking the judge and the way the trial had been conducted.condemnShe was condemned for her comments about the candidate.denounceThe government's economic policy has been denounced on all sides.come under fireThe government programme has come under fire for mismanaging funds.\nSee more results »\nMore examplesFewer examples The commission has the power to publicly censure or recommend the removal of judges.The parliament censured the president for his role in a pair of multimillion-dollar scandals. The bill permits a council to formally censure a councillor for misbehaviour.\nSMART Vocabulary: related words and phrases\nDisapproving & criticizing\nanathematize\nanimadversion\naspersion\naw\nbackbite\nboo\ncriticism\ndeprecate\ndim\nfulminate\nniggle\nnot hold with something\nobloquy\nopprobrious\nopprobriously\nopprobrium\npeanut gallery\npersonalize\nsatirize\ntear\nSee more results »\nAdd to word list\nAdd to word list\nstrong criticism or disapproval, esp. when it is the official judgment of an organization censure verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈsen·ʃər, -tʃər/\nThe Senate rarely censures its members.\nAdd to word list\nAdd to word list\nstrong criticism or disapproval: The former brokers, charged with selling unsuitable investments, face censure and fines of $10,000 each.\nto criticize someone officially: censure sb for sth Ministers were censured for their lack of decisiveness during the crisis. EU lawmakers refused to censure the European Commission over its handling of a fraud scandal last year."}