{"id":91298,"name":"centrism","type":"noun","us_sound":"ˈsen.trɪ.zəm","us_link":"../audio/c/cdo1121uscent0844.mp3","uk_sound":"ˈsen.trɪ.zəm","uk_link":"../audio/c/cdo1121ukcent0865.mp3","content":"Add to word list\nAdd to word list\npolitical beliefs or policies that are at the centre of the range of political opinions: His strategy generally values consensus and centrism over ideology. The new Prime Minister was urged to move leftwards, away from his predecessor's centrism. Related word\ncentrist\nMore examplesFewer examplesMany analysts today believe that centrism and even liberalism is virtually dead.Some in the party could be tempted into an arch-conservative revolt against her centrism.He sees them as pointlessly clinging to the fraying labels of \"liberalism\" (now most often wishy-washy centrism) and \"conservatism\" (which has taken a radically hard-right turn).Some Republicans were dissatisfied with his centrism, saying \"He wasn't partisan enough.\"\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nSovietism\nthe awkward gang idiom\nthe lunatic fringe idiom\nSee more results »\nthe fact of having a particular type of person, place, or thing as your most important interest; the quality of being seen from the point of view of a particular type of person, place, or thing: The Academy has been accused of Eurocentrism and gender bias. The artist's newest ventures embody his commitment to ecocentrism. Related word\n-centricSee also\nAfrocentrism\nAnglocentrism\nanthropocentrism\nethnocentrism\nEurocentrism\nphallocentrism\nMore examplesFewer examplesAs a writer he is known for his New York-centrism, his obsession with the city.The drawback to emphasizing the importance of the individual is that it can lead to unhealthy egocentrism. Biocentrism explains how life is not a mere accident of physics, but is essential to the existence of the universe.His conversations with lesbians led him to critique male dominance and heterocentrism.I share your sentiment about the male-centrism of some parts of our religion.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncon\nconvention\ndemesne\nfront\nin terms of phrase\nkingdom\nleitmotiv\nprovince\nscene\nscore\nspecialism\nsubject\ntalk\nthematic\ntheme\ntopically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassionate or passing interests"}