{"id":91245,"name":"centre","type":"noun","us_sound":"ˈsen.t̬ɚ","us_link":"../audio/c/eus70754.mp3","uk_sound":"ˈsen.tər","uk_link":"../audio/c/ukcensu007.mp3","content":"centre noun [C]\n(MIDDLE)\nAdd to word list\nAdd to word list\nA2 the middle point or part: There was a large table in the centre of the room. the town centre centre of attention\nC2 the person or thing that everyone is most interested in and pays most attention to: She's the centre of attention everywhere she goes. be at the centre of something\nto be most involved in a situation: Mark was at the centre of the argument. A social worker was at the centre of the scandal.\nMore examplesFewer examplesThey've got a fabulous apartment in the centre of Paris.Make a fold across the centre of the card.I love those chocolates with the caramel centres.Is that cake cooked properly in the centre?Try to hit the centre of the target.\nSMART Vocabulary: related words and phrases\nCentres of objects\nbowel\ncentral\ncentrality\ncentrally\ncentre of gravity\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternal\nmid\nmiddle\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFamous people\nTaking part and getting involved\ncentre noun [C]\n(PLACE)\nA2 a place or building, especially one where a particular activity happens: a sports/leisure/health centre a garden/shopping centre Grants will be given to establish centres of excellence (= places where a particular activity is done extremely well) in this field of research.\nMore examplesFewer examplesThe centre provides expert advice for people with financial problems.He's gone down to the health centre to collect his prescriptions.He works in a sports centre instructing people in the use of the gym equipment.In the refugee centres we saw many children whose stomachs were distended because of lack of food.Have you seen the designs for the new shopping centre?\nSMART Vocabulary: related words and phrases\nPublic buildings\nart gallery\nbasilica\nbath\nbathhouse\nchancellery\nchancery\ngallery\nguildhall\nhall\nHall of Fame\ninformation centre\npavilion\npublic library\nreference library\nregister office\nregistry\nregistry office\ntelephone exchange\ntown hall\nziggurat\nSee more results »\nC2 in politics, the people in a group who hold opinions that are not extreme but are between two opposites: His political views are known to be left of/right of centre. a centre left party\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nSovietism\nthe awkward gang idiom\nthe lunatic fringe idiom\nSee more results »\nto put something in the middle of an area: Centre (= put at equal distances from the left and right sides of the page) all the headings in this document.\nSMART Vocabulary: related words and phrases\nCentres of objects\nbowel\ncentral\ncentrality\ncentrally\ncentre of gravity\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternal\nmid\nmiddle\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nPhrasal verb\ncentre around/on something\nAdd to word list\nAdd to word list\na building, office, etc. that is used for a particular business or activity: a conference centre The retailer has a customer service centre in Dundee and distribution centres in Dundee and Livingston.\nan area, city, or country which is known for a particular business or activity and where a lot of business, etc. takes place: centre for sth Hong Kong has long been recognized as a centre for the production of jade jewellery.commercial/financial/industrial centre Dubai is acknowledged to be the commercial centre of the Middle East.\nespecially UK the main part of a town or city, where most of its offices, stores, etc. are: town/city centre Most commuters travel into the city centre by public transport.\nthe centre\nthe central department in a company or organization: For the immediate future, the Sydney branch will be run from the centre. See also\nassessment centre\nbusiness advice centre\nbusiness centre\nbuying centre\ncall centre\ncivic centre\ncontact centre\ncost centre\ndata centre\ndistribution centre\nView all\nenterprise centre\nexhibition centre\njob centre\nmoney centre\nprofit centre\nservice centre\nshopping centre"}