{"id":91210,"name":"central","type":"adjective","us_sound":"ˈsen.trəl","us_link":"../audio/c/central.mp3","uk_sound":"ˈsen.trəl","uk_link":"../audio/c/ukcensu016.mp3","content":"central adjective\n(NEAR THE MIDDLE)\nAdd to word list\nAdd to word list\nB1 in, at, from, or near the centre or most important part of something: central Europe/London Of course, you pay more for premises with a central location (= in or near the centre of a town).\nMore examplesFewer examplesSome late news has just come in - a bomb has exploded in central London.In many churches the side aisles are separated from the central aisle by a row of arches.The bridge's central support gave way, tipping the coach into the river.The large central diamond is surrounded by eight smaller stones.I love the wide open spaces of central Australia.\nSMART Vocabulary: related words and phrases\nCentres of objects\nbowel\ncentrality\ncentrally\ncentre\ncentre of gravity\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternal\nmid\nmiddle\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\ncentral adjective\n(IMPORTANT)\nC2 main or important: a central role Community involvement is central to our plan.\nMore examplesFewer examplesI failed to grasp the film's central concept.Eugenics was the central, and most controversial, part of his social philosophy.The central character of the play is a flaky neurotic.The central argument of the book is that some of the plays were not written by Shakespeare.The central character is a malevolent witch out for revenge.\nSMART Vocabulary: related words and phrases\nImportant and essential things\n-based\namenity\nbare\nbe-all\nbig league\nflagship\nfocal point\ngrandaddy\nheavyweight\nhot button\nimperative\nkeynote\nneed\nnexus\nnub\nnucleus\npivot\nprecondition\nprerequisite\nthe grandaddy of something idiom\nSee more results »\ncentral adjective\n(ORGANIZATION)\nC1 [ before noun ] controlled or organized in one main place: central authorities the US central bank central planning\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nflabbily\nget up\nget your act together idiom\ngold command\nhave/get your shit together idiom\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nan area of central Scotland that was one of nine local government regions until 1996: At that time she worked for Central Regional Council.\nMore examplesFewer examplesCentral was one of the 12 regions into which Scotland was divided from 1975 to 1996.Central was formed in 1975 by bringing together the traditional county areas of Stirlingshire and Clackmannanshire, plus parts of the west side of the traditional county of West Lothian.As a region, Central was the upper of two tiers of local government.Listen to our Traffic Scotland Radio broadcast for Central, Tayside and Fife.\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEssex\nfife\nfl.\nFlintshire\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\ncentral adjective\n(NEAR THE MIDDLE)\nAdd to word list\nAdd to word list\nin, at, from, or near the center: He grew up in central Illinois.\ncentral adjective\n(IMPORTANT)\nmain or important: American novels often take money as their central concern.\ncentral adjective\n(CONTROLLED)\n(of something having separate parts) controlled from a single place or by a single organization: A central computer tracks reservations.\nAdd to word list\nAdd to word list\nmain or important: be central to sth Offshore production is central to the strategies of some of the world's most powerful businesses. Communication plays a central role in developing trust within an organization.\nin or near the centre of something: You will have to pay more for offices in a central location. central London\ncontrolled or organized from one place or by one single authority: central control/government/authority Without a strong central authority, the country faces imminent collapse.\ncontrolling other smaller organizations, departments, etc.: The company announced the relocation of its central office to a greenfield site outside the capital. centrally adverb\ncentrally located offices a centrally managed service department"}