{"id":91259,"name":"centric","type":"adjective","us_sound":"ˈsen.trɪk","us_link":"../audio/c/cdo0623uscent0445.mp3","uk_sound":"ˈsen.trɪk","uk_link":"../audio/c/cdo0623ukcent0443.mp3","content":"Add to word list\nAdd to word list\ncentral, or having a centre: There are two opposing centric forces that may well be irreconcilable. Transfers of income and property within the family may be centric or non-centric.\nanatomy\n&#160; specialized relating to a nerve centre (= a group of nerves with a particular function)\nmedical\n&#160; specialized used by dentists to describe the way a person's upper and lower teeth come together in their mouth: Your chewing muscles can play a major role in allowing your joints to move symmetrically into the centric relation position. Centric occlusion is a functional relationship of the teeth.\nMore examplesFewer examplesThere are two basic shapes: pennate, which is elongated, or centric, which is round.More than 25 different types of centric fusion have been identified so far. What we are really trying to do is engage a community that has a centric interest in efficient and effective dialogue.\nSMART Vocabulary: related words and phrases\nCentres of objects\nbowel\ncentral\ncentrality\ncentrally\ncentre\ncore\nhub\ninner ring\ninnermost\ninside\ninterior\ninteriority\ninteriorly\ninternal\nmid\nmiddle\nmidpoint\nmidway\noff-centre\nthe bowels of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe brain & nervous system\nThe teeth\nhaving a particular type of person, place, or thing as your most important interest; seen from the point of view of a particular type of person, place, or thing: The stores' customer-centric approach has yielded dividends. The picture of British attitudes is clearly more complex than a London-centric view would lead us to conclude. We need computers to be able to assist people in a humancentric way.\nMore examplesFewer examplesThis male-centric family sitcom is based on the comedian's macho observations about home life.We have developed a unique, data-centric approach.The deals are an important step toward the company's goal of moving from being US-centric to something that is truly global.\"He's basically a conventional liberal with a Manhattan-centric view of the world,\" she says.She is best known as the director of youthcentric indie films such as \"Thirteen\".\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nevangelical\nevangelistic\nevangelistically\nexcited\nexcitedly\nfevered\ngo ahead\nmood\nnuts\nomnivorous\nomnivorously\non the edge of your seat idiom\nzestful\nzestfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nRelated word\n-centrismSee also\nAfrocentric\nAnglocentric\nanthropocentric\nethnocentric\nEurocentric\nphallocentric"}