{"id":91745,"name":"ceremonial","type":"adjective","us_sound":"ˌser.ɪˈmoʊ.ni.əl","us_link":"../audio/c/eus75506.mp3","uk_sound":"ˌser.ɪˈməʊ.ni.əl","uk_link":"../audio/c/ukcereb005.mp3","content":"Add to word list\nAdd to word list\nB1 related to, used in, or involving a ceremony (= a fixed set of formal acts performed on important social or religious occasions): A Marine honour guard flanks the president during ceremonial events at the White House. The men were dressed in ceremonial black robes. Compare\nceremonious\nMore examplesFewer examplesThe exhibition consists of more than 400 religious artifacts and ceremonial objects.The queen, in full ceremonial dress, presided over the ceremony.There was a ceremonial presentation of the keys to the new library.The appointments are purely ceremonial, and the positions do not carry any real political power.\nSMART Vocabulary: related words and phrases\nCeremonies\nanti-ritualism\ncavalcade\nceremonially\nceremony\ncommemorate\nguard of honour\nhara-kiri\ninitiation ceremony\ninstallation\ninvestiture\nknight\nmaster of ceremonies\nmemorial service\npageant\nrequiem\nribbon cutting\nrite of passage\nritual\nritualistic\ntroop\nSee more results »\nRelated word\nceremonially\n(a set of) formal acts, often fixed and traditional, performed on important social or religious occasions: Westminster Abbey is used for ceremonials. Mounted troopers perform a spectacular piece of ceremonial. Synonym\nceremony\nMore examplesFewer examplesThere is no code of duty in the New Testament, no ceremonial.These ancient people developed pottery and basketry, and elaborate ceremonials. In ceremonials and externals the Elizabethan church retained many features which closely resembled those of the Catholic church.\nSMART Vocabulary: related words and phrases\nCeremonies\nanti-ritualism\ncavalcade\nceremonially\nceremony\ncommemorate\nguard of honour\nhara-kiri\ninitiation ceremony\ninstallation\ninvestiture\nknight\nmaster of ceremonies\nmemorial service\npageant\nrequiem\nribbon cutting\nrite of passage\nritual\nritualistic\ntroop\nSee more results »"}