{"id":91672,"name":"cerebral","type":"adjective","us_sound":"ˈser.ə.brəl","us_link":"../audio/c/cerebral.mp3","uk_sound":"ˈser.ə.brəl","uk_link":"../audio/c/ukcereb001.mp3","content":"Add to word list\nAdd to word list\nmedical\n&#160; specialized relating to the brain or the cerebrum: He suffered a cerebral haemorrhage. The patients frequently had a history of disease leading to cerebral damage.\nformal demanding or involving careful thinking and mental effort rather than feelings: She makes cerebral films that deal with important social issues. Chess is cerebral; video games are visceral.\nformal intelligent and serious, and enjoying serious thought rather than emotion: His problem wasn't his policies; it was his personality. He was simply too cerebral and too out of touch with Middle America.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nMore examplesFewer examplesThe patient had poor cerebral blood flow.This readable but cerebral novel asks serious questions about art and life. His advisors tried to persuade him to take a more emotional, less cerebral approach. The film is a comedy, but it is far from slapstick; it was made by cerebral writer-director David O. Russell.\nSMART Vocabulary: related words and phrases\nLogic and reason\na fortiori\na posteriori\na priori\nanalytic\nantinomy\nhypothetical\nhypothetico-deductive\nillogical\nillogicality\nillogically\nnon sequitur\nnon-empty\nnon-logical\nnon-rational\nnon-theoretical\ntautological\ntautologically\nteleological\nteleology\ntheoretical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelating to particular parts of the body\nIntelligence\nIntelligent people\nAdd to word list\nAdd to word list\nrelating to the brain, esp. the front part of the brain"}