{"id":91852,"name":"certain","type":"adjective","us_sound":"ˈsɝː.tən","us_link":"../audio/c/eus70760.mp3","uk_sound":"ˈsɜː.tən","uk_link":"../audio/c/ukcereb012.mp3","content":"certain adjective\n(WITHOUT DOUBT)\nAdd to word list\nAdd to word list\nB1 having no doubt or knowing exactly that something is true, or known to be true, correct, exact, or effective: [ + (that) ] Are you absolutely certain (that) you gave them the right number? I feel certain (that) you're doing the right thing. You should make certain (that) everyone understands the instructions. The police seem certain (that) they will find the people responsible for the attack. [ + question word ] I'm not certain how much it will cost. He was quite certain about/of his attacker's identity. One thing is certain - she won't resign willingly. know/say for certain\nC1 to know or say something without doubt: I don't know for certain if she's coming.\nSee more\nMore examplesFewer examplesI'm absolutely certain I left my purse on the desk.I feel certain I'm right.He's not certain whether to invest in the property market.Make certain that we have enough drink for the party.It is by no means certain that we'll finish the project by June.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCertainty\ncertain adjective\n(EXTREMELY LIKELY)\nB1 impossible to avoid or extremely likely: [ + to infinitive ] The population explosion is certain to cause widespread famine. Oil prices are certain to rise following the agreement to limit production. After all his hard work, he's certain to pass his exams. The team looks almost certain to win the match. [ + (that) ] It is virtually certain (that) she will win the gold medal. Even if a ceasefire can be agreed, how can they make certain (that) neither side breaks it? Cancer sufferers no longer face certain death as they once did. This scandal will mean certain defeat for the party in the election.\nMore examplesFewer examplesHis execution became certain when the state board refused his request for commutation.With Steve Lewis at the helm, we are certain of success.Reducing the number of staff is certain to inflame the already angry medical profession.It is by no means certain that we'll finish the project by June.She is riding the fastest horse and is certain to romp home.\nSMART Vocabulary: related words and phrases\nInevitable\nall roads lead to Rome idiom\nautomatic\nbe (only) a matter of time idiom\nbe damned if you do and damned if you don't idiom\nbe nothing for it idiom\nbe part and parcel of something idiom\nimplacable\nimplacably\ninalienable\ninalienably\nineluctable\ninexorably\ninsuppressible\nit can't be helped idiom\nrelentless\nrelentlessly\nseal\nunavoidably\nunstoppable\nunstoppably\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCertainty\nPossible and probable\ncertain adjective\n(NAMED)\n[ before noun ] formal named but neither famous nor known well: I had lunch today with a certain George Michael - not the George Michael, I should explain.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\ngiven name\ngood name\nidentity\nilk\nJnr\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\ncertain adjective\n(LIMITED)\n[ before noun ] limited: I like modern art to a certain extent/degree, but I don't like the really experimental stuff.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncould count something on (the fingers of) one hand idiom\ndrabs\nmeasly\nmild\nmildness\nmingy\nminimal\nminimally\npiffling\nremote\nscantly\nslenderly\nslenderness\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nB1 particular but not named or described: We have certain reasons for our decision, which have to remain confidential. Do you think war is justifiable in certain circumstances? Certain members of the audience may disagree with what I'm about to say. a certain\nB2 used before a noun when it is difficult to describe something exactly or give its exact amount: The song has a certain appeal, but I'm not sure what it is. I felt a certain sense of joy that his candidacy had failed. I must admit that she has a certain glamour about her. For all his fine qualities, he lacked a certain self-restraint. It's an entertaining movie, but there's a certain predictability about it.\nMore examplesFewer examplesThe disease seems to be specific to certain types of plant.Some people find that certain foods trigger their headaches.It's against the law to leave children under a certain age alone in the house.Farmers are eligible for government support if they let a certain amount of land lie fallow.I'm allergic to certain foods.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ndemesne\nespecially\nindividual\nindividualistically\nindividuality\nindividualized\nindividually\nindividuate\nmatter\nper capita\npersonally\npet\nprivate\nrespectively\nseparately\nseverally\nSee more results »\nsome: Certain of the candidates were well below the usual standard, but others were very good indeed.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\nfaintly\nfairly\nha'porth\nhalfway\nish\nlightly\nlittle\nmildly\npretty\nquite\nrather\nremotely\nseveral\nsome\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\ncertain adjective\n(KNOWING TO BE TRUE)\nAdd to word list\nAdd to word list\nknowing that something is true or will happen and having no cause to feel that it may not be true or may not happen; having no doubt: \"I think Emily is going to pick up Judy.\" \"Are you certain?\" One thing is certain – supporters of the bill are not giving up. [ + (that) clause ] I’m certain (that) he’ll be there. [ + question word ] I’m not certain how much it will cost. When you report a robbery, make certain a police report is filled out (= check that this happens).\ncertain adjective\n(PARTICULAR)\nparticular but not named or described: Parents expect their kids to leave home at a certain point.\ncertain adjective\n(LIMITED)\n[ not gradable ] some but not exactly stated; limited: She enjoys sports to a certain extent. There’s a certain amount of exaggeration in all ads.\ncertain pronoun us\nYour browser doesn't support HTML5 audio\n/ˈsɜrt·ən/\nCharges were filed against certain of the company’s directors.\nsum certain\nAdd to word list\nAdd to word list\nLAW a particular amount of money stated in an agreement that cannot be changed: The $10 million price is sum certain."}