{"id":91874,"name":"certification","type":"noun","us_sound":"ˌsɜ˞ː.t̬ə.fɪˈkeɪ.ʃən","us_link":"../audio/c/cdo0318uscert0851.mp3","uk_sound":"ˌsɜː.tɪ.fɪˈkeɪ.ʃən","uk_link":"../audio/c/cdo0318ukcert0284.mp3","content":"Add to word list\nAdd to word list\nthe process of earning an official document, or the act of providing an official document, as proof that something has happened or been done: He earned certification to fly single-engine aircraft. Fairtrade is a certification that guarantees producers in the developing world are paid a fair price for their crops. a programme for the certification of X-ray technicians See\ncertificate\nMore examplesFewer examplesThe agency provides certification of acupuncture practitioners. The community will be responsible for certification of compliance with water quality standards.There are no fewer than nine different certification bodies for organic food.Certification will teach you the basics of exercise safety, but it's experience that makes a great trainer.\nSMART Vocabulary: related words and phrases\nQualifications: school & vocational\nA level\nAS level\nbac\nbaccalaureate\nbona fides\nCSE\ndiploma\nGCE\nGCSE\nGED\nHND\nHSC\nHSED\nmatric\nnon-degree\nparaprofessional\nqualification\nrecertification\nVantage\nWaystage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOfficial documents\nAdd to word list\nAdd to word list\nproof or a document proving that someone is qualified for a particular job, or that something is of good quality: [ C ] Adult workers are increasingly going back to school for a degree or certification to improve their job opportunities. [ U ] He will seek organic certification of his beef and poultry products.\nAdd to word list\nAdd to word list\nthe process of giving official or legal approval to a person, company, product, etc. that has reached a particular standard: certification in sth The new division received $10,000 in training funds that will help staff gain certification in insurance procedures.certification as sth Our products were awarded certification as compliant with all the relevant standards. We need experienced pilots with multiengine and instrument certification. certification programme/process/requirements"}