{"id":92306,"name":"chairman","type":"noun","us_sound":"ˈtʃer.mən","us_link":"../audio/c/uscld01834.mp3","uk_sound":"ˈtʃeə.mən","uk_link":"../audio/c/ukcld01834.mp3","content":"Add to word list\nAdd to word list\na person in charge of a meeting or organization Synonym\npresidentCompare\nchairwoman\nExamples\nSidney ruthlessly clawed his way up from the position of junior clerk to chairman of the company .In his closing remarks, the chairman thanked everyone who had helped.\"Let's draw this meeting to a close, gentlemen, \" said the chairman.I interviewed the chairman of the company in his seventh-floor eyrie.The chairman said that he would now take questions from the floor .\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncouncil\ncounter-power\ndean\ndeputy\ndominatrix\nmistress\nmovers and shakers\nmulti-headed\nofficer\nofficialdom\nvice presidency\nvice president\nvicegerency\nvicegerent\nwarden\nSee more results »\nAdd to word list\nAdd to word list\na person in charge of a meeting, organization, or department; a chairperson Note: Although chairman can refer to a person of either sex, chairperson or chair is often preferred to avoid giving the idea the person is necessarily male.\nAdd to word list\nAdd to word list\nMEETINGS a person, especially a man, who is in charge of a meeting: The chairman called the meeting to order. See also\nchair noun\nchairperson\nchairwoman\na person who is in charge of a committee or an organization: appoint sb (as) chairman He was appointed chairman of the British Bankers' Association.serve/resign/step down as chairman She has decided to step down as chairman next year.\nWORKPLACE, MANAGEMENT a person who is in charge of a large company, especially the chairman of the board: appoint sb (as) chairman She was one of the few women to be appointed chairman of a FTSE 100 company.serve/resign/step down as chairman After serving as chairman for the past five years, he will retire at the end of the next financial year. The chairman's role includes managing the board's business and acting as its facilitator and guide.deputy/vice chairman Dr Johnson was not only vice chairman but also one of the founders of the company.\nSee also\nexecutive chairman"}