{"id":92265,"name":"chain","type":"noun","us_sound":"tʃeɪn","us_link":"../audio/c/chain.mp3","uk_sound":"tʃeɪn","uk_link":"../audio/c/ukceylo013.mp3","content":"chain noun\n(CONNECTED THINGS)\nAdd to word list\nAdd to word list\n[ C ] a series of things of the same type connected in a line, or a series of people standing in a line: The synthetic polymer is a plastic composed of long chains of molecules. As part of the centenary celebrations a chain of beacons was lit across the country. Peace campaigners formed a chain around the military base.\n[ C ] a line of connected mountains: The Rockies are a mountain chain in the western USA. These peaks are all part of the same Himalaya chain.\nB2 [ C ] a set of connected events, usually where one causes the next: His resignation was followed by a remarkable chain of events. In the story, a chain of cause and effect leads us on an emotional journey of two families. Intervention like this can break the chain of debt and worry. See also\nblockchain\ncarbon chain\ncold chain\nfood chain\nKeychain\nsupply chain\nMore examplesFewer examplesVolunteers formed a chain to pass buckets of water along.If just one of the servers on that long chain is out of action, the whole system fails.Fiji is a small nation composed of a chain of islands.Colombia is intersected by three parallel Andean mountain chains.Greece's Peloponnese peninsula has a chain of mountain ranges dominated by Mount Taygetus. This type of attack triggers an unending chain of actions and reactions. The lawyers have to establish a chain of causation by which the specific acts of specific people led to this incident.\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\ncolumn\ncrocodile\nfile\ninterrow\nline\nqueue\nrank\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: hills & mountains\nEvents and occurrences\nchain noun\n(BUSINESSES)\n[ C ] a group of shops, restaurants, hotels, or other businesses owned by the same company : The supermarket chain announced that it was cutting the cost of all its fresh and frozen meat. She has built up a chain of 180 bookshops across the country. I prefer to shop at independent shops rather than chains.\nMore examplesFewer examplesThey are not only the world's biggest fast-food chain, but also the industry's trendsetter.Jonson has done the whole range of hotel work, from porter to owner of a large chain of hotels.I know it's a chain, but the food is good.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nchain noun\n(RINGS)\nA2 [ C or U ] (a length of) rings usually made of metal that are connected together and used for fastening, pulling, supporting, or limiting freedom, or as jewellery: The gates were locked with a padlock and a heavy steel chain. Put the chain on the door if you are alone in the house. Mary was wearing a beautiful silver chain around her neck. See also\nkey chain\nPM Images/DigitalVision/GettyImages chains\n[ plural ] another word for\nsnow chains : Bear in mind that you can only use chains where snow or ice protects the road surface from damage.\n[ plural ] a series of metal rings that are attached to two posts, used in American football to measure the distance between two points on the field : The referees had to bring out the chains to determine if the ball carrier got a first down.\nSee more in chains\ntied with chains: The hostages were kept in chains for 23 hours a day.\nSee more\n[ plural ] a fact or situation that limits a person's freedom: At last the country has freed itself from the chains of the authoritarian regime.\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\ncord\nfibre\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nlasso\nrein\nshackles\nshock cord\nstringed\nstringy\ntether\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLimiting and restricting\nchain noun\n(HOUSE SALE)\n[ C ] UK a situation in which someone selling a house cannot complete the sale because the person who wants to buy it needs to sell their house first: Some sellers refuse to exchange contracts with buyers who are in a chain.\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nencumbrance\nequity\nfirst-time buyer\nlandlady\nletting\nplanning blight\nreal estate broker\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nrepossession\nreverse mortgage\nSee more results »\nIdioms\noff the chain\nmove the chains\nchain verb [T usually + adv/prep]\n(PUT IN CHAINS)\nto fasten someone or something using a chain: It's so cruel to keep a pony chained up like that all the time. They chained themselves to lampposts in protest at the judge's decision.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nharness\nhobble\nhogtie\nknotted\nligature\nstake\nstrap something up\nstrop\ntack\ntape something up\ntether\ntie someone down\nSee more results »\nchain verb [T usually + adv/prep]\n(LINK)\n[ often passive ] (also chain together) to join objects together so that they form one long connected object: The beads are chained together in 7-foot lengths. He succeeded in chaining together a long string of synthetic genes to re-create a portion of the DNA of a simple bacterium.\n[ often passive ] (also chain together) to connect things so that they happen together, one after another: The system allows you to send individual commands or chain them together. These filters can be chained to each other to create sequences of filters. The second operation may be chained with the first operation, or performed separately.\nMore examplesFewer examplesUSB allows all your devices such as a keyboard, mouse, printer, etc. to be chained together and connected to a single USB port.The frames are containers for text that can be chained together to contain a single story. Make subtle changes to parts of the drum sequence by altering positions and rhythms, and chain them in a random order.The team managed to chain together some magical passages of play.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconvergence\ncor\ncross-Channel\ncumulate\ndesegregate\njunction\nkludge\nknit\nknock\nknock through something phrase\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinking and relating\nPhrasal verb\nchain someone to something\nchain noun [C]\n(CONNECTED RINGS)\nAdd to word list\nAdd to word list\na length of metal rings that are connected together and used for fastening or supporting, and in machinery: She looped the chain around her bike and locked it to the fence.\nA chain is also a length of connected rings worn as jewelry: Mary wore a silver chain around her neck.\nchain noun [C]\n(RELATED THINGS)\na set of connected or related things: a mountain chain a chain of supermarkets That set in motion a chain of events that changed her life forever.\nchain verb [T]\n(ATTACH)\nto tie or connect together with a chain: An old bicycle was chained to a post near the front door.\nIf you are chained to something, you work for long periods with it: I had no intention of spending my day chained to the stove.\nAdd to word list\nAdd to word list\nCOMMERCE a group of similar businesses, such as restaurants or hotels, which are all owned and controlled by the same organization: hotel/supermarket/fast-food chain The well-known fast-food chain has expanded to over 20,000 restaurants in 17 countries. chain restaurants/stores/retailers a chain of supermarkets/bookstores/department stores\na system of people, processes, or organizations that work together in a particular order: This unit examines the stages in the chain of production of tea, from the leaves in Sri Lanka to the cup in the UK.chain of command/power/authority Employee complaints were taken all the way up the corporate chain of command.\nPROPERTY\n&#160; UK a situation in which someone cannot complete the sale of their house because the person who wants to buy it needs to sell their house first: Some house sellers refuse to exchange contracts with buyers who are in a chain\nSee also\ndistribution chain\nproduction chain\nsupply chain\nvalue chain"}