{"id":92479,"name":"challenge","type":"noun","us_sound":"ˈtʃæl.ɪndʒ","us_link":"../audio/c/eus75508.mp3","uk_sound":"ˈtʃæl.ɪndʒ","uk_link":"../audio/c/ukceylo024.mp3","content":"challenge noun\n(DIFFICULT JOB)\nAdd to word list\nAdd to word list\nB1 [ C or U ] (the situation of being faced with) something that needs great mental or physical effort in order to be done successfully and therefore tests a person's ability: Finding a solution to this problem is one of the greatest challenges faced by scientists today. You know me - I like a challenge. It's going to be a difficult job but I'm sure she'll rise to the challenge.\nMore examplesFewer examplesEurope's finest golfers are getting ready for the challenge of the Ryder Cup.An awesome challenge lies ahead of them.Finding a cure for cancer is one of the biggest challenges facing medical researchers.I've promised to finish the task by Friday, but it's going to be quite a challenge.It could be a bit of a challenge getting the piano through the doorway.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidable\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\nonerous\nonerously\noverdemanding\npainstaking\npicnic\ntrickily\ntricky\ntuff\nultra-sensitive\nunintuitive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\nchallenge noun\n(INVITATION)\n[ C ] an invitation to compete or take part, especially in a game or argument: \"I bet you can't eat all that food on your plate.\" \"Is that a challenge?\" [ + to infinitive ] She issued a challenge to her rival candidates to take part in a public debate.\n[ C ] an invitation to do something difficult, funny, or embarrassing, especially on social media, often as a way of raising money for a good cause: The Ice Bucket Challenge, in which people filmed themselves being doused with icy water, raised awareness and over $100 million for the ALS Association.\nMore examplesFewer examplesHe issued Tom with a challenge to come out and fight.He thinks he can get to the top of the mountain quickest. That is his challenge to us.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\npit\nrunners and riders idiom\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\nchallenge noun\n(QUESTION)\nC2 [ C or U ] asking if something is true or legal: The result of the vote poses a serious challenge to the government's credibility. Because of the way this research was conducted, its findings are open to challenge.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nchallenge noun\n(INSTRUCTION)\n[ C ] an instruction given by a soldier or guard at a border or gate, telling someone to stand still and say their name and reasons for being there\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nchallenge noun\n(REFUSAL)\n[ C ]\n&#160; law\n&#160; specialized the act of refusing to accept someone as a member of a jury: A challenge to a member of the jury should be made before the trial begins.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\ndecline\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\nchallenge verb [T]\n(INVITE)\nto invite someone to compete or take part, especially in a game or argument: Tina has challenged me to a game of poker\nMore examplesFewer examplesThey challenged us to a game of football.Can I challenge you to a game of chess?\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\npit\nrunners and riders idiom\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\nthrow\ntoe\nSee more results »\nchallenge verb [T]\n(DOUBT)\nB2 to question if something is true or legal: Children challenge their parents' authority far more nowadays than they did in the past.\nMore examplesFewer examplesIt was courageous of her to challenge the managing director's decision.Six journalists sought to challenge in court the legality of the ban on broadcasting.UK Union representatives are planning to challenge New Labour policy at the party conference.They did not dare to challenge the sacred cow of parliamentary democracy.They challenged all our beliefs.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nchallenge verb [T]\n(TEST)\nto test someone's ability or determination\nSMART Vocabulary: related words and phrases\nMaking people excited and interested\nabsorbed\nanimate\nbe someone's bag idiom\nbedazzle\nbreathe\nbreathe (new) life into sth idiom\nengage\nintoxicate\nintrigue\noccupy\noverexcite\noverstimulate\nstir\nstretch\nsweep someone along\ntalk something up\ntantalize\nthe Thames\nthrill\nwhip\nSee more results »\nchallenge verb [T]\n(STOP)\nto tell someone at a border or gate to stand still and say their name and reasons for being there\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspect\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nchallenge verb [T]\n(REFUSE TO ACCEPT)\nlaw\n&#160; specialized to refuse to accept someone as a member of a jury\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\ndecline\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\nchallenge noun\n(DIFFICULT JOB)\nAdd to word list\nAdd to word list\n[ C/U ] something needing great mental or physical effort in order to be done successfully, or the situation of facing this kind of effort: [ C ] It’s a challenge being in a marriage when both partners have high-pressure jobs. [ C ] No matter how long you write, poetry remains a challenge. [ C ] Germany faces broad challenges in the coming years.\nchallenge noun\n(EXPRESSION OF DOUBT)\n[ C/U ] a questioning or expression of doubt about the truth or purpose of something, or the right of a person to have or do something: [ U ] Because of the way this research was done, its findings are open to challenge. [ C ] The president is clearly anticipating a new challenge to his authority.\nchallenge noun\n(COMPETITION)\n[ C ] something that competes with you or is a threat: The governor barely survived a challenge from an unknown opponent in the primary.\nchallenging adjective us\nYour browser doesn't support HTML5 audio\n/ˈtʃæl·ən·dʒɪŋ/\nFor a reporter, covering the White House is a challenging assignment.\nchallenge verb [T]\n(ASK TO COMPETE)\nto invite someone to take part in a competition: The other candidates challenged the president to take part in a debate.\nchallenge verb [T]\n(PRESENT A DIFFICULT TEST)\nto present tasks to someone that need great mental or physical effort in order to be done successfully: It’s easy enough to crank out college graduates, but a good education should really challenge them.\nchallenge verb [T]\n(EXPRESS DOUBT)\nto express or represent doubt about the truth of something: Advanced computers challenge long-held notions about intelligence and thought.\nAdd to word list\nAdd to word list\n[ C or U ] a job, duty, or situation that is difficult because you must use a lot of effort, determination, and skill in order to be successful: accept/face/meet a challenge After significant losses last year, the company now faces the challenge of trying to repair its reputation with investors.be/pose/present a challenge The weakness of the dollar could pose a challenge to the company's expansion plans. As a software developer he enjoys the challenge of working with cutting-edge technology. She was getting bored at work and felt she needed a new challenge. Finding time to do the work has proven a real challenge. a big/major/serious challenge\n[ C ] an invitation for someone to compete against you or for you to prove that you can achieve a particular goal: challenge from sb Responding to a challenge from dissident shareholders, the board approved a number of steps to enhance shareholder value.\n[ C ] an act of asking whether something is true or legal, or whether someone has the authority or right to do something: mount/launch a challenge against Unions are planning to launch a legal challenge against the airline for changing the work schedules of 14,000 cabin crew.\nto officially question whether something is true or legal, or whether someone has the authority or right to do something: Keep copies of all written correspondence to support your case if the company later challenges you for further payment. Corporate lawyers challenged the ban, but the court upheld it last year.\nto compete against someone or ask them to prove that they can achieve a particular goal: challenge sb to do sth Consumers are challenging manufacturers to adopt greener policies.\nto encourage someone to increase their skills, determination, abilities, etc. by making them do something new or difficult: People are just looking for jobs that will challenge and inspire them.\nto cause difficulties for someone or something: Local businesses have been greatly challenged by the recession."}