{"id":92627,"name":"champagne","type":"noun","us_sound":"ʃæmˈpeɪn","us_link":"../audio/c/champagne.mp3","uk_sound":"ʃæmˈpeɪn","uk_link":"../audio/c/ukchamo004.mp3","content":"Add to word list\nAdd to word list\nA2 (also Champagne) an expensive white or pink fizzy (= with bubbles) wine made in the Champagne area of Eastern France. Champagne is often drunk to celebrate something: We always celebrate our wedding anniversary with a bottle of champagne. The champagne corks were popping (= bottles of champagne were opened) when Guy got his new job. The cool climate and chalky soil are ideal for producing Champagne. Compare\nbubbly noun informal\nfizz noun (GAS BUBBLES) UK informal\nBurazin/ The Image Bank/GettyImages\na fizzy (= with bubbles) wine or drink that looks similar to champagne: There is non-alcoholic elderflower champagne for those that prefer it.\na pale gold colour similar to the colour of champagne: Make your eyes twinkle with neutral eye shadow shades like silver or champagne. This stylish phone is available in chic shades such as smoke, charcoal and champagne.\nMore examplesFewer examplesWe feasted on smoked salmon and champagne.I could hear the champagne fizz as he poured it into my glass.The champagne had caused his face to flush.You can take it as a given that there will be champagne at the wedding.Shall we go halves on a bottle of champagne?\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfull-bodied\ngrape\njeroboam\nLambrusco\nlay something down\nplonk\nplummy\nspumante\nsuper-smooth\ntable wine\nterroir\nultra-dry\nwiney\nzinfandel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nhaving a pale gold colour similar to the colour of champagne: She has three beautiful silk blouses—one dove grey, one champagne, and one sky blue. This season, retailers say champagne shades are popular for shoes.\nA champagne event is one at which champagne is served: He hosted a champagne reception for the cast and crew when they finished filming. Her fiancé treated her to a champagne breakfast. She was recovering from a night of champagne partying in nightclubs.\nA champagne life involves a lot of expensive pleasures: He turned his back on his champagne lifestyle when he got married. Her champagne life in top hotels was funded by crime. Imitation designer clothes are aimed at those with champagne tastes but a beer budget. Synonyms\nluxurious\nluxury\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ndun\nearth tone\nemerald\npeach\npuce\nsaffron\nsanguine\nsapphire\nsepia\nsky blue\nslaty\ntangerine\ntaupe\ntea rose\nverdure\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nExpensive & luxurious\nAdd to word list\nAdd to word list\na pale yellow or pink, bubbly wine made in France, or a similar wine from somewhere else: The newlyweds were toasted with champagne."}