{"id":92677,"name":"chance","type":"noun","us_sound":"tʃæns","us_link":"../audio/c/chance.mp3","uk_sound":"tʃɑːns","uk_link":"../audio/c/ukchamo008.mp3","content":"chance noun\n(OPPORTUNITY)\nAdd to word list\nAdd to word list\nB1 [ C ] an occasion that allows something to be done: I didn't get/have a chance to speak to her. [ + to infinitive ] If you give me a chance to speak, I'll explain. Society has to give prisoners a second chance when they come out of jail. He left and I missed my chance to say goodbye to him. I'd go now given half a chance (= if I had the slightest opportunity). Synonym\nopportunity\nThesaurus: synonyms, antonyms, and examples\na chance to do somethingchanceI didn't get a chance to say goodbye.opportunityEveryone will get the opportunity to comment.breakHer big break came when she was offered a role in a Spielberg movie.springboardHe hoped writing an opinion piece for The Times would be the springboard he needed to get into journalism.\nSee more results »\nMore examplesFewer examplesDon't tell anyone I'm leaving before I've had a chance to tell Anthony.We'd be glad of the chance to meet her.We are now offering you the chance to buy the complete set of pans at half price.Everyone will have a chance to make their views known at the meeting.She missed the chance of promotion when she turned down the job of assistant manager.\nSMART Vocabulary: related words and phrases\nOpportunity\nanother/a second bite at/of the cherry idiom\nbe in with a shout idiom\nbest bet idiom\nbig break\nbreak\nfish\nfoot\nhave a few, several, etc. irons in the fire idiom\nhay\nheadroom\nit's now or never idiom\nlast chance saloon\npass\nplatform\nscope\nshop window\nsmell blood idiom\nsneak peek\nthe American dream\nthe run of something idiom\nSee more results »\nchance noun\n(POSSIBILITY)\nB1 [ S or plural ] the level of possibility that something will happen: You'd have a better chance/more chance of passing your exams if you worked a bit harder. [ + (that) ] There's a good chance (that) I'll have this essay finished by tomorrow. There's a slim/slight chance (that) I might have to go to Manchester next week. If we hurry, there's still an outside (= very small) chance of catching the plane. \"Is there any chance of speaking to him?\" \"Not a/No chance, I'm afraid.\" I don't think I stand/have a chance of winning.UK John thinks they're in with a chance (= they have a possibility of doing or getting what they want). Her resignation has improved my chances of promotion. What are her chances of survival? [ + that ] What are the chances that they'll win? Synonym\nlikelihood\nThesaurus: synonyms, antonyms, and examples\nthe chance of something happeningchanceThere's a good chance he'll resign.probabilityWhat's the probability of winning?oddsWhat are the odds that she takes him back?likelihoodThe treaty increases the likelihood that the cease-fire will hold.possibilityThere's a distinct possibility I won't be able to make it to the pub tonight.\nSee more results »\nMore examplesFewer examplesThere's no chance of us getting there by eight.There's still an outside chance that Scotland will get through into the World Cup.She stands a good chance of passing her exam if she works hard.The doctors told my wife I had a 50/50 chance of survival.I must tell you in all honesty that there is little chance of the scheme being approved.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nliable\nmanage\nprobable\nprobably\nprospective\nprospectively\nrealm\ntend\ntip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChance and randomness\nchance noun\n(RISK)\nB2 [ C ] a possibility that something negative will happen: I'm delivering my work by hand - I'm not taking any chances. There's a chance of injury in almost any sport. Synonym\nrisk\nMore examplesFewer examplesThe doctor says there's no chance of contagion.The weather forecast said that there's an even chance of thunderstorms tonight .There is possibly less chance of another World War while the last one is within living memory.There's a chance that he might go bankrupt.Don't go climbing if there's any chance of bad weather.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang over something\nhazard\nhazardous\nhazardously\nhazmat\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nperil\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nchance noun\n(LUCK)\nB1 [ U ] the force that causes things to happen without any known cause or reason for doing so: Roulette is a game of chance. I got this job completely by chance. [ + (that) ] It was pure/sheer chance (that) we met. We must double-check everything and leave nothing to chance. by any chance\nC2 used to ask a question or request in a polite way: Are you Hungarian, by any chance?\nSee more\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\neven-money\nfluke\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nIdioms\nchance would be a fine thing\n(the) chances are\nnot give much for someone's chances\nchance verb\n(RISK)\n[ T ] to risk something: You'd be a fool to chance your life savings on a single investment.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ndare\nexpose\nhazard\nhigh wire\nhigh-stakes\nimperil\njeopardize\nlay\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nstick your neck out idiom\nSee more results »\nchance verb\n(LUCK)\n[ I ] old-fashioned or literary to happen or do something by chance: [ + to infinitive ] They chanced to be in the restaurant when I arrived. I chanced on/upon (= found unexpectedly) some old love letters in a drawer. Ten years after leaving school, we chanced on/upon (= unexpectedly met) each other in Regent Street.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\neven-money\nfluke\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nIdiom\nchance your arm\nhappening in a way that is not planned or does not have any known cause or reason: Her chance discovery of the letters led to their publication. a chance meeting/encounter\nThesaurus: synonyms, antonyms, and examples\nhappening by chance with no cause or reasonrandomIt was a random encounter between two long-lost friends.chanceA chance meeting brought them back together.arbitraryIt seems like the decision to cancel such a successful TV programme was completely arbitrary.haphazardHer cabinets were stuffed with a haphazard jumble of books, clothes, tins of soup, and papers.coincidentalAny similarity between the characters in this book and real people, living or dead, is purely coincidental.inadvertentA good editor will catch and correct all inadvertent typos in a text.\nSee more results »\nMore examplesFewer examplesTheir relationship began with a chance meeting on a ski lift in Vail, Colorado.A chance encounter with a disabled little boy would change his life.We do not know yet whether this reported small increase is a chance occurrence or something more signficant.Television programmes, newspaper articles, even chance events can trigger panic attacks.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\neven-money\nfluke\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nchance noun\n(OPPORTUNITY)\nAdd to word list\nAdd to word list\n[ C ] an occasion that allows something to be done; an opportunity: If you get a chance, come over and see me. You had many chances to back out of the deal, and you didn’t do it. She’d been a substitute on the team, and she wanted a chance to play every day.\nchance noun\n(LIKELIHOOD)\n[ U ] a level of possibility that something will happen; likelihood: I’ve applied to seven different universities, and there’s a good chance I’ll get into two of them.\nchance noun\n(RISK)\n[ C ] a possibility that something bad will happen; a risk: There’s a chance of injury in almost any sport. You don’t get anywhere in life without taking chances.\nchance noun\n(LUCK)\n[ U ] the happening of something in a way that no one could have known, so that it seems to have no cause: Four years ago we met by chance in Paris. Do you by any chance know when the last bus leaves tonight?\nchance verb\n(RISK)\n[ T ] to do something although it involves risk: It’s a very popular restaurant, and we may not get a table, but let’s chance it.\nchance verb\n(LUCK)\n[ I ] to happen or find something in a way that is not planned or expected: I chanced upon some old love letters in a drawer."}