{"id":92691,"name":"chancellor","type":"noun","us_sound":"ˈtʃæn.səl.ɚ","us_link":"../audio/c/chancellor.mp3","uk_sound":"ˈtʃɑːn.səl.ər","uk_link":"../audio/c/ukchamo011.mp3","content":"Add to word list\nAdd to word list\nC2 a person in a position of the highest or high rank, especially in a government or university: Helmut Kohl became the first Chancellor of a united Germany in 1990. A former politician has been appointed Chancellor of the university.\nUK the\nChancellor of the Exchequer (= the person in the UK government in charge of tax and government spending): The Chancellor will deliver his budget later today.\nMore examplesFewer examplesLast month's rise in inflation was described by the chancellor as only temporary.Do you have any surprises for us in your budget this week, Chancellor?Today the Chancellor of the university presented him with an honorary degree.The German chancellor, Gerhard Schroeder, arrived for talks at Downing Street today.If he is appointed to the post of university chancellor, his role will be mainly ceremonial.\nSMART Vocabulary: related words and phrases\nLeaders of national & regional governments\nchancellorship\nchief executive\nco-ruler\ncollector\ndoge\ngeneralissimo\ngovernor\ngovernorship\ngubernatorial\nhead of state\npremier\npremiership\nPres.\npresidency\npresident\nTaoiseach\nTánaiste\nveep\nvice president\nvice-presidential\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUniversity & college education\nGovernment ministers & civil servants\nRelated word\nchancellorship\nAdd to word list\nAdd to word list\na person in a position of the highest or high rank, esp. in a government or university: Helmut Kohl became the first chancellor of a united Germany in 1990.\nChancellor\nAdd to word list\nAdd to word list\nGOVERNMENT, FINANCE →\nChancellor of the Exchequer : With news of profit losses across the nation, the chancellor is expected to cut interest rates.\nGOVERNMENT a title used in some countries for an official position of high rank in a government, legal system, or university: She was the first woman chancellor of Germany. Chancellor Kohl the vice-chancellor of the university chancellorship noun [ S ] uk/ˈtʃɑːnsələʃɪp/ us/ˈtʃænsəlɚ-/\nDebt increased massively during his chancellorship."}