{"id":92763,"name":"change","type":"verb","us_sound":"tʃeɪndʒ","us_link":"../audio/c/change.mp3","uk_sound":"tʃeɪndʒ","uk_link":"../audio/c/ukchamo016.mp3","content":"change verb\n(BECOME DIFFERENT)\nAdd to word list\nAdd to word list\nA1 [ T ] to exchange one thing for another thing, especially of a similar type: She's just changed jobs. Let's change the subject (= talk about something different).\nA2 [ I or T ] to make or become different: I almost didn't recognize her - she'd changed so much. That was 20 years ago and things have changed since then. Nothing changes, does it - I've been away two years and the office still looks exactly the same. People have changed their diets a lot over the past few years. I'm going to change my hairstyle.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nB1 [ I or T ] UK (US exchange) to take something you have bought back to a shop and exchange it for something else: I had to change those trousers I bought for (= take them back to the shop in order to get) a bigger pair. change your mind\nB1 to form a new opinion or make a new decision about something that is different from your old one: If you change your mind about coming tonight, just give me a call.\nSee more change for the better\nto improve: Her attitude has definitely changed for the better since she started this new job.\nSee more change your ways\nto improve the bad parts of your behaviour: If he wants to carry on living here, he's going to have to change his ways and learn to be a bit less messy.\nSee more\nMore examplesFewer examplesHe said that he hadn't seen the traffic light change to red.They all tried to persuade him to change his decision.We don't expect the economic situation to change anytime soon.It sounds to me like you ought to change jobs.The weather in the hills can change very quickly, so take suitable clothing.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nchange verb\n(TRANSPORT)\nA2 [ I or T ] to get off a train, bus, etc. and catch another in order to continue a journey: I had to change (trains) twice to get there. Change at Peterborough for York.\nMore examplesFewer examplesThis train will terminate at the next stop - passengers who wish to continue should change trains.You should stay on the train until Manchester and then change.The only thing I'm worried about is changing trains at Kings Cross.You'll have to change buses when you get into Victoria, but your next bus doesn't leave for half an hour.It's an awkward trip - you have to change several times.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\nchange verb\n(MONEY)\nA2 [ T ] to get or give money in exchange for money, either because you want it in smaller units, or because you want the same value in foreign money: Could you change a £10 note (for two fives), please? Could you change a £5 note for me? I need to change my dollars for/into English money.\nMore examplesFewer examplesCan you change a tenner for two fivers?You can't pay in English money. You'll have to change some money at the bank.I need to change some of these travellers cheques.Will they change money at the hotel?He kindly changed my foreign currency for me.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank balance\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\nelectronic banking\ngiro\ninvestment bank\npin\nsafe deposit box\nstatement\nstress test\nsuperbank\nthe Square Mile\nSee more results »\nchange verb\n(CLOTHES/BEDS)\nA2 [ I or T ] to remove one set of clothes and put a different set on yourself or a young child, especially a baby, or to remove dirty sheets from a bed and put clean ones on it: You don't need to change - you look great as you are. I'll just change into (= get dressed in) something a bit smarter. Give me five minutes to change out of (= remove) my work clothes and I'll come out with you. How often do you think he changes his shirt? Could you change the baby (= the baby's nappy)? I've changed the sheets/the bed (= the sheets on the bed) in the guest room.\nMore examplesFewer examplesYou are going to change, aren't you? You can't go in those tatty old jeans.When did you last change the linen on the children's beds?I hadn't even changed when our first guests arrived, so Jeff had to cope on his own.I usually insist that he changes out of his work clothes before dinner.Can you make sure your brother doesn't walk in when I'm changing?\nSMART Vocabulary: related words and phrases\nPutting clothes on\narrayed\nbundle\nbundle (someone) up\ndoll\ndoll yourself up\ndolled up\ndress\nfling\nget up\nglam\nglam (yourself) up\nmake yourself respectable idiom\nmask\nredon\nrespectable\nrig\nrig someone out\nslip\nslip into something\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\nchange verb\n(WIND/SEA)\n[ I ] When the wind or the tide (= the rise and fall of the sea) changes, it starts to move in a different direction: The tide is starting to change.\nSMART Vocabulary: related words and phrases\nFloods, tides & currents\natmospheric river\ndeluge\neddy\nflash flood\nflood\nflood tide\nfloodplain\ngyre\nhigh tide\ninundation\nlow tide\noverwhelm\nsea level\nswash\ntidally\ntide table\nturbulence\nturbulent\nwaterline\nwhelm\nSee more results »\nchange verb\n(SPEED)\n[ I or T ] (US usually shift) to put a vehicle into a different gear, usually in order to change the speed at which it is moving: to change gear I changed into fourth (gear).UK Change down to go round the corner.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\nlock\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nIdioms\nchange (your) tack\nchange your tune\nchange handsPhrasal verbs\nchange something around\nchange over\nchange (something) up\nchange noun\n(BECOMING DIFFERENT)\nA2 [ C or U ] the act of becoming different, or the result of something becoming different: Let me know if there's any change in the situation. We're living in a time of great change. We need a change of government. a change in lifestyle They've made a lot of changes to the house. The new management will make fundamental/radical/sweeping changes (= do things in a very different way). Synonyms\nadjustment (CHANGE)\nalteration\namendment\nmodification (CHANGE)\nmutation\nB1 [ S ] something that is pleasant or interesting because it is unusual or new: It's nice to see her smile for a change. \"Shall we we eat in the garden?\" \"Why not - it'll make a change.\" We've always had a red car - it's time we had a change! change of scene\na new situation: She'd been with the same company for too many years and felt she needed a change of scene, so she applied for a job as a stage manager.\nSee more\nMore examplesFewer examplesThe minister has announced that there will be no change in government policy.The holiday was a welcome change.A lot of people were caught out by the sudden change in the weather.You're not planning a change of career, are you?The country is crying out for a change in leadership.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nunsteady\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nchange noun\n(MONEY)\nA2 [ U ] money in the form of coins rather than notes: She gave me €5 in change. My dad always used to carry a lot of loose/small change (= coins) in his pocket.\nTuomas Lehtinen/ Moment/GettyImages\n[ U ] smaller units of money given in exchange for larger units of the same amount: Do you have change for a 20-dollar bill?\nA2 [ U ] the money that is returned to someone who has paid for something that costs less than the amount that they gave: I think you've given me the wrong change.\nMore examplesFewer examplesHere's your change, darling.She delved into her pocket to find some change.He fumbled in his pockets for some change.He carefully pocketed his change.\"Have you got any change?\" \"Sorry, I've only got a five-pound note.\"\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\nchange noun\n(CLOTHES)\n[ C ] the action of putting on different clothes: She did a quick change before going on TV. a change of clothes\nA2 a set of clothes as well as the ones that you are wearing: You'll need a change of clothes if you're staying overnight.\nSee more\nSMART Vocabulary: related words and phrases\nPutting clothes on\narrayed\nbundle\nbundle (someone) up\ndoll\ndoll yourself up\ndolled up\ndress\nfling\nget up\nglam\nglam (yourself) up\nmake yourself respectable idiom\nmask\nredon\nrespectable\nrig\nrig someone out\nslip\nslip into something\nthrow\nSee more results »\nchange noun\n(TRANSPORT)\n[ C ] the action of getting off a train, bus, etc. and catching another in order to continue a journey: I hate journeys where you've got a lot of changes.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\nchange noun\n(BASEBALL)\n[ C ] US informal another name for a\nchangeup : He mixes his fastball in with a change and a slider.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nIdioms\nthe change (of life)\na change is as good as a rest\nchange of heart\nchange verb\n(BECOME DIFFERENT)\nAdd to word list\nAdd to word list\n[ I/T ] to make or become different, or to do, use, or get one thing in place of another thing: [ T ] I’ve changed jobs twice in the past ten years. [ T ] I changed my hairstyle – do you like it? [ I ] Attitudes about lots of things changed during the 1960s. [ I ] It’s surprising how fast kids change during their teen years.\n[ I/T ] To change over from one thing to something else is to stop doing or using one thing and to start doing or using another: [ I ] We just changed from oil heat to gas.\nchange verb\n(CLOTHES/BEDS)\n[ I/T ] to remove one set of clothes and put a different set on yourself or someone else, such as a baby, or to remove dirty sheets from a bed and put clean ones on it: [ I ] I’ll just change into (= put on) something a little dressier. [ T ] Could you change the baby/the baby’s diaper (= put on a clean one)? [ T ] I changed the sheets/the bed (= the sheets on the bed) in the guest room.\nchange verb\n(MONEY)\n[ T ] to get or give money in exchange for money, either because you want it in smaller units, or because you want the same value in foreign money: Can you change a $100 bill for me? I had to change some American money into pesetas before I arrived in Spain.\nchange verb\n(TRANSPORT)\n[ I/T ] to get off an aircraft, train, bus, etc. and catch another in order to continue a trip: [ T ] I had to change planes twice to get there. [ I ] Change at Hartford for the train to Springfield. Idioms\nchange hands\nchange your mind\nchange noun\n(BECOMING DIFFERENT)\na change\nA change often refers to something unusual or new that is better or more pleasant than what existed before: We decided we needed a change, so we went to Florida for a couple of weeks. Why don’t we eat on the porch for a change?\nchange noun\n(MONEY)\n[ U ] the difference in money, returned to the buyer, between what is paid for something and the lesser amount that it costs: It costs $17 and you gave me $20, so here’s your $3 change.\n[ U ] Change also refers to smaller units of money whose total value is equal to that of a larger unit: I need change for a $50 bill because I want to take a taxi. Do you have change for/of a dollar?\n[ U ] Change can refer to coins rather than bills: Bring a lot of change for using the public telephones.\nchange noun\n(CLOTHES/BEDS)\n[ C ] a set of clothes that is additional to the clothes that you are wearing: Bring a change of clothes with you in case we stay overnight.\nAdd to word list\nAdd to word list\n[ I or T ] to become or make something different, or to exchange something for something else: The company has changed considerably since I joined in 2005. She decided that it was time to change jobs.\n[ T ]\n&#160; MONEY to exchange an amount of money for the same value in another currency: If you're unable to change money before you travel, most international airports will have a bureau de change.change sth into sth Here you'll find the best exchange rate for changing your US dollars into euros.\n[ T ]\n&#160; MONEY to exchange a unit of money for coins or smaller units of paper money that add up to the same value: Could you change this twenty dollar bill for a ten and two fives? Many superstores have change machines where you can change your coins into banknotes.\n[ T ]\n&#160; COMMERCE\n&#160; UK to return something you bought to a store and exchange it for something new, for example because it was damaged or the wrong size. A store changes an item when it agrees to give a customer a new item in exchange for one that is damaged, etc.: Some places won't let you change items without a receipt. The store offered to change the faulty items or refund my money.\nchange hands\nto pass from one owner to another: More than 30 million shares changed hands in the first hour of business.\n[ C or U ] the process or result of making something different or becoming different: change to sth After making changes to its business model, the company's net profits increased by 22%.change in sth Owing to a change in policy, customers will now be charged a fee for early withdrawals.implement/make a change The new head of department is certain to make some changes.manage change One of the hardest aspects of being a top manager is managing change. a fundamental/major/significant change Please notify us of any change of address.\n[ U ]\n&#160; MONEY coins used as money: Do you have any change for the parking meter?\n[ U ]\n&#160; MONEY smaller units of money or coins given in exchange for a larger unit of money that is worth the same amount: Can you make change for a 100 dollar bill?\n[ U ]\n&#160; MONEY the money that is returned to you after you have paid for something that costs less than the amount you gave: I think the waiter gave me the wrong change. See also\nagent of change\nbureau de change\ncareer change\nchampion of change\nchange agent\nloose change\npocket change\nshort-change\nstep change"}