{"id":92797,"name":"channel","type":"noun","us_sound":"ˈtʃæn.əl","us_link":"../audio/c/channel.mp3","uk_sound":"ˈtʃæn.əl","uk_link":"../audio/c/ukchamo023.mp3","content":"channel noun [C]\n(BROADCASTING)\nAdd to word list\nAdd to word list\nA2 a television or radio station (= an organization that broadcasts television or radio programmes): a cable/terrestrial/satellite channel a music/movie/news/shopping/sports channel the news on Channel 4 She switched/turned to another channel to watch football. Millions tune in to our channel every morning to hear the local news.\na range of frequencies (= the numbers of waves produced within a particular period, especially one second) used to broadcast signals or radio or television programmes, especially those used by a particular station: Pilots are supposed to monitor one of two emergency radio channels in case they need to communicate with fighter interceptors. They broadcast on high-frequency channels.\nMore examplesFewer examplesThe commentary on the Olympic games was much better on the other channel.Press this button and the video will automatically tune itself to the next channel.Where's the gadget that you change channels with?This channel is only available on cable.We really don't need a dedicated sports channel as we don't watch much sport.Digital pictures can freeze if another signal is broadcast on or near the same channel.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\ngaffer\nghost image\ngoggle-box\nHD\nHDTV\nplasma screen\nreceiver\nshout-out\nsmart TV\nsquare-eyed\nsubtitler\nsweep\nthe small screen phrase\nzap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: radio\nchannel noun [C]\n(PASSAGE)\na passage for water or other liquids to flow along, or a part of a river or other area of water that is deep and wide enough to provide a route for ships to travel along: There are drainage/irrigation channels all over this flat agricultural land. The boats all have to pass through this narrow channel. the Channel\nthe area of sea that separates England from France: We're going to have a day-trip across the Channel. We took the car to France overnight on a (cross-)channel ferry.\nJuice Images/Cultura/GettyImages\nMore examplesFewer examplesThe rain ran down a small channel into the river.We swam through the channel into the harbour.They dug large channels to drain the fields.\nSMART Vocabulary: related words and phrases\nNavigation & shipwrecks\nastrolabe\ncelestial navigation\nchart\ncircumnavigate\ncircumnavigation\ndead reckoning\nfoghorn\nlane\nlightship\nlodestar\nnarrows\nnavigability\npassage\npilot\nquadrant\nsea lane\nsextant\nsubmersible\nthe Pole Star\nyaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBays & gulfs\nSeas & oceans\nchannel noun [C]\n(WAY OF COMMUNICATING, ETC.)\nC2 a way of communicating with people or getting something done: We must open the channels of communication between the two countries. The government pursued every diplomatic/official channel to free the hostages. Complaints should be made through the proper/usual channels.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nchannel noun [C]\n(ELECTRICAL)\nan electric circuit (= a closed system through which electricity can flow) that allows a signal to travel: For higher sound resolution, two of the audio channels can be combined.\nMore examplesFewer examplesSound can be heard from six speakers (five audio channels plus the subwoofer channel).The system attempts to better reproduce concert-hall musical performances by using four signal channels and four loudspeakers placed in a square around the listener.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nchannel noun [C]\n(MAKING AVAILABLE)\na way of making a product, information, etc. available: The insurer sells its products through a variety of distribution channels, including banks.\nSMART Vocabulary: related words and phrases\nBuying & selling - general words\nall-you-can-eat\nanti-consumer\nanti-dumping\nback order\nbarter\ndeal in something\ndealership\ndesk research\nebay\neconomic activity\nflood\nhammer\npre-emption\npre-order\nprocurement\nrewards card\nsanctions-busting\nshelf\nstretch\ntender\nSee more results »\nchannel noun [C]\n(AIRPORT/PORT)\nUK a route or way out of an airport or port where travellers' bags are examined: If you have nothing to declare, go through the green channel. Goods to declare - use the red channel.\nSMART Vocabulary: related words and phrases\nRoads: pedestrian routes\nalley\nboardwalk\nbreezeway\nbridle path\ncar-free\ncart track\nesplanade\nlabyrinth\nley line\nmaze\nmazy\nnature strip\npathway\npedestrianize\npiazza\nrail trail\nsidewalk\nstepping stone\nswitchback\nthe highways and byways idiom\nSee more results »\nchannel verb [T]\n(DIRECT)\nC2 to direct something into a particular place or situation: Ditches were constructed to channel water away from the buildings. If she could only channel all that energy into something useful. A lot of money has been channelled into research in that particular field.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nchannel verb [T]\n(ACT LIKE)\nto behave like or copy another person, so that you almost seem to be that other person: The band were dressed in 1960s outfits and seemed to be channelling the Beatles.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\nchannel noun [C]\n(PASSAGE)\nAdd to word list\nAdd to word list\na passage for water or other liquids to flow along, or a part of a river or other area of water that is deep and wide enough to provide a route for ships to travel along\nA channel is also a narrow part of the sea between a continent and an island: the English Channel\nchannel noun [C]\n(TELEVISION STATION)\na television station: She switched to another channel to watch the news.\nchannel noun [C]\n(DIRECT)\na way of giving, directing, or communicating something: We’ve established a regular distribution channel for these products.\nchannel verb [T]\n(DIRECT)\nto direct something into a particular place or situation: A lot of money has been channeled into cancer research.\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING a way in which products or services are made available to customers: The insurer sells its products through a variety of channels, including banks, wholesalers, and its own sales force. multi-channel retailing\nCOMMUNICATIONS a television station: TV/cable channel Watch your favorite TV channels online for free!\nCOMMUNICATIONS, IT a system used for passing information or electronic signals, or a way of communicating with people: media channels such as newspapers, digital television, and the internet\nSee also\ndistribution channel\nmarketing channel\npay channel\nsales channel\nto use money, effort, etc. in a particular way: channel sth (back) into sth 10% of the company's profits will be channeled back into advertising.channel sth away from/towards sth HR has channeled all its efforts towards recruiting new personnel.\nto send money, etc. using a particular route: channel sth through sth The funds will be channelled through the UN and the World Bank."}