{"id":92973,"name":"chapter","type":"noun","us_sound":"ˈtʃæp.tɚ","us_link":"../audio/c/chapter.mp3","uk_sound":"ˈtʃæp.tər","uk_link":"../audio/c/ukchaot017.mp3","content":"chapter noun [C]\n(BOOK)\nAdd to word list\nAdd to word list\nB1 (written abbreviation chap.) any of the separate parts into which a book or other piece of text is divided, usually given a number or title: Read Chapter 10 before class tomorrow.\nMore examplesFewer examplesThe main characters are clearly delineated in the first chapter of the book.This chapter is so difficult to digest, I shall have to read it again later.The book has exercises at the end of every chapter.The first chapter describes the strange sequence of events that lead to his death.After you've finished each chapter, run the spell-checker.\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nconcordance\nepigraph\nepilogue\nerrata\nerratum\nex-libris\nISBN\njacket\nlibrary\nmonograph\nomnibus\npreface\nspine\nSee more results »\nchapter noun [C]\n(PERIOD)\na period that is part of a larger amount of time during which something happens: The period before the revolution is an interesting chapter in British history. That chapter of my life closed when I had a serious riding accident.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nchapter noun [C]\n(RELIGIOUS GROUP)\nreligion\n&#160; specialized a group of people that is in charge of a religious community: He persuaded the cathedral chapter to let the college use the room for worship. This title was given to an ecclesiastical official who was head of a chapter of canons in a cathedral.\nUS or formal a local group that is part of a larger organization: The local chapter of the League of Women Voters meets at the library.\nSMART Vocabulary: related words and phrases\nReligious leaders & officials\nanti-papal\napostolic\narchbishop\narchbishopric\narchdeacon\nclerically\nconfessor\ncuracy\ncurate\nmessiah\nminister\nministry\nmuezzin\nmullah\npriestess\npriestly\nprimate\nrabbi\nthe Dalai Lama\nthe priesthood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nIdioms\nbe a chapter of accidents\ngive /quote something/someone chapter and verse\nchapter noun [C]\n(BOOK PART)\nAdd to word list\nAdd to word list\nany of the separate parts into which a book or other piece of text is divided, usually numbered or given a title\nchapter noun [C]\n(PERIOD)\na period that is part of a larger amount of time during which something happens: The Great Depression was a tragic chapter in the history of the nation.\nchapter noun [C]\n(SOCIETY)\na local division of a larger organization: The local chapter of the League of Women Voters meets at the library.\nAdd to word list\nAdd to word list\na local group of members who belong to a larger organization: the New York chapter of the Public Relations Society of America\none of the sections of a large text such as a book, business report, or legal document: Chapter 13 of the Bankruptcy Code"}