{"id":93090,"name":"charge","type":"verb","us_sound":"tʃɑːrdʒ","us_link":"../audio/c/charge.mp3","uk_sound":"tʃɑːdʒ","uk_link":"../audio/c/ukcharg001.mp3","content":"charge verb\n(MONEY)\nAdd to word list\nAdd to word list\nB1 [ T or I ] to ask an amount of money for something, especially a service or activity: How much/What do you charge for a haircut and blow-dry? The bank charged commission to change my traveller's cheques. [ + two objects ] They charge you $20 just to get in the nightclub. The local museum doesn't charge for admission. charge something to someone's account\nto record an amount that a customer has spent for them to pay at a later time, according to an agreement between a business and the customer: Charge the bill to my account, please.\nSee more\nMore examplesFewer examplesHow much do you charge for hiring out a bicycle for a week?He charges anywhere from $20 to $50 for a haircut and blow-dry.The restaurant charges shockingly high prices for its food.My plumber charges £20 an hour.The policy of charging air travellers for vegetarian meals proved unpopular.\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nreceipt\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\ncharge verb\n(ACCUSE FORMALLY)\nB2 [ T ] (of the police) to make a formal statement saying that someone is accused of a crime: She's been charged with murder. She is charged with murdering her husband.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nformal to publicly accuse someone of doing something bad: The paper charged her with using the company's money for her own purposes.\nMore examplesFewer examplesTwo sisters have been charged with murder.He tried to run away from the police and was charged with resisting arrest.He was charged with driving 75 mph in a 55 mph zone.Several England supporters were arrested and charged with disturbing the peace after the match.Six rugby internationals were charged with taking drugs to improve their performance.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArresting & charging\ncharge verb\n(MOVE FORWARD)\nB2 [ I or T ] to move forward quickly and violently, especially towards something that has caused difficulty or anger: The bull lowered its horns and charged. The violence began when the police charged (at) a crowd of demonstrators.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\n[ I + adv/prep ] informal to hurry from one place to another: I've been charging about/around all day and I'm exhausted. He came charging up the stairs to tell me the good news.\n[ T or I ] in sports such as basketball, to run into another player in a way that is not allowed by the rules: The referee blew the whistle because the forward charged the defender.\nMore examplesFewer examplesThe children charged in, demanding ice cream.As the protesters drew nearer, the soldiers charged.Stop charging around - you'll wear yourself out!The herd of rhinos charged towards us.Crowds of demonstrators charged police lines.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\nBasketball, netball & volleyball\ncharge verb\n(EXPLOSIVE)\n[ T ] to put enough explosive into a gun to fire it once\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\ncharge verb\n(ORDER)\n[ T often passive ] formal to order someone to do something: He was charged with taking care of the premises.\n[ T ]\n&#160; law\n&#160; US specialized When a judge charges a jury, he or she explains the details of the law to them.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nexpect\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\ncharge verb\n(SUPPLY ENERGY)\nB2 [ I or T ] to put electricity into an electrical device such as a battery: She drove the car round the block to charge (up) its batteries. It's not working - I don't think the battery is charging.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nPhrasal verb\ncharge something down\ncharge noun\n(MONEY)\nB1 [ C or U ] the amount of money that you have to pay for something, especially for an activity or service: Is there a charge for children or do they go free? There's an admission charge of £5. They fixed my watch free of charge.\nMore examplesFewer examplesAdults pay an admission charge but children get in free.Although long-distance phone calls are going up, the charge for local calls will not alter.Interest charges on an overdraft are usually quite high.Prescription charges are rising in June.I just want a basic bank account with low charges.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\ncharge noun\n(FORMAL ACCUSATION)\nC1 [ C ]\n&#160; law\n&#160; specialized a formal police statement saying that someone is accused of a crime: The 19-year-old will be appearing in court on Thursday where she will face criminal charges. He has been arrested on a charge of murder. The police brought a charge of theft against him. The police have had to drop (= stop) charges against her because they couldn't find any evidence. He claimed he had been arrested on a trumped-up (= false) charge.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\n[ C ] formal the act of accusing someone of something bad: [ + that ] The president responded angrily to the charge that she had lost touch with her country's people. Her refusal to condemn the violence laid/left her open to the charge of positive support for the campaign (= allowed people to say that she supported it).\nMore examplesFewer examplesThe company pleaded guilty to the charge of manslaughter.The charge of murder was altered to the lesser charge of manslaughter.Both men vehemently denied the charges against them.Criminal charges will be brought against the driver of the lorry.Simson, aged 19, was convicted on two charges of burglary.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArresting & charging\ncharge noun\n(CONTROL)\nin charge\nB1 being the person who has control of or is responsible for someone or something: Who will be in charge of the department when Sophie leaves?\nSee more\nB2 [ U ] responsibility for controlling or caring for something: Her ex-husband has charge of the children during the week and she has them at the weekend. His boss asked him to take charge of the office for a few days while she was away. Synonyms\ncare (PROTECTION)\ncustody (CARE)\nguardianship\nguidance\nkeeping\nprotection\nresponsibility (DUTY)\ntutelage formal\n[ C ] old-fashioned a person, especially a child, who is in your care and who you are responsible for\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\ncharge noun\n(EXPLOSIVE)\n[ C ] the amount of explosive to be fired at one time, or the bullet or other explosive object shot from a gun\nSMART Vocabulary: related words and phrases\nBombs & missiles\nanti-mine\nanti-missile\nanti-radar\nanti-satellite\nanti-ship\ndirty bomb\nenrich\nenrichment\nExocet\nfirebomb\nMolotov cocktail\nmortar\nmushroom cloud\nnapalm\nneutron bomb\nsubmunition\nsuicide belt\nsuicide vest\nsuperbomb\nsurface-to-air missile\nSee more results »\ncharge noun\n(MOVE FORWARD)\n[ C ] an attack in which people or animals suddenly run forward: a charge of buffalo/elephants a police charge\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\ncharge noun\n(ORDER)\n[ C ] formal an order to do something\nSMART Vocabulary: related words and phrases\nInstructions and orders\nas per instructions idiom\nbrief\nbriefing\nclarion call\ncommandment\ncounter-order\ndictate\ndiktat\ndoctor's orders\nfiat\nimperatively\ninterdict\nmarching orders\norder\norders are orders idiom\nunbriefed\nwalkthrough\nwith\nword\nSee more results »\ncharge noun\n(ENERGY)\n[ C or U ] the amount or type of electricity that an electrical device stores or that a substance carries: My phone had run out of charge. The electron has a negative charge and the proton has a positive charge. on charge UK\nIf something is on charge, you are putting an amount of electricity into it: Is it all right to leave/put the battery on charge overnight?\nSee more\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\ncharge verb\n(ASK FOR MONEY)\nAdd to word list\nAdd to word list\n[ I/T ] to ask for a price for something: [ T ] I think they charge too much for football tickets.\ncharge verb\n(OWE)\n[ T ] to buy something and agree to pay for it later: I didn’t have any cash, so I charged the food.\ncharge verb\n(ACCUSE)\n[ T ] to accuse someone of something, esp. to officially accuse someone of a crime: He was charged with resisting arrest.\ncharge verb\n(MOVE FORWARD)\n[ I/T ] to move forward quickly, esp. to attack: [ T ] When the batter was hit with the pitch, he dropped his bat and charged the pitcher.\ncharge verb\n(STORE ENERGY)\n[ I/T ] to put electrical energy into a storage device such as a battery : [ I ] It takes several hours for my laptop’s batteries to charge.\ncharge verb\n(INSTRUCT)\n[ T ] law to instruct (the people deciding a legal case) what the law is in a particular case: The judge charged the jury before deliberations began.\nIdioms\ncharged up\nin charge (of something/someone)\ncharge noun\n(CONTROL)\n[ U ] responsibility for the control of something or the care of someone: Marilyn agreed to take charge of fundraising.\ncharge noun\n(EXPLOSIVE)\n[ C ] the amount of explosive to be fired at one time\ncharge noun\n(STORAGE OF ENERGY)\n[ C/U ]\n&#160; chemistry, physics the amount of electricity that an electrical device stores or carries\n[ C/U ]\n&#160; chemistry, physics A positive or negative electrical charge is a basic characteristic of matter.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE, FINANCE to ask for a particular amount of money for something, especially a service or activity: charge (sb) sth for sth How much will you charge us for shipping and handling? They charged $200 for insurance.charge (sb) for sth We do not charge you for this service.charge a price/fee, etc. He considered that the price they were charging was fair. The bank charges a commission to withdraw money from a foreign ATM.\n[ T ] to pay for something by credit card: I don't have any cash - I'll charge it.\ncharge sth to sb's account\nif you charge something to someone's account , the amount they have spent is recorded and they pay for it at a later time: Charge the bill to my account, please.\n[ T ]\n&#160; ACCOUNTING to record something as a cost in a financial account: charge sth to sth The depreciation is charged to the profit and loss account.\n[ T ]\n&#160; LAW to make a formal statement saying that someone is accused of a crime: charge sb with sth The property developer was charged with fraud.\n[ T ] to publicly accuse someone of having done something bad: charge sb with sth The newspaper charged him with misleading the public about the seriousness of the situation.\n[ T, often passive ] to ask someone to do a particular job: be charged with sth The committee has been charged with developing a new funding formula. Phrasal verb\ncharge off\n[ C or U ]\n&#160; COMMERCE, FINANCE the amount of money that you have to pay for something, especially for a service: make/impose/incur a charge If you fail to cancel the booking within the specified period, you will incur a charge.charge for sb/sth Is there a charge for children or do they go free?small/nominal charge We make a nominal charge for this service.high charges Small investors are put off by the high charges for this sort of account There will be a one-off charge of £30. Interest charges on an overdraft are usually quite high. We will deliver to your home free of charge.\n[ C ]\n&#160; ACCOUNTING a cost that is recorded in a company's financial accounts: take a charge for sth The company expects to take a charge for various expenses relating to the acquisition. Depreciation is treated as a charge in the profit and loss account.\n[ C ]\n&#160; LAW, PROPERTY →\ncharge on assets : a mortgage, or other charge against the property\n[ C ]\n&#160; LAW a formal statement accusing someone of committing a crime: bring a charge against sb Charges were brought against the UK company under the Corporate Manslaughter and Homicide Act.on a charge of sth She was arrested on a charge of fraud. criminal charges He was taken into custody but released without charge.\n[ C ] a statement that someone has done something bad: He responded angrily to the charge that he had not acted in the best interests of the company.\nin charge\nin control of or responsible for someone or something: Who will be in charge of the department when Sophie leaves? From now on, Steve is in charge.leave sb in charge (of sth) He was on vacation and had left his deputy in charge.put sb in charge (of sth) I put Jack in charge of making the travel arrangements.\ntake charge (of sth)\nto take control of something or of a group of people: His boss asked him to take charge of the office for a few days while she was away. See also\naccrued charge\nbank charge\ncapital charge\ncarrying charge\ncertificate of charge\ncover charge\nexit charge\nfinance charge\nfixed charge\nfloating charge\nView all\nhandling charge\nlanding charge\nmanagement charge\nrestructuring charge\nreverse-charge\nsales charge\nservice charge\nsocial charges\ntermination charge"}