{"id":93139,"name":"charitable","type":"adjective","us_sound":"ˈtʃer.ə.t̬ə.bəl","us_link":"../audio/c/charitable.mp3","uk_sound":"ˈtʃær.ə.tə.bəl","uk_link":"../audio/c/ukcharg010.mp3","content":"charitable adjective\n(GIVING)\nAdd to word list\nAdd to word list\n[ before noun ] giving money, food, or help free to those who are in need because they are ill, poor, or have no home: a charitable foundation/organization/trust The entire organization is funded by charitable donations. The school has charitable status (= it is officially a charity).\nThesaurus: synonyms, antonyms, and examples\nfreely giving money, help, etc. to othersgenerousThey were quite generous, donating to several charities.open-handedShe is incredibly open-handed and won't hesitate to donate whenever asked.free withOur professor is quite free with his time and will often extend office hours to accommodate extra students.philanthropicThere are fewer philanthropic billionaires than one would assume.charitableOxfam is a well-known charitable organization working to end global poverty.\nSee more results »\nSMART Vocabulary: related words and phrases\nGenerous & charitable\naltruistic\naltruistically\nanti-materialism\nanti-materialist\nbeneficence\neleemosynary\ngenerosity\ngenerous\ngenerously\ngiver\nlargesse\nmunificence\nmunificent\nmunificently\nopen-handed\nsuper-sweet\nunsparing\nunsparingly\nunstinted\nunstinting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - charities\ncharitable adjective\n(KIND)\nkind, and not judging other people in a severe way: Some critics said the show was good in parts - those less charitable said the whole thing was a disaster.\nSMART Vocabulary: related words and phrases\nLenient & merciful\ncharitably\ncharity\nclemency\nease\nease up/off\neasy\ngo easy idiom\nhave a heart! idiom\nheart\nleniency\nlenient\nmagnanimous\nmagnanimously\nmerciful\nmercy\nquarter\nsquishy\nAdd to word list\nAdd to word list\nkind and not judging people in a negative way: They are known as a charitable people.\nof or relating to a person or organization that gives money, food, or other help to those who need it: She was involved in many charitable organizations. charitably adverb us\nYour browser doesn't support HTML5 audio\n/ˈtʃær·ɪ·t̬ə·bli/\nThe disagreement was described charitably as a “frank discussion.”\nAdd to word list\nAdd to word list\nSOCIAL RESPONSIBILITY connected with a charity or charities: charitable foundation/organization The firm's family owners decided to create a charitable foundation. The entire organization is funded by charitable donations. The organization has been granted charitable status. See also\nnot-for-profit"}