{"id":93109,"name":"charging","type":"verb","us_sound":"tʃɑːrdʒ","us_link":"../audio/c/charge.mp3","uk_sound":"tʃɑːdʒ","uk_link":"../audio/c/ukcharg001.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ncharge\ncharge verb\n(MONEY)\nB1 [ T or I ] to ask an amount of money for something, especially a service or activity: How much/What do you charge for a haircut and blow-dry? The bank charged commission to change my traveller's cheques. [ + two objects ] They charge you $20 just to get in the nightclub. The local museum doesn't charge for admission. charge something to someone's account\nto record an amount that a customer has spent for them to pay at a later time, according to an agreement between a business and the customer: Charge the bill to my account, please. Shall we charge the flowers to your account?\nMore examplesFewer examplesHow much do you charge for hiring out a bicycle for a week?He charges anywhere from $20 to $50 for a haircut and blow-dry.The restaurant charges shockingly high prices for its food.My plumber charges £20 an hour.The policy of charging air travellers for vegetarian meals proved unpopular.\nSMART Vocabulary: related words and phrases\nBills & invoices\nbill\nbilling\ncharge\nchit\nclaim form\ncounterfoil\ncredit note\norder\npassbook\npayslip\npro forma\nsales slip\nsavings bond\nstore credit\ntab\nticket\ntolled\nTreasury bond\nvoucher\nwater bill\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\ncharge verb\n(ACCUSE FORMALLY)\nB2 [ T ] (of the police) to make a formal statement saying that someone is accused of a crime: She's been charged with murder. She is charged with murdering her husband.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\nformal to publicly accuse someone of doing something bad: The paper charged her with using the company's money for her own purposes.\nMore examplesFewer examplesTwo sisters have been charged with murder.He tried to run away from the police and was charged with resisting arrest.He was charged with driving 75 mph in a 55 mph zone.Several England supporters were arrested and charged with disturbing the peace after the match.Six rugby internationals were charged with taking drugs to improve their performance.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nhaul\nincriminate\nincriminating\nincrimination\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nnail\nopprobrium\nrecrimination\nsacrificial lamb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArresting & charging\ncharge verb\n(MOVE FORWARD)\nB2 [ I or T ] to move forward quickly and violently, especially towards something that has caused difficulty or anger: The bull lowered its horns and charged. The violence began when the police charged (at) a crowd of demonstrators.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\n[ I + adv/prep ] informal to hurry from one place to another: I've been charging about/around all day and I'm exhausted. He came charging up the stairs to tell me the good news.\nMore examplesFewer examplesThe children charged in, demanding ice cream.As the protesters drew nearer, the soldiers charged.Stop charging around - you'll wear yourself out!The herd of rhinos charged towards us.Crowds of demonstrators charged police lines.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\nbuzz\ncareen\nfly\ngallop\ngun\noutsail\npelt\nscamper\nscoot\nscrabble\nscramble\nscud\nshoot\nstampede\nton\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\ncharge verb\n(EXPLOSIVE)\n[ T ] to put enough explosive into a gun to fire it once\nSMART Vocabulary: related words and phrases\nGuns\nautomatic\nblaster\ncannon\ncannonade\ncannonball\ncock\ngo off\ngunpoint\ngunsmith\nkick\nmachine gun\nmortar\nplug\npot\nshoot\nshoot something down\nshoot up\nshooter\nsniper\nsniping\nSee more results »\ncharge verb\n(ORDER)\n[ T often passive ] formal to order someone to do something: He was charged with taking care of the premises.\n[ T ]\n&#160; law\n&#160; US specialized When a judge charges a jury, he or she explains the details of the law to them.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss\nboss someone around\nbossily\nbossiness\nbossyboots\ncharge\ndecree\ndefy\ndemand\ndictate\nexpect\nharry\nimportunate\nlay down the law idiom\nprescribe\nput something on\nshove\nshove someone around\nstick out for something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\ncharge verb\n(SUPPLY ENERGY)\nB2 [ I or T ] to put electricity into an electrical device such as a battery: She drove the car round the block to charge (up) its batteries. It's not working - I don't think the battery is charging.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »"}