{"id":93144,"name":"charity","type":"noun","us_sound":"ˈtʃer.ə.t̬i","us_link":"../audio/c/eus70776.mp3","uk_sound":"ˈtʃær.ə.ti","uk_link":"../audio/c/ukcharg012.mp3","content":"charity noun\n(GIVING)\nAdd to word list\nAdd to word list\n[ C ] an organization whose purpose is to give money, food, or help to those who need it, or to carry out activities such as medical research that will help people in need, and not to make a profit: Proceeds from the sale of these cards will go to (= be given to) local charities. UNICEF is an international charity. a cancer research charity\nB1 [ U ] help, especially in the form of money, given freely to people who are in need, for example because they are ill, poor, or have no home, and organizations that provide this help: She does a lot of work for charity. People tend to give to (= give money to) charity at Christmas time. They did a charity performance on the first night, to raise money for AIDS research.\nMore examplesFewer examplesShe directs a large charity.An anonymous businesswoman donated one million dollars to the charity.We give mostly to children's charities.Thanks to a large gift from an anonymous donor, the charity was able to continue its work.The lawyer asked the jury to take into account the defendant's generosity in giving to charity.5% of our profits are covenanted to charity.We organized a charity fun run around the school grounds.\nSMART Vocabulary: related words and phrases\nOrganizations - charities\naid\nalms\nbenevolence\nbenevolent\nbenevolent society\nbutton day\ncharity begins at home idiom\ncharity box\ndebt relief\nfood pantry\nfoundation\ngoodwill\nnon-profit\nnon-profit-making\nnot-for-profit\nOxfam\nthe Red Crescent\nthe Red Cross\nvolunteer\nwalkathon\nSee more results »\ncharity noun\n(KINDNESS)\nC2 [ U ] formal the quality of being kind to people and not judging them in a severe way\nSMART Vocabulary: related words and phrases\nLenient & merciful\ncharitable\ncharitably\nclemency\nease\nease up/off\neasy\ngo easy idiom\nhave a heart! idiom\nheart\nleniency\nlenient\nmagnanimous\nmagnanimously\nmerciful\nmercy\nquarter\nsquishy\nIdiom\ncharity begins at home\nAdd to word list\nAdd to word list\nthe giving of money, food, or help to those who need it, or an organization that does this: [ U ] She does a lot of work for charity. [ C ] We donate to a number of charities.\nCharity is also the belief that you should help people: [ U ] He visits homeless shelters out of charity.\nAdd to word list\nAdd to word list\n[ C ] an organization that has the purpose of providing money or help to people who need it, or that does something useful for society: Proceeds from the sale of these cards will be given to local charities. It's a charity that supports local arts initiatives. As a charity, the organization does not pay tax.\n[ U ] organizations like this when they are considered as a group: An anonymous businesswoman donated one million dollars to charity. The proceeds of this evening's event will go to charity.\n[ U ] money or help given to people who need it: They were poor, but they were too proud to accept charity.\nSee also\nnot-for-profit organization"}