{"id":93252,"name":"chart","type":"noun","us_sound":"tʃɑːrt","us_link":"../audio/c/chart.mp3","uk_sound":"tʃɑːt","uk_link":"../audio/c/ukcharg025.mp3","content":"chart noun [C]\n(DRAWING)\nAdd to word list\nAdd to word list\nB2 a drawing that shows information in a simple way, often using lines and curves to show amounts: There is a chart on the classroom wall showing the relative heights of all the children. The sales chart shows a distinct decline in the past few months. the TV weather chart\na detailed map of an area of water: a naval chart\nview-france/iStock/Getty Images Plus/Getty Images /GettyImages\nMore examplesFewer examplesI'd like everyone to mark their progress on the chart every week.The chart shows how weight increases in proportion to height .There's a chart over there that shows the recommended tyre pressures for every make of car.According to the hospital chart he's four kilos underweight.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNavigation & shipwrecks\nMaps & map-making\nchart noun [C]\n(MUSIC)\nthe charts B2 [ plural ]\nthe lists produced each week of the records with the highest sales: the dance charts\nSee more Idiom\noff the charts\nchart verb\n(SHOW/FOLLOW)\n[ T ] to show something on a chart: We need some sort of graph on which we can chart our progress. The map charts the course of the river where it splits into two.\n[ T ] to watch something with careful attention or to record something in detail: A global study has just been started to chart the effects of climate change.\n[ T ] mainly US to arrange a plan of action: The local branch of the party is meeting to chart their election campaign.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaps & map-making\nUsing the eyes\nWriting & typing\nPlanning, expecting and arranging\nchart verb\n(MUSIC)\n[ I ] informal to enter the music charts: Their first record didn't even chart.\nSMART Vocabulary: related words and phrases\nPop, rock & soul\nagit-pop\nanti-rock\nbacking dancer\nbacking singer\nbackspin\ndisc jockey\nDJ\ndrum and bass\nelectronica\nemo\nhooky\njukebox\nK-pop\nlyrically\nmod\nMotown\nTin Pan Alley\ntop ten\ntrap music\ntrip-hop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nAdd to word list\nAdd to word list\na way of presenting information, usually by putting it into vertical rows and boxes on a sheet of paper, so it can be easily understood: The chart shows a top-down communication model.\nto record changes in something or the progress of something: The magazine charts current trends in fashion.\nSomeone who charts a series of actions plans them: The president plans to chart a new economic policy.\nAdd to word list\nAdd to word list\nGRAPHS &amp; CHARTS a drawing that shows information in a simple way, often using lines and curves to show amounts: a chart shows/illustrates sth The sales chart shows a distinct decline in the past few months. I'd like everyone to mark their progress on the chart every week.\noff the charts informal\nat a very high level: House prices are so off the charts there that university professors can't even afford to buy.\nextremely popular or successful: The new restaurant is totally off the charts. See also\nbar chart\nbreak-even chart\nflip chart\nflow chart\nGantt chart\nline chart\noperations process chart\norganizational chart\npie chart\nGRAPHS &amp; CHARTS to show something on a chart: We need some sort of graph on which we can chart our progress.\nto watch something with careful attention or to record something in detail: A study has just been started to chart the effects of climate change in this area.\nto arrange a plan of action: The regional managers are meeting to chart next year's sales campaign."}