{"id":93258,"name":"charter","type":"noun","us_sound":"ˈtʃɑːr.t̬ɚ","us_link":"../audio/c/eus70778.mp3","uk_sound":"ˈtʃɑː.tər","uk_link":"../audio/c/ukcharg026.mp3","content":"charter noun\n(OFFICIAL PAPER)\nAdd to word list\nAdd to word list\n[ C ] a formal statement of the rights of a country's people, or of an organization or a particular social group, that is agreed by or demanded from a ruler or government: a charter of rights Education is one of the basic human rights written into the United Nations Charter. The government has produced a Citizen's/Parents'/Patients' Charter.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\ncharter noun\n(RENT)\n[ U ] the renting of a vehicle: boats for charter a charter flight a major charter operator\nSMART Vocabulary: related words and phrases\nRenting & hiring\naccount\ncharge account\nchartered\ncredit account\ndeposit\nhire\nhire purchase\nhire something/someone out\nhp\ninstallment plan\nlayaway\nlease\nlessee\nlessor\nrent\nrental\nthe never-never\ncharter verb [T]\n(RENT)\nto rent a vehicle, especially an aircraft, for a special use and not as part of a regular service: They've chartered a plane to take delegates to the conference.\nSMART Vocabulary: related words and phrases\nRenting & hiring\naccount\ncharge account\nchartered\ncredit account\ndeposit\nhire\nhire purchase\nhire something/someone out\nhp\ninstallment plan\nlayaway\nlease\nlessee\nlessor\nrent\nrental\nthe never-never\ncharter verb [T]\n(OFFICIAL START)\nto officially start a new organization by giving it a charter: Cambridge University Press was chartered in 1534.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ndying\nfloat\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\ncharter noun [C]\n(DOCUMENT)\nAdd to word list\nAdd to word list\na formal statement, esp. by a government or ruler, of the rights of a group organized for some purpose: The United Nations charter sets forth goals we all admire.\ncharter noun [C]\n(RENT)\nan act of renting a vehicle for a special use, esp. by a group of people: Charters with low fares have attracted new airline passengers.\ncharter verb [T]\n(RENT)\nto rent a vehicle for a special use: He wanted to charter an airplane.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; GOVERNMENT, SOCIAL RESPONSIBILITY a formal statement of the rights of a country's people, or a particular social group, which is agreed by or demanded from a government, etc.: Education is one of the basic human rights written into the United Nations Charter.\n[ C ] a statement of the aims and values of an organization, etc.: The city charter and state law require the city to enact a balanced budget before April 1.\n[ C ]\n&#160; LAW in the US, an official document that shows that a company has been formed legally and that controls how it operates: Commercial banks with a national charter are supervised by the Office of the Comptroller of the Currency.\n[ U ]\n&#160; TRANSPORT the renting of a plane or ship: a charter flight a major charter operator See also\nbareboat charter\ncitizen's charter\ntime charter\nvoyage charter\nTRANSPORT to rent a plane or ship, for a special use and not as part of a regular service: The company chartered a plane to take executives to the conference.\nLAW to start a new organization by giving it an official charter: The Second Bank of the United States was chartered in 1816."}