{"id":93358,"name":"chastise","type":"verb","us_sound":"tʃæsˈtaɪz","us_link":"../audio/c/chastise.mp3","uk_sound":"tʃæsˈtaɪz","uk_link":"../audio/c/ukchary008.mp3","content":"chastise verb [T]\n(CRITICIZE)\nAdd to word list\nAdd to word list\nto criticize someone severely: Charity organizations have chastised the government for not doing enough to prevent the latest famine in Africa. She has been chastised by critics who say that children will never learn to recognize and enjoy vegetables if they are disguised. Synonyms\nattack (CRITICIZE)\ncastigate formal\ncensure formal\ncondemn\ncriticize\ndamn (BLAME)\ndecry formal\ndenounce (CRITICIZE)\nexcoriate formal\nrail formal\nrevile formal\nslam informal\nThesaurus: synonyms, antonyms, and examples\nto show disapproval of someone or somethingcriticizeHe criticized the government's handling of the crisis.attackShe wrote an article attacking the judge and the way the trial had been conducted.condemnShe was condemned for her comments about the candidate.denounceThe government's economic policy has been denounced on all sides.come under fireThe government programme has come under fire for mismanaging funds.\nSee more results »\nMore examplesFewer examplesThe doctor was chastised by a patient for being overweight.He publicly chastised Democrats who supported continued funding for the war.She chastised herself for not getting up and being more active.\nSMART Vocabulary: related words and phrases\nChastising & rebuking\nadmonishing\nadmonishingly\nadmonitory\nbarracking\nbawl\ncarpet\nearbashing\nkeelhaul\nlambaste\nlecture\npull\npull someone up\npunchbag\npunching bag\nput someone in their place idiom\nreproachful\nshame\nspoken\nthere'll be hell to pay idiom\nupbraid\nSee more results »\nchastise verb [T]\n(PUNISH)\nto punish someone, especially by hitting them: Some family campaigners believe in the right to physically chastise children. Fearful that he will be chastised by gangs, the boy has agreed to speak providing his identity is hidden.\nMore examplesFewer examplesThe overseers were big, brutal men who were not slow to chastise their workers and beat them if they fell behind with quotas.The Spanish army of the eastern Pyrenees had been severely chastised by the soldiers of the republic.They make excuses for continuing to sin and refuse to be chastised and corrected.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nRelated word\nchastisement\nAdd to word list\nAdd to word list\nto punish or criticize someone strongly: Economists like to chastise the public for not saving."}