{"id":93372,"name":"chat","type":"verb","us_sound":"tʃæt","us_link":"../audio/c/chat.mp3","uk_sound":"tʃæt","uk_link":"../audio/c/ukchary011.mp3","content":"Add to word list\nAdd to word list\nA2 to talk to someone in a friendly informal way: She spends hours on the phone chatting to her friends. We were just chatting about what we did last weekend. Whenever I walk in, I always find the two of them chatting away (= talking eagerly).\nThesaurus: synonyms, antonyms, and examples\nto talk to someonetalkA group of men were talking in the street.speakCould I speak to you privately?sayI couldn't hear what they were saying.chatWe were just chatting about the party.have a chatWe had a little chat over the garden wall.chatterThey spent the morning chattering away.\nSee more results »\nA2 to take part in a discussion that involves sending messages over the internet, by smartphone, etc.: Use the app to chat and send photos free from anywhere in the world.\nMore examplesFewer examplesI'd love to stop and chat but I'm rather pressed for time.We were just walking along, chatting.Half an hour later, she was smiling and chatting as if nothing had happened.We spent a very jolly evening together, chatting and drinking.He soon nosed out the details of the accident by chatting innocently to people and making some phone calls.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nPhrasal verb\nchat someone up\nA2 a friendly, informal conversation: Why don't you give me a call and we'll have a chat? I had a chat with my boss today about a possible salary increase. It was the usual idle chat (= conversation about unimportant things). See also\nchit-chat noun informal\nThesaurus: synonyms, antonyms, and examples\nto talk to someonetalkA group of men were talking in the street.speakCould I speak to you privately?sayI couldn't hear what they were saying.chatWe were just chatting about the party.have a chatWe had a little chat over the garden wall.chatterThey spent the morning chattering away.\nSee more results »\na discussion that involves sending messages over the internet, by phone, using a messaging service, etc.: How do I start a group chat?\nMore examplesFewer examplesI'll come by your house one day this week and we can have a chat.We had a real girlie chat.I was just passing by , so I thought I'd drop in for a chat.Our little chat has raised my spirits .She's always on the run and never has time for a chat.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nAdd to word list\nAdd to word list\nto talk to someone in a friendly informal way: We stopped to chat with the neighbors. chatty adjective us\nYour browser doesn't support HTML5 audio\n/ˈtʃæt̬·i/\nI sat next to a friendly, chatty woman.\na friendly, informal talk: Sometimes Don would just stop by for a chat. Call me sometime tomorrow and we can have a chat.\nAdd to word list\nAdd to word list\nto talk to someone in a friendly informal way: Apart from discussing official business, it was extremely useful to chat informally about work.\nINTERNET, COMMUNICATIONS to have a conversation with another person or other people on the internet, when you write down what you want to say, and can see immediately what the other person or other people are writing: I got a message saying that she was available to chat.\n[ C or U ] a friendly informal conversation: have a chat with sb I had a chat with my boss today about a possible change of role. It was just the usual idle chat, about nothing of great importance.\n[ U ]\n&#160; INTERNET, COMMUNICATIONS communication between people on the internet, when they can see immediately what the other person or other people are writing: a chat site/session"}