{"id":93506,"name":"chauvinist","type":"adjective","us_sound":"ˈʃoʊ.və.nɪst","us_link":"../audio/c/chauvinist.mp3","uk_sound":"ˈʃəʊ.vɪ.nɪst","uk_link":"../audio/c/ukchary021.mp3","content":"Add to word list\nAdd to word list\npolitics believing or showing an unreasonable belief that your own country or race is the best or most important: The crowd was enthusiastically singing chauvinistic patriotic songs.\nbelieving that or behaving as if women are naturally less important, intelligent, or able than men: It is a deeply chauvinist community where the few women who have jobs are ridiculed.\nSMART Vocabulary: related words and phrases\nPatriotism & nationalism\nanti-national\nchauvinism\nchauvinistically\nhyper-nationalistic\nirredentism\njingoist\njingoistic\njingoistically\nNat\nnationalism\nnativist\npatriot\npatriotic\npatriotically\npatriotism\nultra-nationalist\nultra-patriotic\nunpatriotic\nunpatriotically\nwrap\nSee more results »\nRelated word\nchauvinistically\npolitics someone who has an unreasonable belief that their own country or race is the best or most important: The English tend to be chauvinists, they expect you to sing in their language. The leaders of Europe deny the legitimacy of this xenophobic chauvinist.\nsomeone who believes that or behaves as if women are naturally less important, intelligent, or able than men: She called him a male chauvinist because of his insistence on calling all women \"girls\". They are uneducated chauvinists who think men rule in society.\nMore examplesFewer examplesGeorge had always been a terrible old chauvinist, never renowned for his open mind.The man is an unreconstructed chauvinist.He appeared to be the kind of old-fashioned chauvinist who preferred his women pregnant.\nSMART Vocabulary: related words and phrases\nPatriotism & nationalism\nanti-national\nchauvinism\nchauvinistically\nhyper-nationalistic\nirredentism\njingoist\njingoistic\njingoistically\nNat\nnationalism\nnativist\npatriot\npatriotic\npatriotically\npatriotism\nultra-nationalist\nultra-patriotic\nunpatriotic\nunpatriotically\nwrap\nSee more results »"}