{"id":93584,"name":"cheating","type":"verb","us_sound":"tʃiːt","us_link":"../audio/c/cheat.mp3","uk_sound":"tʃiːt","uk_link":"../audio/c/ukcheat001.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ncheat\nB2 [ I or T ] to behave in a dishonest way in order to get what you want: Anyone caught cheating will be immediately disqualified from the exam. He cheats at cards? She cheated in the test by copying from the boy in front. I suspect he cheats on his taxes (= avoids paying as much tax as he should). They cheat people by charging too much for building materials.\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\n[ I ] informal to have a secret sexual relationship with someone who is not your husband, wife, or usual sexual partner: She found out that he'd been cheating on her. I've been cheated on before, and it's awful. I love my wife and I would never cheat. What would you do if you caught your partner cheating?\nMore examplesFewer examplesThey set up a double-cross to cheat him of his money.He wouldn't scruple to cheat his own mother if there was money in it for him.He'd do anything to cover his ass, including lie, cheat and murder.The winner has been disqualified for cheating, so justice has been done .There were instances of brazen cheating in the exams.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisloyalty, betrayal & treason\nIdiom\ncheat deathPhrasal verb\ncheat someone out of something"}