{"id":93575,"name":"cheat","type":"verb","us_sound":"tʃiːt","us_link":"../audio/c/cheat.mp3","uk_sound":"tʃiːt","uk_link":"../audio/c/ukcheat001.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to behave in a dishonest way in order to get what you want: Anyone caught cheating will be immediately disqualified from the exam. He cheats at cards? She cheated in the test by copying from the boy in front. I suspect he cheats on his taxes (= avoids paying as much tax as he should). They cheat people by charging too much for building materials.\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\n[ I ] informal to have a secret sexual relationship with someone who is not your husband, wife, or usual sexual partner: She found out that he'd been cheating on her. I've been cheated on before, and it's awful. I love my wife and I would never cheat. What would you do if you caught your partner cheating?\nMore examplesFewer examplesThey set up a double-cross to cheat him of his money.He wouldn't scruple to cheat his own mother if there was money in it for him.He'd do anything to cover his ass, including lie, cheat and murder.The winner has been disqualified for cheating, so justice has been done .There were instances of brazen cheating in the exams.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisloyalty, betrayal & treason\nIdiom\ncheat deathPhrasal verb\ncheat someone out of something\n[ C ] a person who behaves in a dishonest way: Trouble broke out in the match when one of the players called a member of the other team a cheat.\nThesaurus: synonyms, antonyms, and examples\na dishonest personcheatShe's a liar and a cheat!cheaterUS I wouldn't play a game with him - he's a cheater.crookMy dad says that used car salesmen are just a bunch of crooks.cowboyUK The private security firm are just a bunch of cowboys looking to rough up anyone who crosses their path.fraudHe claims to be a doctor, but he's just a fraud without a medical licence.sharkThe landlord was a real shark, jacking up rents without relief.\nSee more results »\n[ S ] something dishonest that makes people believe that something is true when it is not: You can use cocoa powder to make the cake rather than chocolate - it's a bit of a cheat, but nobody notices the difference.\n[ C ] a collection of instructions or special information that someone can use to help them play a computer game more successfully: the latest game cheats cheat codes\nSMART Vocabulary: related words and phrases\nDishonest people\nbirther\ncadger\ncharmer\ncheater\ndeceiver\nfibber\nhoaxer\nhumbug\nhustler\nhypocrite\nliar\nmountebank\nperjurer\nprofiteer\nrigger\nscammer\nschemer\ntrickster\nwheeler-dealer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCheating & tricking\nComputer programming & software\nAdd to word list\nAdd to word list\nto act in a way that is dishonest, or to make someone believe something that is not true in order to get something for yourself: [ T ] The insurance companies were found to be cheating consumers. [ T ] They got cheated out of their money. cheat noun [ C ] us\nYour browser doesn't support HTML5 audio\n/tʃit/\nHe is a liar and a cheat.\nAdd to word list\nAdd to word list\nto behave in a dishonest way or deceive someone in order to get what you want: Many of the small investors felt that they had been cheated by the sudden reduction in interest rates.cheat on sth He was caught cheating on his taxes. cheating noun [ U ]\nIn my opinion, this was a clear case of cheating. Phrasal verb\ncheat sb out of sth\n[ C ] ( US also cheater) a person who behaves in a dishonest way: a tax cheat\n[ S ] something dishonest or unfair: It's a cheat that I did all the work and you got all the credit."}