{"id":93551,"name":"cheap","type":"adjective","us_sound":"tʃiːp","us_link":"../audio/c/cheap.mp3","uk_sound":"tʃiːp","uk_link":"../audio/c/ukchary024.mp3","content":"cheap adjective\n(LOW PRICE)\nAdd to word list\nAdd to word list\nA1 costing little money or less than is usual or expected: I got a cheap flight at the last minute. Food is usually cheaper in supermarkets. Children and the elderly are entitled to cheap train tickets. The system is simple and cheap to operate. During times of mass unemployment, there's a pool of cheap labour for employers to draw from.figurative In a war, human life becomes very cheap (= seems to be of little value).\nThesaurus: synonyms, antonyms, and examples\ncosting less money than expectedcheapThe meal was cheaper than I expected.affordableThere's very little affordable housing around here.inexpensiveThey sell inexpensive children's clothes.reasonableI thought the food was very reasonable.dirt cheapMost of the books they sell are dirt cheap.\nSee more results »\nIf a shop or restaurant is cheap, it charges low prices: I go to the cheapest hairdresser's in town. cheap and cheerful UK\ncheap but good or enjoyable: There's a restaurant round the corner that serves cheap and cheerful food.\nSee more on the cheap informal\nIf you get goods on the cheap, you get them for a low price: There's a big store near here where you can buy designer clothes on the cheap.\nSee more for cheap US informal\nfor a low price: Do you like this? I got it for cheap.\nSee more\nMore examplesFewer examplesWe bought a cheap package tour to Spain and stayed in a big hotel by the sea.Bicycles are a cheap and efficient form of transport.I know a great restaurant where the drink's cheap and the food's great.I bought some flowers that were going cheap.It's only a cheap ring but it has great sentimental value for me.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncomp\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsomething for nothing idiom\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\ncheap adjective\n(LOW QUALITY)\nC1 disapproving used to describe goods that are both low in quality and low in price: I bought some cheap wine for cooking with. He bought some cheap shoes that fell apart after a couple of months.\nThesaurus: synonyms, antonyms, and examples\nof bad qualitybadThe food wasn’t as bad as I’d expected.poorTheir efforts produced extremely poor results.low/poor/bad qualityTheir sausages are made with low-quality meat.mediocreThe striker has been dropped after a mediocre performance.inferiorThe copies are of inferior quality.\nSee more results »\ncheap and nasty UK\ncosting little and of very bad quality: They sold cheap and nasty watches at hugely inflated prices.\nSee more\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ncheesy\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\nsort\ntawdrily\ntawdriness\ntawdry\nthinness\ntrinket\nwretched\nSee more results »\ncheap adjective\n(UNGENEROUS)\nUS (UK mean) unwilling to spend money: He's so cheap he didn't even buy me a card for my birthday.\nSMART Vocabulary: related words and phrases\nMean with money\nbegrudge\ncheapskate\ncheeseparing\nchintzy\nfrugal\nfrugally\nmiser\nmiserliness\nmiserly\nmoney grabber\nmoney-grubber\nmoney-grubbing\npenuriously\npinchpenny\nscrooge\nskinflint\nstingily\ntightwad\nungenerous\nungenerously\nSee more results »\ncheap adjective\n(DRESSED SEXILY)\ndisapproving If you describe the way a person is dressed as cheap, you mean that it is very obvious that they are trying to sexually attract other people.\ncheap adjective\n(UNKIND)\ndisapproving unpleasant and unkind: I wish you'd stop making cheap jokes about my friends.\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruel\ncruelly\ncruelty\ncutthroat\nmeanly\nmeanness\nmental cruelty\nmerciless\nmercilessly\ntrenchancy\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nSee more results »\nIdioms\ncheap at half the price\na cheap shot\nfor little money or for less than is usual: I got some shoes cheap in the sale. There were some chairs in the market going cheap (= they were not expensive).\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncomp\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsomething for nothing idiom\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\nIdiom\nnot come cheap\ncheap adjective [-er/-est only]\n(COST)\nAdd to word list\nAdd to word list\ncosting little money or less than is usual or expected: After World War II, the US had cheap labor, cheap energy, cheap raw materials, cheap housing, cheap food, and cheap transportation. Used computers are dirt cheap (= very cheap).\nIf a place that sells goods or services is cheap, it charges low prices: a cheap department store\nGoods that are cheap are low in price but of poor quality: The cheap rug did not come clean.\ndisapproving Someone who is cheap is unwilling to spend money: The boss is cheap – he’ll never buy a new truck if he can squeeze a few more miles out of the old one.\ncheap adjective [-er/-est only]\n(CHARACTER)\nconsidered to have a low moral character or value: She called him a cheap thug and a liar.\nAdd to word list\nAdd to word list\ncosting little money or less than is usual or expected: I got a cheap flight at the last minute. Food is usually cheaper in supermarkets. During times of mass unemployment, there's a pool of cheap labour for employers to draw from. See also\ninexpensive\nif a store, restaurant, etc. is cheap, it charges low prices: This is the cheapest office supplies store in the city. See also\ninexpensive\nlow in quality and low in price: He bought some cheap shoes that fell apart after a couple of months.\nUS disapproving ( UK mean) unwilling to spend money: He's so cheap we didn't get a pay raise this year.\ncheap and cheerful UK informal\ncheap, but good or enjoyable: There's a restaurant round the corner that serves cheap and cheerful food.\ncheap and nasty\nUK informal costing little, and of bad quality: Spend a little more and avoid getting something that is just cheap and nasty.\nfor little money, or for less than is usual: buy/sell sth cheap I bought it cheap from an internet auction site.\nbe going cheap\nto be for sale for less than you would normally expect to pay: Many mortgage deals are going cheap right now.\nnot come cheap\nif you say that something does not come cheap, you mean that it is of good quality and is therefore expensive: If you want a qualified accountant, their services don't come cheap.\non the cheap informal\nif something is bought, done, or produced on the cheap, it is bought, etc. for less money than you would normally expect to pay, and is perhaps of poor quality: This site will help you to eat well on the cheap. Much of the refurbishment work has been done on the cheap - and it shows."}