{"id":93652,"name":"checkout","type":"noun","us_sound":"ˈtʃek.aʊt","us_link":"../audio/c/ca2us028.mp3","uk_sound":"ˈtʃek.aʊt","uk_link":"../audio/c/ca2uk024.mp3","content":"Add to word list\nAdd to word list\nB1 the place in a shop, especially a large food shop, where you pay for your goods: Your fruit and vegetables will be weighed at the checkout. She works on the checkout at the local supermarket.\nTom Werner/DigitalVision/GettyImages\nB1 the place on a website where you order and pay for goods: Choose your CD-ROMs and proceed to checkout.\nMore examplesFewer examplesI saw a mother at the checkout trying to manage two small children and a mountain of shopping.When I got to the checkout, I realized I'd left my purse at home.There was a long queue at the checkout and customers were getting impatient.If there are customers waiting, they are usually quick to open another checkout.Another member of staff came to the checkout to let Gavin go for his lunch-break.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nAdd to word list\nAdd to word list\nthe act of leaving a hotel and paying your bill: Late checkout should be arranged in advance.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE the place in a store, especially a large food store, where you pay for your goods: Your fruit and vegetables will be weighed at the checkout. She works on the checkout at the local supermarket.\n[ C or U ]\n&#160; E-COMMERCE the area of a website where you order and pay for goods, or the process of paying for goods: Click on your selections and proceed to checkout.\n[ U ] the process of leaving a hotel room, paying for it, and returning the key: Checkout is at 11:00 am. Speak to Reception if you would like to request a later checkout."}