{"id":93604,"name":"check","type":"verb","us_sound":"tʃek","us_link":"../audio/c/check.mp3","uk_sound":"tʃek","uk_link":"../audio/c/ukcheat004.mp3","content":"check verb\n(EXAMINE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to make certain that something or someone is correct, safe, or suitable by examining it, him, or her quickly: You should always check your oil, water, and tyres before taking your car on a long trip. Customs stopped us and checked (= searched) our bags for alcohol and cigarettes. After I'd finished the exam, I checked my answers for mistakes. The doctor will call next week to check on your progress. I check on (= visits) our elderly neighbour every few days to make sure that he's alright. [ + (that) ] I always check (that) I've shut the windows before I leave the house. He double-checked all the doors (= checked them all twice) before leaving the house. Synonyms\ncheck something out (EXAMINE) informal\nexamine (LOOK AT CAREFULLY)\ninspect\nperuse formal\nscan (LOOK)\nstudy (EXAMINE)\nsurvey (LOOK AT) formalSee also\ncrosscheck verb (INFORMATION)\nB1 [ I or T ] to find out about something: [ + question word ] I called them yesterday to check when they were arriving. [ + to infinitive ] If you're near the garage, could you check to see (= ask) if the car's ready? If you're unsure of your legal rights, I would check with (= ask) a lawyer.\nMore examplesFewer examplesIt's a good idea to check the flight departure time before you leave for the airport.I'd like to check my bank balance, please.Patricia has checked the reports and can vouch for the accuracy of the information.You should have your teeth checked by a dentist at least twice a year.Remember to go over your essay checking for grammar and spelling mistakes before you hand it in to me.\nSMART Vocabulary: related words and phrases\nTesting, checking and experimenting\nartefact\nassay\nbackground check\ncalibrate\ncalibration\nexperimentally\nexperimentation\nexperimenter\nfactorial\nfeeler\ninoculate\nput something to the test idiom\nrecheck\nreinspect\nreinspection\nresample\nuncheckable\nuntestable\nuntested\nwelfare check\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuestioning people & asking questions in general\ncheck verb\n(STOP)\n[ T ] to stop someone from doing or saying something, or to prevent something from increasing or continuing: They have begun to vaccinate children in an attempt to check the spread of the disease.\nThesaurus: synonyms, antonyms, and examples\nto prevent something from happeningpreventVaccination will prevent the spread of the disease.avoidLabel the boxes to avoid confusion.stopThis should stop any further trouble.avertWe had to act quickly to avert disaster.prohibitBehavioural problems in the classroom prohibit learning.checkChildren are being vaccinated in an attempt to check the spread of the disease.\nSee more results »\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprejudice\nprevent\npreventable\npreventative\nprevention\nscuttle\nsmother\nsuffocate\nSee more results »\ncheck verb\n(LEAVE)\n[ T ] mainly US (UK usually check in) to give your bags to airport employees to be put on a plane for you, rather than carrying them on and off the plane yourself : I got my boarding pass and checked my suitcase. Many airlines charge extra for checked bags/baggage/luggage.\n[ T ] mainly US to leave something with someone at a particular place, so that they can take care of it for a short time: It was hot so we checked our coats before going round the gallery.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\nconnection\ndeparture\ndescent\ndestination\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\ncheck verb\n(AGREE)\n[ I ] mainly US If information checks, it agrees with other information: Her statement checks with most of the eye-witness reports.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\ncheck verb\n(MARK)\nA1 [ I or T ] mainly US (UK usually tick) to mark something with a check: Check (off) each item on the list as you complete it.\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nL-plate\nMaltese cross\nMorse code\npatch\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\ncheck verb\n(CHESS)\n[ T ]\n&#160; games\n&#160; specialized in the game of chess, to put the other player's king under direct attack, so that he or she is forced to defend against the attack in the next move\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\ndraught\nendgame\nforfeit\ngambit\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\ncheck verb\n(SPORTS)\n[ T ]\n&#160; sports\n&#160; mainly US specialized in some sports such as ice hockey, to hit or push another player in order to try to make that player lose the ball or puck: He checked Stevens into the boards and stole the puck. If you check a player too hard, you might injure that person or get penalized for it.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHockey\nPhrasal verbs\ncheck in\ncheck in/check into something\ncheck something in\ncheck something off\ncheck out\ncheck something out\ncheck up on someone\ncheck noun\n(EXAMINATION)\nB1 [ C ] an examination of something in order to make certain that it is correct or the way it should be: The soldiers gave their equipment a final check before setting off. \"I can't find my keys.\" \"Have another check in/through your jacket pockets.\" Security checks have become really strict at the airport. The police are carrying out spot checks on (= quick examinations of a limited number of) drivers over the Christmas period to test for alcohol levels. It's my job to keep a check on stock levels. I'll just run a check on (= find information about) that name for you in the computer.\nMore examplesFewer examplesWe make a fortnightly check on supplies.They carried out the pre-flight checks.I made one last check that we had not forgotten anything.Can you have a check in the kitchen to see if my keys are in there?\nSMART Vocabulary: related words and phrases\nTesting, checking and experimenting\nartefact\nassay\nbackground check\ncalibrate\ncalibration\nexperimentally\nexperimentation\nexperimenter\nfactorial\nfeeler\ninoculate\nput something to the test idiom\nrecheck\nreinspect\nreinspection\nresample\nuncheckable\nuntestable\nuntested\nwelfare check\nSee more results »\ncheck noun\n(MONEY)\n[ C ] US spelling of\ncheque UK\nMicroStockHub/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\ncheck noun\n(PATTERN)\n[ C or U ] a pattern of squares in two or more colours: a shirt with a pattern of blue and yellow checks I chose the red and white check. She covered the bed in a blue and white check blanket. a grey check suit\ndetshana/iStock/Getty Images Plus/Getty Images /GettyImages\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\ncheck noun\n(RESTAURANT)\nA2 [ C ] US a\nbill in a restaurant, etc.: Can I have the check, please?\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nreceipt\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\ncheck noun\n(LIMIT)\nhold/keep something in check\nto limit something: We need to find ways of keeping our expenditure in check.\nSee more checks and balances\nrules intended to prevent one person or group from having too much power within an organization: A system of checks and balances exists to ensure that our government is truly democratic.\nSee more Synonyms\nconstraint\ncontrol (POWER)\ncurb (CONTROL)\ncurtailment\nlimit\nlimitation\nrein\nrestraint\nrestriction\ncheck noun\n(MARK)\nA2 [ C ] mainly US (UK usually tick) a mark (✓) that shows that something is correct or has been done: Put a check by/against the names of the people who have accepted the invitation.\nUmbertoPantalone/ iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nL-plate\nMaltese cross\nMorse code\npatch\nregistered trademark\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\ncheck noun\n(CHESS)\n[ U ]\n&#160; games\n&#160; specialized in chess, the act of directly attacking the other player's king: I think I should have given check (= attacked my opponent's king) at move 23 instead of trying to find a safer square for the rook. in check games\n&#160; specialized\nIf your king is in check in chess, it is being directly attacked by the other player: Your king is in check from my knight. If your king is in check, you must make a move that protects it. I couldn't take her bishop because I was in check. He moved his queen and put his opponent's king in check. You must not make any move that would put your king in check. Compare\ncheckmate noun\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\ndraught\nendgame\nforfeit\ngambit\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\ncheck noun\n(SPORTS)\n[ C ]\n&#160; sports\n&#160; mainly US specialized in some sports such as ice hockey, a defensive move (= trying to prevent scoring) in which a player hits or pushes another player to try to make that player lose the ball or puck: The check that he leveled on Branson was perfectly legal according to the rules of the game. He was injured on a forceful check by Evans in the center of the ice.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHockey\ncheck exclamation\n(YES)\nmainly US used to say yes to someone who is making certain that all the things on a list have been dealt with or included: \"Did you bring your sleeping bag?\" \"Check.\" \"Pillow?\" \"Check.\"\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nyou bet idiom\nSee more results »\ncheck exclamation\n(CHESS)\ngames\n&#160; specialized something you say in chess, if you directly attack the other player's king Compare\ncheckmate\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChinese chequers\nChutes and Ladders\ncounterplay\ndefence\ndraught\nendgame\nforfeit\ngambit\npawn\npin\nqueen\nqueenside\nre-roll\nresign\nsquare\nSee more results »\ncheck verb\n(EXAMINE)\nAdd to word list\nAdd to word list\n[ I/T ] to look at or give your attention to something to get information, often to help you decide if something is correct, safe, or suitable: [ + to infinitive ] Check to see what the weather is like outside. [ T ] I brought the car to the garage to have the brakes checked. [ T ] We checked our records for any information about him. [ I ] We have a claim for lost luggage, and we are checking into it. [ T ] The doctors checked his heart and said it was fine. [ T ] Before you hand in your papers, check your spelling.\ncheck verb\n(STOP)\n[ T ] to stop someone from doing or saying something, or to prevent something from increasing or continuing: He started to interrupt but checked himself and said nothing. The program is designed to check the spread of malaria.\ncheck verb\n(LEAVE)\n[ T ] to leave your outer clothing or property temporarily in the care of someone else, usually as a convenience: Let’s check our coats before going through the galleries. Passengers on this flight will be allowed one carry-on bag, and will have to check any additional bags.\ncheck verb\n(MARK)\n[ T ] to mark items to show your preferences: Check the box corresponding to the correct answer to each question. Phrasal verbs\ncheck in\ncheck off something\ncheck out\ncheck out (something)\ncheck out something\ncheck out (something)\ncheck out something\ncheck up on someone\ncheck noun\n(MONEY)\n[ C ] a printed form, used instead of money, to make payments from your bank account: I’ve got to cash my pay check. She wrote me a check for $120.\ncheck noun\n(PATTERN)\n[ C ] a pattern made of different colored squares, or one of these squares: The shirt has a pattern of blue and yellow checks.\ncheck noun\n(MARK)\n[ C ] a sign (✓) that shows that something is correct or done or has been examined: Put a check next to the names of the people who have already paid for their tickets.\ncheck noun\n(REQUEST FOR PAYMENT)\n[ C ] a request for payment of money owed to a restaurant, or the piece of paper on which it is written: Waiter, may I have the check, please?\ncheck noun\n(EXAMINATION)\n[ C ] the act of looking at or giving your attention to something to get information, often to help you decide if something is correct, safe, or suitable: The FBI did a thorough background check on him (= looked into his past experience and relationships).\ncheck noun\n(STOP)\na way to stop someone from doing or saying something, or to prevent something from increasing or continuing: New rules would put a check on rising interest rates.\ncheck noun\n(LEAVE)\n[ C ] the ticket or small object that you are given and that you use to get back your coat or other personal possessions left in the care of someone else for a short period: I thought I put the coat check in my pocket. Idiom\nin check\nAdd to word list\nAdd to word list\n[ I or T ] to make certain that something or someone is correct, safe, or suitable, for example by examining it or them, or by asking someone: When the shipment arrived, she checked to make sure nothing was broken. A security officer checked our bags at the entrance to the building. I'd like to check my bank balance, please.check on sth The supervisor will check on your progress next week.check (sth) for sth Always check your reports for spelling errors before you hand them in.check (sth) with sb Please could you check the figures with the sales manager?check that Check that you have all the necessary documentation before you travel. Compare\ndouble-check\n[ T ] to prevent something from increasing or continuing: Our first priority is to control public spending and check inflation. We tried to check the spread of the rumour that the company was being sold.\n[ T ] to leave something with someone at a particular place, so that they can take care of it for a short time, or so it can be put on a plane or train: Please check your coats at the coatroom prior to the meeting. He checked his baggage as soon as he got to the airport. These articles may only be carried in checked baggage.\n[ T ] to make a mark next to an item on a list, or to click on a checkbox on a computer screen in order to make a choice: Please check the box above to agree to our terms and conditions. See also\ntick noun\n[ I ] if information checks, it makes it likely that other information is true: check with sth Her statement checks with most of the eye-witness reports. Phrasal verbs\ncheck in/check into sth\ncheck sth in\ncheck sth off\ncheck on sb/sth\ncheck out\ncheck out (of sth)\ncheck sth out\nBANKING\n&#160; US →\ncheque\n→\ncheck mark : Put a check beside each item that you wish to order. See also\ntick noun\nan examination of something in order to make certain that it is correct or the way that it should be: give sth a check Give the invoice another check before you seal the carton.carry out/do a check (on/of sth) They carried out a check of all the electrical equipment. regular/routine check A regular check is done on all our equipment.quick/thorough check All these documents will need a thorough check before you send them off.keep a check on sth It's my job to keep a check on stock levels. Security checks at airports have become very strict.\nan examination of somebody to see if they are healthy or have a medical problem: health/medical check Purchasers of the policy will be required to undergo a medical check.\nCOMMERCE\n&#160; US (UK bill) a piece of paper given to you when you have finished eating at a restaurant, showing how much money you owe: Can we have the check, please?\nsomething that stops something else from increasing or getting worse: keep a check on sth The new administration is expected to keep a tight check on inflation.act/serve as a check on sth These controls are designed to act as a check on fraud.\nhold/keep sth in check\nto put a limit on something so that it does not increase or become worse: We must find ways of keeping our expenditure in check.\nchecks and balances\nGOVERNMENT rules intended to prevent one person or group from having too much power within a country or an organization: A system of checks and balances exists to ensure that our government is truly democratic. Many executives amassed enormous power by ignoring the normal checks and balances of the financial world. See also\nbackground check\ncredit check\nsales check\nspot check"}