{"id":93646,"name":"checkmate","type":"noun","us_sound":"ˈtʃek.meɪt","us_link":"../audio/c/checkmate.mp3","uk_sound":"ˈtʃek.meɪt","uk_link":"../audio/c/ukcheat011.mp3","content":"Add to word list\nAdd to word list\na winning position in chess in which you have put the other player's king under a direct attack from which it cannot escape\na situation in which someone has been defeated or a plan cannot develop or continue Compare\nstalemate\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChutes and Ladders\ncounterplay\ndefence\nendgame\nforfeit\ngambit\ngrandmaster\nmove\npin\nqueen\nqueenside\nre-roll\nresign\nrook\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nDifficult situations and unpleasant experiences\nto achieve a winning position in chess in which you have put the other player's king under a direct attack from which it cannot escape: My dad can always checkmate me within 20 moves. The goal is to checkmate an opponent's king.\nto create a situation in which someone is defeated or a plan cannot develop or continue: The committee discussed the best method to checkmate this move. They are doing their best to checkmate those conspiring against the State. Compare\nstalemate\nMore examplesFewer examplesWhen a player can not get his king out of check, the king is checkmated and the game is over.My opponent methodically demolished me, piece by piece, until finally I was checkmated.Checkmated by the cunning Pope, he was put on trial in Florence.\nSMART Vocabulary: related words and phrases\nBoard games\nbackgammon\nbishop\nblitz\nboard game\ncastle\nChutes and Ladders\ncounterplay\ndefence\nendgame\nforfeit\ngambit\ngrandmaster\nmove\npin\nqueen\nqueenside\nre-roll\nresign\nrook\nsquare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nDifficult situations and unpleasant experiences"}