{"id":93738,"name":"cheerful","type":"adjective","us_sound":"ˈtʃɪr.fəl","us_link":"../audio/c/cheerful.mp3","uk_sound":"ˈtʃɪə.fəl","uk_link":"../audio/c/ukcheat023.mp3","content":"Add to word list\nAdd to word list\nB1 happy and positive: He's usually fairly cheerful. You're in a cheerful mood this morning. She manages to stay cheerful (= happy and positive) despite everything.\nThesaurus: synonyms, antonyms, and examples\nfeeling or showing pleasurehappyI'm much happier in my new job.cheerfulShe's always very cheerful.in a good moodYou're in a good mood this morning!pleasedHe was pleased that she had come back.gladI was so glad to see her.\nSee more results »\nB2 used to describe a place or thing that is bright and pleasant and makes you feel positive and happy: The doctor's waiting room was bright and cheerful with yellow walls and curtains. Turn that dreadful wailing music off and put on something cheerful.\nMore examplesFewer examplesShe's not her customary cheerful self today.She tends to adopt a falsely cheerful tone when she's upset about something.She presents such a cheerful front that you'd never guess she's ill.He's infallibly cheerful, despite his difficulties.Even at the end, when cancer racked his body, he was calm and cheerful.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchirpily\nchirpy\nchuffed\ncontented\ncontentedly\nhappily\nhappy camper\nhappy place idiom\njaunty\njocund\nshining\nsunnily\nswooning\nswooningly\nswoony\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure\nRelated words\ncheerfully\ncheerfulness\nAdd to word list\nAdd to word list\nhappy and positive in feeling or attitude: a cheerful face/spirit He was a cheerful man with a kind word for everybody.\nIf a thing or place is cheerful, it is pleasant and friendly and is likely to make you feel positive and happy: The guest bedroom was bright, airy, and cheerful, overlooking the garden. cheerfully adverb us\nYour browser doesn't support HTML5 audio\n/ˈtʃɪər·fə·li/\nJonas cheerfully agreed to sleep on the sofa. cheerfulness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈtʃɪər·fəl·nəs/\nHer cheerfulness after long hours of work is surprising."}