{"id":93994,"name":"chemistry","type":"noun","us_sound":"ˈkem.ə.stri","us_link":"../audio/c/chemistry.mp3","uk_sound":"ˈkem.ɪ.stri","uk_link":"../audio/c/ukcheer019.mp3","content":"chemistry noun [U]\n(SCIENCE)\nAdd to word list\nAdd to word list\nthe scientific study of the basic characteristics of substances and the ways in which they react or combine: She studied chemistry and physics at college. a chemistry department/laboratory\nA2 the basic characteristics of a substance and the ways in which it reacts or combines with other substances: A team of scientists has been studying the chemistry of the ozone layer.\nMore examplesFewer examplesI failed my physics exam, but I passed chemistry.He studied chemistry in preference to physics at university.As students of chemistry know, even small rearrangements of a molecule's structure can produce a compound that acts differently.Marie Curie was the woman behind enormous changes in the science of chemistry.I was up all night studying, but it was worth it - I aced my chemistry final.\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\n-ological\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfunctional skills\nfuturology\nGermanist\nglaciology\nhard science\nology\nontology\noology\norientalist\nsports scientist\nstem\nsubscience\nsuicidology\ntechnical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry - general words\nchemistry noun [U]\n(RELATIONSHIP)\ninformal a quality that exists when two people understand and are attracted to each other: The sexual chemistry between them was obvious.\nSMART Vocabulary: related words and phrases\nAttracting and tempting\naffinity\nallure\nalluringly\narrest\nattract\ncatnip\ncharisma\ncharm offensive\ncharm the pants off someone idiom\nchum\nglamorousness\nglamour\nhoney trap\nincentive\njump out at someone\ntantalizing\ntantalizingly\ntempt\ntemptation\ntemptingly\nSee more results »\nAdd to word list\nAdd to word list\nscience the basic characteristics of substances and the different ways in which they react or combine with other substances, or the scientific study of such substances and the way they act with other substances: a chemistry department/laboratory\nscience infml Chemistry is also the ability of people to have a good relationship: Building a strong team requires paying attention to team chemistry."}