{"id":93940,"name":"chemical","type":"noun","us_sound":"ˈkem.ɪ.kəl","us_link":"../audio/c/chemical.mp3","uk_sound":"ˈkem.ɪ.kəl","uk_link":"../audio/c/ukcheer015.mp3","content":"Add to word list\nAdd to word list\nB2 any basic substance that is used in or produced by a reaction involving changes to atoms or molecules: The government has pledged to reduce the amount of chemicals used in food production. Each year, factories release millions of tons of toxic (= poisonous) chemicals into the atmosphere.\nMore examplesFewer examplesThey use special chemicals to accelerate the growth of crops.Organic chemicals are used in the manufacture of plastics, fibres, solvents and paints.The body produces chemicals that are natural painkillers.Toxic chemicals continue to be dumped in the North Sea.Many chemicals have a damaging effect on the environment.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nbalanced equation\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nB2 relating to chemicals: The chemical industry produces such things as petrochemicals, drugs, and rubber.\nMore examplesFewer examplesSodium chloride is the chemical name for common salt.All chemical weapons facilities will be deactivated.Estimates of the amount of money needed to decontaminate the heavily polluted chemical installations vary.We had to learn chemical formulae at school, but I can only remember H2O for water.The chemical properties of coal are still incompletely understood.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nbalanced equation\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nRelated word\nchemically adverb\nAdd to word list\nAdd to word list\nany basic substance that is used in or produced by a reaction involving changes to atoms or molecules: His business manufactured farm chemicals.\nof, involved with, relating to, or made by using chemicals or chemistry: the chemical industry a chemical plant producing plastics and rubber chemically adverb us\nYour browser doesn't support HTML5 audio\n/ˈkem·ɪk·li/\nchemically treated paper\nAdd to word list\nAdd to word list\nany basic substance which is used in or produced by a reaction involving changes to atoms or molecules: The government has pledged to reduce the amount of chemicals used in food production. Each year, factories release millions of tonnes of toxic chemicals into the atmosphere.\nrelating to chemicals: The chemical industry produces such things as petrochemicals, drugs, paint, and rubber. chemically adverb\nThe fund provides money to clean up chemically polluted industrial sites."}