{"id":93993,"name":"chemist","type":"noun","us_sound":"ˈkem.ɪst","us_link":"../audio/c/chemist.mp3","uk_sound":"ˈkem.ɪst","uk_link":"../audio/c/ukcheer018.mp3","content":"chemist noun [C]\n(SCIENCE)\nAdd to word list\nAdd to word list\nB1 a person who studies chemistry, or a scientist who works with chemicals or studies their reactions\nExamples\nChemists at pharmaceutical companies are vying to create a cure for migraine.Chemists at Princeton University have been following a new curriculum.She worked as a chemist for the water company.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nbalanced equation\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nchemist noun [C]\n(MEDICINE)\nUK (US pharmacist) a person whose job is to prepare and sell medicines and other goods in a shop Compare\npharmacist\nA2 UK (UK also chemist's); (US drugstore) a shop where you can buy medicines, make-up, and sometimes other things such as chocolate Compare\npharmacy\nExamples\nI was given the wrong tablets when the chemist misread my prescription.I'm just going to the chemist's for some aspirin.Where's the nearest chemist?\nSMART Vocabulary: related words and phrases\nMedical studies & the people who study them\nanatomist\naudiologist\naudiology\nbacteriologist\nbariatrics\ncardiologist\nneurologist\nodontology\noncological\noncologist\noptometry\noral surgeon\northopaedics\npodiatrist\ntrichology\nuncontrolled\nurology\nvirologist\nvirology\nvivisectionist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShops & auctions\nAdd to word list\nAdd to word list\na scientist who works with chemicals or studies their reactions\nBr A chemist or chemist's is a drugstore.\nAdd to word list\nAdd to word list\na person who studies chemistry, or a scientist who works with chemicals or studies their reactions: He was a chemist who led several rubber research institutes in Malaysia. a forensic/industrial/nuclear/research chemist\nUK ( also pharmacist); (US also druggist) a person whose job is to prepare and sell medicines in a store: If you think that you may qualify for free prescriptions, ask the chemist for a receipt form.\nCOMMERCE\n&#160; UK (UK also chemist's); (UK also chemist shop); ( also pharmacy); (US also drugstore) a store where you can buy medicines, beauty products, products for washing your body, etc.: He is chairman of Boots, Britain's biggest chemist. Jane was a pharmacist in a chemist's in a small town."}