{"id":94107,"name":"cheque","type":"noun","us_sound":"tʃek","us_link":"../audio/c/check.mp3","uk_sound":"tʃek","uk_link":"../audio/c/ukcheat004.mp3","content":"Add to word list\nAdd to word list\nA2 a printed form, used instead of money, to make payments from your bank account: I wrote him a cheque for £50. I don't have any cash on me, so could I pay with a/by cheque? Who should I make out this cheque to? (= Whose name should I write on it?) Please make your cheques payable to The Brighter Toyshop Ltd (= write this name on them).\nMicroStockHub/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesIt usually takes four to five working days for a cheque to clear.Please find enclosed a cheque in settlement of your invoice.A customer had tried to pass off a dud cheque .I made a cheque out for £20 to 'Henry's Supermarket'.When she got her first salary cheque, she indulged in an orgy of spending.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nAdd to word list\nAdd to word list\ncheck\nAdd to word list\nAdd to word list\nBANKING a printed form that you can write an amount of money on and sign in order to make a payment from your bank account: write (sb) a cheque (for sth) I wrote him a cheque for £50.make out a cheque to sb Who should I make out this cheque to? Please make your cheque payable to S Jones. pay by cheque It is becoming increasingly unusual for people to pay by cheque.accept/take cheques From next year this store will no longer take cheques.stop a cheque If you suspect fraud, contact your bank and ask them to stop the cheque and ensure that it is not paid.\na cheque bounces/is bounced\nif a cheque bounces, or is bounced, the bank refuses to pay it because there is not enough money in the account: The bank had bounced my cheque because some of the funds in the account had not cleared in time.\ncash a cheque\nto exchange a cheque for cash: I'm sorry, but we are not able to cash cheques.\na cheque clears/is cleared\nif a cheque clears, or a bank clears it, money is made available because it has been successfully paid from one account to another: You will not be able to withdraw funds until the bank has cleared your cheque. See also\nantedate\nbank-certified cheque\nbank cheque\nbearer cheque\nblank cheque\ncashier's cheque\ncertified cheque\ncross\ndividend cheque\ndud cheque\nView all\nendorsed cheque\nopen cheque\npay cheque\npersonal cheque\npost-date\nrebate check\nrubber cheque\nstale cheque\nthird-party cheque\ntraveller's cheque\nuncrossed cheque"}