{"id":94226,"name":"chest","type":"noun","us_sound":"tʃest","us_link":"../audio/c/chest.mp3","uk_sound":"tʃest","uk_link":"../audio/c/ukchess003.mp3","content":"chest noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nB2 the upper front part of the body of humans and some animals, between the stomach and the neck, containing the heart and lungs: He was shot in the chest at point blank range. He folded his arms across his chest. His shirt was open to the waist revealing a very hairy chest. She went to the doctor complaining of chest pains.\nPongsak Tawansaeng / EyeEm/GettyImages\nMore examplesFewer examplesLie on your back, clasp your knees and pull them down towards your chest.Clutching the money to his chest, he hurried to the bank.He's tiny, he doesn't even come up to my chest!The breathing problem has now been complicated by a chest infection.He felt a constriction in his chest.\nSMART Vocabulary: related words and phrases\nThe human torso\n-bellied\n-chested\nabs\naxilla\nbread basket\nbreast\ncoeliac\ndiaphragm\nflank\ngroin\npot\nshoulder\nsix-pack\nspare tyre\nthoracic\nthorax\numbilicus\nvisceral muscle\nwaisted\nwaistline\nSee more results »\nchest noun [C]\n(BOX)\nC2 a large, strong box, usually made of wood, used for storing goods or possessions or for moving possessions from one place to another: Her books and clothes were packed into chests and shipped across to Canada.\nklikk/ iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nGeneral and miscellaneous containers\nBall jar\nbin\nbindle\nbiscuit tin\ncaddy\ndrum\nflowerpot\ngeocache\ngift box\ngunnysack\npacking case\npaintbox\npallet\npiggy bank\nplanter\nuncase\nurn\nvivarium\nworkbasket\nworkbox\nSee more results »\nIdiom\nget something off your chest\nchest noun [C]\n(BODY PART)\nAdd to word list\nAdd to word list\nthe upper front part of the body of humans and some animals, between the stomach and the neck, enclosing the heart and lungs: He folded his arms across his chest.\nchest noun [C]\n(BOX)\na large, strong box, usually made of wood, which is used for storing valuable goods or possessions or for moving possessions from one place to another"}