{"id":94578,"name":"child","type":"noun","us_sound":"tʃaɪld","us_link":"../audio/c/child.mp3","uk_sound":"tʃaɪld","uk_link":"../audio/c/ukchilb002.mp3","content":"Add to word list\nAdd to word list\nA1 a boy or girl from the time of birth until he or she is an adult, or a son or daughter of any age: an eight-year-old child As a child I didn't eat vegetables. A small group of children waited outside the door. Both her children are now married with children of their own. Jan is married with three young children. See also\nbrainchild\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nyour childchildWe have three children, two girls and a boy.sonMy son is getting married in the spring. daughterHer daughter works for a multinational in the Netherlands. kidMy two kids are both grown up now.offspringI'm sure you'll be relieved once your offspring grow up and leave home.broodMy sister descended on me with her brood of five.\nSee more results »\ndisapproving an adult who behaves badly, like a badly behaved child: He's such a child if he doesn't get his own way. a child of something\nsomeone who has been very influenced by a particular period or situation: Me, I'm a child of the 60s.\nSee more\nMore examplesFewer examplesShe had to drag her child away from the toy shop.Her eldest child is nearly 14.She's got four children, all under the age of five.The children are always hungry when they get home from school.Don't be so silly - you're acting like a child!\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfilial\nfilially\nfirst cousin\nfraternal\ngrand-nephew\nkinswoman\nkith and kin\nlong-lost\nloved one\nmaiden aunt\nrelationship\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChildren & babies\nStupid and silly people\nIdioms\nbe child's play\nchildren should be seen and not heard\n(great) with child\nAdd to word list\nAdd to word list\na person from the time of birth until he or she is an adult, or a son or daughter of any age: Jan has a three-year-old child and two school-age children. Now in their 60s, Jerome and Sally have two grown children (= adult sons or daughters). childlike adjective us\nYour browser doesn't support HTML5 audio\n/ˈtʃɑɪldˌlɑɪk/\nchildlike enthusiasm/innocence Idiom\nchild’s play"}