{"id":94674,"name":"chiller","type":"noun","us_sound":"ˈtʃɪl.ɚ","us_link":"../audio/c/cdo0123uschil0468.mp3","uk_sound":"ˈtʃɪl.ər","uk_link":"../audio/c/cdo0123ukchil0687.mp3","content":"chiller noun [C]\n(COLD)\nAdd to word list\nAdd to word list\na container or room for keeping food or drinks cold: In hot weather it is better to store seafood in the chiller. The vegetables were all in a chiller with no prices displayed. a chiller cabinet/shelf\na machine or device for making or keeping a place, a substance, etc. cold: Efficient new chillers in the office building are expected to cut energy use by 10 to 12 percent. The pipes form part of a high-efficiency chiller system. I like these wine-bottle chillers. See also\nblast chiller\nchill cabinet\nMore examplesFewer examplesThe beef is hung in a chiller for three to four weeks.That fresh fish on the chiller shelf in the supermarket is at least two weeks old.A large box called a chiller freezes water during the night.There was a malfunction with a chiller that is set to kick in when the water gets too hot.\nSMART Vocabulary: related words and phrases\nPreserving & storing food\naluminium foil\nbeeswax wrap\nbin\nbiscuit tin\nbread basket\nflash-freeze\nfoil\nfood technology\nfreeze-dried\nfreeze-dry\nplastic wrap\npotted\npreserving\nprocessed\nprocessing\nultra-pasteurized\nultra-processed\nunrefrigerated\nunsulphured\nvacuum-packed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: vents & ventilation\nchiller noun [C]\n(FRIGHTENING)\ntheatre &amp; film, literature\n&#160; specialized, informal a frightening film, book, story, etc.: He directed Dawn of the Dead, the classic 1978 chiller. Wilkie Collins' 1860 novel \"The Woman In White\" is a Victorian chiller with a twisted yet charismatic villain. Synonym\nspine-chiller\nMore examplesFewer examplesWe've picked ten of the creepiest chillers in cinema history.The novel is a short, realistic chiller about a postapocalyptic world. \"The Piano Teacher\" is an intriguing little chiller that opened last night at the Mill Theatre.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\nGothic\nhokum\npaean\nparodic\nparody\npassion project\npastiche\npolice procedural\nprocedural\npsychological\nslow\nsmash\nSee more results »"}