{"id":94607,"name":"childproof","type":"adjective","us_sound":"ˈtʃaɪld.pruːf","us_link":"../audio/c/uschest019.mp3","uk_sound":"ˈtʃaɪld.pruːf","uk_link":"../audio/c/ukchilb015.mp3","content":"Add to word list\nAdd to word list\nsafe for children because of not being able to be opened, operated, reached, etc. by a child: Most bottles of bleach have childproof caps. Install childproof latches on your kitchen cabinet doors.\nMore examplesFewer examplesBeware when grandparents visit, as they may bring medication that isn't in child-proof bottles.Knives should be stored in a cabinet with a childproof lock.The child had managed to climb over the supposedly childproof gate.The landlord is obliged to provide child-proof window guards.We want to build an enclosed pool — we are looking for something childproof but without spoiling the appearance of the surrounding garden.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncrawler\ndesigner baby\ndevil\ndiddums\ndummy\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nto make a place safe for children by preventing them from reaching or touching things that are dangerous: When your baby starts to crawl, you will need to childproof your home. It is good for a toddler to roam freely around a room as long as it has been childproofed. Related word\nchildproofing\nMore examplesFewer examplesHe left tools and appliances lying around without childproofing them.It's not possible to childproof the whole world.They even recommend child-proofing toilets by locking down the lid.\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncrawler\ndesigner baby\ndevil\ndiddums\ndummy\nonly child\noops-a-daisy\npacifier\npapoose\nperisher\ntoddler\ntoilet-trained\ntomboy\ntot\ntyke\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe & enclosed spaces\nAdd to word list\nAdd to word list\ndifficult for children to open or use: Keep all medicines in their original childproof containers."}