{"id":94581,"name":"childbearing","type":"noun","us_sound":"ˈtʃaɪldˌber.ɪŋ","us_link":"../audio/c/uschest013.mp3","uk_sound":"ˈtʃaɪldˌbeə.rɪŋ","uk_link":"../audio/c/ukchilb003.mp3","content":"Add to word list\nAdd to word list\nthe process or fact of having babies: Delayed childbearing, smaller families, and careers for women are increasingly becoming the norm. How does childbearing affect women's incomes? Compare\nchildbirth\nMore examplesFewer examplesAre teen mothers likely to display poorer parenting skills compared to women who delay childbearing?There is a tendency to postpone childbearing and have fewer children.According to a WHO estimate, about half a million women die annually of illnesses associated with childbearing.He said the single most important way to combat poverty is to empower women to take control of their child-bearing. The country had one of the highest rates of teenage childbearing.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nbreech\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nnewborn\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nrelating to the time in her life when a woman is able to have babies: The survey is only concerned with women of childbearing age. The procedure could allow women to conceive past their normal childbearing years.\nMore examplesFewer examplesThey advise women of child-bearing age to avoid certain foods.The condition tends to affect women past childbearing age.She wondered how many childbearing years she had left.Any patient of childbearing potential must be tested for pregnancy before being given the drug.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nbreech\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nnewborn\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nAdd to word list\nAdd to word list\nof or relating to the process of a woman becoming pregnant and giving birth to a baby: women of childbearing age"}