{"id":94774,"name":"chimera","type":"noun","us_sound":"kaɪˈmer.ə","us_link":"../audio/c/cdo0123uschim0471.mp3","uk_sound":"kaɪˈmɪə.rə","uk_link":"../audio/c/cdo0123ukchim0690.mp3","content":"chimera noun [C]\n(MIXTURE)\nAdd to word list\nAdd to word list\n(also Chimera) in Greek mythology (= ancient stories), a creature with a lion's head, a goat's body, and a snake's tail: He built a clay model of the mythological Greek Chimera, part lion, part goat and part serpent.\npegasophoto/iStock/Getty Images Plus/GettyImages\nbiology\n&#160; specialized an organism that contains cells or tissues from two or more different species or from two or more genetically different living things: The clinic has created human-pig chimeras by adding human stem cells to pig fetuses. Related word\nchimerism\nliterary something made up of parts of things that are very different from each other: The composer described the project as \"a chimera, a cobbled-together creature.\"\nMore examplesFewer examplesThe bestiary of mythological creatures includes basilisk, chimera, and sphinx.Animal chimeras have been made for years in the study of developmental biology. This is a brilliant chimera of a novel that combines the dark mythology of fantasy with the delicious social comedy of Jane Austen.\nSMART Vocabulary: related words and phrases\nMythological & legendary characters\nAbominable Snowman\nAnancy\nAndromeda\nAres\nbasilisk\nCinderella\ndragon\ngenie\nHermes\nhobgoblin\nJanus\njinn\nJuno\nJupiter\nKris Kringle\nsiren\nthe sandman\nunicorn\nVictoria\nZeus\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMythology: Greek & Roman myth\nGenetics\nVariety and mixtures\nchimera noun [C]\n(UNLIKELY HOPE)\nformal or literary a hope or dream that is very unlikely ever to come true: Is the ideal of banishing hunger throughout the world just a chimera? Why do people chase the chimera of fame? Synonyms\na figment of someone's imagination\nillusion\nmirage literary\nMore examplesFewer examplesHe called the report \"a chimera of optimistic assumptions and pie-in-the-sky projections\".The supposed low cost of the system is something of a chimera.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nglass\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\nlife-affirming\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\npositivism\ntrust\nwing\nSee more results »\nRelated word\nchimerical"}