{"id":94935,"name":"chinook","type":"noun","us_sound":"ʃɪˈnʊk","us_link":"../audio/c/cdo0318uschin0902.mp3","uk_sound":"tʃɪˈnʊk","uk_link":"../audio/c/cdo0319ukchin0286.mp3","content":"chinook noun [C]\n(WIND)\nAdd to word list\nAdd to word list\n(also chinook wind) a warm, dry wind that blows from the mountains over the flatter land to the east in western North America: Colorado often gets particularly hard hit by chinooks. The famous chinook wind blows constantly off the Rockies right across this patch of southern Alberta.\nMore examplesFewer examplesIt is a chinook, a wind that races down the eastern slopes of the Rockies. In Colorado the wind is called a chinook, blowing off the mountains.A Canadian study recently demonstrated a link between chinooks and the onset of migraines.\nSMART Vocabulary: related words and phrases\nWind & winds\nanemometer\nblast\nbreeze\ncyclonic\ncyclonically\neasterly\njet stream\nleeward\nnorthwesterly\nsigh\nsirocco\nslipstream\nsouthwester\nsquall\nstiff\nthe Coriolis effect\ntornado\nwindblown\nwindswept\nwuthering\nSee more results »\nchinook noun [C]\n(FISH)\n(also Chinook) plural chinook or or chinooks (also chinook salmon, Chinook salmon) a fish that is a large type of salmon (= fish that live both in the sea and in rivers, and swim up rivers to produce their eggs): The chinook is the largest Pacific salmon. The river and estuary provide an essential habitat for chinook salmon.\nlightasafeather/E+/GettyImages\nMore examplesFewer examplesA large Chinook is a prized catch for a sporting angler.Chinook are native to the North Pacific Ocean and the river systems of western North America.The orcas like to eat salmon, particularly chinooks.The Yuba River supports the largest run of wild chinook salmon in the state.\nSMART Vocabulary: related words and phrases\nSea fish\nalbacore\nAmerican shad\nanchovy\nbarracuda\nbeluga\nflatfish\nflathead\nflounder\nflying fish\nfugu\npilchard\npink salmon\nplaice\npollack\npomfret\nstickleback\nstingray\nstonefish\nstriped bass\nsturgeon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreshwater fish\nFish & seafood"}