{"id":94955,"name":"chintzy","type":"adjective","us_sound":"ˈtʃɪnt.si","us_link":"../audio/c/chintzy.mp3","uk_sound":"ˈtʃɪnt.si","uk_link":"../audio/c/ukchimn017.mp3","content":"chintzy adjective\n(DECORATION)\nAdd to word list\nAdd to word list\nmainly disapproving having a lot of traditional decoration, especially using cloth with patterns of flowers; this word is often used when you think this style is ugly or not fashionable: I find their house a bit too chintzy. a chintzy rose-patterned sofa\nMore examplesFewer examplesThe room contains an assortment of gilt-edged pieces of furniture and a chintzy rose-patterned sofa.The decor may be rather chintzy and cheesy, but the hotel is unpretentious, relaxed and informal.You are not likely to see a pub that has this much chintzy decor back in Ireland.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngopping\ngracelessly\nhave a face like the back end of a bus idiom\nhideous\nhideousness\npretty\npretty-pretty\nputridly\nreptilian\nscrappily\nunshapely\nunsightly\nvulgarity\nvulgarly\nSee more results »\nchintzy adjective\n(CHEAP)\nUS cheap and of low quality: The room was full of chintzy Christmas decorations.\nUS not willing to spend money: Don't be so chintzy - the whole evening will only cost you ten bucks.\nMore examplesFewer examplesHe heaped praise on them for running a high-class operation. \"They're not chintzy,\" he said.Some of the CGI special effects come off as chintzy.You can't be chintzy; you can't compromise on the quality of ingredients.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncompliment\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsupersaver\nultra-cheap\nworthlessly\nworthlessness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMean with money\nAdd to word list\nAdd to word list\n(of things) cheap and not well made, or (of people) not willing to spend money: He never tipped enough – he was too chintzy."}