{"id":95578,"name":"chocolate","type":"noun","us_sound":"ˈtʃɑːk.lət","us_link":"../audio/c/chocolate.mp3","uk_sound":"ˈtʃɒk.lət","uk_link":"../audio/c/ukchock003.mp3","content":"Add to word list\nAdd to word list\nA1 [ U ] a sweet, usually brown, food made from cacao seeds, that is usually sold in a block and is often used as a flavour for desserts, drinks, etc.: a bar of chocolate milk/dark/white chocolate\nPannonia/E+/GettyImages\n[ C ] a small sweet made from chocolate: I took her a box of chocolates. I like the chocolates with the caramel in the middle.\n[ C or U ] UK a hot drink made from milk or water, powdered chocolate, and sugar: I was tucked up in bed with a mug of chocolate. Don't drink anything with caffeine (coffee, tea, cola, or chocolate) close to bedtime. Synonym\nhot chocolate\nsubjug/iStock/Getty Images Plus/GettyImages\n[ U ] a dark brown colour: The picture shows the top in apricot teamed with the skirt in chocolate. That deep chocolate on the walls looks beautiful.\nepic11/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesYou can use cocoa powder to make the cake rather than chocolate - it's a bit of a cheat, but nobody notices the difference.I absolutely adore chocolate.He was chomping away on a bar of chocolate.I have to combat this constant desire to eat chocolate.Melt the chocolate to a pouring consistency.Do you want another chocolate?\nSMART Vocabulary: related words and phrases\nPuddings, desserts & ices\nbaked Alaska\nbaklava\nbanana split\nbananas Foster\nbanoffee pie\ncrumble\ncrème caramel\ndessert\ndulce de leche\ndumpling\nknickerbocker glory\nkugel\nlolly\nmochi\nmousseline\nsopaipilla\nsorbet\nsoufflé\nspotted dick\nspumoni\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlavours - sweet\nSweets\nWarm drinks\nLess common colours\nmade of or relating to chocolate: Here is a recipe for chocolate cupcakes that are pretty tasty. chocolate brownies served with vanilla ice cream\nhaving a dark brown colour: The number of sheep with dark chocolate-coloured coats is declining. There are chocolate linen curtains and crisp white bedlinen in all the rooms.\nMore examplesFewer examplesI chose a recipe called Ultimate Chocolate Pudding and it was very easy to make.Chocolate bars have long been the most popular form of chocolate.a chocolate lambskin jacket\nSMART Vocabulary: related words and phrases\nSweets\nalmond paste\nbaking chocolate\nbarley sugar\nbitter chocolate\nbittersweet chocolate\nconfectioner\nconfectionery\ncooking chocolate\ncotton candy\ncouverture\nKendal mint cake\nlicorice\nliquorice\nlollipop\nlolly\nsemisweet chocolate\nsherbet\nsnow cone\nsourball\nspun sugar\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlavours - sweet\nLess common colours\nAdd to word list\nAdd to word list\na food made from cocoa and often sugar, usually brown and eaten as candy or used in other food such as cakes: [ U ] chocolate ice cream [ C ] a box of chocolates (= candies made of chocolate)"}