{"id":95598,"name":"choice","type":"noun","us_sound":"tʃɔɪs","us_link":"../audio/c/choice.mp3","uk_sound":"tʃɔɪs","uk_link":"../audio/c/ukchock005.mp3","content":"choice noun\n(ACT)\nAdd to word list\nAdd to word list\nB1 [ C or U ] an act or the possibility of choosing: If the product doesn't work, you are given the choice of a refund or a replacement. It's a difficult choice to make. It's your choice/The choice is yours (= only you can decide). It was a choice between pain now or pain later, so I chose pain later. Now you know all the facts, you can make an informed choice. I'd prefer not to work but I don't have much choice (= this is not possible). He had no choice but to accept (= he had to accept). Is she single by choice? Champagne is their drink of choice (= the one they most often drink).\nMore examplesFewer examplesThere was a choice of four prizes, and the winner could select one of them.If it's a choice between higher pay and job security, I'd prefer to keep my job.People are beginning to question the prime minister's choice of advisers.Some women make a deliberate choice to rear a child alone.It's a straight choice - either you leave him or you stay.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nchoice noun\n(VARIETY)\nB1 [ S or U ] the range of different things from which you can choose: There wasn't much choice on the menu. The evening menu offers a wide choice of dishes. The dress is available in a choice of colours.\nMore examplesFewer examplesYou get more choice if you eat from the main menu.There was a choice of four prizes, and the winner could select one of them.UK There's so much good theatre and cinema in London, really one is spoilt for choice.The store doesn't have much choice when it comes to bed linen.There is a wide choice of insurance policies.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVariety and mixtures\nchoice noun\n(PERSON/THING)\nB1 [ C ] a person or thing that has been chosen or that can be chosen: Harvard was not his first choice. He wouldn't be my choice as a friend. This type of day care may in fact be the best choice for your child.\nMore examplesFewer examplesSo what would be your top choice for a holiday?Her can-do attitude is what made her our choice for the job.Wendy Clarke was our second choice for the job.I think she would be a suitable choice to be a trustee.He proved to be a very bad choice as husband.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nIdiom\nof choice\nof high quality: I had the the most expensive dish on the menu - a choice fillet of fish.\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njuicy\nkiller\nknock\nknock spots off something idiom\nlike a boss idiom\nlit\nout of sight idiom\nrule OK idiom\nsafe\nshabby\nshit hot\nsight\nsmashing\nsteal\nSee more results »\nchoice noun\n(ACT)\nAdd to word list\nAdd to word list\n[ C/U ] an act of choosing; a decision: [ C ] a difficult/easy choice [ C ] When you’re trying to cut the budget deficit, you’ve got to make tough choices.\nchoice noun\n(POSSIBILITY)\n[ C/U ] the right to choose, or the possibility of choosing: [ C ] Well, I still think people have a choice. [ C ] Given a choice, what would you do? [ C ] I asked if I could have a choice which science course to take. [ U ] We have no choice but to drive to the airport (= That is the only thing we can do).\nchoice noun\n(VARIETY)\n[ C ] a range of different things you can choose: [ C ] A wide choice of colors is available in this size.\nchoice noun\n(PERSON/THING)\n[ C ] a person or thing that has been chosen or that can be chosen: She would be my first choice for the job.\nchoice adjective [-er/-est only]\n(EXCELLENT)\nof high quality: a choice cut of meat\nAdd to word list\nAdd to word list\na range of different things that are available to choose from: a choice of sb/sth Finding the best bank account takes patience - there is a choice of more than 60.a choice between sth and sth When employees have a choice between taking a pay cut or working more, they'd rather work more.no choice but to do sth Many high-risk borrowers had no choice but to accept higher interest rates. They offer only a limited choice of products. a wide/extensive/greater choice\nof choice (for sb/sth)\nmost popular or most commonly chosen for a particular purpose: Freelancing has become the career of choice for many people.\nof your choice\nchosen by you: You may sell your shares through a broker of your choice.\nvery good in quality, and worth having: They bought a choice piece of real estate in the heart of the city."}