{"id":95954,"name":"choose","type":"verb","us_sound":"tʃuːz","us_link":"../audio/c/choose.mp3","uk_sound":"tʃuːz","uk_link":"../audio/c/ukchock018.mp3","content":"Add to word list\nAdd to word list\nA1 to decide what you want from two or more things or possibilities: She had to choose between the two men in her life. Danny, come here and choose your ice cream. He chose a shirt from the many in his wardrobe. [ + question word ] It's difficult choosing where to live. I've chosen a present for Luis. [ + two objects ] UK I've chosen Luis a present. Yesterday the selectors chose Dales as the team's new captain. [ + obj + to infinitive ] The firm's directors chose Emma to be the new production manager.\nThesaurus: synonyms, antonyms, and examples\nto choose or choose to do somethingchooseThere are thirty-one flavours of ice cream to choose from.pickHe's been picked for the school football team.selectWe've selected three candidates.opt (for)Mike's opted for early retirement.decide (on)I've decided on blue walls for the bathroom.go forUK I think I'll go for the chocolate cake.\nSee more results »\nchoose to do something\nB1 to decide to do something: Katie chose to stay away from work that day.\nSee more little/not much to choose between mainly UK\nWhen there is little to choose between two or more things, they are (all) very similar: Board members agreed that there was little to choose between the two manufacturers.\nSee more Synonyms\nelect\npick (CHOOSE)\nselect\nMore examplesFewer examplesWhy did you choose to live in London?You'll have to choose between a holiday or a new washing machine.We chose a delicate floral pattern for our bedroom curtains.Martha chose her favourite book of bedtime stories.I need you to help me choose an outfit.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nfaute de mieux\nfavoured\nfilterable\ngo for someone\ngo off with someone\npicker\nplump\nselect\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nPhrasal verb\nchoose up sb/sth\nAdd to word list\nAdd to word list\nto think about which one of several things is the one you want, and take the action to get it: [ T ] Parents can choose the schools that they want their kids to go to. [ I ] I can’t choose - I like both lamps. [ + to infinitive ] On this issue, Congress chose to fight the president. [ I ] There was not much to choose between them (= They are similar). [ + question word ] You can choose what you like and we’ll send it to you."}