{"id":95966,"name":"chop","type":"verb","us_sound":"tʃɑːp","us_link":"../audio/c/chop.mp3","uk_sound":"tʃɒp","uk_link":"../audio/c/ukchock020.mp3","content":"Add to word list\nAdd to word list\nB2 to cut something into pieces with an axe, knife, or other sharp instrument: He was chopping wood in the yard. Add some fresh parsley, finely chopped. Chop (up) the onions and carrots roughly.informal Laura had her hair chopped (= cut) yesterday.\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\nIf something is chopped in business, it is stopped or reduced: Because of lack of funding many long-term research projects are being chopped.\nMore examplesFewer examplesPeel the cucumber and chop it into small cubes.Peel, core and chop the apples.Roughly chop the tomatoes and add to the onions.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing something to end\nIdiom\nchop and changePhrasal verbs\nchop something down\nchop something off\nchop noun [C]\n(MEAT)\na small piece of meat with a bone still in it: a lamb/pork chop\nTan Dao Duy/Moment/Getty Images /GettyImages\nSMART Vocabulary: related words and phrases\nCuts of meat\nbaby back ribs\nbaron of beef\nbavette\nboneless\nbottom round\nfilet\nfillet\nfillet steak\nflank steak\nflanken\nrasher\nrib roast\nrib-eye steak\nriblet\nround steak\nT-bone steak\ntenderloin\ntomahawk\ntop round\ntournedos\nSee more results »\nchop noun [C]\n(CUT)\nan act of cutting something with an axe, knife, or other sharp instrument the chop\nmainly UK (US usually the axe) the situation in which your job is taken away from you, either because you have done something wrong or as a way of saving money: If you're late for work again, you'll be for the chop. Anyone stepping out of line is liable to get the chop. Hundreds of workers at the factory have already been given the chop.\nthe ending of a factory, school, etc. or plan: When the reorganization occurs, the smaller departments will be the first for the chop. Many of these special schools are facing the chop.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFiring staff\nEnds and endings\nchop noun [C]\n(MOUTH)\nchops\n[ plural ] informal the area of the face surrounding the mouth of a person or an animal: a dog licking its chops\nSee more\nchop noun [C]\n(ABILITY)\nchops [ plural ] mainly US informal\nability and technical skill, especially in playing a musical instrument or in acting: The players show their jazz chops and modern sensibility.\nthe ability, skill, or experience needed to do something well: She just doesn't have the chops for this demanding role.\nSee more\nchop verb [T]\n(CUT)\nAdd to word list\nAdd to word list\nto cut something into pieces with a sharp tool, such as an ax: Cal went out to chop some wood for the fireplace.\nTo chop something off is to separate it from what it was part of by cutting: Chop the ends off the carrots.\nIf you chop up something, you cut it into small pieces: She chopped up some celery for the salad.\nchop noun [C]\n(MEAT)\na small piece of meat with a bone still in it: a lamb/pork/veal chop"}