{"id":97023,"name":"churn","type":"verb","us_sound":"tʃɝːn","us_link":"../audio/c/churn.mp3","uk_sound":"tʃɜːn","uk_link":"../audio/c/ukchurc007.mp3","content":"churn verb\n(MOVE/MIX)\nAdd to word list\nAdd to word list\n[ T ] (also churn up) to move something, especially a liquid, with great force: The sea was churned up by heavy winds.\n[ T ] to mix milk until it becomes butter\n[ I ] If your stomach is churning, you feel ill, usually because you are nervous: I had my driving test that morning and my stomach was churning.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nsway\nthrash\ntremulously\nvibrate\nvibration\nvibratory\nwaggle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMixing and mixtures\nVomiting & feelings of sickness\nchurn verb\n(CUSTOMERS)\n[ I or T ]\n&#160; business\n&#160; specialized If customers churn between different companies that provide a particular service, they change repeatedly from one to another.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusiness - general words\nPhrasal verb\nchurn something out\nchurn noun\n(CONTAINER)\n[ C ] (also butter churn) a large container, often with a handle, that is used to make milk into butter by mixing it with great force : The butter was made in a wooden churn, which had a long handle with a flat, round paddle to beat the cream. People used to churn their own butter with a butter churn.\n[ C ] UK (also milk churn, milk can) a large container for transporting milk: I used to collect a few churns of milk from my brother's farm to make cheese. One of Houdini's most famous tricks was escaping from a padlocked milk churn.\ncynoclub/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDairy products & eggs\nalbumen\nbeurre noisette\nbrown butter\nbutter\nbutterfat\ncurd\ndairy\nDevonshire cream\ndouble cream\ndried milk\nlacteal\nlactic\nlight cream\nmilk fat\nmylk\nsour cream\nsoya milk\nsunny side up idiom\nUHT\nultra-pasteurized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContainers for liquids and gases\nchurn noun\n(CUSTOMERS)\n[ S or U ]\n&#160; business\n&#160; specialized (also churn rate) the number of customers who decide to stop using a service offered by one company and to use another company, usually because it offers a better service or price: Internet and cable television companies suffer from a high churn rate.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nAdd to word list\nAdd to word list\nto move violently: [ I ] The water was churning and the boat was rocking. [ M ] The fish churned up the water when we threw them some food. [ T ] fig. Seeing the car ahead flip over churned his stomach.\nTo churn butter means to beat cream until it turns into butter using a special container. Phrasal verb\nchurn out something\na container in which cream is made into butter\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING the situation in which customers stop buying the products or services of a particular company, especially to buy them from a competitor: Preventing customer churn is a major concern for mobile service providers, since 20-40% of customers leave their providers in a given year. Compare\ncustomer loyalty\nHR the situation in which employees leave their job and are replaced by new employees: Employee churn for new hires increased by 33% for the third straight year.\n[ I or T ]\n&#160; COMMERCE, MARKETING to stop buying the products or services of a particular company, especially in order to buy them from a competitor\n[ I or T ]\n&#160; HR to frequently replace employees with new employees\n[ T ]\n&#160; STOCK MARKET if stockbrokers churn investments or churn a client's account in order to make more money in commissions, they illegally buy and sell the client's investments more often than necessary: The commission found that he violated the antifraud provisions of the securities laws when he churned three customer accounts. Phrasal verb\nchurn sth out"}