{"id":96957,"name":"church","type":"noun","us_sound":"tʃɝːtʃ","us_link":"../audio/c/church.mp3","uk_sound":"tʃɜːtʃ","uk_link":"../audio/c/ukchron028.mp3","content":"church noun\n(BUILDING)\nAdd to word list\nAdd to word list\nA2 [ C ] a building for Christian religious activities: The town has four churches. a church spire/tower a church hall (= a building belonging to a church, with a large room for meetings)\nMore examplesFewer examplesThey built the church on the edge of the village.In many churches the side aisles are separated from the central aisle by a row of arches.The bride and groom posed for pictures outside the church.Do you know the way to St Peter's Church?I found her kneeling in prayer at the back of the church.\nSMART Vocabulary: related words and phrases\nReligious buildings & places\nabbey\nashram\ncaliphate\ncathedral\nchapel\nhermitage\nholy city\nhouse of God\nhouse of worship\nmadrasa\nmosque\nnunnery\npagoda\npantheon\nparsonage\ntabernacle\nthe Holy See\nUnited Church of Canada\nvicarage\nwat\nSee more results »\nchurch noun\n(ORGANIZATION)\n[ C or U ] an official Christian religious organization: All the local churches were represented at the memorial service. He went on a walking trip with some of his friends from church.\n[ U ] an occasion when this organization meets as a group of people: I'll see her after church. They go to church every Sunday. church services the Church [ S ]\nChristian religious organizations: Some people think the Church shouldn't interfere in politics.\nMore examplesFewer examplesIn Britain, the Queen is the head of the established church.The church has strongly condemned the violence.Instead of defending traditional values, the church frequently seems weak-kneed and irresolute.The church accused him of impiety and had all his writings burned.We joined the Methodist/Anglican/Roman Catholic Church in 1975.\nSMART Vocabulary: related words and phrases\nReligions & religious groups\nAbrahamic\nAfrican Methodist Episcopal Church\nAME\nanti-Catholicism\nanti-Christianity\nfaith-based\nFree Church\nGnosticism\nHinduism\nneo-paganism\nnon-established\npaganism\nPentecostalism\nPentecostalist\nSunni\nsuper-church\nTaoism\nTaoist\nthe God squad\ntotemism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: followers of religious groups\nIdiom\ngo into/enter the church\nchurch noun\n(BUILDING)\nAdd to word list\nAdd to word list\n[ C ] a building for Christian religious activities: We came to a church and went inside to sit and enjoy the quiet.\nchurch noun\n(ORGANIZATION)\n[ C/U ] a Christian religious organization: [ U ] He went on a trip with some of his friends from church.\n[ C/U ] Church is also a group of people meeting for a religious gathering: [ U ] I’ll see you after church.\n[ C/U ] A church is also one of the larger divisions within Christianity: [ C ] The Episcopal and Roman Catholic churches have many similarities.\n[ C/U ] Church can also mean organized religion generally: [ U ] The separation of church and state is an important feature of the US Constitution."}