{"id":97945,"name":"cinema","type":"noun","us_sound":"ˈsɪn.ə.mə","us_link":"../audio/c/cinema.mp3","uk_sound":"ˈsɪn.ə.mɑː","uk_link":"../audio/c/ukchurc025.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] mainly UK (US usually movie theater) a theatre where people pay to watch films: The town no longer has a cinema. a cinema ticket\nkevinjeon00/E+/GettyImages go to the cinema (US go to the movies)\nto go to watch a film: I just wanted to spend time with my friends, go to the cinema, do normal stuff.\nSee more\nC1 (US also movies, the movies) films and the business of making them : He was well known for his work in cinema. These young directors in the 1960s and 1970s revolutionized cinema. She is known as one of cinema's great action heroines.\nMore examplesFewer examplesThey sat in the back row of the cinema kissing and cuddling.Can you give me a lift back from the cinema tonight, Dad?I took her swimming to compensate for having missed out on the cinema.I could just about survive on that money if I never went to the cinema, ate out or did anything nice.We always have a carton of popcorn when we go to the cinema.Many people who love cinema have deplored the dominance of the superhero genre.He was a prominent figure in Russian cinema.\nSMART Vocabulary: related words and phrases\nPublic entertainment venues\namphitheatre\narthouse cinema\nauditorium\nbandstand\nbar\nbeer garden\nbowling alley\nfleshpot\nfree house\ngastropub\ngazebo\ngo to the cinema phrase\nnineteenth\npalace\nparty tent\npick-up joint\npicture\nplayhouse\npub\nsaloon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nAdd to word list\nAdd to word list\nmovies, or the art or business of making movies: [ U ] Her lectures on the cinema were very interesting.\nesp. CdnBr A cinema is also a movie theater: [ C ] We’d already been to the local cinema twice that week. cinematic adjective us\nYour browser doesn't support HTML5 audio\n/ˌsɪn·əˈmæt̬·ɪk/\nThe cinematic effects in this film are utterly remarkable."}