{"id":98279,"name":"circuit","type":"noun","us_sound":"ˈsɝː.kɪt","us_link":"../audio/c/circuit.mp3","uk_sound":"ˈsɜː.kɪt","uk_link":"../audio/c/ukcinna005.mp3","content":"circuit noun\n(VISITS)\nAdd to word list\nAdd to word list\nC2 [ C ] a regular pattern of visits or the places visited: They first met each other on the tennis circuit (= while at different tennis competitions). He was a familiar figure on the lecture circuit.\n[ C ]\n&#160; law\n&#160; specialized a particular area containing different courts that a judge visits: The judge had served for many years on the northeastern Circuit. a circuit judge\nMore examplesFewer examplesHe always takes part in the polo circuit.We see each other on the dinner party circuit.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nstomping ground\nstop\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: areas of land in general\ncircuit noun\n(TRACK)\nC2 [ C ] something shaped approximately like a circle, especially a route, path, or sports track that starts and ends in the same place: They test the car tyres on a motor racing circuit. We made a leisurely circuit of the city walls.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nhalf\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nrink\nsideline\nskatepark\nupright\nSee more results »\ncircuit noun\n(CLOSED SYSTEM)\nC2 [ C ] a closed system of wires or pipes through which electricity or liquid can flow: A defect was found in the water-cooling/electrical circuit.\nSMART Vocabulary: related words and phrases\nElectrical components & circuitry\nAGM battery\nanode\narmature\nbandpass filter\nbaseband chip\ncathode\ncathode ray\ncircuit breaker\ncoil\nconductor\nLED display\nmulticelled\nmulticonductor\nnumber pad\nphotoresist\nphotovoltaic cell\npotentiometer\nprinted circuit (board)\nrelay\ntransformer\nSee more results »\nto travel around something in a route shaped approximately like a circle: He was early so he circuited the block a couple of times. The aircraft appeared again, circuiting over the jungle.\nMore examplesFewer examplesSince 1992 astronomers have spotted more than 300 minor planets slowly circuiting the sun beyond Neptune.The trains follow the tortuous North London line, circuiting the capital via Kensington and Clapham Junction. People fill the streets to follow the colourful floats circuiting the neighbourhood. Hundreds of large lumps of rock and ice have been identified slowly circuiting in this region of space.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\ncircuit noun [C]\n(CLOSED SYSTEM)\nAdd to word list\nAdd to word list\nphysics a closed system esp. of wires through which electricity can flow: Big electronic circuits can carry huge amounts of data.\nA circuit is also a system that allows people to communicate with each other: Holiday phone calls always overload the circuits.\ncircuit noun [C]\n(CIRCLE)\nsomething shaped like a circle, esp. a route, path, or sports track that starts and ends in the same place: She has ridden on tough racing circuits such as the New York and Florida tracks.\nA circuit can be a path or route in the shape of a circle: Fish swam continuously, making the endless circuit of the tank.\ncircuit noun [C]\n(SERIES)\na regular series of events that happen in different places: She has won a number of tournaments on this year’s tennis circuit.\ncircuit noun [C]\n(LEGAL AREA)\nan area under the authority of a particular court circuitry noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈsɜr·kə·tri/\nthe connected arrangement of the wires and other parts of a closed system through which electricity can flow: The circuitry in this computer is protected from power surges.\nAdd to word list\nAdd to word list\nIT a path for an electric current to flow through: The most advanced chip technology, which uses circuits 65 nanometers apart, loses almost half of its power to leakage. an electrical/electronic circuit See also\nintegrated circuit\na series of events or places that are regularly visited by a particular group of people: a lecture/conference/speaking circuit For the past two years he has been on the international lecture circuit, often speaking on business ethics."}