{"id":98326,"name":"circulation","type":"noun","us_sound":"ˌsɝː.kjəˈleɪ.ʃən","us_link":"../audio/c/circulation.mp3","uk_sound":"ˌsɜː.kjəˈleɪ.ʃən","uk_link":"../audio/c/ukcinna013.mp3","content":"Add to word list\nAdd to word list\n[ U ] the process in which something such as information, money, or goods passes from one person to another: Police have warned that there are a lot of fake £50 notes in circulation. Add her name to the circulation list for this report (= the people who will be given it to read).figurative I hear she's out of circulation/back in circulation (= taking part/not taking part in social activities) after her accident.\nC2 [ C usually singular ] the number of people that a newspaper or magazine is regularly sold to: The paper has a circulation of 150,000.\nC2 [ U ] the movement of blood around the body: Exercise helps to improve circulation.\nMore examplesFewer examplesThe newspaper's circulation has dropped dramatically.I heard that there are several stolen paintings in circulation.Police are aware of the circulation of forged bank notes.\nSMART Vocabulary: related words and phrases\nThe circulatory system & blood\nABO\naccessory pathway\nantegrade\nanterograde\nanti-platelet\nblood donor\nblood vessel\ncapillary\nclot\nimmunoglobulin\nintravascular\nintravenously\njugular\njugular vein\nplatelet\nvasoactive\nvasoconstriction\nvasodilation\nVEGF\nveined\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNewspapers & magazines\nAdd to word list\nAdd to word list\nbiology the movement of blood inside the body\nCirculation is also the movement of air or water in a space or system: [ U ] The fans in the air circulation system make a lot of noise.\nA magazine or newspaper’s circulation is the number of people who read it: [ C ] The Chronicle has a daily circulation of 505,000.\nIf something is in circulation, it is available: [ U ] Are the new dollar coins in circulation yet?\nIf something is out of circulation, it is not available: [ U ] The company takes its movies out of circulation, then shows them again. [ U ] fig.infml She’s been out of circulation since her accident.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; ECONOMICS, MONEY the use of a particular type of money or payment system in the economy: withdraw from/take out of circulation Many European currencies were withdrawn from circulation after the euro was adopted.come into/go into/be put into circulation The new $100 bills will go into circulation early next year. Within just five years, the number of credit cards in circulation had tripled.\n[ usually singular ]\n&#160; COMMUNICATIONS the typical number of copies of a newspaper or magazine that are sold every day, week, or month: a circulation of sth It has a daily circulation of 400,000, making it the second-largest newspaper in the country.\n[ U ] the act of sending goods or information from one person to another or from one place to another: the circulation of sth Despite the circulation of the memo, the company's stock price in recent days has been soaring. See also\nvelocity of circulation"}