{"id":98264,"name":"circle","type":"noun","us_sound":"ˈsɝː.kəl","us_link":"../audio/c/circle.mp3","uk_sound":"ˈsɜː.kəl","uk_link":"../audio/c/ukcinna004.mp3","content":"circle noun\n(SHAPE)\nAdd to word list\nAdd to word list\nA2 [ C ] a continuous curved line, the points of which are always the same distance away from a fixed central point, or the area inside such a line: Coloured paper was cut into circles. We sat in a circle.\nIgor Zakowski/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe teacher asked us to form a circle and join hands.She drew a geometric design of overlapping circles.Aim at the yellow circle in the centre of the board.Draw a circle 30 centimetres in circumference.Start by tracing around the base of a mug or small plate with a pencil to get a circle.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncongruently\nconic\ncrescent\ncylindrically\novoid\npolyhedron\npolytope\nprism\npyramid\nquadrilateral\nrectangle\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nthree-dimensional\ntrapezoid\nSee more results »\ncircle noun\n(GROUP)\nB2 [ C ] a group of people with family, work, or social connections: The subject was never discussed outside the family circle. She's not one of my close circle of friends. We never meet these days - we move in different circles (= do not have the same group of friends).\nMore examplesFewer examplesThey're content to socialize with a very small circle of people.Dr Simpson was a member of the inner circle of government officials.She moves among a very small circle of people.I'm not keen on the circles he's mixing with.He has a wide circle of friends.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\ncircle noun\n(UPPER FLOOR)\nthe circle [ S ] UK\nan upper floor in a theatre or cinema where people sit to watch the performance: Shall I get seats in the circle or in the stalls? Compare\ngallery (RAISED AREA)\nstall noun (SEATS)\nfotografixx/E+/GettyImages\nSMART Vocabulary: related words and phrases\nTheatre auditorium & front-of-house\naisle\nauditorium\nbalcony\nbooking office\nbox\nbox office\ndress circle\nfront\nfront-of-house\nfull house\ngallery\nhouse\nhouse lights\nmezzanine\nmosh pit\nout front idiom\npit\nstall\nSee more results »\nIdioms\ngo/run round in circles\ngo/run around in circles\nC2 [ I or T ] to move in a circle, often around something: The plane circled for an hour before receiving permission to land. Security staff circled the grounds of the house with guard dogs every hour.\nB1 [ T ] to draw a circle around something: Circle the answer you think is correct. See also\nencircle\n[ T ] to arrange things in a circle: Local teenagers would circle their cars out in cotton fields, play the radio loud, and dance. When a pioneers' wagon train was attacked they circled their wagons to defend themselves.\nMore examplesFewer examplesVultures were circling overhead.During their time on the space station, the astronauts circled the globe 3,152 times.Some of the locations in the log book pages are circled.Moms and dads circle their chairs and share their fears, trying to come to some sort of agreement on what constitutes \"normal\" boy behavior.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\nreel\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\nswizzle\ntwirl\ntwirling\ntwirly\nunderspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnclosing, surrounding and immersing\nPlacing and positioning an object\nIdiom\ncircle the/your wagons\ncircle noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\ngeometry a continuous curved line which is always the same distance away from a fixed central point, or the area enclosed by such a line: Colored paper was cut into circles, squares, and triangles. A circle of chairs had been arranged in the center of the room.\ncircle noun [C]\n(GROUP)\na group of people who are connected by family, work, or society, or who share an interest: There’s a small circle of people who sell and exhibit their work at the same shows. The mayor’s inner circle met with him throughout the crisis to give advice. Idiom\ngo (around) in circles\ncircle verb [I/T]\n(SHAPE)\nfig. If you circle around a subject, you talk about things related to it, often to avoid talking about the subject itself: [ I ] He circled around the idea of paying authors more for their books."}