{"id":98537,"name":"circumstance","type":"noun","us_sound":"ˈsɝː.kəm.stæns","us_link":"../audio/c/circumstance.mp3","uk_sound":"ˈsɜː.kəm.stɑːns","uk_link":"../audio/c/ukcinna026.mp3","content":"Add to word list\nAdd to word list\nB2 [ C usually plural ] a fact or event that makes a situation the way it is: I think she coped very well under the circumstances. Obviously we can't deal with the problem until we know all the circumstances. She died in suspicious circumstances. We oppose capital punishment in/under any circumstances. Under no circumstances should you (= you should not) approach the man. The meeting has been cancelled due to circumstances beyond our control.\n[ U ] formal events that change your life, over which you have no control: They were victims of circumstance. We were obliged to go by force of circumstance. circumstances\nhow much money someone has: Grants are available depending on your circumstances.\nSee more\nMore examplesFewer examplesThe new circumstances compelled a change in policy.An unfortunate conjunction of circumstances led to his downfall.I'd planned a romantic evening together, but circumstances conspired against it - friends arrived unexpectedly and then Dave was called out to an emergency.The circumstances of her death have been hotly disputed.His tact was exemplary, especially considering the circumstances.\nSMART Vocabulary: related words and phrases\nSituations and circumstances\naffair\nbackdrop\nbackground\nbusyness\ncase\nclimate\ncomedy of errors\ncondition\nfarce\nfinancial affairs\nfooting\ngoing\nposition\npracticality\nscheme\nsituation\nsituational\nstake\nthe scheme of things idiom\nthing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChance and randomness\nAdd to word list\nAdd to word list\nan event or condition connected with what is happening or has happened: [ C ] The circumstances of the theft of the painting were not known. [ C ] The circumstances surrounding his disappearance are under investigation. [ C ] He said that under no circumstances was he returning to Phoenix. [ U ] Mrs. Smith's lawyers say she was victim of circumstance, not a murderer."}