{"id":98680,"name":"cis","type":"adjective","us_sound":"sɪs","us_link":"","uk_sound":"sɪs","uk_link":"../audio/c/cdo0319ukcis0293.mp3","content":"cis adjective\n(CHEMISTRY)\nAdd to word list\nAdd to word list\nchemistry\n&#160; specialized used to describe an isomer (= one of a group of similar chemical substances) in which the atoms are arranged on the same side of the molecule, especially on the same side of the carbon chain (= a line of connected carbon atoms): The traditional cold-pressing method of extracting vegetable oils preserves the cis fatty acids in their natural form. The polyacetylene chain can adopt two different shapes, called cis and trans, where the trans configuration is the most chemically stable.\nMore examplesFewer examplesSome of our samples show an increased ratio of the 16-and 18-carbon trans vaccenic acid to the cis isomer. Chemists initially make polyacetylene in the cis form, and convert this to the trans by heating it to 200°C in helium.Some of the double bonds that remain then change type, from cis to trans, and these have been found to be particularly damaging to our health (otherwise called \"hydrogenated fat\").\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nchemical formula\ndistilled water\nelectrolyte\nendothermic\nepitaxial\nepitaxially\nepitaxy\nexothermic\ninorganic chemistry\nionic bond\nnonreactive\npreatomic\nreactive\nreactivity\nreduction\nSee more results »\ncis adjective\n(GENDER)\nshort for\ncisgender : used to describe a person whose gender matches the body they were born with: They stress that trans women and cis women are all women. If you are cis you feel comfortable with your assigned birth sex and do not identify as another gender.\nMore examplesFewer examplesAs a cis man, it's hard for me to understand what trans people go through.He dressed flamboyantly, but he was still a cis male.People of all genders can develop breast cancer, though it is rare in cis men.Cis people do not necessarily conform to gender-stereotyped behaviours, appearances or roles.\nOpposite\ntrans\nused to form the names of chemical substances in which the atoms are arranged on the same side of the molecule, especially on the same side of the carbon chain (= line of connected carbon atoms): In 1969 researchers discovered that only the cis-DDP isomer killed tumours. Opposite\ntrans-See also\ncis\ncisgender\nMore examplesFewer examplesIn the absence of sufficient cis-omega 3 fatty acids in our diet, these fatty acid substitutions take place.Volatile compounds in cotton include cis-3-hexenyl acetate, indole, and isomeric hexenyl butyrates.The consistent presence of cis-1,2,-dichloroethene suggests vinyl chloride is a breakdown product of the degradation of more heavily chlorinated compounds.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nchemical formula\ndistilled water\nelectrolyte\nendothermic\nepitaxial\nepitaxially\nepitaxy\nexothermic\ninorganic chemistry\nionic bond\nnonreactive\npreatomic\nreactive\nreactivity\nreduction\nSee more results »"}