{"id":98965,"name":"citizen","type":"noun","us_sound":"ˈsɪt̬.ə.zən","us_link":"../audio/c/eus70819.mp3","uk_sound":"ˈsɪt.ɪ.zən","uk_link":"../audio/c/ukcirrh009.mp3","content":"Add to word list\nAdd to word list\nB2 a person who is a member of a particular country and who has rights because of being born there or because of being given rights, or a person who lives in a particular town or city: The interests of British citizens living abroad are protected by the British Embassy. He applied to become an American citizen. The citizens of Moscow woke up this morning to find they had a new government. Old people are just treated like second-class citizens (= unimportant people). He reassured people that law-abiding citizens (= people who do not break the law) would have nothing to fear from the enquiries.\nMore examplesFewer examples'Senior citizen' is a euphemism for 'old person'.He entered the United States in 1988 as a permanent resident because of his marriage to a U.S. citizen.She accused the government of trampling on the needs and rights of the ordinary citizen.She behaved as any upright citizen would have under the circumstances.She is regarded as an upstanding citizen in the local community.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncompatriot\ncross-border\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government a person who was born in a particular country and has certain rights or has been given certain rights because of having lived there: Nabokov was a Russian, then had British citizenship, and then became an American citizen. A large part of our job is to educate citizens about their rights. Old people have been treated like second-class citizens.\nA citizen is also a person who lives in a particular place: My sister is now a New Hampshire citizen.\nAdd to word list\nAdd to word list\na person who is a member of a state or country, and has legal rights there: a British citizen To work in the US you must be a legal citizen or have a valid work visa. Compare\nresident"}