{"id":98926,"name":"city","type":"noun","us_sound":"ˈsɪt̬.i","us_link":"../audio/c/city.mp3","uk_sound":"ˈsɪt.i","uk_link":"../audio/c/ukcirrh016.mp3","content":"city noun [C]\n(TOWN)\nAdd to word list\nAdd to word list\nA1 a large town: Many of the world's cities have populations of more than five million. Wellington is the capital city (= centre of government) of New Zealand.\nany town in the UK that has a cathedral (= large, important church): The city of Ely has about 15,000 inhabitants.\nmainly US (UK usually city council) the government of a city: It's the city's responsibility to maintain the pavements. My father works for the city.\nMore examplesFewer examplesThe traffic congestion in the city gets even worse during the summer.Their house is in a very desirable area of the city.For me, Venice is easily the most beautiful city in Europe.Many farm labourers moved to the towns and cities to look for work.Mexico City is one of the most densely populated cities in the world .\nSMART Vocabulary: related words and phrases\nTowns & regions: towns, cities & villages (general)\naerotropolis\nanti-city\nanti-urban\nbackwater\nCantabrigian\ncentral city\ncivic\nconurbation\ndormitory town\ngarden city\nmetro\nmunicipal\nnative place\nnon-municipal\nopen city\nretirement community\nretirement village\nsmall-town\nsmoke\nurbanite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: local government & politics\ncity noun [C]\n(FINANCIAL CENTRE)\nthe City [ S ] UK\nthe business centre of London where the large financial organizations are, such as the Bank of England: He works in the City. a City analyst\nthe financial organizations as a group and the people who work for them: The City acted swiftly to the news of a fall in the value of sterling.\nMore examplesFewer examplesHer husband works in the City.The City was stunned by news of the takeover.I think she is something in the City.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nGrammar\nGeographical placesWe use the before the names of rivers. We usually write the without a capital letter. If we use the word river, we usually write it without a capital letter: the river Thames, the river Severn, the Yangtze river. …\nAdd to word list\nAdd to word list\na place where many people live, with many houses, stores, businesses, etc., and which is bigger than a town: Canadians have built big, pleasant, and livable cities. When their team won the World Series, the whole city celebrated. Wellington is the capital city of New Zealand.\nAdd to word list\nAdd to word list\nthe business and financial centre of London, including Britain's main financial organizations such the Bank of England and the International Stock Exchange: It is one of the City's leading investment banks. The bank was founded over 300 years ago in the City of London.\nLondon's financial organizations and the people who work for them, considered together as a group: Two months ago the retail group surprised the City with record interim profits, up by 40% to £9.8m."}