{"id":99204,"name":"civil","type":"adjective","us_sound":"ˈsɪv.əl","us_link":"../audio/c/civil.mp3","uk_sound":"ˈsɪv.əl","uk_link":"../audio/c/ukcirrh021.mp3","content":"civil adjective\n(ORDINARY)\nAdd to word list\nAdd to word list\nC1 [ before noun ] not military or religious, or relating to the ordinary people of a country: Helicopters are mainly used for military rather than civil use. After ten years of military dictatorship, the country now has a civil government. We weren't married in church, but we had a civil ceremony in a registry office.\nMore examplesFewer examplesHe brought civil proceedings against the police for false imprisonment.20 years of civil strife have left the country's economy in ruins.He pursued his claim through the civil courts.They married in a civil ceremony.The equipment was all for civil use.\nSMART Vocabulary: related words and phrases\nOrdinary people\nbanausic\ncommonalty\ncommunity\ndemotic\nEssex girl\ngrassroots\nJoe Public\nJohn Doe\nJohn Q. Public\nman/woman of the people idiom\nmass market\nomnibus\npopular\npopularly\nprole\npublic\nrabble\nruck\nthe common man idiom\nthe man/woman in the street idiom\nSee more results »\ncivil adjective\n(LAW)\n[ before noun ]\n&#160; law\n&#160; specialized relating to private arguments between people or organizations rather than criminal matters: The matter would be better dealt with in the civil court rather than by an expensive criminal proceeding.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\ncivil adjective\n(POLITE)\npolite and formal: His manner was civil, though not particularly friendly.\nThesaurus: synonyms, antonyms, and examples\npolitepoliteHe was always such a polite child.courteousAlthough she often disagreed with me, she was always courteous.respectfulHe was respectful towards his elders.well manneredThey were quiet, well mannered children.chivalrousHe held open the door in that chivalrous way of his.\nSee more results »\nSMART Vocabulary: related words and phrases\nPolite and respectful\ncandy coat\ncandy-coated\nchivalric\nchivalrous\nchivalrously\ncourtliness\ncourtly\ncouth\ndeferential\ndeferentially\ngraciously\ngraciousness\nhyper-civilized\nkeep a civil tongue in your head idiom\nmanner\nrespectfully\nsugarcoat\nsuper-polite\ntactful\ntactfully\nSee more results »\nIdioms\nkeep a civil tongue in your head\nnot have a civil word to say about someone\ncivil adjective\n(ORDINARY)\nAdd to word list\nAdd to word list\nof or relating to the ordinary people of a country, rather than members of religious organizations or the military: These helicopters are for rescue and other civil use. We were married in a civil ceremony.\npolitics &amp; government Civil also refers to the legal system governing personal and business matters: civil court\ncivil adjective\n(POLITE)\npolite and formal: We were civil to each other, but we were both still angry.\nAdd to word list\nAdd to word list\nrelating to legal disagreements between people or businesses, rather than criminal activities: civil action/lawsuit/case, etc. The Chapter 11 action suspended a civil trial in which two plaintiffs sought compensation totaling more than $160 million. Compare\ncriminal law"}