{"id":99208,"name":"civilian","type":"noun","us_sound":"səˈvɪl.jən","us_link":"../audio/c/civilian.mp3","uk_sound":"sɪˈvɪl.jən","uk_link":"../audio/c/ukcirrh023.mp3","content":"Add to word list\nAdd to word list\nC2 a person who is not a member of the police or the armed forces: The bomb killed four soldiers and three civilians. Opposite\nserviceman\nMore examplesFewer examplesBombing civilians is a crime against humanity .The evacuation of civilians remains out of the question while the fighting continues.The first fatalities of the war were civilians.We will be flying 100 badly wounded civilians out of the battle zone tonight.How many civilians died in the Vietnam War?\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmilitary\nmufti\nparamilitary\npsych ops\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nC2 relating to a person who is not a member of the police or the armed forces: The army has been criticized for attacking the unarmed civilian population. We are aware of the reports of civilian casualties. Opposite\nmilitary\nMore examplesFewer examplesAll five men were wearing civilian clothes.It is the largest civilian aircraft ever made.The country insists that its nuclear research programme is purely civilian.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmilitary\nmufti\nparamilitary\npsych ops\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\ncivilian noun [C]\n(ORDINARY PERSON)\nAdd to word list\nAdd to word list\npolitics &amp; government a person who is not a member of the police, the armed forces, or a fire department: The senator is not the only civilian who would like to ride in a space shuttle.\ncivilian adjective [not gradable]\n(ORDINARY)\nof, relating to, or being a person who is not a member of the police, the armed forces, or a fire department: the civilian population civilian workers/employees"}