{"id":99229,"name":"civilization","type":"noun","us_sound":"ˌsɪv.əl.əˈzeɪ.ʃən","us_link":"../audio/c/civilization.mp3","uk_sound":"ˌsɪv.əl.aɪˈzeɪ.ʃən","uk_link":"../audio/c/ukcirrh026.mp3","content":"civilization noun\n(DEVELOPED SOCIETY)\nAdd to word list\nAdd to word list\nB2 [ C or U ] human society with its well developed social organizations, or the culture and way of life of a society or country at a particular period in time: Some people think that nuclear war would mean the end of civilization. Cuzco was the centre of one of the world's most famous civilizations, that of the Incas.\nC1 [ U ] mainly humorous a place that has comfortable living conditions: How does it feel to be back in civilization after all those weeks in a tent?\nMore examplesFewer examplesWe spent a week visiting the wonders of Ancient Greek civilization.I heard a radio programme recently all about the Aztec civilization in Central America.Historians still argue about what causes such a mighty civilization to collapse.I hated living in such an isolated place and longed to get back to civilization.Many different civilizations have left their mark on the country and its culture.\nSMART Vocabulary: related words and phrases\nSociety - general words\namenity\ncivilized\nconsumer society\nculturomics\ndigital divide\nhunter-gatherer\nnon-segregated\nnon-segregation\nnon-utility\npluralism\nsociality\nsocially\nsocietal\nsocietally\nsocio-\nsociologist\nsociology\nsuperstructure\nuncivilized\nutility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComfortable and uncomfortable\ncivilization noun\n(PROCESS)\n[ U ] the process of educating a society so that its culture becomes more developed: The civilization of Britain by the Romans took years to complete.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nAdd to word list\nAdd to word list\na highly developed culture, including its social organization, government, laws, and arts, or the culture of a social group or country at a particular time: [ U ] Widespread use of the Internet may change modern civilization. [ C ] The Inca civilization flourished for a long time."}