{"id":99366,"name":"claiming","type":"verb","us_sound":"kleɪm","us_link":"../audio/c/claim.mp3","uk_sound":"kleɪm","uk_link":"../audio/c/ukcivvy008.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nclaim\nclaim verb\n(SAY)\nB2 [ T ] to say that something is true or is a fact, although you cannot prove it and other people might not believe it: [ + (that) ] The company claims (that) it is not responsible for the pollution in the river. [ + to infinitive ] He claims to have met the president, but I don't believe him. All parties have claimed success in yesterday's elections. An unknown terrorist group has claimed responsibility for this morning's bomb attack.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the newspapers, records, etc.according toAccording to reports, the ceasefire is holding.as stated by/inAs stated by medical experts, these products are totally safe when used correctly. as maintained byThere is no reason to change your diet, as maintained by some lifestyle experts.as claimed bySo-called superfoods will not make you live longer, as claimed by some advertising.\nSee more results »\n[ T ] If an organization or group claims a particular number of members, that number of people are believed to belong to it.\nMore examplesFewer examplesSome people still claim that there is no firm evidence linking smoking with lung cancer.They claim to be the biggest company in the world, which is true if you include their subsidiaries.The study claims that British advertising stereotypes women.It is claimed that the officers tortured a man to death in 1983 in a city police station.Dean tricked the old lady into giving him eight hundred pounds, claiming that he would invest it for her.\nSMART Vocabulary: related words and phrases\nAssertions & asserting\naffirm\naffirmation\nairing\nassert\nassert your right\nassertion\nbeg\nemphatic\ngaslight\nhate speech\nlay something on the line idiom\nmaintain\nplead\npretend\nreaffirm\nrooftop\nself-affirmation\nsend\nsend a message idiom\nset yourself up as something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving and owning - general words\nclaim verb\n(DEMAND)\nB2 [ T ] to ask for something of value because you think it belongs to you or because you think you have a right to it: The police said that if no one claims the watch, you can keep it. When King Richard III died, Henry VII claimed the English throne.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nB2 [ I or T ] to make a written demand for money from a government or organization because you think you have a right to it: The number of people claiming unemployment benefits has risen sharply this month. Don't forget to claim (for) your travelling expenses after the interview.UK When my bike was stolen, I claimed on the insurance and got £150 back.UK If the shop won't give me a replacement TV, I'll claim my money back. claim damages\nto make an official request for money after an accident, from the person who caused your injuries\nMore examplesFewer examplesYou can claim back the overpaid tax by filling in this form.She is claiming damages from the company for wrongful dismissal.If you don't claim the money you are entitled to now, you might never get it.Can we claim on our insurance for any goods lost or damaged in transit?He was claiming unemployment benefit illegally, while he was actually working.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nask a lot\nbesiege\ncri de coeur\ncry\ndemand\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npay claim\npester\npleading\npush\nscrounge\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSocial security & state benefits\nInsurance\nIdioms\nclaim someone's life\nclaim the moral high ground"}