{"id":99358,"name":"claim","type":"verb","us_sound":"kleɪm","us_link":"../audio/c/claim.mp3","uk_sound":"kleɪm","uk_link":"../audio/c/ukcivvy008.mp3","content":"claim verb\n(SAY)\nAdd to word list\nAdd to word list\nB2 [ T ] to say that something is true or is a fact, although you cannot prove it and other people might not believe it: [ + (that) ] The company claims (that) it is not responsible for the pollution in the river. [ + to infinitive ] He claims to have met the president, but I don't believe him. All parties have claimed success in yesterday's elections. An unknown terrorist group has claimed responsibility for this morning's bomb attack.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the newspapers, records, etc.according toAccording to reports, the ceasefire is holding.as stated by/inAs stated by medical experts, these products are totally safe when used correctly. as maintained byThere is no reason to change your diet, as maintained by some lifestyle experts.as claimed bySo-called superfoods will not make you live longer, as claimed by some advertising.\nSee more results »\n[ T ] If an organization or group claims a particular number of members, that number of people are believed to belong to it.\nMore examplesFewer examplesSome people still claim that there is no firm evidence linking smoking with lung cancer.They claim to be the biggest company in the world, which is true if you include their subsidiaries.The study claims that British advertising stereotypes women.It is claimed that the officers tortured a man to death in 1983 in a city police station.Dean tricked the old lady into giving him eight hundred pounds, claiming that he would invest it for her.\nSMART Vocabulary: related words and phrases\nAssertions & asserting\naffirm\naffirmation\nairing\nassert\nassert your right\nassertion\nbeg\nemphatic\ngaslight\nhate speech\nlay something on the line idiom\nmaintain\nplead\npretend\nreaffirm\nrooftop\nself-affirmation\nsend\nsend a message idiom\nset yourself up as something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving and owning - general words\nclaim verb\n(DEMAND)\nB2 [ T ] to ask for something of value because you think it belongs to you or because you think you have a right to it: The police said that if no one claims the watch, you can keep it. When King Richard III died, Henry VII claimed the English throne.\nThesaurus: synonyms, antonyms, and examples\nto ask for somethingask forI asked the waiter for another glass.requestThe department has requested permission to spend money on new equipment.apply forWe applied for planning permission to build an extension.demandPeople are demanding the right to return to their homes.appeal forThe prime minister appealed for calm.call forA group of religious leaders are calling for an end to racism and injustice in the city.\nSee more results »\nB2 [ I or T ] to make a written demand for money from a government or organization because you think you have a right to it: The number of people claiming unemployment benefits has risen sharply this month. Don't forget to claim (for) your travelling expenses after the interview.UK When my bike was stolen, I claimed on the insurance and got £150 back.UK If the shop won't give me a replacement TV, I'll claim my money back. claim damages\nto make an official request for money after an accident or a bad event, from the person who caused you harm: She sued her employer for emotional stress, claiming damages of more than £20,000.\nSee more\nMore examplesFewer examplesYou can claim back the overpaid tax by filling in this form.She is claiming damages from the company for wrongful dismissal.If you don't claim the money you are entitled to now, you might never get it.Can we claim on our insurance for any goods lost or damaged in transit?He was claiming unemployment benefit illegally, while he was actually working.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSocial security & state benefits\nIdioms\nclaim someone's life\nclaim the moral high ground\nclaim noun [C]\n(STATEMENT)\nC1 a statement that something is true or is a fact, although other people might not believe it: He said the police assaulted him while he was in custody, a claim that the police deny. [ + that ] The government's claim that it would reduce taxes proved false. Can you give any evidence to support your claim? He made wild claims about being able to cure cancer.\nMore examplesFewer examplesI haven't seen one iota of evidence to support his claim.His claim to be an important and unjustly neglected painter is sheer self-deception - he's no good at all.There is a growing body of evidence to support their claim.Many experts remain sceptical about his claims.I suspect his claims are not all they seem - he tends to exaggerate.\nSMART Vocabulary: related words and phrases\nAssertions & asserting\naffirm\naffirmation\nairing\nassert\nassert your right\nassertion\nbeg\nemphatic\ngaslight\nhate speech\nlay something on the line idiom\nmaintain\nplead\npretend\nreaffirm\nrooftop\nself-affirmation\nsend\nsend a message idiom\nset yourself up as something\nSee more results »\nclaim noun [C]\n(DEMAND)\nB2 a written request asking an organization to pay you an amount of money that you believe they owe you: After her house was burgled, she made a claim on her insurance. Please submit your claim for travelling expenses to the accounts department.\na right to have something or get something from someone: She has no rightful claim to the title. Our neighbours have no claim to (= cannot say that they own) that strip of land between our houses. My ex-wife has no claims on me (= has no right to any of my money).\nMore examplesFewer examplesI enclose a cheque in settlement of your claim.He marked the spot on his map where he had seen the gold and returned later that month to stake his claim.The company produced receipts in substantiation of its claim.We had to send a doctor's report in support of our claim to the insurance company.She made a claim for compensation.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInsurance\nMorality and rules of behaviour\nIdioms\nsomeone's/something's claim to fame\nmake no claim to be something\nclaim verb [T]\n(SAY)\nAdd to word list\nAdd to word list\nto state that something is true or is a fact: [ + (that) clause ] Ervin claims (that) he is bankrupt.\nclaim verb [T]\n(REQUEST)\nto demand something of value because you believe it belongs to you or you have a right to it: If no one claims the money, I can keep it.\nIf a storm, crime, or other violence claims someone’s life, the person was killed suddenly as a result of that event: The earthquake claimed hundreds of lives. Idiom\nclaim to fame\nclaim noun [C]\n(REQUEST)\na written request to an organization to pay you a sum of money which you believe it owes you: After the storm, dozens of claims were filed to collect crop insurance.\nA claim is also a statement saying that you have a right to something: They asserted their claim to citizenship.\nAdd to word list\nAdd to word list\nINSURANCE a request to an insurance company for payment relating to an accident, illness, damage to property, etc.: pay/refuse/settle a claim An insurance adjuster will work with the injured party to settle the claim. file/make/submit a claim Do not submit a claim if the doctor or hospital is also filing a claim for the same service.\nLAW a request to a court, government department, or company for something such as money or property that you believe you have a legal right to: a claim for sth The Court of Appeal upheld his claim for damages for wrongful dismissal.bring/file a claim against sb/sth He is now bringing an unfair dismissal claim against the company. a disability/unemployment/pension claim\nLAW a legal right to own something such as a property, business, or title: have a claim on/to sth If you are joint owners, you have a claim on at least half the house. a legitimate/rightful/valid claim\na statement of something you believe is true, although you have no proof: The court rejected his claims that he was denied a promotion due to discrimination. See also\nbaggage claim\ncounter-claim\ndamage claim\nexaggerated claim\nexpenses claim\npay claim\npriority claim\nsmall claim\nstatement of claim\nto state that something is true, although you may not be able to prove it: Union representatives claim that workers were forced to work overtime without pay.\nINSURANCE to officially request that an insurance company pay for costs relating to an accident, damage to property, etc.\nto request payment for money you are owed by a government department or company: claim benefits/tax relief/income support The self employed may claim income tax relief as an allowance in their income tax assessment.\nLAW to state that you have a legal right to own something such as a property, business, or title: If there are no relatives to claim the estate, the deceased's property will be reverted to the state.\nclaim damages\nLAW to officially request payment from someone who is responsible for an injury, loss, etc.: A breach of warranty will give the purchaser the right to claim damages from the vendor."}