{"id":99422,"name":"clamber","type":"verb","us_sound":"ˈklæm.bɚ","us_link":"../audio/c/clamber.mp3","uk_sound":"ˈklæm.bər","uk_link":"../audio/c/ukcivvy014.mp3","content":"Add to word list\nAdd to word list\nto climb up, across, or into somewhere with difficulty, using the hands and the feet: They clambered over/up the rocks. I clambered into/onto the bus. She clambered into bed. Synonyms\nscramble\nshin\nshinny US\nThesaurus: synonyms, antonyms, and examples\nto move onto or towards the top of somethingclimbIt was an effort to climb the stairs.ascendShe ascended the podium and began to speak.scaleHe claims to have scaled every peak of the Himalayas.mountThe cowboy mounted his horse and rode off into the sunset.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclimb\ncome\ncome up\nheave\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nscramble\nshinny\nsoaring\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving on your hands and legs or on your stomach\na climb up, across, or into somewhere that is difficult, so that you have to use your hands to help you: I was worn out after my clamber up the hillside. Drop into old-fashioned tearooms for a cream tea, then work it off with a clamber over the rocks. Synonym\nscramble\nWestend61/GettyImages\nMore examplesFewer examplesThere is a small clamber up before the path takes a level route.Climbing to a nearby mine involved a rather risky clamber along a narrow ledge. A visit to administration necessitated a strenuous clamber up to an attic office on the fourth floor.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclimb\ncome\ncome up\nheave\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nscramble\nshinny\nsoaring\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving on your hands and legs or on your stomach\nAdd to word list\nAdd to word list\nto climb somewhere with difficulty, often needing to use both hands and feet: The baby clambered up the stairs."}