{"id":99687,"name":"classically","type":"adverb","us_sound":"ˈklæs.ɪ.kəl.i","us_link":"../audio/c/uscivil024.mp3","uk_sound":"ˈklæs.ɪ.kəl.i","uk_link":"../audio/c/ukclap_023.mp3","content":"classically adverb\n(TRADITIONALLY)\nAdd to word list\nAdd to word list\nin a way that is traditional in style or form, or based on methods developed over a long period of time: She is a classically trained dancer. The company relies on a classically American business model.\nin a way that is attractive because of having a simple, traditional style: The dress combines stylish lines with an attractive floral print for a classically feminine look. a classically beautiful face\nrelating to classical music (= music that is considered to be part of a long, formal tradition and to be of lasting value): Kate is a classically trained violinist. The performance put the spotlight firmly on the quartet's classically structured framework. See\nclassical\nMore examplesFewer examplesHe is a classically trained Shakespearean actor.a classically trained French chefa Hollywood idol with a classically handsome facea classically staged tale of an underdog's triumphhis well-read, classically educated wifeThe suit is made of merino wool, classically styled.They played a selection of somewhat classically oriented pieces.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionally\ncounter-tradition\ncrowd\ncustom\ndemi-monde\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of music\nclassically adverb\n(TYPICALLY)\nin a way that has all the characteristics or qualities that you expect: He had none of the symptoms classically associated with tuberculosis. We're doing what journalists classically do and that is look for problems that can be solved. See\nclassic\nMore examplesFewer examplesThe tree does not have the classically tall, distinctive look of the American elm.There is nothing more classically New York than a neighborhood being completely transformed, even against its will. This was a classically American mistake, showing no sense of history.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nfor instance idiom\nforerunner\nillustration\ninstance\njob\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »"}