{"id":99713,"name":"classified","type":"adjective","us_sound":"ˈklæs.ə.faɪd","us_link":"../audio/c/classified.mp3","uk_sound":"ˈklæs.ɪ.faɪd","uk_link":"../audio/c/ukclap_029.mp3","content":"Add to word list\nAdd to word list\nClassified information is officially stated to be secret: These documents contain classified material.\nThesaurus: synonyms, antonyms, and examples\nkept hidden from other peoplesecretThe spies had a secret meeting.covertThe government was accused of covert military operations.clandestineHe arranged a clandestine meeting between his client and the candidate.confidentialAll the information you give us will be treated as strictly confidential.classifiedThese documents contain classified information.\nSee more results »\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndissimulate\ndissimulation\ndown-low\nentre nous\nexecutive privilege\nprivately\nprivileged\npseudonym\npseudonymization\npseudonymize\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nAdd to word list\nAdd to word list\n(of information) officially secret: These documents contain classified material.\nAdd to word list\nAdd to word list\nclassified documents and information are officially kept secret and can only be seen by people who have high authority or special permission: Security employees discovered that classified information and passwords had been leaked onto the internet. classified evidence/material/records He was caught taking highly classified documents from the National Archives.\n[ before noun ] relating to the small advertisements in newspapers, magazines, or on websites that offer jobs or to sell or buy things: The help-wanted classified sections are overflowing with ads for managers.\nused to describe information that is arranged by type: Classified data will increase 50% a year as more economies begin using broadband technology. The classified catalogue tells you which publications on a particular subject are available in the library."}