{"id":99704,"name":"classify","type":"verb","us_sound":"ˈklæs.ə.faɪ","us_link":"../audio/c/classify.mp3","uk_sound":"ˈklæs.ɪ.faɪ","uk_link":"../audio/c/ukclap_030.mp3","content":"Add to word list\nAdd to word list\nC1 to divide things or people into groups according to their type, or to say which group or type something or someone belongs to: The books in the library are classified by/according to subject. Biologists classify animals and plants into different groups. children who are classified as overweight Compare\nclass verb\nto officially state that information is secret: The Ministry of Defence moved quickly to classify the documents. He has the authority to classify information as Top Secret.\nMore examplesFewer examplesThis is a hard book to classify. Fingerprints were first classified in 1823 by a Czech anatomist, Jan Evangelista Purkinje.Under the old rules, her employer could not classify her as a manager.Even though it's classified as a compact camera, it weighs a pound and a half.He recognises that the government classifies too much information.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmisclassification\nmisclassify\nmiscode\nmislabel\nmisorder\npigeonhole\nshake someone down\nshort-list\nshortlist\nsort\nsort something out\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nRelated word\nclassifiable\nAdd to word list\nAdd to word list\nto divide things into groups according to type: We classify our books by subject.\nbiology Classify also means to divide organisms into groups according to particular characteristics.\nAdd to word list\nAdd to word list\nto divide people or things into groups according to their characteristics: classify sb/sth as sth A screen-printing firm can have as many as 500 employees and still be classified as a small business.classify sb/sth by sth Imports are now classified by country of despatch, rather than country of origin.classify sb/sth into sth We've classified total expenditure into two major categories, (a) Current expenditure (b) Development expenditure."}