{"id":99664,"name":"clasp","type":"verb","us_sound":"klæsp","us_link":"../audio/c/clasp.mp3","uk_sound":"klɑːsp","uk_link":"../audio/c/ukclap_019.mp3","content":"Add to word list\nAdd to word list\nto hold someone or something firmly in your hands or arms: He was clasping the vase tightly, terrified of dropping it. Lie on your back, clasp your knees and pull them down towards your chest. She clasped her son in her arms.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclench\ncling\ncup\ndandle\nenfold\ngrasp\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nhold on idiom\nonto\npinion\nseize\ntaken\nSee more results »\n[ S ] a tight hold with your hand or arms: She held the child's hand in a firm clasp as they crossed the road.\n[ C ] a small metal device that is used to fasten a belt, bag, or a piece of jewellery\nblacklionder/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclench\ncling\ncup\ndandle\nenfold\ngrasp\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nhold on idiom\nonto\npinion\nseize\ntaken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPins, clips, hooks & pegs\nFasteners for clothes\nAdd to word list\nAdd to word list\nto hold someone or something firmly in your hands or arms: He clasped the vase, afraid he would drop it.\na firm hold on something with your arms or hands: She had a firm clasp on her daughter’s hand.\nA clasp is a small metal device used to fasten a belt, a bag, or a piece of jewelry."}