{"id":99671,"name":"class","type":"noun","us_sound":"klæs","us_link":"../audio/c/class.mp3","uk_sound":"klɑːs","uk_link":"../audio/c/ukclap_020.mp3","content":"class noun\n(TEACHING GROUP)\nAdd to word list\nAdd to word list\nA1 [ C, + sing/pl verb ] a group of students who are taught together at school, college, or university: Which class are you in this year? She gave the whole class extra homework for a week. My class (= the people in my class) was/were rather noisy this morning. [ as form of address ] Okay, class, settle down and open your books.\nA1 [ C, + sing/pl verb ] a period of time in which students are taught something: My last class ends at four o'clock. I was told off for talking in class. Who takes/teaches your environmental studies class? I missed my aerobics class yesterday. Classes have been cancelled today because of a staff meeting. the class of 2012, 2013, etc. mainly US\na group of students who successfully finished their studies in a particular year: The class of 2004 achieved the highest ever SAT scores in this district.\nSee more\nMore examplesFewer examplesSophie is way ahead of the other children in her class.She never paid attention in class and seemed to be in a permanent daydream.I think it's important to reduce class sizes in schools.We've started going to a keep-fit class at the sports centre.She's signed up for evening classes at the community college.\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nclass noun\n(ECONOMIC GROUP)\nB2 [ C or U ] a group of people within society who have the same economic and social position: The Labour Party has lost a lot of support among the working class. She belongs to the rich American upper class. We live in a middle class neighbourhood. She comes from an upper middle class background. He was a member of the ruling classes. She's studying the class structure of Japan. Compare\ncasteSee also\nunderclass\nMore examplesFewer examplesThe upper classes usually send their children to expensive private schools.There is a widening gulf between the middle classes and the poorest sections of society.The upper middle class tend to go into business or the professions, becoming, for example, lawyers, doctors, or accountants.The working class usually reacts in a predictable way to government policies.In those days people were expected to marry someone from their own social class.\nSMART Vocabulary: related words and phrases\nClass & class-consciousness in general\nanti-bourgeois\nanti-snob\narriviste\nbougie\ngentrify\ngo/come down in the world idiom\ngo/come up in the world idiom\nheap\npedigreed\npetit bourgeois\npetty bourgeois\npleb\nsocial climber\nsocial climbing\nsocial mobility\nthe bottom of the heap idiom\nthe gentry\nthe petite bourgeoisie\ntrailer trash\nunderclass\nSee more results »\nclass noun\n(RANK)\nA2 [ C ] a group into which goods, services, or people are put according to their standard: Whenever I travel by train, I always travel first class. first/second class mail a business/economy class ticket When it comes to mathematics, he's in a different class to his peers.\n[ C ] in the UK, the standard that someone has reached in their university degree: What class of degree did you get? He graduated with a second-class honours degree in physics. class A/B/C drug\nin UK law, a group of illegal drugs classified according to how dangerous they are thought to be and how severe the punishment is for using or selling them, with class A the most dangerous : He was charged with possession of a class A drug, namely heroin.\nSee more be in a class of your own\nto be the best at a particular activity: As a long-distance runner, she's in a class of her own.\nSee more be in a class by itself/of its own\nto be something of such a high quality that nothing can be compared to it: In New York, it is clear that Dominican hair salons are in a class of their own.\nSee more be out of your class\nto be much better at doing something than you: I can't play chess with him. He's completely out of my class!\nSee more\nMore examplesFewer examplesThey always fly economy class.Because of the delay, we were offered seats in first class.I'd like you to send this for me first class, please.Most of the girls were good at drawing, but Jenny was in a class of her own.When it comes to cooking, Jane's in a different class to the rest of us.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nclass noun\n(STYLE)\n[ U ] the quality of being stylish or fashionable: She's got real class.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfoppishly\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\npeacock\nshabby chic\nsleekly\nsleekness\nsmartly\nthe avant-garde\nultra-modern\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nà la mode\nSee more results »\nclass noun\n(BIOLOGY)\n[ C ]\n&#160; biology\n&#160; specialized a group of related plants or animals, in the general classification of plants and animals\nSMART Vocabulary: related words and phrases\nSpecies & genders\nclade\ncliff edge\nfemale\nfemaleness\ngenera\ngenus\nhe\nholotype\nintergeneric\nmale\nmulti-species\norder\nparamecium\nphylum\nsame-gender\nshe\nspeciesism\nstrain\nsuborder\nsubspecies\nSee more results »\nC1 to consider someone or something to belong to a particular group because of their qualities: I'm 17, but I'm still classed as a child when I travel by bus. I would class her among/with the top ten American novelists. Synonym\nsort Compare\nclassify\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nvery good: a class actUK He's a class golfer.\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njim-dandy\njuicy\nknock\nknock spots off something idiom\nlike a boss idiom\nout of sight idiom\nplum\nroyally\nrule OK idiom\nsafe\nshabby\nshit hot\nsight\nsteal\nSee more results »\nclass noun\n(TEACHING GROUP)\nAdd to word list\nAdd to word list\n[ C ] a group of students who are taught together at school, or a short period in which a particular subject is taught: She got in trouble for talking in class.\n[ C ] The class of a particular year is the group of students who will complete their studies that year: The class of 2003 is very large.\nclass noun\n(ECONOMIC GROUP)\n[ C/U ] a group of people within a society who have the same economic and social position: [ U ] Most of us think of ourselves as middle class.\nclass noun\n(RANK)\n[ C ] the ranking of goods and services or people’s skills according to what they provide or how good they are: Whenever I fly, I go business class. She’s a first-class teacher.\nclass noun\n(STYLE)\n[ U ] the quality of being stylish or fashionable: She dresses with a lot of class.\nclass noun\n(BIOLOGY)\n[ C ]\n&#160; biology a group of plants or animals with similar biological structure classy adjective us\nYour browser doesn't support HTML5 audio\n/ˈklæs·i/\nHe drives a very classy car. Idiom\nin a class by your/itself\nclass verb [T]\n(RANK)\nto rank: I would class her with the best American violinists.\nAdd to word list\nAdd to word list\n[ C or U ] a group of people within society who have the same economic or social position: As rents increased, working class families left the city in search of more affordable neighborhoods. upper/middle/lower class\n[ C ]\n&#160; COMMERCE a standard based on price and quality: The planes will have reclining seats for customers in first class. She and her husband run a luxury-class holiday accommodation business.\n[ C ]\n&#160; COMMERCE a group into which goods and services are put based on their characteristics: Your shipment's freight class determines the carrier's shipping charges. a class of sth At issue is a class of mortgages that lenders call \"subprime\" because they do not qualify for the lowest or prime interest rate.\n[ C ] a series of lessons on a particular subject: a class in/on sth As part of a class in international relations, the conference aimed to teach students the art of negotiations.enrol in a class And so that fall, I enrolled in an agribusiness marketing class.take/go to/attend classes For the past two years he's been taking night classes while also working full-time as a nurse. hold/offer/teach a class See also\nbest in class\nbusiness class noun\neconomy class\nfirst class adjective\nsecond-class adjective"}