{"id":99785,"name":"clause","type":"noun","us_sound":"klɑːz","us_link":"../audio/c/eus70829.mp3","uk_sound":"klɔːz","uk_link":"../audio/c/ukclass006.mp3","content":"clause noun [C]\n(LEGAL DOCUMENT)\nAdd to word list\nAdd to word list\nlaw a particular part of a written legal document, for example a law passed by Parliament or a contract (= an agreement): They have added/deleted/amended a clause in the contract which says the company can make people redundant for economic reasons. Clause 4 of the constitution is thought to be the most important section.\nMore examplesFewer examplesThere was a penalty clause which said you had to pay half the cost if you cancelled your booking.The clause was added to the contract at Carlos's request .He pointed to the clause about payment.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\ndriving licence\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\nwarrant\nwrit\nSee more results »\nclause noun [C]\n(GRAMMAR)\nB2 language\n&#160; specialized a group of words, consisting of a subject and a finite form of a verb: In the sentence \"I can't cook very well but I make quite good pancakes\", both \"I can't cook very well\" and \"I make good pancakes\" are main/independent clauses (= they are of equal importance and could each exist as a separate sentence). In the sentence \"I'll get you some stamps if I go to town\", \"if I go to town\" is a subordinate/dependent clause (= it is not as important as the main part of the sentence and could not exist as a separate sentence).\nMore examplesFewer examplesIn the sentence 'The woman who I met was wearing a brown hat', 'who I met' is a relative clause.The sentence 'Although he's quiet, he's not shy' begins with a concessive clause.A sentence might consist of a main clause and a subordinate clause, linked by a conjunction.In English, a conditional clause usually begins with 'if'.Students learn how to identify different clauses within a complex sentence.In the sentence 'The woman who I met was wearing a brown hat', 'who I met' is a relative clause.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nepigram\nmotto\noperative\nphrase\nproverbial\nsentence\nslogan\nsubsentence\nto coin a phrase idiom\nTrumpism\nSee more results »\nGrammar\nClausesA clause is the basic unit of grammar. Typically a main clause is made up of a subject (s) (a noun phrase) and a verb phrase (v). Sometimes the verb phrase is followed by other elements, e.g objects (o), complements (c), adjuncts (ad). These other elements are sometimes essential to complete the meaning of the clause: …\nClauses: introductionA clause is the basic unit of grammar. Typically a main clause is made up of a subject (s) (a noun phrase) and a verb phrase (v). Sometimes the verb phrase is followed by other elements, e.g objects (o), complements (c), adjuncts (ad). These other elements are sometimes essential to complete the meaning of the clause: …\nMain (independent) clauses and subordinate (dependent) clausesMain (or independent) clauses can form sentences on their own. They aren’t dependent on other clauses. They are always finite (they must contain a verb which shows tense). …\nClauses: coordinatedWe can combine clauses of the same grammatical type to form sentences using coordinating conjunctions: …\nClauses: finite and non-finiteFinite clauses must contain a verb which shows tense. They can be main clauses or subordinate clauses: …\nFinite clausesFinite clauses must contain a verb which shows tense. They can be main clauses or subordinate clauses: …\nNon-finite clausesNon-finite clauses contain a verb which does not show tense. We usually use non-finite verbs only in subordinate clauses. We usually understand the time referred to from the context of the main clause. We often use a non-finite clause when the subject is the same as the subject in the main clause: …\nClauses and sentencesA clause is the basic unit of grammar. A clause must contain a verb. Typically a clause is made up of a subject, a verb phrase and, sometimes, a complement: …\nWhat is a clause?A clause is the basic unit of grammar. A clause must contain a verb. Typically a clause is made up of a subject, a verb phrase and, sometimes, a complement: …\nWhat is a sentence?A sentence is a unit of grammar. It must contain at least one main clause. It can contain more than one clause. In writing, a sentence typically begins with a capital letter and ends with a full stop: …\nClause typesThere are four basic types of main clause: declaratives (statements), interrogatives (questions), imperatives (orders/instructions) and exclamatives (used for exclamations). …\nDeclarative clausesDeclarative clauses most commonly function as statements. The usual word order is subject (s) + verb (v) + x. Declaratives can be affirmative or negative. They make statements about how things are and how they are not. …\nInterrogative clausesInterrogative clauses most commonly function as questions. The usual word order is (wh-word) + auxiliary/modal verb (aux/m) + subject + verb + x: …\nImperative clausesImperative clauses most commonly function as commands, instructions or orders. The usual word order is verb + x. We do not usually include the subject in an imperative clause. We use the base form of the verb: …\nExclamative clausesExclamative clauses usually have one of the following word orders: …\nCleft sentences (It was in June we got married.)We use cleft sentences, especially in speaking, to connect what is already understood to what is new to the listener. In a cleft sentence, a single message is divided (cleft) into two clauses. This allows us to focus on the new information. …\nIt-cleft sentencesIt-clauses are the most common type of cleft clause. The information that comes after it is emphasised for the listener. The clause which follows the it-clause is connected using that and it contains information that is already understood. We often omit that in informal situations when it is the object of the verb: …\nWh-cleft sentences (What I need is a holiday)Wh-cleft sentences are most often introduced by what, but we can also use why, where, how, etc. The information in the wh-clause is typically old or understood information, while the information in the following clause is new and in focus: …\nclause noun [C]\n(GRAMMAR)\nAdd to word list\nAdd to word list\ngrammar a group of words that includes a subject and a verb to form a simple sentence or only part of a sentence: \"If I go to town\" is a clause, but not a sentence.\nclause noun [C]\n(LEGAL STATEMENT)\nlaw a part of a written legal document: He had a clause in his movie contract that let him work in the theater.\nAdd to word list\nAdd to word list\na part of a written legal agreement that deals with a particular subject: See clause 8.2(b) of the standard sale agreement. Rules and location for resolving disputes are outlined under the contract's arbitration clause.add/remove/include a clause Some companies will insure you, but will add a clause excluding any flood claims. See also\nassignment clause\naverage clause\nbreak clause\nbreakdown clause\ncommerce clause\nconfidentiality clause\ncontinuation clause\nenabling clause\nescalator clause\nescape clause\ngagging clause\nget-out clause\ngrandfather clause\nobjects clause\npenalty clause\nsunset clause"}