{"id":99885,"name":"claw","type":"noun","us_sound":"klɑː","us_link":"../audio/c/claw.mp3","uk_sound":"klɔː","uk_link":"../audio/c/ukclass011.mp3","content":"Add to word list\nAdd to word list\none of the sharp curved nails at the end of each of the toes of some animals and birds: Our cat likes to sharpen her claws on the legs of the dining table.\nEmily Ross/EyeEm/GettyImages\none of the two pointed parts, used for holding things, at the end of the legs of some insects and sea creatures: Keep your fingers away from the crab's claws when you pick it up.\nSavushkin/E+/GettyImages\na human hand that is curved or twisted so that it looks like the claws of an animal, bird, or insect: Since her stroke, she has to keep her hand mobile, or the fingers tend to bend into a rigid claw.\nan object or tool for picking things up that looks something like the claws of an animal, bird, or insect: An iron claw lifts metal scraps from one pile to another. It was one of those old-fashioned arcade games where you pick up prizes with a mechanical claw. The machine's giant claw ripped the roof off the house like it was paper.\nSMART Vocabulary: related words and phrases\nThe legs & feet of non-human animals\nbipedal\nclawed\ncloven\nfoot\nforefoot\nhooves\nleg\nlimb\nmember\npad\npaw\nsemipalmated\nshank\ntalon\ntrotter\nweb\nweb-footed\nwebbed\nwebby\nzygodactyl\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMiscellaneous animal body parts\nThe hand\nTools in general\nIdiom\nget your claws into someone\nto use claws to tear something or someone: He was seriously injured when one of the lions clawed his back. When our cat is hungry, she starts clawing at my legs.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmigrate\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nIdiom\nclaw your way (somewhere)Phrasal verb\nclaw something back\nAdd to word list\nAdd to word list\none of the sharp, curved nails at the end of each of the toes of some animals and birds: Our cat likes to sharpen her claws on the legs of the dining table.\nA claw is also the curved, movable part at the end of the leg of some insects and sea animals, such as crabs and lobsters: Watch out – the lobster’s claws pinch.\nto cut esp. flesh with claws: [ T ] Nora’s cat attacked him and began clawing his back.\nSomeone who claws his or her way somewhere uses a lot of effort to achieve something: [ I ] The team trailed, 24–13, after one quarter but clawed to 26–18 by halftime.\nclaw your way (somewhere)\nAdd to word list\nAdd to word list\nto achieve something with great effort or difficulty: claw your way into/out of sth He clawed his way out of near bankruptcy. She was always an excellent student, and she has clawed her way up to being a highly successful bank executive. Phrasal verb\nclaw (sth) back"}