{"id":99940,"name":"clearance","type":"noun","us_sound":"ˈklɪr.əns","us_link":"../audio/c/clearance.mp3","uk_sound":"ˈklɪə.rəns","uk_link":"../audio/c/ukclass028.mp3","content":"clearance noun\n(REMOVE)\nAdd to word list\nAdd to word list\n[ S or U ] the process of removing waste or things you do not want from a place: slum clearanceUK They specialize in house clearances after a resident has died.\n[ S or U ] an occasion when people are forced to move away from the area where they live permanently: The great Highland clearances in Scotland did not reach their height until after 1800.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEvicting and forcing to leave\nclearance noun\n(CHEAP SALE)\n[ U ] an occasion when goods are offered for sale cheaply so that people will be encouraged to buy them and there will be space for new goods: We bought our new carpet at a clearance sale.US I buy Christmas decorations when they go on clearance in January\nclearance noun\n(NOT TOUCHING)\n[ C or U ] the distance or space that is needed for one thing to avoid touching another thing: It was difficult getting the piano through the doorway because we only had a clearance of a few centimetres. High vehicles should take an alternative route because of low clearance under the bridge.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nelbow room\nexpanse\nfootprint\nheadroom\nnon-spatial\nroom\nspace\nspacial\nspacing\nspacious\nspatialize\nspatially\nstanding room\nsubzone\nvoid\nway\nzone\nSee more results »\nclearance noun\n(OFFICIAL PERMISSION)\n[ U ] official permission for something or the state of having satisfied the official conditions of something: The plane will be taking off as soon as it gets clearance. To visit the prison, you'll need security clearance.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nclearance noun\n(CHEQUE)\n[ U ] the process of a cheque going from one bank to another through a central organization, so that money can be paid to the person it is owed to: Clearance (of a cheque) can take up to a week.\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclear\ndip\ndip into something\ndraw\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nwithdrawal\nSee more results »\nclearance noun\n(SPORT)\n[ C ] in football, an occasion when a player kicks the ball away from their goal: Robinson's long clearance was controlled by Mido who went on to score.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nclearance noun [U]\n(GETTING RID OF)\nAdd to word list\nAdd to word list\nIf goods are reduced for clearance, they are offered for sale at a lower than usual price so that people will buy them and there will be space for new goods: a clearance sale\nclearance noun [U]\n(GIVING PERMISSION)\nofficial permission for something: The pilot announced we had received clearance for take off.\nclearance noun [U]\n(NOT TOUCH)\nthe amount of space available for an object to pass through an opening without touching anything, or for two objects to pass each other without touching: The sign on the overpass says that its clearance is 12 feet, and our truck is 10 feet high, so we should have 2 feet of clearance when we go under it.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; BANKING the process by which cheques and other payments are exchanged between customers of different banks: Foreign-drawn cheques may incur additional bank charges for clearance and currency conversion.\n[ U ]\n&#160; COMMERCE official permission to come into or leave a place or country: Two more inspections by the Swiss customs clearance agency declared the cargo clean.customs/entry clearance His application was refused by the entry clearance officer.\n[ C or U ] official permission to do something or have particular information: security/regulatory clearance Nuclear plant workers and contractors must have a security clearance.get/be given/obtain clearance The flight was given clearance for takeoff at 5:55 pm.need/require clearance The deal will need clearance from state insurance departments where the companies do business.clearance for sth The chief executive said he hoped to receive regulatory clearance for the deal by next March.\n[ C or U ]\n&#160; COMMERCE →\nclearance sale\non clearance\navailable at a lower price than usual: All laptops and printers are now on clearance."}