{"id":99943,"name":"cleared","type":"adjective","us_sound":"klɪrd","us_link":"../audio/c/cdo0622usclea0382.mp3","uk_sound":"klɪəd","uk_link":"../audio/c/cdo0622ukclea0540.mp3","content":"cleared adjective\n(REMOVED)\nAdd to word list\nAdd to word list\n(of an area, path, etc.) having had objects, pieces of rubbish, etc. removed from it, especially when these were blocking something or causing a problem: No one will be allowed into the city centre until the area is completely cleared. The morning after the snowstorm, he drove slowly down a cleared path to the town.\n(of objects, rubbish, etc.) having been removed from a place: Rinse out all the pipes thoroughly with a hose once the blockage is cleared. We hope to have the wreckage completely cleared by Monday. There were large piles of cleared debris.\nMore examplesFewer examplesA fire break is a cleared area that halts a fire's progress. There's more cleared forest and more building development every year.There is a great feeling of satisfaction when we are able to hand a cleared minefield back to the people.\nSMART Vocabulary: related words and phrases\nEmpty\nbare\nbarrenly\nbarrenness\nblank\nclear\ndead\ndeserted\ndesolate\nempty\nflat\nforlorn\nhollow\nlow-traffic\nnothingness\nuncrowded\nunobstructed\nunoccupied\nuntenanted\nvacant\nvacuum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClean & tidy\nRemoving and extracting\ncleared adjective\n(INNOCENT)\nhaving been found not to be guilty of doing something wrong: He considers himself completely cleared of any wrongdoing after the investigation. The only thing that mattered to her was a cleared name.\nMore examplesFewer examplesA cleared suspect would have to apply to get a DNA sample removed from the police database.\nSMART Vocabulary: related words and phrases\nInnocent\naccuse\nacquit\nacquit someone of something\nacquittal\nbe above/beyond reproach idiom\nbe in the clear idiom\ncome up/out smelling of roses idiom\nculpability\nculpably\nexculpate\nexculpatory\nguiltlessly\ninculpable\ninnocence\ninnocency\ninnocent\nreproach\nsinless\nsinlessly\nsqueaky-clean\nSee more results »\ncleared adjective\n(APPROVED)\ngiven official approval or permission: Once vehicles have been inspected they are cleared to cross the bridge. Only applicants who are security cleared will be eligible to take up the post.\n(of a cheque or payment) able to be paid to the person who it is owed to, because a bank has approved it: If your bid is successful, you must pay 10% of the final price immediately using a cleared cheque or a banker's draft.\nMore examplesFewer examplesYou are not allowed to take any notes out of the courtroom without a cleared member of staff reviewing them first.He spoke on the condition of anonymity because he was not cleared to speak to reporters.You are not cleared to drive until six weeks after a total knee replacement.\nSMART Vocabulary: related words and phrases\nApproving & approval\naccepting\naffirmation\napprobate\napprobation\napproval\napproving\nbe here for someone idiom\nbody positive\ncountenance\nnice\nnice one! idiom\nrelegitimize\nroyal assent\nseal\nseal of approval idiom\nself-affirmation\nself-approbation\nthumb\nthumbs up idiom\nvote something up or down idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAllowing and permitting\nPayment methods\nOpposite\nuncleared"}