{"id":99937,"name":"clear","type":"adjective","us_sound":"klɪr","us_link":"../audio/c/clear.mp3","uk_sound":"klɪər","uk_link":"../audio/c/ukclass027.mp3","content":"clear adjective\n(ABLE TO BE UNDERSTOOD)\nAdd to word list\nAdd to word list\nA2 easy to understand, hear, read, or see: clear instructions/directions Can we make the sound any clearer? Our new television has a very clear picture.\nThesaurus: synonyms, antonyms, and examples\neasy to see, recognize, or understandobviousIt's obvious that she's upset.clearIt was clear that he was unhappy.apparentHer joy was apparent to everyone.plainHis disappointment was plain to see.evidentThe company president was impressed by her evident ambition.manifestHis manifest lack of interest has provoked severe criticism.\nSee more results »\ndo I make myself clear? (also is that clear?)\nsomething you say in order to emphasize what you have just said, or to express your authority: I will not tolerate this behaviour any longer. Do I make myself clear?\nSee more\nMore examplesFewer examplesIt's written in clear, comprehensible English.It became clear that he wasn't developing like all the other little boys.Her ideas were clear and logically presented.There was a clear family resemblance between all the brothers.The silhouette of the bare tree on the hill was clear against the winter sky.\nSMART Vocabulary: related words and phrases\nEasy to understand\n(as) clear as day idiom\nabundantly clear\naccessible\naccessibly\nassimilable\ndigestible\nexplicitly\nexplicitness\nexpressly\nfathomable\nhang\nin words of one syllable idiom\nlimpid\npellucidly\nperspicuity\nperspicuous\nperspicuously\npikestaff\ntaut\nwell defined\nSee more results »\nclear adjective\n(CERTAIN)\nB1 certain, having no doubt, or obvious: He isn't at all clear about what he wants to do with his life. [ + (that) ] It is rapidly becoming clear (to me) (that) I'm not suited to being a teacher. [ + question word ] It isn't clear how long the strike will go on for. It's a clear case of corruption. You've made your position quite clear (= there is no doubt about what you think).\nMore examplesFewer examplesIt's not clear who actually pulled the trigger.It isn't clear whether he fell off the balcony, or was pushed.In the second experiment they obtained a very clear result.It was made quite clear to me that if I stepped out of line again I'd be out of a job.It is not clear what caused the explosion, but the police do not suspect foul play.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwonder\nwritten all over someone's face idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCertainty\nclear adjective\n(NOT MARKED OR CLOUDY)\nB1 pure or easy to see through, with no marks or areas that are less transparent: clear glass The water in the lake is so clear that you can see the bottom. She has a beautifully clear skin/complexion (= with no marks or spots).\nThesaurus: synonyms, antonyms, and examples\neasy to see throughclearThe water in the bay was so clear I could see the bottom.transparentThe secondhand shop was selling a vintage serving tray made of transparent red plastic. see-throughMake sure that shirt isn't see-through when it gets wet.sheerThe model wore a sheer blouse under the jacket.\nSee more results »\nwithout clouds, mist, or fog in the sky, so that you can see for a long way: The weather is expected to remain clear for the next few days. You can see the mountains from here on a clear day. We could see hundreds of stars in the clear desert sky.\nused to describe a pleasant, pure sound: the clear sound of the flute\nused to describe something that you remember easily: I have clear memories of visiting my grandfather's farm as a child.\nMore examplesFewer examplesDrink lots of water for a clear complexion.On a clear day you can see the temple in the distance.It was a glorious winter day - crisp and clear.The stars twinkled in the clear sky.\nSMART Vocabulary: related words and phrases\nTransparent\ncrystal\ncrystal clear idiom\ncrystalline\ndensely\ndiaphanous\ndiaphanously\nfilminess\nhyaline\nimpenetrable\nlimpid\nliquid\nopacity\nopaquely\npellucid\nthin\ntranslucency\ntranslucent\ntranslucently\ntransparency\ntransparent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnspoilt\nDescribing good weather\nDescribing qualities of sound\nMemory and memories\nclear adjective\n(NOT BLOCKED)\nC1 not covered or blocked by anything: We have a clear view of the ocean from our hotel window. The journey was quite quick because the road was clear (= there was not much traffic on it). I always like to leave my desk clear (= with no work on it) at the end of the day.\nnot busy or filled by any planned activity: The only time I have clear next week is Tuesday afternoon. We've got two clear (= whole) weeks in which to finish the decorating.\nSMART Vocabulary: related words and phrases\nEmpty\nbare\nbarrenly\nbarrenness\nblank\ncleared\ndead\ndeserted\nemptiness\nempty\nflat\nforlorn\nhollow\nlifeless\nlow-traffic\nnothingness\nuninhabited\nunobstructed\nunoccupied\nuntenanted\nvacant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\nclear adjective\n(NOT GUILTY)\nwithout being or feeling guilty: to have a clear conscience\nMore examplesFewer examplesThe enquiry cleared him of any taint of suspicion/dishonesty.They hope the new evidence will be enough to clear them.The inquiry cleared him of all wrongdoing.Her family are still fighting to clear her name.\nSMART Vocabulary: related words and phrases\nInnocent\nacquit\nacquit someone of something\nacquittal\nbe above/beyond reproach idiom\nbe in the clear idiom\ncleared\ncome up/out smelling of roses idiom\nculpability\nculpably\nexculpate\nguiltless\nguiltlessly\ninculpable\ninnocence\ninnocency\nreproach\nresponsible\nsinless\nsinlessly\nsqueaky-clean\nSee more results »\nclear adjective\n(NOT CONFUSED)\nfree from confusion; able to think quickly and well: Marie is good at making decisions because she's a very clear thinker.\nSMART Vocabulary: related words and phrases\nLogic and reason\na fortiori\na posteriori\na priori\nanalytic\nantinomy\nhypothetical\nhypothetico-deductive\nillogical\nillogicality\nillogically\nnon sequitur\nnon-empty\nnon-logical\nnon-rational\nnon-theoretical\ntautological\ntautologically\nteleological\nteleology\ntheoretical\nSee more results »\nclear adjective\n(WITHOUT PROBLEMS)\n[ after verb ] without problems or difficulties: This is the first time in his life that he's been clear of (= without) debt.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe\nsafe space\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunbruised\nunthreatening\nuntouchable\nwell kept\nSee more results »\nclear adjective\n(LEFT)\nused to describe an amount of money that is left after all necessary payments have been made: The school summer fair made a clear profit of £1,500. Bill earns a clear $400 a week/earns $400 a week clear.\nSMART Vocabulary: related words and phrases\nAccounting\naccountancy\naccountant\naccounting\naccounts\nauditor\nbad debt\nbalance\nbalance sheet\nbudget\ncreative accounting\ndouble entry bookkeeping\nexpense account\nfalse accounting\nforensic accountant\nforensic accounting\nloss\ntreasurer\nunaudited\nunreconciled\nwrite something down\nSee more results »\nclear adjective\n(NOT TOUCHING)\nnot touching something, or away from something: Only one competitor made a clear jump of the highest fence (= jumped over it without touching it). When we're clear of the main road, we'll stop for our picnic.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nunattached\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nIdioms\n(as) clear as a bell\n(as) clear as day\n(as) clear as mud\nclear verb\n(REMOVE BLOCK)\nB1 [ I or T ] to remove or get rid of whatever is blocking or filling something, or to stop being blocked or full: It took several hours to clear the road after the accident. I'll make the coffee if you'll clear the table. If you use this nasal spray, your nose should clear. After my aunt died, we arranged for her house to be cleared (= for the furniture to be removed from it). If you press this key, the computer screen will clear (= the text and pictures will be removed from it). Shops are currently holding sales to clear their summer stock (= get rid of goods by selling them cheaply). Paul helped his elderly neighbour by clearing her path of snow/clearing snow from her path. Could you clear your things off/from the sofa? I never leave work until I've cleared my in-tray (= have finished the work that needs to be done). clear your throat\nto give a small cough: She cleared her throat nervously before she began to speak.\nSee more\nMore examplesFewer examplesThe police fired into the air to clear the demonstrators from the streets.I've just got to clear all this gubbins off my desk before I start working.Menthol can help to clear your nose when you have a cold.Use your noddle - clear the shelves before you paint the cupboard!It will be several days before snowploughs clear a path to the village.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmptying\nclear verb\n(PROVE INNOCENCE)\n[ T ] to prove that someone is not guilty of something that they were accused of: After many years in prison, the men were finally cleared of the bombings.\nSMART Vocabulary: related words and phrases\nNot punishing & reducing punishment\nabsolve\namnesty\ncommutation\ndiplomatic immunity\ndischarge\ndiversion\nget away with murder idiom\nget off\nget off lightly phrase\nhook\nimpunity\nlet someone off\nlightly\nprivilege\nreprieve\nroyal pardon\nscot-free\nspare\nunpunished\nunsanctioned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInnocent\nclear verb\n(GIVE PERMISSION)\n[ T ] to give official permission for something: Despite local opposition, the plans for the new supermarket have been cleared by the council. Ladies and gentlemen, air-traffic control has now cleared the plane for take-off. I don't know if I can get the car tonight - I'll have to clear it with Mum.\n[ T ] to satisfy the official conditions of something: Before you can enter the country, you have to clear customs.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nclear verb\n(MAKE PURE)\n[ I or T ] to become or make something pure or easy to see through: The children enjoyed stirring the mud at the bottom of the pond, then watching the water slowly clear again. Your skin would clear (= become free of spots) if you had a healthier diet. After the thunderstorm, the sky cleared (= stopped being cloudy). The fog is expected to have cleared (away) (= gone) by midday.\nSMART Vocabulary: related words and phrases\nTransparent\ncrystal\ncrystal clear idiom\ncrystalline\ndensely\ndiaphanous\ndiaphanously\nfilminess\nhyaline\nimpenetrable\nlimpid\nliquid\nopacity\nopaquely\npellucid\nthin\ntranslucency\ntranslucent\ntranslucently\ntransparency\ntransparent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnspoilt\nclear verb\n(NOT CONFUSED)\n[ T ] to make your mind free from confusion so that you can think quickly and well: I need to get some fresh air to clear my head (= to make me able to think well).\nSMART Vocabulary: related words and phrases\nEmptying\ndrain\nempty\nevacuate\nevacuation\ngut\nhollow\nhollow something out\nland\nlet\nlet someone/something out\nturn\nturn out\nunbox\nunload\nunpack\nvacate\nclear verb\n(GET RID OF)\nclear your debts/clear yourself of debts\nto pay back all the money that you owe: They planned to work for a year, clear their debts, then start a new business.\nSee more\nclear verb\n(HAVE LEFT)\n[ T ] to have an amount of money left from your earnings after any necessary payments, charges, taxes, etc.: Bill clears $200 a week.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nclear verb\n(CHEQUE)\n[ I or T ] to (cause a cheque to) go from one bank to another through a central organization, so that money can be paid to the person it is owed to: It usually takes four to five working days for a cheque to clear.\nSMART Vocabulary: related words and phrases\nWithdrawing money\natm\nautomated teller machine\nautomatic teller machine\ncash machine\ncashback\ncashpoint\nclearance\ndip\ndip into something\ndraw\ndraw something down\ndrawdown\ndrawn\nhole in the wall\nlay\noverdraw\noverdrawn\ntake something out\nwithdraw\nwithdrawal\nSee more results »\nclear verb\n(NOT TOUCH)\n[ T ] to jump or go over something without touching it: The horse cleared the fence with inches to spare.\nThesaurus: synonyms, antonyms, and examples\nto jumpjumpThe kids jumped up and down when they heard we were going to Disneyland.leapThe deer leaped out of the forest.boundHe bounded on stage, punching the air with both fists.launch yourselfShe rocked back and forth on her skis before launching herself down the slope.bounceThe kids were bouncing happily on the trampoline.hopI stubbed my toe and hopped to the kitchen to get some ice.\nSee more results »\nSMART Vocabulary: related words and phrases\nJumping\na hop, skip, and a jump idiom\nbound\ncaper\nfrisk\nhop\nhurdle\njump\nlaunch\nleap\noutjump\noutleap\npile\npile on/onto (someone)\npounce\nskip\nvault\nIdioms\nclear the air\nclear the decks\nclear the wayPhrasal verbs\nclear something away\nclear someone off something\nclear off\nclear out\nclear something out\nclear (something) up\nclear something up\nclear up\nnot touching, or away from: Stand clear of the doors, please. Make sure you park clear of the kerb. The children were saved from the fire only because a neighbour pulled them clear. steer/stay/keep clear\nC2 to avoid something or someone: His parents warned him to steer clear of trouble.\nSee more\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nunattached\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nclear adjective [-er/-est only]\n(UNDERSTANDABLE)\nAdd to word list\nAdd to word list\neasy to understand, or easy to see or hear: I left clear instructions that no one was to come in my office. He spoke in a clear voice. It wasn’t clear what he meant.\nclear adjective [-er/-est only]\n(CERTAIN)\ncertain or obvious; not in any doubt: [ + that clause ] It’s clear now that it was a mistake to have raised prices last spring. [ + question word ] It isn’t clear how long the strike will continue.\nclear adjective [-er/-est only]\n(NOT CONFUSED)\nfree from confusion; able to think quickly and well: Mary is good at making decisions because she’s a very clear thinker.\nclear adjective [-er/-est only]\n(SEEING THROUGH)\neasy to see through; not cloudy or foggy: clear water a clear day fig. I have clear memories of (= I can remember well) visiting my grandfather’s farm when I was a child.\nIf a person’s skin is clear, it has no marks or spots on it: a clear complexion\nclear adjective [-er/-est only]\n(BE NOT GUILTY)\nfree from guilt: My conscience is clear – I did what I could to help her.\nclear adjective [-er/-est only]\n(GET RID OF)\nnot blocked or filled; open or available: We have a clear view of the ocean from our hotel window. The only time the doctor has clear today is 3:30 – can you make it then? Idioms\n(as) clear as mud\nclear the air\nclear the way (for someone/something)\nclear your throat\nin the clear\nclear verb\n(MAKE NOT GUILTY)\n[ T ] to show someone to be not guilty: He was cleared of all charges, and the judge said he was free to go.\nclear verb\n(GET RID OF)\n[ T ] to remove or get rid of something or remove something blocking the way, or to move people away from a place: It took several hours to clear the road after the accident. Please clear the aisle and take your seats. [ M ] Just let me clear the dishes off the table and put them in the sink.\nclear verb\n(NOT TOUCH)\n[ I/T ] to pass near something without touching it: [ I ] With the high-jump bar at 6 feet 2 inches, she cleared easily.\nclear verb\n(GIVE PERMISSION)\n[ T ] to give official permission for something, or to satisfy the official conditions of something: Our plane has been cleared for takeoff, so will the flight attendants please be seated. I’m still waiting for my paycheck to clear (= be officially approved and processed) so I can pay my bills. Phrasal verbs\nclear out\nclear up\nclear up something\nAdd to word list\nAdd to word list\n[ T ]\n&#160; FINANCE if you clear a debt, you pay back all of the money that you owe: Customers should consider clearing their overdrafts and credit card debt before applying for a home loan. By cutting costs and scaling back production, the company managed to clear its debts in under two years.\n[ T ]\n&#160; FINANCE\n&#160; informal to have a particular sum of money left from the amount you have earned after taxes, etc. have been taken out: A city police officer clears about $1,300 every other week.\n[ T ]\n&#160; ACCOUNTING to have a particular amount of money as profit: After operating expenses, the resort group cleared $546 million.\n[ I or T ]\n&#160; BANKING if a cheque or payment clears, or if a bank clears it, money is available because it has been successfully paid from one bank to another: You will not be able to withdraw funds until the bank has cleared your cheque. International wire transfers may take several business days to clear.\n[ T ]\n&#160; FINANCE to arrange for shares and money to be exchanged at the end of a day of trading on a financial market\n[ T ] to give or get official permission for something: clear sth with sb Make sure you clear the budget with you boss first.be cleared for sth Passenger flights outbound from the airport are often cleared for take off only 60 seconds apart.be cleared by sb/sth Employees were cleared by security before they were allowed into the building. clear a proposal/deal/plan\n[ T ]\n&#160; LAW to prove that someone is not guilty of something: clear sb of sth An independent review has cleared the company of all charges of fraud. Accused of professional misconduct, he was eventually able to clear his name.\n[ T ]\n&#160; COMMERCE to sell products at a cheap price in order to get rid of them: Bob's Auto Dealers is having a huge sale to clear its inventory of last year's trucks.\nclear customs (also clear through customs)\nCOMMERCE to be checked by an official and allowed into a country: A driver will be waiting to pick you up after you clear customs and immigration. Once shipments clear through customs they are moved to distributors or warehouses.\nclear your desk\nto take all your possessions away from your desk or office because you have been told to leave your job: He was given just two hours to clear his desk and get out.\nto finish all your work: He likes to clear his desk by the end of the day.\nclear your schedule/diary/calendar\nto change all of your plans so you have time to do something else: The President cleared his calendar for the afternoon conference . Phrasal verb\nclear sth out"}