{"id":99906,"name":"clean","type":"adjective","us_sound":"kliːn","us_link":"../audio/c/clean.mp3","uk_sound":"kliːn","uk_link":"../audio/c/ukclass014.mp3","content":"clean adjective\n(NOT DIRTY)\nAdd to word list\nAdd to word list\nA1 free from any dirty marks, pollution, bacteria, etc.: a clean white shirt clean air/water Make sure your hands are clean before you have your dinner. Hospitals need to be kept spotlessly (= extremely) clean.\nThesaurus: synonyms, antonyms, and examples\nfree from dirtcleanAre these clothes clean?immaculateThe whole house was immaculate.spotlessHe was wearing a spotless white shirt.spick and spanTheir house is always spick and span.pureI love the pure mountain air.\nSee more results »\nMore examplesFewer examplesThis glass has been used - please fetch me a clean one.I looked in the drawer for a clean pair of socks.The kitchen is spotlessly clean.We want clean rivers and lakes, where you can swim without risk to your health.The town council is responsible for keeping the streets clean.\nSMART Vocabulary: related words and phrases\nClean & tidy\n(as) clean as a (new) pin idiom\napple pie\naseptic\nbe in apple-pie order idiom\ncleanliness\nclipped\nneatness\nnon-clogging\nnon-polluting\nordered\norderliness\norderly\nsprucely\nsqueaky-clean\nstainless\nsuper-clean\ntidily\nvirginal\nvirginally\nwell kept\nSee more results »\nclean adjective\n(HONEST)\nC2 honest or fair, or showing that you have not done anything illegal: a good clean fight/contest The judge took the defendant's clean record (= the absence of previous involvement in crime) into account when passing sentence. I've always had a clean driving licence. It was a clean tackle.\nslang not doing anything illegal, or not having or carrying illegal drugs or stolen goods: The police busted Pete last night, but he was clean.\nSMART Vocabulary: related words and phrases\nHonesty, openness & sincerity\nabove board\nanti-corruption\nartless\nartlessly\nartlessness\nearnest\nhonestly\nhonourably\nin\nin all honesty/seriousness/truthfulness idiom\nin good faith idiom\nintegrity\nsincerely\nsincerity\nspotless\nsqueaky-clean\nstainless\nthe straight and narrow idiom\ntransparency\nupright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObeying & breaking the law\nclean adjective\n(MORAL)\nmorally acceptable: It's all good, clean fun. clean living\nnot about sex: Can't you think of any clean jokes?\nSMART Vocabulary: related words and phrases\nVirtue and moral good\naltruism\nangel\nangelic\nangelically\nbe as pure as the driven snow idiom\njustifiable\njustifiably\njustified\nloftiness\nlofty\nrightfully\nrightly\nrightness\nsaintly\nthe road to hell is paved with good intentions idiom\nupliftment\nuprightly\nuprightness\nupstanding\nvirtuous\nSee more results »\nclean adjective\n(NOT TAKING DRUG)\nhaving stopped taking an illegal drug after taking it regularly: She is a former heroin addict who has been clean for about 13 years. It's incredibly hard for a junkie to stay clean.\nMore examplesFewer examplesAddicts have to have been clean and sober at least 72 hours before they can come to the centre.The treatment has fewer side effects and a better track record of keeping addicts clean. Even when people manage to get clean, only one-third are able to do so without a relapse.\nSMART Vocabulary: related words and phrases\nDrug addiction\nabuser\naddictiveness\nanti-crack\nbuzzed\nbuzzed up\ncold turkey\ncrackhead\ndependency\ndetox\ndruggie\nglue-sniffer\nglue-sniffing\nhabit\nhooked\nhophead\njunkie\npothead\nsmackhead\nsubstance abuser\nsubstance use disorder\nSee more results »\nclean adjective\n(NOT ROUGH)\nhaving no rough edges, and smooth, straight, or equally balanced: I've broken my leg, but the doctor says that it's a clean break, so it should heal easily. A good clean hit from Pietersen sent the ball straight out to the boundary. What he liked about the car was its clean lines. I tried to make a clean cut, but the knife wasn't sharp enough.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nclean adjective\n(COMPLETE)\n[ before noun ] complete: It's better for both of us if we make a clean break (of it) (= end our relationship completely). Sara says she needs a clean break with the past. The new prime minister is expected to make a clean sweep (= a complete change) of the government.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nclean adjective\n(NOTHING ON)\n[ before noun ] When something you write on is clean, there is nothing on it or it is not yet used: Take a clean sheet of paper.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\nink\ninnovative\ninnovatively\nlatest\nnewness\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\nthe avant-garde\nthe ink is not dry/still wet idiom\nunheard-of\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nIdioms\n(as) clean as a (new) pin\na clean bill of health\nkeep a clean sheet\ncome clean\nmake a clean breast of it\nA1 [ T ] to remove dirt from something: I'm going to clean the windows this morning. You should always clean your teeth after meals. Would you clean the fingermarks from/off the door? He asked her to help him clean out the stables.\nThesaurus: synonyms, antonyms, and examples\nto clean somethingcleanDid you clean the kitchen?washYou need to wash your hands before supper.clean upClean up this mess!clean outI spent the weekend cleaning out the kitchen cabinets.wipeShe wiped the mirrors until they shone.wipe downWe wipe down the tables after every customer leaves.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto make something cleancleanYou'll need to clean the wound before you bandage it.cleanseThe herb is supposed to cleanse the body of toxins.disinfectWe disinfected the doorknobs with antibac wipes.sanitizeTest tubes must be washed and sanitized before use.sterilizeThe lab equipment was thoroughly sterilized before use.purifyPlants cut down on pollution and help purify the air.\nSee more results »\n[ I usually + adv/prep ] to become clean: This carpet doesn't clean very well. I hope these bloodstains will clean off my shirt.\n[ T ] to prepare a fish or an animal killed for food by removing the inside parts of it that are not eaten\nMore examplesFewer examplesWhen I was studying for my exams I used to clean the house as a sort of displacement activity.I feel like a real drudge - I've done nothing but clean all day!You'll have to get down on all fours to clean behind the toilet.Did you clean the inside of the car?We had an arrangement that he would clean the house and I would cook.\nSMART Vocabulary: related words and phrases\nCleaning generally\nbrush someone/something off\ncleaner\ncleaning\ncleanse\ncleansing\nhoovering\nmop\npick\npick someone/something up\npurification\npurifier\nrinse\nscrub\nsluice something down/out\nspring-cleaning\nsqueegee\nsteam-clean\nsterilization\nsterilizing\nswab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing animals & fish for cooking\nIdiom\nclean up your actPhrasal verbs\nclean something out\nclean someone/something out\nclean (someone/something) up\nclean (something) up\nclean something up\nclean up after someone\nwhen something is cleaned: These windows need a really thorough clean.\nSMART Vocabulary: related words and phrases\nCleaning generally\nbrush someone/something off\ncleaner\ncleaning\ncleanse\ncleansing\nhoovering\nmop\npick\npick someone/something up\npurification\npurifier\nrinse\nscrub\nsluice something down/out\nspring-cleaning\nsqueegee\nsteam-clean\nsterilization\nsterilizing\nswab\nSee more results »\ncompletely: I clean forgot that I was supposed to be meeting Lucy last night. He's been cheating his customers for years, and getting clean away with it. The bullet went clean through his shoulder.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nclean adjective [-er/-est only]\n(NOT DIRTY)\nAdd to word list\nAdd to word list\nfree of dirt or other unwanted parts or pieces: Make sure you wear a clean shirt. Hospital rooms have to be kept clean.\nClean also means free from harmful substances, or pure: clean air/water\nclean adjective [-er/-est only]\n(HONEST)\nhonest or fair; not breaking rules or laws: \"Let’s make it a clean fight,\" said the referee. Before his conviction for fraud, he had a clean record (= he had not been involved in crime previously). slang They searched him, but he was clean (= he was not carrying anything illegal or not allowed).\nClean also means morally acceptable and not giving offense: clean living a clean joke\nclean adjective [-er/-est only]\n(COMPLETE)\ncomplete: It’s better for both of us if we make a clean break and stop seeing each other.\nclean adjective [-er/-est only]\n(NOT USED)\nnew and not used: a clean sheet of paper clean adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/klin/\ninfml The bullet went clean through his shoulder and out the other side. Idioms\na clean slate\nclean up your act\nclean verb [I/T]\n(MAKE NOT DIRTY)\nto remove dirt or unwanted parts or pieces from something: [ T ] Saturday morning is our time to clean the house. [ T ] You should clean a wound immediately to avoid infection. Phrasal verbs\nclean out something\nclean out someone\nclean up something\nclean up something\nAdd to word list\nAdd to word list\nhonest and fair, or showing that you have done nothing illegal or morally wrong: a clean record/report/license Job applicants must have a clean commercial driver's license. He said the campaign's priorities will be \"education and clean government.\"\nENVIRONMENT free of, or producing no harmful chemicals or substances: clean energy/fuel/technology clean energy from renewable sources such as solar and wind power clean air/water/soil\nhave clean hands informal\nto have never been involved in a dishonest or illegal activity: An audit proved that neither company had clean hands when it came to reporting profits.\nclean house informal\nWORKPLACE to take action to make an organization operate more honestly and effectively: Companies like to clean house between chief executives, so as to give the newcomer a positive base to work from.\nclean out your desk/office/locker informal\nWORKPLACE used to tell someone they are being removed from their job: He was told to clean out his desk by noon.\nclean up its/your act informal\nto start to obey laws or accepted standards of behaviour: There are still serious questions about whether the company has cleaned up its act since its $11 billion accounting fraud was exposed.\nPhrasal verbs\nclean sb/sth out\nclean sth out\nclean up\nclean sth up\ncome clean\nto admit the truth about a secret you have been trying to keep: come clean about/on/over sth Corporate managers were criticized for not coming clean sooner about the company's plans to split."}