{"id":99927,"name":"cleanse","type":"verb","us_sound":"klenz","us_link":"../audio/c/cleanse.mp3","uk_sound":"klenz","uk_link":"../audio/c/ukclass023.mp3","content":"Add to word list\nAdd to word list\nto make something completely clean: Cleanse the cut/wound thoroughly before you bandage it.\nThesaurus: synonyms, antonyms, and examples\nto make something cleancleanYou'll need to clean the wound before you bandage it.cleanseThe herb is supposed to cleanse the body of toxins.disinfectWe disinfected the doorknobs with antibac wipes.sanitizeTest tubes must be washed and sanitized before use.sterilizeThe lab equipment was thoroughly sterilized before use.purifyPlants cut down on pollution and help purify the air.\nSee more results »\nto make someone or something morally clean or pure: to cleanse the thoughts of our hearts Roman Catholics go to confession to be cleansed of their sins.figurative The mayor has promised to cleanse the city of drug dealers (= to remove them from the city).\nSMART Vocabulary: related words and phrases\nCleaning generally\nbrush someone/something off\ncleaner\ncleaning\ncleansing\ndecontamination\ngroom\nmop\npick\npick someone/something up\npurification\npurificatory\npurifier\nrinse\nscrub\nspring-cleaning\nsqueegee\nsteam-clean\nsterilization\nsterilizing\nswill\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious concepts: forgiveness in religion\na period when you stop taking unhealthy or harmful foods, drinks, or drugs into your body for a period of time, in order to improve your health: During a cleanse, it's best to stay away from all caffeine-rich drinks. That week I was on a cleanse.\nan act of cleaning your skin or a product or treatment for doing this: After a cleanse and exfoliation, a face mask is applied.\nsomething you to do make yourself morally clean or pure: Is there some sort of ritual or cleanse or pilgrimage that you like to go through?\nMore examplesFewer examplesThis is a great recipe if you're on a diet or doing a cleanse.I went on a cleanse and lost 6 lb.Try this gentle skin cleanse.It's like a cleanse for the soul.\nSMART Vocabulary: related words and phrases\nDiets & dieting\ncaloric\ncalorie-controlled\ncalorific\ncarb-free\nclean eating\nclimatarian\ndetox\ndiabetic\ndieter\nfatty\nfunctional food\nlacto-ovo vegetarian\nlacto-vegetarian\nlacto-vegetarianism\nlocavore\nlow-carb\nmacrobiotic\nvegetarianism\nweight loss\nwell balanced\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeauty treatments\nReligious concepts: forgiveness in religion\nAdd to word list\nAdd to word list\nto remove all the dirt or harmful substances from something: Thoroughly cleanse the wound and the area around it."}