{"id":100119,"name":"clerk","type":"noun","us_sound":"klɝːk","us_link":"../audio/c/clerk.mp3","uk_sound":"klɑːk","uk_link":"../audio/c/ukclear019.mp3","content":"Add to word list\nAdd to word list\na person who works in an office, dealing with records or performing general office duties: a filing clerk a junior office clerk\nUS (also salesclerk) a person who serves customers in a shop: Take your purchases to the clerk, and he will wrap them for you.\nThesaurus: synonyms, antonyms, and examples\na person who sells thingssellerWe'll need to talk to the seller and see if they'll accept your bid on the house.salespersonThe shop was so busy that it took me ages to get the salesperson's attention.salesmanHe was a used-car salesman.saleswomanShe was the company's top saleswoman.sales assistantUK Can you wave over a sales assistant? I have a question about this bracelet.\nSee more results »\nUS (also desk clerk) a hotel employee who deals with guests when they arrive: The clerk checked us in and gave us our key.\nUS (also law clerk) a person who works with a judge and helps the judge make decisions\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who serve other people\nPeople who sell things\nHotels & hostels\nJudges & juries\nto work as a clerk: Debbie has a summer job clerking in an office.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobbing\njobless\njoblessness\njobseeker\nlabour-intensive\nqualified\nrecertify\nredundancy\nredundant\nretcon\nWFH\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who serve other people\nAdd to word list\nAdd to word list\na person who works in an office, dealing with records or performing general office duties\nA clerk is also a person who deals with customers in a store or hotel: The sales clerk helped me find a sweater in my size.\nAdd to word list\nAdd to word list\na person who works in an office, dealing with records or performing general office duties: filing/wage/accounts clerk a junior office clerk\nUS (also desk clerk) a hotel employee who helps guests when they arrive and leave: The clerk checked us in and gave us our key.\nUS (also sales clerk) someone who sells things in a shop: Take your purchases to the clerk, and he will wrap them for you.\nSee also\narticled clerk\nbank clerk\nbooking clerk\ncorrespondence clerk\nfiling clerk\nWORKPLACE, HR to work as a clerk: Debbie has a summer job clerking in an office."}