{"id":100162,"name":"clever","type":"adjective","us_sound":"ˈklev.ɚ","us_link":"../audio/c/clever.mp3","uk_sound":"ˈklev.ər","uk_link":"../audio/c/ukclear020.mp3","content":"Add to word list\nAdd to word list\nA1 having or showing the ability to learn and understand things quickly and easily: Judy has never been very clever, but she tries hard.UK Fiona is very clever at physics. Charlie has a clever idea/plan for getting us out of our present difficulties.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nskilful: My mother is very clever with her hands.\nB1 well-designed: I've got a clever little gadget for opening jars.\ndisapproving showing intelligence, but not sincere, polite, or serious: That's enough clever talk, young lady.\nMore examplesFewer examplesDid you paint this yourself? You clever girl!He's always telling everybody how clever his children are.Edith may seem a bit crazy, but she's quite clever really.How clever of you to buy chocolate chip cookies - they're my favourites.The building relies on clever design rather than on ornament for its impressive effect.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nimaginatively\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\nIdioms\nbe too clever by half\nclever dick/clogs\nAdd to word list\nAdd to word list\nhaving or showing a quick intelligence in doing something or in persuading people to do something: It was certainly a clever ad and got a lot of attention. cleverly adverb us\nYour browser doesn't support HTML5 audio\n/ˈklev·ər·li/\nDid you notice how she cleverly avoided answering most of my questions?"}