{"id":100186,"name":"clicked","type":"verb","us_sound":"klɪk","us_link":"../audio/c/eus70832.mp3","uk_sound":"klɪk","uk_link":"../audio/c/ukclear025.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nclick\nclick verb\n(OPERATE COMPUTER)\nA2 [ I or T ] to carry out a computer operation by pressing a button on the mouse or keyboard: If you want to open a file, click twice on the icon for it. When you have selected the file you want, click the \"Open\" box.\nMore examplesFewer examplesYou draw the shape somewhere on your worksheet, click on it and copy it to the clipboard.Click 'File' in the menu bar, then click 'Exit'.Make sure the file you're copying to is open before you click 'Paste'.To open a new document, click 'File', then click 'New'.A website may have many different web pages for you to click on and explore.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nclick verb\n(MAKE SOUND)\nC2 [ I or T ] to make a short, sharp sound, or to make something do this: The door clicked shut behind her. Can you hear that strange clicking noise?UK Paul clicked his fingers (= moved his thumb against his middle finger to make a short sharp sound) to attract the waiter's attention. Soldiers click their heels (= bring them sharply together) when they stand to attention.\nThesaurus: synonyms, antonyms, and examples\nto close closeCan you close the door behind you?shutI shut the door so the cat couldn't get out.snap shutHe snapped his briefcase shut and walked out of the office.click shutThe door clicked shut. slamPlease don't slam the door.\nSee more results »\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nclick verb\n(LIKE SB/STH)\n[ I ] informal to like and understand someone, especially the first time you meet: He didn't really click with his new boss. Liz and I really clicked the first time we met. I met her at school and we just clicked.\nC2 [ I ] informal to be liked by someone: The new daytime soap opera has yet to show signs that it's clicking with the television audience.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nspeak\nstrike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiked, or not liked, by many people\nclick verb\n(BECOME CLEAR)\nC2 [ I ] informal to be understood, or become clear suddenly: Suddenly everything clicked and I realized where I'd met him. [ + question word ] As he talked about his schooldays, it suddenly clicked where I had met him before. [ + that ] So it's finally clicked that you're going to have to get yourself a job, has it? In the last act of the play, everything clicks into place.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nPhrasal verbs\nclick away\nclick out"}