{"id":100182,"name":"cliche","type":"noun","us_sound":"kliːˈʃeɪ","us_link":"../audio/c/cliche_01_00.mp3","uk_sound":"ˈkliː.ʃeɪ","uk_link":"../audio/c/ukclear023.mp3","content":"Add to word list\nAdd to word list\nC2 a phrase, remark, or opinion that has very often been said or expressed before and is therefore not original and not interesting: My wedding day - and I know it's a cliché - was just the happiest day of my life. Occasionally his writing slips into cliché.\nsomething or someone that is not at all original, surprising, or interesting because it has very often been seen before: The guitar-smashing rock star has become a cliché. All of these games are set in a futuristic urban cliche where it is dark and raining.\nMore examplesFewer examplesIf you'll forgive me for using a book reviewer's cliché, I couldn't put it down.He often wrote to radio presenters complaining about their use of cliché.It's a cliche to say that the creations of a great artist will forever live after them.The cliché was that Britain had terrible food, the worst in Europe. Niagara Falls may be the ultimate tourist cliché but it remains one of the world's most breathtaking sights.He has been described as looking like a cliché of a librarian.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nmotto\noperative\nphrase\nsentence\nslogan\nsubsentence\nthe operative word idiom\nto coin a phrase idiom\nTrumpism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTedious and uninspiring\noften said, used, or done, and therefore not original and not interesting: The city is like Disneyland. It sounds cliché, but it’s true. The film opens with a cliché slow-motion shot of the men walking towards the camera. Synonym\nclichéd\nMore examplesFewer examplesIt's so cliché to describe something as \"a labour of love\".We don't want to see any more cliché cheerleaders.The horrible cheesy music playing in the restaurant and the heart decorations everywhere made the evening cliche, uncomfortable, and not the least bit romantic.\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarginal\nmarmoreal\nmeh\nmenial\nmenially\nspinach\nstaid\nstaidly\nstale\nstaleness\nwatch paint dry idiom\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nSee more results »\nAdd to word list\nAdd to word list\nwriting an idea or expression that has been used too often and is often considered a sign of bad writing or old-fashioned thinking: The story is shamelessly corny, and grownups will groan at its clichés."}