{"id":100200,"name":"client","type":"noun","us_sound":"ˈklaɪ.ənt","us_link":"../audio/c/client.mp3","uk_sound":"ˈklaɪ.ənt","uk_link":"../audio/c/ukclear026.mp3","content":"client noun [C]\n(CUSTOMER)\nAdd to word list\nAdd to word list\nB2 a customer or someone who receives services: Mr Black has been a client of this firm for many years. We always aim to give our clients personal attention.\nMore examplesFewer examplesShe used cognitive therapy on her client to try to inhibit those negative thoughts which were damaging his self-esteem.Counsel for the defence argued convincingly that his client was not guilty.It's important to create a good impression when you meet a new client.The defending lawyer asked that the charge against his client be dismissed.She was acting in good faith for her client.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who buy things\nclient noun [C]\n(COMPUTER)\na computer that is connected to a server (= large central computer) from which it gets information\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nAdd to word list\nAdd to word list\na person who receives services, esp. from a lawyer or other person who gives advice: He’s a sports agent and has a lot of basketball players as clients.\nAdd to word list\nAdd to word list\nCOMMERCE someone who receives professional services from an organization: We offer a broad range of services to our clients.a client of sb/sth Mr Black has been a client of this law firm for many years.a corporate/private/individual client Our specially trained staff can offer corporate clients on-site assessments and training workshops. a valued/important/major client a new/prospective/potential client help/advise/represent a clientclient care/service/satisfaction We attribute our growth to our unwavering commitment to client service.\nCOMMERCE a customer who buys goods or services from a store, restaurant, etc.: The restaurant's lunchtime clients are mostly businesspeople.\nIT a computer or piece of software or equipment that is connected to a server (= a large central computer) from which it gets information: email/Windows/web client Please type this address into your email client."}