{"id":100282,"name":"climb","type":"verb","us_sound":"klaɪm","us_link":"../audio/c/climb.mp3","uk_sound":"klaɪm","uk_link":"../audio/c/ukclima006.mp3","content":"climb verb\n(RISE)\nAdd to word list\nAdd to word list\nB2 [ I ] to go up, or to go towards the top of something: The plane climbed quickly to a height of 30,000 feet. As it leaves the village, the road climbs steeply up the mountain. The sun climbed higher in the sky.\nA2 [ I or T ] to use your legs, or your legs and hands, to go up or onto the top of something: to climb the stairs/mountain I hate climbing ladders. We're going climbing (= climbing mountains as a sport) in Scotland next weekend.\nThesaurus: synonyms, antonyms, and examples\nto move onto or towards the top of somethingclimbIt was an effort to climb the stairs.ascendShe ascended the podium and began to speak.scaleHe claims to have scaled every peak of the Himalayas.mountThe cowboy mounted his horse and rode off into the sunset.\nSee more results »\n[ I ] If a price, number, or amount climbs, it increases: Our costs have climbed rapidly in the last few years.\n[ I ] to move into a higher social position, or to improve your position at work: He quickly climbed to the top of his profession.\nMore examplesFewer examplesIt would be crazy to try to climb the mountain in this weather.Can't you climb that tree, you big sissy?I had to climb a steep flight of stairs to her front door.We had to climb over a ten-foot wall to get into the garden.Weighed down with supplies, they found the steep path difficult to climb.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nscramble\nshinny\nsoaring\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nclimb verb\n(MOVE)\nB2 [ I usually + adv/prep ] to move into or out of a small space awkwardly or with difficulty or effort: They climbed into the truck and drove away. We can't stop Tom climbing out of his cot.\nMore examplesFewer examplesMany millions of years ago, our ancestors climbed out of the primeval ooze onto dry land.We all climbed onto the bus.The kittens kept climbing out of their box.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\naboard\nbestride\nboard\ndebark\ndeplane\ndisembark\ndisembarkation\ndismount\neject\nembarkation\nentrain\nget\nget off\nget on\nget out\nhop\nin\nmount\nsettle\nstraddle\nSee more results »\nclimb verb\n(GROW)\n[ I ] to grow upwards: There's masses of ivy climbing up/over the walls of our house.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nscramble\nshinny\nsoaring\nupwardly\nSee more results »\nIdiom\nbe climbing the wallsPhrasal verb\nclimb down\nan act or process of climbing: We were very tired after our climb. The climb down the mountain took longer than the climb up. I've made three climbs so far this year. Her climb to power has been very rapid. Synonyms\nascent (CLIMB)\nrise (MOVEMENT UP)Opposite\ndescent (POSITION)\na place or object to be climbed: The north face of the Eiger is a very difficult climb.\nSMART Vocabulary: related words and phrases\nMountaineering & rock climbing\nabseil\nabseil down something\nabseiling\nascender\nbase camp\nclimbing\nclimbing wall\ncoasteering\ncrampon\nfoothold\nfree soloist\nice axe\nice pick\nkarabiner\nmountain climber\nrappel\nrappelling\nrock climbing\nsherpa\nsoloing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving upwards\nclimb verb\n(RISE)\nAdd to word list\nAdd to word list\n[ I/T ] to go up, or go up something or to the top of something: [ I ] We climbed to the top of the hill, where we had a great view. [ T ] She climbed the stairs to the third floor. [ I ] The plane is still climbing and will level off at 33,000 feet. [ I ] fig. As he climbed the corporate ladder (= moved into better and better positions in business), his salary increased dramatically.\n[ I/T ] To climb is also to increase: [ I ] The cost of goods is climbing.\nclimb verb\n(MOVE)\n[ I always + adv/prep ] to move in a way that uses your arms and legs and often involves careful control over your body: He climbed down from the ladder to get some more paint.\nclimb noun [C]\n(RISE)\nan act of going up: It was a long, difficult climb to the top of the hill.\nAdd to word list\nAdd to word list\n[ I ] if a price, number, or amount climbs, it increases: costs/prices/rates climb Our costs have climbed rapidly in the last few years. climb steadily/steeply/slowly\n[ I or T ] to improve your position at work or in society: He quickly climbed to the top of his profession.climb the housing/promotion/corporate ladder As executives struggle to climb the corporate ladder, they often do not want to say anything that could harm their chances.\nan increase in a price, number, or amount: a climb in sth A sustained climb in interest rates could hit some parts of the housing market harder than others.\na period of improvement or progress: It's going to be a long, hard climb before we get out of this recession. Her climb to the top of the profession was remarkably quick."}