{"id":100317,"name":"cling","type":"verb","us_sound":"klɪŋ","us_link":"../audio/c/cling.mp3","uk_sound":"klɪŋ","uk_link":"../audio/c/ukclima013.mp3","content":"cling verb\n(HOLD)\nAdd to word list\nAdd to word list\nC2 [ I + adv/prep ] to stick onto or hold something or someone tightly, or to refuse to stop holding it, him, or her: We got so wet that our clothes clung to us. They clung together in terror as the screams grew louder. One little girl was clinging onto a cuddly toy. She clung to the handrail as she walked down the slippery steps.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nMore examplesFewer examplesA few wisps of hay still clung to her skirt.Kate was still clinging to the wreckage of her failed marriage.She clung to my hand as we entered the doctor's surgery.They discovered four men clinging to a piece of wood in the choppy seas.Her wet hair clung to her face.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncup\ndandle\nenfold\ngrasp\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nhold on idiom\nonto\npinion\nseize\ntaken\nSee more results »\ncling verb\n(STAY CLOSE)\n[ I usually + adv/prep ] to stay close or near: The road clings to (= closely follows) the coastline for several miles, then it turns inland.\n[ I ] disapproving to stay close to someone who is taking care of you, because you need their support: Jenny is the kind of child who always clings whenever she's taken to a new place.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nace\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nhand to hand idiom\nhard by\nhere\nhereabouts\nproximity\nroof\nround the corner idiom\nshadow\nshout\nstep\nsuper-convenient\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating alliances\nRelated word\nclingingPhrasal verbs\ncling (on) to something\ncling to something\nAdd to word list\nAdd to word list\nto hold tightly or to stick; to refuse to stop holding: They clung together in terror. We were soaking wet and our clothes clung to us. fig. Farmers and herders cling to the valleys (= stay in the valleys) where the soil is less sandy."}