{"id":100686,"name":"clone","type":"noun","us_sound":"kloʊn","us_link":"../audio/c/clone.mp3","uk_sound":"kləʊn","uk_link":"../audio/c/ukclipp023.mp3","content":"Add to word list\nAdd to word list\na plant or animal that has the same genes as the original from which it was produced\ninformal disapproving someone or something that looks very much like someone or something else: Most people saw her as just another blond-haired, red-lipped Marilyn Monroe clone.\ncomputing\n&#160; specialized a computer that operates in a very similar way to the one that it was copied from\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenetic fingerprinting\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing people with the same qualities\nComputer concepts\nto create a clone of a plant or animal: Scientists have already cloned a sheep. Experiments to try to clone human embryos have met with hostility from some sections of the public.\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenetic fingerprinting\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScientific techniques\nRelated word\ncloning\nAdd to word list\nAdd to word list\nbiology a cell or organism that has the exact same chemical patterns in its cells as the original from which it was artificially produced\nto produce a clone\nAdd to word list\nAdd to word list\nPRODUCTION a product that is very similar to another one that it was copied from: The doll was created as a cheap Barbie clone.\nIT a computer that operates in a very similar way to the one that it was copied from: His competitive pricing helped launch the IBM-PC clone industry during the 1980s.\nPRODUCTION to create a product that is very similar to another one: The idea was pioneered by Freemarket, and cloned by countless others.\nto create an illegal copy of something such as a credit card: The card is then cloned and cash taken from the victim's account."}