{"id":100726,"name":"close","type":"verb","us_sound":"kloʊz","us_link":"../audio/c/eus70844.mp3","uk_sound":"kləʊz","uk_link":"../audio/c/ukclipp025.mp3","content":"close verb\n(NOT OPEN)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to change from being open to not being open, or to cause something to do this: Could you close the door please? I went out and forgot to close the window. Close your eyes - I've got a surprise for you.\nThesaurus: synonyms, antonyms, and examples\nto close closeCan you close the door behind you?shutI shut the door so the cat couldn't get out.snap shutHe snapped his briefcase shut and walked out of the office.click shutThe door clicked shut. slamPlease don't slam the door.\nSee more results »\nA2 [ I ] When a shop, restaurant, or public place closes, people cannot go into it: The banks had closed so I couldn't get any money out. We close to customers on Tuesday mornings for staff training. The museum closes at 5.30. We can't get a drink! It's after closing time.\nMore examplesFewer examplesThe council decided to close the library and now the building stands empty.Is it all right if I close the window?All 2,500 employees went on strike in protest at the decision to close the factory.Unless we find some new funding soon, the youth centre will have to close.The flowers open in the morning but close again in the afternoon.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncongest\ncork\ndam\ndam something up\nensconce\nfur\nsandbag\nseal something in\nseal something off\nself-seal\nself-sealing\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nclose verb\n(END)\nC2 [ I or T ] to end, or to cause something to do this: The play closed with the tragic death of both hero and heroine. She closed the meeting with a short speech. The pound closed at (= was worth) $1.47 at the end of the day's trading.\nB2 [ I or T ] (of a business, organization, or business arrangement) to stop operating; to cause something to stop operating: I closed that bank account when I came to London. The factory closed over ten years ago.\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nclose a deal\nto make a successful business arrangement with someone: We closed a deal with a major supermarket.\nSee more\nMore examplesFewer examplesShe spoke against the decision to close the college.The local council has decreed that the hospital should close.We had to close our London office - with the rent so high it just wasn't economic.Sales have fallen badly this year, to the extent that we will have to close some of our shops.The country's government has come under fire for its decision to close the mines.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nIdioms\nclose your eyes to something\nclose ranks\nclose up shopPhrasal verbs\nclose (something) down\nclose in\nclose something off\nclose on sb/sth\nclose noun\n(END)\n[ S ] uk\nYour browser doesn't support HTML5 audio\n/kləʊz/ us\nYour browser doesn't support HTML5 audio\n/kloʊz/ the end of something, or the time when you end it: At the close of the meeting the contract remained unsigned. The season is now nearing its close. See also\nclose of business\nclose of play\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\nbring/draw something to a close\nto make something finish: I tried to bring the conversation to a close.\nSee more come/draw to a close\nto end: The singer's tour comes to a close in Tokyo tonight.\nSee more\nMore examplesFewer examplesThe character's fate at the close of the book remains unclear.An auction of artwork was organized for the close of the show.They discussed the period from the beginning of the Seven Years' War to the close of the Napoleonic Wars.\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\nconclusion\ndeath\nending\nexpiration\nexpiry\nfag\nfinalization\nfinish\nswansong\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\ntwilight\nSee more results »\nclose noun\n(ROAD)\n[ C ] UK uk\nYour browser doesn't support HTML5 audio\n/kləʊs/ us\nYour browser doesn't support HTML5 audio\n/kloʊs/ a road, usually with private houses, that vehicles can only enter from one end: He lives at 83 Barker Close.\nSMART Vocabulary: related words and phrases\nRoads: urban & residential streets\naccess road\nadopt\nadopted\nalley\narterial\nboulevard\ncrossing guard\ncul-de-sac\ngrove\nhigh street\nlane\nlollipop lady\nparade\nplaza\nRd\nrow\nrunnel\nst\nstreet\nunadopted\nSee more results »\nclose adjective\n(RELATIONSHIP)\nB1 having direct family connections or shared beliefs, support, and sympathy: There weren't many people at the funeral - just close family/relatives. They're a worrying political party because of their close links/ties with terrorist groups. In those early months, there's a very close bond between mother and child. a close community\nA2 People who are close know each other very well and like each other a lot, or they see and talk to each other a lot: Mira is one of my closest friends. Her relationship isn't good with her father, but she's very close to her mother. My brother and I have become much closer over the years.\nMore examplesFewer examplesDid you form any close friendships while you were at college?Historically , there have always been close links between France and Scotland.All her close relatives came to the wedding.She is one of the president's closest advisers.We haven't always been close, but she was there for me when I needed her.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: general words\nFriendly\nclose adjective\n(CAREFUL)\nC2 looking at or listening to someone or something very carefully: Police are paying close attention to the situation. Take a closer look at this photograph.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nclose adjective\n(SECRETIVE)\nunwilling to talk about things to other people: He's so close about his past - it seems like he's hiding something.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivate\nprivately\nprivileged\npseudonym\npseudonymization\nunrevealed\nunsourced\nunstated\nuntraceable\nwhitewashing\nSee more results »\nclose adjective\n(LACKING AIR)\nused to describe weather or air conditions in which it is difficult to breathe and it is uncomfortably warm: Can I open the window? It's very close in here.\nSMART Vocabulary: related words and phrases\nHot & heat\nbake\nbaking\nbeat down\nblistering\nblisteringly\nboiling\nboiling hot\ncloseness\nfug\nglow\nhaze over\nheated\noppressive\noverheat\nstuffiness\nsuffocatingly\nsuperhot\nsweltering\nswelteringly\nwhite heat\nSee more results »\nclose adjective, adverb\n(NEAR)\nA1 not far in position or time: Don't get too close to that dog, Rosie. I hate people standing too close to me. As Christmas gets closer, the shops get more and more crowded. Emma looked close to tears (= almost going to cry).\nThesaurus: synonyms, antonyms, and examples\nto come closer in space or timeapproachA stranger approached and asked to have her picture taken with him.come/get closerThe swarm of bees was coming closer and closer. come/get nearerAs she came nearer the building the movement of the crowd became slower.draw closer/nearerThe holidays are drawing closer.come upA stranger came up to me and shook my hand.walk, go, etc. upI went up to him and asked him who he was.\nSee more results »\nclose by\nnear: Shall we call in on Miranda? You know she lives quite close by.\nSee more\nMore examplesFewer examplesWalking along the darkened street, he heard footsteps close behind him.Bodyguards surrounded the singer so that photographers couldn't get close.We live close to the railway line.Although close to tears, she tried to make her voice sound casual.He told her to stay close and not to wander off again.\nSMART Vocabulary: related words and phrases\nCloseness in distance and time\na hair's breadth idiom\na stone's throw idiom\nabout\nanywhere\nanywhere near idiom\napproachable\naround\nfloat\nfloat around\nhand to hand idiom\nhard by\nhere\nproximately\nproximity\nroof\nround the corner idiom\nshadow\nshout\nspit\nstep\nSee more results »\nclose adjective, adverb\n(SIMILAR)\nC1 having only a small difference: The election results were so close they had to vote again. He came second in the race, but it was very close. The youngest boys are so close in age they look like twins. Both children bear a very close resemblance to their father.\nThesaurus: synonyms, antonyms, and examples\nlooking or being almost but not exactly the samesimilarI have a sofa quite similar to yours.likeShe's a lot like her mother.alikeThe girls look alike.closeMy cousin and I are quite close in age.something likeI was worried something like this would happen.\nSee more results »\nclose on/to (US usually close to)\nalmost: I think there are close on three million unemployed at present.\nSee more\nMore examplesFewer examplesThere are several close affinities between the two paintings.He won the race, but it was very close.Eventually we chose Mary for the job, but it was a close decision.The children are very close in their musical ability.All three of us are close in age.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nIdioms\nclose, but no cigar\nat close quarters/range\nbe close to the bone\nbe too close for comfort\ncome close to blows\nthat was close!\nclose adjective, adverb [-er/-est only]\n(NEAR)\nAdd to word list\nAdd to word list\nnear in position, time, or condition: The store was close by, so they decided to walk. It’s close to 7 o’clock – we’d better leave now. The child moved closer to his mother. She was very close to death for awhile. Idiom\nclose call\nclose adjective\n(CONNECTED)\n[ -er/-est only ] connected or involved in strong relationship with someone: Charmaine is my closest friend. Joyce and I used to be close, but now we seldom see each other.\nclose adjective\n(SIMILAR)\n[ -er/-est only ] similar; of the same type: Your computer is pretty close to the one I have.\n[ -er/-est only ] If a game or competition is close, both sides have almost the same score.\nclose adjective\n(CAREFUL)\n[ -er/-est only ] giving your full attention to something so that you notice its details: I wasn’t the one driving, so I wasn’t paying close attention to the route we took.\nclose adjective\n(WARM)\n[ not gradable ] very warm, with no movement of air: It was uncomfortably close in the gym.\nclose verb [I/T]\n(MAKE NOT OPEN)\nto change from being open to not being open, or to cause this to happen: [ T ] Come in and close the door. [ T ] Because of an accident, police closed (= blocked) two lanes of the expressway. [ T ] Grace closed her eyes to think.\nclose verb [I/T]\n(END/STOP)\nto end or stop operating, or to cause this to happen: [ T ] Authorities closed the aging nuclear plant. [ I ] After a run of three months, the show closes on Saturday.\n(esp. of a business) To close is also to temporarily stop being available to customers: [ I ] The store closes at 9 tonight.\nclose verb [I/T]\n(COMPLETE)\nto make a financial or business arrangement complete: [ T ] The manufacturer is closing a deal to sell its boating division. close noun [ C usually sing ] us\nYour browser doesn't support HTML5 audio\n/kloʊz/\nThe ski season has come to a close. closing noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈkloʊ·zɪŋ/\nThe closing for the house was set for April. Phrasal verbs\nclose down (something)\nclose in\nclose off something\nclose out something\nAdd to word list\nAdd to word list\n[ I or T ] if a shop, restaurant, or public place closes or someone closes it, it stops being open for business at the end of the day, week, etc.: The store closes at 5.30.close (sth) to sb The banks had closed to customers so I couldn't pay the money in. We usually close the bar around midnight.\n[ I or T ] if a business closes or is closed, it stops operating permanently: The factory closed with the loss of 250 jobs. The organization will be forced to let staff go and close many of its offices.\n[ I ]\n&#160; FINANCE, STOCK MARKET if a market, currency, share, etc. closes, it stops trading or being traded at the end of the working day: The company released its statement after the market closed on Friday.close up/down The Dow Jones closed up 94.90 at 10,623.60.close at sth The pound closed at $1.47, down from $1.49 yesterday.\n[ I or T ] to finish, or to make something end: At 11.45 the Chair closed the meeting.close (sth) with sth She closed with a few remarks about the future.\n[ I or T often passive ] if something closes or is closed, there is no longer an opportunity to become involved because a particular date has been reached: Applications for the post close on Wednesday 14 September. Booking for the course is now closed.\n[ I or T ]\n&#160; IT if a computer program or a window on a computer screen closes, or if you close it, it stops operating because you tell it to: Click on the 'X' to close the window and exit the application. This file won't close.\n[ T ]\n&#160; BANKING to remove all the money from a bank account and stop using it permanently: I closed that account when I moved to the UK.\nclose a deal\nto complete a successful business arrangement with someone: The company plans to sell its generic drug unit and expects to close the deal in late March. Phrasal verb\nclose (sth) down\nthe end of something: bring/draw sth to a close I tried to bring the meeting to a close.at the close of sth At the close of the financial year, the balance amounted to $418 million.\nFINANCE, STOCK MARKET the end of a day's trading on a market: the close of business/trading His exit was announced after the close of trading.at the close The IT services specialist was down 7.25p to 196.5p at the close.\n(the) close of play\nFINANCE, STOCK MARKET the end of a working day or of a day's trading: The bank said that a check paid in on Monday cannot be bounced after close of play on Thursday.at/by (the) close of play The share price had almost doubled to 95.5p at close of play on Friday."}