{"id":100752,"name":"closet","type":"noun","us_sound":"ˈklɑː.zət","us_link":"../audio/c/closet.mp3","uk_sound":"ˈklɒz.ɪt","uk_link":"../audio/c/ukclipp030.mp3","content":"closet noun [C]\n(FURNITURE)\nAdd to word list\nAdd to word list\nA2 mainly US a cupboard or a small room with a door, used for storing things, especially clothes: a bedroom/linen/storage closet\nKostikova/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nFurniture for storage\nairing cupboard\nalmirah\nbookcase\nbookshelf\nbroom closet\ncubby\ncubbyhole\ncupboard\ncwtch\ndrawer\nhot press\nhutch\nlocker\nottoman\nshelf\nshelves\ntrophy cabinet\nwalk-in\nwardrobe\nWelsh dresser\nSee more results »\ncloset noun [C]\n(IDENTITY)\nin the closet\nused to describe a person who is not heterosexual (= sexually attracted to men if they are a woman and women if they are a man) or not cisgender (= having a gender that matches the body they were born with), but keeps that fact secret from other people: The ban could lead to trans service members staying in the closet even when it is dangerous for their mental health. The story revolves around Jason and Peter, who are in love but are both in the closet. Synonym\ncloseted (SECRET)Note: In the closet can have a negative meaning to some people. out of the closet\nused to describe a person who is not heterosexual (= sexually attracted to men if they are a woman and women if they are a man) or not cisgender (= having a gender that matches the body they were born with), and does not keep that fact secret from other people: He is openly gay now, but didn't come out of the closet until a few years ago. Gay, lesbian, bisexual and transgender students are feeling empowered to come out of the closet younger than previous generations. For some people, being out of the closet can present a lot of risks, but I've found it very liberating. See also\nout adverb preposition (MADE PUBLIC)\ncome out (BECOME KNOWN)\nto put yourself in a place, especially a closed space, and stay there: Two weeks before my exams I closeted myself (away) in my room with my books and I didn't speak to anyone. The president has been closeted with (= having a private meeting with) his advisers for several hours.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncork\ndam\ndam something up\nensconce\nensconced\ngum\nseal something in\nseal something off\nself-seal\nself-sealing\nshut\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nused to refer to a belief, activity, or feeling that is kept secret from the public, usually because you are frightened of the results of it becoming known: a closet alcoholic/smoker Dole portrayed the president in campaign speeches as a \"closet liberal\".\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndissimulate\ndissimulation\ndown-low\nentre nous\nexecutive privilege\nprivately\nprivileged\npseudonym\npseudonymization\npseudonymize\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nAdd to word list\nAdd to word list\na small room or space in a wall where you can store things such as clothes, sheets, etc., often having a door so that it can be closed: a clothes/linen closet\nkept secret from others: a closet liberal\nto arrange to meet privately with someone where you will not be interrupted: The president and his advisers closeted themselves with the congressional leadership."}