{"id":100761,"name":"closing","type":"adjective","us_sound":"ˈkloʊz.zɪŋ","us_link":"../audio/c/uscld00227.mp3","uk_sound":"ˈkləʊ.zɪŋ","uk_link":"../audio/c/ukcld00227.mp3","content":"Add to word list\nAdd to word list\ncoming near the end of a speech, event, activity, etc.: In his closing remarks, the chairman thanked everyone who had helped. the closing ceremony of the OIympic Games Opposite\nopening\nSMART Vocabulary: related words and phrases\nFinal and finally\nantepenultimate\nas a last resort idiom\nat the end of the day idiom\nback end\nconcluding\nconclusion\neventually\nfinal\nfinally\nhear/see the last of something idiom\nlast\nlast-ditch\nlastly\nlatest\nlatter\nnon-final\nthe last but one idiom\nthe last someone heard/saw of someone/something idiom\nultimate\nultimately\nSee more results »\nAdd to word list\nAdd to word list\n[ C or U ] the act of permanently stopping a factory, business, organization, etc. from operating: Congress passed a law to protect workers and their families from the harmful effects of sudden plant closings and mass layoffs. Compare\nopening noun\n[ C or U ]\n&#160; STOCK MARKET, FINANCE the end of the day's trading on a stock market: The rivals have until 1pm to put in their bids and the winner will be declared at the closing of the market at 4.30pm. Compare\nopening noun\n[ U ]\n&#160; COMMERCE the act of finishing business for the day, or the time when this happens: We managed to finish our shopping right before closing.early/late closing Monday is early closing. Compare\nopening noun\n[ U ]\n&#160; BANKING, FINANCE, PROPERTY\n&#160; US the final stage of arranging a loan or of buying and selling property: We will be ready to move in immediately after the closing.at closing Homeowners have the option of taking a lump sum at closing. See also\ncompletion\n[ U ]\n&#160; ACCOUNTING the end of a period of accounting\ncoming near the end of a speech, event, activity, etc.: closing remarks/statement In her closing remarks, she thanked all the delegates for taking part. The Prime Minister spoke yesterday at the closing ceremony of the Paris Air Show. Compare\nopening adjective\nSTOCK MARKET, FINANCE coming at the end of the day's trading on the stock market: The Dow achieved a closing record of 5,894.74. Stock prices had risen 10% by the closing bell. Compare\nopening adjective"}