{"id":100772,"name":"closure","type":"noun","us_sound":"ˈkloʊ.ʒɚ","us_link":"../audio/c/closure.mp3","uk_sound":"ˈkləʊ.ʒər","uk_link":"../audio/c/ukclosu001.mp3","content":"closure noun\n(STOPPING)\nAdd to word list\nAdd to word list\nC2 [ C ] the fact of a business, organization, etc. stopping operating: factory/branch closures Many elderly people will be affected by the library closures.\n[ U ]\n&#160; politics\n&#160; UK specialized (US cloture) a process for ending a debate (= formal discussion) in a parliament so there can be a vote: A motion for closure may be adopted by a simple majority.\nMore examplesFewer examplesThe city suffered another blow last month with the closure of the local car factory.The newspaper article touched a raw nerve - people still resent the closure of the local school.We, the undersigned, strongly object to the closure of St. Mary's Hospital: Dr Jack James, Dr Philippa Curry, Hugh Edwards.The closure of the company's German subsidiary caused a sharp wobble in its profits.The closure of the factory brought poverty to the town .\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfold\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nhave a corner on a market idiom\nreceiver\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nsubscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComing to an end\nDebate & discussion\nclosure noun\n(EMOTIONAL)\n[ U ] the feeling or act of bringing an unpleasant situation, time, or experience to an end, so that you are able to start new activities: a sense of closure to achieve/reach closure\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-length\nfully\nfully fledged\nglobally\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nclosure noun\n(STOP OPERATING)\nAdd to word list\nAdd to word list\n[ C ] the act of stopping operations of a business, school, hospital, etc.: A storm forced the closure of many schools and businesses.\nclosure noun\n(SATISFACTION)\n[ U ] the feeling or act of bringing something bad to an end: a sense of closure Yesterday’s vote will bring closure to a painful chapter in history.\nAdd to word list\nAdd to word list\n[ C or U ] the act of permanently closing a business, factory, etc., or the condition of being closed permanently: Unions fought hard against the closure of the mine.be threatened with/face closure The shop is now facing closure after local councillors dismissed the licence application. factory/branch/store closures a proposed/planned/possible closure temporary/permanent/total closure The car maker was saved from closure in 2006.\n[ S or U ] the act of ending something: More companies could look to outsource work overseas after the closure of a tax loophole."}