{"id":100967,"name":"clue","type":"noun","us_sound":"kluː","us_link":"../audio/c/clue.mp3","uk_sound":"kluː","uk_link":"../audio/c/ukclosu021.mp3","content":"Add to word list\nAdd to word list\nB2 a sign or some information that helps you to find the answer to a problem, question, or mystery: Police are still looking for clues in their search for the missing girl. I'm never going to guess the answer if you don't give me a clue.\nMore examplesFewer examplesThe police found a vital clue to the girl's disappearance in a wooded area near her home.Forensic scientists are going over the victim's flat in a search for clues about the murderer.The police are collecting clues in order to piece together the details of the day she died.He pored over the letter searching for clues about the writer.The police tried to reconstruct the crime using the statements of witnesses and clues that they had found.\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nconquer\nconquerable\nfigure\nfix\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill or cure idiom\nresolution\nsolve\nsurmountable\ntalk something out\nunsolvable\nuntangle\nSee more results »\nIdiom\nnot have a clue/have no clue\nto write or create clues for something such as a crossword (= a game in which you have to write words in a pattern of black and white squares) or other game: I've got a crossword grid almost ready to post online — I just have to finish cluing it. This game doesn't have a very interesting story, it's not obvious what to do, and the puzzles in it are very badly clued.\nUS informal to give someone information that helps them understand something: The character disguises her identity, cluing us about the movie's fascination with deception. There was nothing to clue the staff that this guy should not have been in the building.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nbran tub\nbuildering\nChinese puzzle\njigsaw\njump rope\nkeepy-uppy\nkite\nkorfball\nLARP\nLARPer\norigami\npinball\nsubworld\nsudoku\ntable football\ntabletop\ntailgating\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnowledge and awareness\nPhrasal verbs\nclue in\nclue someone in\nAdd to word list\nAdd to word list\ninformation that helps you to find the answer to a problem, question, or mystery: For five months, Russell remained a fugitive, leaving no clues as to his whereabouts."}