{"id":100991,"name":"clumsy","type":"adjective","us_sound":"ˈklʌm.zi","us_link":"../audio/c/clumsy.mp3","uk_sound":"ˈklʌm.zi","uk_link":"../audio/c/ukclosu026.mp3","content":"Add to word list\nAdd to word list\nB2 A clumsy person often has accidents because they do not behave in a careful, controlled way: That's the third glass you've smashed this week - you're so clumsy!\nawkward in movement or manner: The first mobile phones were heavy and clumsy to use, but nowadays they are much easier to handle. He gave a clumsy bow.\nnot skilful in the way you deal with or express something: Her clumsy handling of the situation only made it worse. My attempts to apologize were very clumsy. Some of the wording of the statement was a bit clumsy.\nMore examplesFewer examplesHer movements were rather clumsy.You clumsy oaf! You've broken it!She was clumsy and uncoordinated as a girl.She made a clumsy curtsey and backed out of the room.They laugh at his clumsy syntax and hilarious malapropisms. He tried to talk to her, but he was so clumsy she didn't fully understand what he was saying.\nSMART Vocabulary: related words and phrases\nInability and awkwardness\naccident-prone\nadorkable\nall thumbs idiom\namateurish\namateurishly\nfunctional illiteracy\ngauche\ngauchely\ngawkily\ngeek\njack-of-all-trades\njack-of-all-trades, master of none idiom\nklutzy\nlike a bull in a china shop idiom\nlost\nuneducable\nunenterprising\nunequal\nungainly\nunskilful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThick, dense and heavy\nExperiencing difficulties\nNot attractive to look at\nRelated words\nclumsily\nclumsiness\nAdd to word list\nAdd to word list\nawkward in movement or manner: I’m so clumsy – I keep dropping things.\nClumsy also means done in an awkward or embarrassing way: He subsequently wrote a letter to the magazine in an admittedly clumsy try at explaining his viewpoint.\nSomething that is clumsy is too big or complicated to be dealt with easily: She would be at the mercy of a clumsy bureaucracy."}