{"id":101027,"name":"cluster","type":"noun","us_sound":"ˈklʌs.tɚ","us_link":"../audio/c/cluster.mp3","uk_sound":"ˈklʌs.tər","uk_link":"../audio/c/ukclosu029.mp3","content":"Add to word list\nAdd to word list\n[ + sing/pl verb ] a group of similar things that are close together, sometimes surrounding something: Have a look at the cluster of galaxies in this photograph. There was a cluster of fans around him, asking for autographs.\nphonetics\n&#160; specialized a group of two or more consonant sounds that are pronounced together with no vowel sound between them: The /str/ at the beginning of \"stray\" is a cluster. The word \"glimpsed\" ends with the consonant cluster /mpst/.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\nempty set\nensemble\nfamily\nfeast\ngeneration\nglory box\npackage\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nstore cupboard\nSee more results »\n(of a group of similar things or people) to form a group, sometimes by surrounding something, or to make something do this: People clustered around the noticeboard to read the exam results. The hens cluster together at the sight of strangers, going quiet.\nMore examplesFewer examplesThey clustered together in the corner watching the noisy prisoners and their visitors.The residents clustered in awkward groups, checking their watches. Everyone clustered round them, calling greetings.\nSMART Vocabulary: related words and phrases\nForming groups (of people)\nalienated\nbe ranged against/with something/someone\nclass reunion\ncongregate\nconvene\ncrowd around (someone/something)\nfederalization\nflock\nform\ngather\nget together\nrally\nrange\nregather\nregroup\nreunion\nround\nround something/someone up\nthe assembled company\nthrong\nSee more results »\nAdd to word list\nAdd to word list\nto form or gather together: All his grandchildren clustered around him.\na group of similar things growing or held together, or a group of people or things that are close together: dense clusters of delicate pink blossoms This section of town has a large cluster of fast-food restaurants.\nAdd to word list\nAdd to word list\na group of similar things that are close together in a small area: There is a cluster of hi-tech businesses in the city's industrial park.\na group of similar events that happen within a small area or among a small group of people: The study will look at an apparent cancer cluster among workers at the factory.\nIT a group of computers connected together to work as one larger computer and to improve their performance\nto happen a lot in the same small area or in the same way: Most young firms tend to cluster in the finance, IT, telecoms, and retail industries.\nto stand or be positioned close together in a group: People clustered around the noticeboard to read the announcement."}