{"id":101036,"name":"clutch","type":"verb","us_sound":"klʌtʃ","us_link":"../audio/c/clutch.mp3","uk_sound":"klʌtʃ","uk_link":"../audio/c/ukclosu030.mp3","content":"Add to word list\nAdd to word list\nC2 to take or try to take hold of something or someone tightly, usually in fear, worry, or pain: clutch onto Silent and pale, she clutched onto her mother's hand.clutch something to something Clutching the money to his chest, he hurried to the bank. He collapsed, clutching his stomach.\nThesaurus: synonyms, antonyms, and examples\nto hold someone or somethingholdCan you hold this for a moment?claspHe reached out to clasp her hand.gripThe baby gripped my finger with her tiny hand.clutchSilent and pale, she clutched her mother's hand.clingOne little girl was clinging onto a cuddly toy.hang onThe child was hanging on to her mother's skirt.\nSee more results »\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nonto\npurchase\nseize\ntaken\nSee more results »\nIdiom\nclutch your pearlsPhrasal verb\nclutch at something\nclutch noun\n(MACHINE PART)\n[ C usually singular ] a device that allows turning movement to be sent from one part of a machine to another: clutch slips I've booked the car into the garage because the clutch is slipping.\nC1 [ C usually singular ] the pedal or handle in a vehicle that is used to operate the engine's clutch: push the clutch in Push the clutch in, put the car into gear, rev the engine, and then gently let the clutch out.let the clutch out Push the clutch in, put the car into gear, rev the engine, and then gently let the clutch out.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe interior of vehicles\nclutch noun\n(GROUP)\n[ C ] a small group of eggs produced by the same bird, especially in a nest\n[ S ] a small group of people or things: clutch of a fresh clutch of students\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ndataset\nempty set\nensemble\nfamily\nfeast\ngeneration\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nclutch noun\n(CONTROL)\nsomeone's clutches C2 [ plural ] humorous\nthe control of someone: be in the clutches of He is in the clutches of that woman.\nSee more\nclutch noun\n(DIFFICULT SITUATION)\n[ S or U ] US a difficult and important situation that needs a lot of skill to deal with successfully: in the clutch \"This team was able to perform in the clutch every time,\" he said.clutch situation He remained cool under pressure and made accurate throws in clutch situations. come in clutch\ninformal to be very useful or helpful, especially in a difficult or important situation: I hoped that my beginner's luck would come in clutch. She learns that even though families might not be perfect, they sometimes come in clutch to save the day. These math posters will help your child with their homework, and come in clutch for parents who need a little math refresher too.\nMore examplesFewer examplesWe've battled through a lot, but I know what they can do in the clutch.Wright had a great season on the whole but was awful in clutch situations. Tiger doesn't seem to miss putts at clutch moments. He can handle the pressure.\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\n[ before noun ] able to do something when it is especially difficult or especially needed: Moose, always reliable under pressure, was an amazing clutch hitter.clutch performer He developed the reputation for being the big winner, the clutch performer.\n[ before noun ] done successfully when this is especially difficult or especially important: It was his leadership and clutch play that made him special. The team managed only three hits after falling behind, but came up with the clutch hit when it needed it the most. be clutch\nslang used to say that something is extremely good or useful, or exactly what is needed in a situation: I found five dollars in my pocket. That was so damn clutch.\nSee more\nMore examplesFewer examplesWe got the ball into our most clutch player's hands, and he delivered.In 1998, Hasek cemented his reputation as a clutch performer when he led the Czech National Team to an Olympic gold medal.They need to play nearly flawlessly to beat the hottest team in baseball. They need clutch hitting, they need near-perfect pitching.\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterous\ndexterously\ndigital native\nexpert\nexpertly\npedicure\npedigreed\npolished\npractised\nproficient\nultra-slick\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVery important or urgent\nclutch verb [I/T]\n(HOLD)\nAdd to word list\nAdd to word list\nto hold or try to hold something tightly, often because of a state of fear or anxiety: [ T ] The preschooler clutched his mother tightly.\nclutch noun\n(VEHICLE PART)\n[ C usually sing ] us\nYour browser doesn't support HTML5 audio\n/klʌtʃ/ a device in a car or other vehicle that you press with your foot in order to change gears (= set of wheels that control power)\nclutch noun\n(GROUP)\n[ C ] us/klʌtʃ/ a group of eggs or young animals hatched from eggs: several clutches of the infant sea turtles\n[ C ] us/klʌtʃ/ A clutch is also a group of people, animals, or things: The herders tend to small clutches of cattle and llamas.\nclutch noun\n(BAG)\n[ C ] us/klʌtʃ/ a small bag with no handle or strap, used esp. by women for carrying small personal items\nclutch adjective\n(PERFORMING WELL)\nable to do something when it is especially needed: Moose, always reliable under pressure, was a tremendous clutch hitter."}