{"id":101096,"name":"coach","type":"noun","us_sound":"koʊtʃ","us_link":"../audio/c/coach.mp3","uk_sound":"kəʊtʃ","uk_link":"../audio/c/ukclutc010.mp3","content":"coach noun\n(TEACHER)\nAdd to word list\nAdd to word list\nB1 someone whose job is to teach people to improve at a sport, skill, or school subject: a tennis/maths coach\nsomeone whose job is to train and organize a sports team: Gus Poyet was appointed as head coach.\nAlistair Berg/DigitalVision/GettyImages\nMore examplesFewer examplesThe coach issued a diktat that all team members must attend early-morning practice.Our football coach has worked hard to inculcate a team spirit into the players.The world's number one tennis player and his coach parted company earlier this month.She's an excellent coach who knows how to get results.We got a rollicking from the coach at half time.\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhomeschooler\nhousemaster\nhousemistress\ninstructor\nlecturer\nmentor\nrector\nresidence\nschoolie\nschoolmarm\nschoolmaster\nscribe\ntrainer\ntutor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\ncoach noun\n(VEHICLE)\nA2 [ C ] (US usually bus) a long motor vehicle with comfortable seats, used to take groups of people on journeys: We're going to the airport by coach. a coach trip\nyzak/E+/GettyImages\n[ C ] an old-fashioned carriage pulled by horses, now used mainly in official or royal ceremonies\n[ C ] UK (UK also carriage); (US car) any of the separate parts of a train in which the passengers sit\nmajorosl/iStock/Getty Images Plus/Getty Images /GettyImages\n[ U ] US →\ncoach class\nMore examplesFewer examplesThe teachers counted the students as they got on to the coach.The coach has air conditioning and reclining seats.The coach stopped for us to eat lunch but within half an hour we were on our way again.The pick-up point for the long-distance coaches is now in the new bus station.The coach, taking children on a school trip, careered down a slope and collided with a bank.\nSMART Vocabulary: related words and phrases\nBuses, trams & coaches\nbus\nbus captain\nbus conductor\ncharabanc\ncombi\ndeck\ndouble-decker\ngangway\nHOV\njitney\nkombi\nlocal\nminibus\nomnibus\nschool bus\nsingle-decker\nthrough\ntram\ntramlines\ntrolley\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCarriages & carts\nRailways: trains & parts of trains\nAir travel: travelling by aircraft\nB2 to give special classes in sports or a school subject, especially privately, to one person or a small group: She coaches students in French, usually for exams.\nThesaurus: synonyms, antonyms, and examples\nto teach someoneteachShe is teaching me French.instructHis job is to instruct people in the use of the gym equipment.trainShe trains new hairdressers.coachHe coaches young football players.tutorShe tutors students in French.educateHow much does it cost to educate a child privately?\nSee more results »\nto train and organize a sports team: He coached the Blue Devils during their last championship season.\noften disapproving to tell someone what they should say in a particular situation and help them to practise saying it: A criminal defence lawyer alleged that the officer coached a witness to lie. Applicants who have been coached might be able to fool the admissions process. Her interview style seemed so effortless I wondered if she had been coached by media experts.\nMore examplesFewer examplesHe coached the England team for years.She coaches rich kids to pass their exams.She was coaching the basketball team.I've been invited to coach the under-eleven rugby team.His opponents accused him of coaching witnesses on their testimony.Presidential candidates are coached by armies of advisers.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nPreparing\nLies, lying & hypocrisy\nRelated word\ncoaching\nthe cheapest type of seats on a plane or train: Even the company's director flies coach most of the time.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\ncoach noun\n(TEACHER)\nAdd to word list\nAdd to word list\n[ C ] (esp. in sports) a person who is responsible for managing and training a person or a team: a basketball coach\n[ C ] A coach is also an expert who trains someone learning or improving a skill, esp. one related to performing: an acting coach\ncoach noun\n(PART OF VEHICLE)\n[ C/U ] the less expensive sections of an aircraft that most people sit in: [ U ] We were in coach on the flight to Seattle.\n[ C/U ] A coach is also one of the separate parts of a train.\n[ C/U ] A coach is also a kind of old-fashioned vehicle pulled by one or more horses.\n[ C/U ] Br A coach is a bus.\nto be responsible for managing and training a person or a team: [ I/T ] He coached the Giants until 1997.\nAdd to word list\nAdd to word list\nHR, MANAGEMENT someone whose job is to provide training for people or to help prepare them for something: The company has hired a coach to improve our English. See also\nlife coach\nHR, MANAGEMENT to provide training or help prepare someone for something: He offered to coach me for my interview.coach sb in sth We were coached in the best ways to improve our sales figures.\nthe cheapest type of seats on a plane or train: in coach The airline was one of the first to stop serving complimentary meals in coach.\ncoach adverb\nEven the company's director flies coach most of the time."}