{"id":101109,"name":"coaching","type":"noun","us_sound":"ˈkoʊ.tʃɪŋ","us_link":"../audio/c/usco___003.mp3","uk_sound":"ˈkəʊ.tʃɪŋ","uk_link":"../audio/c/ukclutc011.mp3","content":"Add to word list\nAdd to word list\nB2 the act of giving special classes in sports, a school subject, or a work-related activity, especially to one person or a small group: You're very behind in your English - why don't you get some extra coaching? The company provides internet-based coaching for teachers.\nthe act of training and organizing a sports team: Many former football players go into coaching at the end of their playing careers. We wanted Bill to return for next season, but completely understand his decision to retire from coaching. See\ncoach\nMore examplesFewer examplesMornings would be intensive coaching in the core subjects: English, maths, science.Coaching helps people to self-critique and self-regulate their behaviour to achieve the things they want.If you can't afford one-on-one coaching with a swimming expert, then try reading this book.This unique system of coaching has helped a wide variety of players produce phenomenal results.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\ninstruct\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nnon-education\nsocialize\nsocializing\nspecial education\nSRE\nsynchronous\nteach someone a lesson idiom\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\ninvolved in or relating to training and organizing a sports team: Price has impressed the new coaching staff with his attitude. He has every available coaching qualification.\ninvolved in or related to giving special classes in sports, a school subject, or a work-related activity, especially to one person or a small group: Many club coaches are available for private coaching sessions. He is happy to sit through a day-long coaching seminar if it might improve him as a manager.\nMore examplesFewer examplesBrady has a UEFA football coaching badge.He has coached dozens of players throughout his 25-year coaching career.His only preparation was a brief coaching session with the conductor.\nAdd to word list\nAdd to word list\nHR, MANAGEMENT the job or activity of providing training for people or helping to prepare them for something: All our employees have access to expert coaching. His firm provides seminars and one-on-one coaching sessions throughout the country. See also\nlife coaching"}