{"id":101101,"name":"coached","type":"verb","us_sound":"koʊtʃ","us_link":"../audio/c/coach.mp3","uk_sound":"kəʊtʃ","uk_link":"../audio/c/ukclutc010.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncoach\nB2 to give special classes in sports or a school subject, especially privately, to one person or a small group: She coaches students in French, usually for exams.\nThesaurus: synonyms, antonyms, and examples\nto teach someoneteachShe is teaching me French.instructHis job is to instruct people in the use of the gym equipment.trainShe trains new hairdressers.coachHe coaches young football players.tutorShe tutors students in French.educateHow much does it cost to educate a child privately?\nSee more results »\nto train and organize a sports team: He coached the Blue Devils during their last championship season.\noften disapproving to tell someone what they should say in a particular situation and help them to practise saying it: A criminal defence lawyer alleged that the officer coached a witness to lie. Applicants who have been coached might be able to fool the admissions process. Her interview style seemed so effortless I wondered if she had been coached by media experts.\nMore examplesFewer examplesHe coached the England team for years.She coaches rich kids to pass their exams.She was coaching the basketball team.I've been invited to coach the under-eleven rugby team.His opponents accused him of coaching witnesses on their testimony.Presidential candidates are coached by armies of advisers.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nPreparing\nLies, lying & hypocrisy\nRelated word\ncoaching"}