{"id":101354,"name":"coarsening","type":"noun","us_sound":"ˈkɔːrː.sən.ɪŋ","us_link":"../audio/c/cdo1121uscoar0952.mp3","uk_sound":"ˈkɔː.sən.ɪŋ","uk_link":"../audio/c/cdo1121ukcoar0949.mp3","content":"coarsening noun [S or U]\n(LESS POLITE)\nAdd to word list\nAdd to word list\nthe process of becoming simpler and less polite or more offensive, or of making something do this: He deplored what he called the coarsening of television. Many say they have noticed a coarsening of political debate.\nMore examplesFewer examplesTo some, the case was an example of a pervasive coarsening of society.He claims porn is responsible for the coarsening of American culture.At the very least the book contributes to the coarsening of an already debased political debate.The coarsening and degrading of television has been one of the most depressing themes of modern Britain, he says.\nSMART Vocabulary: related words and phrases\nCrude and basic\n101\nat bottom idiom\nbackward\nbackwardly\nbackwardness\nhomespun\ninelegant\ninelegantly\nlow-tech\nMickey Mouse\nrough and ready idiom\nroughly\nroughness\nrudely\nrudeness\nsimplex\nskeletal\nskeletally\nstone-age\nvanilla\nSee more results »\ncoarsening noun [S or U]\n(ROUGHER)\nthe process of becoming rougher or making something rougher: Tanning is the single most ageing thing you can do to your skin, causing fine lines, skin coarsening, even dark circles.\nMore examplesFewer examplesThe symptoms of hypothyroidism can include fatigue, cold intolerance, hair coarsening, and constipation.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncollapse\ncreased\ncrinkle\ncrinkled\nfold\nfurl\ngrooming\ninterfold\nisolator\npucker\npumice stone\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nsmoothen\nSee more results »\ncausing something to become simpler and less polite or more offensive: He declared himself worried about the coarsening effect of reality television.\nMore examplesFewer examplesHe rejected the notion that hip-hop music has had a coarsening effect, saying it \"is the soundtrack that reflects the struggle\" of young people today.From Plato on, political philosophers have taken entertainments seriously, because some kinds of entertainment are coarsening.In truth, managing a business in our competitive society can have a coarsening influence on your character. There is something degrading and coarsening about watching other people having sex, he claims.\nSMART Vocabulary: related words and phrases\nCrude and basic\n101\nat bottom idiom\nbackward\nbackwardly\nbackwardness\nhomespun\ninelegant\ninelegantly\nlow-tech\nMickey Mouse\nrough and ready idiom\nroughly\nroughness\nrudely\nrudeness\nsimplex\nskeletal\nskeletally\nstone-age\nvanilla\nSee more results »"}