{"id":101352,"name":"coarsened","type":"verb","us_sound":"ˈkɔːr.sən","us_link":"../audio/c/coarsen.mp3","uk_sound":"ˈkɔː.sən","uk_link":"../audio/c/ukclutc020.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncoarsen\ncoarsen verb [I or T]\n(ROUGH)\nto become rough or cause something to become rough: In high summer, the salad leaves coarsen and become bitter. He coarsens the paint by mixing it with marble dust.\nMore examplesFewer examplesThe tone of his voice has coarsened and his singing lacks the elegant finesse he once possessed.The voice tends to coarsen when under pressure in higher registers.The facade of the house has lost its render, exposing stones coarsened by age.Sun and time coarsen the skin.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »\ncoarsen verb [I or T]\n(NOT POLITE)\nto become simpler and less polite or more offensive, or to make something do this: Readers' tastes have coarsened, he claims. They feel that the entertainment industry has coarsened our culture.\nMore examplesFewer examplesOften, in the pursuit of the largest audience, television \"dumbs down\" and coarsens.This presentation of extreme violence as entertainment, he says, coarsens our society.He and his allies are seen as having coarsened the political debate.He has been coarsened and corrupted by the world of business.We are all being coarsened by this continual diet of exploitative TV.\nSMART Vocabulary: related words and phrases\nBecoming too excited and easily upset\nado\nant\nantsy\nat the end of your tether idiom\nbe in a whirl idiom\ndemented\nfebrile\nhave ants in your pants idiom\nhave thin/thick skin idiom\nhigh-strung\nhighly strung\nhot under the collar idiom\nhysterical\nlather\novereagerness\noversensitive\noverwrought\nshockable\nslay\nwhirl\nSee more results »"}