{"id":101378,"name":"coast","type":"noun","us_sound":"koʊst","us_link":"../audio/c/coast.mp3","uk_sound":"kəʊst","uk_link":"../audio/c/ukclutc023.mp3","content":"Add to word list\nAdd to word list\nB1 the land next to or close to the sea: Rimini is a thriving resort on the east coast of Italy. The accident happened three miles off the coast (= in the sea three miles from land). We spent a week by/on the coast (= by the sea). coast to coast\n(also coast-to-coast) from one side of the country to the other: We travelled across America coast to coast.\nmainly US (also coast-to-coast) in every part of a country: The visiting politician received coast-to-coast media attention.\nUS informal (also coast-to-coast) in sports such as basketball, from one side of the playing area to the other: He went coast-to-coast to beat them at the buzzer.\nSee more\nMore examplesFewer examplesWe drove down to the windswept Atlantic coast of Portugal.This particular stretch of coast is especially popular with walkers.The boat sailed down the coast.The ship lies off the coast of Spain.Thousands of day trippers flock to resorts on the south coast.\nSMART Vocabulary: related words and phrases\nCoasts & beaches\nbarrier reef\nbeachcomb\nbeachcomber\nbeachcombing\nbeachfront\ncoastal\nesplanade\nfrontage\ngroin\nprom\nriviera\nseafront\nshore\nstrand\nswash\nthe Amalfi Coast\nthe seashore\nthe seaside\ntide pool\ntombolo\nSee more results »\nIdiom\nthe coast is clear\nto move forward in a vehicle without using the engine, usually down a hill: At the top of the hill I switched off the engine and we just coasted down the other side.\nto move down a hill or slope without making any effort : They bought a sled for coasting down the snowy slopes. He watched the racers coasting down a hill as a boy in the 1960s.\nto progress or succeed without any effort or difficulty: While I struggled, my sister coasted through school with top grades.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\nlock\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinter sports\nMaking progress and advancing\ncoast noun [C]\n(LAND)\nAdd to word list\nAdd to word list\nthe land next to or close to the sea: We lived on the southeast coast of Florida. Idioms\ncoast to coast\nthe coast is clear\ncoast verb [I]\n(MOVE EASILY)\n(of a vehicle) to continue moving from its own forward force, without the addition of any power: He coasted to a stop.\nTo coast is also to advance without effort: She coasted through her senior year of high school.\nAdd to word list\nAdd to word list\nthe land next to or close to the sea: The oil spill happened just off the Spanish coast.the east/west coast He grew up on the west coast, in California.\ncoast to coast\nTRANSPORT from one coast of a country or continent to the opposite coast: We travelled across America coast to coast.\nmainly US in every part of a country: Our products are sought after from coast to coast for their accuracy and reliability."}