{"id":101451,"name":"coaxed","type":"verb","us_sound":"koʊks","us_link":"../audio/c/coax.mp3","uk_sound":"kəʊks","uk_link":"../audio/c/ukcoati002.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncoax\nto persuade someone gently to do something or go somewhere, by being kind and patient, or by appearing to be: Perhaps you could coax your father into taking you to the station. A mother was coaxing her reluctant child into the water. a coaxing voice Synonyms\ncajole\ninveigle formal\nwheedle disapproving\nThesaurus: synonyms, antonyms, and examples\nto persuade someone to do somethingpersuadeIf she doesn't want to do it, nothing you say will persuade her.convinceThe lawyer convinced the jury of the man's innocence.talk someone intoShe managed to talk me into going along.talk someone out ofI think I've talked him out of leaving the country.dissuadeI tried to dissuade her from leaving.cajoleHe really knows how to cajole people into doing what he wants.\nSee more results »\nto manage to get something to do something, or something to happen, by being very patient and taking great care: Stem cells are coaxed to grow into a variety of cells to be injected into patients. She coaxed the plane in for the landing.\nMore examplesFewer examplesOfficers helped coax him down from the roof with the assistance of center staff. He has coaxed law enforcement agencies into agreeing to the new protocol.Researchers have coaxed cloned rhesus macaque embryos to grow to the blastocyst stage. Maintaining a proper alkalinity plus frequent wetting and drying cycles can coax soil to retain more carbon dioxide.\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying attention and being careful\nRelated words\ncoaxing\ncoaxinglyPhrasal verb\ncoax something out of someone"}