{"id":101540,"name":"cobra","type":"noun","us_sound":"ˈkoʊ.brə","us_link":"../audio/c/cobra.mp3","uk_sound":"ˈkəʊ.brə","uk_link":"../audio/c/ukcoati013.mp3","content":"Add to word list\nAdd to word list\na poisonous snake from Africa and southern Asia that makes itself look bigger and more threatening by spreading the skin at the back of its head\nMatthijs Kuijpers/Biosphoto/GettyImages\nSMART Vocabulary: related words and phrases\nReptile & amphibian names\nadder\nalligator\namphibia\namphibian\nanaconda\nchameleon\nconstrictor\ncrocodile\nfrog\ngarter snake\nloggerhead\nmamba\nmonitor lizard\nnewt\npeeper\nslowworm\nsnake\nsnakily\nspring peeper\nterrapin\nSee more results »\nabbreviation for Cabinet Office Briefing Rooms: a meeting room or rooms where an emergency committee (= official group) of the British government meets for urgent discussions, or the committee itself: He held talks with security chiefs in the Parliament's emergency briefing room, COBRA, about whether to close the subway network. Chairing the emergency Cobra committee, the Health Secretary said: \"It's crucial we prepare for things getting worse.\" Ministers broke off their holidays to hold an emergency Cobra meeting to discuss the outbreak.\nMore examplesFewer examplesBanning football matches was discussed by the Cobra emergency response committee.The COBRA meeting was told that terrorists had developed the capacity to assemble the bombs. Ministers will take part in mock emergency Cobra meetings and local emergency services will test their response to a potential disaster.\nSMART Vocabulary: related words and phrases\nUK politics: government departments & organizations\nadmiralty\nagency\nbureau\nchancellorship\ndefence\ndrive-by\nForeign and Commonwealth Office\nHMRC\nHMSO\nhome office\nlobby\nMI6\nministry\nmod\nmonolith\nNGO\nsecretariat\nthe CSA\nthe Foreign Office\nthe Treasury\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmergency services in general\nAdd to word list\nAdd to word list\na poisonous snake from Africa or southern Asia that can make itself look bigger by spreading the skin at the back of its head"}