{"id":101920,"name":"coconut","type":"noun","us_sound":"ˈkoʊ.kə.nʌt","us_link":"../audio/c/coconut.mp3","uk_sound":"ˈkəʊ.kə.nʌt","uk_link":"../audio/c/ukcocke013.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a large fruit like a nut with a thick, hard, brown shell covered in fibre (= a mass of thread-like parts) and containing hard, white flesh that can be eaten and a clear liquid: a coconut shell\nAlessandro De Carli/EyeEm/GettyImages\n[ C ] (also coconut palm, coconut tree) the tall tropical tree on which coconuts grow: coconut groves It's a classic Pacific island. There is white sand, and at the edge, coconut trees ring the whole island.\nJassada Wattanaungoon/EyeEm/GettyImages\nB1 [ U ] the white flesh of the coconut, often used in cooking: You can also add coconut to the cookie mix if you like. grated/shredded coconut\nAdam Smigielski/E+/GettyImages\n[ U ] fibres from the outside of a coconut, used as a material: These new boots are actually made from coconut and hemp. They use flooring materials such as coconut, sisal, and jute. Synonym\ncoir\nOsvaldo Hernandez/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesIt's sobering to realize that one of the major killers in the area is having a coconut fall on your head.fruity rum cocktails served in coconut shellsIt was an uninhabited patch of sand not much larger than a football field, with no vegetation except for a few coconut palms.This is like a choice between coconut cake and coconut pie, and I love both.\nSMART Vocabulary: related words and phrases\nTypes of fruit\nackee\nalligator pear\nalpine strawberry\namla\naçaí\ncooking apple\ncopra\ncrab apple\ncranberry\ncucumber\nloquat\nlychee\nmajhool date\nmandarin\nmango\nsalmonberry\nsaskatoon\nsatsuma\nsatsuma plum\nscuppernong\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of evergreen & coniferous tree\nTextiles made from natural fibres\nAdd to word list\nAdd to word list\na large fruit with a hard, brown shell and firm, white, edible flesh, or the white flesh of this fruit, sometimes used in cooking"}