{"id":101980,"name":"code","type":"noun","us_sound":"koʊd","us_link":"../audio/c/code.mp3","uk_sound":"kəʊd","uk_link":"../audio/c/ukcocke019.mp3","content":"code noun\n(COMMUNICATION SYSTEM)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a system of words, letters, or signs used to represent a message in secret form, or a system of numbers, letters, or signals used to represent something in a shorter or more convenient form: The message was written in code. She managed to decipher/break/crack (= succeed in understanding) the code. Each entry in this dictionary has a grammar code.\nMore examplesFewer examplesShe ran her code through the compiler.They cracked the code and read the secret message.The enemy were unable to break the code.We realized that his message was some kind of code.\nSMART Vocabulary: related words and phrases\nCodes & decoding\nbombe\ncipher\ncode word\ncoded\ncryptanalysis\ncrypto\ncryptography\ndecipher\ndecrypt\nencode\nencrypt\nencryption\npasscode\nQR code\nscramble\nscrambler\ntoken\ntokenization\ntokenize\nSee more results »\ncode noun\n(RULES)\nC1 [ C ] a set of rules that are accepted as general principles, or a set of written rules that say how people in a particular organization or country should behave: Clinics will be subject to a new code of conduct and stronger controls by local authorities.\n[ C ] a set of principles that are accepted and used by society or a particular group of people: a moral code a code of behaviour/ethics\nMore examplesFewer examplesThe club has a strict code of conduct.Members must conform to a strict dress code.Most evenings there's a party and the dress code is strict - black tie only.He said he was bound by a scientist's code of ethics.Newspaper editors have agreed a new code of practice on the invasion of privacy.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorality and rules of behaviour\ncode noun\n(COMPUTER)\n[ U ]\n&#160; computing\n&#160; specialized a language used to program (= give instructions to) computers: The children are learning to write code. The problem was fixed with about 150 lines of computer code.\nMore examplesFewer examplesThe application contains more than 609,000 lines of code.We had to rewrite part of the code.The company was required to disclose some of its computer code so that developers could write competing applications.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\ncode noun\n(GENES)\n[ C or U ]\n&#160; biology\n&#160; specialized an arrangement of genetic material in DNA (= the chemical that carries genetic information in cells): Each person's genetic code is unique except in the case of identical twins.\ncode noun\n(TYPE OF LANGUAGE)\n[ C ]\n&#160; language\n&#160; specialized a language or dialect (= a form of a language that people speak in a particular part of a country): People often switch codes depending on the conversational context. He was interested in the linguistic codes of people living on the margins of society. See also\ncode switch\ncode switching\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\n[ T ] to represent a message in code so that it can only be understood by the person who is meant to receive it: The original signal is coded by the scrambler before transmission, and reconstituted into its original form by the receiver.\n[ I or T ]\n&#160; computing\n&#160; specialized to write computer programs (= instructions): My third grade daughter loves learning to code with MIT's amazing (and free) software. I have been learning to code programs.\n[ T ] to mark something, for example with letters, numbers, a name, or a colour, so that you know what type of thing it is: To avoid bias in the laboratory, the samples were coded with numbers rather than names of individuals. Each story in selected bulletins was timed and coded into one of 31 categories for domestic news, while foreign news was separately coded by country. See also\ncolour-coded\nMore examplesFewer examplesColossus to become the first to crack a message coded by the Lorenz cipher machine used by Nazi high command in the second world war.Anyone can learn to code, but the kind of responsibility you need to work from home you have either learned by age 10 or you never will.Explanations given by ten participants were coded independently by three individuals. Both questions were coded by interviewers on a 5-point scale (0 - 4) where 0 was none and 4 was four or more.\nSMART Vocabulary: related words and phrases\nCodes & decoding\nbombe\ncipher\ncode word\ncoded\ncryptanalysis\ncrypto\ncryptography\ndecipher\ndecrypt\nencode\nencrypt\nencryption\npasscode\nQR code\nscramble\nscrambler\ntoken\ntokenization\ntokenize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nIdentifying\nClassifying and creating order\ncode noun\n(SPECIAL LANGUAGE)\nAdd to word list\nAdd to word list\n[ C/U ] a system for representing information with signs or symbols that are not ordinary language, or the signs or symbols themselves: [ U ] Andrew writes computer code. [ C ] Callers punch in four-digit access codes for various topics.\ncode noun\n(PATTERN)\n[ C ]\n&#160; biology us/koʊd/ genetic code\ncode noun\n(RULES)\n[ C ] rules for the way people should behave, or a set of written rules or laws that tell people what to do: Faculty members are expected to follow the school’s honor code. Is there a dress code where you work? Fire codes prohibit locking classroom doors.\nto represent information in a way that is not ordinary language, as with special signs or symbols: Many areas of the brain code and store information. coded adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈkoʊ·dɪd/\nElectronically coded cards are issued to food-stamp recipients.\nAdd to word list\nAdd to word list\n[ C or U ] a set or system of numbers, letters, or signs which is known only to particular people and represents something that is secret: access/security code You need an access code to get into the building.in code The message was written in code.\n[ C ] a system of words, letters, or signs which is used to represent something so that it is easy to know which thing or type of thing it is: product/identification code The FDA Product Code describes a product or a group of products. We will give you a unique code to use when you make a booking.\n[ U ]\n&#160; IT the letters, numbers, words, and symbols used for writing computer programs: computer/digital code Java computer code write/generate/execute code\n[ C ] a set of principles, or a set of rules which state how people in a particular organization, job, etc. should behave: abide by/follow a code All our members follow a strict professional code. He has his own moral code for the way he does business. a code of behaviour/conduct\n[ C, usually singular ]\n&#160; LAW a set of rules or laws: the state's legal code Their aim is to work out a code to end sweatshops. See also\narea code\nauthorization code\nbar code\nbuilding code\nbusiness activity code\nCity Code\ndialling code\ndress code\nerror code\nInternal Revenue Code\nView all\nmachine code\nsort code\nsource code\ntax code\nUniversal Product Code"}