{"id":102064,"name":"coding","type":"verb","us_sound":"koʊd","us_link":"../audio/c/code.mp3","uk_sound":"kəʊd","uk_link":"../audio/c/ukcocke019.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ncode\n[ T ] to represent a message in code so that it can only be understood by the person who is meant to receive it: The original signal is coded by the scrambler before transmission, and reconstituted into its original form by the receiver.\n[ I or T ]\n&#160; computing\n&#160; specialized to write computer programs (= instructions): My third grade daughter loves learning to code with MIT's amazing (and free) software. I have been learning to code programs.\n[ T ] to mark something, for example with letters, numbers, a name, or a colour, so that you know what type of thing it is: To avoid bias in the laboratory, the samples were coded with numbers rather than names of individuals. Each story in selected bulletins was timed and coded into one of 31 categories for domestic news, while foreign news was separately coded by country. See also\ncolour-coded\nMore examplesFewer examplesColossus to become the first to crack a message coded by the Lorenz cipher machine used by Nazi high command in the second world war.Anyone can learn to code, but the kind of responsibility you need to work from home you have either learned by age 10 or you never will.Explanations given by ten participants were coded independently by three individuals. Both questions were coded by interviewers on a 5-point scale (0 - 4) where 0 was none and 4 was four or more.\nSMART Vocabulary: related words and phrases\nCodes & decoding\nbombe\ncipher\ncode\ncode word\ncoded\ncryptanalysis\ncrypto\ncryptography\ndecipher\ndecrypt\nencode\nencrypt\nencryption\npasscode\nQR code\nscramble\nscrambler\ntoken\ntokenization\ntokenize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer programming & software\nIdentifying\nClassifying and creating order"}