{"id":102164,"name":"coeliac","type":"noun","us_sound":"ˈsiː.li.æk","us_link":"../audio/c/cdo0123uscoel0518.mp3","uk_sound":"ˈsiː.li.æk","uk_link":"../audio/c/cdo0123ukcoel0735.mp3","content":"Add to word list\nAdd to word list\n[ C ] a person who has coeliac disease, a medical condition which means they cannot digest gluten (= a substance found in some grains) well: If you are a coeliac, all the dishes marked GF are suitable as they are gluten-free. Coeliacs have to avoid wheat, rye, oats, and barley.\n[ U ] informal short for\ncoeliac disease : It can help to talk to other people with coeliac. The tests showed she had coeliac.\nMore examplesFewer examplesAs my wife is a coeliac, I use a gluten free plain flour. For a coeliac, the menu wasn't great as every dish seemed to feature pasta or pastry. No one else that I know has coeliac.\nSMART Vocabulary: related words and phrases\nDigestive disorders\nachalasia\nacid reflux\nanti-diarrhoea\nanti-diarrhoeal\nAztec two-step\ncolic\ndiarrhoea\ngastritis\ngastro-oesophageal reflux disease\ngastroenteritis\ngastroparesis\ngippy tummy\nGORD\nhyper-catabolism\nIBD\nindigestion\nsprue\nstomach flu\nulcerative colitis\nunexplained gastrointestinal bleeding\nSee more results »\nhaving or relating to coeliac disease, a medical condition which means someone cannot digest gluten (= a substance found in some grains) well: The study looked at a group of coeliac patients. He said he was vegetarian and coeliac.\nanatomy\n&#160; specialized relating to the abdomen (= the lower part of the body containing the stomach, bowels, etc.): There appears to be greater blood flow to the coeliac artery in these patients. The coeliac trunk was located by scrolling down on the CT images.\nMore examplesFewer examplesSince being diagnosed as coeliac, a lot of my favourite breakfast items are off limits.If you have a coeliac relative, be aware of the symptoms.The problem is I'm coeliac, so packet cake mixes tend to be no good.Thanks for all the easy coeliac recipes!\nSMART Vocabulary: related words and phrases\nDigestive disorders\nachalasia\nacid reflux\nanti-diarrhoea\nanti-diarrhoeal\nAztec two-step\ncolic\ndiarrhoea\ngastritis\ngastro-oesophageal reflux disease\ngastroenteritis\ngastroparesis\ngippy tummy\nGORD\nhyper-catabolism\nIBD\nindigestion\nsprue\nstomach flu\nulcerative colitis\nunexplained gastrointestinal bleeding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe human torso\nThe digestive system"}