{"id":102765,"name":"coin","type":"noun","us_sound":"kɔɪn","us_link":"../audio/c/coin.mp3","uk_sound":"kɔɪn","uk_link":"../audio/c/ukcohab015.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a small, round piece of metal, usually silver or copper coloured, that is used as money: UK a 10p/ten pence coin a pound coin gold coins I asked for £10 in 20p coins.\nPando Hall/Photographer's Choice/GettyImages\n[ U ] money in the form of metal coins\nMore examplesFewer examplesThe date on the coin is 1789.We each wanted the bedroom with the balcony, so we tossed a coin to decide.He fished out a coin from his pocket.The captains flipped a coin into the air to decide which side would bat first.UKThe smaller 10 pence coin was introduced in 1992.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\ncoin verb\n(INVENT)\nC2 [ T ] to invent a new word or expression, or to use one in a particular way for the first time: Allen Ginsberg coined the term \"flower power\".\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\ncoin verb\n(MONEY)\ncoining it (in) UK informal\nto be earning a lot of money quickly: Farmers were coining it at that time, thanks to high wheat prices.\nSee more\nIdiom\nto coin a phrase\ncoin noun [C]\n(MONEY)\nAdd to word list\nAdd to word list\na small, flat, round piece of metal used as money, with a number showing its value and often a decorative picture: Let’s flip a coin to see who goes first. He fished about in his pockets, taking out a handful of coins.\ncoin verb [T]\n(INVENT)\nto invent or be the first to use a new word or expression: Kraft coined the term \"middle America\" in the 1960s.\nAdd to word list\nAdd to word list\n[ C ] a small round piece of metal, usually silver or a red-brown colour, which is used as money: a 10p/ten-cent/pound coin I always keep a few coins in the car to pay for parking.in coins He gave me $10, all in coins.\n[ U ] money in the form of metal coins: in coin Thieves stole nearly €300 in coin.\nMONEY to produce money in the form of coins: A new 50 pence piece was coined to commemorate the poet's bicentennial.\ncoin it (in)\nUK informal to earn a lot of money quickly: With prices so high, the major oil companies are coining it as never before. The banks coined it in last year."}