{"id":102951,"name":"cold","type":"adjective","us_sound":"koʊld","us_link":"../audio/c/cold.mp3","uk_sound":"kəʊld","uk_link":"../audio/c/ukcohab027.mp3","content":"cold adjective\n(LOW TEMPERATURE)\nAdd to word list\nAdd to word list\nA1 at a low temperature, especially when compared to the temperature of the human body, and not hot, or warm: a cold day/house cold food/water cold hands cold weather My feet are so cold. It's freezing cold today. You'll feel cold if you don't wear a coat.\nThesaurus: synonyms, antonyms, and examples\nfeeling coldcoldYour hands are cold!feel the coldShe's someone who feels the cold, that's why she's always bundled up.chillyThe sun's gone down and now I feel quite chilly.freezingShut the windows, I'm freezing!frozenMy nose is frozen after that walk - I should have worn a scarf.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving temperature lower than what is comfortablecoldBrr, it's cold outside!bitterWrap up warmly - it's bitter outside!freezingIt's absolutely freezing in here!bitingA biting wind blew in her face as she opened the door.icyAn icy wind whistled across the plain.\nSee more results »\nMore examplesFewer examplesIt's very cold so put a jumper on.\"I'm cold.\" \"Shall I close this window?\"A blast of cold air hit him as he opened the window.We spent the day on the beach but it was too cold to go swimming.I had a cold chicken breast and salad for lunch.\nSMART Vocabulary: related words and phrases\nCold\nArctic\nBaltic\nbitingly\nbitter\nbone-chilling\nbrass\nchilled\ndank\nfrigid\nfrostbite\nfrozen\nisothermal\nisothermally\nkeenness\nminus\noccluded front\nparky\nperished\npiercingly\nwintry\nSee more results »\ncold adjective\n(UNFRIENDLY)\nB1 not showing kindness, love, or emotion and not friendly: His handshake was cold, and his eyes lifeless. He stared into her cold, blue eyes. She would never feel welcome in this city with its cold, unsmiling inhabitants. The school was a cold, unwelcoming place.\nThesaurus: synonyms, antonyms, and examples\nnot liking or being pleasant towards othersunfriendlyThe crowd was unfriendly and dangerous. coolShe was very cool towards his new wife.coldShe's a cold, heartless woman.icyHe gave me an icy stare.glacialHer reception of him was glacial.\nSee more results »\nSMART Vocabulary: related words and phrases\nNot being friendly\nabrasive\nabrasively\nabrasiveness\nabruptly\nabruptness\naloof\nestranged\nestrangement\nflintily\nforbidding\nforbiddingly\nfrigid\ngruff\nremote\nremoteness\nreserved\nreservedly\nsaturnine\nself-contained\nwintry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot showing or feeling emotions\ncold adjective\n(NOT SOLVED)\nIf a case (= a crime or series of events) that is being investigated is cold, it has not been solved and is no longer expected to be solved: The police spared no effort to keep the case from going cold. At the time of his confession, the trail was turning cold, and investigators had given up on ever catching the killer.\nMore examplesFewer examplesTechnically, the Ramsey case is considered \"cold\", even after new technology discovered two new samples of DNA. The last credible sighting of the terrorist was more than a year ago and intelligence sources say the trail is cold.Denver police and the district attorney's office insist the case has not gone cold, but they won't provide details about the investigation.In a case that has since grown cold, investigators have never found the package suspected of contaminating the building.Cops and journalists are on an increasingly cold trail that stretches back for decades.\nSMART Vocabulary: related words and phrases\nDetection & solving crimes\nall-points bulletin\nankle bracelet\nankle tag\nANPR\nAPB\nfingertip search\nforensic\nforensically\nforensics\ngumshoe\nprofiling\npsychological profile\npsychological profiling\nradar trap\nraid\nsupersleuth\nsurveil\ntighten\ntighten the net idiom\ntracker dog\nSee more results »\nRelated word\ncoldnessIdioms\nbe (as) cold as ice\nbe cold comfort\ncold hands, warm heart\nget cold feet\nin cold blood\nin the cold light of day\npour/throw cold water on something\nyou're getting colder\ncold noun\n(ILLNESS)\nA2 [ C ] a common infection, especially in the nose and throat, that causes you to cough and sneeze and your nose to run (= drip liquid) or feel blocked: I've got a cold. She caught a cold at school.UK informal Don't come near me - I've got a stinking/streaming cold (= extremely bad cold).\nSMART Vocabulary: related words and phrases\nColds & flu\nanti-flu\navian flu\nbunged up\ncatarrh\nchesty\nchill\ncongested\ncongestion\ncough\nflu\nfrog\ninfluenza\nmincemeat\nrunny\nsneeze\nsniffle\nsnuffle\nstuffed up\nswine flu\nthe common cold\nSee more results »\ncold noun\n(LOW TEMPERATURE)\nB1 [ S or U ] cold weather or temperatures: Don't stand out there in the cold, come in here and get warm. Old people tend to feel the cold (= feel uncomfortable in cold temperatures) more than the young. My feet were numb with cold.\nSMART Vocabulary: related words and phrases\nCold\nArctic\nBaltic\nbitingly\nbitter\nbone-chilling\nbrass\nchilled\ndank\nfrigid\nfrostbite\nfrozen\nisothermal\nisothermally\nkeenness\nminus\noccluded front\nparky\nperished\npiercingly\nwintry\nSee more results »\ncold adjective [-er/-est only]\n(LOW TEMPERATURE)\nAdd to word list\nAdd to word list\nhaving a low temperature, esp. when compared to the temperature of the human body, and not hot or warm: cold weather I forgot my gloves and my hands are getting cold.\ncold adjective [-er/-est only]\n(UNFRIENDLY)\nnot showing or influenced by affection, kindness, or feeling; not friendly: a cold greeting/reception Idioms\ncold turkey\nget cold feet\nin cold blood\ncold noun\n(ILLNESS)\n[ C ] a common infection, esp. in the nose and throat, which often causes you to sneeze and cough, to feel tired, and sometimes to have pain in the muscles: I’m afraid I’m catching a cold.\ncold noun\n(LOW TEMPERATURE)\n[ U ] The cold is cold temperature or cold weather: Don’t stand out there in the cold – come in here and get warm."}