{"id":103130,"name":"collar","type":"noun","us_sound":"ˈkɑː.lɚ","us_link":"../audio/c/collar.mp3","uk_sound":"ˈkɒl.ər","uk_link":"../audio/c/ukcoley017.mp3","content":"Add to word list\nAdd to word list\nB1 the part around the neck of a piece of clothing, usually sewn on and sometimes made of different material: a shirt collar a fur collar a dress with a big collar See also\nblue-collar\npink-collar mainly US\nwhite-collar\nFotoMaximum/iStock/Getty Images Plus/GettyImages\nB2 a strap made of leather or other strong material that is put around the neck of an animal, especially a dog or cat: I grabbed the dog by the collar and dragged it out of the room.\nDifydave/iStock/Getty Images Plus/GettyImages\na type of necklace (= a piece of jewellery worn around the neck): a diamond collar\nksushsh/iStock/Getty Images Plus/GettyImages\nbiology\n&#160; specialized an area around the neck of an animal that is coloured differently from the other parts of the body: The bird has grey feathers with a lighter collar.\nengineering\n&#160; specialized a strip of strong material that is put around a pipe or a piece of machinery to make it stronger or to join two parts together\nMore examplesFewer examples\"Is that real fur on your collar?\" \"Certainly not - I only wear fake fur.\"This jacket has a removable collar.I'm very fond of this shirt but it's starting to wear at the collar.\nSMART Vocabulary: related words and phrases\nParts of clothes\narmhole\nbodice\ncap sleeve\nclerical collar\ncowl neck\ndart\nknee\nlapel\nneckband\nneckline\npatch pocket\npeplum\nslash\nspaghetti strap\nsweetheart neckline\ntuck\nturn up (somewhere)\nturtleneck\nV-neck\nwaist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine\nBands, straps and strips\nJewelry\nMiscellaneous animal body parts\ncollar verb [T]\n(PUT COLLAR ON)\nto put a strap or device around an animal's neck, for example as a way of controlling it, or discovering or recording where it goes: The family dog is collared, leashed and taken for a walk. Researchers began trapping and collaring black bears in order to track their movements.\nMore examplesFewer examplesIn the study, 35 sheep were collared so that researchers could locate an animal when it died and determine the cause of death.Methods for tracking bear populations include sedating them with darts and tagging or collaring them.The proposed cougar research project initially calls for capturing and collaring six mountain lions.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nbiophysics\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\npolymorphism\nprimary producer\nprimitively\nprokaryote\npseudopod\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScientific techniques\ncollar verb [T]\n(CATCH)\ninformal to find someone and stop them in order to talk to them: A reporter collared her on her way to the gym. I was collared by Pete as I was coming out of the meeting this morning.\ninformal to catch or arrest someone such as a criminal: He is known as the detective who collared a serial killer. She was collared by the police at the airport.\nThesaurus: synonyms, antonyms, and examples\nto find and take a person who has done something wrongcatchThey were caught trying to smuggle cigarettes across the border.arrestHe was arrested on suspicion of causing criminal damage to property.place/put under arrestThe suspect was placed under arrest and charged with armed assault.captureThe soldiers were captured by enemy forces.apprehendThe police have apprehended two individuals in connection with the crime.nabThe cops nabbed him as he tried to get away.\nSee more results »\ninformal to get something for yourself: He somehow managed to collar all the credit for other people's work. The Treasury collars billions in tobacco duty every year.\nMore examplesFewer examplesShe noticed the door wasn't locked and collared a security guard to tell him to fix it.He spotted a local politician who he had been waiting to collar about problems in the area.The victim and two bystanders joined together to collar the thief.He got collared selling drugs.Reporters raced to collar interviews with campaign spokespeople.\nSMART Vocabulary: related words and phrases\nInterrupting & preventing from speaking\nbarge\nbelt up\nblurt something out\nbreak someone in\nchime\nchip\nchip (something) in\nhorn in\ninterpolation\ninterrupt\nmike check\nmuzzle\nnobble\nnot get a word in edgeways idiom\nobtrude\nput a sock in it! idiom\nshut your mouth/face idiom\nspeak\nstrike\nwaylay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCapturing or taking possession of things\nArresting & charging\nGetting, receiving and accepting\ncollar noun [C]\n(NECK)\nAdd to word list\nAdd to word list\nthe part of a piece of clothing that goes around the neck\nA collar is also a narrow piece made of leather or other strong material that is put around the neck of an animal, esp. a dog or cat kept as a pet.\ncollar verb [T]\n(CATCH)\nto catch and hold someone so that the person can’t escape: fig. We decided to skip the meeting but she collared us in the hotel lobby."}