{"id":103224,"name":"college","type":"noun","us_sound":"ˈkɑː.lɪdʒ","us_link":"../audio/c/college.mp3","uk_sound":"ˈkɒl.ɪdʒ","uk_link":"../audio/c/ukcoley030.mp3","content":"college noun\n(EDUCATION)\nAdd to word list\nAdd to word list\n[ C or U ] US a university where you can study for an undergraduate (= first) degree: I met my husband when we were in college. They want their kids to go to (= study at) college. a college student/professor/graduate\nA2 [ C or U ] any place for specialized education after the age of 16 where people study or train to get knowledge and/or skills: a teacher training college a secretarial college a Naval college She's at art college.UK a sixth form college\n[ C ] one of the separate and named parts into which some universities are divided: King's College, Cambridge I attended the College of Arts and Sciences at New York University. Cambridge has some very fine old colleges (= college buildings).\n[ C ] in Britain and Australia, used in the names of some schools for children, especially private schools (= where education is paid for by parents): Cheltenham Ladies' College\nMore examplesFewer examplesWe were taught painting and drawing at art college.In our third year at college everyone had to do a special project.Many colleges and universities now offer modular degree courses.She lectures in education at the teacher training college.I studied modern European history at college.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\ngraduate\nhall\nhall of residence\nOxbridge\nOxon\nPanhellenic\npass degree\npoly\nthe groves of academe idiom\nuni\nuniversity\nunselective\nvice chancellor\nwarden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of school\ncollege noun\n(GROUP)\n[ C ] a group of people with a particular job, purpose, duty, or power who are organized into a group for sharing ideas, making decisions, etc.: the Royal College of Medicine/Nursing\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nAdd to word list\nAdd to word list\na place of higher education usually for people who have finished twelve years of schooling and where they can obtain more advanced knowledge and get a degree to recognize this\nA college is also one of the separate parts into which some universities are divided: She graduated from the university’s College of Business Management."}