{"id":103129,"name":"collapsing","type":"verb","us_sound":"kəˈlæps","us_link":"../audio/c/collapse.mp3","uk_sound":"kəˈlæps","uk_link":"../audio/c/ukcoley014.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ncollapse\ncollapse verb\n(FALL)\nB2 [ I ] to fall down suddenly because of pressure or having no strength or support: Thousands of buildings collapsed in the earthquake. The chair collapsed under her weight.figurative He thought his whole world had collapsed when his wife died.\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nB2 [ I ] If someone collapses, they fall down because of being sick or weak: He collapsed and died of a heart attack.\n[ I or T ] to fold something into a smaller shape, usually so it can be stored, or (especially of furniture) to fold in this way: All chairs collapse for easy storage.\nMore examplesFewer examplesIt looks as if the whole political edifice of the country is about to collapse.I should think you're about ready to collapse after all that walking.The building's foundations are rather shaky, and it could collapse at any time.At the end of the race his legs gave out and he collapsed on the ground.The woman staggered and collapsed in a heap.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing consciousness\nMaking things more or less smooth or straight\ncollapse verb\n(FAIL)\nC2 [ I ] (of people and business) to suddenly be unable to continue or work correctly: Lots of people lost their jobs when the property market collapsed. Talks between management and unions have collapsed. Share prices collapsed (= became lower suddenly) after news of poor trading.\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nMore examplesFewer examplesThe company is staggering under a $15 million debt and will almost certainly collapse by the end of the year.Things have gone badly for him since his business collapsed.All charges against them were withdrawn after the prosecution's case collapsed.The talks have collapsed and both sides have resorted to brinkmanship.She'd invested extensively in stocks and got her fingers burned when the market collapsed.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business"}