{"id":103124,"name":"collapse","type":"verb","us_sound":"kəˈlæps","us_link":"../audio/c/collapse.mp3","uk_sound":"kəˈlæps","uk_link":"../audio/c/ukcoley014.mp3","content":"collapse verb\n(FALL)\nAdd to word list\nAdd to word list\nB2 [ I ] to fall down suddenly because of pressure or having no strength or support: Thousands of buildings collapsed in the earthquake. The chair collapsed under her weight.figurative He thought his whole world had collapsed when his wife died.\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nB2 [ I ] If someone collapses, they fall down because of being sick or weak: He collapsed and died of a heart attack.\n[ I or T ] to fold something into a smaller shape, usually so it can be stored, or (especially of furniture) to fold in this way: All chairs collapse for easy storage.\nMore examplesFewer examplesIt looks as if the whole political edifice of the country is about to collapse.I should think you're about ready to collapse after all that walking.The building's foundations are rather shaky, and it could collapse at any time.At the end of the race his legs gave out and he collapsed on the ground.The woman staggered and collapsed in a heap.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\ntrip\nwayside\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing consciousness\nMaking things more or less smooth or straight\ncollapse verb\n(FAIL)\nC2 [ I ] (of people and business) to suddenly be unable to continue or work correctly: Lots of people lost their jobs when the property market collapsed. Talks between management and unions have collapsed. Share prices collapsed (= became lower suddenly) after news of poor trading.\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nMore examplesFewer examplesThe company is staggering under a $15 million debt and will almost certainly collapse by the end of the year.Things have gone badly for him since his business collapsed.All charges against them were withdrawn after the prosecution's case collapsed.The talks have collapsed and both sides have resorted to brinkmanship.She'd invested extensively in stocks and got her fingers burned when the market collapsed.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\ncollapse noun\n(FAILURE)\nB2 [ C or U ] the sudden failure of a system, organization, business, etc.: I don't know what caused the collapse of her marriage. A poor economy has caused the collapse of thousands of small businesses. Negotiations between the two countries are on the brink/verge of collapse (= very soon going to fail). He suffered a mental/nervous collapse after ten years' teaching.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not being successfulfailureFailure is not an option.breakdownThe complete breakdown of local infrastructure left residents without water or electricity.meltdownThe markets experienced a meltdown at the news of the sale. collapseThe car manufacturer's collapse left the region's economy in tatters. failHe tried to sing the anthem, but it was an epic fail.\nSee more results »\nMore examplesFewer examplesThe collapse of the company was described as the greatest financial debacle in US history.The collapse of Communism changed East-West relations for ever.The company is on the edge of collapse.The collapse of its rivals brought fortuitous gains to the company.The collapse of the bank is an ominous reminder of the fragility of the world's banking system.\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\ncollapse noun\n(FALL)\n[ S or U ] the sudden falling movement of a person or structure that has become too weak to stand: He was taken to hospital after his collapse on the pitch. the collapse of a building during the earthquake\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\ntrip\nwayside\nSee more results »\ncollapse verb\n(FALL)\nAdd to word list\nAdd to word list\n[ I/T ] to fall down suddenly, or to cause to fall down: [ I ] A piece of the wall collapsed on top of him.\ncollapse verb\n(FAIL)\n[ I ] to be unable to continue or to stay in operation; fail: Talks between management and unions collapsed today.\nan inability to continue or to stay in operation: [ U ] the collapse of the Soviet empire\nCollapse can also refer to an attack of extreme physical weakness or unconsciousness in a person: [ U ] Toward the end of the race he was near collapse.\nAdd to word list\nAdd to word list\nto suddenly fail or become unable to continue: the system/economy/government, etc. collapses Without computers the whole economic system would collapse.a company/bank/industry, etc. collapses The bank collapsed after an alleged massive fraud. talks/negotiations collapse\nFINANCE to suddenly fall to a much lower level: prices/shares collapse Share prices collapsed after news of poor trading. Construction jobs were lost as the property market collapsed.\nthe sudden failure of a system, organization, business, etc.: A poor economy has caused the collapse of thousands of small businesses.on the brink/verge of collapse Negotiations between the two companies are on the brink of collapse\nFINANCE a sudden fall to a much lower level: the collapse of the American real estate marketa price/market collapse Did options accelerate the oil price collapse?"}