{"id":103193,"name":"collection","type":"noun","us_sound":"kəˈlek.ʃən","us_link":"../audio/c/collection.mp3","uk_sound":"kəˈlek.ʃən","uk_link":"../audio/c/ukcoley025.mp3","content":"collection noun\n(THINGS TOGETHER)\nAdd to word list\nAdd to word list\nB1 [ C ] a group of objects of one type that have been collected by one person or in one place: a private art collection a valuable stamp collection\n[ C ] an amount of money collected from several people, or the act of collecting money: We're having a collection for Tom's retirement present.\nB1 [ C ] a lot of things or people: There's quite a collection of toothbrushes in the bathroom.\n[ C ] a range of new clothes produced by one clothes designer: Kenzo's summer/winter collection\nMore examplesFewer examplesThere's an Egyptian art collection on display at the museum at the moment.Rosie has a massive collection of furry toys.The curator guided us round the gallery, pointing out the most famous paintings in the collection.Her latest fashion collection features shimmering iridescent materials.Rachel bought yet another pair of shoes to add to her collection.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPayment methods\nAmounts of money\nFashion\ncollection noun\n(GETTING)\nB2 [ C or U ] the act of taking something away from a place: The photos will be ready for collection on Tuesday afternoon. Which day is the rubbish collection?UK There are three collections a day from the post box on the corner.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\nAdd to word list\nAdd to word list\nmoney that people give for a special purpose, a person in need, or an organization: We’re taking (up) a collection for his retirement gift (= getting money from people who want to give it).\nAdd to word list\nAdd to word list\n[ C or U ] the act or job of taking something away from a place: We will inform you when your goods are ready for collection.refuse/waste collection Which public authority is responsible for waste collection?\n[ C or U ]\n&#160; FINANCE the activity of collecting money that is owed, or the money collected: debt/rent/tax collection Last week, the state reported that tax collections are up 11.5% for this fiscal year. I get involved with finance and rent collection.\n[ C or U ]\n&#160; BANKING the act of arranging for the amount written on a cheque to be paid out of a bank account: The Federal Reserve Banks provide check collection services to depository institutions.\n[ U ] the process of bringing information together from different places: We make software and bar-code products for data collection.\n[ C ] a group of objects that someone has collected as a hobby or investment: an antiques/book/coin, etc. collection See also\ndocumentary collection"}