{"id":103553,"name":"colonization","type":"noun","us_sound":"ˌkɑː.lə.nəˈzeɪ.ʃən","us_link":"../audio/c/eus70885.mp3","uk_sound":"ˌkɒl.ə.naɪˈzeɪ.ʃən","uk_link":"../audio/c/ukcolle025.mp3","content":"Add to word list\nAdd to word list\nthe act or process of sending people to live in and govern another country: European colonization of the Americas, with its cycle of war, disease and slavery, decimated the indigenous peoples. He sang mainly about the colonisation of his country by Portugal. He predicts that humans will land on Mars within a few years, paving the way for human colonisation of the solar system. Compare\ndecolonization\nrecolonization\nthe act or process of animals, plants, or bacteria starting to live or grow in a particular area: The soil is dry and strongly saline, making it unattractive for plant colonization. One way of reducing skin colonisation by bacteria is to put antiseptic around the wound site.\nusually disapproving the act or process of filling a place or taking control of an area of activity: the colonization of personal computers by adware Related word\ncolonize\nMore examplesFewer examplesJuan de Oñate initiated the Spanish colonization of New Mexico in 1598.Asante was unable to prevent European colonization.Russian conquest and colonisation of Siberia gathered force by the middle of the eighteenth century. He estimates that it would take around $50 billion to fund a full-scale Mars colonization project.Mushrooms grow well on sawdust because the abundant surface area between particles provides easy opportunities for colonization.He describes the bacterial colonisation process. The artificial reef offers an ideal environment for the colonisation of fish and colourful corals.We are strongly opposed to any religious colonization of public education.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncommonwealth\ncondominium\ncrown colony\ndecolonization\ndecolonize\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal & plant biology - general words\nAnimal dwellings - natural\nBacteria, moulds, germs & viruses\nControlling and being in charge"}