{"id":103556,"name":"colonize","type":"verb","us_sound":"ˈkɑː.lə.naɪz","us_link":"../audio/c/colonize.mp3","uk_sound":"ˈkɒl.ə.naɪz","uk_link":"../audio/c/ukcolle026.mp3","content":"Add to word list\nAdd to word list\n[ T ] to send people to live in and govern another country: Peru was colonized by the Spanish in the 16th century. European nations set about violently invading and colonising large chunks of the globe. Some scientists believe that we will have to colonise other planets. Compare\ndecolonize\nrecolonize\n[ I or T ] (of animals, plants, or bacteria) to start to live or grow in a particular area: The beetles colonise a tree, tunnelling through the bark to lay eggs. The ceilings of the caves had been colonized by bats. Left alone, domestic cats quickly colonize, breed and become wild. The bacterium can colonise in the nose, throat, and skin without causing infection.\n[ T ] usually disapproving to fill a particular place or take control of a particular area of activity: The city centre has been colonized by coffee shop chains.\nMore examplesFewer examplesBelize was colonised by the British.The image shows a colonizing ship sailing toward the new world.She imagines a future in which humans have colonised the solar system.The bacteria have a unique ability to colonize the human stomach. This invasive species of algae has colonised the Atlantic coast of Europe. Mussels can significantly affect a boat's performance if they colonize on its hull.This part of Florida has been colonised by elderly retirees.They colonized our minds by sending us to their schools.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncommonwealth\ncondominium\ncrown colony\ndecolonization\ndecolonize\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal dwellings - natural\nAnimal & plant biology - general words\nBacteria, moulds, germs & viruses\nControlling and being in charge\nRelated word\ncolonization"}