{"id":103715,"name":"colourist","type":"noun","us_sound":"","us_link":"","uk_sound":"","uk_link":"","content":"colourist noun [C]\n(ARTIST)\nAdd to word list\nAdd to word list\nan artist who uses colour in a skilful or special way: As a colourist, the painter has no English rivals. This is a fine piece which amply demonstrates her brilliance as a colourist.\nsomeone who adds colour to the drawings for a comic, graphic novel, or animation (= a book or film whose story is told in pictures): His pencilling was obscured by an inker and a colourist. Compare\ninker\nletterer\npenciller\nsomeone who adds colour to a film, especially one made in black and white: As a colourist, he has the ability to add colour and contrast to an old film clip that looks dull and washed-out.\nMore examplesFewer examplesPeople forget that Picasso was a brilliant draughtsman, composer, and colourist. The sense of depth in this panoply of reds astonishes, testament to Richter's skills as a colourist. Leonardo is regarded as a draughtsman rather than a colourist.He is a renowned comic-book colourist with a fine-art degree and background in photography.\nSMART Vocabulary: related words and phrases\nArtists\nagent\nanti-modernist\nartist\ncalligrapher\ndraughtsman\ndraughtswoman\netcher\nexpressionist\ngraphic designer\nmaximalist\nminimalist\nmodernist\nmosaicist\npainter\nsidewalk artist\nsketcher\nstructuralist\nsuperagent\nsurrealist\nthe avant-garde\nSee more results »\ncolourist noun [C]\n(HAIR)\nsomeone whose job is to change the colour of people's hair: Michelle's colourist opted for a mix of golden brown and natural dark brown. She was a colourist at a London hair salon.\nMore examplesFewer examplesColoured hair can change in the sun so let your colourist know if you're planning to go away. Colourist Maria added golden lights to add texture and movement to her hair.\nSMART Vocabulary: related words and phrases\nHairdressing\nbarber's pole\nbewigged\nbraid\ncornrow\ndip dye\nfoil\ngel\nhairdressing\nhairstylist\nhenna\nhighlight\nloose\nlowlight\nplait\nscalp\ntexture\ntint\ntonsorial\ntrim\nwigged\nSee more results »"}