{"id":103695,"name":"colour","type":"noun","us_sound":"ˈkʌl.ɚ","us_link":"../audio/c/color.mp3","uk_sound":"ˈkʌl.ər","uk_link":"../audio/c/ukcolor007.mp3","content":"colour noun\n(APPEARANCE)\nAdd to word list\nAdd to word list\nA1 [ C or U ] red, blue, green, yellow, etc.: What's your favourite colour? She wears a lot of bright colours. What colour are your eyes?in a colour Does the shirt come in any other colour? I like rich jewel colours, such as purple, blue, and green.in colour Are the photos in colour or black and white?\n[ U ] the pleasant effect of a bright colour or of a lot of colours together: I think we need a bit of colour in this room. Red and yellow peppers give a little colour to the sauce.ablaze with colour literary The whole garden was ablaze with colour (= full of different bright colours).a riot of colour literary The whole garden was a riot of colour (= full of different bright colours).\n[ C ] a substance, such as a paint or dye, that you add to something to give it a particular colour: colour runs I put my new green shirt in a hot wash and the colour ran (= the colour came out of the material).\n[ U ] a pink colour in someone's face, often showing good health or showing feelings such as embarrassment or excitement: colour drains from I watched the colour drain from her face as she heard the news. She has a high colour (= the natural colour of her face is red). put some colour in someone’s cheeks\nto cause someone who has been ill to look more healthy, especially by doing exercise: That walk has put some colour in your cheeks.\nSee more\nMore examplesFewer examplesThey painted the kitchen in bold colours - crimson, purple, and blue.She looks best in bright, vibrant colours, like red and pink.The dress is available in a choice of colours.I can't decide what colour to paint the walls.The colour red is used to denote passion or danger.\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaints, dyes & pigments\nThe skin, & skin colour\ncolour noun\n(INTEREST)\nC2 [ U ] interesting or exciting qualities or details: We added your story for a bit of local colour. Michael was there so that added a bit of colour to the evening's proceedings.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\ncolour noun\n(RACE)\nC2 [ C or U ] the natural colour of a person's skin which shows which race they belong to: She felt she had not been given the job because of her colour. There should be no discrimination on the grounds of colour. of colour\nused to describe people who do not consider themselves to be white: a literary prize to encourage writers of colour We value the contributions made by our colleagues of colour. See also\nperson of colour\nwoman of colour\nman of colour\nMore examplesFewer examples He helped make it possible for actors of colour today to be cast in roles without regard to their race.Our study looked at achievement among economically disadvantaged students and students of colour.\ncolour noun\n(SYMBOL)\ncolours [ plural ]\n(at school, college, or university) an honour given to people who have been chosen for a sports team, often represented by a special symbol on a shirt or tie: colours for She was awarded her colours for hockey/her hockey colours at the end of term.\nthe official flag of a country, ship, or military group: regimental colours\nSMART Vocabulary: related words and phrases\nPrizes, rewards and medals\n(the/a pot of gold at) the end of the rainbow idiom\nAcademy Award\naward\nbemedalled\nblue ribbon\nbooby prize\nbronze\ngong\ngrab bag\nGrammy\nhand something out\nhonour\nOscar\nplatinum disc\nprize\nPulitzer Prize\nstake\nthe golden boot\nthe wooden spoon\nVC\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlags\nIdioms\nsee someone's true colours\nshow someone in their true colours\nColour television, photography, or printing shows things in all their colours, not just in black and white.\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\ncolour verb\n(BECOME A COLOUR)\nA1 [ I or T ] to become a particular colour, or to make something a particular colour: Do you think he colours his hair? He drew a heart and coloured it red. Fry the onions till they start to colour.\n[ I ] to become red in the face because you are embarrassed\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\ncolour verb\n(INFLUENCE)\nC2 [ T often passive ] If something colours your opinion of something, it influences your opinion in a negative way: I'm sure my views on marriage are coloured by my parents' divorce. I'm trying not to let my judgment be coloured by that one incident.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nPhrasal verb\ncolour something in"}