{"id":103831,"name":"column","type":"noun","us_sound":"ˈkɑː.ləm","us_link":"../audio/c/column.mp3","uk_sound":"ˈkɒl.əm","uk_link":"../audio/c/ukcolor019.mp3","content":"column noun [C]\n(PRINTING)\nAdd to word list\nAdd to word list\nB2 one of several vertical blocks of print into which a page of a newspaper or magazine is divided: I didn't have time to read the whole article - just the first column.\nOleksandr Hruts/iStock/Getty Images Plus/GettyImages\na piece of writing in a newspaper or magazine, usually on a particular subject, that is always written by the same person and appears regularly: She writes a weekly fashion/gossip column for the Evening Standard.\nC1 any vertical block of words or numbers: Add the column of figures and divide the sum by three.\nMore examplesFewer examplesShe wrote into an agony column.She uses her newspaper column to expound her views on environmental issues.I looked quickly down the column of figures.Look carefully at these questions and mark your answers down in the right-hand column.Tens go in the left-hand column and units in the right.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony column\nagony uncle\ncover story\ndateline\ndouble-page\ndouble-page spread\neditorial\nfiller\nleader\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\npullout\nsplash\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: printing & word processing\ncolumn noun [C]\n(BUILDING)\nB2 a tall, vertical stone post, used as a support for a roof or in classical buildings (= in the style of ancient Greece or Rome) for decoration, or standing alone as a monument (= a symbol of respect for a special person or event): The roof of the temple was held up by a row of thick stone columns. Nelson's Column in Trafalgar Square See also\nspinal column\nGreg Pease/Photographer's Choice/GettyImages column of something\nsomething with a tall, narrow shape: A column of smoke rose from the chimney.\nSee more\na line of moving people or vehicles: a column of refugees Tanks led the column into enemy territory.\nMore examplesFewer examplesThe central twelve-foot column is surmounted by a bronze angel with outspread wings.The vertebral column surrounds and protects the spinal cord.Could you recognize a Grecian column?The entrance porch is supported by a row of majestic columns.\nSMART Vocabulary: related words and phrases\nParts of buildings: arches, columns & beams\nabutment\narch\narchitrave\narchway\nbeam\nbeamy\ncapital\ncolonnade\nDoric\nionic\njoist\nkeystone\npedestal\nportico\nsoffit\ntorus\nvault\nvaulted\nvaulting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings collected in lines or rings\ncolumn noun [C]\n(BUILDING)\nAdd to word list\nAdd to word list\na tall, vertical post used as a support for the roof of a building or for decoration\nA column is also anything or any set of things having a long, narrow shape: a column of soldiers a column of smoke\ncolumn noun [C]\n(PRINTING)\none of several vertical blocks of print into which a page of a newspaper or magazine is divided: The article filled two columns.\nA column is also a piece of writing in a newspaper or magazine that is written by the same person and appears regularly, usually on a particular subject: a column on sports\nA column is also any vertical block of words or numbers: a column of figures\nAdd to word list\nAdd to word list\na vertical block of printed text on a page of a newspaper or magazine: The article appears in the second column on page two.\na piece of writing in a newspaper or magazine which is always written by the same person and appears regularly, usually on a particular subject: She continued to write her column until shortly before her death.\nGRAPHS &amp; CHARTS, ACCOUNTING a vertical block of words or numbers: Reading from left to right, the first four columns depict transactions with customers."}