{"id":103958,"name":"combine","type":"verb","us_sound":"kəmˈbaɪn","us_link":"../audio/c/combine_01_00.mp3","uk_sound":"kəmˈbaɪn","uk_link":"../audio/c/ukcombi001.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to (cause to) exist together, or join together to make a single thing or group: None of us has much money so let's combine what we've got. Sickness, combined with (= together with) terrible weather, contrived to ruin the trip. The two countries combined against their common enemy. [ + to infinitive ] These normally harmless substances combine to form a highly poisonous gas.\n[ T ] If someone combines two or more qualities, they have both of those qualities: As a writer, he combined wit and/with passion.\n[ T ] to do two activities at the same time: She manages to successfully combine family life and/with a career.\nMore examplesFewer examplesDo you know why they've decided to combine the two departments?She manages to combine a sharp mind with a sympathetic manner.Government bonds are a sound investment because they combine good profits and high security.The dress combines stylish lines with an attractive floral print for a classically feminine look.As a songwriter, he combined a natural linguistic talent with an ear for a tune.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconvergence\ncor\ncross-Channel\ncumulate\ndesegregate\njunction\nkludge\nknit\nknock\nknock through something phrase\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMixing and mixtures\nHaving and owning - general words\nActing and acts\ncombine noun\n(GROUP)\n[ C, + sing/pl verb ] a group of people or organizations acting together in business: a Japanese industrial combine\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\ncombine noun\n(MACHINE)\n[ C ] (also combine harvester) a large farming machine that cuts the plant, separates the seed from the stem, and cleans the grain as it moves across a field\nEdwin Remsberg/The Image Bank/GettyImages\nSMART Vocabulary: related words and phrases\nFarm vehicles & equipment\nall-terrain vehicle\nATV\nbinder\nCaterpillar tractor\ngoad\nharrow\nharvester\nmilking machine\nplanter\nplough\nploughshare\nreaper\nscarecrow\nseeder\nsifter\nsorter\nspreader\ntractor\nyoke\nAdd to word list\nAdd to word list\nto unite or to join together to make a single thing or group: [ T ] None of us has much money so let’s combine what we’ve got. [ + to infinitive ] When hydrogen and oxygen molecules combine to form water, heat and electricity are produced.\nIf you combine two activities, you do both at the same time: [ T ] She manages to successfully combine motherhood and a career.\na group of people or organizations acting together: Over the years they established a large media combine.\nAdd to word list\nAdd to word list\n[ I or T ] to join together in order to make a single thing or group, or to join things together in this way: They have a much better chance of success if they combine forces.combine with sth It was the first time in Britain that a concrete producer had combined with a cement manufacturer.\n[ I or T ] to join together to have a particular effect, or to join things together in this way: combine with sth The burden of bad loans has combined with government foot-dragging to slow the pace of modernization.combine sth with sth He said the plan should be combined with tax cuts, including a reduction in business rates.\n[ T ] to have two different parts or qualities: combine sth with sth The supercentre combines a traditional store with a full-service grocery section.combine sth and sth This is the beer that best combines good taste and a low calorie count.\na group of people or organizations that work together in business: The acquisition would create a combine publishing five of the six national daily newspapers in the Netherlands."}