{"id":103946,"name":"combination","type":"noun","us_sound":"ˌkɑːm.bəˈneɪ.ʃən","us_link":"../audio/c/combination.mp3","uk_sound":"ˌkɒm.bɪˈneɪ.ʃən","uk_link":"../audio/c/ukcolor029.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the mixture you get when two or more things are combined: Strawberries and cream - a perfect combination. A combination of tiredness and boredom caused me to fall asleep. This drug can be safely used in combination with other medicines. Her experience and energy are a winning combination (= a successful mixture) in business.\n[ C ] an arrangement in a particular order: From the letters X Y Z, we can get three combinations of two letters: XY, XZ, and YZ.\n[ C ] a set of letters or numbers in a particular order that can be used to open some types of locks: He forgot the combination for his bike lock.\nMore examplesFewer examplesChampagne and caviar make a wonderful combination.The school uses a combination of modern and traditional methods for teaching reading.She wears the most hideous colour combinations you could ever imagine.The bride's mother was wearing a horrible combination of green and yellow.That combination of tiredness and alcohol is extremely dangerous.Only two people know the combination for the safe.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nhybridize\nmethylate\nmingle\nmosaic\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\nBuilding: locks & locksmithing\nAdd to word list\nAdd to word list\na mixture obtained when two or more things are combined: [ C ] Green is a combination of blue and yellow. [ C ] A combination of tiredness and boredom made me doze off in class. We'll be working in combination with (= together with) two other departments on this project.\nAdd to word list\nAdd to word list\n[ C or U ] a result of two or more things joining together: a combination of sth and sth A combination of economic slowdown and tax cuts is having a drastic effect on public finances. New technologies work particularly well when they are used in combination with traditional classroom learning. See also\nbusiness combination\nhorizontal combination\nvertical combination"}