{"id":104014,"name":"come","type":"verb","us_sound":"kʌm","us_link":"../audio/c/come.mp3","uk_sound":"kʌm","uk_link":"../audio/c/ukcombi006.mp3","content":"come verb\n(MOVE TO SPEAKER)\nAdd to word list\nAdd to word list\nA1 [ I ] to move or travel towards the speaker or with the speaker: come with Are you coming with me? There's a car coming!come to Can you come to my party?here comes Here comes Adam. She's come 500 km (= has travelled 500 km) to be here with us tonight.come and If you're ever in Dublin, come and visit us.come by We came by car.come for Your father will come for (= to collect) you at four o'clock. Come forward a bit and stand on the line.come from I've come straight from the airport.come into The door opened and a nurse came into the room. [ + to infinitive ] A man's coming to mend the boiler this afternoon. As he came towards me, I could see he'd been crying.come after He thought we'd been picking his apples and came after (= chased) us with a stick. [ + -ing verb ] He came rushing over when I fell.\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\nMore examplesFewer examplesDanny, come here and I'll read you a story.You can only come on the trip if your parents give their consent.It's very kind of you to come all the way to meet me.Don't come too near me - you might catch my cold.Margot came to stay for a week as company for my mother while I was away.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\ncome verb\n(MOVE TO LISTENER)\nA1 [ I ] to move or travel in the direction of the person being spoken to: \"Sal, are you ready?\" \"Coming.\"come and I'll come and pick you up in the car if you like.come for I've come for (= come to get) your census form. [ + to infinitive ] I've come to read the gas meter.\nMore examplesFewer examplesI'm afraid that we can't come this evening after all.We'd be delighted to come to dinner on Friday.I might come and visit you in America next year, if I can save enough money.He came and sat down next to me.I came here specially to see you.\nSMART Vocabulary: related words and phrases\nGeneral words for movement\nbetake\nbudge\nbudge up\ncarry\ncirculate\ndad dancing\ngangway\ngone\nkinetic\nkinetic energy\nkinetically\nlibration\nlocomotion\nmotion\npass\nround\nscoot\nseethe\nshove\nslip\nSee more results »\ncome verb\n(ARRIVE)\nA1 [ I ] to get to a particular place: Has she come yet? When does the post come?\nMore examplesFewer examplesThe doctor at the hospital says that she'll be able to come home within two weeks.After you've gained some experience teaching abroad you can come home and get a job.The school is required to notify parents if their children fail to come to school.The men came to remove the rubbish from the backyard.He thumped on the door but nobody came.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\ncome verb\n(LEAVE)\n[ I + adv/prep ] to leave a place: come away from I had to come away from the party early.come out of The police watched him come out of the house.\nMore examplesFewer examplesWhen he came out of the water, he was trembling with cold.The gunmen were lying in wait when Mr Predit came out of the hotel.We exchanged a few words as we were coming away from the meeting.Her face was a sickly colour when she came out of the dentist's.He came off the tennis court with a twisted ankle.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull something off\npush along\nsea\nstrike\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\ncome verb\n(DIFFERENT STATE)\nC2 [ L ] to change or develop so as to be in a different position or condition: come off He pulled the knob and it just came off (in his hand). How many times have you come off that horse?come out Two of his teeth came out after he got hit in the face.come out of Can you get this cork to come out of the bottle?come on When does the heating come on (= start working)? [ + adj ] A wire has come loose at the back.come open The door came open for no apparent reason.\nMore examplesFewer examplesShe was clever to sell her apartment just before house prices came down.I heard a hiss and a pop as the cork came out of the bottle.I got some stick-on soles for my shoes, but they keep coming off.The roses are just coming into bloom.My shoelaces came undone.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\ncome verb\n(HAPPEN)\nB2 [ I ] to happen: Spring has come early. The announcement came at a bad time.come as Her resignation came as quite a shock.informal Come Monday morning (= when it is Monday morning) you'll regret staying up all night.come again I'm afraid those days are gone and they'll never come again.\nMore examplesFewer examplesHis death came at a terrible time for Roger.The illness came on top of losing his job.The opportunity to join the expedition came at just the right time for me.The announcement that they were to divorce came as a real shock.It didn't come as any great surprise that she was resigning.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\ncome verb\n(BE ORDERED)\ncome after, first, last, etc.\nB1 to have or achieve a particular position in a race, competition, list, etc.: She came second (US came in second) in the 100 metres.\nSee more\ncome verb\n(EXIST)\nA2 [ I + adv/prep, not continuous ] to exist or be available: come in Do these trousers come in any other colour? Runners come in all shapes and sizes - fat and thin, short and tall.come with This cuddly baby doll comes with her own blanket and bottle.not come cheap They're the best sunglasses you can buy, but they don't come cheap (= they are expensive).\nThesaurus: synonyms, antonyms, and examples\nable to be used or hadavailableHand sanitiser is available at every ward entrance.on handThe emergency services were on hand.come inThese shorts come in red, yellow, or blue.in printThe book is still in print after 65 years.in stockDo you have this blender in stock, or do I need to order it?\nSee more results »\nMore examplesFewer examplesDoes this T-shirt come in black?The camera comes with its own carrying case.Mobile phones come in all sorts of shapes and sizes these days.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\nestate\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\ncome to do something\nC2 to start to do something: I've come to like her over the months.\nSee more\ncome verb\n(SEX)\n[ I ] to have an orgasm See also\ncome in clutch US\ncome to life\nsomething come to lifeGrammar\nComeWe usually use come to talk about movement from the listener to the speaker or from the speaker to the listener. …\nCome describing movementWe usually use come to talk about movement from the listener to the speaker or from the speaker to the listener. …\nCome meaning ‘arrive’We can use come to mean ‘arrive’: …\nCome or come to?When we talk about an event which happens because someone comes to a particular place, we use come and: …\nCome or go?We use come to describe movement between the speaker and listener, and movement from another place to the place where the speaker or listener is. We usually use go to talk about movement from where the speaker or listener is to another place. …\nFixed expressions with andWe often use and in common fixed expressions. The order of the words cannot change: peace and quiet, pick and choose, come and go, knife and fork, black and white. …\nIdioms\nas it comes\nbe as crazy, rich, etc. as they come\ncome again?\ncome and go\ncome down on someone like a ton of bricks\ncome from behind\ncome off it!\ncome out swinging/fighting\ncome the something\ncome to pass\nMore idioms\ncome to someone's attention/notice\ncome to that\ncome what may\nthe days/week(s)/year(s) to come\nhad it coming (to you)\nhave something coming out of your ears\nnot know whether you are coming or going\nPhrasal verbs\ncome about\ncome across\ncome across something\ncome along\ncome apart\ncome around\ncome at someone\ncome away\ncome back\ncome back to someone\nMore phrasal verbs\ncome before something/someone\ncome between someone\ncome between something\ncome by something\ncome by (somewhere)\ncome down\ncome down on someone/something\ncome down to something\ncome down with something\ncome forward\ncome from somewhere/something\ncome from something\ncome in\ncome in for something\ncome into something\ncome of something\ncome off\ncome off something\ncome on\ncome on/along\ncome out\ncome out in something\ncome out of something\ncome out with something\ncome over\ncome over someone\ncome round\ncome through\ncome through (something)\ncome to\ncome to someone\ncome together\ncome to something\ncome under something\ncome up\ncome up against something\ncome up to something\ncome up with something\ncome upon someone/something\nsemen (= the liquid containing sperm)\nSMART Vocabulary: related words and phrases\nAnimal physiology: bodily fluids & their production\nbilirubin\nbodily fluid\nbogy\nbooger\nbucket\ndribbling\ngob\nlather\npus\nsaliva\nsalivation\nsemen\nserous\nslag\nslobber\nslobbery\nsnotty\nspittle\nsputum\nsweatily\nSee more results »\ncome verb\n(APPROACH)\nAdd to word list\nAdd to word list\n[ I ] to move or travel toward the speaker or with the speaker: Will you come here, please? Did you come here by car? Come on in! The water’s great. Are you coming over to my house tonight? Is he coming to the movies with us? The man is coming to fix the dryer this afternoon. He came rushing over when I fell.\ncome verb\n(MOVE TO LISTENER)\n[ I ] to move or travel in the direction of the person being spoken to: I thought I’d come and see your new house. I’ve come to read the gas meter.\ncome verb\n(ARRIVE)\n[ I ] to get to a particular place: Has the mail come yet? Spring came early this year – look at all the flowers!\n[ I ] When something comes in it is received: Reports are just coming in of the fire.\ncome verb\n(BE FROM)\n[ I always + adv/prep ] to be or start from a particular place: She comes from Italy. Does that quotation come from Shakespeare?\ncome verb\n(EXIST)\n[ I always + adv/prep ] to exist or be available: The dress comes in three sizes – small, medium, and large. This cuddly doll comes with her own blanket and bottle.\ncome verb\n(HAPPEN)\n[ I ] to happen: Your birthday only comes around once a year. [ + to infinitive ] How did you two come to be friends? The earthquake's aftereffects came without warning.\ncome verb\n(ORDER)\n[ I always + adv/prep ] to be in a particular relation to others in an order: April comes before May. In your cookbook you’ll see that pies come under the heading \"Desserts.\"\n[ I always + adv/prep ] If something comes under an official organization, that organization is responsible for it: Snow removal comes under the highway department.\ncome verb\n(CHANGE)\nto change or be in a different position or condition: [ I always + adv/prep ] The stitching on my briefcase is coming apart. [ L ] A wire had come loose at the back. [ I always + adv/prep ] He pulled the knob and it came off in his hand. [ + to infinitive ] I couldn’t stand him at first, but I’ve come to like him. coming adjective us\nYour browser doesn't support HTML5 audio\n/ˈkʌm·ɪŋ/\nWe look forward to even greater success in the coming year. Idioms\ncome before\ncome forward\ncome in handy\ncome of age\ncome off it\ncome on strong\ncome out of your shell\ncome to a head\ncome to an end\ncome to light\nMore idioms\ncome to rest\ncome to someone's rescue\ncome to your senses\ncome to terms with something\ncome true\nsomething comes to your attention\nhave come a long way\nPhrasal verbs\ncome across\ncome across something/someone\ncome along\ncome apart\ncome apart\ncome around\ncome around\ncome at someone\ncome away (with something)\ncome back\nMore phrasal verbs\ncome back\ncome between someone\ncome by something\ncome down\ncome down on someone\ncome down to something\ncome down with something\ncome in\ncome in for something\ncome into something\ncome off\ncome off\ncome off something\ncome on\ncome on\ncome on\ncome on something\ncome out\ncome out\ncome out\ncome out\ncome out\ncome out with something\ncome over\ncome over someone\ncome through\ncome through something\ncome to\ncome to something\ncome together\ncome under something\ncome under something\ncome up\ncome up\ncome up with something\ncome upon someone/something"}