{"id":104021,"name":"comedy","type":"noun","us_sound":"ˈkɑː.mə.di","us_link":"../audio/c/comedy.mp3","uk_sound":"ˈkɒm.ə.di","uk_link":"../audio/c/ukcombi010.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a (type of) film, play, or book that is intentionally funny either in its characters or its action: His latest movie is described as a \"romantic comedy\". I prefer Shakespeare's comedies to his tragedies.\nThesaurus: synonyms, antonyms, and examples\ncausing laughterfunnyShe told me a funny story about Max.amusingI gave her an article that I thought she would find amusing.humorousShe wrote a humorous account of her teenage years.hilariousIt's the most hilarious comedy on television.hystericalI've just read his autobiography - it's absolutely hysterical.\nSee more results »\n[ U ] the humorous part of a situation: The vicar's forgetting his lines in the middle of the speech provided some good comedy. comedy of manners\na type of comedy in which the social behaviour of a particular group of people is made to appear silly: The novel is both a tender memoir and a comedy of manners.\nSee more\nMore examplesFewer examplesBritish politics remains very fertile ground for comedy.What genre does the book fall into - comedy or tragedy?'Modern Times' is a classic comedy starring Charlie Chaplin, the grandaddy of comic actors.He tried to do a comedy routine, but all his jokes fell flat .She recast her novel as a musical comedy.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\ndirector's cut\nhokum\none-shot\npaean\nparodic\nparody\npassion project\npolice procedural\npsychological\nslow\nsmash\ntragicomedy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHumour & humorous\nAdd to word list\nAdd to word list\na movie, play, or book that is intentionally amusing either in its characters or its action: [ C ] A lot of Shakespeare’s plays are comedies.\nComedy is also the amusing part of a situation: [ U ] When John forgot his lines in the middle of the speech it provided some good comedy."}