{"id":104562,"name":"communism","type":"noun","us_sound":"ˈkɑː.mjə.nɪ.zəm","us_link":"../audio/c/communism.mp3","uk_sound":"ˈkɒm.jə.nɪ.zəm","uk_link":"../audio/c/ukcommu009.mp3","content":"Add to word list\nAdd to word list\nthe belief in a society without different social classes in which the methods of production are owned and controlled by all its members, and everyone works as much as they can and receives what they need, or a social and political system based on this belief: Even many who disliked communism saw merit in his ideas. He saw the debate as one between Conservatism and Communism. Much of the region's industry collapsed after the fall of communism. Compare\ncapitalism\nsocialismRelated word\ncommunist\nMore examplesFewer examplesThe 1970s witnessed the first of the pop-star's dalliances with communism.Marx was the progenitor of Communism.There are few true believers in communism left in the party.The whole apparatus of Communism was falling apart.The film is in some ways a chronicle of late communism in Romania.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterpellate\ninterpellation\ninterventionist\nlab\nlaissez-faire\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government an economic system based on public ownership of property and control of the methods of production, and in which no person profits from the work of others\nAdd to word list\nAdd to word list\na political theory that believes that the state should control the methods of production, there should be no separate social classes and everyone should be treated equally: the ideology of communism Compare\ncapitalism\na political and economic system that is officially based on this theory: The book deals with the realities of life under Communism in the former Soviet Union."}