{"id":104447,"name":"common","type":"adjective","us_sound":"ˈkɑː.mən","us_link":"../audio/c/common.mp3","uk_sound":"ˈkɒm.ən","uk_link":"../audio/c/ukcommi018.mp3","content":"common adjective\n(USUAL)\nAdd to word list\nAdd to word list\nB1 the same in a lot of places or for a lot of people: It's quite common to see couples who dress alike. \"Smith\" is a very common name in Britain.\nThesaurus: synonyms, antonyms, and examples\nhappening or seen oftencommonWorking from home has become increasingly common.rifeViolence was rife throughout the city.commonplaceEarthquakes are a commonplace occurrence in California.be two/ten a pennyUK Good designers are two a penny, but great designers are worth their weight in gold.be a dime a dozenUS Those cheap little metal cars are a dime a dozen. You can get them anywhere.\nSee more results »\ncommon courtesy/decency\nthe basic level of politeness that you expect from someone: His communications were characterized by a lack of common courtesy.\nSee more common knowledge\nB2 a fact that everyone knows: [ + that ] It's common knowledge that they live together.\nSee more\nMore examplesFewer examplesOil spills are common, as is the dumping of toxic industrial wastes.It's common practice in the States to tip the hairdresser.In the past, bear-baiting was a common form of entertainment in Britain.This disease is four times more common in boys than in girls.One common cause of homelessness is separation or divorce.\nSMART Vocabulary: related words and phrases\nPlain and ordinary\nas it comes idiom\naustere\nausterely\nausterity\naverage Joe\ngeneralized\nhomeliness\nhomely\nhomespun\nhomey\nrun-of-the-mill\nsevere\nseverely\nsimple\nsomething/nothing to shout about idiom\nunoriginal\nunostentatiously\nunremarkable\nunremarkably\nwell trodden\nSee more results »\ncommon adjective\n(SHARED)\nB1 belonging to or shared by two or more people, or things: a common goal/interest English has some features common to many languages. See also\ncommon ground for the common good\nIf something is done for the common good, it is done to help everyone: We have to use our freedoms for the common good rather than our own selfish interests.\nSee more make common cause with someone formal\nto act together with someone in order to achieve something: Environmental protesters have made common cause with local people to stop the motorway being built.\nSee more\nMore examplesFewer examplesThe two countries combined against their common enemy.Her latest film, by common consent, is her best yet.English is de facto the common language of much of the world today.Excretion is one of several activities common to both plants and animals.The two countries have united against their common foe.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistribution\ndistributive\ndistributively\njoint\nmate\nportion\nportion something out\nration\nration something out\nredistribute\nslice\nsplit\nSee more results »\ncommon adjective\n(LOW CLASS)\ndisapproving typical of a low social class: My mum thinks dyed blonde hair is a bit common.\nSMART Vocabulary: related words and phrases\nClass & class-consciousness in general\nanti-bourgeois\nanti-snob\narriviste\nbougie\ngentrify\ngo/come down in the world idiom\ngo/come up in the world idiom\nheap\npedigreed\npetit bourgeois\npetty bourgeois\npleb\nsocial climber\nsocial climbing\nsocial mobility\nthe bottom of the heap idiom\nthe gentry\nthe petite bourgeoisie\ntrailer trash\nunderclass\nSee more results »\nIdioms\nthe common man\nthe common touch\ncommon noun\n(LAND)\n[ C ] (US also commons) an area of grass that everyone is allowed to use, usually in or near a village\nSMART Vocabulary: related words and phrases\nGeography: deserts, prairies & wildernesses\nbrush\nbush\nBushman\ndesert\ndust bowl\ngrassland\nheathland\nmarginal land\nmoor\nmoorland\nmulga\npasture\nprairie\nSahara\nthe Gobi Desert\nveld\nvirgin\nwadi\nwasteland\nwilderness\nSee more results »\ncommon noun\n(SHARED)\nhave something in common\nB1 to share interests, experiences, or other characteristics with someone or something: We don't really have much in common.\nSee more in common with someone/something\nC1 in the same way as someone or something: In common with many mothers, she feels torn between her family and her work.\nSee more\ncommon adjective\n(USUAL)\nAdd to word list\nAdd to word list\nfound frequently in many places or among many people: Money worries are a common problem for people raising children.\ncommon adjective\n(SHARED)\n[ not gradable ] belonging to or shared by two or more people or things: Guilt and forgiveness are themes common to all of her works. commonly adverb us\nYour browser doesn't support HTML5 audio\n/ˈkɑm·ən·li/\n\"The\" is the most commonly used word in English. Idioms\ncommon denominator\ncommon ground\ncommon knowledge\nhave something in common\ncommon noun [C]\n(LAND)\nan area of grassy land that is open for everyone to use, usually near the center of a town or city: The Boston Common is the oldest park in the US."}