{"id":104539,"name":"communication","type":"noun","us_sound":"kəˌmjuː.nəˈkeɪ.ʃən","us_link":"../audio/c/communication.mp3","uk_sound":"kəˌmjuː.nɪˈkeɪ.ʃən","uk_link":"../audio/c/ukcommu003.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the act of communicating with people: Television is an increasingly important means of communication. We are in direct communication with Moscow. With no decent phone signal, communication is difficult. There's very little communication between mother and daughter (= they do not have a good relationship). a course on communication skills\n[ C ] formal a message, letter, or announcement: We received your communication of 11 March and are sorry to inform you that we won't be attending the conference. Synonyms\nannouncement\ndispatch\nmessage (INFORMATION)\nmissive\npronouncement formal communications [ plural ]\nthe various methods of sending information between people and places, especially phones, computers, radio, etc.: the communications industry\nways of moving between one place and another: Its commercial success as a city is partly due to its excellent rail and road communications.\nSee more\nMore examplesFewer examplesLack of communication in a marriage causes serious problems.The successful applicant for the position will be a well-motivated self-starter who has excellent communication skills.They showed a documentary on animal communication.Business people often think that fluency and communication are more important that grammar when speaking.With no phone or radio equipment, they had no means of communication.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\napproach\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nAdd to word list\nAdd to word list\nthe process by which messages or information is sent from one place or person to another, or the message itself: [ U ] E-mail is an increasingly important means of business communication.\nCommunication is also the exchange of information and the expression of feeling that can result in understanding: [ U ] There was very little communication between the two brothers.\nAdd to word list\nAdd to word list\n[ U ] the process of sharing information, especially when this increases understanding between people or groups: We have been in communication with various agencies in regard to this matter.a form/means/method of communication Email is an excellent means of communication because of the flexibility it allows. The training department uses a special board game to improve communication between managers and their employees.enhance/improve/foster communication He said communication with neighborhoods and community groups must be improved. The project failed because of a lack of communication between the two departments. There was a breakdown in communication.channels/lines of communication It is important to keep the channels of communication open at all times. Effective communication is a two-way process. Good communication skills are essential in this job. In the study, the effectiveness of online communication was contrasted with person-to-person interaction. See also\ncorporate communication\nmass communication\n[ C ] formal a written or spoken message: I kept a record of who I spoke to, wrote to, or received a communication from. By subscribing to the list, you are agreeing to receive regular email communications from the company."}