{"id":104396,"name":"commit","type":"verb","us_sound":"kəˈmɪt","us_link":"../audio/c/commit.mp3","uk_sound":"kəˈmɪt","uk_link":"../audio/c/ukcommi009.mp3","content":"commit verb\n(CRIME)\nAdd to word list\nAdd to word list\nB2 [ T ] to do something illegal or something that is considered wrong: He was sent to prison for a crime that he didn't commit. to commit adultery/murder to commit an offence\nMore examplesFewer examplesSoldiers who obey orders to commit atrocities should be answerable for their crimes.They were imprisoned for incitement to commit grievous bodily harm.Fresh evidence has recently come to light which suggests that he didn't in fact commit the murder.Many people in public life have committed adultery.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious concepts: sin\ncommit verb\n(PROMISE)\nC2 [ I or T ] to promise or give your loyalty, time, or money to a particular principle, person, or plan of action: Like so many men, he has problems committing himself to a relationship. The government must commit itself to improving healthcare. Once we have committed to this course of action there is no going back. commit yourself\nto express an opinion or to make a decision that you tell people about: I think I can come but I won't commit myself till I know for sure. It's fine to discuss some ideas, but don't commit yourself at this stage. We'd love her to join our new project but she seems reluctant to commit herself. He committed himself to producing a new album as a tribute to his father. I'd love to know what they think about the president, but they aren't committing themselves. commit something to memory\nto make certain that you remember something: She listened carefully to the music, as if she were committing it to memory.\nSee more commit something to paper\nto write something down: Perhaps we should commit these ideas to paper before we forget them.\nSee more\nMore examplesFewer examplesCan you commit to a firm date for the building work?We have committed ourselves to stamping out racism in our organization.She finds it hard to commit to just one man.I'd like to come to your party, but I can't commit myself until I know my work shifts.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnouncing, informing & stating\ncommit verb\n(SEND)\n[ T ] formal to send someone officially to prison or psychiatric hospital: He was committed to prison for fraud. She was afraid doctors were going to commit her to a mental institution.\n[ T ]\n&#160; law\n&#160; UK or Australian specialized, formal to send someone to a higher court for a trial or to be sentenced (= given a punishment), or to send a case to a higher court to be tried there: Three men were yesterday committed for trial on conspiracy charges. The men were remanded in custody and the case was committed to Preston crown court. Related word\ncommittal\nMore examplesFewer examplesHe claimed he was unable to control his impulses and was committed to a secure treatment unit at the state hospital.The trial court may place a juvenile defendant on probation and commit him or her to a state institution.He was committed to appear at Southwark Crown Court on 30 July. The case was committed to crown court for sentencing at a later date.\nSMART Vocabulary: related words and phrases\nPutting people in prison\nat His/Her Majesty's pleasure idiom\nbang\nbang someone up\nbar\nbehind bars idiom\nbird\nimmured\nimprison\nimprisonment\nincarcerate\nincarceration\nintern\nlock\npen\nremand\nrestraint\nrot\nrot in jail, prison, etc. idiom\nsend\nstretch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScience of psychology & psychoanalysis\nCourt cases, orders & decisions\nIdiom\ncommit suicide\ncommit verb\n(PROMISE)\nAdd to word list\nAdd to word list\n[ I/T ] us\nYour browser doesn't support HTML5 audio\n/kəˈmɪt/ -tt- to promise to give yourself, your money, your time, etc., to support something: [ I/T ] They wouldn’t commit (to giving) enough time or money to the project.\n[ I/T ] us\nYour browser doesn't support HTML5 audio\n/kəˈmɪt/ -tt- If you do not commit yourself about something, you refuse to express an opinion about it: [ T ] Neither candidate would commit himself on the issue of tax reform.\ncommit verb\n(PUT)\n[ T ] us/kəˈmɪt/ -tt- to actively put information in your memory or write it down: These rules must be committed to memory. I wouldn't want to commit these comments to paper.\ncommit verb\n(CRIME)\n[ T ] us\nYour browser doesn't support HTML5 audio\n/kəˈmɪt/ -tt- to do something illegal or considered wrong: He committed a crime in providing the information to a reporter.\ncommit verb\n(SEND FOR TREATMENT)\n[ T ] fml us\nYour browser doesn't support HTML5 audio\n/kəˈmɪt/ -tt- to cause someone to stay in a mental hospital or treatment center: He was once committed to a state mental hospital.\nAdd to word list\nAdd to word list\n[ I or T ] to promise to do something or to promise that something will happen: commit to sth The CEO declined to commit to a time frame for the decision.commit to doing sth Families who sign up to the service have to commit to buying their groceries from one internet source for a year.commit yourself (to sth) Carefully check out arrangements before committing yourself.\n[ T ] to decide or promise to use something for a particular purpose: commit sth (to sth) Check who you are dealing with and the terms and conditions on the account before committing cash.commit sth to do sth He has committed $5 million of his own money to get the project going.\n[ T ] to do something illegal or that is considered wrong: commit a crime/felony/offence She is charged with conspiracy to commit fraud."}