{"id":104597,"name":"commute","type":"verb","us_sound":"kəˈmjuːt","us_link":"../audio/c/commute.mp3","uk_sound":"kəˈmjuːt","uk_link":"../audio/c/ukcommu014.mp3","content":"commute verb\n(TRAVEL)\nAdd to word list\nAdd to word list\nC1 [ I ] to make the same journey regularly between work and home: It's exhausting commuting from Brighton to London every day.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nmove\nnegotiate\nRobin Hood\nshuttle\nsuper-commuting\nswan\ntaken\ntour\ntransoceanic\nvisa\nwell travelled\nSee more results »\ncommute verb\n(CHANGE)\n[ T ] formal to change one thing into another: People used to believe that you could commute base metals into gold.\n[ T ]\n&#160; finance &amp; economics\n&#160; specialized to exchange one type of payment for a different type: I think I'll commute my life insurance into an annuity.\n[ T ]\n&#160; law\n&#160; specialized to change a punishment to one that is less severe: Her sentence was commuted from death to life imprisonment.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nNot punishing & reducing punishment\na regular journey between work and home: It's at least an hour's commute to work.\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\njaunt\njunket\nlayover\nmove\nodyssey\nride\nround trip\nsail\nseafaring\ntrip\nwanderings\nSee more results »\ncommute verb\n(TRAVEL)\nAdd to word list\nAdd to word list\n[ I ] to travel regularly a distance between work and home: She commutes to the city by car every day.\ncommute verb\n(CHANGE)\n[ T ] to change a punishment into another that is less severe: The governor commuted the sentence and released the prisoner. commute noun [ C ] us\nYour browser doesn't support HTML5 audio\n/kəˈmjut/\nThe commute is not too bad – just over an hour. commuter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/kəˈmjut̬·ər/\nThe 5:30 train is always packed with commuters.\nAdd to word list\nAdd to word list\n[ I ]\n&#160; TRANSPORT to make the same journey regularly from home to work: He commuted every day, back and forth, an hour and 20 minutes each way. Debbie works for an investment bank and is presently commuting between Paris and Luxemburg. Duffy has commuted from Windsor to London for the past seven years.\n[ T ]\n&#160; FINANCE, INSURANCE to exchange one type of payment or investment for another type: Pensioners who commute their pension for a lump sum sometimes face huge losses.\n[ T ]\n&#160; LAW to replace a punishment with a less severe one: Davis still faces execution unless the parole board commutes his sentence to life in prison.\nTRANSPORT a journey that someone does regularly from home to work: a 90 minute/50km/30 mile commute Every morning during his 85-mile commute he has plenty of time to think about the day ahead.a daily/weekly commute Cutting out the daily commute is the most obvious attraction of teleworking.a long/short commute The survey provides evidence that low-paid workers are forced to endure long commutes into the capital."}