{"id":104373,"name":"commission","type":"verb","us_sound":"kəˈmɪʃ.ən","us_link":"../audio/c/eus70900.mp3","uk_sound":"kəˈmɪʃ.ən","uk_link":"../audio/c/ukcommi006.mp3","content":"commission verb\n(REQUEST WORK)\nAdd to word list\nAdd to word list\n[ T ] to formally choose someone to do a special piece of work, or to formally ask for a special piece of work from someone: The newspaper commissioned a series of articles on the worst excesses of the fashion industry. She's commissioned an artist to paint her portrait.\nMore examplesFewer examplesA set of stamps has been commissioned in commemoration of Independence Day.They commissioned me to write a series of articles on language.He commissioned a report into the disaster.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\ncommission verb\n(MAKE OFFICER)\n[ T usually passive ]\n&#160; military\n&#160; specialized to give someone the official authority to be an officer in the armed forces: Grandfather was commissioned as Group Captain in the RAF just before the war.\nSMART Vocabulary: related words and phrases\nJoining or leaving the army\nanti-draft\nbuy\nbuy someone out\ncall\ncall someone up\nconscript\nconscription\ndemob\ndemobilization\ndesert\ndeserter\ndesertion\ndraft\ndraft dodger\nenlist\njoin\njoin up\nre-enlist\nre-enlistment\nre-up\nSee more results »\ncommission noun\n(GROUP)\n[ C, + sing/pl verb ] a group of people who have been formally chosen to discover information about a problem or examine the reasons why the problem exists: a commission on alcohol abuse/racial tension The government has set up/established a commission to investigate the problem of inner city violence.\nMore examplesFewer examplesA commission has just been appointed to investigate fraud claims.Last week the commission published its long-awaited report on the problem of teenage pregnancies.A commission has been set up to look at racial tension in the area.The commission is due to report next week.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\ncommission noun\n(PAYMENT)\n[ C or U ] a payment to someone who sells goods that is directly related to the amount sold, or a system that uses such payments: Is she paid a regular wage or is it on/by commission only? She gets a 15 percent commission on every machine she sells.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPayment methods\ncommission noun\n(WORK)\n[ C ] a request to do a special piece of work: [ + to infinitive ] She's just got a commission to paint Sir Ellis Pike's wife. Do you do/take commissions?\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\ncommission noun\n(CRIME)\n[ U ] formal the act of committing a crime: the commission of the crime/offence/murder\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nviolation\nSee more results »\ncommission noun\n(MILITARY)\n[ C ]\n&#160; military\n&#160; specialized the official authority to be an officer in the armed forces\nSMART Vocabulary: related words and phrases\nJoining or leaving the army\nanti-draft\nbuy\nbuy someone out\ncall\ncall someone up\nconscript\nconscription\ndemob\ndemobilization\ndesert\ndeserter\ndesertion\ndraft\ndraft dodger\nenlist\njoin\njoin up\nre-enlist\nre-enlistment\nre-up\nSee more results »\nIdioms\nin commission\nout of commission\ncommission noun\n(GROUP)\nAdd to word list\nAdd to word list\n[ C ] a group of people who have been formally chosen and given the authority to get information about a problem or to perform other special duties: Congress appointed a commission to study immigration policy.\ncommission noun\n(WORK REQUEST)\n[ C ] a formal request to do a special piece of work for payment: She received a commission to paint the governor’s portrait.\ncommission noun\n(MILITARY)\n[ C ] the official authority to be an officer in the armed forces: She received her commission as a lieutenant in the US Army.\ncommission noun\n(CRIME)\n[ U ] the act of doing something that is illegal or considered wrong: the commission of a crime\ncommission noun\n(PAYMENT)\n[ C/U ] a system of payment based on a percentage of the value of sales or other business done, or a payment to someone working under such a system: [ C ] As a real estate agent, her commission is between 4% and 6% on every sale.\ncommission verb [T]\n(WORK REQUEST)\nto choose someone to do a piece of work, or to have a piece of work done: The newspaper commissioned a series of articles on the fashion industry.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; COMMERCE a payment to someone who sells homes, products, investments, etc., which is directly related to the amount they sell, or the practice of receiving these payments: make/pay/receive a commission The airline agreed to pay travel agents a 3% commission. His monthly salary, which is based on commissions, has dropped from about $7,000 to $1,000.be on commission People often work harder when they're on commission.\n[ C ]\n&#160; GOVERNMENT\n&#160; (also Commission) a group of people who have been officially chosen to examine a problem and advise on the best action to take: appoint/create/establish/set up a commission Congress appointed a commission to investigate the causes of the financial crisis.\n[ C ]\n&#160; GOVERNMENT\n&#160; (also Commission) an official organization whose job is to manage a particular activity, suggest laws relating to the activity, and make certain that laws are obeyed: communications/energy/planning, etc. commission The Energy Commission announced rules that bar municipal utilities from signing new contracts with coal-fired power plants.\nCOMMERCE a request to do a particular piece of work for someone: accept/get/receive a commission When he was 19, he got a commission to write an orchestra piece.\nto ask someone do a particular piece of work for you: The newspaper commissioned a series of articles on the fashion industry.\nout of commission\nbroken or not available to be used: put sth/take sth out of commission In Port Arthur, three major refineries were taken out of commission by power failures. See also\ndecommission\nEqual Employment Opportunity Commission\nthe Federal Communications Commission\nthe Federal Trade Commission\noverriding commission\nthe Securities and Exchange Commission"}