{"id":104273,"name":"comment","type":"noun","us_sound":"ˈkɑː.ment","us_link":"../audio/c/comment.mp3","uk_sound":"ˈkɒm.ent","uk_link":"../audio/c/ukcomma019.mp3","content":"Add to word list\nAdd to word list\nB1 something that you say or write that expresses your opinion: I don't want any comments on/about my new haircut, thank you! He made negative comments to the press. I suppose his criticism was fair comment (= a reasonable opinion). She was asked about the pay increase but made no comment (= did not give an opinion). Synonyms\ndeclaration (ANNOUNCEMENT)\nobservation (NOTICING) formal\nstatement\nutterance formal or specialized\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\nno comment\nC2 used to say that you do not want to answer someone's question: His publicist replied with a firm \"No comment\".\nSee more\nMore examplesFewer examplesIt was just a casual comment, I didn't mean it to be taken so seriously.The tutor's comments on my work were very apt and to the point.Her ridiculous comments provoked an outburst of anger from the boss.He made some derogatory comment about her appearance.The Minister was unavailable for comment last night.\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\naside\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nline\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nB2 to make a comment: My mum always comments on what I'm wearing. [ + that ] He commented that the two essays were rather similar. The official refused to/declined to comment on the matter.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nMore examplesFewer examplesThe minister has refused to comment on the allegations.I'd just like to comment on what your previous caller was saying.Britain's ambassador in Moscow has refused to comment.I only commented that she looked tired - I didn't mean to be rude.Let's watch the film first, and everyone will have an opportunity to comment at the end.\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\naside\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nline\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nAdd to word list\nAdd to word list\nto express an opinion: The lawyer won’t comment publicly on the case.\nan opinion or remark: [ C ] One of his comments had to do with the state taxes. [ U ] The reporter couldn’t reach any government officials for comment (= to ask for their opinions)."}