{"id":104441,"name":"commodity","type":"noun","us_sound":"kəˈmɑː.də.t̬i","us_link":"../audio/c/eus70904.mp3","uk_sound":"kəˈmɒd.ə.ti","uk_link":"../audio/c/ukcommi016.mp3","content":"Add to word list\nAdd to word list\nC1 a substance or product that can be traded, bought, or sold: The country's most valuable commodities include tin and diamonds. the international commodities market\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\na valuable quality: If you're going into teaching, energy is a necessary commodity.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndry goods\nend product\nfabricator\ngeneral-purpose\ngenerator\ngeneric\nhaul\nmarque\nmover\nmulti-product\nnon-proprietary\nnotion\noutput\noverstock\nspecialize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseful or advantageous\nAdd to word list\nAdd to word list\nsocial studies anything that can be bought and sold: The goal is to raise the productivity of basic food commodities such as grains.\nAdd to word list\nAdd to word list\nSTOCK MARKET, FINANCE a substance or a product that can be traded in large quantities, such as oil, metals, grain, coffee, etc.: One big commodity that Canada exports is oil. Higher commodities prices boosted first-quarter profits. agricultural commodities\nFINANCE a financial product that can be traded: Returning barren fields to their natural state as wetlands creates a host of \"wetland mitigation credits,\" a commodity the company plans to sell.\nNATURAL RESOURCES a thing or a quality that is useful: Water is a very scarce commodity in the region. Fluency in Arabic is a valuable commodity in a job market desperate for Arabic translators."}