{"id":104406,"name":"committee","type":"noun","us_sound":"kəˈmɪt̬.i","us_link":"../audio/c/eus70902.mp3","uk_sound":"kəˈmɪt.i","uk_link":"../audio/c/ukcommi013.mp3","content":"Add to word list\nAdd to word list\nB2 a small group of people chosen to represent a larger organization and either make decisions or collect information for it: She sits on/is on the school's development committee. The local council has just set up a committee to study recycling. a committee meeting\nMore examplesFewer examplesThe committee is composed of MPs, doctors, academics and members of the public.The finance committee controls the school's budget.It took a lot of persuasion to convince the committee of the advantages of the new scheme.She has served on the committee for the last 15 years.In his capacity as secretary of the residents association, he regularly attends meetings of the community policing committee.\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nAdd to word list\nAdd to word list\na group of people chosen from a larger group to act on or consider matters of a particular kind: She sits on the city’s finance committee.\nAdd to word list\nAdd to word list\nMEETINGS a small group of people chosen to represent a larger organization and make decisions or collect information for it: committee members a committee meeting If the others on the committee share his view and the data continues to be weak, a rate rise seems unlikely.appoint/form/establish a committee A committee was appointed to oversee the building of the new facility.be/sit/serve on a committee She has served on the committee for many years.chair a committee The Finance Director usually chairs this committee.a committee decides/approves/recommends The selection committee recommended that both candidates be appointed. an advisory/consultative/executive committee See also\ncreditors' committee\njoint consultative committee\nmanagement committee\npolitical action committee\nselection committee\nsteering committee"}