{"id":104275,"name":"commentary","type":"noun","us_sound":"ˈkɑː.mən.ter.i","us_link":"../audio/c/commentary.mp3","uk_sound":"ˈkɒm.ən.tər.i","uk_link":"../audio/c/ukcomma020.mp3","content":"Add to word list\nAdd to word list\na spoken description of an event on the radio or television that is broadcast as the event happens: commentary on The commentary on the Olympic Games was much better on the other channel. After retiring as a player she did football commentary for the BBC.\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\na piece of writing, a work of art, etc. that explains a situation or expresses an opinion on it: There's good arts coverage in the newspaper, but not much political commentary.commentary on Is the sculpture meant to be a commentary on religion?\nsomething that shows what something is really like: It is a sad commentary on our society that we have children locked up in adult jails.commentary on Is it possible that our judgment of others is really a commentary on how deserving we feel ourselves? It’s a sad commentary when technology that is supposed to bring people together causes so much division. running commentary\na continuous description of events as they are happening: He gave a hilarious running commentary of the match.\nSee more\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\naside\nbackbite\nbackbiting\nbarb\ndog whistle\nfelicity\ninnuendo\nlast word\nline\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nRevealing secrets & becoming known\nGrammar\nCommentariesCommentaries are reports on events such as a public ceremony or a football match. They are usually spoken while the events are being viewed. We use both the present simple and the present continuous. The present simple is used to make the commentary sound more immediate: …\nAdd to word list\nAdd to word list\na series of remarks describing an event, esp. on radio or television, or a set of written notes explaining or expressing an opinion on a text or subject: [ C ] the television commentary on the Olympic Games"}