{"id":104574,"name":"community","type":"noun","us_sound":"kəˈmjuː.nə.t̬i","us_link":"../audio/c/eus70908.mp3","uk_sound":"kəˈmjuː.nə.ti","uk_link":"../audio/c/ukcommu011.mp3","content":"Add to word list\nAdd to word list\nB2 the people living in one particular area or people who are considered as a unit because of their common interests, social group, or nationality: He's well known in the local community. There's a large black/white/Jewish community living in this area. Her speech caused outrage among the gay community. Drug trafficking is a matter of considerable concern for the entire international community (= all the countries of the world). There's a real sense of community (= caring and friendly feeling) in this neighbourhood.\nbiology\n&#160; specialized a group of animals or plants that live or grow together the community [ S ]\nthe general public: Unlike the present government, we believe in serving the community.\ninternet &amp; telecoms\n&#160; specialized on social media, a group of people who have similar interests or who want to achieve something together: Let your voice be heard on this issue; join our Facebook community. My family is aware of the way my virtual community has infiltrated our real world. I have been watching the forum develop and grow as an online community for librarians to exchange ideas about using technology.\nMore examplesFewer examplesHer death is a grievous loss to the whole of the community.Her ideas have attracted a lot of attention in the scientific community.In this school, most of the children are from the Chinese community.The poorest sections of the community have much worse health.The tragedy has shocked this close-knit rural community.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlants & animals - general words\nOrdinary people\nInternet terminology\nAdd to word list\nAdd to word list\nall the people who live in a particular area, or a group of people who are considered as a unit because of their shared interests or background: [ C ] the scientific community [ C ] Bus fares were raised despite the protests of the community. [ U ] There’s a real sense of community (= caring and friendly feeling) in this neighborhood.\nbiology A community is also all the various living things that live in a particular area.\nThe community is sometimes used to mean society in general: [ U ] She believed that the greatest goal in life was to serve the community.\nAdd to word list\nAdd to word list\nthe people living in a particular area: We know that 80% of economic growth comes from businesses already located within our communities.rural/urban community Banks offer basic banking facilities to people in rural communities. This is a restaurant that also provides training for unemployed people from the local community.\na group of people who have the same interests, religion, etc.: international financial communityLatino/black/Jewish, etc. community The US Census shows the Latino community has grown to 35 million. See also\nbedroom community\nbusiness community\nthe international community\nonline community\nthe community\na way of referring to people in general or the public: Basically, you have to find the best ways of working with the community."}