{"id":104483,"name":"commonwealth","type":"noun","us_sound":"ˈkɑː.mən.welθ","us_link":"../audio/c/commonwealth.mp3","uk_sound":"ˈkɒm.ən.welθ","uk_link":"../audio/c/ukcommi025.mp3","content":"Add to word list\nAdd to word list\na group of countries with the same political or economic aims: the Commonwealth of Independent States\na country or part of a country that is governed by its people or representatives elected by its people\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncondominium\ncrown colony\ndecolonization\ndecolonize\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRepublics & kingdoms\nAdd to word list\nAdd to word list\npolitics &amp; government a country or state that is governed by its people or their elected representatives\npolitics &amp; government A commonwealth is an organized group of independent self-governing countries.\npolitics &amp; government A commonwealth is also a US state.\npolitics &amp; government A commonwealth is also a self-governing place associated with the US, such as Puerto Rico.\nAdd to word list\nAdd to word list\na country or part of a country that is governed by its people or those elected by them. The word is used as the title of some of the states of the US: In Pennsylvania, navigable rivers belong to the Commonwealth.\nan organized group of states, or of independent countries with the same political or economic aims: the Commonwealth of Australia (= the federation of Australian states) There is an ongoing investigation into the lobbyist and his dealings with Guam and the Commonwealth of the Northern Mariana Islands.\nthe Commonwealth (of Nations)\nan organization of independent countries which were part of the former British Empire and which now have friendly political or economic connections with each other. A small number of countries which did not form part of the British Empire have also joined the Commonwealth."}