{"id":104397,"name":"commitment","type":"noun","us_sound":"kəˈmɪt.mənt","us_link":"../audio/c/commitment.mp3","uk_sound":"kəˈmɪt.mənt","uk_link":"../audio/c/ukcommi010.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a promise or firm decision to do something: Players must make a commitment to play for a full season. Can you give a commitment that the money will be made available? The government reaffirmed its commitment to the peace process. The company has failed to honour its commitments. Synonyms\nassurance (PROMISE)\nbond (PROMISE)\nguarantee\noath (PROMISE)\npledge\npromise (SAY CERTAINLY)\nresolution (DETERMINATION) formal approving\nundertaking (PROMISE) formal\nvow\nword (PROMISE)\nB2 [ U ] willingness to give your time and energy to a job, activity, or something that you believe in: I'd like to thank the staff for having shown such commitment. They don't want to promote me because they think I lack commitment. She is known chiefly for her commitment to nuclear disarmament. Synonyms\ndetermination (TRYING HARD)\nresolve formal\nB2 [ C ] something that you must do or deal with that takes your time: family/work commitments I've got too many commitments at the moment to do an evening class. Having a dog is a big commitment.\nThesaurus: synonyms, antonyms, and examples\nan appointmentappointmentI made a dentist's appointment for Monday morning.reservationI have a reservation for 8 pm.bookingUK I have a booking in the name of Smith.commitmentI have no commitments tomorrow, so let’s meet up in the morning.\nSee more results »\nMore examplesFewer examplesMarriage is no longer always seen as a lifetime commitment.Try the product at home with absolutely no commitment to buy.She had a lifelong commitment to feminism.In spite of the scale of the famine, the relief workers struggled on with dauntless optimism and commitment.You're young and healthy and you have no commitments - you can do whatever you want.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrying and making an effort\nBacking, supporting & defending\nDuty, obligation and responsibility\nAdd to word list\nAdd to word list\na promise to give yourself, your money, your time, etc., to support or buy something: Try the product for two weeks with no commitment to buy.\nAdd to word list\nAdd to word list\n[ C or U ] a promise or firm decision to do something, or the fact of promising something: He was encouraged by the commitment of car manufacturers to improving dealer profitability. The mayor also pleaded for a commitment to the city's request for $250 million in federal funds. We will set an example to the rest of the public sector and business by making a commitment to buy recycled goods. a strong/firm commitment We can arrange for you to trial the equipment without commitment to buy.\n[ C or U ] an amount of money that you have to pay, or the fact of promising to pay: It is unclear whether the regulator can force a foreign firm to honour its UK pension commitments. We believe that a commitment of $25 million is a good investment for our policyholders.\n[ U ] the fact of being willing to give your time and energy to something: He argued that an organization's communications are crucial in influencing staff understanding and commitment. She is very bright, but she lacks commitment.\n[ C ] something that you must do or deal with that takes your time: Jury service is a public duty that many of us would like to avoid, because of work or family commitments."}