{"id":105192,"name":"compromise","type":"noun","us_sound":"ˈkɑːm.prə.maɪz","us_link":"../audio/c/compromise.mp3","uk_sound":"ˈkɒm.prə.maɪz","uk_link":"../audio/c/ukcompr004.mp3","content":"Add to word list\nAdd to word list\nB2 an agreement in an argument in which the people involved reduce their demands or change their opinion in order to agree: It is hoped that a compromise will be reached in today's talks. In a compromise between management and unions, a four percent pay rise was agreed in return for an increase in productivity. The government has said that there will be no compromise with terrorists.\nMore examplesFewer examplesThe talks are aiming at a compromise.The leader's aggressive stance seems to have foreclosed any chance of diplomatic compromise.I'm hopeful that we can reach a compromise.Negotiations are a two-way thing - both sides have to come to a compromise.A compromise has to be reached between all the powerful vested interests before any restoration work in the city can take place.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing reluctantly\naccede to something\nacceptance\nacquiescence\nbe resigned to something idiom\nbend to something\nbow down to someone\ncave in\nconcede\ncrack\nlike it or lump it idiom\npeace\nresign yourself to something\nresignation\nresigned\nresignedly\nresort to something\nsettle for something\nshoulder\ntolerate\ntrade something off\nSee more results »\ncompromise verb\n(AGREEMENT)\nB2 [ I ] to accept that you will reduce your demands or change your opinion in order to reach an agreement with someone: Party unity is threatened when members will not compromise. Well, you want $400 and I say $300, so let's compromise at/on $350.\nMore examplesFewer examplesSomebody will have to compromise if we are to break the deadlock between the two warring factions.The reluctance of either side to compromise means that the talks are doomed to fail.The antagonists in this dispute are quite unwilling to compromise.The dispute had reached an impasse, as neither side would compromise.They have become irreconcilable, with both sides refusing to compromise any further.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing reluctantly\naccede to something\nacceptance\nacquiescence\nbe resigned to something idiom\nbend to something\nbow down to someone\ncave in\nconcede\ncrack\nlike it or lump it idiom\npeace\nresign yourself to something\nresignation\nresigned\nresignedly\nresort to something\nsettle for something\nshoulder\ntolerate\ntrade something off\nSee more results »\ncompromise verb\n(LOWER STANDARDS)\n[ T ] disapproving to allow your principles to be less strong or your standards or morals to be lower: Don't compromise your beliefs/principles for the sake of being accepted. If we back down on this issue, our reputation will be compromised. His political career ended when he compromised himself by accepting bribes.\nSMART Vocabulary: related words and phrases\nHumiliating and degrading\nabase\nabasement\nbe under a cloud idiom\nbring/take someone down a peg (or two) idiom\nbruise someone's ego idiom\ndisgraced\ndishonour\ndishonourable\ndishonourably\ndoghouse\nignoble\nignobly\nignominious\nignominiously\nignominy\nshoddily\nshoddiness\nshoddy\nstoop\nstoop to something\nSee more results »\ncompromise verb\n(HARM)\nC2 [ T ] to risk having a harmful effect on something: We would never compromise the safety of our passengers.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ndare\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nlay\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\ncompromise noun [C]\n(AGREEMENT)\nAdd to word list\nAdd to word list\nan agreement between two sides who have different opinions, in which each side gives up something it had wanted: Under the compromise, car manufacturers must use cleaner fuel but have more time to do it.\ncompromise verb\n(LOWER STANDARDS)\n[ T ] to lower or weaken standards: His opponents charged that the deal would compromise conservative principles.\ncompromise verb\n(AGREE)\n[ I ] to agree to give up something you want if the other side, which has different opinions from yours, gives up something it wants: Republicans were refusing to compromise on health-care legislation.\nAdd to word list\nAdd to word list\n[ C or U ] a situation in which the people or groups involved in an argument reduce their demands in order to reach an agreement: arrive at/come to/reach a compromise House and Senate staffers are working long hours to try to reach a compromise.acceptable/good/reasonable compromise A deal will stick only if the vast majority of bondholders accept it as a reasonable compromise.a compromise deal/proposal/solution Both sides in the talks are willing to seek a compromise solution.\n[ C ] a solution to a problem that makes it possible for two or more opposite or different things to exist together: compromise between sth and sth This piece of equipment is the ideal compromise between power and portability.\n[ I ] to reduce your demands in order to reach an agreement: compromise (with sb) on sth They compromised with the HR department on the details of the appraisal system.\n[ I or T ] to risk harming something: compromise (on) sth 'I believe it can be done without compromising on safety or service,' he said. His goal was to run a successful business without compromising his principles."}