{"id":105177,"name":"comprise","type":"verb","us_sound":"kəmˈpraɪz","us_link":"../audio/c/comprise.mp3","uk_sound":"kəmˈpraɪz","uk_link":"../audio/c/ukcompr003.mp3","content":"Add to word list\nAdd to word list\nC1 to have things or people as parts or members; to consist of: The course comprises a class book, a practice book, and a CD.\nto be the parts or members of something; to make up something: Italian students comprise 60 percent of the class. The class is comprised mainly of Italian and French students. Visible light comprises only a minute fraction of the electromagnetic spectrum.\nMore examplesFewer examplesThe accommodation comprises six bedrooms and three living rooms.Our staff comprises many nationalities.The Gold Division comprises the 80 or so best golf players in the country.His supporters are comprised mainly of evangelical Christians.a panel of experts comprised of a librarian, university faculty, publishers, and industry peopleSingle women comprise 43% of the US female voting-age population.\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncomposition\ncompositional\ncompositionally\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitution\nconstitutive\nform\nfrom\nmake\nmake something up\nmulti-component\nof\nGrammar\nConsist, comprise or compose?Consist, comprise and compose are all verbs used to describe what something is ‘made of’. We don’t use them in continuous forms. …\nAdd to word list\nAdd to word list\nto consist of or to be made up of: The Pacific Rim comprises countries bordering the Pacific, including the US, Canada, Japan, China, and the Koreas. The ninth district is comprised of (= consists of) 15 cities and towns, including Boston.\nAdd to word list\nAdd to word list\nto have as parts or members, or to be those parts or members: Teams are created to work on one specific project, and are comprised of people who have very different skills. Manufacturing comprises 14% of the state's economy."}