{"id":105084,"name":"compositional","type":"adjective","us_sound":"ˌkɑːm.pəˈzɪʃ.ən.əl","us_link":"../audio/c/cdo1121uscomp1062.mp3","uk_sound":"ˌkɒm.pəˈzɪʃ.ən.əl","uk_link":"../audio/c/cdo1121ukcomp1044.mp3","content":"compositional adjective\n(MUSIC/ART)\nAdd to word list\nAdd to word list\nrelating to the process or skill of writing music: This piece shows that he is developing an extraordinary compositional boldness.\nrelating to the way things are arranged in a picture: The landscape is in perfect tonal and compositional balance, where the dark shapes balance the light.\nMore examplesFewer examplesHe went through a period, lasting several years, of no compositional activity. I believe that expressive considerations determine many of Schubert's compositional choices.Fauré's compositional approach included a unique sense of modal colour and melodic development.He employed photographs as compositional aids in his painting.Raphael absorbed from the older artist a feeling for linear refinement, for compositional clarity.\nSMART Vocabulary: related words and phrases\nWriting, reading & studying music\nanti-musical\nbar\ncanonical\ncompose\ncomposition\ncompositionally\nmusically\nmusicologist\nmusicology\nnon-musical\norchestrate\nreorchestration\nrescore\nself-composed\nsheet music\nsight-read\ntranspose\ntransposition\nuncanonical\nunmusical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArt & culture\nPainting, drawing & printing\ncompositional adjective\n(PARTS OF STH)\nrelating to the parts, substances, etc. that form something: The authors look at forest compositional changes in eastern Canada since the 19th century.\nMore examplesFewer examplesThe Amendment changes the compositional basis of one of the branches of government. Figure 11 shows the compositional breakdown by gender for various professions.The study indicates that type 2 diabetes in humans is associated with compositional changes in intestinal microbiota.\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncomposition\ncompositionally\ncomprise\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitution\nconstitutive\nform\nfrom\nmake\nmake something up\nmulti-component\nof"}