{"id":104929,"name":"completed","type":"verb","us_sound":"kəmˈpliːt","us_link":"../audio/c/complete.mp3","uk_sound":"kəmˈpliːt","uk_link":"../audio/c/ukcompe018.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\ncomplete\ncomplete verb [T]\n(MAKE WHOLE)\nA2 to make whole or perfect: Complete the sentence with one of the adjectives provided. He only needs two more cards to complete the set. All she needed to complete her happiness was a baby.\nA2 to write all the details asked for on a form or other document: Have you completed your application form yet?\nMore examplesFewer examplesAt the last minute, we roped in a couple of spectators to complete the team.I need two more vases to complete the collection.The baby completed our family.Some heavy curtains completed the furnishings in the living room.Her family completed the list of guests.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\ncomplete verb [T]\n(FINISH)\nA2 to finish doing something: He's just completed filming his 17th feature film. The palace took over 20 years to complete. She will complete her studies in France.\nThesaurus: synonyms, antonyms, and examples\nto finish somethingfinishDid you finish your homework?endWhat time does the concert end?completeHave you completed the questionnaire?concludeShe concluded her speech by thanking everyone who had helped her.polish offHe's just polished off two huge bowls of pasta.wind upIt's time to wind up the game now.\nSee more results »\nMore examplesFewer examplesI have a lot of reading assignments to complete before the end of term.It is not practicable to complete the tunnel before the end of the year.How do you propose to complete the project in such a short time scale?Tick off each item on the list as you complete it.She managed to complete her last film well within budget.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\ncure\nhang\njack something in\nkill something stone-dead idiom\nknock\nknock off (something)\nlay\nlid\nlift\nraise\nstamp something out\nstanch\nstaunch\nstem\nstopper\nSee more results »"}