{"id":105083,"name":"composition","type":"noun","us_sound":"ˌkɑːm.pəˈzɪʃ.ən","us_link":"../audio/c/composition.mp3","uk_sound":"ˌkɒm.pəˈzɪʃ.ən","uk_link":"../audio/c/ukcompl013.mp3","content":"composition noun\n(MUSIC/ART)\nAdd to word list\nAdd to word list\nB2 [ C ] a piece of music that someone has written: This concerto is one of her earlier/later compositions.\nC2 [ U ] the process or skill of writing music: At music school I studied piano and composition.\nC2 [ C ] the way that people or things are arranged in a painting or photograph: a group composition\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nhook\nmedley\nmelody\nmulti-part\nnocturne\noctet\nopus\nreel\nsextet\nsignature tune\nsolo\nsong form\nstreetscape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting, reading & studying music\nArt & culture\nPainting, drawing & printing\ncomposition noun\n(PIECE OF WRITING)\nB1 [ C or U ] old-fashioned a short piece of writing about a particular subject, done by a student: a 200-word composition\nSMART Vocabulary: related words and phrases\nPapers and compositions\nboilerplate\ndissertation\nessay\nessay question\nessayistic\nmonograph\npalimpsest\npaper\npeer review\nprolusion\nreview\nthesis\ntract\ntreatise\ncomposition noun\n(FORMED FROM)\nC2 [ U ] the parts, substances, etc. that something is made of: the composition of the atmosphere\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncompositional\ncompositionally\ncomprise\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitution\nconstitutive\nform\nfrom\nmake\nmake something up\nmulti-component\nof\ncomposition noun\n(WRITING)\nAdd to word list\nAdd to word list\n[ C/U ]\n&#160; art, literature, music something that a person has created or written, esp. a text, a work of art, or a piece of music, or the act of creating or writing something: [ C ] a composition for piano and flute [ C ] In school we had to write a composition (= short piece of writing) on our favorite TV programs.\ncomposition noun\n(MIXTURE)\n[ U ] the mixture of things or people that are combined to form something: the composition of the atmosphere The composition of the city’s population has changed dramatically in the past 20 years.\nAdd to word list\nAdd to word list\n[ U ] the way in which the parts of something are arranged: the composition of sth The company said it plans to change the composition of its board of directors, creating a board composed predominantly of independent directors.\n[ U ]\n&#160; PRODUCTION a manufactured material made of more than one substance: Composition tiles have replaced asbestos tiles in public buildings.\n[ C, usually singular ]\n&#160; LAW an agreement in which someone who owes money pays less than is owed, in order to settle the debt more quickly: make a composition with sb If a person has at any time been made bankrupt or has made a composition with creditors, he is disqualified from being appointed as a trustee of the charity."}