{"id":105007,"name":"compliment","type":"noun","us_sound":"ˈkɑːm.plə.mənt","us_link":"../audio/c/compliment.mp3","uk_sound":"ˈkɒm.plɪ.mənt","uk_link":"../audio/c/ukcompl002.mp3","content":"Add to word list\nAdd to word list\nC2 [ C ] a remark that expresses approval, admiration, or respect: He complained that his husband never paid him any compliments anymore. I take it as a compliment (= I am pleased) when people say I look like my mother. Are you fishing for (= trying to get) compliments? Note: Do not confuse with complement.\nC2 [ S ] an action that expresses approval or respect: You should take it as a compliment when I fall asleep in your company - it means I'm relaxed. Thank you so much for your help - I hope one day I'll be able to return/repay the compliment (= do something good for you). my compliments... formal\nan expression of your admiration or respect: That was an excellent meal! My compliments to the chef.\nSee more with your compliments C2 formal\nIf you give something to someone with your compliments, you give it to that person free: We enclose a copy of our latest brochure, with our compliments.\nSee more\nSMART Vocabulary: related words and phrases\nRemarks & remarking\nair\nannotate\nannotation\nannotator\nbackbite\nbackbiting\nbarb\ncommentary\ndog whistle\nfelicity\ninnuendo\nlast word\nline\nmalediction\nmention\nplatitude\nprofundity\nremark\nsideswipe\nthrowaway\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPraising and applauding\nSee also\nbackhanded compliment\nleft-handed compliment\nC1 to praise or express admiration for someone: I was just complimenting Robert on his wonderful food. I must compliment you on your handling of a very difficult situation.\nThesaurus: synonyms, antonyms, and examples\nto praise someone or somethingpraiseLawmakers praised the bipartisan deal.congratulateI congratulated him on passing his driving test.complimentI was just complimenting Robert on the wonderful meal he has cooked.commendThe judge commended her for her bravery.pay tribute toHe paid tribute to the firefighters who had saved his daughter's life.flatterI knew he was only flattering me because he wanted to borrow some money.\nSee more results »\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\ndispatch\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\nAdd to word list\nAdd to word list\na remark or action that expresses approval, admiration, or respect: She paid him a high compliment by saying she read all his books. He was surprised by her remark, but decided to take it as a compliment.\nto express your approval, admiration, or respect to someone for that person's character, skill, etc.: I complimented Robert on his great cooking. compliment"}