{"id":104840,"name":"competition","type":"noun","us_sound":"ˌkɑːm.pəˈtɪʃ.ən","us_link":"../audio/c/competition.mp3","uk_sound":"ˌkɒm.pəˈtɪʃ.ən","uk_link":"../audio/c/ukcompa028.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] a situation in which someone is trying to win something or be more successful than someone else: Competition for jobs is intense. There's a lot of competition between computer companies. The two companies are in competition with each other. [ + to infinitive ] There's fierce competition to get into that school. Foreign competition (= similar products from other countries) had reduced their sales. Why are you jealous of her? She's no competition!\nA2 [ C ] an organized event in which people try to win a prize by being the best, fastest, etc.: a swimming/chess competition She's entered a crossword competition.humorous You don't need to eat so quickly! It's not a competition. the competition [ S ]\nthe person or people you are trying to be better than: The competition on the track looked fierce and her heart sank.\nMore examplesFewer examplesThe couple skated spectacularly throughout the competition.Win the house of your dreams in our fantastic competition!There have been a huge number of entries for this year's poetry competition.The prize money for literary competitions can be as high as £40 000.England has to win tonight's qualifying match to go through to the next round of the competition.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\npit\nrunners and riders idiom\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nCompetitors & participants in sports & games\nAdd to word list\nAdd to word list\nan activity done by a number of people or organizations, each of which is trying to do better than all of the others: [ U ] Competition for the job was fierce. [ U ] Traditional booksellers face stiff competition from companies selling via the Internet.\nThe competition is the people or organizations you are trying to do better than: [ U ] In this business, we always have to be aware of the competition.\nCompetition is also the activity of a sport in which each of the people or teams is trying to win, or a particular event at which this activity happens: [ U ] Few of the players on the team were experienced in international competition. [ C ] The figure-skating competition will be held in the main arena.\nbiology Competition is also a situation in which the various organisms living in the same area try to compete for a limited supply of food, water, space, etc. competitor noun [ C ] us\nYour browser doesn't support HTML5 audio\n/kəmˈpet̬·ɪ·t̬ər/\nHe’s a tough competitor and will probably do well in business.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; ECONOMICS the situation in which people or businesses are trying to be more successful than each other, for example by making more sales in a market: There has always been competition between the auto manufacturers. stiff/fierce/strong/tough competition Some healthy competition (= competition that is a good thing) makes everyone work harder. The decision to sell cheap TVs put the supermarket in (direct) competition with the major suppliers of electrical goods. foreign/global/ international competitiongrowing/increasing competition US companies face increasing competition from Eastern markets. Politicians argued that subsidies stifled free competition. Traditional banks face competition from internet-based finance companies. Critics say merging the two largest manufacturers could stifle competition (= prevent competition).\nthe competition\nCOMMERCE, MARKETING the people or businesses who are competing with a particular person or business in a particular market: Longer hours should give the store an advantage over the competition.keep/stay ahead of the competition The company had to make drastic changes if it was to stay ahead of the competition. See also\nfree competition\nimperfect competition\nperfect competition\nprice competition"}