{"id":104977,"name":"compliance","type":"noun","us_sound":"kəmˈplaɪ.əns","us_link":"../audio/c/compliance.mp3","uk_sound":"kəmˈplaɪ.əns","uk_link":"../audio/c/ukcompe025.mp3","content":"Add to word list\nAdd to word list\nthe act of obeying a law or rule, especially one that controls a particular industry or type of work: It is the job of the inspectors to enforce compliance with the regulations. The company said that it had always acted in compliance with environmental laws. They will conduct yearly audits to ensure compliancy with the latest regulations.\nthe act of doing everything that someone tells or wants you to do: It's his compliance that amazes me. They give orders and they expect absolute compliance. The parents use positive reinforcement to gain their child's compliancy.\nMore examplesFewer examplesKnowledge of banking and regulatory compliance is required for this post.Our cake is made in strict compliance with the original recipe.We have been working diligently to ensure compliance.In this industry, compliancy with the highest safety standards is key.We hope that the new policy will result in a higher compliancy rate.\nSMART Vocabulary: related words and phrases\nObedient and compliant\naccordance\nacquiescent\nacquiescently\nadherence\ncreature\ndutiful\ndutifully\neasy\nfollower\nfollowership\nI'm easy idiom\npursuant\nsheep\nsheeple\nslavish\nslavishly\nsomeone's answer to someone/something idiom\nsubservience\ntie\nyielding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReady and willing\nAdd to word list\nAdd to word list\nLAW the fact of obeying a particular law or rule, or of acting according to an agreement: compliance with sth He pointed to the building's lack of compliance with building standards for the disabled.compliance costs/procedures/standards, etc. The law imposes significant compliance costs on US businesses and is a deterrent to price competition. We've been working hard to remain in compliance with all air pollution control laws. Compare\nnon-compliance"}