{"id":104928,"name":"complete","type":"verb","us_sound":"kəmˈpliːt","us_link":"../audio/c/complete.mp3","uk_sound":"kəmˈpliːt","uk_link":"../audio/c/ukcompe018.mp3","content":"complete verb [T]\n(MAKE WHOLE)\nAdd to word list\nAdd to word list\nA2 to make whole or perfect: Complete the sentence with one of the adjectives provided. He only needs two more cards to complete the set. All she needed to complete her happiness was a baby.\nA2 to write all the details asked for on a form or other document: Have you completed your application form yet?\nMore examplesFewer examplesAt the last minute, we roped in a couple of spectators to complete the team.I need two more vases to complete the collection.The baby completed our family.Some heavy curtains completed the furnishings in the living room.Her family completed the list of guests.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\ncomplete verb [T]\n(FINISH)\nA2 to finish doing something: He's just completed filming his 17th feature film. The palace took over 20 years to complete. She will complete her studies in France.\nThesaurus: synonyms, antonyms, and examples\nto finish somethingfinishDid you finish your homework?endWhat time does the concert end?completeHave you completed the questionnaire?concludeShe concluded her speech by thanking everyone who had helped her.polish offHe's just polished off two huge bowls of pasta.wind upIt's time to wind up the game now.\nSee more results »\nMore examplesFewer examplesI have a lot of reading assignments to complete before the end of term.It is not practicable to complete the tunnel before the end of the year.How do you propose to complete the project in such a short time scale?Tick off each item on the list as you complete it.She managed to complete her last film well within budget.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\ncomplete adjective\n(VERY GREAT)\nB1 [ before noun ] very great or to the largest degree possible: The man's a complete fool! I need a break, a complete change of scene. I made a complete and utter mess of it!\nMore examplesFewer examplesI have complete confidence in her. She'll be perfect for the job.All replies will be treated with complete confidentiality.At school she had complete contempt for all her teachers.His answer demonstrated a complete lack of understanding of the question.The evening was a complete disaster.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\ncomplete adjective\n(WHOLE)\nB1 with all the parts: the complete works of Oscar Wilde The report comes complete with (= including) diagrams and colour photographs. Sun, sand, and romance - her holiday was complete.\nMore examplesFewer examplesShe bought me the complete dramatic works of Brecht for my birthday.We are now offering you the chance to buy the complete set of pans at half price.Our complete range of carpets is on display in our showroom.If we all club together, we'll be able to get her the complete dinner set.The demonstrators seemed to represent a complete cross-section of society - male and female, old and young, rich and poor.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\ncomplete adjective\n(WHOLE)\nAdd to word list\nAdd to word list\ncontaining all the parts or pieces; whole: a complete set of dishes the complete works of Dickens We wanted a complete record of what everyone said.\ncomplete adjective\n(VERY GREAT)\nvery great, without limit, or to the largest degree possible: The trip began in complete confusion. She gave me a look of complete indifference. Toby and Alfredo are complete opposites. completely adverb us\nYour browser doesn't support HTML5 audio\n/kəmˈplit·li/\nTo be completely honest, I was too scared to say anything.\ncomplete verb [T]\n(FINISH)\nto finish doing something: John has completed 15 marathons. She completed three years of college, and then took a year off.\ncomplete verb [T]\n(MAKE WHOLE)\nto supply all the parts or pieces needed to make something whole: She needed one more course to complete the requirements for a teaching degree. completion noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kəmˈpli·ʃən/\nHe was the architect who supervised the completion of the hotel."}