{"id":105047,"name":"component","type":"noun","us_sound":"kəmˈpoʊ.nənt","us_link":"../audio/c/component.mp3","uk_sound":"kəmˈpəʊ.nənt","uk_link":"../audio/c/ukcompl005.mp3","content":"Add to word list\nAdd to word list\nC1 a part that combines with other parts to form something bigger: television/aircraft/computer components The factory supplies electrical components for cars. The course has four main components: business law, finance, computing and management skills. Fresh fruit and vegetables are an essential component of a healthy diet. The control of inflation is a key component of the government's economic policy.\nMore examplesFewer examplesDecoding the paintings is not difficult once you know what the component parts symbolize.The whole car can be modelled on a computer before a single component is made.Good communication is an important component of any relationship.Freudian theory is a key component of his therapy.The machine has a lot of delicate components.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\nmulti-component\npanel\npiece\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nsubsegment\nSee more results »\nAdd to word list\nAdd to word list\none of the parts of a system, process, or machine: Fair pay for child-care providers is a vital component of welfare reform.\nphysics A component of a vector is one of the things that the vector represents, such as force or speed.\nAdd to word list\nAdd to word list\nPRODUCTION a part that combines with other parts to make a machine or piece of equipment: automobile/computer, etc. component The company is a leading manufacturer of automobile components.\na particular feature or part of something: essential/key/major, etc. component The major components of the transport system include the road network, railway system, air transport services, and ports and shipping services."}