{"id":105113,"name":"compound","type":"noun","us_sound":"ˈkɑːm.paʊnd","us_link":"../audio/c/compound_01_00.mp3","uk_sound":"ˈkɒm.paʊnd","uk_link":"../audio/c/ukcompl019.mp3","content":"compound noun [C]\n(COMBINATION)\nAdd to word list\nAdd to word list\nchemistry\n&#160; specialized a chemical that combines two or more elements: Salt is a compound of sodium and chlorine. Many fertilizers contain nitrogen compounds.\nformal something consisting of two or more different parts: Then there was his manner, a curious compound of humour and severity.\nlanguage\n&#160; specialized a word that combines two or more different words. Often, the meaning of the compound cannot be discovered by knowing the meaning of the different words that form it. Compounds may be written either as one word or as separate words: 'Bodyguard' and 'floppy disk' are two examples of compounds.\nSMART Vocabulary: related words and phrases\nChemistry: types of chemical\nacid salt\naerogel\nalkali metal\nalkaline\nalkalinity\nalkaloid\nantioxidant\ncarbohydrate\ncoolant\ninorganic\nketone\nlectin\nmelamine\nmethyl orange\nmonomer\nmonosaccharide\nmothball\npropellant\nsaline\nsulphide\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplexity\nLinguistics: morphology & parts of words\ncompound noun [C]\n(AREA)\nan area surrounded by fences or walls that contains a group of buildings: The gates opened and the troops marched into their compound. The embassy compound has been closed to the public because of a bomb threat.\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncourt\ncourtyard\nfarmyard\nforecourt\nformal\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nyard\nSee more results »\nGrammar\nCompoundsA compound word is two or more words linked together to produce a word with a new meaning: …\nCompound wordsA compound word is two or more words linked together to produce a word with a new meaning: …\nCompound sentencesA compound sentence has two or more main clauses linked by coordinating conjunctions, such as and, but: …\nNouns: compound nounsSome nouns consist of more than one word. These are compound nouns. Compound nouns can be formed in different ways. The most common way is to put two nouns together (noun + noun); other common types are adjective + noun and verb + noun. …\nCompound verbsCompound verbs are two words which combine to make one meaning. The first word is usually a noun, an adjective or a preposition, and the second word is a verb. The words are sometimes written as one word and sometimes joined by hyphens. A good learner’s dictionary will tell you how the compound is normally written: …\nWord formationThere are four main kinds of word formation: prefixes, suffixes, conversion and compounds. …\nPrefixesWe add prefixes before the base or stem of a word. …\nSuffixesWe add suffixes after the base or stem of a word. The main purpose of a suffix is to show what class of word it is (e.g. noun or adjective). …\nConversionConversion involves the change of a word from one word class to another. For example, the verbs to email and to microwave are formed from the nouns email and microwave: …\nCompoundingWhen we use compounding, we link together two or more bases to create a new word. Normally, the first item identifies a key feature of the second word. For example, the two bases back and ache can combine to form the compound noun backache, and the two bases post and card combine to form the compound noun postcard. …\nAbbreviationAbbreviation involves shortening a word. We do this in three main ways: clipping, acronyms and blends. …\nBack-formationWe form words with back-formation when we remove part of a word, usually something which we think is a suffix (or occasionally a prefix). We do this commonly when we form verbs from nouns. …\ncompound verb\n(WORSEN)\n[ T often passive ] to make a problem or difficult situation worse: Her terror was compounded by the feeling that she was being watched. His financial problems were compounded when he unexpectedly lost his job. Severe drought has compounded food shortages in the region.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\ncompound verb\n(COMBINE)\n[ T ] to mix two things together: Most tyres are made of rubber compounded with other chemicals and materials.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nconsisting of two or more parts\nfinance &amp; economics\n&#160; specialized used to refer to a system of paying interest in which interest is paid both on the original amount of money invested (= given to companies hoping to get more back) or borrowed and on the interest that has collected over a period of time: compound interest The investment fund has achieved annual compound returns of 18.2 percent.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\nfancily\nfinicky\nhigh-tech\nindirectly\ninsolubility\nmultilayer\nonerousness\nornate\nornately\nover-elaborate\ntortuous\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInterest & capital\nGrammar\nCompoundsA compound word is two or more words linked together to produce a word with a new meaning: …\nCompound wordsA compound word is two or more words linked together to produce a word with a new meaning: …\nCompound sentencesA compound sentence has two or more main clauses linked by coordinating conjunctions, such as and, but: …\nCompound verbsCompound verbs are two words which combine to make one meaning. The first word is usually a noun, an adjective or a preposition, and the second word is a verb. The words are sometimes written as one word and sometimes joined by hyphens. A good learner’s dictionary will tell you how the compound is normally written: …\nWord formationThere are four main kinds of word formation: prefixes, suffixes, conversion and compounds. …\nPrefixesWe add prefixes before the base or stem of a word. …\nSuffixesWe add suffixes after the base or stem of a word. The main purpose of a suffix is to show what class of word it is (e.g. noun or adjective). …\nConversionConversion involves the change of a word from one word class to another. For example, the verbs to email and to microwave are formed from the nouns email and microwave: …\nCompoundingWhen we use compounding, we link together two or more bases to create a new word. Normally, the first item identifies a key feature of the second word. For example, the two bases back and ache can combine to form the compound noun backache, and the two bases post and card combine to form the compound noun postcard. …\nAbbreviationAbbreviation involves shortening a word. We do this in three main ways: clipping, acronyms and blends. …\nBack-formationWe form words with back-formation when we remove part of a word, usually something which we think is a suffix (or occasionally a prefix). We do this commonly when we form verbs from nouns. …\ncompound noun [C]\n(COMBINATION)\nAdd to word list\nAdd to word list\na mixture of two or more different parts or elements: His jokes have been described as a compound of fears, anxieties, and insecurities.\nchemistry A compound is a chemical substance that combines two or more elements.\ngrammar A compound is a word consisting of two or more words: \"Black eye\" and \"teaspoon\" are compounds.\ncompound noun [C]\n(AREA)\na fenced or enclosed area that contains buildings: We left the compound early to find and photograph wild animals.\nto make something worse by increasing or adding to it: Lack of rain compounded the problems farmers are having.\nAdd to word list\nAdd to word list\nused to describe a system of calculating interest in which it is paid on both the amount of money invested or borrowed and on the interest that has been added to it: The investment has grown $1,000 into $3,552 over five years, a compound annual return of 28.6%.\nto calculate interest on both the amount of money invested or borrowed and on the interest that has been added to it: Interest will be compounded every six months. See also\ncompound interestCompare\nsimple interest"}