{"id":104884,"name":"complaining","type":"noun","us_sound":"kəmˈpleɪ.nɪŋ","us_link":"../audio/c/cdo0319uscomp0372.mp3","uk_sound":"kəmˈpleɪ.nɪŋ","uk_link":"","content":"Add to word list\nAdd to word list\nthe act of saying that something is wrong or not satisfactory: I hear a lot of complaining about the technology not working as it should.\nMore examplesFewer examplesIf anyone was disappointed she didn't have a band behind her, I didn't hear any complaining.There's been a lot of complaining by certain groups, but I don't see a problem.The key to leadership is for us to accept 100% responsibility for results, with no excuses, no complaining, and no blaming of other people.He is driving everyone mad with his constant complaining.\nSMART Vocabulary: related words and phrases\nComplaining\nbe/go on at someone idiom\nbellyaching\nbemoan\nbewail\nbrouhaha\nbugger, sod, etc. this for a lark! idiom\ncarping\nclamour\ncomplain\ncreate/kick up/raise a stink idiom\ngnashing of teeth idiom\nmake noises idiom\nmutter\nnag\nsquawk\nstart on at someone\nunreported\nvituperation\nvituperatively\nwhinging\nSee more results »\nsaying that something is wrong or not satisfactory: I was a little shocked and asked him if they accused all their complaining customers of being liars? Then he began to speak in a high, complaining voice.\nMore examplesFewer examplesThose parents who placate their complaining children with cakes are often feeding their deprived-child selves.I insisted on dragging my complaining husband out for a brisk walk.Victimless crimes tend to have no complaining parties other than the police.\nSMART Vocabulary: related words and phrases\nComplaining\nbe/go on at someone idiom\nbellyaching\nbemoan\nbewail\nbrouhaha\nbugger, sod, etc. this for a lark! idiom\ncarping\nclamour\ncomplain\ncreate/kick up/raise a stink idiom\ngnashing of teeth idiom\nmake noises idiom\nmutter\nnag\nsquawk\nstart on at someone\nunreported\nvituperation\nvituperatively\nwhinging\nSee more results »"}