{"id":104702,"name":"compare","type":"verb","us_sound":"kəmˈper","us_link":"../audio/c/compare.mp3","uk_sound":"kəmˈpeər","uk_link":"../audio/c/ukcommu030.mp3","content":"compare verb [T]\n(EXAMINE DIFFERENCES)\nAdd to word list\nAdd to word list\nB1 to examine or look for the difference between two or more things: If you compare house prices in the two areas, it's quite amazing how different they are. That seems expensive - have you compared prices in other shops? Compare some recent work with your older stuff and you'll see how much you've improved. This road is quite busy compared to/with ours. Children seem to learn more interesting things compared to/with when we were at school.\nMore examplesFewer examplesIf you compare the two books side by side, it is clear that the author of the second has plagiarized (from the first).The number of people who applied for the course was 120 compared with an initial estimate of between 50 and 100.I thought myself very sophisticated compared with my relatives in the country.This matter really isn't very important if you compare it to the other problems we've got to deal with.The judges compared all the cakes in the cake competition for taste, texture, colour and general appearance.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitively\ncontradistinction\ncontrast\ncontrastive\ncontrastively\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\ncompare verb [T]\n(CONSIDER SIMILARITIES)\nto judge, suggest, or consider that something is similar or of equal quality to something else: The poet compares his lover's tongue to a razor blade. Still only 25, she has been compared to the greatest dancer of all time. People compared her to Elizabeth Taylor. You can't compare the two cities - they're totally different. does not compare\nIf something or someone does not compare with something or someone else, the second thing is very much better than the first: Instant coffee just doesn't compare with freshly ground coffee.\nSee more compare favourably\nIf something compares favourably with something else, it is better than it: The hotel certainly compared favourably with the one we stayed in last year.\nSee more\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitively\ncontradistinction\ncontrast\ncontrastive\ncontrastively\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\nIdiom\ncompare notes\nbeyond compare\nso good that everyone or everything else is of worse quality: Her beauty is beyond compare.\nSee more\ncompare verb\n(EXAMINE DIFFERENCES)\nAdd to word list\nAdd to word list\n[ T ] to examine or look for the differences between persons or things: This store’s prices are high compared to what some other stores charge.\ncompare verb\n(CONSIDER SIMILARITIES)\n[ I/T ] to consider or suggest that something is similar or equal to something else: [ I ] Instant coffee doesn’t compare with freshly ground coffee (= fresh coffee is much better). Idiom\ncompare notes"}