{"id":104809,"name":"compensation","type":"noun","us_sound":"ˌkɑːm.penˈseɪ.ʃən","us_link":"../audio/c/compensation.mp3","uk_sound":"ˌkɒm.penˈseɪ.ʃən","uk_link":"../audio/c/ukcompa021.mp3","content":"compensation noun\n(MONEY)\nAdd to word list\nAdd to word list\n[ U ] money that is paid to someone in exchange for something that has been lost or damaged or for some problem: She received £40,000 in compensation for a lost eye. You should claim/seek compensation. a compensation claim\nMore examplesFewer examplesShe admitted her company's responsibility for the disaster and went on to explain how compensation would be paid to the victims.The small amount of compensation is a further source of grievance to the people forced to leave their homes.Going to court to obtain compensation is a long process.You'll have to spend a small fortune in legal fees if you decide to sue for compensation.We were given five hundred pounds in compensation which isn't much but at least it's something.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\ncompensation noun\n(EXCHANGE)\n[ C or U ] something that makes you feel better when you have suffered something bad: I have to spend three months of the year away from home - but there are compensations like the chance to meet new people. Free food was no compensation for a very boring evening.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\ncompensation noun\n(JOB PAYMENT)\n[ U ] the combination of money and other benefits (= rewards) that an employee receives for doing their job: Annual compensation for our executives includes salary and bonus under our incentive plan.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nRelated word\ncompensatory\nAdd to word list\nAdd to word list\nHR the combination of payment and other benefits that an employee receives for doing their job: Annual compensation for our executives includes salary, bonus, and other benefits. Poor compensation may be hurting recruiting and retention efforts in nursing schools.\nLAW, INSURANCE money that is paid to someone because they have been hurt, or because something has been lost or damaged: If you can prove that someone else was to blame for your accident, you will be entitled to compensation. In a case like this, there is no limit to the compensation that can be awarded. seek compensation for injury a compensation claim See also\nemployee compensation\nsocial security compensation\nunemployment compensation"}