{"id":104945,"name":"complex","type":"adjective","us_sound":"kɑːmˈpleks","us_link":"../audio/c/eus70919.mp3","uk_sound":"ˈkɒm.pleks","uk_link":"../audio/c/ukcompe022.mp3","content":"Add to word list\nAdd to word list\nB2 involving a lot of different but related parts: a complex molecule/carbohydrate a complex network of roads a complex procedure The company has a complex organizational structure.\nB2 difficult to understand or find an answer to because of having many different parts: It's a very complex issue to which there is no straightforward answer. The film's plot was so complex that I couldn't follow it.\nThesaurus: synonyms, antonyms, and examples\nnot easy to deal with or understanddifficultIt's very difficult to find a job in this city. hardThe exam was really hard.complicatedThe instructions were so complicated I just couldn't follow them.complexDesigning a house is a complex process.trickyIt's quite tricky getting the puzzle pieces to fit together.\nSee more results »\nMore examplesFewer examplesI find it hard to get my mind round such complex issues.The structure of this protein is particularly complex.It is a simple melody with complex harmonies.The writer has used several complex grammatical constructions.She always manages to cut through the complex theory and get at the facts.\nSMART Vocabulary: related words and phrases\nComplexity\nadvanced\nall-singing\nbaroque\nbaroquely\nbe more to something than meets the eye idiom\nfancily\nfinicky\nhigh-tech\nindirectly\ninsolubility\nmultilayer\nonerousness\nornate\nornately\nover-elaborate\ntortuous\ntortuously\ntortuousness\nultra-sophisticated\nwheels within wheels idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult to understand\ncomplex noun [C]\n(BUILDING)\nC1 a large building with various connected rooms or a related group of buildings: a shopping/sports and leisure complexUS They live in a large apartment complex.\nMore examplesFewer examplesThey're planning to develop the whole site into a shopping complex.The hotel complex was a honeycomb of rooms and courtyards .The Council plans to knock the library down and replace it with a hotel complex.The office complex has an on-site nursery.They're building a new sports complex on the waterside.\nSMART Vocabulary: related words and phrases\nPublic buildings\nart gallery\nbasilica\nbathhouse\ncentre\nchancellery\nfoundation stone\ngallery\nguildhall\nhall\nHall of Fame\noffice building\npavilion\npublic library\nreference library\nregister office\nregistry\nteardown\ntelephone exchange\ntown hall\nziggurat\nSee more results »\ncomplex noun [C]\n(BAD FEELING)\nC2 a particular anxiety or unconscious fear that a person has, especially as a result of an unpleasant experience that they have had in the past or because they have a low opinion of their own worth: an inferiority complex I think he's got a complex about being bald. Don't go on about her weight - you'll give her a complex!\nSMART Vocabulary: related words and phrases\nMental illnesses\nad\nadjustment disorder\nage-associated memory impairment\nanhedonia\nanorexia nervosa\nanorexic\nattention deficit hyperactivity disorder\ngeneralized anxiety disorder\nhealth anxiety\nhoard\nhoarder\nhoarding\nmanic depression\nobsessive-compulsive disorder\npsychosis\nsad\nscarred\nself-alienation\nsenility\nsociopathic\nSee more results »\nAdd to word list\nAdd to word list\nhaving many parts related to each other in ways that may be difficult to understand: a complex surgical procedure The question of who is legally responsible is a complex issue. complexity noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/kəmˈplek·sɪ·t̬i/\n[ U ] You must understand the variety and complexity of tasks assigned to the police.\ncomplex noun [C]\n(BUILDING)\na group of buildings that are related, or a large building having different parts: an apartment complex for elderly people\ncomplex noun [C]\n(ATTITUDES)\na group of attitudes and feelings that influence a person’s behavior, often in a negative way: an inferiority complex"}