{"id":104660,"name":"company","type":"noun","us_sound":"ˈkʌm.pə.ni","us_link":"../audio/c/company.mp3","uk_sound":"ˈkʌm.pə.ni","uk_link":"../audio/c/ukcommu026.mp3","content":"company noun\n(BUSINESS)\nAdd to word list\nAdd to word list\nA2 [ C ] an organization that sells goods or services in order to make money: He works for a software company/a company that makes software. I work for Duggan and Company. No smoking is company policy.\nMore examplesFewer examplesThe commercial future of the company looks very promising.The company is concentrating on developing new products.The law obliges companies to pay decent wages to their employees.PolyGram is one of the world's largest record companies.In the space of just ten years, her company has grown from one small shop to a multi-million-pound empire.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\ncompany noun\n(OTHER PEOPLE)\nB2 [ U ] the fact of being with a person or people, or the person or people you are with: I just enjoy his company. It was a long trip and I was grateful for his company. I enjoy my own company (= I like being alone). I travelled in the company of (= with) two teachers as far as Istanbul. I'd rather you didn't mention it when we're in company (= with other people). I didn't realize you had company (= were with someone/people). Margot came to stay for a week as company for my mother while I was away. With only her thoughts for company (= being alone), she walked slowly along the beach. be good company\nC1 to be pleasant and entertaining to be with: You'll like Rosie - she's good company.\nSee more for company\nIf you do something for company, you do it to make you feel as if you are not alone: I usually have the radio on for company.\nSee more keep someone company\nB2 to stay with someone so that they are not alone: I'll keep you company till the train comes.\nSee more\nMore examplesFewer examplesYou should take it as a compliment when I fall asleep in your company - it means I'm relaxed.She didn't mix with her contemporaries, preferring the company of older people.Where have you been? We've been deprived of your company for far too long!She entranced them with her intellect and the joy of her company.I can't stand academics - present company excepted .\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintance\nacquaintanceship\nacquainted\nacquainted with someone\namigo\ncompatriot\ncomrade\ncrony\ncrowd\nfair-weather friend\nfam\nflatmate\nintimate\nneighbour\noppo\npal\npeeps\npeer group\npen pal\nSee more results »\ncompany noun\n(THEATRICAL GROUP)\n[ C ] a group of actors, singers, or dancers who perform together: She's in the National Theatre Company. I'd like to thank the director, the choreographer and the other members of the company for being so supportive.\nMore examplesFewer examplesHe founded his own dance company.She works for a theatre company in Leeds.All the members of the company took the stage for a bow.\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactor\nactress\nall-star\nalum\nbelly dancer\ncast\nchorus\nheadliner\nimproviser\njuvenile lead\nleading lady\nleading man\nperformer\nscream queen\nspear carrier\nstage name\nstarlet\nstooge\nsuperstar\ntroupe\nSee more results »\ncompany noun\n(GROUP)\n[ C, + sing/pl verb ] a large group of soldiers. especially a division of a battalion\n[ C, + sing/pl verb ] UK an organized group of young women who are Guides: My cousin and I joined the same Guide company.\nSMART Vocabulary: related words and phrases\nParts of armies & groups of servicemen\nbaggage train\nbattalion\nbomb disposal\nbomb squad\ncadre\ncavalry\nCoast Guardsman\ncorps\ndetachment\nGuards\nmilitia\nparatroops\npatrol\nsquad\nsquadron\ntask force\nthe Coast Guard\nthe Marine Corps\nthe tip of the spear idiom\nWRAC\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nIdioms\nbe in good company\nthe company someone keeps\ncompany noun\n(BUSINESS)\nAdd to word list\nAdd to word list\n[ C ] an organization that produces or sells goods or services in order to make a profit: He owns part of a company that manufactures software for personal computers.\ncompany noun\n(OTHER PEOPLE)\n[ U ] the state of having someone with you, or the person or people who are with you: It was a long trip and I was grateful for his company. I traveled to Chicago in the company of two teachers (= with them). We’re having company (= guests) for dinner tonight.\ncompany noun\n(GROUP)\n[ C ] a group of people who work or perform together: She’s spending the summer as part of a touring theatrical company.\n[ C ] A company is also a military unit consisting of a large group of soldiers, usually with a captain in charge of them.\nAdd to word list\nAdd to word list\nan organization that sells goods or services in order to make money: a big/large/small, etc. company We're a medium-sized company giving good value for money.join/work for/leave a company Her husband has worked for the same company for 18 years.set up/found/establish a company They want to set up a company selling children's clothing.run/own a company She runs a company designing interactive computer programmes, websites, and CD-ROMS.dissolve/liquidate a company This flowchart shows the steps you need to take in order to liquidate your company.buy/buy out/take over a company The bank had bought out the company for $29 a share.a company expands/shrinks At that time the company was expanding rapidly, opening a new branch every couple of months.a company fails/ goes bankrupt/goes into liquidation Hargreaves lost thousands when the company went bankrupt. company executives/policy/profits See also\nand Company\nassociated company\nblue chip noun\ncable company\nclose company\nclosed company\nclosely held company\nclosed-end investment company\ncommercial company\nconstituent company\nView all\ncontrolling company\ncredit company\ndaughter company\ndock company\ndual listed company\nfinance company\nholding company\ninsurance company\ninvestment company\njoint-stock company\nlimited company\nlisted company\nmanagement company\nmutual noun\nmutual insurance company\noffshore company\noff-the-shelf company\nopen-ended investment company\nparent company\nprivate company\nprivate limited company\nproperty company\nproprietary company\npublic company\npublic limited company\nquoted company\nreal estate company\nred chip\nregistered company\nrelated company\nshelf company\nshell\nsmall company\nSmall Business Investment Company\nstart-up\nstatutory company\nstock company\nsubsidiary\ntarget company\ntrading company\ntrust company\nunit trust company\nunlimited company\nunquoted company"}