{"id":104888,"name":"complaint","type":"noun","us_sound":"kəmˈpleɪnt","us_link":"../audio/c/complaint.mp3","uk_sound":"kəmˈpleɪnt","uk_link":"../audio/c/ukcompe013.mp3","content":"complaint noun\n(REPORT OF A PROBLEM)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a statement that something is wrong or not satisfactory: We've received a complaint from one of our listeners about offensive language. I've made a complaint (= formally complained) to the police about the noise. [ + that ] We've had complaints that you've been playing your radio too loud. Do you have any grounds for complaint (= reason to formally complain)?\nThesaurus: synonyms, antonyms, and examples\nto say something is not right or satisfactorycomplainI hate to complain, but the film was terrible.grumbleShe's always grumbling about something.whineI hope you don't think I'm just whining.kvetchStop kvetching about it!make a fussIf the food doesn't come soon, I'm going to make a fuss.file a complaintI've filed a complaint with the police about the noise.\nSee more results »\nMore examplesFewer examplesThe manufacturers are reported to have received a long list of complaints from dissatisfied customers.The company has new procedures for dealing with complaints.We've received lots of complaints about the changes from regular listeners to the programme.My lawyer is going to compose a letter of complaint.I wish to make a complaint - these chips are cold.\nSMART Vocabulary: related words and phrases\nComplaining\nbe/go on at someone idiom\nbellyaching\nbemoan\nbewail\nbrouhaha\nbugger, sod, etc. this for a lark! idiom\ncarping\nclamour\ncomplain\nmake noises idiom\nmutter\nnag\npardon\nrepresentation\nsquawk\nstart on at someone\nunreported\nvituperation\nvituperatively\nwhiner\nSee more results »\ncomplaint noun\n(ILLNESS)\n[ C ] an illness: a heart/stomach complaint\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\nindustrial disease\ninfantile\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nAdd to word list\nAdd to word list\na statement that something is wrong or not good enough, the act of complaining, or the thing you are complaining about: [ U ] a letter of complaint [ C ] Her only complaint is that she sometimes didn’t get enough heat in her apartment.\nlaw A complaint is also a formal statement to a government authority that you have a legal cause to complain about the way you have been treated: [ C ] He filed a complaint with the commission, charging discrimination based on his disability.\nAdd to word list\nAdd to word list\n[ C ] a written or spoken statement in which someone says that somebody has done something wrong or that something is not satisfactory: lodge/make/receive a complaint The council has said that it received complaints but that it cannot disclose details.deal with/handle complaints They have an efficient system in place for dealing with customer complaints.complaint about sb/sth The gas company has promised to investigate the man's complaint about a quarterly bill for £1,500.complaint against sb/sth Complaints against an employment agency should be made to the Employment Agencies Standards office.\n[ C or U ] the act of complaining, or a reason for someone to complain: The biggest complaint about the new proposal is that it could increase costs.cause/grounds for complaint On this occasion, shareholders have little cause for complaint. We have received several letters of complaint.\n[ C ]\n&#160; LAW a formal statement that someone has harmed somebody else or done something illegal, which must be proved in a court of law: file/lodge a complaint A complaint alleging financial wrongdoing was lodged with the district attorney's office."}