{"id":104756,"name":"compatible","type":"adjective","us_sound":"kəmˈpæt̬.ə.bəl","us_link":"../audio/c/eus70914.mp3","uk_sound":"kəmˈpæt.ə.bəl","uk_link":"../audio/c/ukcompa010.mp3","content":"Add to word list\nAdd to word list\nC1 able to exist, live, or work successfully with something or someone else: It was when we started living together that we found we just weren't compatible. Such policies are not compatible with democratic government. Are their two blood groups compatible (= can blood from one person be given to the other person)?\nable to be used with a particular type of computer, machine, device, etc.: This software may not be compatible with older operating systems. Most models of coffee maker are compatible with only certain brands of coffee pods. The cartridges can be used in any compatible printer.\nMore examplesFewer examplesAn MP's job is just not compatible with family life, especially when the children are very young.Do you think that idea is compatible with your Christian faith?Each department in the company has its own mode of operation and none of them are compatible.This software allows you to write files from compatible CD-RW drives.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nanswer\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nfind your own level idiom\nlevel\norder\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nunworthy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nRelated words\ncompatibility\ncompatibly\nAdd to word list\nAdd to word list\nable to exist or work with something else, or (of a person) able to live or work with someone else: The computer software isn’t compatible with your operating system. Levine said he is lucky he and his roommate are compatible.\nCompatible also means being suitable or right for each other: Their blood types are not compatible, so we cannot use his blood. compatibility noun [ C/U ] us/kəmˌpæt̬·əˈbɪl·ɪ·t̬i/\nAdd to word list\nAdd to word list\nIT if a computer or other piece of equipment is compatible with something else, it is able to work successfully with it: This software may not be compatible with older operating systems. We offer our customers the choice between original and compatible ink cartridges.\nIT a computer that is able to work with other computers or that can use the same computer programs: In the 1980s, after IBM licensed the DOS operating system, companies started producing personal computers that were called IBM compatibles.\nsomething that can be used with a piece of equipment from a particular manufacturer, instead of using an original item from the same manufacturer: Should you use original toner cartridges or compatibles?"}