{"id":104973,"name":"comply","type":"verb","us_sound":"kəmˈplaɪ","us_link":"../audio/c/comply.mp3","uk_sound":"kəmˈplaɪ","uk_link":"../audio/c/ukcompl004.mp3","content":"Add to word list\nAdd to word list\nC1 to act according to an order, set of rules, or request: He's been ordered to have the dog destroyed because it's dangerous, but he refuses to comply. There are serious penalties for failure to comply with the regulations. Synonym\nfollow\nThesaurus: synonyms, antonyms, and examples\nto obey someone or somethingobeyChildren must obey their parents.followAll religions guide youths to follow the teachings of elders and parents.complyThere are serious penalties for failure to comply with the regulations.observePeople must observe the law.adhere toThey failed to adhere to the terms of the agreement.abide byPlayers must abide by the referee's decision.\nSee more results »\nMore examplesFewer examplesThe court issued a contempt citation against city council members who refused to comply with a court order.He was happy to comply without any further urging from me.He was jailed for refusing to comply with the court order.The builders have not complied with the architect's instructions.She had very set views about the funeral, and everyone was happy to comply with her wishes.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nviolation\nSee more results »\nAdd to word list\nAdd to word list\nto obey an order, rule, or request: Comosa says he will comply with the judge’s ruling. compliance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kəmˈplɑɪ·əns/\nfml The company said that it had always acted in compliance with environmental laws.\nAdd to word list\nAdd to word list\nLAW to obey a particular rule or law, or act according to an agreement: comply with sth The state's mining law requires mine operators to comply with local land use regulations."}