{"id":104908,"name":"complement","type":"verb","us_sound":"ˈkɑːm.plə.ment","us_link":"../audio/c/complement.mp3","uk_sound":"ˈkɒm.plɪ.ment","uk_link":"../audio/c/ukcompe016.mp3","content":"Add to word list\nAdd to word list\nto make something else seem better or more attractive when combining with it: Strawberries and cream complement each other perfectly. The music complements her voice perfectly. Note: Do not confuse with compliment.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nlanguage\n&#160; specialized a part of a clause that usually follows the verb in English and adds more information about the subject or object\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nGrammar\nComplementsComplements are one of the five major elements of clause structure. The other four are subject, verb, object and adjunct (complements are in bold): …\nSubject and object complementsIn clauses with linking verbs (be, seem, become), complements which follow the verb and which add information about the subject are called subject complements: …\nComplements and adjunctsComplements and adjuncts are different. A complement is necessary in order to complete the meaning. An adjunct is not necessary, and adds extra information. …\nIndirect object versus prepositional complementWhen we talk about someone receiving something, we can express it using the typical word order: indirect object (io) + direct object (do). …\nAdd to word list\nAdd to word list\nto help make something or someone more complete or effective: She used photographs to complement the text of the news story. complementary adjective us\nYour browser doesn't support HTML5 audio\n/ˌkɑm·pləˈmen·tə·ri, -tri/\nThis ancient Chinese therapy is part of the complementary treatment program for pain.\nA complement is a number of people or things that makes something complete: We had a full complement of reporters and photographers along.\ngrammar A complement is part of a word or phrase that completes the predicate (= the part of a sentence that gives information about the subject), as “nothing” in “They told him nothing.”"}