{"id":104832,"name":"competent","type":"adjective","us_sound":"ˈkɑːm.pə.t̬ənt","us_link":"../audio/c/eus70915.mp3","uk_sound":"ˈkɒm.pɪ.tənt","uk_link":"../audio/c/ukcompa026.mp3","content":"Add to word list\nAdd to word list\nC1 able to do something well: a competent secretary/rider/cook I wouldn't say he was brilliant but he is competent at his job. Synonyms\nadept\ncapable\nexpert\ngood\nproficient\nskilful UKOpposite\nincompetent\nThesaurus: synonyms, antonyms, and examples\ngood at doing something because of practiceskilfulShe's a skilful driver.skilledHe's a skilled mechanic.good atShe's very good at dealing with people.ableShe's a very able student.giftedShe's a gifted musician.talentedHe's a very talented actor.\nSee more results »\nMore examplesFewer examplesShe has shown herself to be a highly competent manager.She's extremely competent and industrious - an asset to the department.It's a competent enough piece of writing but it has no flair.Charlie can cope here without you - he's perfectly competent.They are a very competent group of people, but they lack flexibility and originality.\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterously\ndigital native\nexpert\nexpertly\nexplosiveness\npedigreed\npolished\npractised\nproficient\nproficiently\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nworkmanlike\nSee more results »\nRelated word\ncompetently\nAdd to word list\nAdd to word list\nhaving the skills or knowledge to do something well enough to meet a basic standard: [ + to infinitive ] All we want is someone competent to manage the staff.\nlaw having enough mental ability for a particular purpose: [ + to infinitive ] The judge decided that he was competent to stand trial. competence noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑm·pə·t̬əns/\nHe reached a reasonable level of competence in English.\nAdd to word list\nAdd to word list\nable to do something well: A competent sales manager should have known exactly what to do in that situation. Operators must be fully competent in the use of the system. We have highly competent consultants, with a broad range of expertise.\ngood enough, but not excellent: People who work for us need to be more than merely competent; they need to excel.\nLAW able or allowed to make legal decisions: The prospective jurors did not indicate whether they thought the plaintiff was competent.\ncompetently adverb uk/ˈkɒmpɪtəntli/ us/ˈkɑːmpəṱənt-/\nEach candidate implies that the other cannot be trusted to run the economy competently."}