{"id":104708,"name":"comparison","type":"noun","us_sound":"kəmˈper.ɪ.sən","us_link":"../audio/c/comparison.mp3","uk_sound":"kəmˈpær.ɪ.sən","uk_link":"../audio/c/ukcompa001.mp3","content":"comparison noun [C or U]\n(EXAMINING DIFFERENCES)\nAdd to word list\nAdd to word list\nB2 the act of comparing two or more people or things: They made a comparison of different countries' eating habits. By/In comparison with the French, the British eat far less fish.\nMore examplesFewer examplesYou can't really draw a comparison between the two cases - they're entirely different.I thought I was badly treated but my experiences pale in comparison with yours.It was a tame film in comparison to some that she's made.The family emigrated to New Zealand in 1949, which seemed a wonderland in comparison with post-war England.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitively\ncontradistinction\ncontrast\ncontrastive\ncontrastively\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\ncomparison noun [C or U]\n(CONSIDERING SIMILARITIES)\nB2 the fact of considering something similar or of equal quality to something else: She drew a comparison between life in the army and life in prison. To my mind there's no comparison between the two restaurants (= one is much better than the other). He's a good writer but he doesn't bear/stand comparison with Shakespeare (= he is not nearly as good as Shakespeare).\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitively\ncontradistinction\ncontrast\ncontrastive\ncontrastively\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\nGrammar\nComparison: adjectives (bigger, biggest, more interesting)Comparative adjectives compare one person or thing with another and enable us to say whether a person or thing has more or less of a particular quality: …\nComparative and superlative adjectivesComparative adjectives compare one person or thing with another and enable us to say whether a person or thing has more or less of a particular quality: …\nComparative and superlative adjectives: formTo form the comparative, we use the -er suffix with adjectives of one syllable: …\nComparative adjectives: using much, a lot, far, etc.We can strengthen or emphasise a comparative adjective using words such as much, a lot, far, even or rather, or by using than ever after the adjective: …\nComparative adjectives: using thanWe use than when we mention the second person or thing in the comparison. If the second person mentioned takes the form of a personal pronoun, we normally use the object form of the pronoun (me, you, him, her, us, them): …\nComparative adjectives: -erand -er, more and moreTo talk about how a person or thing is changing and gaining more of a particular quality, we can use two -er form adjectives connected by and, or we can use more and more before an adjective. We don’t follow such comparisons with than: …\nComparative adjectives: the -er, the -er and the more …, the more …If a person or things gains more of a particular quality and this causes a parallel increase of another quality, we can repeat the + a comparative adjective: …\nReduced forms after comparativesAfter than, we often don’t repeat subject pronouns with impersonal subjects, or auxiliary verbs with passive voice verbs: …\nLess and not as/not so with comparativesWe use less with longer adjectives (interesting, beautiful, complicated), but we don’t normally use less with short adjectives of one syllable (big, good, high, small). Instead we use not as … as …, or not so … as … Not as is more common than not so: …\nPrepositions after superlative adjectivesWe don’t normally use of before a singular name of a place or group after a superlative adjective: …\nThe with superlative adjectivesWhen a superlative adjective is followed by a noun, we normally use the: …\nOther determiners with superlative adjectivesBefore a superlative adjective, we can use a possessive determiner (my, his, their), or the + a number (two, three, first, second), or a possessive determiner + a number: …\nEmphasising superlative adjectivesWe can make a superlative adjective stronger with by far, easily or of all: …\nTo-infinitives after superlative adjectivesWe can use a to-infinitive after a superlative adjective, with a meaning similar to a relative clause with who, which or that: …\nComparative adjectives: typical errorsA comparative adjective is followed by than, not that or as: …\nComparison: adverbs (worse, more easily)Adverbs do not normally change in form, but a few have comparative and superlative forms. These are usually short adverbs and so they normally have comparative and superlative forms with -er and -est. …\nAdverbs: comparative and superlative formsAdverbs do not normally change in form, but a few have comparative and superlative forms. These are usually short adverbs and so they normally have comparative and superlative forms with -er and -est. …\nAdverbs with more and mostAdverbs with two or more syllables form the comparative and superlative with more and most: …\nWell and badlyThe adverb well has the same comparative and superlative forms as the adjective good (better, best). The adverb badly has the comparative and superlative forms worse, worst: …\nComparative adverbs: using thanWhen we mention the second person or thing in the comparison, we use than. We do not use that or as. If the second person mentioned takes the form of a personal pronoun, we normally use the object form of the pronoun (me, you, him, her, us, them): …\nComparison: clauses (bigger than we had imagined)The second part of a comparison (underlined) is often a clause: …\nComparison: comparisons of equality (as tall as his father) …\ncomparison noun [C/U]\n(DIFFERENCE)\nAdd to word list\nAdd to word list\nan examination of the differences between persons or things: [ U ] We kept a copy of an earlier letter for comparison. [ U ] Though over six feet tall, he was small by comparison with (= compared to) his teammates on the basketball team.\ncomparison noun [C/U]\n(SIMILARITY)\nthe act of showing that something is similar or equal to something else: [ C ] She drew a comparison (= showed the similarities) between the Roosevelt and Kennedy administrations."}