{"id":105274,"name":"computer","type":"noun","us_sound":"kəmˈpjuː.t̬ɚ","us_link":"../audio/c/computer.mp3","uk_sound":"kəmˈpjuː.tər","uk_link":"../audio/c/ukcompr014.mp3","content":"Add to word list\nAdd to word list\nA1 an electronic machine that is used for storing, organizing, and finding words, numbers, and pictures, for doing calculations, and for controlling other machines: a personal/home computer All our customer orders are handled by computer. We've put all our records on computer. computer software/hardware computer graphics a computer program\nPhotographer is my life/Moment/GettyImages\nMore examplesFewer examplesI need some advice on which computer to buy.When you buy a new computer, you usually get software included at no extra cost .Modern computers can hold huge amounts of information.They've just launched a new generation of computers that are much more powerful than earlier models.The keyboard plugs in at the back of the computer.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\nconsole\ndata projector\nelectronic organizer\nflat screen\nhard drive\nmainframe\nmicrochip\nmicroprocessor\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nSee more results »\nAdd to word list\nAdd to word list\nan electronic device that can store large amounts of information and be given sets of instructions to organize and change it very quickly: a desktop/personal computer a computer program computer hardware/software\nAdd to word list\nAdd to word list\nan electronic machine that calculates data very quickly, used for storing, writing, organizing, and sharing information electronically or for controlling other machines: log onto/start/boot up a computer You will need a user name and password in order to log onto the computer.reboot/restart a computer You may need to restart your computer after installing the update.log off/shut down a computer Please log off the network and shut down your computer before you leave the office.a computer crashes If the computer keeps crashing unexpectedly, check to make sure you don't have a virus.a computer is down/up All our computers are down right now. Can I call you back? All our records are held on computer. I've been sitting at the computer all day. Right click to download the file onto your computer. computer hardware/software a computer network/system a personal/desktop/home computer See also\ndesktop computer\nhandheld\nhost computer\nlaptop\nmainframe\nnotebook\nPC\npersonal computer\nsupercomputer"}