{"id":105152,"name":"compress","type":"verb","us_sound":"kəmˈpres","us_link":"../audio/c/compress_01_00.mp3","uk_sound":"kəmˈpres","uk_link":"../audio/c/ukcompl029.mp3","content":"Add to word list\nAdd to word list\nto press something into a smaller space: Firmly compress the soil in the pot so that the plant is secure. compressed air\nto make information, a piece of writing, etc. shorter: The course compresses two year's training into six intensive months. I managed to compress ten pages of notes into four paragraphs.\nto make a computer file use less space when it is stored in the memory of a computer or on a disk, by using a special program: to compress data/files\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nOperating computers\nRelated word\ncompressible\na thick, soft piece of cloth that is pressed to a part of a person's body to stop bleeding or to reduce pain or swelling: a cold/hot compress\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nearplug\nElastoplast\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\ncompress verb [T]\n(PRESS)\nAdd to word list\nAdd to word list\nto press something into a smaller space: Snow in the crater compresses into a fastest-growing glacier. Firmly compress the dirt in the pot to hold the plant upright.\nTo compress also means to shorten something so that it takes less time: Four years of normal mortgage business is being compressed into two months. compression noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kəmˈpreʃ·ən/\ndata compression\ncompress noun [C]\n(CLOTH)\na thick, soft piece of cloth that is pressed to a part of a person’s body esp. to help a healing process: Apply warm compresses to the infected area.\nAdd to word list\nAdd to word list\nIT to make computer information take up less space in memory or on a disk, by using a special program: Mega sites such as YouTube compress data to accommodate huge numbers of videos. Compare\ndecompressSee also\nzip compression noun [ U ] /kəmˈpreʃən/\nVideo formats like VCD and DVD both use MPEG data compression to store the picture and sound information."}