{"id":104843,"name":"competitive","type":"adjective","us_sound":"kəmˈpet̬.ə.t̬ɪv","us_link":"../audio/c/eus70916.mp3","uk_sound":"kəmˈpet.ɪ.tɪv","uk_link":"../audio/c/ukcompa029.mp3","content":"Add to word list\nAdd to word list\nB2 involving competition: competitive sports a highly competitive industry Acting is very competitive - you've got to really push yourself if you want to succeed.\nB2 wanting very much to win or be more successful than other people: You're very competitive - it's meant to be a friendly match! I could never play team sports - I lack the competitive spirit (= a strong wish to beat others).\nB2 Competitive prices, services, etc. are as good as or better than other prices, services, etc.\nMore examplesFewer examplesWe have to invest in new technology if we are to remain competitive.We live in a toughly competitive world.The two sisters have always been competitive, but they're also very supportive of each other.She's fiercely competitive and gets very upset if she loses at anything.Any new company is seen as an invader in an already competitive market.\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ncompetition\ndare\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\njostle\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\ntake something on\nthrow\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong-willed\nComparing and contrasting\nRelated words\ncompetitively\ncompetitiveness\nAdd to word list\nAdd to word list\neager to do better than others in an activity, esp. trying to win in a sports activity: a competitive person We will be facing weaker teams, which should give us a competitive advantage/edge.\nCompetitive also means able to compete at the same level: If we have to lower our prices to remain competitive, we will.\nAdd to word list\nAdd to word list\ninvolving or encouraging competition: highly/extremely/fiercely competitive The severe downturn in the worldwide semiconductor market has increased competitive pressures in the Japanese market. The corporate watchdog law requires large companies to formalize competitive processes for selecting vendors.\ncompetitive prices, services, etc. are as good as or better than other prices, services, etc.: The technology exists to convert grain and sugar to ethanol at a competitive price. We know we have competitive products to sell, if only consumers had access to them. The hotel works hard to offer competitive salaries and benefits to our employees. We can't put up our prices and still remain competitive with similar brands. competitively adverb uk/kəmˈpetɪtɪvli/ us/-ˈpeṱəţɪv-/\nIn order to encourage customers to switch providers, broadband services must be competitively priced."}