{"id":105142,"name":"comprehensive","type":"adjective","us_sound":"ˌkɑːm.prəˈhen.sɪv","us_link":"../audio/c/comprehensive.mp3","uk_sound":"ˌkɒm.prɪˈhen.sɪv","uk_link":"../audio/c/ukcompl026.mp3","content":"comprehensive adjective\n(COMPLETE)\nAdd to word list\nAdd to word list\nC1 complete and including everything that is necessary: We offer you a comprehensive training in all aspects of the business. Is this list comprehensive or are there some names missing? He has written a fully comprehensive guide to Rome.\nComprehensive insurance gives financial protection against most risks, for example including damage to a driver's own vehicle as well as to other vehicles: It is a common misconception that car hire insurance is comprehensive. The trend is towards less comprehensive health insurance. See also\nfully comprehensive\nMore examplesFewer examplesThe two governments have agreed to engage in a comprehensive dialogue to resolve the problem.If you are a young, inexperienced driver, it is worth having comprehensive insurance.The book gives a comprehensive account of the English Civil War.This is a comprehensive guide to the birds of the British Isles.We gave the house a comprehensive spring clean.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-length\nfully\nfully fledged\nglobally\nplain\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\ntoto\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInsurance\ncomprehensive adjective\n(EDUCATION)\nused in the UK to describe a school or type of education for children of all abilities above the age of eleven, paid for by the state: Is the school selective or comprehensive? a comprehensive education\nSMART Vocabulary: related words and phrases\nTypes of school\nboarding school\nbusiness school\ncharter school\ncoeducational\ncomp\ncomprehensive school\nconservatory\nfaith school\ngrade school\ngymnasium\njunior\nselective\nseminary\nsenior high school\nsingle-sex\nspecial school\nsuperschool\ntech\ntechnical college\nvarsity\nSee more results »\nin the UK, a school for children of all abilities above the age of eleven, that is paid for by the state: They went to the local comprehensive.\nSMART Vocabulary: related words and phrases\nTypes of school\nboarding school\nbusiness school\ncharter school\ncoeducational\ncomp\ncomprehensive school\nconservatory\nfaith school\ngrade school\ngymnasium\njunior\nselective\nseminary\nsenior high school\nsingle-sex\nspecial school\nsuperschool\ntech\ntechnical college\nvarsity\nSee more results »\nAdd to word list\nAdd to word list\nincluding everything that is necessary; complete: They put forward comprehensive legislation to revise the rules for financing political campaigns. comprehensively adverb us/ˌkɑm·prəˈhen·sɪv·li/"}