{"id":105526,"name":"concession","type":"noun","us_sound":"kənˈseʃ.ən","us_link":"../audio/c/concession.mp3","uk_sound":"kənˈseʃ.ən","uk_link":"../audio/c/ukconce025.mp3","content":"concession noun\n(SOMETHING ALLOWED)\nAdd to word list\nAdd to word list\nC2 [ C or U ] something that is allowed or given up, often in order to end a disagreement, or the act of allowing or giving this: Both sides involved in the conflict made some concessions in yesterday's talks. He stated firmly that no concessions will be made to the terrorists. See\nconcede (ADMIT)\n[ U ] the act of admitting defeat: The former president's concession came even before all the votes had been counted. a concession speech\nMore examplesFewer examplesSome politicians fear that agreeing to the concession would set a dangerous precedent.She didn't make any concessions to the fact that we were tired.His only concession was that we were allowed to sit down during the speeches.The kidnappers have made significant concessions to their demands.We will not make any concessions to people found to be in breach of the law.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdmitting & confessing\nconcession noun\n(LOWER PRICE)\nC2 [ C ] UK a reduction in the usual price of something, made available to students, old people, etc.: You can get travel concessions if you are under 26.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nconcession noun\n(RIGHT)\n[ C ] a special right to property or land\n[ C ] the right to sell a product in a particular area\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\nconcession noun\n(SOMETHING GIVEN UP)\nAdd to word list\nAdd to word list\n[ C/U ] something allowed or given up, often in order to end a disagreement, or the act of allowing or giving up something: [ C ] Both sides involved in the talks made concessions.\n[ C/U ] Concession can also be the act of admitting defeat: [ U ] a concession speech\nconcession noun\n(SALES PLACE)\n[ C ] permission to sell something, esp. in part of a store owned by someone else, or a business that sells something: A lot of movie theater profits come from their candy concessions.\nAdd to word list\nAdd to word list\n[ C or U ] something that you agree to give someone or allow them to do, especially in order to end an argument or disagreement: concession to sb As a concession to environmental groups, the energy giant agreed to scale down its coal plant expansion plans. demand/seek concessions The administration has demanded concessions from auto workers as part of the \"viability plan\" it is preparing.offer/make concessions We would be prepared to make concessions in order to reach an agreement. See also\nconcede\n[ C ]\n&#160; COMMERCE a small business that is allowed to sell goods, food, or services on property owned by someone else, for example, inside an airport or a large store: open/operate/run a concession The furniture and homeware retailer has recently opened its first concession within a garden centre. Fans were stocking up on hamburgers and hotdogs at the concession stand. airport/hotel/stadium concessions\n[ C ]\n&#160; COMMERCE official permission to carry out a particular type of business, or to own or do work on a particular piece of property or land, given by a government or company: The government plans to sell a 50-year concession to operate the southeastern rail line.award/grant a concession We are delighted to have been awarded the concession for the development of the airport. The mining company was granted a concession agreement to mine and market diamonds.\n[ C ] mainly UK a reduction for particular groups of people in the amount of money that has to be paid for something: give/offer concessions Many railways offer fare concessions for passengers with disabilities. Tax concessions will be made available to non-profit organizations.\n[ C ]\n&#160; FINANCE, STOCK MARKET the amount of money that an underwriter receives as payment when new shares are sold to the public for the first time: Investment bankers compensate members of the selling syndicate through payment of a selling concession, which is a type of sales commission."}