{"id":105738,"name":"concrete","type":"noun","us_sound":"ˈkɑːn.kriːt","us_link":"../audio/c/concrete.mp3","uk_sound":"ˈkɒŋ.kriːt","uk_link":"../audio/c/ukconci022.mp3","content":"Add to word list\nAdd to word list\nB2 a very hard building material made by mixing together cement, sand, small stones, and water: reinforced concrete a concrete floor/path a grey concrete building\nMore examplesFewer examplesThe bomb shelter has concrete walls that are three metres thick.The foundation of the house is built from rubble overlaid with concrete.A row of reinforced concrete pillars supports the bridge.Weeds were pushing up through the cracks in the concrete.Don't walk on the concrete until it has set.\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\nfibro\nflagged\nflagstone\nflitch\nfloorboard\nlacquer\npaving\nprestressed\nputty\nrazor wire\nrebar\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\nto cover something in concrete: Why did you concrete over that nice garden?\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\nlag\nlaminate\nlayer\nobliterate\nobliteration\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\nC1 clear and certain, or real and existing in a form that can be seen or felt: They think she killed her husband, but they have no concrete evidence. We have a general idea of what we want, but nothing concrete at the moment. Opposite\nabstract (GENERAL)\nMore examplesFewer examplesIt is sometimes easier to illustrate an abstract concept by analogy with something concrete.He drew attention to the absence of concrete evidence against the defendant.I have a suspicion that he's having an affair, though I don't have any concrete proof.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndeffo\ndefinite\ndefinitely\ndefinitive\ndefinitively\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nnatch\nsolidity\nsolidly\nsquarely\nwould\nyou can bet your life idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrue, real, false, and unreal\nconcrete noun [U]\n(HARD MATERIAL)\nAdd to word list\nAdd to word list\na very hard building material made by mixing together cement (= powdered substance), sand, small stones, and water: concrete steps\nconcrete adjective\n(CERTAIN)\nbased on sure facts or existing things rather than guesses or theories: Police have no concrete evidence linking him to the crime. We have not yet received a concrete proposal.\nEnglish If a statement, argument, or discussion is concrete, it is based on actual things and particular examples."}