{"id":105474,"name":"concern","type":"verb","us_sound":"kənˈsɝːn","us_link":"../audio/c/concern.mp3","uk_sound":"kənˈsɜːn","uk_link":"../audio/c/ukconce015.mp3","content":"concern verb\n(WORRY)\nAdd to word list\nAdd to word list\nC1 [ T ] to cause worry to someone: The state of my father's health concerns us greatly. [ + that ] It concerns me that he hasn't been in contact.\nMore examplesFewer examplesWe're now going to turn to an issue that concerns us all - racism.His attitude concerns me.The poor state of the fire escapes concerned me greatly.It concerned them that no doctor was available.Does it concern you that your children are out after dark?\nSMART Vocabulary: related words and phrases\nCausing anxiety and worry\nagitate\nalarming\nalarmingly\nbite\ncatch up with someone\ncome back to bite someone idiom\ndisturb\nfrighten\nfrighten someone/something away/off\nget/go beyond a joke idiom\ngive someone the jimjams idiom\ngive someone the jitters idiom\noppressive\nrattle\nroost\nstressful\nstressfully\nsuspenseful\nsuspensefully\nsuspensive\nSee more results »\nconcern verb\n(INVOLVE)\nB2 [ T ] to be important to someone or to involve someone directly: Matters of pollution and the environment concern us all. What I have to say to Amy doesn't concern you.\nB2 [ T ] formal If a story, film, or article concerns a particular subject, person, etc., it is about that person or subject: The documentary concerns a woman who goes to China as a missionary.\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\nconcern yourself\nto become involved with something, or worried about something: There's no need for you to concern yourself with what happened. Don't concern yourself. She'll be home soon. I concern myself with general policy rather than operational details. At this point there's no need to concern ourselves with the differences between the two theories. She doesn't care about popularity or concern herself with what other artists are doing. to whom it may concern\nsomething you write at the start of a formal letter or notice when you do not know exactly who it should be sent to: Address your cover letter to the hiring manager. Otherwise, begin it with \"To whom it may concern\".\nSee more\nMore examplesFewer examplesTrigonometry concerns the functions of angles, such as sine, cosine and tangent.How I choose to vote does not concern you.The documentary concerns the eating habits of Britain's teenagers.I didn't go to the meeting because nothing on the agenda seemed to concern me.I'll answer any questions that specifically concern this week's homework.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncluding and containing\nRegarding and concerning\nAnxious and worried\nTaking part and getting involved\nconcern noun\n(WORRY)\nB2 [ C or U ] a worried or nervous feeling about something, or something that makes you feel worried: Concern for the safety of the two missing teenagers is growing. There's a lot of public concern about/over dangerous toxins recently found in food. [ + that ] My concern is that you're not getting enough work done. Synonyms\nalarm (WORRY)\nconsternation\ndistress\npreoccupation\nworry\nMore examplesFewer examplesDrug trafficking is a matter of considerable concern for the entire international community .Continued fighting in the city is causing great concern.The recent drop in magazine subscriptions is causing some concern.There is concern that the giant panda will soon become extinct.There is general concern about rising crime rates.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nangst\nanti-stress\nanxiety\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nconcern noun\n(BUSINESS)\n[ C ] a company: a family concern It started slowly, but the company is now a going concern (= doing business effectively). Synonyms\nbusiness (COMPANY)\nenterprise (BUSINESS)\ntrade (BUSINESS)\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nconcern noun\n(IMPORTANT TO)\nB2 [ C or U ] something that is important to you, or the fact of being important: [ + to infinitive ] His concern to appear sophisticated amused everyone. The company's sole concern is to ensure the safety of its employees. There's a matter of some concern that I have to discuss with you.\n[ C or U ] something that involves or affects you or is important to you: What were the major concerns of the writers from this period? I don't want to hear about it - it's no concern of mine! \"What's happening?\" \"That's none of/not any of your concern.\" be of concern\nto be important: The results of the election are of concern to us all.\nSee more\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nangst\nanti-stress\nanxiety\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinking and relating\nconcern noun\n(NOT IMPORTANT TO)\nbe of no concern (or be of little concern)\nto be not important or worth paying attention to : It's of little concern to me how she dresses.\nSee more\nconcern verb [T]\n(WORRY)\nAdd to word list\nAdd to word list\nto trouble someone with feelings of anxiety; worry: The loss didn’t bother him, but his team’s confidence concerns him.\nconcern verb [T]\n(INVOLVE)\nto involve someone or something; have to do with: This is an issue that should concern everyone.\nIf a story concerns a particular subject, it tells a story about that subject: The novel concerns the daily life of a family living in a trailer.\nconcern noun\n(BUSINESS)\n[ C ] fml a company: He heads a large concern in the midwest.\nconcern noun\n(INVOLVEMENT)\n[ U ] a matter of importance esp. because it involves you: Issues of good and evil are not our primary concern here. What you do is no concern of mine (= I do not care).\nconcern noun\n(WORRY)\n[ C/U ] a worried feeling, or a state of anxiety: [ C ] Parents expressed a lot of concerns about the changes in school policies.\nAdd to word list\nAdd to word list\n[ C ] formal a business or company: Two of the country's largest steel concerns are considering cuts in production. See also\ngoing concern\n[ U or C ] the fact of feeling worried about something, or something that makes you worry: concern about/over sth There was a lot of public concern over the new legislation. Please raise any concerns regarding this decision with your manager.\nto be important to someone, or to involve or affect someone: Managers complained that they were spending too much time going to meetings that didn't actually concern them.\nto worry someone: If there are issues which concern you, discuss the matter with a specialist financial adviser.\n(also be concerned with) to be about a particular subject: Our research is concerned with new forms of work organization.\nTo whom it may concern\nCOMMUNICATIONS a phrase you write at the beginning of a formal or public letter when you do not know exactly who it should be sent to"}