{"id":105428,"name":"concentrator","type":"noun","us_sound":"ˈkɑːn.sən.treɪ.t̬ɚ","us_link":"../audio/c/cdo1121usconc1066.mp3","uk_sound":"ˈkɒn.sən.treɪ.tər","uk_link":"../audio/c/cdo1121ukconc1050.mp3","content":"concentrator noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\nchemistry, medicine\n&#160; specialized a device for concentrating (= increasing the strength of) a substance by removing or reducing the amount of something such as water, or by collecting particular atoms or molecules together: She uses an oxygen concentrator to make it easier to breathe.\nphysics\n&#160; specialized a mirror or group of mirrors that focuses light from the sun (= directs its waves towards a particular point) so it can be used to produce power: The company will build at least 50 acres of solar concentrators behind the plant to generate solar power.\ninternet &amp; telecoms\n&#160; specialized a device in a computer or telephone network that collects and combines information or signals from separate sources: The primary concentrators process and store information, received from some 40 meters. Each node (PC) attaches to a hub (or concentrator) via a cable.\nMore examplesFewer examplesThe hemo concentrator takes the whole blood and filters out liquids such as IV fluids, before returning it to the Hemobag in a concentrated form.The concentrator is a lightweight alternative to the bulky oxygen tank used by some people with lung disease.He invented a new optical concentrator with huge potential for the future of green energy. The concentrators are parabolic mirrors about three feet off the ground that move with the sun and focus energy on a tube filled with water.Pulse emitters send metered information to concentrators, which are connected to a Unix host.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nElastoplast\nexoskeleton\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\nobturator\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making stronger\nPhysics: optics, microscopy & lasers\nPhysics: energy, force & power\nComputer hardware\nCommunications - general words\nconcentrator noun [C]\n(STUDENT)\neducation\n&#160; US specialized at some universities, someone who is studying a particular subject as their main subject: At Harvard in the late 1950s, philosophy concentrators were few. You need a year of math if you're going to be a biology concentrator.\nMore examplesFewer examplesThe number of students majoring in African and African American studies declined by half, from 42 concentrators two years ago to 22 last year.As an English concentrator you can pursue either the Honors Program or the Elective Program, which requires between 12 and 14 courses.\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nfrosh\ngraduate\nhomeschooler\nhouse officer\nhouseman\npupil\nscholar\nschool-leaver\nschoolboy\nschoolchild\nschoolgirl\ntheologian\nSee more results »"}