{"id":105703,"name":"concordance","type":"noun","us_sound":"kənˈkɔːr.dəns","us_link":"../audio/c/usconcl005.mp3","uk_sound":"kənˈkɔː.dəns","uk_link":"../audio/c/ukconci019.mp3","content":"Add to word list\nAdd to word list\n[ C ]\n&#160; language\n&#160; specialized a book or document that is an alphabetical list of the words used in a book or a writer's work, with information about where the words can be found and in which sentences: a Shakespeare concordance\n[ U ] formal the state of there being agreement or similarity between things: Last Thursday's show produced moments of inspired concordance between the dance forms.\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nSMART Vocabulary: related words and phrases\nBooks & parts of books\nacknowledgment\nacknowledgments phrase\naddendum\nappendix\nartwork\nbibliographical\nbibliographically\nepigraph\nepilogue\nerrata\nerratum\nex-libris\nextract\nISBN\njacket\nlibrary\nmonograph\nomnibus\npreface\nspine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLists and catalogues\nAccepting & agreeing\nto collect all the words used in a book or a writer's work into a book or list in alphabetical order, with information about where the words can be found and in which sentences: We use a computer program that can concordance newspaper texts.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »"}