{"id":105667,"name":"conclusion","type":"noun","us_sound":"kənˈkluː.ʒən","us_link":"../audio/c/conclusion.mp3","uk_sound":"kənˈkluː.ʒən","uk_link":"../audio/c/ukconci011.mp3","content":"conclusion noun\n(LAST PART)\nAdd to word list\nAdd to word list\nC2 [ C ] the final part of something: Be careful not to introduce new ideas in the conclusion of your essay.\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\nin conclusion formal\nB2 finally: In conclusion, I would like to thank our guest speaker.\nSee more\nMore examplesFewer examplesThe conclusion of your essay is good, but the final sentence is too long and complicated.If we carry this argument to its logical conclusion, we realize that further investment is not a good idea.The result of the election seems to be a foregone conclusion.The film has a boringly predictable conclusion.By this time they had disagreed so fiercely that there was no hope of an amicable conclusion.\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\ndeath\nend\nending\nexpiration\nexpiry\nfag\nfinalization\nfinish\nswansong\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\ntwilight\nSee more results »\nconclusion noun\n(AGREEMENT)\n[ U ] the act of arranging or agreeing something formally: the conclusion of the deal/treaty\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nconclusion noun\n(JUDGMENT)\nB1 [ C ] the opinion you have after considering all the information about something: Did you come to/reach/draw any conclusions at the meeting this morning? [ + that ] At first I thought he was a bit shy, but I've come to the conclusion that he's simply unfriendly!\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nconclusion noun [C]\n(JUDGMENT)\nAdd to word list\nAdd to word list\na decision made after a lot of consideration: Dr. Gille couldn’t reach any conclusions based on the symptoms I described. [ + that clause ] We came to the conclusion that someone was not telling the truth.\nconclusion noun [C]\n(END)\nthe last part of something: The novel’s conclusion is disappointing. Idiom\nin conclusion\nAdd to word list\nAdd to word list\n[ C ] a decision or judgment that is made after careful thought: The findings and conclusions of the report are simply guidelines, not rulings.reach/come to/draw a conclusion Information is gathered into a profile and analytical software draws conclusions about the customer's likely interests.come to the conclusion that The new boss soon came to the conclusion that the German company could turn round the ailing British subsidiary.\n[ S ] the end of a meeting, a speech, a performance, etc.: Unions called for a conclusion of the negotiations by the end of the week. The United States trade representative, speaking at the conclusion of the talks on Wednesday, made it clear that the two countries still had significant differences on these issues.\n[ S or U ] the fact of something being arranged or agreed formally: This latest development has removed a major obstacle to the conclusion of the deal.\nin conclusion\nformal said or written when you are ending a speech, report, etc.: I want to re-emphasise in conclusion my commitment to the new climate of partnership in this country. In conclusion, it seems that the increasing incidence of audit committees has not restored confidence in financial reporting."}