{"id":105784,"name":"concurrence","type":"noun","us_sound":"kənˈkɝː.əns","us_link":"../audio/c/eus70943.mp3","uk_sound":"kənˈkʌr.əns","uk_link":"../audio/c/ukconci026.mp3","content":"concurrence noun\n(AGREEMENT)\nAdd to word list\nAdd to word list\n[ U ] a situation in which people agree or have the same opinion: It will be difficult to get any sort of statewide concurrence.\n[ C ]\n&#160; law\n&#160; specialized a document in which someone writes that they agree with a legal judgment: Justice Alberto Gonzales, who later served as White House counsel, wrote a concurrence. A 1995 concurrence by Thomas is now required reading in some law school courses.\nMore examplesFewer examplesThere is concurrence that the program is of value and should be sustained.The transfer of the player was made with the concurrence of the league.In concurrence with the U. S. Attorney's Office in Brownsville, Texas, the U. S. Fish and Wildlife Service issued a violation notice.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nconcurrence noun\n(AT SAME TIME)\n[ U ] (also concurrency, /kənˈkʌr.ən.si/ /kənˈkɝː.ən.si/) a situation in which things or events happen or exist at the same time: The concurrence of these events was very exciting. We want to ensure the concurrency of design and planning tasks.\nMore examplesFewer examplesThe domestic economy is being affected by the concurrence of rising prices and slumping economic activity.The concurrence of life-threatening events and psychosocial distress may partly explain these phenomena.Long-term concurrency - having more than one long-term partner at the same time - differs from the serial monogamy more common in western countries.Being in two pension schemes at once is known as \"concurrency\". In this context, \"concurrency\" is a requirement that infrastructure such as roads or schools keep pace with population growth in an area.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimultaneous and consecutive"}