{"id":105381,"name":"concede","type":"verb","us_sound":"kənˈsiːd","us_link":"../audio/c/concede.mp3","uk_sound":"kənˈsiːd","uk_link":"../audio/c/ukcompr027.mp3","content":"concede verb\n(ADMIT)\nAdd to word list\nAdd to word list\nC2 [ T ] to admit, often unwillingly, that something is true: [ + (that) ] The government has conceded (that) the new tax policy has been a disaster. [ + speech ] \"Well okay, perhaps I was a little hard on her,\" he conceded. Related word\nconcession (SOMETHING ALLOWED)\nThesaurus: synonyms, antonyms, and examples\nto say that you are wrongconfessRawlinson finally confessed to the robbery.own upCome on, own up - who's eaten the last sandwich?fess upFess up - you wanted to go to the cinema instead, didn't you?come cleanI decided to come clean about the broken vase.concedeShe did eventually concede that the instructions were not very clear.admitHe admitted that he had been wrong.\nSee more results »\n[ I or T ] to admit that you have lost in a competition: He kept on arguing and wouldn't concede defeat. She conceded even before all the votes had been counted.\nMore examplesFewer examplesShe conceded defeat well before all the votes had been counted.Hysen handled the ball and conceded the penalty that gave Manchester United the lead.Clinton conceded, \"We bit off more than we could chew in our original healthcare reform proposals.\"He conceded that he had been a little harsh.Reluctantly she conceded that their idea was better.\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhand\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and being defeated\nconcede verb\n(GIVE AWAY)\nC2 [ T ] to allow someone to have something, even if you do not want to: The president is not expected to concede these reforms. He is not willing to concede any of his power/authority. Britain conceded (= allowed) independence to India in 1947.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing reluctantly\naccede to something\nacceptance\nacquiescence\nbe resigned to something idiom\nbend to something\nbow down to someone\ncave in\ncrack\nlike it or lump it idiom\npeace\nphilosophical\nresign yourself to something\nresignation\nresigned\nresignedly\nresort to something\nsettle for something\nshoulder\ntolerate\ntrade something off\nSee more results »\nconcede a goal/point\nto fail to stop an opposing team or person from winning a point or game: The team conceded two goals (to the other side) in the first five minutes of the game.\nSee more\nAdd to word list\nAdd to word list\nto admit that something is true, or to allow something: [ + (that) clause ] Officials concede (that) the plan isn’t the best one.\nIf you concede in a competition, you admit that you have lost: [ I/T ] She conceded (the election) yesterday.\nAdd to word list\nAdd to word list\n[ T ] to admit that something exists or is true, often unwillingly: concede that The chairman conceded that shareholders had been \"impacted by the decline in market prices\". The insurers ultimately conceded liability for repairing the damage to the car.\n[ T ] to give something to someone, or allow them to have it, especially when you are unwilling to do so: Local government has been forced to concede some of its authority to larger, regionally based, units.\n[ I or T ] to stop arguing, fighting, or competing against someone and admit that you have lost: After a recount of the votes, the candidate conceded defeat. Critics say he should have conceded right after the election. See also\nconcession"}