{"id":105424,"name":"concentration","type":"noun","us_sound":"ˌkɑːn.sənˈtreɪ.ʃən","us_link":"../audio/c/concentration.mp3","uk_sound":"ˌkɒn.sənˈtreɪ.ʃən","uk_link":"../audio/c/ukconce009.mp3","content":"concentration noun\n(ATTENTION)\nAdd to word list\nAdd to word list\nB2 [ U ] the ability to think carefully about something you are doing and nothing else: The noise outside made concentration difficult. There was a look of intense concentration on her face. I find that yoga improves my powers of concentration. It was hard to follow what the teacher was saying, and eventually I lost concentration. The party's concentration on tax reduction has won them a lot of support.\nMore examplesFewer examplesThis is a very difficult piece of music to play - it demands a lot of concentration.Heart surgery exacts tremendous skill and concentration.The job demands a high level of concentration.Hyperactive children often have poor concentration and require very little sleep.Even a low level of noise interferes with my concentration.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nZoom\nSee more results »\nconcentration noun\n(AMOUNT)\nC2 [ C or U ] a large number or amount of something in the same place: There is a heavy concentration of troops in the area.\n[ C or U ]\n&#160; chemistry\n&#160; specialized the exact amount of one particular substance that is found in another substance: a concentration of one part per million High concentrations of toxic elements were found in the polluted areas.\nSMART Vocabulary: related words and phrases\nCollecting and amassing\naccumulate\nagglomerate\naggregation\namass\nassemble\ncompile\ncompiler\ncompletism\ncompletist\ncompost\nconcentrate\ncumulate\nfundraise\nfundraising\nmarshal\npiece something together\nput something together\nrake something up\nreassemble\nreconcentrate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: the state of matter\nconcentration noun\n(GAME)\n[ U ] US (UK pelmanism) a card game in which players use their memory to try to find pairs of matching cards, turning over two cards at a time from a set of cards that are spread out face (= picture side) down\nconcentration noun\n(COMING TOGETHER)\nAdd to word list\nAdd to word list\na large amount of something in the same place: [ C ] There’s a heavy concentration of poor and elderly in the district.\nconcentration noun\n(GIVING ATTENTION)\n[ U ] a lot of attention and thought directed to an activity or subject: He had a look of intense concentration on his face.\nconcentration noun\n(SUBSTANCE)\nthe amount of a substance that is mixed with water or another substance\nAdd to word list\nAdd to word list\n[ C or U ] the fact of there being a large number or amount of people or things of the same type in the same place: The state's highest concentration of wealth is in the metro areas. Denver has one of the biggest concentrations of tech workers in the country. By identifying geographical concentrations of industries, we can identify training needs that exist in those regions.\n[ U ] the fact of things being combined into a single group, or controlled by the same person or organization: This situation has resulted in the concentration of the industry in the hands of a few multinational companies.\n[ U ] the ability to give all of your attention to one particular activity, subject, or problem: Low costs and concentration on core business activities form the basis of our success. Many of the mistakes she made in the job were due to a lack of concentration. See also\nbuyer concentration\nmarket concentration"}