{"id":105653,"name":"conclude","type":"verb","us_sound":"kənˈkluːd","us_link":"../audio/c/conclude.mp3","uk_sound":"kənˈkluːd","uk_link":"../audio/c/ukconci010.mp3","content":"conclude verb\n(FINISH)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to end a speech, meeting, or piece of writing: She concluded the speech by reminding us of our responsibility. Before I conclude, I'd like to thank you all for coming. The concert concluded with a rousing chorus.\nThesaurus: synonyms, antonyms, and examples\nto finish somethingfinishDid you finish your homework?endWhat time does the concert end?completeHave you completed the questionnaire?concludeShe concluded her speech by thanking everyone who had helped her.polish offHe's just polished off two huge bowls of pasta.wind upIt's time to wind up the game now.\nSee more results »\n[ T ] to complete an official agreement or task, or arrange a business deal\nMore examplesFewer examplesIt's difficult to guess what they will conclude from the evidence.The report concluded that there was no evidence of collusive behaviour between the banks.Judge Keenan concluded that the surveillance had been lawful.The meeting concluded with a prayer.The book concludes with a plea for a change in the law.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlay\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nconclude verb\n(JUDGE)\nC1 [ T ] to judge or decide something after thinking carefully about it: [ + that ] The jury concluded from the evidence that the defendant was innocent. The discussions continued late into the night, but nothing was concluded.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbalance\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nconclude verb\n(END)\nAdd to word list\nAdd to word list\n[ I/T ] to cause something to end, or to end: [ T ] She concluded her remarks by thanking her supporters. [ I ] I’d like to conclude with a song by Tim Buckley.\n[ I/T ] If you conclude a business deal or official agreement, you agree on it: [ T ] Everyone was intent on concluding the agreement.\nconclude verb\n(JUDGE)\n[ T ] to judge after some consideration: [ + that clause ] We concluded that we could not afford to buy a new car. The judges concluded the same thing I did.\nAdd to word list\nAdd to word list\n[ T ] to have a particular opinion about something after thinking carefully about it: conclude that Analysts concluded that borrowing costs were at or very near their peak. The study concluded that food adverts aimed at children were mostly on TV and dominated by high-sugar cereals, soft drinks, confectionery, and fast foods.\n[ I or T ] to end a meeting, speech, etc., or to come to an end: I'd like to conclude by mentioning all those people who have contributed to the success of the project. The second round of negotiations were concluded in December 2010. Talks with the DTI aren't expected to conclude in time to impact earnings or dividends this year.\n[ T ] to complete an official agreement or task, or arrange a business deal: conclude an agreement/deal/negotiation The companies plan to conclude the deal by mid-2012."}