{"id":105476,"name":"concerned","type":"adjective","us_sound":"kənˈsɝːnd","us_link":"../audio/c/concerned.mp3","uk_sound":"kənˈsɜːnd","uk_link":"../audio/c/ukconce016.mp3","content":"concerned adjective\n(WORRIED)\nAdd to word list\nAdd to word list\nB2 worried: I'm a bit concerned about/for your health. [ + (that) ] Aren't you concerned (that) she might tell someone? [ + to infinitive ] He was concerned to hear that two of his trusted workers were leaving. Concerned parents have complained about the dangerous playground.\nThesaurus: synonyms, antonyms, and examples\nworriedworriedI'm worried that he's not going to graduate.concernedAren't you concerned that she might tell someone?perturbedHe didn't seem unduly perturbed by the news.fretfulShe got a fretful night's sleep after the dreadful news.anxiousAll this waiting is making me anxious.apprehensiveHe's a bit apprehensive about leaving home.\nSee more results »\nMore examplesFewer examplesMany people are very concerned about the destruction of the rainforests.Theatre companies are very concerned about cuts in government grants to the arts.Police are concerned that mugging is on the increase.In the movie, he plays a concerned and sensitive father trying to bring up two teenage children on his own.Today, people are much more concerned about their health than they were in the past.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfuss\nget in a sweat idiom\ngoosey\ngrim\ngrimly\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nqueasiness\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nconcerned adjective\n(INVOLVED)\nC2 [ after verb ] involved in something or affected by it: I'd like to thank everyone concerned for making the occasion run so smoothly. It was quite a shock for all/everyone concerned. Her job is something concerned with computers. I'm not very good where money is concerned (= when dealing with money). as far as someone is concerned\nB2 in a particular person's opinion: As far as I'm concerned, feng shui doesn't work.\nSee more as far as something is concerned\nB2 if we are discussing or thinking about a particular thing: As far as unemployment's concerned, a change of policy on job creation would be a good idea.\nSee more be concerned with something/someone\nC1 to be about a particular thing or person: Today's lesson is concerned with punctuation.\nSee more\nMore examplesFewer examplesHe's a bit of a dilettante as far as wine is concerned.The rally has been cancelled for the good of all concerned.The well-known humanitarian, Joseph Rowntree, was concerned with the welfare of his employees.I'm a complete ignoramus where computers are concerned.It never pays to take risks where human safety is concerned.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDIB\nembody\nembracingly\nencompass\nenshrine\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\npepper\nplug\nSee more results »\nconcerned adjective\n(WORRIED)\nAdd to word list\nAdd to word list\ntroubled with feelings of anxiety: Sarah is very concerned about your safety.\nconcerned adjective\n(INVOLVED)\n[ not gradable ] involved or involving: They say that free trade will benefit all concerned. Her job is only concerned with costs and fees."}