{"id":105441,"name":"concept","type":"noun","us_sound":"ˈkɑːn.sept","us_link":"../audio/c/concept.mp3","uk_sound":"ˈkɒn.sept","uk_link":"../audio/c/ukconce011.mp3","content":"Add to word list\nAdd to word list\nB2 a principle or idea: The concept of free speech is unknown to them. It is very difficult to define the concept of beauty. I failed to grasp the film's central concept. Kleenbrite is a whole new concept in toothpaste! Synonyms\nconception\nconstruct formal\nidea (KNOWLEDGE)\nnotion\nthought not have any concept/have no concept of something\nto not understand about something: I don't think you have any concept of the pain you have caused her.\nSee more\nMore examplesFewer examplesIn this country, time is an elastic concept.It is sometimes easier to illustrate an abstract concept by analogy with something concrete.The whole concept of democracy, she claimed, was utterly foreign to the present government.Many voters are staunch anti-federalists, opposed to the concept of regional government.This is a very difficult concept to get hold of.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nhunch\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nAdd to word list\nAdd to word list\na principle or idea: He introduced the concept of selling books via the Internet.\nAdd to word list\nAdd to word list\nMARKETING an idea for a new product or a way to sell a product: The finished product was very different from the original concept.\nan idea, theory, etc. about a particular subject: This course will acquaint you with the basic concepts of management Product differentiation is an important concept in marketing. See also\nbusiness entity concept\nconsistency concept\nhigh-concept\nthe marketing concept\nproduct concept\nthe production concept\nsales concept\nselling concept"}