{"id":105597,"name":"concierge","type":"noun","us_sound":"kɑːn.siˈerʒ","us_link":"../audio/c/eus70937.mp3","uk_sound":"ˌkɒn.siˈeəʒ","uk_link":"../audio/c/ukconci001.mp3","content":"Add to word list\nAdd to word list\na person who is employed to take care of an apartment building, especially in France: The concierge knocked on the door of their apartment following complaints about noise. The concierge shrugged and said she was out. Compare\nattendant noun\ncaretaker (IN A BUILDING) UK\ncustodian US\njanitor mainly US, or Scottish English\nkeeper (CARER)\nporter (PERSON) UK\nsteward\nwarden (MANAGER)\nwatchman\nsecurity guard\ndoorman\nsomeone who is employed in a hotel, private club, or similar place to help guests with anything they need, such as arranging trips or theatre tickets: Other hotel staff who expect a tip include a concierge who books tickets for a show and a doorman who hails a taxi. She worked as a concierge in the first-class lounge at Dulles International Airport.\nsomeone employed by a large company to do jobs, such as shopping, for other employees who are working: Staff perks include a concierge, an ironing service, discounted concert tickets, and an on-site creche. Benefits range from corporate concierge services to masseuses.\nsomeone whose job is to help a writer with the process of publishing a book, especially a writer who is having the book published themselves rather than by a publishing company: With a publishing concierge it is like having your very own industry expert there for all of your publishing needs.\nMore examplesFewer examplesMichel is the concierge in an apartment building in Paris.The restaurant receives many last-minute requests from hotel concierges hoping to score a table reservation for guests.One prospective member was asked not to return after he screamed at the club's concierge in public because of a scheduling mix-up that was his own fault.We rented ocean-side condos and concierges to attend to their every whim.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHotels & hostels\nPeople who help or serve people professionally\nPeople who work in publishing\nAdd to word list\nAdd to word list\na person working in a hotel, etc. whose job is to help guests, for example by giving them information about restaurants, local places to see, etc.: Our concierges are experts on the area's restaurants and can recommend the perfect place to fit your tastes. Our company offers concierge services for both individual and corporate customers."}