{"id":105908,"name":"conditional","type":"adjective","us_sound":"kənˈdɪʃ.ən.əl","us_link":"../audio/c/conditional.mp3","uk_sound":"kənˈdɪʃ.ən.əl","uk_link":"../audio/c/ukconde014.mp3","content":"conditional adjective, noun\n(SENTENCE FORM)\nAdd to word list\nAdd to word list\n[ C ] (relating to) a sentence, often starting with \"if\" or \"unless\", in which one half expresses something which depends on the other half: a conditional clause \"If I won a lot of money, I'd travel the world\" is an example of a conditional (sentence).\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nconditional adjective, noun\n(VERB FORM)\n[ S ] (a form of a verb) expressing the idea that one thing depends on another thing: In English, the conditional is expressed by \"would\".\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nGrammar\nShould you (Should with inversion)In formal situations, we can use should + subject (s) + verb (v) instead of if: …\nHad you (Had with inversion)In formal situations, we can use had + subject + verb instead of if in third conditional sentences: …\nIf + were toIn formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nAs long as, so long as, providing, etc.Sometimes we need to impose specific conditions or set limits on a situation. In these cases, conditional clauses can begin with phrases such as as long as, so long as, only if, on condition that, providing (that), provided (that). …\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nConditionals: typical errorsWe don’t use will and would in the conditional clause: …\nConditionalsConditional sentences consider imagined or uncertain situations and the possible results of these situations. The most common types of conditional sentences involve if: …\nConditionals: imagined situationsConditional sentences consider imagined or uncertain situations and the possible results of these situations. The most common types of conditional sentences involve if: …\nConditional sentencesConditional sentences consist of a conditional clause and a main clause: …\nOrder of clausesConditional clauses usually come before main clauses but they may also come after them: …\nVerb forms in the conditional clauseThe verb in the conditional clause may be in the simple form or the continuous form, depending on the meaning: …\nConditionals: ifThere are different types of conditions. Some are possible or likely, others are unlikely, and others are impossible: …\nImagined conditionsThere are different types of conditions. Some are possible or likely, others are unlikely, and others are impossible: …\nImagined conditions: the first conditionalWe use the first conditional to talk about the result of an imagined future situation, when we believe the imagined situation is quite likely: …\nImagined conditions: the second conditionalWe use the second conditional to talk about the possible result of an imagined situation in the present or future. We say what the conditions must be for the present or future situation to be different. …\nFirst and second conditional comparedWhen we use the first conditional, we think the imagined situation is more likely to happen than when we use the second conditional. …\nImagined conditions: the third conditionalWe use the third conditional when we imagine a different past, where something did or did not happen, and we imagine a different result: …\nReal conditionalsSome conditions seem more real to us than others. Real conditionals refer to things that are true, that have happened, or are very likely to happen: …\nTypes of conditional: summaryThe table shows how the main types of conditionals relate to one another. …\nIf + shouldWe can use if with should to refer to events which might happen by chance or by accident: …\nConditional clauses with will or wouldWill and would can be used in conditional clauses, either with the meaning of ‘being willing to do something’, or to refer to later results: …\nMixed conditionalsOften, things that did or did not happen in the past have results which continue or are still important in the present. We can emphasise this by using if with a past perfect verb, and would in the main clause. …\nConditionals in speakingIn speaking, we often use if-clauses without main clauses, especially when asking people politely to do things. If is usually followed by will, would, can or could when it is used to be polite: …\nConditionals: other expressions (unless, should, as long as)Conditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessConditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nA conditional offer or agreement depends on something else being done: The offer of a place on the nursing course is conditional on/upon my passing all three exams. Opposite\nunconditional\nSMART Vocabulary: related words and phrases\nBeing based on or depending on something\nas the case might be phrase\nbase something on something\nbases\nbasis\nboil down to something\nentail\nfooting\nfound\nfoundational\nground\nhinge\nrest with someone\nresult from something\nride\nride on something/someone\nrooted\nspring from something\nstrength\nunderstanding\nwake\nSee more results »\nRelated word\nconditionally\nAdd to word list\nAdd to word list\n[ not gradable ]\n&#160; grammar relating to a sentence, often starting with \"if\" or \"unless,\" in which one half expresses something which depends on the other half conditional statement mathematics\nA conditional statement describes that if one state exists, then another one also exists.\nconditional adjective\n(AGREED LIMITATION)\ndepending on certain terms, agreements, etc.: The sales is conditional on approval from government regulators.\nAdd to word list\nAdd to word list\nrelating to an offer or agreement that depends on something else being done: conditional agreement/approval The company has the conditional approval needed to market the drug, though it must still return to the FDA with more data.conditional contract/offer He had been sent a formal letter with a conditional offer of employment, pending a medical examination.conditional on/upon The offer is conditional on obtaining planning permission for the land. conditionally adverb /kənˈdɪʃənəli/\nconditionally accept/agree/approve The charitable foundation, which is the largest stakeholder with just under 40% of the shares, has conditionally agreed to accept the bid."}