{"id":105906,"name":"condition","type":"noun","us_sound":"kənˈdɪʃ.ən","us_link":"../audio/c/condition.mp3","uk_sound":"kənˈdɪʃ.ən","uk_link":"../audio/c/ukconde013.mp3","content":"condition noun\n(STATE)\nAdd to word list\nAdd to word list\nB1 [ S or U ] the particular state that something or someone is in: Mum's still got our pram - it's very old, but it's in perfect condition. They left the flat in a terrible condition - there was mess everywhere. The hospital say her condition (= state of health) is improving slowly. He's in no condition (= he is too sick or too drunk) to drive home. conditions [ plural ]\nB1 the physical situation that someone or something is in and affected by: weather conditions\nSee more\nB2 [ C ] any of different types of diseases: to suffer from a heart/skin condition a medical condition out of condition mainly UK\nnot healthy enough for hard physical exercise, as a result of not taking part in sport or other physical activities: When he started boxing, he was overweight and out of condition.\nSee more\nMore examplesFewer examplesThere has been no detectable change in the patient's condition.The inside of the house is in good condition, but externally it's in need of repair.The car is five years old but is in almost perfect condition.The hospital said she was in a stable condition following the operation.Relations between the two countries have been very bad for some time.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\ncondition noun\n(AGREED LIMIT)\nC1 [ C ] an arrangement that must exist before something else can happen: One of the conditions in the contract is that we don't build on the land. We're not in a position to make/set any conditions - we'll have to accept what they offer us. Under the conditions of the agreement, she must vacate the house on 12 July . on (the) condition that\nB2 only if: I'll come to the party on the condition that you don't wear those ridiculous trousers!\nSee more\nMore examplesFewer examplesThey will only agree to sign the contract if certain conditions are met.We had to grit our teeth and agree with their conditions because we wanted the contract.They had to agree to certain conditions as a prerequisite of being lent the money.They agreed to raise the trade embargo if three conditions were met.He set several conditions before agreeing to take the part.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nstretch\nstring\nSee more results »\ncondition verb [T]\n(TRAIN)\nC2 to train or influence a person or animal mentally so that they do or expect a particular thing without thinking about it: a conditioned reflex/response [ + to infinitive ] Pavlov conditioned dogs to salivate at the sound of a bell. Women were conditioned to expect lower wages than men.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\ncondition verb [T]\n(USE CONDITIONER)\nto try to improve the quality or appearance of your hair, skin, etc. by putting a conditioner on it\nSMART Vocabulary: related words and phrases\nHair care\nargan oil\nblow dryer\nblowout\nbobble\nbobby pin\nbrush\ncoconut oil\ncoily\ncrimp\nhair gel\nhair slide\nhairdryer\npermanent wave\nrelaxed\nrelaxer\nroller\nsnood\nstraighteners\nstyling\nuncombed\nSee more results »\nRelated word\nconditioning\ncondition noun\n(STATE)\nAdd to word list\nAdd to word list\nthe particular state that something or someone is in: [ U ] We spent a lot of money to get the house in good condition. [ U ] She was hospitalized in fair condition after the accident. [ + to infinitive ] He’s in no condition to drive (= He should not drive).\nA condition can also be a state of not operating correctly: [ C ] a heart condition\ncondition noun\n(AGREED LIMITATION)\n[ C ] something that must exist before something else can happen: Certain conditions must be met before the aid will be provided. He spoke on condition that he not be identified.\nAdd to word list\nAdd to word list\n[ S or U ] the particular state that something is in: condition of sth The condition of the property will help determine its price. The goods are warranted to be in perfect condition on leaving the factory.\nconditions\n[ plural ] the situation that someone lives or works in, or that someone or something is affected by: The unions are trying hard to improve pay and conditions for their members.business/economic/market conditions The timing of the merger depended on market conditions.difficult/favourable conditions This year has seen some very difficult trading conditions.in/under good, poor, etc. conditions Many of the goods are produced by child workers working in appalling conditions. working/living conditions\n[ C, usually plural ] something that you must agree to, that forms part of an official agreement: I hereby agree to the terms and conditions of my engagement as stated above.attach/impose/set conditions We're not in a position to set any conditions - we'll have to accept what they offer.agree to/comply with/meet conditions They felt that they had complied with all the conditions of the agreement. Licensing conditions for mobile network operators must ensure the respect of competition rules. Ms Russ told the hearing she was unhappy that the job had not been completed by July 31, which it was claimed was a condition of the contract.as a condition for/of sth As a condition of yesterday's approval, the EU Competition Commissioner insisted the state aid must not be used to subsidize other commercial activities.\n[ C ] an arrangement that must exist before something else can happen: condition for sth A strong local business base is a necessary condition for the economic future of the area.\non condition that\ndepending on something else happening or being done: Agreement was reached to repay part of the debt, on condition that the remaining debt be cancelled. See also\nexpress condition\nimplied condition"}