{"id":106001,"name":"conductive","type":"adjective","us_sound":"kənˈdʌk.t̬ɪv","us_link":"../audio/c/usconcl022.mp3","uk_sound":"kənˈdʌk.tɪv","uk_link":"../audio/c/ukcondu001.mp3","content":"conductive adjective\n(OF MATERIAL)\nAdd to word list\nAdd to word list\nA conductive substance allows heat or electricity to travel through it: Aluminium is a conductive metal. A gas that has been ionised becomes highly conductive.\nMore examplesFewer examplesThey developed the first electrically conductive plastics.Copper is ten times more conductive than stainless steel.The tool will work with woods and all other non conductive materials.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\ngenerate\nhigh-voltage\nhoming\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nconductive adjective\n(OF HEARING)\nmedical\n&#160; specialized used to refer to a type of hearing loss caused by problems in the way sound waves travel through the ear: Otosclerosis is a conductive hearing loss caused when the middle ear no longer transmits sound correctly from the eardrum to the inner ear. Hearing checks are essential as conductive hearing impairment is very frequent in young children. Compare\nsensorineural\nMore examplesFewer examplesVitamin D deficiency can even affect the bones of the inner ear, causing conductive hearing loss.External ear anomalies may be associated with hearing disorders such as conductive hearing loss.If a conductive hearing loss occurs in conjunction with a sensorineural hearing loss, it is referred to as a mixed hearing loss.Hearing loss of a conductive nature may require myringoplasty.\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naurally\nbe all ears idiom\ncatch\ncloth ears\near\nearshot\neavesdrop\neavesdropper\neavesdropping\ngrommet\nhark\nhearing\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nRelated word\nconductivity\nAdd to word list\nAdd to word list\nphysics, chemistry describes a substance that conducts electricity or heat"}