{"id":106017,"name":"conduit","type":"noun","us_sound":"ˈkɑːn.duː.ɪt","us_link":"../audio/c/usconcl024.mp3","uk_sound":"ˈkɒn.dʒuː.ɪt","uk_link":"../audio/c/ukcondu004.mp3","content":"Add to word list\nAdd to word list\na pipe or passage for water or electrical wires to go through: They make pipes and tubes that are used in construction and as electrical conduits. Cracks in the rocks can act as conduits, transporting polluted water upward.\na way of connecting two places: The warehouse will be a regional conduit for goods shipped to the port, then transported to stores.\nsomeone or something that provides a way of passing something such as information or payments from one person to another: The social media platform has served as a conduit for misinformation. A captain is the conduit between the coach and the players.\nMore examplesFewer examplesThis subterranean passage is a conduit that can hold more than 1 billion gallons of waste water. Voles have eaten through wiring and conduits. Throughout history, oceans and seas have been vital conduits for trade and transportation. The country emerged as the main conduit of illegal drugs into the United States. Documents showed the company was the conduit for millions of dollars' worth of weapons purchased internationally.It was alleged that he used the lawyer as a conduit for illegal payments to witnesses.\nSMART Vocabulary: related words and phrases\nBuilding: plumbing, pipes & sewage\nballcock\ncaulking\ncesspit\ncistern\nculvert\ninfluent\nisolator\nleakage\nmixer tap\noutfall\noverflow\nplumb\nplunger\nsewage works\nsewer\nsiphon\nspigot\nstandpipe\nstopcock\nwaterworks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nCommunicating & keeping in touch\nAdd to word list\nAdd to word list\na way of connecting two places, systems, etc.: There is growth in sales to Hong Kong, the conduit for exports to the rest of the area.\na way of connecting two people or organizations: conduit between sb/sth and sb/sth The proposal that a board's senior non-executive should become a prime conduit between a company and its shareholders is causing concern.conduit for sth The new retail bank created by the merger might provide the insurance company with a conduit for selling its products to bank customers.\nCOMMUNICATIONS something that carries or moves information: The internet has become a major conduit for video and sound (especially music) distribution."}