{"id":106176,"name":"confident","type":"adjective","us_sound":"ˈkɑːn.fə.dənt","us_link":"../audio/c/confident.mp3","uk_sound":"ˈkɒn.fɪ.dənt","uk_link":"../audio/c/ukcondu025.mp3","content":"Add to word list\nAdd to word list\nB1 being certain of your abilities or having trust in people, plans, or the future: Be a bit more confident in yourself! They don't sound confident about the future of the industry. I'm confident of his skills as a manager. [ + that ] Are you confident that enough people will attend the event? It was a confident performance. Synonyms\nassertive\nassured (CONFIDENT)\nself-assertive\nself-assured approvingSee also\nself-confident approving\nThesaurus: synonyms, antonyms, and examples\ncertain about somethingcertainI feel certain that this change will be for the best. know/say for certainI can't say for certain, but I think he's coming to the party.sureDon't worry - I'm sure it won't be a problem.positive\"Are you sure you let the cat in?\" \"I'm positive.\"\nSee more results »\nThesaurus: synonyms, antonyms, and examples\ncertain of your abilities or valueconfidentHe was confident that his approach would work best.assuredShe gave an assured performance to a packed concert hall.self-assuredThe interview showed her as a very self-assured woman.self-confidentHe was self-confident and sure he'd get the job. assertiveYou'll have to be more assertive if you want to be promoted.boldHe was a bold and defiant little boy.\nSee more results »\nMore examplesFewer examplesShe is a confident and practised speaker who always impresses her audience.Wales are supremely confident of winning the match.The police are confident that this new line of inquiry will lead them to the murderer.The most important rule in life is always to appear confident.His confident leadership inspired his followers.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nRelated word\nconfidently"}