{"id":106173,"name":"confidence","type":"noun","us_sound":"ˈkɑːn.fə.dəns","us_link":"../audio/c/confidence.mp3","uk_sound":"ˈkɒn.fɪ.dəns","uk_link":"../audio/c/ukcondu024.mp3","content":"confidence noun\n(CERTAINTY)\nAdd to word list\nAdd to word list\nB2 [ U ] the quality of being certain of your abilities or of having trust in people, plans, or the future: [ + to infinitive ] He has the confidence to walk into a room of strangers and immediately start a conversation. She's completely lacking in confidence. I have every/complete confidence in her. She'll be perfect for the job. [ + that ] I don't share your confidence that the market will improve next year.\nMore examplesFewer examplesShe's certainly gained (in) confidence over the last couple of years.After six defeats in a row, the team's confidence has been badly shaken.The government is trying to restore public confidence in its management of the economy.Passing my driving test was such a boost to my confidence.I don't have much confidence in him after his behaviour in recent months.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatism\ndogmatist\nempowered\nfierce\nforwardness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nself-assertion\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nunmoored\nSee more results »\nconfidence noun\n(SECRET)\n[ C ] a secret that you tell someone: They talked endlessly, exchanging confidences. in confidence\nC2 If you tell something to someone in confidence, you do not want them to tell anyone else: Any personal data you provide to us will be held in confidence.\nSee more take someone into your confidence\nto share your secrets with someone, trusting them not to tell other people: I should never have taken him into my confidence.\nSee more\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndissimulate\ndissimulation\ndown-low\nentre nous\nexecutive privilege\nprivately\nprivileged\npseudonym\npseudonymization\npseudonymize\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nconfidence noun\n(SURE FEELING)\nAdd to word list\nAdd to word list\n[ U ] a feeling of having little doubt about yourself and your abilities, or a feeling of trust in someone or something: He has a sense of confidence, even arrogance, about what he does. Consumers’ confidence in the economy is strong. Her colleagues lost confidence in her.\nconfidence noun\n(SECRET)\n[ C/U ] a secret, or a feeling of trust that a secret will be kept: [ C ] They exchanged confidences like old friends. [ U ] I’m telling you this in confidence.\nAdd to word list\nAdd to word list\na feeling that you can trust someone or something to work well or behave as you expect: The index fell 3.1% as investors lost confidence in bank shares.have confidence in sb/sth \"I have the utmost confidence in him, and know he will lead this franchise to continued success and growth,\" West said. Leitch warns that the insurance industry must raise standards to win back the confidence of investors.\na feeling that an economic situation will improve: Business confidence has plunged and home sales have collapsed.destroy/restore confidence Yesterday's announcement is a timely and important step toward restoring global economic confidence.\nthe quality of being certain of your own ability to do things well: Our latest recruit is very intelligent but lacking in confidence.boost/shatter/shake sb's confidence One aim of the appraisal meetings is to boost the confidence of your team members.\nin confidence\nif you tell someone something in confidence, it is with the agreement that they will not tell anyone else: Insiders are barred from using significant business information that they have received in confidence. See also\nbreach of confidence\nconsumer confidence\nvote of confidence\nvote of no confidence"}