{"id":106206,"name":"configuring","type":"verb","us_sound":"kənˈfɪɡ.jɚ","us_link":"../audio/c/usconfe007.mp3","uk_sound":"kənˈfɪɡ.ər","uk_link":"../audio/c/ukconfi003.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nconfigure\nto arrange something or put its parts together in a particular form or arrangement: Online buyers can build their own version of the car: many of the company's customers configure their own vehicles. The marines used specially configured submarines.\ncomputing\n&#160; specialized to arrange or make changes to a computer system, a piece of computer equipment or software, etc. to make it able to do a particular task or work in a particular way: It used to take days to install and configure a server, and now it can be done in minutes. Check that the device is present on the system and is configured correctly. After I configured my laptop to start up from the CD-ROM drive rather than the hard drive, the installation went smoothly.\nMore examplesFewer examplesClients can configure the rooms for one or two people, but they can't alter the basic room size.I loved the way he configured the exhibits, setting up unexpected visual connections between the pieces in each room.Configuring my laptop to access the internet through the DSL connection was simple.Select your main .pst file (outlook.pst, unless you have configured Outlook to use a file with a different name).Most social media accounts are configured to send a notification when a new follower is added.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npliantly\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nunadapted\nunamended\nwrite someone out of something\nZelig\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts"}