{"id":106208,"name":"confine","type":"verb","us_sound":"kənˈfaɪn","us_link":"../audio/c/eus70951.mp3","uk_sound":"kənˈfaɪn","uk_link":"../audio/c/epd31545.mp3","content":"Add to word list\nAdd to word list\nC2 [ T ] to limit an activity, person, or problem in some way: Let's confine our discussion to the matter in question, please! Please confine your use of the phone to business calls. By closing the infected farms we're hoping to confine the disease to the north of the region (= stop it from spreading to other areas).\nC2 [ T usually passive ] to keep someone closed in a place, often by force: The hostages had been confined for so long that they couldn't cope with the outside world. be confined to somewhere/something\nto exist only in a particular area or group of people: We know that the illness is not confined to any one group in society.\nSee more\nMore examplesFewer examplesMen have always played an active part in leading worship while women have been confined to more passive roles.The campaign aims to dispel the prejudice that AIDS is confined to the homosexual community.Let's confine our remarks to the facts, shall we?We confined our research to families with only one autistic child.It was terrible for our research to be confined by lack of money.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncrowd\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPutting people in prison\nEnclosing, surrounding and immersing\nAdd to word list\nAdd to word list\nto keep someone or something within limits: The animals were confined in a large pen. Harris does not confine her stage work to Broadway.\nIf something is confined to a particular group of people, it exists only among them: Cancer is not confined to old people. confined adjective us\nYour browser doesn't support HTML5 audio\n/kənˈfɑɪnd/\nYou can’t keep kids in a confined space for long. confinement noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kənˈfɑɪn·mənt/\nHe was tired of the constant confinement of his office."}