{"id":106074,"name":"confection","type":"noun","us_sound":"kənˈfek.ʃən","us_link":"../audio/c/usconcl027.mp3","uk_sound":"kənˈfek.ʃən","uk_link":"../audio/c/ukcondu008.mp3","content":"confection noun [C]\n(SWEET FOOD)\nAdd to word list\nAdd to word list\nformal a sweet food, especially one that is unusual or complicated: This moist, beautifully decorated confection is perfect for a special birthday. She makes 25 varieties of traditional sweets and at first struggled to persuade local supermarkets to sell her confections. Related word\nconfectionery\nMore examplesFewer examplesDessert was a coconut-filled confection enrobed in chocolate.Her confections are always as stunning to look at as they are delicious to eat.Marzipan is a confection consisting primarily of sugar and ground almonds.\nSMART Vocabulary: related words and phrases\nCakes\nangel food cake\nangelica\nbake sale\nbaked goods\nBakewell pudding\ncupcake\ndevil's food cake\ndonut\ndonut hole\ndoughnut\nmacaroon\nMadeira cake\nmadeleine\nmalt loaf\nmarble cake\nshortcake\nsimnel cake\nsponge cake\nsponge finger\nsticky bun\nSee more results »\nconfection noun [C]\n(CREATION)\noften disapproving something that has been created, especially something that has a lot of complicated details or decoration, or seems artificial or false: She was wearing some sort of flouncy chiffon confection with frills blowing in the breeze. St Basil's Cathedral is a fairy-tale confection that graces the eastern end of the square. Related words\nconfect\nconfected\nMore examplesFewer examplesThe pier is a wonderful Victorian confection that reaches over 2,000 feet out into the sea.The movie is a revoltingly saccharine confection in which a tough career woman has to look after some orphans.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerativity\ngrind something out\nhandmade\nknock\nknock off (something)\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »"}