{"id":106379,"name":"confuse","type":"verb","us_sound":"kənˈfjuːz","us_link":"../audio/c/confuse.mp3","uk_sound":"kənˈfjuːz","uk_link":"../audio/c/ukconfi028.mp3","content":"Add to word list\nAdd to word list\nB2 to mix up someone's mind or ideas, or to make something difficult to understand: You're confusing him! Tell him slowly and one thing at a time. Stop confusing the issue (= making the problem unnecessarily difficult)!\nB2 to mix up two separate things or people in your mind, imagining that they are one: You're confusing me with my sister - she's the singer. It's easy to confuse his films, because he tends to use the same actors.\nMore examplesFewer examplesI think you're confusing him with someone else.If you give them too much detail, you'll just confuse them.We were confused by the fact that the signs pointed in opposite directions.Stop confusing me with all those figures!The instructions are designed to confuse people.\nSMART Vocabulary: related words and phrases\nPuzzle and confuse\naddle\nbaffle\nbedazzle\nbefuddle\nbemuse\ncloud\ndiscombobulate\ndisorientate\ndo someone's head in idiom\nflummox\nfox\nfuddle\npuzzle\nsearch\nthrow\nthrow (someone) a curve (ball)/curveball idiom\nthrow someone off balance idiom\ntie\ntie someone (up) in knots idiom\nunbalance\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking mistakes\nAdd to word list\nAdd to word list\nto cause someone to feel uncertain or unclear, or to make something difficult to understand: You’re confusing me – please repeat the directions more slowly.\nSomeone who confuses one thing with another thinks the first thing is the second: You’re confusing me with my sister – she’s the one who moved to Colorado. confusable adjective, noun [ C ] us/kənˈfju·zə·bəl/confused adjective us\nYour browser doesn't support HTML5 audio\n/kənˈfjuzd/\nHer confused reaction is understandable. confusing adjective us\nYour browser doesn't support HTML5 audio\n/kənˈfju·zɪŋ/\nThe directions were confusing, and I got lost."}