{"id":106280,"name":"conflict","type":"noun","us_sound":"ˈkɑːn.flɪkt","us_link":"../audio/c/conflict_01_00.mp3","uk_sound":"ˈkɒn.flɪkt","uk_link":"../audio/c/ukconfi016.mp3","content":"Add to word list\nAdd to word list\nB2 an active disagreement between people with opposing opinions or principles: There was a lot of conflict between him and his father. It was an unpopular policy and caused a number of conflicts within the party. His outspoken views would frequently bring him into conflict with the president.\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nB2 fighting between two or more groups of people or countries: We wish to avoid conflict between our countries if at all possible.\nMore examplesFewer examplesBoth sides involved in the conflict made some concessions in yesterday's talks.An independent adviser has been brought in to conciliate between the two sides involved in the conflict.The conflict destabilized the whole region.They had worked for peace during the long era of conflict.The ambassador has offered to act as a go-between for the two countries involved in the conflict.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFighting\nIdiom\na conflict of interest\nconflict verb [I]\n(BE OPPOSITE)\nIf beliefs, needs, or facts, etc. conflict, they are very different and cannot easily exist together or both be true: The results of the new research would seem to conflict with existing theories.\nSMART Vocabulary: related words and phrases\nBeing and appearing different\nanomalously\nanother\nanti-conventional\napple\nbe a far cry from something idiom\nbuck\ndepart from something\ndeviate\ndiffer\ndifferentiate\ndiverge\ndiversify\nfish\nflow\nothering\npolymorphous\npop\nrebrand\nrebranding\nremove\nSee more results »\nconflict verb [I]\n(FIGHT)\nto fight or disagree actively: If the two sides conflict with each other again, it will be disastrous for party unity.\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nargue with someone\nargumentatively\nbandy\nbet\nbone\ncross swords idiom\nflame\nhammer\nlock horns idiom\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nconflict noun\n(DISAGREEMENT)\nAdd to word list\nAdd to word list\n[ C/U ] an active disagreement, as between opposing opinions or needs: [ C ] Conflicts between parents and children become more frequent when the children become teenagers. [ U ] This technology may be in conflict with copyright law.\n[ C/U ] A conflict is also fighting between two or more countries or groups of people: [ C ] Negotiations with both sides have not yet led to a resolution of the conflict.\nconflict noun\n(STRUGGLE)\n[ U ]\n&#160; literature us/ˈkɑn·flɪkt/ the forces that oppose each other to create the plot in a story, book, or film external conflict\nExternal conflict is a struggle between characters or between characters and nature or society. internal conflict\nCharacters' struggles to change or understand themselves is internal conflict.\nto be in active disagreement, as between opposing opinions or needs: We received reports that conflict with each other.\nconflicting adjective us\nYour browser doesn't support HTML5 audio\n/kənˈflɪk·tɪŋ/\nThere are many conflicting cancer studies.\nAdd to word list\nAdd to word list\na serious disagreement between people, organizations, or countries with opposing opinions: conflict (with sb) (over sth) In that year conflict with the government over pay settlements led to an unprecedented civil service strike.come into conflict (with sb) It is only to be expected that members of your team will come into conflict with each other at some point. It was a controversial decision and caused a number of conflicts within the workforce. Managers will need to ensure that strategies for conflict resolution (= finding a solution to a disagreement) are in place.\na situation in which there are opposing demands or ideas and a choice has to be made between them: conflict between sth and sth The situation becomes more difficult when there is a conflict between the needs of internal and external stakeholders.come into conflict (with sth) If we go ahead with this, we may come into conflict with health and safety regulations. See also\nconflict of interest\nindustrial conflict\nif beliefs, needs, facts, etc. conflict, they are very different and cannot easily exist together or both be true: conflict (with sth) Consideration of ethical and environmental impacts can sometimes conflict with economic goals."}