{"id":106146,"name":"confessing","type":"verb","us_sound":"kənˈfes","us_link":"../audio/c/confess.mp3","uk_sound":"kənˈfes","uk_link":"../audio/c/ukcondu016.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nconfess\nB2 to admit that you have done something wrong or something that you feel guilty or bad about: [ + that ] She confessed to her husband that she had sold her wedding ring. He confessed to sleeping/having slept through most of the movie. He has confessed to the murder. [ + (that) ] I have to confess (that) when I first met Reece I didn't think he was very bright. Synonyms\nadmit (ACCEPT)\navow formal\nown upIt was all very confusing, I must confess.\nThesaurus: synonyms, antonyms, and examples\nto say that you are wrongconfessRawlinson finally confessed to the robbery.own upCome on, own up - who's eaten the last sandwich?fess upFess up - you wanted to go to the cinema instead, didn't you?come cleanI decided to come clean about the broken vase.concedeShe did eventually concede that the instructions were not very clear.admitHe admitted that he had been wrong.\nSee more results »\nin the Christian religion, especially the Roman Catholic Church, to tell God or a priest what you have done wrong so that you can be forgiven: to confess your sins\nMore examplesFewer examplesI have to confess I'm a bit of a sucker for musicals.I must confess that I got my sums wrong - the house extension is costing a lot more than I expected.The killer confessed that he often drugged his victims before he killed them.He was granted immunity from prosecution because he confessed the names of the other spies.He confessed that he had sinful thoughts.\nSMART Vocabulary: related words and phrases\nAdmitting & confessing\nacknowledge something as something\nacknowledgedly\nacknowledgment\nadmission of guilt\nadmittedly\navowedly\nbreastbeating\nclean\nclimb down\ncome clean idiom\nconfess\nhold/put your hands up idiom\nretraction\nself-admittedly\nself-confessed\nself-confessedly\nself-confession\nstand\nswallow your words idiom\ntake something back\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious concepts: forgiveness in religion\nReligious practices"}