{"id":106221,"name":"confirm","type":"verb","us_sound":"kənˈfɝːm","us_link":"../audio/c/confirm.mp3","uk_sound":"kənˈfɜːm","uk_link":"../audio/c/ukconfi007.mp3","content":"confirm verb\n(MAKE CERTAIN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to make an arrangement or meeting certain, often by phone or writing: [ + that ] Six people have confirmed that they will be attending and ten haven't replied yet. Flights should be confirmed 48 hours before departure. I've accepted the job over the phone, but I haven't confirmed in writing yet.\nMore examplesFewer examplesWe'll pencil in the dates for the next two meetings and confirm them later.Please confirm your reservation in writing by Friday.All bookings must be confirmed in writing.Can you confirm the numbers you are expecting for dinner?I'm just ringing to confirm your hotel booking.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nin someone's crosshairs idiom\nplanner\nprovision\npurpose\npurposefully\npurposely\nput the cart before the horse idiom\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nconfirm verb\n(PROVE TRUE)\nB2 [ T ] to prove that a belief or an opinion that was previously not completely certain is true: [ + question word ] The smell of cigarette smoke confirmed what he had suspected: there had been a party in his absence. [ + (that) ] Her announcement confirmed (that) she would be resigning as CEO. The young man's kindness confirmed her faith in young people.\nMore examplesFewer examplesHe will not confirm or deny the allegations.His words to the press were deliberately equivocal - he didn't deny the reports but neither did he confirm them.In the film, he plays a spy whose mission is to confirm the verity of a secret military document.The low profit figures simply confirmed my worst fears.Initial reports say that seven people have died, though this has not yet been confirmed.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\ndocumentary\nprobatory\nproof positive\nprovability\nprovable\nprovably\nthe acid test\nverify\nvindicate\nvindication\nvindicative\nvindicatory\nSee more results »\nconfirm verb\n(RELIGION)\n[ T ] to accept someone formally as a full member of the Christian Church at a special ceremony\nSMART Vocabulary: related words and phrases\nReligious ceremonies & prayers\nalleluia\namen\nanoint\nanointed\nanointment\ncommunion\nconfirmation\nconsecrate\nconsecration\ndedicate\nliturgical\nliturgically\nliturgy\nordain\nthe Lord's Prayer\nthe Lord's Supper\nunchristened\nunction\nunprogrammed\nvespers\nSee more results »\nconfirm verb [T]\n(MAKE PLANS)\nAdd to word list\nAdd to word list\nto make an arrangement, plan, or meeting certain or fixed: The hotel has confirmed our reservation. [ + that clause ] Seventy people have confirmed that they will attend the conference.\nconfirm verb [T]\n(APPROVE)\nto approve someone or something officially by formal agreement: His appointment has not been confirmed by the Senate.\nconfirm verb [T]\n(PROVE TRUE)\nto prove or state the truth of something that was previously not completely certain: [ + that clause ] Health officials confirmed that there’s a flu epidemic underway.\nconfirm verb [T]\n(RELIGION)\nin some Christian religions, to formally accept someone as a member\nAdd to word list\nAdd to word list\n[ I or T ] to make an arrangement or meeting certain, often by phone or writing: confirm that So far ten people have confirmed that they will be attending the meeting. When initial appointments are made over the telephone, these should also be confirmed in writing. No contract exists until the company confirms by email that their order has been dispatched. The group said it expected another $5 billion of orders to be confirmed soon.\n[ T ] to prove or say that something is true: Britain's biggest dairy company yesterday confirmed 3,450 job losses. They refused to confirm or deny speculation that the company was to close. confirmation noun [ C or U ]\nIt is essential to obtain confirmation in writing.confirmation that Investors are looking for confirmation that the economy is picking up speed."}