{"id":106178,"name":"confidential","type":"adjective","us_sound":"ˌkɑːn.fəˈden.ʃəl","us_link":"../audio/c/confidential.mp3","uk_sound":"ˌkɒn.fɪˈden.ʃəl","uk_link":"../audio/c/ukcondu026.mp3","content":"Add to word list\nAdd to word list\nC1 secret or private, often in a formal, business, or military situation: All information will be treated as strictly confidential.\nThesaurus: synonyms, antonyms, and examples\nkept hidden from other peoplesecretThe spies had a secret meeting.covertThe government was accused of covert military operations.clandestineHe arranged a clandestine meeting between his client and the candidate.confidentialAll the information you give us will be treated as strictly confidential.classifiedThese documents contain classified information.\nSee more results »\nMore examplesFewer examplesA person's medical records are confidential.We have certain reasons for our decision, which have to remain confidential.He locked the confidential documents in his filing cabinet.The letter was marked 'Personal. Strictly confidential.'Someone has leaked confidential government information to the press.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndissimulate\ndissimulation\ndown-low\nentre nous\nexecutive privilege\nprivately\nprivileged\npseudonym\npseudonymization\npseudonymize\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nRelated word\nconfidentially\nAdd to word list\nAdd to word list\nprivate, and intended to be kept secret: confidential data/documents/information, etc. Prosecutors were not able to obtain confidential data from corporations without first receiving written approval from the department.keep sth/remain confidential The bill would allow a business to keep its dealings confidential. The company's former employees had made improper use of highly confidential information, such as names and addresses of customers. All the employee questionnaires will be treated as strictly confidential. confidential advice The letter was marked \"confidential\". confidentially adverb uk/ˌkɒnfɪˈdenʃəli/ us/ˌkɑː–/\nMembers of a client's workforce can discuss confidentially the reason for their absence, be it a mental or medical problem."}