{"id":106110,"name":"conference","type":"noun","us_sound":"ˈkɑːn.fɚ.əns","us_link":"../audio/c/conference.mp3","uk_sound":"ˈkɒn.fər.əns","uk_link":"../audio/c/ukcondu015.mp3","content":"conference noun [C]\n(MEETING)\nAdd to word list\nAdd to word list\nB1 an event, sometimes lasting a few days, at which there is a group of talks on a particular subject, or a meeting in which especially business matters are discussed formally: a conference on women's rights They frequently hold conferences at that hotel. I'm speaking at/attending a conference next week. Should I book the conference room for the meeting? Compare\nawayday mainly UK\ncongress (MEETING)\nconsultation\nconvention (MEETING)\nforum (MEETING)\nmeeting\nseminar\nsummit (MEETING)\nsymposium formal be in conference formal\nto be in a meeting: Ms O'Neill isn't available at the moment. She's in conference.\nSee more\nMore examplesFewer examplesHe's giving a paper on thermodynamics at a conference at Manchester University.A group of four teachers were delegated to represent the school at the union conference.An international medical conference was established for the interchange of new ideas and approaches.She called a news conference to give her side of the story.The hotel is an ideal venue for conferences and business meetings.\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nscrum\nsession\nsit\nspeaking engagement\nsymposium\nteleconference\nteleconferencing\nSee more results »\nconference noun [C]\n(SPORTS)\na group of sports teams that play each other in organized competitions: They can win because they have the most talent in their conference. He guided the team to the Southern Conference championship.\nMore examplesFewer examplesThis year's ACC may be the strongest conference since the '84–'85 Big East. The Canadian prime minister congratulated the Calgary Flames on their victory in the Western Conference finals. Their most formidable opponent would appear to be the Falcons, whom they wouldn't face until the conference championship game.His performance earned him North Central Conference player of the week honours for the third consecutive time this season.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\nAdd to word list\nAdd to word list\na large, formal meeting at which there are groups of talks on a particular subject, or a small, private meeting for discussion of a particular matter: [ C ] She spoke at a conference in Geneva.\nAdd to word list\nAdd to word list\nan event, sometimes lasting a few days, at which there are a lot of talks and meetings about a particular subject: a conference centre/hallhold/organize a conference (on sth) The institute will be holding a conference on higher education and economic growth next spring.attend/go to/speak at a conference Most of the department attended the Mobile World conference in Barcelona. He was the keynote speaker at a conference in Frankfurt.conference delegate/participant Conference delegates will receive a discount on the price of their hotel rooms.\na private and formal meeting between a small number of people: After a short conference with his advisers, he announced his decision to resign. a conference room\nbe in conference formal\nto be in a meeting: She directed him into a meeting room, where a number of executives were in conference. See also\nnews conference\npress conference\nsales conference\nshipping conference\nteleconference"}