{"id":106062,"name":"confabulation","type":"noun","us_sound":"kən.fæb.jəˈleɪ.ʃən","us_link":"../audio/c/cdo0319usconf0377.mp3","uk_sound":"kən.fæb.jəˈleɪ.ʃən","uk_link":"../audio/c/cdo0319ukconf0330.mp3","content":"confabulation noun [U or C]\n(CONVERSATION)\nAdd to word list\nAdd to word list\nformal or humorous conversation or discussion about something: They were seen in close confabulation over a drink. Work involved endless meetings, confabulations, and discussions about the law.\nMore examplesFewer examplesI could hear much confabulation coming from the dining room.The results of this month of confabulations are fairly predictable.In the kitchens Mrs Clark and the school cook were having one of their morning confabulations.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversational\ndiscourse\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\nultra-casual\nunderstand\nword-of-mouth\nSee more results »\nconfabulation noun [U or C]\n(FALSE MEMORIES)\nmedical\n&#160; specialized a problem that makes someone produce false memories about events, or the false memories themselves: Confabulation differs from lying in that the person is not consciously attempting to deceive. Confabulations are artificial constructions of our own design built round particles of retained experience.\nMore examplesFewer examplesHis mangled words are a demonstration of what physicians call confabulation. Confabulation is the use of imaginary experiences or made-up information to fill missing gaps of memory. Korsakoff syndrome consists of confabulation, confusion, and recent memory loss.\nSMART Vocabulary: related words and phrases\nMemory and memories\nabiding memory\nassociative memory\nat/in the back of your mind idiom\nclear\ncorporate memory\neidetic\nghost\ngo down\nlearn something by rote idiom\nlive (on) in the memory idiom\nlong memory\nmemory\nmemory bank\nmuscle memory\nrecall\nreminiscence\nretentive\nshort-term memory\nswimmy\nto the best of my recollection idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\nconfabulation noun [U or C]\n(FALSE INFORMATION)\n[ C or U ] the fact of an artificial intelligence (= a computer system that has some of the qualities that the human brain has, such as the ability to produce language in a way that seems human) producing false information: We tried to fine-tune the model to reduce confabulation. Synonym\nhallucination (COMPUTERS)\n[ C ] false information that is produced by an artificial intelligence (= a computer system that has some of the qualities that the human brain has, such as the ability to produce language in a way that seems human): It's important to consider confabulations, or hallucinations, in AI-generated responses, which may lead to the creation of inaccurate information. Synonym\nhallucination (COMPUTERS)\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhexadecimal\nhill climbing\nhome automation\nhotspot\nimportation\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »"}