{"id":106551,"name":"congress","type":"noun","us_sound":"ˈkɑːŋ.ɡres","us_link":"../audio/c/eus70958.mp3","uk_sound":"ˈkɒŋ.ɡres","uk_link":"../audio/c/ukconfu021.mp3","content":"congress noun\n(MEETING)\nAdd to word list\nAdd to word list\n[ C, + sing/pl verb ] a large formal meeting of representatives from countries or societies at which ideas are discussed and information is exchanged: an international/medical congress the congress of the Australian Council of Trade Unions Compare\nawayday mainly UK\nconclave\nconference (MEETING)\nconsultation\nconvention (MEETING)\nconvocation formal\nforum (MEETING)\nmeeting\nseminar\nsummit (MEETING)\nsymposium formal\nMore examplesFewer examplesWelcome to the party's triennial congress.They met at a legal congress.Next year's congress will take place in Delhi.\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconference\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nscrum\nsession\nspeaking engagement\nsymposium\nteleconference\nteleconferencing\nSee more results »\ncongress noun\n(SEX)\n[ U ] formal the act of having sex: Congress had not taken place. They had engaged in sexual congress.\nMore examplesFewer examplesNo child had resulted from that congress.He said he and his wife had very infrequent sexual congress.a four-letter word often used to refer to sexual congressan act of marital congress\nthe elected group of politicians in the US who are responsible for making the law, consisting of the Senate and the House of Representatives: Both houses of Congress have rejected the recent presidential proposal on gun control.\nMore examplesFewer examplesCongress voted against the measures.He spoke to Congress about the war.Congress will decide whether to give funding or not.\nSMART Vocabulary: related words and phrases\nInternational relations: United States politics & government\nanti-Republican\nbattleground state\nbicameral\nblue state\ncaucus\nconfederacy\nG-man\ngubernatorial\nhomeland security\nHouse Committee\nimpeach\njoint resolution\noverride\nsecret service\nsecretary\nSecretary of State\nsenate\nthe Articles of Confederation\nthe GOP\nthe Republican Party\nSee more results »\nAdd to word list\nAdd to word list\na formal meeting of representatives from countries or organizations at which ideas are discussed and information is exchanged: the fourth congress of the European Association for Lexicography\npolitics &amp; government the elected group of people in the US who are responsible for making the law, consisting of the Senate and the House of Representatives: Congress has rejected the president’s plan. congressional adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kənˈɡreʃ·ən·əl/\na congressional committee\nAdd to word list\nAdd to word list\nGOVERNMENT, POLITICS the elected group of politicians in the US who are responsible for making the laws. Congress consists of the Senate and the House of Representatives: Established by Congress to protect investors, the SEC monitors publicly traded interests.\nMEETINGS a large formal meeting of people who represent different organizations, countries, etc., at which ideas are discussed and information is exchanged: The union's annual congress voted on a resolution demanding that the government increase minimum wage levels. the congress of the International Press Institute\nPOLITICS a group of people who are elected to govern in some countries: The Brazilian congress discussed reopening the inquiry."}