{"id":106722,"name":"conjunction","type":"noun","us_sound":"kənˈdʒʌŋk.ʃən","us_link":"../audio/c/conjunction.mp3","uk_sound":"kənˈdʒʌŋk.ʃən","uk_link":"../audio/c/ukconje006.mp3","content":"conjunction noun\n(CONNECTING WORD)\nAdd to word list\nAdd to word list\nB2 [ C ] (written abbreviation conj) a word such as 'and', 'but', 'while', or 'although' that connects words, phrases, and clauses in a sentence\nExamples\nThe conjunction \"although\" joins the two clauses in the sentence \"He left, although I begged him not to.\"When you write a series of nouns or adjectives, such as 'purple, green and blue', you use a conjunction before the last one, instead of a comma.\nSMART Vocabulary: related words and phrases\nLinguistics: parts of speech\nabstract noun\nadj\nadjectival\nadjectivally\nadjunct\nadv\nadverb\nadverbial\narticle\ncommon noun\nconcrete noun\nconj\nconnective\ncount noun\ncountable noun\npart of speech\nprep\npronoun\nrelative pronoun\nverb\nSee more results »\nconjunction noun\n(COMBINATION)\nC2 [ C or U ] (formal conjuncture, uk\nYour browser doesn't support HTML5 audio\n/kənˈdʒʌŋk.tʃər/ us\nYour browser doesn't support HTML5 audio\n/kənˈdʒʌŋk.tʃɚ/) the situation in which events or conditions combine or happen together: An unfortunate conjunction of circumstances led to his downfall. There is a team of writers working in conjunction (with each other) on the book.\n[ C or U ] specialized (formal conjuncture) in astrology, the situation in which two planets appear to be in the same part of the sky as seen from earth: Mars and Venus will be in exact conjunction on 1 September.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe supernatural - general words\nGrammar\nConjunctionsConjunctions are linking words like and, or, but, then and because: …\nAnd, but, either … or, etc. (coordinating conjunctions)Coordinating conjunctions connect items which are the same grammatical type, e.g. words, phrases, clauses. The most common coordinating conjunctions are and, or, but. …\nAfter, although, as soon as, etc. (subordinating conjunctions)Common subordinating conjunctions are: after, (al)though, as, before, if, since, that, until, when, whereas, while, once, so, as soon as, provided that. When a clause follows these conjunctions, it becomes a subordinate clause, which needs a main clause to make a complete sentence. …\nPosition of subordinating conjunctionsWords and phrases such as above all, anyway, as a result, as well, eventually, firstly, however, overall, rather, then, therefore, though, on the contrary (linking adjuncts) can create similar meanings to conjunctions (e.g. adding, cause and effect). These words are adverb phrases and can come in any position which an adverb can occupy: …\nConjunctions: addingOne of the main uses of conjunctions is to add phrases and clauses together. The most common conjunction for adding is and: …\nAdding with andOne of the main uses of conjunctions is to add phrases and clauses together. The most common conjunction for adding is and: …\nAdding with and … tooIn speaking, we can also use and … too to connect words, phrases and clauses. Too focuses on the addition: …\nAdding with as well as and in addition toAs well as is more common than in addition to. In addition to is more formal and used more in writing than in speaking: …\nConjunctions: causes, reasons, results and purposeConjunctions describing causes, reasons, results and purpose are subordinating conjunctions. …\nConjunctions: causes, reasons and resultsThe following conjunctions are commonly used to connect causes/reasons and results. Because, as and since are very similar in meaning. …\nConjunctions: purposeWe use the following conjunctions to talk about purposes or goals. So and so that are more common than so as and in order that. So as is rather informal. In order that is more formal than the others. …\nConjunctions: contrastingThe conjunctions but and although/though connect ideas that contrast. Whereas is also used but it is not as common: …\nButBut is a coordinating conjunction used to connect ideas that contrast. Coordinating conjunctions connect items which are the same grammatical type. …\nAlthough/thoughAlthough/though can be used to contrast ideas. Although/though are subordinating conjunctions used to connect a subordinate clause to a main clause, like after, as, before, if, since, that, even though, even if. …\nBut or although?But cannot be used in the same way as although/though. We use but to connect items which are the same grammatical type (coordinating conjunction). …\nEven though, even ifEven though and even if are also used as subordinating conjunctions in the same way as although/though. Even though is similar to although but it makes a stronger contrast: …\nConjunctions: typical errorsWe use and to connect words in a list and to connect phrases and clauses in a sentence: …\nConjunctions: timeWhen, after, before, until, since, while, once, as and as soon as are subordinating conjunctions which can be used to connect an action or an event to a point in time. …\nWhen, once, as soon asWe can use when, once, as and as soon as to talk about a specific point in time when something happened or will happen: …\nBefore, after and untilWe use before and after to talk about the order of events in the past or future. With before and after, either the main clause or the subordinate clause can come first: …\nWhileWe use while to show that actions or events happen at the same time in the past, present or future: …\nconjunction noun\n(CONNECTING WORD)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; grammar a word such as \"and,\" \"but,\" \"because,\" or \"although\" that connects words, phrases, and clauses in a sentence\nconjunction noun\n(COMBINATION)\n[ C/U ] a combination of events or conditions: [ U ] Physicists are working in conjunction with engineers on the project."}