{"id":106730,"name":"conjunctive","type":"adjective","us_sound":"kənˈdʒʌŋk.tɪv","us_link":"../audio/c/cdo0318usconj1069.mp3","uk_sound":"kənˈdʒʌŋk.tɪv","uk_link":"../audio/c/cdo0318ukconj0347.mp3","content":"conjunctive adjective\n(CONNECTED)\nAdd to word list\nAdd to word list\nrelating to or forming connections between things: These archaeological data are combined with other sources of information to form the basis of the conjunctive approach that underlies our research.\nMore examplesFewer examplesThe conjunctive theme of violence is traceable throughout the trilogy. He said officials must account for \"conjunctive\" relationships or connections between surface and groundwater.Epithelial and conjunctive tissue has more collagen fibres. Adipocytes in this toxic environment increase in size and become surrounded by conjunctive fibres.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalently\nevenly\nevery inch idiom\nfamily\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nconjunctive adjective\n(GRAMMAR)\nlanguage\n&#160; specialized relating to a conjunction (= linking word), or expressing a link between two things that are both true: The \"and\" in this sentence does not have the simple conjunctive use that it appears to have.\nMore examplesFewer examples What might happen if we banned any use of the term \"like\" that extended too far beyond its conjunctive function?Relative pronouns might also be called conjunctive pronouns.Readers should note the conjunctive nature of the clause: it is joined by an “and,” with the first part involving a promise “to indemnify” and a second part involving a promise “to defend.” The question of whether the test should be disjunctive (\"widespread or systematic\") or conjunctive (\"widespread and systematic\") has been discussed at the Conference.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyways\nconcatenate\nconjunctively\nconnective\nconsequently\nergo\nhereby\nI mean idiom\nmean\nnow\nslash\nso\nsure enough idiom\nthe thing is idiom\nthere\nthing\nwhat\nwith that idiom\nSee more results »\nCompare\ndisjunctive"}