{"id":106786,"name":"connect","type":"verb","us_sound":"kəˈnekt","us_link":"../audio/c/connect.mp3","uk_sound":"kəˈnekt","uk_link":"../audio/c/ukconje013.mp3","content":"connect verb\n(JOIN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to join or be joined with something else: Can I connect my printer to your computer? Where does the stove connect (up) to the electricity? Has the phone/electricity/gas/internet been connected (= switched on or joined to the main supply) in your new place yet?\nMore examplesFewer examplesI'll just connect up the printer to the computer and then we'll be ready to go.Most villages in the highlands are now connected by roads.The two skyscrapers were connected by a vertiginous walkway.Use a screw to connect the pieces of metal.The bone broke just where the thigh connects to the knee.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nconnect verb\n(RELATE)\nC2 [ T ] to consider or show a person or thing to be related to someone or something else: She's an actress I connect with the theatre rather than films. Police are connecting the break-in with other recent thefts in the area.\nMore examplesFewer examplesI am not connected with the clothing trade at all.They connected the crop failure with strange weather conditions.Nobody connected her with the thefts.He has been connected with the local church all his life.There is nothing to connect him with the terrorists.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nconnect verb\n(RELATIONSHIP)\nto feel close to someone or have a good relationship with them: She has a remarkable ability to connect with a wide variety of people. We just didn't connect.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nspeak\nstrike\nSee more results »\nconnect verb\n(PHONE)\n[ T ] to make it possible for you to speak to someone else by phone: Could you connect me with/to a number in Paris, please? I'm not getting through.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nconnect verb\n(TRANSPORT)\n[ I ] If two buses, trains, etc. connect, they arrive at times that allow passengers to get off one and onto another: Your flight arrives at 12.30, when it connects with a bus service to your hotel. There's a connecting train service between the airport and the city.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nconnect verb\n(JOIN)\nAdd to word list\nAdd to word list\n[ I/T ] to join together two things, or to be joined together: [ I ] The printer connects to the computer. [ T ] A ferry connects the island to the mainland. [ T ] Is your electricity connected yet (= has your home been joined to the supply)?\nconnect verb\n(RELATE)\n[ T ] to consider a person or thing as related in some way to something else: [ T ] I connect Roberta Peters with the theater rather than movies. [ I ] He’s always found a way to connect with his audience.\nconnect verb\n(TELEPHONE)\n[ T ] to make it possible for someone to communicate by telephone: Operator, please connect me with room 1125.\nconnect verb\n(TRANSPORT)\n[ I ] (of aircraft, trains, etc.) to arrive before a second vehicle leaves on which passengers can continue their trip: The flight to Chicago connects with a flight to New York. connecting adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kəˈnek·tɪŋ/\nThey turned down a connecting road.\nAdd to word list\nAdd to word list\n[ I or T ] to join two or more pieces of equipment together, or to be joined in this way: Wireless networks allow you to connect two or more PCs within your own home.connect to sth The cable connects to a USB slot.connect sth to/with sth Once the drives are installed, connect power and data cables to each one.be connected (to sth) The red light shows that the electricity supply is connected.\n[ T ] to join two places: a high-speed rail corridor connecting the major European citiesconnect sth to/with sth The Midtown tunnel connects Long Island to Manhattan.\n[ I or T ] to create a relationship between two or more people, groups, or things: Internet searches are an important tool for connecting buyers and sellers. Successful marketing is all about connecting with your customers, and building good relationships.connect sb/sth to sb/sth Our aim is to connect our members to a global network of business and industry peers.\n[ I or T ]\n&#160; COMMUNICATIONS, IT, INTERNET to use a computer, phone, etc. in order to use the internet or other computer system: Anti-virus software is a must if your computer is connected to the internet.connect sth to sth More and more employees are connecting smartphones to their employers' network.connect sb/sth with sb/sth an intranet system connecting dealers worldwide with a central databaseget/stay connected Many executives feel a pressure to stay connected outside normal working hours.\n[ T ] to consider or see a relationship between one person or thing and another: He had a problem connecting what he had learned on the course with the day-to-day running of the department.\n[ T ]\n&#160; COMMUNICATIONS to allow someone who has made a phone call to speak to another person or to use a telephone service: One moment please, I'll try to connect you.connect sb to sb/sth BT has raised the price of connecting callers to its directory enquiry service.\n[ I ]\n&#160; TRANSPORT if two public transport vehicles connect, they arrive at suitable times to allow passengers to get off one and onto another in order to continue their journey: connect with sth Your flight arrives at ten o'clock and will connect with a bus service to the conference centre.\na connecting flight/train, etc.\nTRANSPORT a flight, train, etc. that leaves at a suitable time for you to take it to continue your journey after you have travelled on a previous flight, train, etc.: There are connecting services to Schiphol airport in Amsterdam from more than 10 UK regional airports.\nconnect the dots\nto bring together information from different places in order to understand something as a whole or how different things affect each other: We fail to connect the dots between the way we live today and the needs of tomorrow. No one knew all the information and no one connected all the dots."}