{"id":106799,"name":"connection","type":"noun","us_sound":"kəˈnek.ʃən","us_link":"../audio/c/connection.mp3","uk_sound":"kəˈnek.ʃən","uk_link":"../audio/c/ukconje017.mp3","content":"connection noun\n(RELATION)\nAdd to word list\nAdd to word list\nB2 [ C ] the state of being related to someone or something else: The connection between smoking and heart disease is well known. They're sisters? I knew their surname was the same, but I never made (= thought of) the connection. in connection with something\nB2 on the subject of something: They want to talk to you in connection with an unpaid tax bill.\nSee more connections [ plural ]\nthe people you know and who can help you: He only got the job because of his connections!\nSee more\nMore examplesFewer examplesA man was being questioned in connection with her disappearance.Police are interviewing a 43-year-old man in connection with the murder.There's no observable connection between the two events.We were only able to make a tenuous connection between the two robberies.There is a direct connection between smoking and lung cancer.Her essay makes a connexion between post-war technological change and language.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nconnection noun\n(JOIN)\nB1 [ C or U ] the act of joining or being joined to something else, or the part or process that makes this possible: You need a fast internet connection. Alerts are still sent even when the internal network connection is down. a broadband/high-speed/wireless connection The electricity company guarantees connection within 24 hours. No wonder your charger isn't working. There's a loose connection (= a connecting wire has become loose) in the plug.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nconnection noun\n(FEELING)\n[ C ] a feeling that you understand, like, and are interested in someone or something: Generations of readers have felt a connection with the book. It became very clear that voters felt a strong connection to the candidate. We want to encourage activities that build connections between people.\nMore examplesFewer examplesTheir connection is so strong that it almost seems as if they can read each other's minds.His musical connection with his sister is strong and they have collaborated many times.When I hold the sculpture, I feel an intimate connection with the work.Why did someone from the north of England have such a connection with someone from Southern California?While I could see he was attractive, I felt no connection to him at all.Her connection to nature can be traced to her childhood on a small farm.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nconnection noun\n(PHONE)\n[ C ] the way that two people can speak to each other by phone: Sorry, could you repeat that? This is a very bad connection.\nSMART Vocabulary: related words and phrases\nCommunications - by telephone\n0800 number\n3G\n4G\n5G\naeroplane mode\nairplane mode\nautodial\nbuzz\ncaller ID\nDirectory Enquiries\nISDN\noff the hook idiom\npick\npick someone/something up\npocket dial\nprank call\nprank caller\nroam\ntelecoms\ntelephone\nSee more results »\nconnection noun\n(TRANSPORT)\nB2 [ C ] a bus, train, plane, etc. that arrives at a time that allows passengers to get on after getting off another one, so that they can continue their journey: If the flight is late, we'll miss our connection.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\ndeparture\ndescent\ndestination\nentry\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nconnection noun [C/U]\n(TRANSPORTATION)\nAdd to word list\nAdd to word list\nthe fact of arriving on an aircraft, train, etc., before a second vehicle, on which passengers can continue their trip, leaves: We were delayed and missed our connection.\nconnection noun [C/U]\n(THINGS JOINED)\nthe fact of joining two things together, or two things joined together: [ C ] a sewer connection\nconnection noun [C/U]\n(RELATION)\nthe relationship of a person, thing, or behavior to someone or something else: [ C ] Science has not shown a connection between drinking raw milk and disease prevention. [ U ] Two men have been arrested in connection with the theft (= in some relation to it). [ C ] He got the job through connections (= people who helped him).\nAdd to word list\nAdd to word list\n[ C ] a relationship between two things, ideas, etc.: connection between sth and sth a study of the connection between pay and performance\n[ C or U ]\n&#160; INTERNET, IT, COMMUNICATIONS a way of joining users to a system, such as the internet or a phone system: a(n) internet/broadband/wireless connection Could you speak up, please? This is a very bad connection. The electricity company promises connection for new customers within 48 hours.\n[ C ]\n&#160; TRANSPORT a plane, train, etc. that leaves at a suitable time for you to take it to continue your journey after travelling on another plane, train, etc.: We missed our connection and had to stay overnight at an airport hotel.\nconnections [ plural ]\nimportant people who you know and who can help and advise you: Through his father's connections he got a job with a bank in the City.\nconnections [ plural ]\nTRANSPORT road, rail, etc. systems between one place and another: Improved road and rail connections have benefited the area greatly."}