{"id":106917,"name":"conquer","type":"verb","us_sound":"ˈkɑːŋ.kɚ","us_link":"../audio/c/conquer.mp3","uk_sound":"ˈkɒŋ.kər","uk_link":"../audio/c/ukconje012.mp3","content":"Add to word list\nAdd to word list\nC1 to take control or possession of foreign land, or a group of people, by force: The Spanish conquered the New World in the 16th century. The English were conquered by the Normans in 1066.\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\nto deal with or successfully fight against a problem or an unreasonable fear: He has finally conquered his fear of spiders. It may be many years before this dreadful disease is conquered.\nSMART Vocabulary: related words and phrases\nAttacking & invading\naggressor\nambush\nbeleaguer\nbeleaguered\nbesiege\nblitz\nblitzkrieg\ncyberwarfare\nfalse flag\nforay\ngoing-over\nhard power\nhit and run\nincursion\nkamikaze\npre-emption\nprivateer\nraid\nreconquer\nreconquest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning and defeating\nSolving and solutions\nAdd to word list\nAdd to word list\nto defeat an enemy, or to take control or possession of a foreign land: I felt like I had conquered the world.\nIf you conquer a disease or condition, you succeed in dealing with or fighting against it: Students have to conquer their initial shyness. conqueror noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑŋ·kər·ər/\nthe conqueror Genghis Khan conquest noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑn·kwest, ˈkɑŋ-/\n[ C ] Several generations turned their attention towards the conquest of the Mediterranean region."}