{"id":107483,"name":"consumed","type":"verb","us_sound":"kənˈsuːm","us_link":"../audio/c/consume.mp3","uk_sound":"kənˈsjuːm","uk_link":"../audio/c/ukconst017.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nconsume\nconsume verb [T]\n(USE RESOURCE)\nC1 to use fuel, energy, or time, especially in large amounts: Our high living standards cause our current population to consume 25 percent of the world's oil.\nB2 formal to eat or drink, especially a lot of something: He consumes huge amounts of bread with every meal.\nThesaurus: synonyms, antonyms, and examples\nto eat foodeatWhat do you want to eat for lunch?haveI'll just have one more piece of chocolate cake.consumeHe consumes vast quantities of bread with every meal.devourThe children devoured a whole packet of biscuits.bolt (down)Don't bolt down your food - you'll make yourself ill!gobble (up/down)The children gobbled their sweets.\nSee more results »\nMore examplesFewer examplesIt's the sum total of what you eat over a long period that matters and not what you consume in a day.We consumed vast quantities of food and drink that night.Alcohol should be consumed in moderation, and this is particularly true for pregnant women.We recommend that this wine should be consumed within six months.The defence budget consumes vast amounts of money.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\nDrinking\nconsume verb [T]\n(DESTROY)\nIf a fire consumes something, it destroys it completely.\nThesaurus: synonyms, antonyms, and examples\nto burn down or burn something downburn downThe family home burned down in a matter of hours.burn to the groundToday marks 400 years since the theatre burned to the ground.go upAfter the initial explosion, the building went up in a matter of minutes.go up in flamesThe precious collection went up in flames.go up in smokeAll my life's work has gone up in smoke.consumeAll her possessions were consumed in the blaze.\nSee more results »\nbe consumed by/with something\nC2 to have so much of a feeling that it affects everything you do: He was consumed with jealousy. As a teenager, I was consumed by passion for the boy next door. See also\nall-consuming\nSMART Vocabulary: related words and phrases\nBurning, burnt & on fire\nafire\naflame\nblaze\nburn (something) down\nburn sb up\nburned out\nburnt out\ncombustible\ncombustion\nconsume\nflare\nfrazzled\nincinerate\ninflammable\non fire idiom\npost-burn\nreignite\nscald\nself-immolation\nunburnable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDestroying and demolishing\nExperiencing and suffering"}