{"id":107150,"name":"consistent","type":"adjective","us_sound":"kənˈsɪs.tənt","us_link":"../audio/c/consistent.mp3","uk_sound":"kənˈsɪs.tənt","uk_link":"../audio/c/ukconse013.mp3","content":"consistent adjective\n(NOT CHANGING)\nAdd to word list\nAdd to word list\nC2 always behaving or happening in a similar, especially positive, way: There has been a consistent improvement in her attitude. Her work is sometimes good, but the problem is she's not consistent. Opposite\ninconsistent (CHANGING)\nThesaurus: synonyms, antonyms, and examples\nstaying the sameconstantCheck to make sure your oven maintains a constant temperature.the sameYou look exactly the same as you did ten years ago!same old same oldThe Italian restaurant is under new management, but it's just the same old same old.unchangingHis novel is about the unchanging nature of humanity.unchangeableThe company's position on the matter is absolute and unchangeable.\nSee more results »\nMore examplesFewer examplesThere has been a consistent increase in burglaries round here.His performance on the pitch is far from consistent.He produces work of a consistent high quality.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\ncontinuum\ndiffusible\ninveteracy\nkept\nleave well alone idiom\nleft\nlevel off\npeg\nstabilization\nstabilize\nstably\nstay\nsteadfast\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nconsistent adjective\n(AGREEING)\nC2 [ after verb ] in agreement with other facts or with typical or previous behaviour, or having the same principles as something else: What the witness said in court was not consistent with the statement he made to the police. We do not consider his behaviour to be consistent with the holding of a high-ranking job.\nMore examplesFewer examplesThe figures are not consistent with his argument.His remarks are not consistent with the role of a head teacher.Her version of events is not consistent with the evidence.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nRelated word\nconsistently\nconsistent adjective\n(NOT VARYING)\nAdd to word list\nAdd to word list\nalways happening or behaving in a similar way: The president has been remarkably consistent on economic issues.\nconsistent adjective\n(AGREEING)\nagreeing with something said or done previously: The witness’s story is consistent with the police report."}