{"id":107371,"name":"constraint","type":"noun","us_sound":"kənˈstreɪnt","us_link":"../audio/c/constraint.mp3","uk_sound":"kənˈstreɪnt","uk_link":"../audio/c/ukconsp027.mp3","content":"Add to word list\nAdd to word list\nC2 [ C ] something that controls what you do by keeping you within particular limits: The constraints of politeness wouldn't allow her to say what she really thought about his cooking. Financial constraints on the company are preventing them from employing new staff. Synonyms\ncheck (LIMIT)\ncontrol (POWER)\ncurb (CONTROL)\ncurtailment\nlimit\nlimitation\nrestraint\nrestriction\n[ U ] formal unnatural behaviour that is sometimes the result of forcing yourself to act in a particular way: She tried to appear friendly, but her constraint was obvious. under constraint formal\nIf you do something under constraint, you do it only because you have been forced to: They confessed, but only under severe constraint.\nSee more\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncrowd\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelf-control and moderation\nAdd to word list\nAdd to word list\nsomething that limits the range of a person’s actions or freedom: In Egypt, the biggest constraint on new agricultural production is water.\nAdd to word list\nAdd to word list\nsomething that controls what you can do by keeping you within particular limits: The constraint of distribution costs remains the severest of all.budget/financial, etc. constraints This growth in revenue may soften the government's budget constraints and allow it to increase public spending.big/major/serious constraint They believe that the new legislation will remove a major constraint to economic expansion.a constraint on/to sth The cost of capital is an important constraint on business activity.place/put a constraint on sth Some external factors placed constraints on the scope of the work that could be undertaken. Among those conditions was a five-year time constraint. (= time limit)"}