{"id":107200,"name":"consolidator","type":"noun","us_sound":"kənˈsɑː.lə.deɪ.t̬ɚ","us_link":"../audio/c/cdo1119uscons0234.mp3","uk_sound":"kənˈsɒl.ɪ.deɪ.tər","uk_link":"../audio/c/cdo1119ukcons0210.mp3","content":"Add to word list\nAdd to word list\na company that buys a supply of particular goods or services from different places and then offers them for sale to the public: The website lets you scour the sites of all airlines, hotels, and consolidators for the best price. Consolidator tickets are generally non-refundable.\na large, successful company that buys other companies in order to form a larger organization: Many regional chains went bankrupt or were bought up by consolidators. You want to be with one of the consolidators, not one of the companies that are going to be acquired.\na transport company that arranges for goods sent by different companies to be stored and transported together: Intermediaries known as consolidators gather together goods or packages from a variety of customers and load them all into the container. A trusted container is one being shipped to an importer or by a consolidator known to customs inspectors.\n(also debt consolidator, loan consolidator) a company that takes all of someone's debts and combines them into a single loan (= an amount of money borrowed): Many consolidators do not offer fixed interest rates. She and her husband sought help from a debt consolidator earlier this year.\nMore examplesFewer examplesA good place to start for good airline fares is with a local travel agent, who has special consolidators that they can go through to save money.Despite the setbacks Mr Drummond feels Virtual's cash resources makes it a natural consolidator in the market and will look for acquisitions. As mentioned, your total cost of debt service will cost significantly more after you’ve set up the agreement and payment plan with the consolidator.Export prices to Pioneer are inclusive of freight to its consolidator in Los Angeles.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nAdd to word list\nAdd to word list\nCOMMERCE a company that buys a supply of particular goods or services from different places and then offers them for sale to the public: Hotel Reservations Network is a hotel room consolidator which takes advantage of volume buying to offer large discounts on rooms in major cities.\nECONOMICS, FINANCE a large, successful company that buys other companies in order to form a larger organization: It has been one of the most aggressive consolidators in the investment banking industry sector.\nTRANSPORT a transport company that arranges for goods sent by different companies to be stored and transported together: We are a consolidator, offering freight consolidation services for international shipping."}