{"id":107408,"name":"constructivist","type":"adjective","us_sound":"kənˈstrʌk.tɪ.vɪst","us_link":"../audio/c/cdo0318uscons1088.mp3","uk_sound":"kənˈstrʌk.tɪ.vɪst","uk_link":"../audio/c/cdo0319ukcons0341.mp3","content":"constructivist adjective\n(ART)\nAdd to word list\nAdd to word list\nart\n&#160; specialized (also Constructivist) relating to constructivism in art (= the idea that art should have a social purpose): Russian constructivist art\nMore examplesFewer examplesThe owners may just have liked Soviet constructivist art and thought it looks cool. My piece focused on how constructivist sculptors responded to the Russian Revolution.He took lessons from Constructivist painter Natalia Goncharova.The tower is a fantastic monument of Russian Constructivist architecture.\nconstructivist adjective\n(EDUCATION)\neducation\n&#160; specialized relating to constructivism in education (= the idea that knowledge comes from experiences and ideas): The original strategy for presenting the course encouraged constructivist learning. See\nconstructivism\nMore examplesFewer examplesAccording to constructivist theories of learning, it is through the learner's activity that learning outcomes are achieved.A constructivist approach can be hard for students and their parents, who might need a lot of guidance in math.The website includes many resources for applying constructivist theory in maths and science.a constructivist textbook called \"Mathematics in Context\"\nSMART Vocabulary: related words and phrases\nTypes of education\nabstinence education\nabstinence programme\nabstinence-only\nacademically\nadaptive learning\nCAL\nchild-centred\nclassroom\nhomeschool\nhomeschooler\nhomeschooling\nhothouse\nhybrid\nintersession\nm-learning\nnursery\nspecial educational needs\nvirtual learning environment\nVLE\nvocationally\nSee more results »\nconstructivist noun [C]\n(ART)\nart\n&#160; specialized (also Constructivist) someone who practises or believes in constructivism in art (= the idea that art should have a social purpose): It looks like something the Russian constructivists might have imagined.\nMore examplesFewer examplesThere are exceptional galleries of Dada and the Surrealists, Russian Constructivists, and Pop Art.The exhibition covers everything from the cool functionalism of the early Constructivists to the radical formal experiments of Konstantin Melnikov.\nconstructivist noun [C]\n(EDUCATION)\neducation\n&#160; specialized someone who practises or believes in constructivism in education (= the idea that knowledge comes from experiences and ideas): The new curriculum divides the traditionalists and the constructivists. See\nconstructivism\nMore examplesFewer examplesConstructivists stress that students should be allowed to actively engage in the construction of knowledge.They insist schools are run by constructivists who have turned them into hotbeds of progressive thinking.\nSMART Vocabulary: related words and phrases\nTypes of education\nabstinence education\nabstinence programme\nabstinence-only\nacademically\nadaptive learning\nCAL\nchild-centred\nclassroom\nhomeschool\nhomeschooler\nhomeschooling\nhothouse\nhybrid\nintersession\nm-learning\nnursery\nspecial educational needs\nvirtual learning environment\nVLE\nvocationally\nSee more results »"}