{"id":107265,"name":"conspiracy","type":"noun","us_sound":"kənˈspɪr.ə.si","us_link":"../audio/c/conspiracy.mp3","uk_sound":"kənˈspɪr.ə.si","uk_link":"../audio/c/ukconsp003.mp3","content":"Add to word list\nAdd to word list\nthe activity of secretly planning with other people to do something bad or illegal: The three men are accused of conspiracy. [ + to infinitive ] She has been charged with conspiracy to murder. I think there was a conspiracy to keep me off the committee. conspiracy of silence\na general agreement to keep silent about a subject for the purpose of keeping it secret: The conspiracy of silence around these buried munitions endangered public health.\nSee more\nMore examplesFewer examplesThey are both charged with conspiracy to defraud an insurance company of $20 000.It's all part of a conspiracy to keep women down.He believes there is a right-wing conspiracy organized by the CIA and the military-industrial complex to maneuver the country into another war.The tape recordings provided prosecutors with the smoking gun they needed to prove he'd been involved in the conspiracy.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theory\nconspirator\nconspire\nentrap\nentrapment\nhatch\nplotter\npretext\npretextual\nput-up job\nscheme\nset something up\nsting\ntrap\nwheeze\nSee more results »\nAdd to word list\nAdd to word list\na secret plan made by two or more people to do something bad, illegal, or against someone’s wishes: [ C ] I think there was a conspiracy to keep me off the committee.\nAdd to word list\nAdd to word list\na secret agreement made between two or more people or groups to do something bad or illegal that will harm someone else: conspiracy against sb It is my client's opinion that there has been a conspiracy against him.conspiracy between sb (and sb) The group of optometrists denied there was any conspiracy between them and other industry associations to stop the sale of lenses to mail order houses.conspiracy to do sth The four directors have denied conspiracy to defraud pensioners by misusing shares that belonged to pension funds. A group of former housing counsellors has been indicted on fraud and conspiracy charges in one of the biggest real estate fraud cases ever seen in the state."}