{"id":107511,"name":"consumption","type":"noun","us_sound":"kənˈsʌmp.ʃən","us_link":"../audio/c/consumption.mp3","uk_sound":"kənˈsʌmp.ʃən","uk_link":"../audio/c/ukconst024.mp3","content":"consumption noun [U]\n(USE)\nAdd to word list\nAdd to word list\nC1 the amount used or eaten: As a nation, our consumption of junk food is horrifying. We need to cut down on our fuel consumption by having fewer cars on the road.\nthe act of using, eating, or drinking something: The meat was clearly unfit for human consumption (= not safe for people to eat). These products are not for national consumption, but for export.\nthe situation in which information, entertainment, etc. is intended for a particular group of people: This memo is for internal consumption only. The movie was not intended for public consumption.\nMore examplesFewer examplesThe commonest cause of cirrhosis is alcohol consumption.In this period, there were 974 outbreaks of communicable disease attributed to the consumption of raw milk.The new exhaust system, it is claimed, will lower fuel consumption.She said that industrialized countries should reduce their gluttonous consumption of oil.The inspector declared the meat fit for human consumption .\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\nDrinking\nAudiences and spectators\nconsumption noun [U]\n(DISEASE)\nold-fashioned for\ntuberculosis (= a serious disease of the lungs)\nSMART Vocabulary: related words and phrases\nRespiratory disorders\naltitude sickness\nanti-asthma\nanti-tubercular\nanti-tuberculosis\nanti-tuberculous\nasthmatic\ncongested\nemphysema\nhacky\nhay fever\nhepatopulmonary syndrome\nhyperventilate\nlegionnaires' disease\nlong Covid\nsore throat\nstrep throat\nstuffiness\ntubercular\nupper airway resistance syndrome\nventilate\nSee more results »\nAdd to word list\nAdd to word list\nan amount of something that is used, or the process of using something, esp. so that there is less of it: Consumption of electricity is always higher during the summer months because of air-conditioning.\nsocial studies Consumption is the using of goods and services in an economy, or the amount of goods and services used.\nAdd to word list\nAdd to word list\nthe act of using, eating, or drinking something, or the amount that is used, etc.: fuel/energy, etc. consumption Water transport costs less than road transport, cuts congestion, and reduces energy consumption.increase/reduce the consumption of sth a program designed to increase the consumption of fruit and vegetables by low-income families As a nation, our consumption of junk food is horrifying.\nthe process of buying and using goods, or the amount that is bought and used: domestic/home consumption Most of our products are made for domestic consumption rather than export. Increased household wealth is associated with higher personal consumption. See also\ncapital consumption\nconspicuous consumption\nfinal consumption"}