{"id":107466,"name":"consulted","type":"verb","us_sound":"kənˈsʌlt","us_link":"../audio/c/consult.mp3","uk_sound":"kənˈsʌlt","uk_link":"../audio/c/ukconst010.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nconsult\nC1 [ T ] to get information or advice from a person, book, etc. with special knowledge on a particular subject: If the symptoms get worse, consult your doctor. I'm not quite sure how to get there - I'd better consult a map.\nThesaurus: synonyms, antonyms, and examples\nto ask a questionaskI asked him what time the museum opened, but he didn't know. inquireShe called to inquire when her car would be ready.consultConsult your doctor if your symptoms don't improve.ask aroundI'll ask around and see if anyone knows of a good carpenter.questionThe police are questioning him about the robbery.interviewAfter the race, she was interviewed by journalists.\nSee more results »\nC1 [ I or T ] to discuss something with someone before you make a decision: Why didn't you consult me about this? This afternoon the president was consulting with his advisers.\nMore examplesFewer examplesIf you have any problems, consult the FAQs on our website.If any of these symptoms occur while you are taking the medicine, consult your doctor immediately.If the pain persists, consult a doctor.They consulted the village elders.I'll have to consult my colleagues about the proposed changes.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDebate & discussion"}