{"id":107057,"name":"conservation","type":"noun","us_sound":"ˌkɑːn.sɚˈveɪ.ʃən","us_link":"../audio/c/conservation.mp3","uk_sound":"ˌkɒn.səˈveɪ.ʃən","uk_link":"../audio/c/ukconsc023.mp3","content":"Add to word list\nAdd to word list\nB2 the protection of plants and animals, natural areas, and interesting and important structures and buildings, especially from the damaging effects of human activity: wildlife conservation a conservation area Related word\nconservationist\nC1 carefully using valuable natural substances that exist in limited amounts in order to make certain that they will be available for as long a time as possible: the conservation of coal/gas/oil reserves Energy conservation reduces your fuel bills and helps the environment. Related word\nconserve\nphysics\n&#160; specialized the principle that in a physical system the total quantity of a physical property, such as energy or mass, does not change: The law of conservation of energy states that energy cannot be created or destroyed. This section covers the partial differential equations that describe the conservation of mass. conservation of matter/charge/momentum Conservation laws are fundamental to our understanding of the physical world.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProtection and protectors\nPhysics: particular theories & concepts\nAdd to word list\nAdd to word list\nConservation is a plan for avoiding the unnecessary use of natural materials such as wood, water, or fuel: The university is saving $300,000 per year by its energy conservation efforts.\nConservation is also the protection of plants, animals, and natural areas, esp. from the damaging effects of human activity: wildlife conservation\nAdd to word list\nAdd to word list\nthe process of using water, gas, electricity, etc. carefully in order not to waste it: The main objectives are the conservation of materials and energy in support of the sustainable development program. energy/water conservation\nthe protection of the environment: nature/environmental conservation It is now considered essential for any new fish-farming businesses to consult the relevant conservation agency."}