{"id":107486,"name":"consumer","type":"noun","us_sound":"kənˈsuː.mɚ","us_link":"../audio/c/consumer.mp3","uk_sound":"kənˈsjuː.mər","uk_link":"../audio/c/ukconst018.mp3","content":"Add to word list\nAdd to word list\nB2 a person who buys goods or services for their own use: The new rates will affect all consumers, including businesses. consumer rights/advice\nThesaurus: synonyms, antonyms, and examples\na person who buys somethingshopperHoliday shoppers mobbed the sale.customerShops were lowering prices to attract more customers.punterUK The shop's running a raffle to pull in the punters.patronShe's been a regular patron of the pub for years.consumerConsumers did not spend as much last quarter as analysts predicted.buyerWe haven't found a buyer for the house yet.\nSee more results »\nMore examplesFewer examplesAgricultural companies have failed to convince consumers that GM foods are safe.A poll was conducted to gauge consumers' attitudes.What the problem comes down to is 'Will the consumer be willing to pay more for a higher quality product?'Low consumer demand has forced us to mark down a wide range of goods, sometimes by as much as 30%.\nSMART Vocabulary: related words and phrases\nPeople who buy things\nanti-consumer\nbidder\nbuyer\ncouponer\ncustom\nfoot traffic\nimporter\nlate adopter\nmulti-client\nmystery shopper\nprosumer\npunter\npurchaser\nrag-and-bone man\nragman\nscrap dealer\nspeculator\ntradesman\ntradespeople\nwholesaler\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies someone who buys goods or services for personal use: consumer goods/spending American consumers are becoming informed about the safety of products made for children.\nAdd to word list\nAdd to word list\nCOMMERCE a person who buys goods or services for their own use: The new telephone rates will affect all consumers.the consumer The extra costs of production will be passed on to the consumer.average/individual, etc. consumer These changes will not affect the average consumer.consumer rights/needs/preferences This article examines easy ways of researching consumer preferences with regard to various product types.\na person, organization, country, etc., that uses something, especially fuel, energy, etc.: large/great, etc. consumer of sth The United States is currently the world's largest consumer of energy. The French rank among the world's most discriminating consumers of chocolate.household/industrial consumers an energy-efficient program for low-income household consumers See also\ndirect-to-consumer\nend consumer"}