{"id":107014,"name":"consensus","type":"noun","us_sound":"kənˈsen.səs","us_link":"../audio/c/consensus.mp3","uk_sound":"kənˈsen.səs","uk_link":"../audio/c/ukconsc017.mp3","content":"Add to word list\nAdd to word list\nC2 a generally accepted opinion or decision among a group of people: The general consensus in the office is that he can't do his job. Could we reach a consensus on this matter? Let's take a vote.\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nMore examplesFewer examplesWe were unable to reach a consensus about membership fees.There is little consensus about the issue of smacking children.We managed to get a consensus about not smoking in the office.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nAdd to word list\nAdd to word list\na generally accepted opinion; wide agreement: They’re trying to build a consensus on the need to improve the city’s schools.\nAdd to word list\nAdd to word list\na generally accepted opinion among a group of people: The consensus among City economists is that interest rates will be held at 1%.\nagreement among a group of people: consensus on/about sth Achieving an international consensus on these issues is proving difficult.a general/broad/growing consensus There is a growing consensus about the best methods for reducing carbon emissions.reach/build/agree a consensus Our top priority must be building a consensus with legislators. The process of taking decisions by consensus can be fraught with difficulty."}