{"id":107097,"name":"consideration","type":"noun","us_sound":"kənˌsɪd.əˈreɪ.ʃən","us_link":"../audio/c/consideration.mp3","uk_sound":"kənˌsɪd.əˈreɪ.ʃən","uk_link":"../audio/c/ukconse006.mp3","content":"consideration noun\n(CAREFUL THINKING)\nAdd to word list\nAdd to word list\nB2 [ U ] the act of thinking about something carefully: After some consideration, we've decided to sell the house. The whole matter needs (to be given) careful consideration.\nMore examplesFewer examplesAs I was just saying, I think the proposal needs further consideration.Three sites are presently under consideration for the new hotel.I've put my proposition to the company director for his consideration.The proposals that you have put forward deserve serious consideration.That's an interesting job offer - I'd give it some serious consideration if I were you.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nconsideration noun\n(SUBJECT/FACT)\nB2 [ C or U ] a particular subject or fact that needs to be thought about when judging something: Comfort/Safety is an important consideration. take something into consideration\nto think carefully about a particular fact when deciding or judging something : It may be fairly cheap to buy, but you've got to take into consideration the money you'll spend on repairs.\nSee more\nMore examplesFewer examplesYou have to take their worries into consideration.The proximity of shopping facilities is an important consideration for us.Cost is not a consideration for him.I'd like you to take the environmental impact into consideration.Price is a major consideration for them.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nconsideration noun\n(CARE)\nC2 [ U ] behaviour that is kind and considers people's feelings: You have no consideration for others! Turn your music down and show a little consideration for the neighbours! We didn't publish the details, out of consideration for the victim's family.\nSMART Vocabulary: related words and phrases\nKind & thoughtful\naccommodating\naccommodatingly\nattentive\nattentively\nattentiveness\ncooperative\ncooperatively\ndiplomacy\ndiplomatic\ndiplomatically\nmean well idiom\nmotherly\nneighbourliness\nneighbourly\ntactfully\nthe milk of human kindness idiom\nthoughtful\nthoughtfully\nthoughtfulness\nunmalicious\nSee more results »\nconsideration noun\n(MONEY)\n[ C ] old-fashioned or humorous a payment for a service: For a small consideration, sir, I'll show you the way there myself.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nconsideration noun\n(CARING ABOUT)\nAdd to word list\nAdd to word list\n[ U ] the act, state, or quality of caring about or respecting: He showed very little consideration for anyone but himself.\nconsideration noun\n(THINKING ABOUT)\n[ C/U ] the particular subject or thing a person might think about or do something about: [ C ] Financial considerations were a factor in the decision. [ U ] You should take his youth into consideration before you punish him.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW in a contract, something with financial value that is given in exchange for something else, for example, a bank loan that is made in exchange for the borrower's promise to repay it: From the wording of the agreement it was clear that the initial payment was part of the consideration. A lack of consideration is one reason why a promise to do something may not be recognized as legally binding by a court of law.\n[ C ] formal an amount of money as payment for a service: He agreed to do the job for a small consideration."}