{"id":107184,"name":"console","type":"verb","us_sound":"kənˈsoʊl","us_link":"../audio/c/console_01_00.mp3","uk_sound":"kənˈsəʊl","uk_link":"../audio/c/ukconse019.mp3","content":"Add to word list\nAdd to word list\nto make someone who is sad or disappointed feel better, usually by giving them comfort or sympathy: Her friends tried to console her, telling her \"Everything will be fine.\" He was consoled by the fact that he was young enough to try again the following year. I consoled myself with the thought that no one else could have done any better. Synonyms\ncomfort\nsolace literary\nsoothe\nMore examplesFewer examplesShe appeared shocked and began crying as her attorney tried to console her.Console yourself with the knowledge that you are right.The one thing that consoled him at that time was writing poetry.\nSMART Vocabulary: related words and phrases\nReassuring\nassure someone of something\nbe/take a weight off your mind idiom\nblandishments\ncalm (someone) down\ncomforting\nconsolation\nconsoling\nconsolingly\nlift\nlighten\nmind\nreassurance\nreassure\nreassuring\nset/put someone's mind at rest/ease idiom\nsettle down\nshould\nthey should worry! idiom\nweight\nyou do you idiom\nSee more results »\nconsole noun [C]\n(EQUIPMENT)\na surface or device with controls for electronic equipment, a vehicle, etc.: A sound engineer's console looks as complicated as the cockpit of a jet aircraft.\n(also game console, gaming console) a piece of electronic equipment for playing computer games: It's the only console that will run this game. The early model was a $40 game console that plugged directly into your TV.\nMore examplesFewer examplesTo raise or lower the seats, you simply depress a button on the console.A flat-screen TV is positioned above the driver's console.The surgeon sits at the console and uses his hands to guide the instruments.These are the people who will be behind the consoles for the next space mission.You can get a backpack designed specifically to carry your console, so you're never far from your games.Have you experienced the immersive addictiveness of a high-end game console?The company unveiled its sleek new gaming console.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\nconsole noun [C]\n(TABLE)\n(also console table) a type of narrow table, sometimes fixed to a wall: You could try adding a mirrored top to a hallway table or a console. Console tables are ideal for narrow passageways.\nMore examplesFewer examplesA marble bust stands on the console.I bought a console table with two drawers for the hallway.\nSMART Vocabulary: related words and phrases\nTables & desks\nbedside table\nbench\nbenchtop\nbooth\nbreakfast bar\nbureau\ncard table\ndrafting table\ndressing table\ndrop-leaf table\nhigh table\nleaf\nrolltop desk\nstanding desk\ntabletop\nthe dinner table\ntrestle\ntrestle table\nworktop\nwriting desk\nSee more results »\nconsole verb [T]\n(COMFORT)\nAdd to word list\nAdd to word list\nto give comfort and sympathy to someone who is sad or disappointed: The boys consoled one another after their team’s first defeat.\nconsole noun [C]\n(CONTROLS)\na special area containing a set of controls for electric equipment, esp. on an aircraft or boat: The jet’s console contains dozens of dials, meters, and switches.\nA console is also a cabinet that sits on the floor and contains an electrical unit such as a television."}