{"id":107038,"name":"consequence","type":"noun","us_sound":"ˈkɑːn.sə.kwəns","us_link":"../audio/c/consequence.mp3","uk_sound":"ˈkɒn.sɪ.kwəns","uk_link":"../audio/c/ukconsc019.mp3","content":"Add to word list\nAdd to word list\nB2 a result of a particular action or situation, often one that is bad or not convenient: Not making a will can have serious consequences for your children and other family members. Scientists think it is unlikely that any species will actually become extinct as a consequence of the oil spill. I told the hairdresser to do what she wanted to my hair, and look at the consequences! Well, if you insist on eating so much, you'll have to suffer/take (= accept and deal with) the consequences!\nThesaurus: synonyms, antonyms, and examples\nthe result of somethingresultHis firing was a direct result of his refusal to follow the employment policies.effectThe radiation leak has had a disastrous effect on the environment.consequenceFailure to do proper safety checks may have serious consequences.outcomeIt's too early to predict the outcome of the meeting.upshotThe upshot of the discussions is that there will be no further redundancies.end resultThe end result of these changes should be a more efficient system for dealing with complaints.\nSee more results »\nof little/no consequence C1 (also not of any/much consequence)\nnot important: The money was of little consequence to Tony.\nSee more\nMore examplesFewer examplesThe accident was the inevitable consequence of carelessness.He left as a direct consequence of what she said.The drought has had devastating consequences.The government is trying to do more to educate the public about the consequences of drug abuse.He always makes snap decisions and never thinks about their consequences.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\nend result\nfallout\nfirst fruit\nfruit\nimplication\nin\nironically\nrepercussion\nresultant\nresultantly\nresulting\nreverberation\nsequel\nside effect\néclat\nSee more results »\nconsequence noun\n(RESULT)\nAdd to word list\nAdd to word list\n[ C usually pl ] a result of an action or situation, esp. (in the plural) a bad result: For someone who is old and weak, the consequences of a broken hip can be serious.\nconsequence noun\n(IMPORTANCE)\n[ U ] the condition of having a lasting effect; importance: Last summer there were 15 hurricanes, but only one was of any consequence."}