{"id":107341,"name":"constitution","type":"noun","us_sound":"ˌkɑːn.stəˈtuː.ʃən","us_link":"../audio/c/eus70975.mp3","uk_sound":"ˌkɒn.stɪˈtʃuː.ʃən","uk_link":"../audio/c/ukconsp021.mp3","content":"constitution noun [C]\n(LAWS)\nAdd to word list\nAdd to word list\nC1 the set of political principles by which a state or organization is governed, especially in relation to the rights of the people it governs: Britain has no written constitution. the Constitution of the United States Under (= as part of) the union constitution, a new committee is elected each year.\nMore examplesFewer examplesClause 4 of the constitution is thought to be the most important section.Until the constitution is amended, the power to appoint ministers will remain with the president.When he suspended the constitution and dissolved Congress, he had the imprimatur of the armed forces.East and West Germany united under article 23 of the Bonn constitution.The drafting of a new constitution cannot be a monopoly of the white minority regime .\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: legislation & law-making\nconstitution noun [C]\n(HEALTH)\nC2 the general state of someone's health: He has a very strong constitution.\nSMART Vocabulary: related words and phrases\nHealth in general\nattachment\nconstitutional\nexcess deaths\nexcess mortality\nfunctioning\nhealth\nhealthful\nhealthfully\nhealthily\nhealthy\nhygienic\nnon-carcinogenic\nnon-medical\npublic health\nsanitarily\nsanitary\nsanitation\nscraping\nshape\nwellness\nSee more results »\nconstitution noun [C]\n(PARTS)\nhow something is made up of different parts: the constitution of a chemical compound\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncomposition\ncompositional\ncompositionally\ncomprise\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitutive\nform\nfrom\nmake\nmake something up\nmulti-component\nof\nconstitution noun\n(LAWS)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; politics &amp; government the set of political principles by which a place or organization is governed, or the written document that records it: The first ten amendments to the Constitution of the United States are called the Bill of Rights.\n[ C ]\n&#160; US history, politics &amp; government The Constitution of the United States is a document that establishes the basic rules and laws of the American government.\nconstitution noun\n(HEALTH)\n[ C usually sing ] a person’s physical condition, esp. as shown by strength and staying well: a weak constitution\nAdd to word list\nAdd to word list\nGOVERNMENT a written set of rules by which a country, state, or organization is governed: the Constitution of the United Statesthe constitution requires/prohibits/allows, etc Mexico's constitution guarantees the right of free travel to its citizens.draw up/adopt/amend the constitution Following these changes, it was proposed that the company's constitution be amended.under the constitution Under the union constitution, a new committee must be elected every year.\nthe way that something is formed from different parts: the constitution of society Several people objected to the constitution of the committee, arguing that women were under-represented."}