{"id":107487,"name":"consumerism","type":"noun","us_sound":"kənˈsuː.mɚ.ɪ.zəm","us_link":"../audio/c/usconst007.mp3","uk_sound":"kənˈsjuː.mə.rɪ.zəm","uk_link":"../audio/c/ukconst019.mp3","content":"Add to word list\nAdd to word list\npolitics the state of an advanced industrial society in which a lot of goods are bought and sold\ndisapproving the situation in which too much attention is given to buying and owning things: He disliked Christmas and its rampant (= extreme) consumerism.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontractual\ncontractually\ncoopetition\ncop\ncorporate image\nIPO\nlean\nleanly\nlock something in\nm-commerce\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\nGreedy\nAdd to word list\nAdd to word list\nsocial studies protection of consumers against harmful products or business methods\nAdd to word list\nAdd to word list\nECONOMICS a situation involving large amounts of goods being sold to individuals rather than businesses, especially when this is very important to an economy: State boundaries matter little in an age of global consumerism and investment. More and more people are convinced of the importance of ethical and green consumerism.\noften disapproving the situation when too much attention is given to buying and owning things, often things that are not really necessary: Uncontrollable consumerism has become a watchword of our culture despite regular and compelling calls for its end. Bottled water very clearly reflects the wasteful and reckless consumerism in this country.\nSOCIAL RESPONSIBILITY the protection of customers from dishonest business activities and advertising, from unsafe products, etc.: In a competitive market consumerism can be in the interest of sellers as well as buyers, if it is made into an effective selling point."}