{"id":106979,"name":"conscript","type":"verb","us_sound":"kənˈskrɪpt","us_link":"../audio/c/conscript_01_00.mp3","uk_sound":"kənˈskrɪpt","uk_link":"../audio/c/ukconsc009.mp3","content":"Add to word list\nAdd to word list\nto force someone to serve in an army or one of a country's armed forces: He was conscripted into the army at the age of 18.\nMore examplesFewer examplesUntil National Service came to an end in about 1960, some of those who refused to be conscripted were sent to prison.The boys I met there, some as young as 6, had been conscripted - kidnapped is the more accurate term - by a rebel army. Declining populations cause enormous problems for conscripting a healthy military.\nSMART Vocabulary: related words and phrases\nJoining or leaving the army\nanti-draft\nbuy\nbuy someone out\ncall\ncall someone up\ncommission\nconscription\ndemob\ndemobilization\ndesert\ndeserter\ndesertion\ndraft dodger\nenlist\nenlisted\njoin\njoin up\nre-enlist\nre-enlistment\nre-up\nSee more results »\nRelated word\nconscription\na person who has been forced to serve in an army or in one of a country's armed forces: Over half the army was composed of conscripts. Compare\nvolunteer noun\nMore examplesFewer examplesWe want professional soldiers, not unmotivated, resistant conscripts.About 40,000 regular troops, 65,000 paramilitary troops and 35,000 conscripts have been put on high alert to confront any emergency near the border.The regime was still plying the streets of the capital to round up young men as conscripts.\nSMART Vocabulary: related words and phrases\nSoldiers & people who fight in wars\nanti-guerrilla\nAnzac\nberserker\ncapability\ncavalryman\ncombat engineer\ncomrade\nconqueror\nex-serviceman\nex-servicewoman\nfoot soldier\nheadhunter\nrecruit\nscout\nskirmisher\nsoldier of fortune\nunsoldierly\nvassal\nveteran\nwar party\nSee more results »\nrelating to or consisting of people who are forced to serve in an army or in one of a country's armed forces: a conscript army\nMore examplesFewer examplesTheoretically, the alliance has millions of conscript troops at its disposal.In Vietnam, we had a conscript military.\nSMART Vocabulary: related words and phrases\nJoining or leaving the army\nanti-draft\nbuy\nbuy someone out\ncall\ncall someone up\ncommission\nconscription\ndemob\ndemobilization\ndesert\ndeserter\ndesertion\ndraft dodger\nenlist\nenlisted\njoin\njoin up\nre-enlist\nre-enlistment\nre-up\nSee more results »\nAdd to word list\nAdd to word list\nto force someone to work as a member of a group: Soldiers conscripted factory workers to build a wall around the city. conscription noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kənˈskrɪp·ʃən/\nHe emigrated from Germany in the 1850s to avoid conscription into the army.\nsomeone who is forced to work as a member of a group: We were volunteers, not conscripts."}