{"id":107192,"name":"consolidate","type":"verb","us_sound":"kənˈsɑː.lə.deɪt","us_link":"../audio/c/consolidate.mp3","uk_sound":"kənˈsɒl.ɪ.deɪt","uk_link":"../audio/c/ukconse020.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to become, or cause something to become, stronger, and more certain: The success of their major product consolidated the firm's position in the market. She hoped that marriage would consolidate their relationship. The party consolidated its hold on power during its term of office. The company has been expanding rapidly, and I feel it's now time to consolidate (= stop growing and make our present position stronger).\n[ I or T ] to combine several things, especially businesses, so that they become more effective, or to be combined in this way: The two firms consolidated to form a single company.\n[ T ]\n&#160; finance &amp; economics\n&#160; specialized to add amounts or sets of numbers together to form a single amount, statement, etc.: The companies help people who may need cash to consolidate debt, buy a home, or set up a new business. Online brokers let you consolidate your holdings with one firm.\nSMART Vocabulary: related words and phrases\nBecoming and making stronger\naggrandize\nboil up\nbolster\ncement\ncharacter-building\ndeepen\nhardening\ninvigoration\njell\npower (something) up\nreconcentrate\nreinforce\nreinforcement\nrestrengthen\nsharpen\nsolidification\nsolidify\nsoup\nsoup something up\nstiffen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming better\nAccounting\nRelated words\nconsolidation\nconsolidated\nAdd to word list\nAdd to word list\nto bring together or unite things that were separate: [ I ] Our offices had been spread among three buildings, and then we consolidated into one new high-rise.\nTo consolidate is also to make stronger by some action or event: [ T ] The governor consolidated his power, getting his allies into key state jobs. consolidated adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kənˈsɑl·əˌdeɪ·t̬ɪd/consolidation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kənˌsɑl·əˈdeɪ·ʃən/\nAdd to word list\nAdd to word list\n[ I or T ] to become or make something stronger or more successful: Net assets rose to £758 million, consolidating the company's position as a member of the FTSE 250 index. The company has been growing too rapidly and it is now time to stop the expansion and consolidate.\n[ I or T ] to join the different parts of something together, or to be joined: The business plan is based on consolidating a fragmented but growing market. There is still scope for European industries to consolidate.consolidate sth into/with sth Manufacturing has been consolidated into fewer plants worldwide. They considered consolidating all their small debts and taking out a new loan to cover them.\n[ T ]\n&#160; ACCOUNTING to show the financial results of a group of companies in one set of figures, rather than showing the results of each company separately: When a group of companies share some economic value, it may be necessary to consolidate group accounts in order to determine the profit and loss.\n[ T ]\n&#160; TRANSPORT to put items together in order to send or transport them: Your shipment will be consolidated with those of other customers and transported by container."}