{"id":107461,"name":"consultation","type":"noun","us_sound":"ˌkɑːn.sʌlˈteɪ.ʃən","us_link":"../audio/c/consultation.mp3","uk_sound":"ˌkɒn.sʌlˈteɪ.ʃən","uk_link":"../audio/c/ukconst013.mp3","content":"Add to word list\nAdd to word list\nC2 [ C ] a meeting to discuss something or to get advice: After consultations with our accountants, we've decided how to cut costs within the company. Compare\nawayday mainly UK\nconclave\nconference (MEETING)\ncongress (MEETING)\nconvention (MEETING)\nconvocation formal\nforum (MEETING)\nmeeting\nseminar\nsummit (MEETING)\nsymposium formal\nC2 [ U ] the process of discussing something with someone in order to get their advice or opinion about it: He made the decision in consultation with his parents and teachers.\nMore examplesFewer examplesThe policy change was presented to us as a fait accompli, without consultation or discussion.She spent hours in consultation with her lawyers.I chose the present in consultation with my friends.Has there been any consultation with the unions?\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nsurvey\nthe third degree idiom\ntrick question\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving advice\nAdd to word list\nAdd to word list\nthe act of exchanging information and opinions about something in order to reach a better understanding of it or to make a decision, or a meeting for this purpose: [ U ] We hope to work in consultation with Congress on how the law should be interpreted.\nA consultation is also a meeting with a doctor who is specially trained to give advice to you or other doctors about an illness or its treatment: [ C ] The consultation with the pathologist convinced me to have surgery right away.\nAdd to word list\nAdd to word list\n[ C ] a meeting to discuss something or to get advice: I'll call you to fix the details for a consultation. She overcame resistance to her products with innovative offers, including free consultations and a money-back guarantee.\n[ C or U ] a discussion with someone about something that you are planning, in order to get their opinion or advice: consultation with sb They adopted the rules this summer after months of consultation with their lawyers.consultation on sth The consultation on these options showed that Option 1 was widely rejected. consultation document/paper He has laid out his concerns in a consultation paper.consultation period/process The consultation period for the bill is just two weeks.in consultation with sb The director will make his decision in consultation with his advisors. See also\njoint consultation"}