{"id":107016,"name":"consent","type":"noun","us_sound":"kənˈsent","us_link":"../audio/c/consent.mp3","uk_sound":"kənˈsent","uk_link":"../audio/c/ukconsc018.mp3","content":"Add to word list\nAdd to word list\nC1 [ U ] permission or agreement: They can't publish your name without your consent. Patients must be informed of the risks of the surgery and give their informed consent. You can only come on the trip if you have your parents' written consent.\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\n[ U ]\n&#160; law\n&#160; specialized agreement to sexual activity, given by someone who is free to choose and able to choose (because of being old enough, being able to think or communicate clearly, etc.): Consent is defined in UK law. Consent cannot be given by a person who is underage, intoxicated or incapacitated by drugs or alcohol, or asleep or unconscious. You can withdraw consent at any time if you feel uncomfortable. See also\nthe age of consent\n[ C ]\n&#160; law\n&#160; specialized an act of giving agreement to something that is recognized by law, or the form this agreement is written on: In an adult adoption, both the adopting person and the adoptee must file written consents. The panel members recommended that patients be made to sign consents in order to obtain the drugs. by common consent mainly UK\nmost people agree: Her latest novel, by common consent, is her best yet.\nSee more\nMore examplesFewer examplesThe child's parents or guardians must give their consent before she has the operation.The agreement was terminated by mutual consent.The airline requires children travelling alone to have a notarized letter of consent from one or both parents.Her father's blessing represented a bestowal of consent upon her marriage.She gave her consent to the sale of the painting.The contract will contain provisions for the parties to obtain necessary consents from third parties.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLegal & illegal\nAllowing and permitting\nC2 to agree to do something, or to allow someone to do something: [ + to infinitive ] Very reluctantly, I've consented to lend her my car. My aunt never married because her father wouldn't consent to her marriage.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nAdd to word list\nAdd to word list\npermission or agreement obtained from someone or something having authority or power: I asked to leave the room, and the teacher gave his consent.\nto give permission: [ + to infinitive ] The director consented to change the ending of the movie.\nAdd to word list\nAdd to word list\nlegal or official permission to do something: The sale of any assets will require the consent of all the parties concerned.with/without (sb's) consent Your terms of employment cannot be changed without your consent.written/prior consent For certain types of business purchase, you may require the prior consent of an industry regulatorgive/grant consent to/for sth Clients must sign financial-disclosure forms giving consent for \"further verification\".seek/apply for/obtain (sb's) consent Frequently, for smaller contracts, builders do not formally obtain consent.\nagreement between two or more people or groups: by mutual consent In a statement, CSR said their chief executive was leaving by mutual consent.by common consent This was, by common consent, the worst recession for decades.\nto give official permission or agreement for something to happen: consent to sth Pressure is being put on shareholders to consent to the takeover."}