{"id":107196,"name":"consolidation","type":"noun","us_sound":"kənˌsɑː.ləˈdeɪ.ʃən","us_link":"../audio/c/consolidation.mp3","uk_sound":"kənˌsɒl.ɪˈdeɪ.ʃən","uk_link":"../audio/c/ukconse022.mp3","content":"consolidation noun [C or U]\n(BECOMING STRONGER)\nAdd to word list\nAdd to word list\nthe process of becoming or being made stronger and more certain: The company is entering a period of consolidation. Putin announced one of the most sweeping consolidations of presidential power since the fall of communism.\nSMART Vocabulary: related words and phrases\nBecoming and making stronger\naggrandize\nboil up\nbolster\ncement\ncharacter-building\ndeepen\nhardening\ninvigoration\njell\npower (something) up\nreconcentrate\nreinforce\nreinforcement\nrestrengthen\nsharpen\nsolidification\nsolidify\nsoup\nsoup something up\nstiffen\nSee more results »\nconsolidation noun [C or U]\n(JOINING)\nthe process in which businesses join together to make a single organization: We have seen a similar consolidation of booksellers and distributors. Many employees have been impacted by mergers and consolidations.\nfinance &amp; economics\n&#160; specialized the process in which amounts or sets of numbers are added together to form a single amount, statement, etc.: There is no objection in principle to the consolidation of bank accounts in order to obtain better terms of business from the bank. credit counseling firms that promise relief through the magic of debt consolidation\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontractual\ncontractually\ncoopetition\ncop\ncorporate image\nIPO\nlean\nleanly\nlock something in\nm-commerce\ntransact\nuberization\nultra-commercial\nunbranded\nuncommercialized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounting\nSee\nconsolidate\nAdd to word list\nAdd to word list\nthe situation in which two or more things, for example companies or organizations, are joined together: Greater market share can be achieved in the long term through industry consolidation. The takeovers came amid a wave of consolidation as the so-called Big Oil companies gobbled up competitors. We have recently seen a consolidation of booksellers and distributors.consolidation of sth and sth (into sth) the consolidation of the repair and service operations into one department The company can offer various options for the consolidation of your outstanding debts.\nthe process of becoming or of making something stronger or more successful: Efforts are being focused on the consolidation of their position as a major player in the telecoms market.\nACCOUNTING the process of combining the accounts of a group of companies in one set of figures: This report contains a consolidation of the group's accounts for the financial year 2011-2012.\nTRANSPORT the process of putting items together in order to send or transport them: Consolidation can significantly reduce the cost of moving smaller volumes of goods. See also\ndebt consolidation"}