{"id":107397,"name":"construction","type":"noun","us_sound":"kənˈstrʌk.ʃən","us_link":"../audio/c/construction.mp3","uk_sound":"kənˈstrʌk.ʃən","uk_link":"../audio/c/ukconst002.mp3","content":"construction noun\n(BUILDING)\nAdd to word list\nAdd to word list\nB2 [ U ] the work of building or making something, especially buildings, bridges, etc.: She works in construction/in the construction industry. The bridge is a marvellous work of engineering and construction. This website is currently under construction (= being created).\n[ U ] the particular type of structure, materials, etc. that something has: The bridge is of lightweight construction.\nB2 [ C ] a building: What's that concrete and metal construction over there? Synonyms\nbuilding\nedifice formal\nerection (BUILDING)\nstructure (BUILDING)\nMore examplesFewer examplesFalling house prices are illustrative of the crisis facing the construction industry.The starting date for the construction work is June 23.The construction of the tunnel is a large and complex undertaking.He called for checks to discover whether corrupt officials are being bribed to connive in shoddy construction.How are we going to pay for the construction work?\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nflip\nfound\nglazier\nreface\nrefurb\nrefurbish\nrefurbished\nrefurbishment\nthatcher\ntiler\nwell built\nworkman\nwright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFrames & structures\nBuildings in general\nconstruction noun\n(LANGUAGE)\nB2 [ C ]\n&#160; language\n&#160; specialized the way in which the words in a sentence or phrase are arranged: The writer has used several complex grammatical constructions.\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nput a construction on something formal\nto understand something in a particular way: How can they put such a damning construction on a perfectly innocent phrase?\nto understand something as having a particular meaning, especially other people's actions and statements: I don't want them to put the wrong construction on my actions.\nSee more\nAdd to word list\nAdd to word list\n[ U ] the act or result of putting different things together: A new hotel is now under construction (= being built).\n[ C ] fml your understanding of the meaning of something in a particular way: The construction you are putting on my client’s statement is unfair.\nAdd to word list\nAdd to word list\n[ U ] the process or business of building large objects such as buildings, roads, bridges, etc.: Employment in construction increased by 12,000.a construction site/project/worker 29-year-old Jose has a well-paid job at a downtown construction site.under construction In February, there were 15% fewer homes under construction than in the corresponding month of last year. a construction company/firm/group the construction industry/sector\n[ U ]\n&#160; PRODUCTION the activity of putting the different parts of something together in order to make it: The chemical is found in materials used in the construction of travel trailers.under construction They now have four satellites under construction. the construction of an investment portfolio\n[ U ] the particular type of structure, materials, etc. that something has: The bridge is of lightweight construction.\n[ C ] a building or other object that has been built: The new office building was a glass and steel construction."}