{"id":107072,"name":"conservator","type":"noun","us_sound":"kənˈsɜ˞ː.və.t̬ɚ","us_link":"../audio/c/cdo0123uscons0552.mp3","uk_sound":"kənˈsɜː.və.tər","uk_link":"../audio/c/cdo0123ukcons0769.mp3","content":"conservator noun [C]\n(OF ART OR BUILDINGS)\nAdd to word list\nAdd to word list\na person or organization whose job is to keep works of art, important buildings, or valuable cultural objects in good condition: Laura Zuckerman is a conservator of sculpture at the Museum of Modern Art. No longer just conservators of culture, museums today are expected to reach new audiences.\nMore examplesFewer examplesHelena is a rare-book conservator.A workshop was presented by a conservator from the famed Winterthur Museum.At the Museo Stradivariano we met Andrea Mosconi, conservator of the city's violin collection.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nenvironmental health\nmuzzle\nprecaution\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nself-defence\nsentry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPainting, drawing & printing\nArchaeology\nconservator noun [C]\n(OF PERSON OR ORGANIZATION)\nlaw\n&#160; US specialized a person or an organization that has been legally chosen to control the finances or property of another person, company, or organization: A judge appointed a professional conservator to look after the young man's interests. Top executives are being replaced and the companies will be put under the supervision of conservators.\nMore examplesFewer examplesThe mother and sister say that the law leaves mentally disabled people at the mercy of conservators.The bill would allow unmarried partners to make medical treatment decisions for one another and to act as a conservator for their partner.The two companies will now be overseen by a conservator, the Federal Housing Finance Agency.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nenvironmental health\nmuzzle\nprecaution\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nself-defence\nsentry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nPeople in charge of or controlling other people\nAdd to word list\nAdd to word list\na person who is chosen by a law court to look after the property of a person who is not able to do this for him- or herself, for example, because of illness: The conservator is given the authority to make financial decisions and handle your financial affairs, when you lack the capacity to manage them on your own. appoint a conservator conservatorship noun [ C or U ]\nI need to set up a conservatorship to use my mother's assets to pay for her nursing care."}