{"id":107088,"name":"consider","type":"verb","us_sound":"kənˈsɪd.ɚ","us_link":"../audio/c/consider.mp3","uk_sound":"kənˈsɪd.ər","uk_link":"../audio/c/ukconse002.mp3","content":"consider verb\n(POSSIBILITY)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to spend time thinking about a possibility or making a decision: Don't make any decisions before you've considered the situation. [ + question word ] Have you considered what you'll do if you don't get the job? [ + -ing verb ] We're considering selling the house. She's being considered for the job. I'd like some time to consider before I make a decision.\nThesaurus: synonyms, antonyms, and examples\nto think carefully about somethingconsiderDon't make any decisions before you've considered the matter.contemplateHe lay in a hospital bed contemplating his future.ponderShe sat back for a minute to ponder her next move in the game.mull overI need a few days to mull things over before I decide.reflectI spent a lot of time reflecting on what he'd said.agonizeShe agonized for days before agreeing to take the job.\nSee more results »\nMore examplesFewer examplesWould you consider fostering a child?The council is considering banning vehicles from the town centre to relieve congestion.\"Have you decided what to do?\" \"No, I'm still considering the various possibilities.\"I considered applying to university, but I eventually decided to go to the local poly.Have you ever considered a career in the police force?\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nlet me see/let's see idiom\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nconsider verb\n(SUBJECT/FACT)\nC1 [ T ] to give attention to a particular subject or fact when judging something else: You've got to consider the time element when planning the whole project. [ + question word ] If you consider how long he's been learning the piano, he's not very good.\nMore examplesFewer examplesLet us consider the events of the last five months.We need to consider this very serious issue in its totality.We were going to paint the house ourselves, but when we considered the cost in time and effort, we decided to get a painter to do it for us.He gave a slight shudder as he considered how near he had come to death.He saw the theatre as a way of forcing people to consider social and political issues.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nconsider verb\n(CARE ABOUT)\nC2 [ T ] to care about or respect other people or their feelings and wishes: Did you consider your mother and how she's going to feel about you leaving? She never considers anyone but herself - she's totally selfish!\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nhave/keep your ear to the ground idiom\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsee past something\nsit\nzero\nZoom\nSee more results »\nconsider verb\n(OPINION)\nB2 [ T often + obj + (to be) + noun/adj ] to believe someone or something to be, or think of him, her, or it as something: He is currently considered (to be) the best British athlete. We don't consider her to be right for the job. [ passive + obj + to infinitive ] It is considered bad manners in some cultures to speak with your mouth full of food. I consider myself lucky that I only hurt my arm in the accident. Do you consider him a friend of yours? [ + (that) ] She considers (that) she has done enough to help already. be highly/well considered\nto be very much admired: I don't like her books, but I know she's very highly considered.\nSee more\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\ndeem\ndelusional\ndraw\nfall\nguess\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npluck\npresumptively\npresuppose\nsupposably\nsurmise\nthink of something\nSee more results »\nGrammar\nConsider or regard?Consider and regard can both mean ‘believe’ or ‘realise’ or ‘understand’. When they mean ‘believe’ or ‘realise’ or ‘understand’, we don’t often use the continuous forms. …\nIdiom\nconsider it done\nconsider verb [T]\n(THINK ABOUT)\nAdd to word list\nAdd to word list\nto think about a particular subject or thing or about doing something or about whether to do something: Consider Clara Barton, who founded the American Red Cross. We considered moving to California, but decided not to. [ + question word ] We have to consider what to do next.\nconsider verb [T]\n(CARE ABOUT)\nto care about or respect: Before raising the admission prices, consider the fans.\nconsider verb [T]\n(HAVE AN OPINION)\nto believe to be; to think of as: What some people would consider a personal attack, Andy considers a friendly discussion."}