{"id":107065,"name":"conservative","type":"adjective","us_sound":"kənˈsɝː.və.t̬ɪv","us_link":"../audio/c/conservative.mp3","uk_sound":"kənˈsɜː.və.tɪv","uk_link":"../audio/c/ukconsc026.mp3","content":"conservative adjective\n(AGAINST CHANGE)\nAdd to word list\nAdd to word list\nC1 not usually liking or trusting change, especially sudden change: a conservative society/outlook Older people tend to be more conservative and a bit suspicious of anything new. Compare\nliberal adjective (SOCIETY)\nIf you are conservative in your appearance, you usually do not like fashionable or modern clothes or hairstyles: He's a very conservative dresser - he always looks like he's wearing his father's clothes!\nMore examplesFewer examplesHe has a very conservative approach to management.She's very conservative in her eating habits.When it comes to music, my tastes are quite conservative.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionally\ncounter-tradition\ncrowd\ncustom\ndemi-monde\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nconservative adjective\n(LOW)\nA conservative guess or calculation is likely to be less than the real amount: If I said there were three million unemployed, that would be a conservative estimate.\nSMART Vocabulary: related words and phrases\nCautious and vigilant\nabundance\nan abundance of caution idiom\naskance\nattentive\nattentively\ndiligent\ndiscreet\ndue diligence\ngingerly\nguarded\nmindful\nminutely\nnarrowly\nonce\nonce bitten, twice shy idiom\nsemi-conservative\nslowly\nsnuffly\nsuper-cautious\nsuper-conservative\nSee more results »\nRelated word\nconservatively\nbelonging to or supporting the British political party that traditionally supports business and opposes high taxes and government involvement in industry: the Conservative Party Conservative policies a Conservative MP/government Did you vote Conservative at the last election?\nMore examplesFewer examplesHe was a Conservative minister in the Thatcher government.She always votes Conservative.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterpellate\ninterpellation\ninterventionist\nlab\nlaissez-faire\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nRelated word\nConservatism\nsomeone who belongs to or supports the Conservative Party of Great Britain (= a political party that traditionally supports business and opposes high taxes and government involvement in industry), or a similar party in another country: She's a staunch (= very loyal) Conservative. The Conservatives won an overall majority of ninety.\nMore examplesFewer examplesThe scheme is opposed by the Conservatives who have pledged to abolish it.Some prominent Conservatives have said they won't vote for him.He has been a Conservative all his life.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterpellate\ninterpellation\ninterventionist\nlab\nlaissez-faire\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nconservative adjective\n(SOCIAL)\nAdd to word list\nAdd to word list\ntending to emphasize the importance of preserving traditional cultural and religious values, and to oppose change, esp. sudden change\nIf you are conservative in your appearance, you wear clothes in traditional colors and styles: He wore a conservative business suit for his interview. conservatively adverb us\nYour browser doesn't support HTML5 audio\n/kənˈsɜr·və·t̬ɪv·li/\nShe was conservatively dressed in a gray suit.\nconservative adjective\n(POLITICAL)\npolitics &amp; government tending to emphasize the importance of personal responsibility and traditional values and to oppose depending on government for social services: conservative Republicans conservative noun [ C ] us\nYour browser doesn't support HTML5 audio\n/kənˈsɜr·və·t̬ɪv/\nThe Congressional committee had an equal number of conservatives and liberals.\nconservative adjective\n(LOW)\n(of guesses and calculations) likely to be less than the real amount: Even by conservative estimates, the company will lose $2,000,000 this year.\nAdd to word list\nAdd to word list\nnot involving or taking unnecessary risks: The firm has always had a conservative approach to investment.\nlower than the real figure or amount seems likely to be: a conservative estimate/figure"}