{"id":107457,"name":"consultant","type":"noun","us_sound":"kənˈsʌl.tənt","us_link":"../audio/c/consultant.mp3","uk_sound":"kənˈsʌl.tənt","uk_link":"../audio/c/ukconst012.mp3","content":"Add to word list\nAdd to word list\nB2 someone who advises people on a particular subject: a management/financial/computer consultant a firm of public relations consultants\nUK a hospital doctor at the highest level with special training in and knowledge of a particular area of medicine: She is an ear, nose, and throat consultant at a large teaching hospital. He was on a waiting list to see a consultant about his back. a consultant psychiatrist/paediatrician/obstetrician a consultant dermatologist/gynaecologist/cardiologist Synonym\nspecialistCompare\nhouse officer\njunior doctor\nregistrar\nMore examplesFewer examplesWe ought to hire a public relations consultant to help improve our image.Eventually they found a consultant they felt they could do business with .She set up in business as a management consultant.She is a feng shui consultant.His doctor gave him a referral to the consultant.\nSMART Vocabulary: related words and phrases\nExperts and specialists\nacademician\nartist\nauthority\nboffin\nchild prodigy\ndoyenne\nhotshot\nknow something inside out idiom\nlapidary\nLatin Americanist\nliterati\npunditocracy\npyrotechnician\nRenaissance man\nsavant\nsemiotician\nwhizz-kid\nwizard\nwonder\nwunderkind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving advice\nMedical treatment: doctors & health workers generally\nAdd to word list\nAdd to word list\na person who is a specialist in a particular subject and whose job is to give advice and information to businesses, government organizations, etc.: The former general now serves as a consultant to the Pentagon.\nAdd to word list\nAdd to word list\nsomeone who is paid to give expert advice or training on a particular subject: a business/financial/IT, etc. consultant In her role as a business consultant she travels all over the country. Now 58, he works as a consultant for a number of clients in the banking sector. The company has hired a consultant to carry out the study. See also\nfinancial consultant\nmanagement consultant"}