{"id":107063,"name":"conservatism","type":"noun","us_sound":"kənˈsɝː.və.tɪ.zəm","us_link":"../audio/c/usconne013.mp3","uk_sound":"kənˈsɜː.və.tɪ.zəm","uk_link":"../audio/c/ukconsc025.mp3","content":"Add to word list\nAdd to word list\nthe quality of not usually liking or trusting change, especially sudden change\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionally\ncounter-tradition\ncrowd\ncustom\ndemi-monde\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nthe policies and beliefs of the Conservative party (= the British political party that traditionally supports business and opposes high taxes and government involvement) : The politics of the newspaper reflect traditional Conservatism. The Tories were out to show that they had shed pre-war Conservatism. See\nConservative\nMore examplesFewer examplesThe Liberal candidate said that Conservatism had \"departed once and for all\" from County Durham.British Conservatism was reinvigorated by this echo of former military power.There was a spectacular slide in support for Conservatism in Scotland.Some of the advisers brought into government by Mrs Thatcher disliked the old-style Conservatism.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterpellate\ninterpellation\ninterventionist\nlab\nlaissez-faire\nOrwellian\noverstep\nparliament\nparty politics\npersonality cult\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nThatcherism\nSee more results »\nAdd to word list\nAdd to word list\na tendency to preserve traditional values and oppose change, esp. in politics\nAdd to word list\nAdd to word list\nthe fact of avoiding risks that are unnecessary: Banks are no longer thought of as paragons of financial conservatism. Republican candidates have tried to highlight their fiscal conservatism.\nACCOUNTING a principle of accounting in which assets or profits are not shown in accounts as greater than they may actually be, and financial losses are not made to seem smaller than they are: If a situation arises in which there are two acceptable alternatives for reporting an item, conservatism directs the accountant to choose the alternative that will result in less net income. See also\nprudence"}