{"id":108109,"name":"controversy","type":"noun","us_sound":"ˈkɑːn.trə.vɝː.si","us_link":"../audio/c/controversy.mp3","uk_sound":"ˈkɒn.trə.vɜː.si","uk_link":"../audio/c/ukcontr025.mp3","content":"Add to word list\nAdd to word list\nC1 a lot of disagreement or argument about something, usually because it affects or is important to many people: controversy surrounding/over There was a big controversy surrounding/over the use of drugs in athletics.fierce/heated controversy The policy has caused fierce/heated controversy ever since it was introduced.\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nMore examplesFewer examplesWhere do you put the emphasis in the word 'controversy'?Her latest book has engendered a lot of controversy.The mayor and the city council are anxious to avoid getting entangled in the controversy.Reports in today's newspapers have added fuel to the controversy .Overhanging the controversy is the question of how much the government knew about the arms deal.The government proposal to test 14-year-olds has been causing controversy in the staffroom .\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\nrhubarb\nspat\nsquabble\nSee more results »\nAdd to word list\nAdd to word list\na disagreement, often a public one, that involves different ideas or opinions about something: [ C ] Publication of the article unleashed a scientific controversy that raged for years. [ U ] The president’s decisions stirred up a lot controversy."}