{"id":107545,"name":"contain","type":"verb","us_sound":"kənˈteɪn","us_link":"../audio/c/contain.mp3","uk_sound":"kənˈteɪn","uk_link":"../audio/c/ukconta001.mp3","content":"contain verb\n(HOLD)\nAdd to word list\nAdd to word list\nB1 [ T not continuous ] to have something inside or include something as a part: How much liquid do you think this bottle contains? I lost a file containing a lot of important documents. Try to avoid foods which contain a lot of fat. The allegations contained in this report are very serious.\nMore examplesFewer examplesRaw vegetables contain more potassium than cooked ones.These biscuits contain oats.The cupboard contained all kinds of strange things.The following programme contains scenes that may be disturbing to some viewers.The letter contains a number of typing errors.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDIB\nembody\nembracingly\nencompass\nenshrine\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\npepper\nplug\nSee more results »\ncontain verb\n(CONTROL)\n[ T not continuous ] to keep something harmful within limits and not allow it to spread: Farms in the area have been closed off in an attempt to contain the disease. More police were sent to help contain the violence.\nC2 [ T often in negatives ] to control or hide a strong emotion, such as excitement or anger: She could no longer contain her anger and started yelling at him.humorous Contain yourself! It's not that exciting.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncrowd\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling emotions\ncontain verb [T]\n(HAVE INSIDE)\nAdd to word list\nAdd to word list\n(of an object or area) to have an amount of something inside or within it: How much liquid does this bottle contain? Each large crate contains 12 boxes.\ncontain verb [T]\n(INCLUDE)\nto have as a part, or be equal to; include: The information contained on forms would be kept strictly confidential. Each food serving contains 95 calories. You could retrieve all files that contained certain key words.\ncontain verb [T]\n(CONTROL)\nto keep within limits; not to allow to spread: Medical teams were scrambling to contain the illness that has already killed thousands in Latin America."}