{"id":108097,"name":"controlled","type":"adjective","us_sound":"kənˈtroʊld","us_link":"../audio/c/cdo0622uscont0428.mp3","uk_sound":"kənˈtrəʊld","uk_link":"../audio/c/cdo0622ukcont0580.mp3","content":"controlled adjective\n(TAKING CARE)\nAdd to word list\nAdd to word list\ninvolving careful, intentional actions that limit risk or danger: controlled explosion Police carried out a controlled explosion on a suspicious vehicle.controlled environment She allows her children to use messaging apps that give a more controlled environment, allowing her to block messages from strangers. Access to the information is very controlled. Compare\nnon-controlled\nuncontrolled\nnot allowing your emotions to be strongly expressed or to influence your behaviour: He says he is a far more controlled and thoughtful person than he was when he was younger. She seems very controlled, but those who know her well say she is impulsive, warm and funny.\nMore examplesFewer examplesThe buildings were brought down in a controlled demolition.When diabetes is not controlled, patients present with eye and kidney problems and serious infections.The project will use controlled burns and logging to clear overgrown areas.Parking in the area was not controlled, and free access into the area was allowed. These lasers can deliver a much more controlled beam of light to small areas of the affected skin.She needs to be around nicer, kinder, more controlled people than the ones she knew growing up.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncrowd\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelf-control and moderation\ncontrolled adjective\n(OF DRUG)\nA controlled substance has its use or sale tightly controlled by law because it is considered to be dangerous or to cause addiction (= an inability to stop using it). : controlled substance He pleaded guilty to possession of controlled substances.controlled drug It is a controlled drug approved for short-term use to treat insomnia. Compare\nnon-controlled\nMore examplesFewer examplesMedications can be divided into two categories: controlled and non-controlled.Many pharmacies have stopped selling some legal controlled medicines like narcotic painkillers.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncrowd\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\ncontrolled adjective\n(OF EXPERIMENT)\nscience\n&#160; specialized A controlled study or test uses a control (= an object or system that is not changed so that you can compare it with similar objects or systems that are intentionally changed): controlled trial Many other factors could account for these results, because these were not randomized controlled trials.controlled experiment/study We conducted a controlled experiment/study to assess the effectiveness of the method. Opposite\nnon-controlled\nMore examplesFewer examplesFew controlled experiments have been conducted on ageing and cognitive health.They began a randomized controlled study into the effects of oestrogen on the heart.The controlled, double-blind study was funded by a £400,000 grant from the government.These early studies were not controlled and were criticized for selection bias.\nSMART Vocabulary: related words and phrases\nMedical studies & the people who study them\nanatomist\naudiologist\naudiology\nbacteriologist\nbariatrics\ncardiologist\nmannikin\nmidwife\nneurologist\noncological\noncologist\noptometry\noral surgeon\northopaedics\northoptics\nuncontrolled\nurology\nvirologist\nvirology\nvivisectionist\nSee more results »\npast simple and past participle of\ncontrol"}