{"id":107878,"name":"contractor","type":"noun","us_sound":"ˈkɑːn.træk.tɚ","us_link":"../audio/c/contractor.mp3","uk_sound":"kənˈtræk.tər","uk_link":"../audio/c/ukconti017.mp3","content":"Add to word list\nAdd to word list\na person or company that signs a contract to supply materials or workers to perform a service or a job: He is a building contractor who was working on hurricane repair in Florida. They are one of the nation's largest airport security contractors. Set designers work with contractors to build an entire new set for each episode.\nsomeone who works or provides a service for a company for a limited period of time, but is not an employee: Average hourly rates for IT contractors working in the financial services sector rose. They hire contractors to perform data entry and customer service tasks. Synonym\ncontract worker\nMore examplesFewer examplesHis father is a heating and plumbing contractor.The contractors hired to build the dam took eight years to complete it.The union represents contractors who bill by the hour as well as those who bill by the job.The company admitted that 35 employees and contractors died on company business last year.The tax authorities ruled that the workers were employees, not independent contractors.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmployees & colleagues\nAdd to word list\nAdd to word list\na person or company that arranges to supply materials or workers, esp. for building\nAdd to word list\nAdd to word list\na person or company that is paid by another company to work on a particular project for a particular amount of money: Working 24/7 is something IT contractors grow used to if they want to compete. See also\napproved contractor\nbuilding contractor\ngeneral contractor\nindependent contractor\nprime contractor"}