{"id":107523,"name":"contact","type":"noun","us_sound":"ˈkɑːn.tækt","us_link":"../audio/c/contact.mp3","uk_sound":"ˈkɒn.tækt","uk_link":"../audio/c/ukconst027.mp3","content":"contact noun\n(COMMUNICATION)\nAdd to word list\nAdd to word list\nB1 [ U ] communication with someone, especially by speaking or writing to them regularly: \"Have you been in contact with Andrew recently?\" \"Only by phone.\" I'm still in contact with her - we write a couple of times a year. There isn't enough contact between teachers and parents. I've been busy at home and have hardly had any contact with the outside world. I'd hate to lose contact with my college friends. She finally made contact with him in Italy. Air traffic control lost radio contact with the pilot of the plane ten minutes before the accident. The school needs a contact number (= phone number, especially for emergencies) for parents during school hours.\nMore examplesFewer examplesIt concerns me that he hasn't been in contact.She has denied her family and refuses to have any contact with them.One of the minus points of working at home is not having social contact with colleagues.For a few tense minutes, the astronauts lost radio contact with mission control.After a few months' contact the monkeys become very tame.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\napproach\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\ncontact noun\n(TOUCH)\nC1 [ U ] the fact of two people or things touching each other: Don't let that glue come into contact with your skin. Have you been in contact with (= touched or been very near) anyone with the disease? He hates physical contact of any kind - he doesn't even like to shake your hand.\nMore examplesFewer examplesMany tribes became extinct when they came into contact with Western illnesses.He's very shy and never makes eye contact.It's possible to pass on the virus to others through physical contact.The AIDS virus is spread through contact with blood and other body fluids.Don't let the cloth come into contact with anything greasy.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\ncontact noun\n(PERSON)\nA2 [ C ] a person, especially someone in a high position, who can give you useful information or introductions that will help you at work or socially: I don't really know how she got the job, but I think her mother has contacts. He gave me the name of one of his contacts in a design firm, who offered me a job. We're building up (= increasing the number of) our contacts in the business.\n[ C ] the people whose names, telephone numbers, addresses, etc. you keep, for example stored on your mobile phone: How do you add a new contact? contacts [ U ]\nthe place on your mobile phone or computer where you store people's names, telephone numbers, addresses, etc.: Click the icon to go to contacts.\nSee more\nMore examplesFewer examplesDo you have any contacts in journalism?I have a contact within the Conservative government.He is a useful contact for information on arms deals.I am trying to make contacts within the party.I don't have any local contacts.\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\nabettor\naccessory\naccomplice\nacolyte\naide\nally\nbackup\nbuddy\ncollaborator\nconfederate\nden mother\nenabler\nlifesaver\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nsponsor\nstrength\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScience of psychology & psychoanalysis\ncontact noun\n(ELECTRICITY)\n[ C ] a part in a circuit that makes the circuit complete when it touches another part\nSMART Vocabulary: related words and phrases\nElectrical components & circuitry\nAGM battery\nanode\narmature\nbandpass filter\nbaseband chip\ncathode\ncathode ray\ncircuit breaker\ncoil\nconductor\nLED display\nmulticelled\nmulticonductor\nnumber pad\nphotoresist\nphotovoltaic cell\npotentiometer\nprinted circuit (board)\nrelay\ntransformer\nSee more results »\ncontact noun\n(FOR EYES)\n[ C ] (also contact lens) a small round curved piece of transparent plastic, worn on the surface of the eye to improve your sight\nTetra Images/GettyImages\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »\ncontact noun\n(PHOTOGRAPH)\n[ C ] (also contact print) a photograph produced by allowing light to pass through the film onto paper that is pressed tightly to it\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\ncontact verb\n(COMMUNICATE)\nA2 [ T ] to communicate with someone by calling or sending them a letter, email, etc.: I tried to contact him at his office, but he wasn't in. You can contact me on (US also at) (= speak to me using the phone) 388 9146. Unless the money is paid, we will be contacting our legal department.\nMore examplesFewer examplesYou can contact us by email or fax.For more information about the job, please contact the personnel manager.Discussion forums are a way of contacting people with similar interests from all over the world.Should you ever need anything, please don't hesitate to contact me.I've been trying to contact you all day.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\napproach\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\ncontact verb\n(TOUCH)\n[ I or T ] to touch something: If the solution accidentally contacts the skin, rinse the affected area thoroughly with water.\nMore examplesFewer examplesThe steam condenses to form liquid droplets when it contacts the comparatively cool food.If any hot surface is contacted, the potential for injury exists.He admitted raising his voice, but denied at any time physically contacting the officer.When these tentacles contact, an electrical charge of some sort passes across.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\nRelated word\ncontactable\ncontact noun\n(COMMUNICATION)\nAdd to word list\nAdd to word list\n[ U ] communication with someone, or with a group or organization: Have you kept in contact with your friends from college? The pilot was always in contact with an air traffic controller.\ncontact noun\n(TOUCH)\n[ U ] the touching of two objects or surfaces: Don’t let that glue come into contact with your skin.\ncontact noun\n(HELPFUL PERSON)\n[ C ] a person whom you know and who may be able to help you in a useful way, esp. by influencing other people or by sharing knowledge with you: He tried to use his contacts to get a better job in advertising.\n[ C ] A contact is also a person you meet: My face-to-face contacts outside of the office had been mostly hotel clerks, policemen, and waitresses.\ncontact verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑn·tækt/\nI tried to contact him at his office but he was out to lunch.\nAdd to word list\nAdd to word list\n[ U ] communication with someone, especially by speaking or writing to them regularly: be/get/keep in contact with sb We have been in contact with similar organizations in several countries.establish/make contact with sb Experience has taught me the best way to make a good first impression is to make contact with as many people in the organization as you can.contact between sb (and sb) The first contact between contracting parties will normally be the sending out of a price list or catalogue.contact details/information/number The HR department keeps the contact details of all members of staff.in close/direct/regular contact with sb 44% of his working time is spent in direct contact with clients. Under the new code, shareholders will have a senior non-executive director, aside from the chairman, who will act as their point of contact on the board.\n[ C ] a person, especially in a high position, who can give you useful information or introductions that will help you at work: good/useful/valuable contacts Conferences are good places to make useful contacts. He's got a contact in London who buys the goods off him. Sharing a meal with clients or colleagues can strengthen business contacts and improve career prospects. a network of contacts\nto communicate with someone by phoning them or sending them a letter, email, etc.: contact sb for sth The distributor should be contacted for further information on these requirements.contact sb at/on You can contact the manager directly on this number, or at his website address.\ncontactable adjective\nPlease ensure that you are contactable at all times while the deal is going through."}