{"id":108006,"name":"contrast","type":"noun","us_sound":"ˈkɑːn.træst","us_link":"../audio/c/contrast_01_00.mp3","uk_sound":"ˈkɒn.trɑːst","uk_link":"../audio/c/ukcontr005.mp3","content":"Add to word list\nAdd to word list\nB2 an obvious difference between two or more things: contrast of something with something I like the contrast of the white trousers with the black jacket.contrast to The antique furnishing provides an unusual contrast to the modernity of the building.marked contrast between There's a marked contrast between his character and hers.by/in contrast Their economy has expanded, while ours, by/in contrast, has declined.in stark/sharp contrast to The amount spent on defence is in stark/sharp (= in very noticeable) contrast to that spent on housing and health. I love his use of contrast (= strong differences between light and darkness) in his later photographs.\nThesaurus: synonyms, antonyms, and examples\na differencedifferenceWhat's the difference between the two cars?distinctionThere's a clear distinction between the two countries' cultures.contrastI like the contrast of those red shoes with your black suit.discrepancyThere is some discrepancy between the two accounts.chasmThere is a widening chasm between public health officials and popular opinion.gulfPeace talks attempted to bridge the gulf between the two warring nations.\nSee more results »\nMore examplesFewer examplesThere's a striking contrast between what he does and what he says he does.The mountains stood in sharp contrast to the blue sky.The president spoke with passion for an hour, in marked contrast to his subdued address to the parliament yesterday.I love the contrast between the sharpness of the lemon and the sweetness of the honey.Did you see the photos of her before and after her makeover? What a contrast!\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\ndistinction\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nGrammar\nContrastsThere are several common expressions for making contrasts in English. They include on the one hand … on the other hand, on the contrary, in comparison, by comparison, in contrast, by contrast. …\nC2 [ T ] to compare two people or things in order to show the differences between them: contrast something with something If you contrast some of her early writing with her later work, you can see just how much she improved.\nC2 [ I ] If one thing contrasts with another, it is very different from it: The styles of the two film makers contrast quite dramatically.contrast with The tartness of the lemons contrasts with the sweetness of the honey.\nMore examplesFewer examplesHer later sensual works contrast starkly with the harsh earlier paintings.The president's passionate speech contrasted strongly with his subdued address to the parliament yesterday.What he said contrasted strikingly with what he actually did.The designer chose bright curtains and cushions that contrast with the subdued wallpaper.The sharpness of the lemon contrasts deliciously with the sweetness of the sugar.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrastive\ncontrastively\nmeasure\nnext\nnonrelative\nperspective\nrelative\nrelatively\nshame\nstack\nstack up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing and appearing different\nAdd to word list\nAdd to word list\nan easily noticed or understood difference between two or more things: [ U ] She is quite petite, in contrast with her tall sister. [ C ] Contrasts between Manhattan’s rich and poor astonished him.\nart In art and photographs, contrast is the difference between dark and light colors or dark and light areas.\nto compare someone or something with another or others, or to show the differences between two or more things: [ T ] She contrasted Hamilton’s Federalist ideas with the Anti-Federalist views of Thomas Jefferson. [ I ] His aggressive style contrasts sharply with that of his low-key predecessor."}