{"id":108098,"name":"controller","type":"noun","us_sound":"kənˈtroʊ.lɚ","us_link":"../audio/c/controller.mp3","uk_sound":"kənˈtrəʊ.lər","uk_link":"../audio/c/ukcontr022.mp3","content":"Add to word list\nAdd to word list\na device used to operate or control a machine, a computer game, etc.: Moving my body made me feel more immersed in the game than if I had just been pressing buttons on a controller. The kids answer questions by touching a hand-held controller. The assisted braking controller is integrated into the dash.\na person who controls something, or someone who is responsible for what a particular organization does: an air-traffic controller That was the year he became Controller of Radio 4. Compare\ncomptroller formal\naccountant\nThesaurus: synonyms, antonyms, and examples\nan accountantaccountantMy accountant takes care of my taxes.bookkeeperWe hired a bookkeeper to take care of the business accounts.comptrollerThis needs to be run past the Chief Comptroller's Office.controllerShe became the corporate controller after working for years in the accountancy department.\nSee more results »\nMore examplesFewer examplesChildren as young as 3 interact with the videos via a push-button controller. The controller shakes to simulate an explosion.When he loses he throws the controller across the room.He was the controller of finances.I'm grateful to Bob, my pal and our controller.The manager's role shifts from controller to enabler.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncowl\ncowled\nguard\ninstrumentation\njet\nplunger\nregulator\nslide\nsplit pin\nstepney\nuniversal joint\nvee belt\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in charge of or controlling other people\nAdd to word list\nAdd to word list\na person in a business organization or government who is responsible for managing its finances: Perkins was promoted to corporate controller.\nAdd to word list\nAdd to word list\na senior manager who is responsible for preparing a company’s financial reports and making certain that the company’s accounts are regularly checked and correct: The controller must advise on potential acquisitions and business decisions made by the company."}