{"id":108055,"name":"contribute","type":"verb","us_sound":"kənˈtrɪb.juːt","us_link":"../audio/c/contribute.mp3","uk_sound":"kənˈtrɪb.juːt","uk_link":"../audio/c/ukcontr011.mp3","content":"Add to word list\nAdd to word list\nB2 to give something, especially money, in order to provide or achieve something together with other people: contribute towards Aren't you going to contribute towards Jack's leaving present? Come to the meeting if you feel you have something to contribute.contribute something to something Her family has contributed $50,000 to the fund.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nC1 to write articles for a newspaper, magazine, or book: contribute to She contributes to several magazines.\nMore examplesFewer examplesThe company publicly apologized and agreed to contribute some money to charity.It was a real team effort - everyone contributed something to the success of the project.Tourism contributes millions of pounds to the country's economy.Everyone in the office is contributing money for his leaving present.We have contributed all our working lives to pension schemes and national insurance, expecting a reasonable state pension on retirement.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nPhrasal verb\ncontribute to something\nAdd to word list\nAdd to word list\nto help by providing money or support, esp. when other people or conditions are also helping: [ I ] Tourism contributes substantially to the local economy.\nIf you contribute something you wrote or created, you allow it to be published or shown with pieces by other people: [ T ] She soon began to contribute articles to newspapers and magazines.\nAdd to word list\nAdd to word list\n[ I ] to be one of the reasons why something happens: contribute to/toward/towards sth Analysts agree that subprime loans contributed to the recession.\n[ I or T ] to add new plans or ideas, or help make improvements to something so that it becomes more valuable or successful: Employees are encouraged to contribute at staff meetings. There are a number of people who have contributed ideas.contribute to/toward/towards sth It's best when leaders are clear about how they can best contribute to the overall strategy.\n[ I or T ] to provide money or support to help another person, company, or organization to achieve its goal: contribute to/toward/towards sth At present, only 10% of employers contribute towards childcare costs.contribute sth to/toward/towards sth Over £75 million was contributed to the campaign."}