{"id":108065,"name":"contributor","type":"noun","us_sound":"kənˈtrɪb.jə.t̬ɚ","us_link":"../audio/c/eus70996.mp3","uk_sound":"kənˈtrɪb.jə.tər","uk_link":"../audio/c/ukcontr013.mp3","content":"Add to word list\nAdd to word list\na person who contributes something, especially money, in order to provide or achieve something together with other people: contributor to On the last page of the programme, there is a list of contributors to the theatre appeal.\nThesaurus: synonyms, antonyms, and examples\nsomeone who gives somethinggiverWomen are the primary gift givers in households.donorOne anonymous donor contributed $1 million.benefactorPip is told he has a mysterious benefactor and is going to be very well off.philanthropistThe philanthropist has given a large chunk of his fortune to good causes.sponsorLondon Fashion Week is funded by corporate sponsors.backerThey were lucky to find two wealthy backers.\nSee more results »\nsomeone who writes articles for a newspaper, magazine, or book\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nadvocate\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnon-member\nnon-membership\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who write for work or pleasure\nAdd to word list\nAdd to word list\na person who helps by giving money, or someone whose writing or art is published or shown with pieces by other people: a campaign contributor He became a regular contributor to The New Yorker.\nAdd to word list\nAdd to word list\none of the reasons why something happens: contributor to sth Good management has been a big contributor to the company's success. Aviation is considered to be the fastest growing contributor to global warming.\na person or company that pays money into a pension fund, medical insurance policy, etc.: The contributors and the pension fund trustees have been haggling over the details.\na person or company that gives money or support to help another person, company, or organization achieve its goal: contributor to sth He is one of Tennessee's biggest contributors to Republican causes."}