{"id":107854,"name":"contract","type":"noun","us_sound":"ˈkɑːn.trækt","us_link":"../audio/c/contract_01_00.mp3","uk_sound":"ˈkɒn.trækt","uk_link":"../audio/c/ukconti013.mp3","content":"Add to word list\nAdd to word list\nB1 a legal document that states and explains a formal agreement between two different people or groups, or the agreement itself: a contract of employment a temporary/building contractbreak (the terms of) a contract They could take legal action against you if you break (the terms of) the contract.draw up a contract My solicitor is drawing up (= writing) a contract.sign/enter into a contract Don't sign/enter into any contract before examining its conditions carefully. [ + to infinitive ] They're the firm of architects who won the contract to design the Museum of Fine Art extension.\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nbe under contract\nto have formally agreed to work for a company or person on a stated job for a stated period of time: They used independent miners who worked under contract with the mining companies.\nSee more\nMore examplesFewer examplesThe contract between the two companies will expire at the end of the year.They will only agree to sign the contract if certain conditions are met.I'm on a temporary contract and have little financial security .Under the terms of their contract, employees must give three months' notice if they leave.Her firm have just won a cleaning contract worth £3 million.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\ncontract verb\n(BECOME SMALLER)\n[ I or T ] to make or become shorter or narrower or generally smaller in size: contract to In spoken English, \"do not\" often contracts to \"don't\". As it cooled, the metal contracted.\n[ I ] to become smaller in amount or quantity: A recession is a period when the economy is contracting. Agricultural output has contracted by 2.3 percent.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\ncontract verb\n(BECOME ILL)\nC2 [ T ] formal to catch or become ill with a disease: He contracted malaria while he was travelling.\nSMART Vocabulary: related words and phrases\nBeing & falling ill\nacquire\nbe a martyr to something idiom\nbe green around the gills idiom\nbe hanging idiom\nbe laid up idiom\nbreak\nbring\nKO\nmartyr\nnot a hundred percent idiom\npick\npick someone/something up\npredisposed\npresent\nrelapse\nserious\nshiver\nsicken\nstrike\nsuccumb\nSee more results »\ncontract verb\n(AGREEMENT)\nC2 [ I or T ] to make a legal agreement with someone to do work or to have work done for you: [ + to infinitive ] Our company was contracted to build shelters for the homeless.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nPhrasal verbs\ncontract in/out\ncontract something out\ncontract noun [C]\n(AGREEMENT)\nAdd to word list\nAdd to word list\na legal document that states and explains a formal agreement between two different people or groups, or the agreement itself: She already has a contract for her next book with a publisher. contractual adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kənˈtræk·tʃu·əl/\nI have no other contractual obligations.\ncontract verb\n(SHORTEN)\n[ I/T ] to make or become shorter or narrower, or smaller: [ I ] When wet fibers dry, they contract.\ncontract verb\n(BECOME ILL)\n[ T ] to catch or become ill with a disease: She contracted pneumonia and was hospitalized.\ncontract verb [T]\n(AGREE)\nto arrange through a formal agreement to have a person or company produce something or supply workers or material, esp. for building : The company had been contracted to build shelters for the homeless.\nTo contract out a job is to formally arrange for other people to do it: [ M ] The university contracts out the cleaning to a private company.\nAdd to word list\nAdd to word list\nLAW a formal agreement between two people or companies, or a legal document that explains the details of this agreement: contract for sth The contract for the new drilling platform went to a Dutch company.contract to do sth He recently landed a contract to write a book about his expedition.contract with sb State agencies spent about $319 million on contracts with private vendors last year.contract between sb and sb It is a standard contract between a home seller and their agent. An independent contractor is legally responsible for job completion and, on quitting, becomes liable for breach of contract. draw up/write up a contract enter into/sign a contract be awarded/win/land a contract a long-term/short-term contract\nFINANCE, STOCK MARKET a formal agreement relating to buying or selling a stock, currency, commodity, etc. for a particular price at a particular time: An option differs from a futures contract, in which both parties make a binding agreement to buy or sell currency at some point in the future.\nbe under contract\nLAW to have made a formal agreement with another person or company, and be legally responsible for doing what you have agreed to do: We're under contract to complete the job by the end of the year.\nPROPERTY if a building or property is under contract, the owner has officially agreed to sell it to a particular person for a particular price: Two of the site's 8000 sq ft commercial lofts are currently under contract.\nput sth out to contract\nWORKPLACE if an organization, government, etc. puts something out to contract, they allow different companies to compete to provide a service or do a job for them: One way to make the process more efficient would be to put it out to contract. See also\naleatory contract\nannual hours contract\nbilateral contract\nevergreen contract\nexecuted contract\nexpress contract\nformal contract\nforward contract\nfrustration of contract\nfutures contract\nimplied contract\nlabor contract\nnaked contract\nonerous contract\noptions contract\noral contract\nperformance contract\npersonal contract\nrolling contract\nservice contract\nstandard-form contract\nturnkey contract\nunenforceable contract\nunilateral contract\nvoidable contract\nvoid contract\n[ I ]\n&#160; ECONOMICS if a market or economy contracts, less money is being earned, spent, or invested in it: contract by 3%/5%, etc. The country’s economy contracted by 2% in the first quarter.\n[ I or T ]\n&#160; LAW to make a legal agreement with another person or company, for example, to do work for them or to use their services: be contracted to do sth A local architecture firm was contracted to design and plan the new symphony hall.\nPhrasal verbs\ncontract in\ncontract out\ncontract sth out\nWORKPLACE contract workers are paid by companies or other organizations to work on a particular job, but are not employees of those companies, organizations, etc.: Many contract workers provide services once handled in-house by the military. New and growing businesses often initially hire contract labor to prevent overstaffing and runaway overheads. contract computing staff Compare\nfreelance adjective"}