{"id":107713,"name":"context","type":"noun","us_sound":"ˈkɑːn.tekst","us_link":"../audio/c/context.mp3","uk_sound":"ˈkɒn.tekst","uk_link":"../audio/c/ukconte007.mp3","content":"context noun [C]\n(CAUSE OF EVENT)\nAdd to word list\nAdd to word list\nB2 the situation within which something exists or happens, and that can help explain it: in context It is important to see all the fighting and bloodshed in his plays in historical context.in the context of This small battle is very important in the context of Scottish history.\nMore examplesFewer examplesTo understand this issue, it must first be situated in its context.The production is deliberately styleless, and this takes the play out of its historical context.What was the context you found the word in?He thinks smacking is OK in the context of a happy family.His remarks were very tasteless in the context of a memorial service.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRegarding and concerning\ncontext noun [C]\n(LANGUAGE)\nC1 the text or speech that comes immediately before and after a particular phrase or piece of text and helps to explain its meaning: In this exercise, a word is blanked out and you have to guess what it is by looking at the context. out of context\nIf words are used out of context, only a small separate part of what was originally said or written is reported, with the result that their meaning is not clear or is not understood: The reporter took my remarks completely out of context.\nSee more\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\ncontext noun [C]\n(RELATED EVENTS)\nAdd to word list\nAdd to word list\nthe influences and events related to a particular event or situation: a historical/literary context He is willing to look for solutions in the context of changes to the health-care system.\ncontext noun [C]\n(SURROUNDING WORDS)\nEnglish the text or speech that comes immediately before and after a particular phrase or piece of text and that influence how it is used and what it means contextual adjective us/kənˈteks·tʃu·əl, kɑn-/\nI can't take a word out of its contextual meaning. contextualize verb [ T ] us/kənˈteks·tʃu·əˌlɑɪz, kɑn-/\nThat information would help me to contextualize my kid’s performance."}