{"id":107828,"name":"contour","type":"noun","us_sound":"ˈkɑːn.tʊr","us_link":"../audio/c/contour.mp3","uk_sound":"ˈkɒn.tɔːr","uk_link":"../audio/c/ukconti009.mp3","content":"Add to word list\nAdd to word list\nthe shape of a mass of land or other object, especially its curved surface or the curved shape formed by its outer edge: the rugged contour of the coast He studied the contours of her face. Her latest collection of swimwear shows off the contours of the human body to perfection.\ngeography\n&#160; specialized (also contour line) a line on a map that joins points of equal height or depth, in a way that shows high and low areas of land: a 400 ft contour line This map has contours marked at 250-metre intervals.\nphleum/DigitalVision Vectors/GettyImages\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaps & map-making\n[ T ] to change the shape of a surface, making some parts higher and some parts lower: One option is to contour the bottom of the lake, making it deep in the middle and shallow at the edges. We used the leftover sand and soil from the excavations to contour the picnic grounds.\n[ I or T ] to closely follow or fit around the curved surface or shape of something, or to make something do this: Here the route forks left to contour around the hillside back to the ski village.contour something to something The ice pack does not freeze solid, making it easy to contour it to ankles and knees.\n[ I or T ] to use make-up to create darker and lighter areas on your face, that give the effect of changing or emphasizing its shape: I bought a new foundation stick to try contouring my face. This easy makeup tutorial shows you how to contour.\n[ T ]\n&#160; geography\n&#160; specialized to put lines on a map that join points of equal height or depth: Lack of available data for sediment thicknesses has prevented contouring the map.\nMore examplesFewer examplesSome people undergo surgical procedures to sculpt and contour the body. The flexibility of the pool cleaner head allows it to contour to the curvature of pool corners. I love watching pelicans fly a few feet above the surface, contouring the rises and falls of the sea.You can contour a block of text around an image.Her hair was softly shaped to contour her face.Step-by-step instructions show you how to contour your nose.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMake-up & skin care\nMaps & map-making\nAdd to word list\nAdd to word list\nthe shape of a mass of land or other object, esp. of its surface, or the shape formed by its outer edge: the distinctive contour of Florida’s coast"}