{"id":108102,"name":"controlling","type":"adjective","us_sound":"kənˈtroʊ.lɪŋ","us_link":"../audio/c/cbedus02007.mp3","uk_sound":"kənˈtrəʊ.lɪŋ","uk_link":"../audio/c/cbeduk02007.mp3","content":"controlling adjective\n(FINANCE)\nAdd to word list\nAdd to word list\n[ before noun ] A controlling stake, interest, etc. in a company is a share of the company that someone owns that is large enough to give them control of it: The company has effectively been nationalized, with the government holding a controlling stake. The company's CEO and controlling shareholder recently announced plans to retire. In 2017, it bought a controlling interest in the struggling newspaper. a controlling share/shareholding a controlling stockholder/stakeholder\nMore examplesFewer examplesShe retired last year after selling her controlling stake in the company.Mr Brown, a controlling stakeholder of the group, threatened to block the sale.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nnon-convertible\nrogue trader\nstockbroker\nthe Nikkei index\nSee more results »\ncontrolling adjective\n(BEHAVIOUR)\ndisapproving trying to control other people's behaviour or situations in a way that is unreasonable: I began to feel more confident and to go out more but my husband, who was very controlling, couldn't deal with it. Some people in the group had controlling parents who had put them on diets early in life. I believe the committee is too controlling about money.\nMore examplesFewer examplesHis jealous, controlling behaviour led her to leave him.She had a difficult relationship with her rigid, controlling mother.In an authoritarian style of parenting, parents are not affectionate and are very controlling. Some activists see the mayor as too controlling and secretive, conducting council business behind closed doors. She can be ruthless, manipulative, and controlling, according to press reports.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\ngovern\nguiding principle\nharness\npaternalistically\nperemptorily\nperemptory\nplay God idiom\nplenipotentiary\ntame\nwrangle\nwrangler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBad and wrong behaviour\npresent participle of\ncontrol\nAdd to word list\nAdd to word list\n→\ncontrolling shareholder"}