{"id":107661,"name":"content","type":"adjective","us_sound":"kənˈtent","us_link":"../audio/c/content_01_00.mp3","uk_sound":"kənˈtent","uk_link":"../audio/c/ukconta026.mp3","content":"Add to word list\nAdd to word list\nB2 pleased with your situation and not hoping for change or improvement: content with He seems fairly content with (his) life. [ + to infinitive ] They're content to socialize with a very small circle of people.\nMore examplesFewer examplesI was just content to see my daughter in such a stable relationship but a grandchild, that really was the icing on the cake.I'd be content with a modest income.He's quite content living on his own.I'm content to sit at the back.They were content with second hand clothes.\nSMART Vocabulary: related words and phrases\nSatisfied and complacent\nat one with the world idiom\nbe on to a good thing idiom\nbuoyant\ncomplacency\ncomplacent\ncomplacently\npride\nrest on your laurels idiom\nrewardingly\nsate\nsated\nself-content\nself-contented\nself-contentedly\nself-fulfilled\nself-fulfilment\nthis is the life! idiom\ntriumphalism\nundiscouraged\nvirtuously\nSee more results »\nRelated word\ncontentmentIdiom\nnot content with something/doing something\nto make someone feel happy and satisfied: You're quite easily contented, aren't you? My explanation seemed to content him.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightfully\ndistraction\ndiverting\ndivertingly\ndo someone the world of good idiom\nhomey\nindulgent\nindulgently\njovial\njovially\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\nPhrasal verb\ncontent yourself with something\ncontent noun [U]\n(HAPPINESS)\na happy and satisfied feeling: Once had he resolved what to do, there followed almost immediately a feeling of content. Synonym\ncontentmentSee also\nto your heart's content\nMore examplesFewer examplesIt was with great feelings of content that she ate her breakfast.I have used their product, and much to my content, I found the spices to be ground to exactly the right consistency.\nSMART Vocabulary: related words and phrases\nPleasure and happiness\nabandon\nafterglow\nbeatitude\nbed\nbed of roses idiom\ndelirium\nexaltation\nfeast\nfelicity\nfor fun phrase\nfulfilment\nfun\ngaiety\ngoody\njoyfulness\njoyousness\njubilation\nlike a dog with two tails idiom\nmirth\nsavour\nSee more results »\ncontent noun\n(INFORMATION)\ncontents [ plural ]\nB2 the articles or parts contained in a magazine or book, with the number of the page they begin on: table of contents Scroll down the table of (= list of) contents to find areas that interest you.\nSee more\nB2 [ S or U ] the ideas that are contained in a piece of writing, a speech, or a film: It's a very stylish and beautiful film, but it lacks content. We've discussed the unusual form of the book - now, what about the content?\n[ U ] information, images, video, etc. that are included as part of something such as a website: All this cool content is available to subscribers only. He used a work account to download and share inappropriate content. I follow her on social media because I love her content.\nMore examplesFewer examplesThe first item listed in the contents was \"Introduction\".It's plain reporting of the facts - there's not much editorial content.The content of her report is shrouded in secrecy.Newspapers carried the content of his speech.They get paid by the word to provide content for the blog.This is really good content.\nSMART Vocabulary: related words and phrases\nIdeas, concepts and theories\nabstract\nabstraction\nafterthought\nanthropocentrism\nanti-Darwinian\nfoundation stone\ngreat minds think alike idiom\nhave a brainstorm\nhave a brainwave\nhunch\nnon-empirical\nnon-material\nnon-practical\nnonconceptual\nnostrum\ntenet\ntheory\nthinking\ntrope\nuntheoretical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\ncontent noun\n(AMOUNT)\ncontents [ plural ]\nB1 everything that is contained within something: contents of The contents of his bag spilled all over the floor.\nSee more\nC2 [ S ] the amount of a particular substance contained in something: high fat content Chocolate has a high fat content.\nMore examplesFewer examplesA truck overturned, spilling its contents all over the road. Chemical analysis revealed a high content of copper.The cheaper food has a high water content.They have promised to reduce the salt content in their pizzas.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-grained\n-sized\namount\nbulk\nelement\nextent\nfootprint\ngood things come in small packages idiom\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquota\nration\nsmall-scale\nso much idiom\nstrength\nSee more results »\nGrammar\nContent or contents?Content and contents are nouns. …\nAdd to word list\nAdd to word list\npleased with your situation and not needing or desiring it to be better: Skating this year with a sprained ankle, he said he was content just to make the Olympic team. contented adjective us\nYour browser doesn't support HTML5 audio\n/kənˈten·tɪd/\nOur dog leads a happy and contented life. contentment noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kənˈtent·mənt/ (also content)\nHer greatest happiness and contentment was found in being a devoted wife, mother, and grandmother.\nto make yourself accept something as satisfactory, although it could be better: We had to content ourselves with watching the sea lions from the shore.\ncontent noun [U]\n(SUBJECT)\nthe subject or ideas contained in something written, said, created, or represented: academic/educational content It’s easy to update the content of the Web site.\nart Content is also the things represented or suggested in something written or created as art, or the ideas it communicates.\ncontent noun [U]\n(AMOUNT)\nthe amount of a particular substance contained in something: This type of milk has a lower fat content.\ncontents [ plural ]\nAdd to word list\nAdd to word list\neverything that is contained within something: A spokesman has refused to disclose the contents of the shipment. Her parents' home contents insurance policy covered her for the loss of the phone.\n[ U ] (also contents [ plural ]) the ideas that are contained in something: New guidelines cover the content of advertising for children. Our description of the contents of the report was completely accurate.\n[ U ] the information contained on a website, etc.: The next generation of DVDs will have to provide more content. If you want to make money from online advertising, you need content.\n[ U ]\n&#160; PRODUCTION the parts that are used to make a product: The company also produces paper with 30% recycled content. The trade agreement stipulated that a certain percentage of the content of the manufactured goods should be obtained locally.\n[ S ] the amount of a particular substance contained in something: The Supreme Court ruled that a beer's alcohol content can be noted on the label. This research dramatically illustrates that the food industry can produce food with much lower salt content. See also\nlocal content"}