{"id":108090,"name":"control","type":"verb","us_sound":"kənˈtroʊl","us_link":"../audio/c/control.mp3","uk_sound":"kənˈtrəʊl","uk_link":"../audio/c/ukcontr021.mp3","content":"Add to word list\nAdd to word list\nB1 to order, limit, or rule something, or someone's actions or behaviour: If you can't control your dog, put it on a lead! You're going to have to learn to control your temper. The temperature is controlled by a thermostat. The laws controlling drugs are very strict in this country. The government is trying to control spending.\nMore examplesFewer examplesPolice in riot gear arrived to control the protesters.The film was about an evil genius who wanted to control the world.Our new teacher's a bit of a joke - he can't even control the class.Firefighters took two hours to control the blaze.The finance committee controls the school's budget.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwhat someone says, goes idiom\nwrangle\nwrangler\nSee more results »\nIdiom\ncontrol the boardsPhrasal verb\ncontrol for something\ncontrol noun\n(POWER)\nB2 [ C or U ] the act of controlling something or someone, or the power to do this: control over She doesn't have any control over that child - it's embarrassing.impose controls on He wants the government to impose strict controls on dog ownership.take control of The dictator took control of the country in 1933.lose control of He felt he was losing control of events.in control of You need to stay in control of your emotions.go out of control The car skidded and went out of control, crashing into an oncoming truck.out of/beyond/outside someone’s control There was nothing we could do about it - the situation was out of/beyond/outside our control.crowd control She criticized the police's methods of crowd control. Synonyms\ncheck (LIMIT)\nconstraint\ncurb (CONTROL)\ncurtailment\nlimit\nlimitation\nrestraint\nrestriction under control\nB2 being dealt with or limited successfully: It seems that the disease is now under control.\nSee more\nMore examplesFewer examplesThe army took control of the city after the president's fall from power.We keep a tight control on the organization's finances.The terrorists assumed control of the plane and forced it to land in the desert.The car went out of control and plunged over the cliff.Troops yesterday seized control of the broadcasting station.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nyoke\nSee more results »\ncontrol noun\n(SWITCH)\nB2 [ C ] a switch or other device used to operate a machine such as a vehicle: control panel The main instruments are in the centre of the control panel.at the controls of Captain Firth sat at the controls of the aircraft.\n[ C usually singular ] (also control key); (written abbreviation Ctrl) a key on a computer keyboard that you press at the same time as other keys to make the keyboard operate in a particular way: Press and hold down the control key while you press 9. I pressed Control Alt Delete but nothing happened.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\ncontrol noun\n(IN AN EXPERIMENT)\n[ C ]\n&#160; science\n&#160; specialized in an experiment, an object or system that is not changed so that you can compare it with similar objects or systems that are intentionally changed\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\nstability\nstabilization\nstabilize\nstably\nstay\nunreformed\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nAdd to word list\nAdd to word list\nthe ability or power to decide or strongly influence the particular way in which something will happen or someone will behave, or the condition of having such ability or power: [ U ] The first few months he was running the company, Randy didn’t really feel in control. [ U ] The man lost control of his car and crashed into a tree. [ U ] The fire was out of control for nearly two hours before firefighters were able to get it under control.\nA control is a rule or law that sets a limit on something: [ C ] She argued for tightening controls on air pollution.\nto decide or strongly influence the particular way in which something will happen or someone will behave: It’s hard to control your temper when you’re two years old. The temperature is controlled by a thermostat.\nAdd to word list\nAdd to word list\nto be in charge of something or someone and have the power to make decisions relating to them: The Chicago-based holding company controls a global network of advertising and public relations agencies. Within five years the tech firm controlled 60% of the European market.\nFINANCE, STOCK MARKET to own the most shares in a company and be the main owner: Avis' employees control the company through an employee stock option program.\nFINANCE, STOCK MARKET to own a particular number of the shares in a company, and be one of its owners: She controls 7.5% of the company.control a stake in sth They currently control a 20% stake in the textile firm.\nto limit the amount by which something is allowed to change, develop, or increase: If the program is adopted, the supply and price of sugar will be controlled through subsidies and import quotas.\nto deal with a problem or situation successfully and stop it from becoming worse: control inflation/spending/debts Corporate spending was cut by 15% in an effort to control spiralling debts.\nto make a machine, system, process, etc. operate in the way you want it to: All of the building's lighting and heating systems are controlled automatically.\n[ U ] the power to give orders, make decisions, and take responsibility for something: take/keep/gain control of sth Banks threatened to take control of the business. Both parties are vying for control of the Senate.\n[ U ] the ability to make someone or something do what you want: control over sb/sth Critics claim he was an ineffective manager, with virtually no control over his staff.seize/take control of sth Malware can seize control of a computer and use it for financial scams.\n[ U ]\n&#160; FINANCE, STOCK MARKET a large number of shares owned by one person or group, which gives them power to control its management: The family plans to sell control of its publishing empire for $2.5 billion.\n[ C or U ] a limit on something, or the act of limiting something in order to stop it from becoming worse: control on sth If the independent operators corner the market there will be very little control on prices.strict/tight/tough controls Managers need to keep a tight control on costs.impose/introduce/tighten controls The government imposed controls that required vendors to sell some items below cost price.relax/remove/loosen control Controls were relaxed so that US manufacturers could participate more aggressively in the international market.\n[ C, usually plural ] a switch or a piece of equipment with switches on it, used for operating a machine or vehicle: The plant was updated with new control panels for its industrial machinery. Investigators are still trying to determine who was at the controls when the company jet crashed.\n[ C ]\n&#160; MARKETING →\ncontrol group\n[ U ]\n&#160; IT →\ncontrol key\nin control\ncontrolling something or having the power to control something: When negotiating a deal, it’s important that you remain calm and in control.be in control of sth She moved out of Sales and is now in control of the Marketing department.\nout of control\nif something is out of control, it cannot be dealt with successfully: be/get/spiral out of control One of their biggest priorities is to prevent costs from getting out of control.\nunder control\nif a situation is under control, it is being dealt with successfully and is unlikely to create any problems: bring/get/keep sth under control The Fed would likely raise rates gradually to keep inflation under control. See also\nbudgetary control\nchange control\ncommand and control\ncost control\ncredit control\nexchange controls\nimport controls\ninventory control\nmanagement control\nmarket control\nmaterials control\nproduction control\nquality control\nstock control"}