{"id":107792,"name":"continuous","type":"adjective","us_sound":"kənˈtɪn.ju.əs","us_link":"../audio/c/continuous.mp3","uk_sound":"kənˈtɪn.ju.əs","uk_link":"../audio/c/ukconti001.mp3","content":"continuous adjective\n(NOT STOPPING)\nAdd to word list\nAdd to word list\nB2 without a pause or interruption: She is in continuous pain. My computer makes a continuous low buzzing noise. A continuous whiteline (= line without spaces) in the middle of the road means no overtaking. Related word\ncontinuously\nMore examplesFewer examplesThe tape ran in a continuous loop, repeating the same songs over and over.Satellite technology offers the opportunity, as never before, for continuous television coverage of major international events.After a couple of days of continuous use, the costumes began to pong.The lighting makes a continuous whining sound.If you hear a continuous tone, leave the building.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nimmanence\nimmanent\nimmanently\nimperishable\nimperishably\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\npermanence\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\ncontinuous adjective\n(GRAMMAR)\nlanguage\n&#160; specialized The continuous form of a verb is used to show that the action is continuing. In English, it is formed with the verb \"be\" followed by a present participle (= the -ing form of a verb): Some verbs, such as \"love\", \"see\", or \"believe\", are not normally used in the continuous form. the past/present continuous tense Synonym\nprogressive\nMore examplesFewer examplesUse the present continuous form of the verb.Underline examples of the past perfect and past continuous forms.\"I look forward to hearing your response\" is the present simple tense with a gerund, not the present continuous tense.In the classroom a group of children learning English practise talking about the future using present continuous tenses: \"I'm going shopping tomorrow.\"\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ndangling participle\ngerund\ninfinitive\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npluperfect\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nthe continuous\nthe form of a verb that is used to show that the action is continuing. In English, it is formed with the verb \"be\" followed by a present participle (= the -ing form of a verb): When \"think\" means \"believe\" or \" have an opinion\", we do not usually use the continuous. the present/past continuous\nMore examplesFewer examplesHer students have already mastered the present simple, the present continuous, and the future conditional.They have to form yes/no questions using the past continuous, for example \"Was John sleeping when you arrived?\"\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ndangling participle\ngerund\ninfinitive\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npluperfect\npresent participle\nprogressive\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nAdd to word list\nAdd to word list\nwithout a pause or break: a continuous line of traffic continuously adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kənˈtɪn·ju·əs·li/\nHe spoke continuously for more than two hours."}