{"id":107870,"name":"contraction","type":"noun","us_sound":"kənˈtræk.ʃən","us_link":"../audio/c/contraction.mp3","uk_sound":"kənˈtræk.ʃən","uk_link":"../audio/c/ukconti016.mp3","content":"contraction noun [U]\n(REDUCTION)\nAdd to word list\nAdd to word list\nthe fact of something becoming smaller or shorter: Cold causes contraction of the metal. The contraction of this muscle raises the lower arm.\nthe fact of becoming less in amount or quantity: the contraction of economic output\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\nshave\ntelescope\ntumble\nSee more results »\ncontraction noun [U]\n(MUSCLE)\n[ C ] one of the very strong and usually painful movements of the muscles in the womb that help to push the baby out of the mother's body during the process of birth: have a contraction She was having regular strong contractions every four minutes.\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nnewborn\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\ncontraction noun [U]\n(WORD)\n[ C ] a short form of a word or combination of words that is often used instead of the full form in spoken English: \"Won't\" is a contraction of \"will not\".\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsuffix\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nGrammar\nApostrophe to show two words have been connected (contraction)We sometimes connect two words to make one shorter word. We use an apostrophe to show that we have left out one or more letters: …\nContractionsWe use contractions (I’m, we’re) in everyday speech and informal writing. Contractions, which are sometimes called ‘short forms’, commonly combine a pronoun or noun and a verb, or a verb and not, in a shorter form. Contractions are usually not appropriate in formal writing. …\nAdd to word list\nAdd to word list\na reduction in size or amount: [ C ] an economic contraction [ U ] Heat differences cause rapid expansion and contraction of the gas.\nA contraction is a shortening of a muscle intentionally, or a sudden, unexpected, and often painful shortening of a muscle: [ C ] voluntary/involuntary contractions [ U ] Contraction of the muscle raises your arm. [ C ] Researchers think olive oil may slow stomach contractions.\ngrammar A contraction is also a shortened form of a word or combination of words: [ C ] “Can’t” is a contraction of “cannot.”\nAdd to word list\nAdd to word list\na situation in which less money is being earned, spent, or invested in a market or economy: Michigan's economy experienced a contraction last year.(a) contraction in sth A sharp contraction in the labour market is predicted."}