{"id":107778,"name":"continue","type":"verb","us_sound":"kənˈtɪn.juː","us_link":"../audio/c/continue.mp3","uk_sound":"kənˈtɪn.juː","uk_link":"../audio/c/ukconte027.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to keep happening, existing, or doing something, or to cause something or someone to do this: [ + to infinitive ] It's said that as the boat went down the band continued to play. [ + -ing verb ] If she continues drinking like that, I'll have to carry her home.continue (with) Do you intend to continue (with) your studies? If the rain continues, we'll have to cancel tonight's plans.continue as Sally Palmer will be continuing as chairperson this autumn.continue on/be continued on The article continues/is continued on page ten.\nB1 [ I ] to start to do something again after a pause: continue on After stopping for a quick drink, they continued on their way. [ + -ing verb ] He paused for a moment to listen and then continued eating.continue by The president continued by saying that his country was a free country and would always remain so. [ + speech ] \"I don't like your weather!\" she shouted, \"and I don't,\" she continued, \"like your food!\"\nThesaurus: synonyms, antonyms, and examples\nto add a commentaddWould you like to add any further comments?go onHe went on to say that there was little point in intervening at such a late stage in the process.state furtherHe stated further that he felt honoured to be given such an exceptional opportunity.continue\"Let me give an example,\" he continued.\nSee more results »\nMore examplesFewer examplesThe repair work on the south-bound lane of the motorway will continue until June.Please resume your seats, as the performance will continue in two minutes.I'd like to continue this discussion but we're all out of time.Football's popularity continues to grow.The story continues over the page.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nin the making idiom\ninsist on doing something\nisochronous\njag\nleg\nprotraction\npush ahead\npush on\nrun on\nrun someone/something over\nspan\nspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStarting again\nAdd to word list\nAdd to word list\nto keep happening or to keep doing something without stopping: [ + to infinitive ] If it continues to rain, we may have to cancel the outdoor concert. [ + to infinitive ] I will continue to say what I believe. They continued hoping there would be additional survivors.\nYou can also continue to do something or continue doing something if you start to do it again after a pause: [ T ] After a break for lunch, they continued their discussions."}