{"id":107630,"name":"contemporary","type":"adjective","us_sound":"kənˈtem.pə.rer.i","us_link":"../audio/c/contemporary.mp3","uk_sound":"kənˈtem.pər.ər.i","uk_link":"../audio/c/ukconta017.mp3","content":"contemporary adjective\n(MODERN)\nAdd to word list\nAdd to word list\nB2 existing or happening now, and therefore seeming modern: contemporary music/literature/art/fashion Although the play was written hundreds of years ago, it still has a contemporary feel to it. I wanted to update my kitchen and put in something more contemporary.\nThesaurus: synonyms, antonyms, and examples\nmodernmodernThe building was made using modern construction techniques.up to dateThe hospital has some of the most up-to-date equipment in the country.latestShe always wears the latest fashions.cutting-edgeComputers have brought cutting-edge technology into the classroom.high-techDivers with high-tech equipment discovered the wreck of the ship.\nSee more results »\nMore examplesFewer examplesThe contemporary dance scene is flourishing in Britain at the moment.The band's sound is very contemporary.I thought the contemporary dialogue sounded a little out of place.She gave a series of lectures on contemporary British writers.Contemporary psychology tells us that a person's mental health is supported by having good social networks.\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncurrent\ncurrently\nday\neven\nimmediate\nin this day and age idiom\nmodern-day\nmoment\nnon-current\nright\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\ntopicality\nSee more results »\ncontemporary adjective\n(OF SAME PERIOD)\nbelonging to the same period, or to a stated period in the past: Almost all of the contemporary accounts of the event have been lost. Most of the writers he was contemporary with were interested in the same subjects.\nMore examplesFewer examplesThey are very similar artists, but they are not contemporary.Contemporary readers would have understood these political references very clearly.\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncut into something\ndateless\ndendrochronology\nretroaction\nretroactive\nretroactively\nretrospective\nretrospectively\nsynchronically\ntime loop\ntimeline\ntiming\ntwin\nSee more results »\nsomeone living during the same period as someone else: Was he a contemporary of Shakespeare's?\na person who is of the same age as you: She didn't mix with her contemporaries, preferring the company of older people.\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintance\nacquaintanceship\nacquainted\nacquainted with someone\namigo\ncompanion\ncomrade\ncrony\nfair-weather friend\nfam\nflatmate\nfriendless\nintimate\nneighbour\npal\npeeps\npeer group\npen pal\npenfriend\nSee more results »\ncontemporary adjective\n(EXISTING NOW)\nAdd to word list\nAdd to word list\nexisting or happening now: contemporary literature/music\ncontemporary adjective\n(OF THE SAME PERIOD)\nbelonging to the same or a stated period in the past: She’s been reading contemporary accounts of New York from the early 1900s.\ncontemporary noun [C]\n(PERSON OF THE SAME PERIOD)\nsomeone living during the same period as another: Franklin and Jefferson were contemporaries.\ncontemporary noun [C]\n(PERSON EXISTING NOW)\na person who is the same age as you: The language you use with your contemporaries may not be appropriate in the classroom.\nAdd to word list\nAdd to word list\nexisting or happening now: There is a need to remain responsive to the ever-changing challenges and opportunities of the contemporary business environment. While there is a small but steady market in traditional bespoke shoes, there are those who want something with more of a contemporary design."}