{"id":108354,"name":"converting","type":"verb","us_sound":"kənˈvɝːt","us_link":"../audio/c/convert_01_00.mp3","uk_sound":"kənˈvɜːt","uk_link":"../audio/c/ukconva028.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nconvert\nconvert verb\n(CHANGE)\nB2 [ I or T ] to (cause something or someone to) change in form or character: Could we convert the small bedroom into a second bathroom? What's the formula for converting pounds into kilograms?\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nC2 [ I or T ] to change to a new religion, belief, opinion, etc., or to make someone do this: He converted to (= started believing in) Catholicism when he got married. I used to hate exercise, but my sister has converted me (to it).\nMore examplesFewer examplesThose who attempted to convert the heathen were put to death.The house, a former barn, has been attractively converted.They bought a converted mews.Nitrogen is converted into nitrates in the soil which plants can then use.You needn't bother telling us how recycling helps the environment, because you're preaching to the converted.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging your mind\nconvert verb\n(SPORTS)\n[ T ] in sport , to score extra points such as a conversion, free throw, or penalty shot\nSMART Vocabulary: related words and phrases\nRugby\ncharge something down\nconverted\ncooler\ndrop kick\nfield of play\nflanker\nheel\nmatch fitness\nmisfield\noutcome variable\noutkick\nplace-kick\nprop\nsquad rotation\nsteal\ntest match\nthrow something in\nunconverted\nwing back\nwork rate\nSee more results »"}