{"id":108308,"name":"conversation","type":"noun","us_sound":"ˌkɑːn.vɚˈseɪ.ʃən","us_link":"../audio/c/conversation.mp3","uk_sound":"ˌkɒn.vəˈseɪ.ʃən","uk_link":"../audio/c/ukconva020.mp3","content":"Add to word list\nAdd to word list\nA1 (a) talk between two or more people in which thoughts, feelings, and ideas are expressed, questions are asked and answered, or news and information is exchanged: have a conversation with She had a strange conversation with the man who moved in upstairs.hold/carry on a conversation It's impossible to hold/carry on a conversation with all this noise going on!strike up a conversation with I struck up (= started) an interesting conversation with your uncle. Because of television, many people have lost the art of conversation (= talking to each other).run out of conversation Whenever I'm in a social situation with my boss, we seem to run out of conversation (= things to say to each other) after two minutes!\nMore examplesFewer examplesShe fell into a conversation with a man at the bar.There are certain topics of conversation that are not suitable for polite society.She completely monopolized the conversation at lunch.Brother Michael and Brother John were deep in conversation.I wish Dad would stop listening in on my phone conversations.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nunderstand\nSee more results »\nIdiom\nmake conversation\nAdd to word list\nAdd to word list\nan informal, usually private, talk in which two or more people exchange thoughts, feelings, or ideas, or in which news or information is given or discussed: [ C ] We had a brief conversation Friday. [ U ] The topic of conversation was college plans.\nIf you make conversation, you cause someone to talk to you, esp. about unimportant matters. conversational adjective us\nYour browser doesn't support HTML5 audio\n/ˌkɑn·vərˈseɪ·ʃə·nəl/\nHe rarely speaks in a normal conversational tone.\nAdd to word list\nAdd to word list\na discussion with someone about a particular subject: have a conversation We believe the company has the resources it needs, but if more is needed, we'll have that conversation."}