{"id":108386,"name":"conviction","type":"noun","us_sound":"kənˈvɪk.ʃən","us_link":"../audio/c/conviction.mp3","uk_sound":"kənˈvɪk.ʃən","uk_link":"../audio/c/ukconve010.mp3","content":"conviction noun\n(CRIME)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the fact of officially being found to be guilty of a particular crime, or the act of officially finding someone guilty: conviction for Since it was her first conviction for stealing, she was given a less severe sentence. He has a long record of previous convictions for similar offences.conviction of The conviction of the three demonstrators has caused public outrage locally. Compare\nacquittal\nMore examplesFewer examplesFresh evidence has emerged that casts doubts on the men's conviction.He got off with a fairly light sentence because it was his first conviction.The district attorney said if McVeigh is given the death penalty and his conviction is upheld on appeal, the state prosecution would become moot.Because of a previous conviction, the judge refused to grant bail .His conviction was quashed in March 1986 after his counsel argued that the police evidence was a tissue of lies.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\nflight risk\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuilty\nconviction noun\n(OPINION)\nC2 [ C or U ] a strong opinion or belief: religious/moral convictionsdeep/strong/lifelong conviction They share a deep/strong/lifelong conviction that you can do anything if you're willing to work hard. [ + that ] It's my personal conviction that all rapists should be locked away for life.\n[ U ] a feeling of being certain about something: lack conviction He said he was enjoying his new job, but his voice lacked conviction.\nMore examplesFewer examplesShe had a firm conviction that they would meet again in the hereafter.His speech carried so much conviction that I had to agree with him.He has an irrational conviction that he is right.Her statement that she supported the president lacked conviction.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nheretical\nheretically\nhot take\nidea\noutlook\npole\nposture\npretension\nprism\nredistributionist\nrelativism\nsomeone's idea of something idiom\ntick\nSee more results »\nconviction noun [C/U]\n(BELIEF)\nAdd to word list\nAdd to word list\na strong belief that is not likely to change, or the strong feeling that your beliefs are right: [ C ] He has no ability to communicate his convictions. [ U ] His followers believed with varying degrees of conviction.\nconviction noun [C/U]\n(CRIME)\nthe act of deciding officially in a court of law that someone is guilty of a particular crime: [ C ] His criminal record includes convictions for robberies in several states.\nAdd to word list\nAdd to word list\n[ C ] a decision made by a court of law that someone is guilty of a crime: have a conviction for sth He has two previous convictions for tax evasion.\n[ U ] the process of proving in a court of law that someone is guilty of a crime: Too many defendants are escaping conviction because the case against them was poorly presented."}