{"id":108332,"name":"conversion","type":"noun","us_sound":"kənˈvɝː.ʒən","us_link":"../audio/c/conversion.mp3","uk_sound":"kənˈvɜː.ʃən","uk_link":"../audio/c/ukconva026.mp3","content":"conversion noun\n(CHANGE)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the process of converting something from one thing to another: conversion of something into something Solar power is the conversion of the sun's energy into heat and electricity.\nC2 [ C or U ] a process in which someone changes to a new religion or belief: conversion to Her conversion to Buddhism/Islam was a very gradual process.undergo a conversion He used to be very right-wing, but he's undergone something of a conversion recently.\n[ C ] a place for living in that has been changed from its previous use: a barn/factory conversion\n[ C or U ]\n&#160; business\n&#160; specialized the process of getting a customer who visits a website, sees an advertisement, etc. to buy a product, or a customer who does this: The aim of the marketing is to increase conversions - that is, the number of visitors to the site who are paying customers. Although the number of responses to closely targeted ads will be lower, the conversion rate will be higher.\nMore examplesFewer examplesThe program works out the currency conversions for us.She talked about her conversion to Christianity.The firm specializes in loft conversions . The drop in paid clicks turns out to coincide with more conversions into actual sales.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nunsteady\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nAdvertising and marketing\nconversion noun\n(SPORT)\n[ C ] in rugby, an attempt to score more points after a try by kicking the ball over the bar and between the two posts\n[ C ] in American football, an extra point or points that are scored after a touchdown See also\nextra point\npoint after\ntwo-point conversion\nSMART Vocabulary: related words and phrases\nRugby\ncharge something down\nconverted\ncooler\ndrop kick\nfield of play\nflanker\nheel\nmatch fitness\nmisfield\noutcome variable\noutkick\nplace-kick\nprop\nsquad rotation\nsteal\ntest match\nthrow something in\nunconverted\nwing back\nwork rate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nAmerican football\nGrammar\nWord formationThere are four main kinds of word formation: prefixes, suffixes, conversion and compounds. …\nPrefixesWe add prefixes before the base or stem of a word. …\nSuffixesWe add suffixes after the base or stem of a word. The main purpose of a suffix is to show what class of word it is (e.g. noun or adjective). …\nConversionConversion involves the change of a word from one word class to another. For example, the verbs to email and to microwave are formed from the nouns email and microwave: …\nCompoundingWhen we use compounding, we link together two or more bases to create a new word. Normally, the first item identifies a key feature of the second word. For example, the two bases back and ache can combine to form the compound noun backache, and the two bases post and card combine to form the compound noun postcard. …\nAbbreviationAbbreviation involves shortening a word. We do this in three main ways: clipping, acronyms and blends. …\nBack-formationWe form words with back-formation when we remove part of a word, usually something which we think is a suffix (or occasionally a prefix). We do this commonly when we form verbs from nouns. …\nAdd to word list\nAdd to word list\nthe process of changing from one type of system or organization to another: currency conversionsconversion into sth the conversion of euros into US dollarsconversion (from sth) into sth the building society's conversion from a mutual organization into a public limited companyconversion to sth Conversion to digital TV will take place over a number of years.\nFINANCE, STOCK MARKET the process of exchanging preferred shares (= shares that give you special rights) for ordinary shares: The interest rate and conversion price will be determined before the offering closes.\nIT the process of changing computer data so that it can be read by a different software program: file conversion\nLAW the illegal act of giving away or selling property that belongs to someone else See also\ncash conversion\nfraudulent conversion"}