{"id":108262,"name":"conventional","type":"adjective","us_sound":"kənˈven.ʃən.əl","us_link":"../audio/c/conventional.mp3","uk_sound":"kənˈven.ʃən.əl","uk_link":"../audio/c/ukconva014.mp3","content":"Add to word list\nAdd to word list\nB2 traditional and ordinary: conventional behaviour/attitudes/clothes conventional medicine/farming a conventional weddingdisapproving I find his art dull and conventional. Opposite\nunconventional\nused to refer to weapons that are not nuclear, or to methods of fighting a war that do not involve nuclear weapons: conventional weapons/bombs\nMore examplesFewer examplesWhat a conventional, middle-aged attitude he has to life!Autosuggestive techniques can help in the treatment of diseases which cannot be cured by conventional medicine.I use a conventional oven.He despises their conventional attitudes.I prefer a more conventional style of dress.\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionally\ncounter-tradition\ncrowd\ncustom\ndemi-monde\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArms & munitions in general\nRelated words\nconventionality\nconventionally\nAdd to word list\nAdd to word list\nfollowing the usual practices of the past: We were raised in a conventional, middle-class family. It’s a conventional hot-water heater (= of the usual type).\nConventional weapons are not nuclear. conventionally adverb us\nYour browser doesn't support HTML5 audio\n/kənˈven·ʃə·nəl·i/\nHe was conventionally dressed in suit and tie.\nAdd to word list\nAdd to word list\nrelating to accepted or traditional ways of doing something: conventional accounting/business practices/methods It is estimated that over one-third of sub-prime borrowers could have qualified for cheaper, conventional loans.\nconventional wisdom\nopinions or theories that have existed for a long time and that most people agree with: The book challenges the conventional wisdom that companies are engaged in a \"war\" for talent."}