{"id":108396,"name":"convince","type":"verb","us_sound":"kənˈvɪns","us_link":"../audio/c/convince.mp3","uk_sound":"kənˈvɪns","uk_link":"../audio/c/ukconve011.mp3","content":"Add to word list\nAdd to word list\nB1 to persuade someone or make someone certain: convince someone of something He managed to convince the jury of his innocence. [ + (that) ] It's useless trying to convince her (that) she doesn't need to lose any weight. [ + to infinitive ] I hope this will convince you to change your mind.\nThesaurus: synonyms, antonyms, and examples\nto persuade someone to do somethingpersuadeIf she doesn't want to do it, nothing you say will persuade her.convinceThe lawyer convinced the jury of the man's innocence.talk someone intoShe managed to talk me into going along.talk someone out ofI think I've talked him out of leaving the country.dissuadeI tried to dissuade her from leaving.cajoleHe really knows how to cajole people into doing what he wants.\nSee more results »\nMore examplesFewer examplesAgricultural companies have failed to convince consumers that GM foods are safe.His doctor tried to convince him that he wasn't really ill and that it was all in the mind.Autosuggestion is the power of mind over matter - if you convince yourself that you are cured, you will be.It took a lot of persuasion to convince the committee of the advantages of the new scheme.Sometimes my imagination runs away with me and I convince myself that they are having an affair.\nSMART Vocabulary: related words and phrases\nReassuring\nassure someone of something\nbe/take a weight off your mind idiom\nblandishments\ncalm (someone) down\ncomforting\nconsolation\nconsole\nconsoling\nconsolingly\nlighten\nmind\nreassurance\nreassure\nreassuring\nset/put someone's mind at rest/ease idiom\nsettle down\nshould\nthey should worry! idiom\nweight\nyou do you idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProving and disproving\nAdd to word list\nAdd to word list\nto cause someone to believe something or to do something: We tried to convince my grandfather to live with us. [ + (that) clause ] I’m convinced (that) she’s lying."}