{"id":108261,"name":"convention","type":"noun","us_sound":"kənˈven.ʃən","us_link":"../audio/c/convention.mp3","uk_sound":"kənˈven.ʃən","uk_link":"../audio/c/ukconva013.mp3","content":"convention noun\n(MEETING)\nAdd to word list\nAdd to word list\nC1 [ C ] a large formal meeting of people who do a particular job or have a similar interest, or a large meeting for a political party: the national Democratic conventionhold a convention Where are they holding their party convention?annual convention She addressed hundreds of attendees at the International Reading Association's annual convention. Compare\nawayday mainly UK\nconclave\nconference (MEETING)\ncongress (MEETING)\nconsultation\nconvocation formal\nforum (MEETING)\nmeeting\nseminar\nsummit (MEETING)\nsymposium formal\n[ C ] (informal abbreviation con) a large event where fans of (= people who are very enthusiastic about) a particular TV programme, film, computer game, etc. can meet each other and some of the people involved in making the programme, film, etc.: Thousands of people were in town for the country's largest annual comic book convention. The venue hosts everything from dog shows to science fiction conventions. The actor liked to attend fan conventions in full costume and chat to his audience.\nMore examplesFewer examplesAmid all the razzle-dazzle of the party convention, it was easy to forget about the real political issues.The Democrats have chosen the Texas state treasurer as the keynote speaker at their convention.The Governor of New York delivered a rousing speech to the national convention.25,000 convention delegates from across the world converge for the Policy Institute's annual meeting.He took his kids to a Star Trek convention.\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconference\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nscrum\nsession\nspeaking engagement\nsymposium\nteleconference\nteleconferencing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTopics & areas of interest\nEnthusiasts\nconvention noun\n(CUSTOM)\nC1 [ C or U ] a usual or accepted way of behaving, especially in social situations, often following an old way of thinking or a custom in one particular society: defy/flout/break with convention They defied/flouted/broke with convention by giving up their jobs and becoming self-sufficient.convention dictates that Convention dictates that it is the man who asks the woman to marry him and not the other way round. In many countries it is the/a convention to wear black at funerals.\n[ C ] a common way of showing something in art or writing: an artistic convention\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmores\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\ntraditionalist\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things\nconvention noun\n(AGREEMENT)\n[ C ] a formal agreement between country leaders, politicians, and states on a matter that involves them all: the Geneva Conventionconvention on The decision is not compatible with the European Convention on Human Rights.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: international politics & government\nconvention noun\n(CUSTOM)\nAdd to word list\nAdd to word list\n[ C/U ] a way of doing something or appearing that is considered usual and correct: [ C ] literary conventions [ U ] He flouted convention by wearing sneakers with his tuxedo.\n[ C/U ]\n&#160; grammar The accepted rules and practice of spelling, writing, and punctuation are conventions.\nconvention noun\n(MEETING)\n[ C ] a large meeting of a group of people who are involved in the same type of work or who have similar interests: the Dairy Association’s annual convention a convention of travel agents a Star Trek convention\n[ C ]\n&#160; politics &amp; government A political convention is a meeting of a political party, esp. to choose someone to represent it in an election for a public office: the Democratic/Republican national convention\nconvention noun\n(AGREEMENT)\n[ C ]\n&#160; politics &amp; government, world history a formal agreement between countries: the Geneva Conventions the United Nations Conventions on the Law of the Sea\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MEETINGS a large, formal meeting of people who work in the same industry or belong to the same organization or profession: a convention of shopping center developershold/host a convention Madrid will host next year's convention.go to/attend a convention Over 2,000 people attended the convention in Philadelphia.\n[ C ]\n&#160; GOVERNMENT an official agreement between governments that makes rules relating to a particular activity: convention on sth the European Convention on Human Rightssign/ratify a convention One hundred and twenty countries signed a convention banning the use of the pesticides.\n[ C or U ] the accepted or traditional method of doing something, or an example of doing something in the traditional way: Bureaucracy and corporate convention can be an obstacle when facing new business challenges. Unwritten conventions do not have the same value as signed agreements."}