{"id":108424,"name":"convocation","type":"noun","us_sound":"ˌkɑːn.vəˈkeɪ.ʃən","us_link":"../audio/c/convocation.mp3","uk_sound":"ˌkɒn.vəˈkeɪ.ʃən","uk_link":"../audio/c/ukconve018.mp3","content":"Add to word list\nAdd to word list\n[ C ] a formal meeting, especially of religious leaders or at an educational institution: He called for a traditional convocation of elders to choose a new leader. She organized alumni gatherings and faculty convocations. Similar forums and meetings have taken place all over the city - convocations of people swapping ideas. Compare\nawayday mainly UK\nconclave\nconference (MEETING)\ncongress (MEETING)\nconsultation\nconvention (MEETING)\nforum (MEETING)\nmeeting\nseminar\nsummit (MEETING)\nsymposium formal\nsynod specialized\n[ U ] the act of arranging a convocation: He proposed the convocation of a national representative assembly.\n[ C or U ] (also Convocation) in Canada and at some universities in the US, a graduation ceremony (= the ceremony at which students officially receive their degrees): Our convocation at the University of Toronto is this week. The convocation address was delivered by the Illinois senator. Synonyms\ncommencement\ngraduation\n[ C or U ] (also Convocation) at some universities in the UK and in some other countries, a group that represents all the members of a university and that meets to officially decide something: Through Convocation, graduates can have a say in the way the University is run. Nominations must by backed by at least 12 members of the university's convocation, which consists of all 180,000 graduates and its academic staff.\n[ C ] (also Convocation) a meeting of clergy (= church leaders) and church members from one part of a diocese (= an area controlled by a bishop): At the church's annual Holy Convocation in November, he received a standing ovation.\n[ C ]\n&#160; history\n&#160; specialized (also Convocation) in the Church of England in the past, a meeting of clergy (= church leaders) representing part of the Church, either Canterbury or York: The Convocations of Canterbury and York were replaced by the Church Assembly in 1920.\nMore examplesFewer examplesTwo more convocations are scheduled for October, with wide-ranging discussions planned at each.The former prime minister addressed the college during a special convocation.One student declined to shake the hand of the University's president at a May convocation. At the University of Oxford, Convocation's only remaining function is to elect the Chancellor of the University and the Professor of Poetry.His church is now connected to the Convocation of Anglicans in North America.\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconference\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nsession\nspeaking engagement\nsummit\nsymposium\nteleconference\nteleconferencing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUniversity & college education\nAdministrative church areas\nAdd to word list\nAdd to word list\na large, formal meeting, esp. for the ceremony at a university at the end of a course of study, or the act of arranging a large, formal meeting: [ C ] She was awarded an honorary degree at the spring convocation."}