{"id":108556,"name":"cooler","type":"noun","us_sound":"ˈkuː.lɚ","us_link":"../audio/c/cooler.mp3","uk_sound":"ˈkuː.lər","uk_link":"../audio/c/ukcooke007.mp3","content":"cooler noun [C]\n(KEEPING COLD)\nAdd to word list\nAdd to word list\nmainly US (UK usually cool box) a container like a box with a lid, used for keeping food and drinks cool: We brought a cooler full of beer with us.\nDonNichols/E+/GettyImages\nIndian English an\nair-cooler\nSMART Vocabulary: related words and phrases\nRefrigerators & freezers\nblast chiller\nchest freezer\nchill cabinet\nchill room\ncold pack\ncool bag\ncooler bag\ncrisper\ndeep freeze\nEsky\nfreezer\nfreezer pack\nfridge\nfridge magnet\nfridge-freezer\nice bucket\nmeat locker\nminibar\nrefrigerator\nrefrigerator-freezer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: vents & ventilation\ncooler noun [C]\n(DRINK)\nmainly US a cold drink, usually of wine, fruit juice, and fizzy water (= with bubbles): a wine/fruit cooler\ncooler noun [C]\n(PUNISHMENT)\nthe cooler informal\nprison: This kind of fraud could get you a few months in the cooler.\na cell (= a small locked room) where someone is made to stay for a short time as a punishment, usually alone: The guards claimed he had to be put in the cooler for his own safety. If you get caught you must spend two weeks in the cooler in solitary confinement.\nin some sports such as rugby or ice hockey, a place away from the playing area where a player has to stay for a short time during the game, as a punishment for breaking the rules: He spent 10 minutes in the cooler at the end of the first half after ignoring a warning from the referee. Synonyms\npenalty box\nsin bin\nMore examplesFewer examplesHe tells deadpan stories about his years \"in the cooler.\"She has no money to pay a fine and nobody to stay with the kids if she goes to the cooler.Local cops said he was drunk and abusive and threw him in the cooler. The player behaved himself for a few minutes before tripping Mark Cueto, earning himself a spell in the cooler.The most aggressive hockey players spend the most time in the cooler.\nSMART Vocabulary: related words and phrases\nPrisons & parts of prisons\napproved school\nBastille\nboot camp\nborstal\nbrig\nclink\ngaoler\nhalfway house\nHMP\nhouse of correction\nmatron\npanopticon\npenal colony\npenitentiary\nprison\nprison camp\nstraightjacket\nstraitjacket\nthe gulag\nyoung offender institution\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPutting people in prison\nRefereeing & judging in sport\nRugby\nHockey\nAdd to word list\nAdd to word list\na container used for keeping food and drinks cold: a cooler full of water"}