{"id":108623,"name":"cooperative","type":"adjective","us_sound":"koʊˈɑː.pɚ.ə.t̬ɪv","us_link":"../audio/c/eus71004.mp3","uk_sound":"kəʊˈɒp.ər.ə.tɪv","uk_link":"../audio/c/ukcooke019.mp3","content":"cooperative adjective\n(HELPFUL)\nAdd to word list\nAdd to word list\nB2 willing to help or do what people ask: I asked them to turn down their music, but they're not being very cooperative. He was an extremely co-operative witness. Opposite\nuncooperative\nMore examplesFewer examplesLocal officials have been very cooperative on working together for a solution. Interest groups have been unusually cooperative so far.He went voluntarily and was very co-operative.\nSMART Vocabulary: related words and phrases\nKind & thoughtful\naccommodating\naccommodatingly\nattentive\nattentively\nattentiveness\ncooperatively\ndiplomacy\ndiplomatic\ndiplomatically\neunoia\nmotherly\nneighbourliness\nneighbourly\nnice\nthe milk of human kindness idiom\nthoughtful\nthoughtfully\nthoughtfulness\nunmalicious\nunmaliciously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHelping and co-operating\ncooperative adjective\n(DONE WITH OTHERS)\ndone or owned together with other people: Purchase of the ranch was a cooperative effort between many groups and agencies. The work is the result of a co-operative venture of approximately 80 physicists from around the world. The cooperative business brings together 500 wine producers in the region.\n(of a house, a building, etc.) owned by a cooperative (= an organization that owns and manages houses that its members live in): cooperative housing We need more co-operative housing. a cooperative apartment\ninvolving a group of people playing a game together to try to achieve the same thing, rather than trying to beat each other: cooperative play These levels can be played solo or with a friend in cooperative play. Compare\nmultiplayer\nMore examplesFewer examplesWe will only succeed in dealing with the problems through a vast international co-operative effort. He founded a large cooperative farm to provide jobs and housing for adults with disabilities.The activities are designed for cooperative learning with at least one partner.The best way to manage the resource is through a cooperative agreement between the landowner and fishermen.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperatively\ndistributively\ndouble act\nen bloc\nen masse\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\none-stop shop\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nOrganizations, Societies & clubs\nCompetitors & participants in sports & games\nRelated word\ncooperatively\nan organization, business, shop, farm, or group of farms that is owned and managed by a group of people who also work in it: The magazine is run as a cooperative. We are a 100% worker-owned co-operative selling 100% Fair Trade certified coffee, tea, chocolate, and snacks.\nan organization that owns and manages houses that its members live in, or the group of houses that it owns: Like many apartment buildings in New York City, the building is run by a cooperative. housing cooperative They live in a housing co-operative for senior citizens.\nmainly US a house or flat that is owned by a cooperative (= an organization that owns and manages houses that its members live in): Many apartments on the Upper East Side were being turned into cooperatives.\nMore examplesFewer examplesThere are particular tax laws pertaining to agricultural cooperatives. These ethanol-producing plants are farmer-owned cooperatives that make ethanol from corn.The artists' co-operative has its own gallery showing its members work.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nHouses & homes\nAdd to word list\nAdd to word list\na company owned and managed by the people who work in it: a farmers’ cooperative\nA cooperative is also an apartment building in which ownership is shared by all the people living in it.\n[ not gradable ] formed and managed by the people who work in it, or made up of several similar companies or organizations working together: farm cooperative organizations a cooperative day care center\nshowing a willingness to act or work together for a shared purpose: It was a cooperative effort.\ncooperatively adverb us/koʊˈɑp·ər·ə·t̬ɪv·li/\nAdd to word list\nAdd to word list\nan organization or company that is owned and controlled by a group of members who each have a share in it, for example its employees or customers: a farmers' cooperative See also\nagricultural cooperative\nconsumer cooperative\ncredit co-operative\nhousing co-operative\nindustrial co-operative\nmarketing cooperative\nretail cooperative\nsavings and credit co-operative\nwholesale cooperative\na cooperative organization or company is owned and controlled by a group of members who each have a share in it, for example its employees or customers: cooperative businesses/ventures"}