{"id":108620,"name":"cooperation","type":"noun","us_sound":"koʊˌɑː.pəˈreɪ.ʃən","us_link":"../audio/c/cooperation.mp3","uk_sound":"kəʊˌɒp.ərˈeɪ.ʃən","uk_link":"../audio/c/ukcooke018.mp3","content":"Add to word list\nAdd to word list\nB2 the act of working together with someone or doing what they ask you: with the cooperation of This documentary was made with the cooperation of the victims' families.cooperation between There's very little cooperation between the two countries.in cooperation with The company produces computers in cooperation with a German firm.\nMore examplesFewer examplesWoodrow Wilson hoped the League of Nations would replace power politics with international cooperation.The agreement would give a new solidity to military cooperation between the two countries.We acted in a spirit of cooperation.The conference was seen as an ideal vehicle for increased cooperation between the member states.I need your cooperation to make this event a success.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\ngo a long way toward(s) doing something idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nAdd to word list\nAdd to word list\nthe process of working with another company, organization, or country in order to achieve something: economic/international/global cooperationcooperation with sb/sth Marketing networks have been enhanced through cooperation with Chinese enterprises.cooperation between sb/sth (and sb/sth) Successful innovation requires cooperation between different departments.closer/greater/increased cooperation We need to see closer cooperation between industry and government.in cooperation with Starbucks, in cooperation with Conservation International, sourced its coffee direct from farmers in Mexico.\nthe fact of being willing to be helpful and to do what someone asks you to do: They promised full cooperation with the tax authorities."}