{"id":108615,"name":"cooperate","type":"verb","us_sound":"koʊˈɑː.pə.reɪt","us_link":"../audio/c/cooperate.mp3","uk_sound":"kəʊˈɒp.ər.eɪt","uk_link":"../audio/c/ukcooke017.mp3","content":"Add to word list\nAdd to word list\nB2 to act or work together for a particular purpose, or to be helpful by doing what someone asks you to do: A two-year old is likely to refuse to cooperate when you tell her to get dressed.cooperate in The two companies have cooperated in joint ventures for the past several years. The Spanish authorities cooperated with the British police in finding the terrorists. Synonym\ncollaborate\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\nMore examplesFewer examplesGovernments must cooperate if they are to combat international terrorism.Their refusal to cooperate is perfectly understandable, considering the circumstances.Local residents refused to cooperate with the police.If you all cooperate, we can have this place tidy in no time.Jill refused to cooperate with the enquiry.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\ngo a long way toward(s) doing something idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nAdd to word list\nAdd to word list\nto act or work together for a shared purpose, or to help willingly when asked: The company promised to cooperate fully with the law-enforcement authorities. He refused to cooperate. cooperation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/koʊˌɑp·əˈreɪ·ʃən/\nWithout the cooperation of local residents, this movie could not have been made.\nAdd to word list\nAdd to word list\nto agree to work with another company, organization, or country in order to achieve something: Large corporations have a duty to cooperate in order to protect the environment.cooperate (with sb) on/in sth We are cooperating with another company on this joint venture.cooperate in doing sth/ to do sth They have agreed to cooperate in distributing products and providing support services.\nto be helpful by doing what someone asks you to do: cooperate with sb A spokesman said the company would cooperate fully with the regulatory authorities."}