{"id":108650,"name":"coordinate","type":"verb","us_sound":"koʊˈɔːr.dən.eɪt","us_link":"../audio/c/eus71006.mp3","uk_sound":"kəʊˈɔː.dɪ.neɪt","uk_link":"../audio/c/ukcooke021.mp3","content":"coordinate verb\n(COMBINE)\nAdd to word list\nAdd to word list\n[ T ] to make many different things work effectively as a whole: We need someone to coordinate the whole campaign. A number of charities are coordinating their efforts to distribute food to the region.\nMore examplesFewer examplesRight now I'm having problems co-ordinating thought and speech.They co-ordinated diaries and made the event happen.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\ncoordinate verb\n(MATCH)\n[ I ] UK to match or look attractive together: coordinate with The bed linen coordinates with the bedroom curtains. a coordinating jacket and skirt\nMore examplesFewer examplesOne approach is to decide on a colour theme, perhaps to co-ordinate with the room in which the pictures will hang.To co-ordinate with the modern kitchen, the cooker is finished in dove grey. Take a lightweight jacket and co-ordinating trousers or skirt.\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinated\ncoordination\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch\nmatch up\nmatchy-matchy\ntone\ntone in\ncoordinate noun\n(POSITION)\n[ C usually plural ] one of a pair of numbers and/or letters that show the exact position of a point on a map or graph: Put in the GPS coordinates and zoom in on the map. The pilot had been given the wrong co-ordinates. Students learn the fundamentals of graphs and how X and Y coordinates work.\nMore examplesFewer examplesUsers can download the coordinates and find out how far they are from the nearest supply.They use GPS to lock in the helicopter's co-ordinates while flying over a field so they can easily return to exactly the same spot.I took a note of the co-ordinates for the rendezvous.\nSMART Vocabulary: related words and phrases\nMaps & map-making\natlas\ncartographer\ncartographic\ncartographically\ncompass rose\ncontour\ncontoured\ncontouring\nelevation\nisobar\nisotherm\nmeridian\nos\nplot\npt\nreplot\nresurvey\nroad map\nsurvey\ntriangulation\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTables, graphs & diagrams\ncoordinate noun\n(CLOTHES)\ncoordinates [ plural ]\nclothes, especially for women, that are made in matching colours or styles so that they can be worn together: Her usual style is sophisticated coordinates for day wear.\nSee more\nAdd to word list\nAdd to word list\nto make various, separate things work together: Voluntary organizations will need to coordinate their efforts to help the homeless. Patients learn how to coordinate movements of their arms and legs. coordinator noun [ C ] us/koʊˈɔr·dənˌeɪ·t̬ər/\nMrs. Steed is the Atlanta area coordinator for an international diabetes study.\nmathematics a number along one axis (= line) of a coordinate plane (= region formed by two number lines)\nAdd to word list\nAdd to word list\nto organize all the different activities and people who are involved in something so that it works effectively: Who will be responsible for coordinating the project?coordinate activities/efforts/operations E-commerce has enabled us to coordinate international operations. Phrasal verb\ncoordinate with sb/sth"}