{"id":108656,"name":"coordination","type":"noun","us_sound":"koʊˌɔːr.dənˈeɪ.ʃən","us_link":"../audio/c/eus71007.mp3","uk_sound":"kəʊˌɔː.dɪˈneɪ.ʃən","uk_link":"../audio/c/ukcooke027.mp3","content":"coordination noun [U]\n(ORGANIZATION)\nAdd to word list\nAdd to word list\nthe act of making all the people involved in a plan or activity work together in an organized way: coordination between There's absolutely no coordination between the different groups - nobody knows what anyone else is doing.coordination of We need to ensure the coordination of relief efforts. The aim is to ensure better co-ordination among our agencies.\nthe ability to make your arms, legs, and other body parts move in a controlled way: Gymnastics is a sport that requires a lot of coordination.hand-eye coordination Activities such as drawing and colouring in improve hand-eye coordination.motor coordination Symptoms of the condition include impaired motor co-ordination and problems with balance.\nMore examplesFewer examplesThere is a need for better coordination between state and county governments.There was a serious lack of co-ordination of marketing activities.Playing video games can actually improve coordination.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nflabbily\nget up\nget your act together idiom\ngold command\nhave/get your shit together idiom\nmobilize\nmount\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nrecentralization\nscrum\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\ncoordination noun [U]\n(MATCHING)\nthe fact of arranging something so that the colours, etc. match or look attractive together: Her home shows her eye for detail and colour coordination. Think about co-ordination when choosing your outfit.\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordinated\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch\nmatch up\nmatchy-matchy\ntone\ntone in\nAdd to word list\nAdd to word list\nthe activity of organizing separate things so that they work together: We need better coordination between state and local authorities.\nCoordination is also the ability to make all the parts of your body work together: Your child's improved hand-eye coordination will enable him to make a tower out of at least two blocks.\nAdd to word list\nAdd to word list\nthe process of organizing the different activities or people involved in something so that they work together effectively: coordination with sb/sth The internet has improved coordination with customers and suppliers.coordination between sb/sth (and sb/sth) There needs to be greater coordination between the design department and the marketing department. Efficient coordination of resources is vital to the success of any company.greater/closer/improved coordination With more money and greater coordination, the company could be a market leader."}