{"id":108651,"name":"coordinated","type":"adjective","us_sound":"koʊˈɔːr.dən.eɪ.t̬ɪd","us_link":"../audio/c/usconve027.mp3","uk_sound":"kəʊˈɔː.dɪ.neɪ.tɪd","uk_link":"../audio/c/ukcooke024.mp3","content":"coordinated adjective\n(WELL ORGANIZED)\nAdd to word list\nAdd to word list\neffectively organized so that all the parts work well together: The rebel troops have launched a coordinated attack on government soldiers. He described the evacuation as one of the most successful and well co-ordinated he had seen.\nIf a person is coordinated, they move in a very easy and controlled way, especially when playing sports or dancing: I wasn't a very coordinated child. Their movements are wonderfully co-ordinated.\nMore examplesFewer examplesWe need a coordinated national literacy strategy.This was a coordinated attempt to destabilize the regime.They found that different departments of the organization were not sufficiently well co-ordinated.It was a smooth and coordinated motion.Some of us are gifted with technical minds, rather than co-ordinated limbs.\nSMART Vocabulary: related words and phrases\nManaging and organizing\nadmin\nadminister\nadministration\nanti-bureaucracy\nbronze command\nfixer\nflabbily\nget up\nget your act together idiom\ngold command\nmobilize\nmount\npaperwork\nparty planner\nparty planning\nproject-manage\nrationalization\nrationalize\nvice-presidential\nwieldy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: fit & healthy\ncoordinated adjective\n(WELL MATCHED)\narranged so that the colours, etc. match or look attractive together: colour-coordinated decor The colour scheme of their living room is carefully coordinated.\nMore examplesFewer examplesThe hockey team wore pleated skirts and colour co-ordinated socks.\nSMART Vocabulary: related words and phrases\nMatching and co-ordinating\n-matched\ncoordinate\ncoordination\ngo\ngo with something\ngone\nincongruence\nmarry\nmarry up (something)\nmatch\nmatch up\nmatchy-matchy\ntone\ntone in\nAdd to word list\nAdd to word list\nable to move in a very easy and controlled way, especially when playing sports or dancing"}