{"id":109006,"name":"coptic","type":"adjective","us_sound":"ˈkɑːp.tɪk","us_link":"../audio/c/uscoos_011.mp3","uk_sound":"ˈkɒp.tɪk","uk_link":"../audio/c/ukcop__015.mp3","content":"Add to word list\nAdd to word list\nbelonging to or connected with the ancient Christian Church of Egypt, now based in Egypt and Ethiopia: In the Middle East, the largest Christian group is the Coptic Church. Her family were Coptic Christians. Today, around 10 percent of Egypt's population is Coptic. a Coptic monastery\nin or relating to the Coptic language (= the final form of the ancient Egyptian language, which uses a form of the Greek alphabet): The word is probably of Coptic origin. The Coptic texts are mostly private letters and religious documents while the Greek ones are dominated by administrative and economic texts. Related word\nCopt\nMore examplesFewer examplesThe Apostle Mark founded the Coptic Church in the 1st century, bringing Christianity to Egypt.The Eritrean people who live in the town are Coptic Christian and Muslim.Coptic hymns are included in the school's curriculum.\nSMART Vocabulary: related words and phrases\nChristian denominations\nAnglican\nAnglo-Catholic\nbyzantine\nC of E\nCalvinism\ndenominational\ndenominationally\necclesiastical\necumenical\necumenically\nLatinize\nLatinized\nLow Church\nLutheran\nMethodism\nPentecostalist\nPresbyterian\nProddie\nProtestantism\npuritanism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLanguage names\n[ U ] the final form of the ancient Egyptian language, spoken in Egypt from around the 3rd century CE, which uses a form of the Greek alphabet and is now used only as part of the ceremonies of the Coptic Church: Coptic, the descendant of hieroglyphics, is the language in which these monks pray. The inscription was written in Coptic.\n[ C ] a person who belongs to the Coptic Church, the ancient Christian Church of Egypt, now based in Egypt and Ethiopia: The law prevented Coptics from taking certain government posts. Related word\nCopt\nMore examplesFewer examplesThe characters on this 5-inch fragment of papyrus are Coptic, an Egyptian language written with Greek letters.The collection of letters illustrates that Coptic was in common use in the 4th century for private purposes throughout Egypt.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nGujarati\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nNauruan\nRomany\nUzbek\nVietnamese\nYiddish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: followers of religious groups"}