{"id":108816,"name":"copying","type":"verb","us_sound":"ˈkɑː.pi","us_link":"../audio/c/copy.mp3","uk_sound":"ˈkɒp.i","uk_link":"../audio/c/ukcop__019.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ncopy\ncopy verb [I or T]\n(REPRODUCE)\nA2 to produce something so that it is the same as an original piece of work: They've copied the basic design from the Japanese model and added a few of their own refinements. Patricia's going to copy her novel onto a flash drive and send it to me.disapproving He was always copying from/off other students (= cheating by copying), but never got caught.\nB2 to behave, dress, speak, etc. in a way that is intended to be like someone else, for example, because you admire that person: He tends to copy his brother in the way he dresses. copy and paste\nIf you copy and paste something on a computer screen, you move it from one area to another.\nMore examplesFewer examplesThey've copied the basic design from the Japanese model and added a few of their own refinements.She cheated in the test by copying from the boy in front.All authors need to be wary of inadvertent copying of other people's ideas.Make sure the file you're copying to is open before you click 'Paste'.She tried to copy the actress's clothes.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nOperating computers\ncopy verb [I or T]\n(UNDERSTAND)\nused, especially when communicating by radio, to tell someone that you have heard or understood, or to ask if someone has heard or understood you: He pressed the call button on his walkie-talkie: \"We've got them.\" \" Copy that. Stay where you are.\" \"Rodriguez, do you copy?\"— \"Yes, sir.\"— \"What's your position?\"\nMore examplesFewer examplesThe dispatcher came back, giving him a staticky message.\" Copy,\" he replied.Bravo 2 zero, this is Alpha Omega, do you copy?Mouse: Computer, Magic Mouse here, I need the cursor moving now! Before that window disappears! Computer: Copy that, Magic. LUKE: I'm sorry. I-I really don't enjoy talking this early in the morning. ZACH: Oh, hey, copy that. I'm right there with you.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nBroadcasting: radio\nPhrasal verbs\ncopy something down\ncopy someone in\ncopy something out"}