{"id":108837,"name":"copyright","type":"noun","us_sound":"ˈkɑː.pi.raɪt","us_link":"../audio/c/copyright.mp3","uk_sound":"ˈkɒp.i.raɪt","uk_link":"../audio/c/ukcop__022.mp3","content":"Add to word list\nAdd to word list\nthe legal right to control the production and selling of a book, play, film, photograph, or piece of music: Who owns/holds the copyright on this article? His work is no longer protected by copyright. The symbol © shows that something is protected by copyright.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nenact\nenforce\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\njurisprudentially\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nprohibit\nsanction\nwrit\nSee more results »\ncopyright verb [ T ] uk\nYour browser doesn't support HTML5 audio\nus\nYour browser doesn't support HTML5 audio\nAdd to word list\nAdd to word list\nthe legal right to control all use of an original work, such as a book, play, movie, or piece of music, for a particular period of time\nAdd to word list\nAdd to word list\nthe legal right that someone has to control the production and selling of a book, play, film, photograph, piece of music, etc. for a particular period of time: There was a need to develop copyright protection for computer programs. Copyright law prevents freelance work from being included in electronic archives without permission.breach/break/infringe copyright They claim the television company breached copyright when it used some of the footage on one of their DVDs.hold/own the copyright on/to sth Recording artists continue to own the copyright to their work. a breach/infringement of copyright\nbe in copyright\nif a book, film, etc. is in copyright, the period of the copyright that controls its production has not yet ended: Are there any issues with scanning books that are still in copyright?\nprotected by copyright: The contents of this website are copyright. The book contains a complete glossary of copyright terms.\nto get the legal right to control the production and selling of a book, film, photograph, piece of music, etc. for a particular period of time: Because software can be copyrighted, it has legal protection for much longer than patented inventions."}