{"id":108794,"name":"copycat","type":"noun","us_sound":"ˈkɑː.pi.kæt","us_link":"../audio/c/copycat.mp3","uk_sound":"ˈkɒp.i.kæt","uk_link":"../audio/c/ukcop__021.mp3","content":"Add to word list\nAdd to word list\ndisapproving someone who is influenced by someone else and does or says exactly the same as them: You're just a copycat! Whether it is the original attacker or a copycat, he must be caught soon. Synonym\nimitator\nsomething that is intentionally done or made to be very similar to something else: Many of the drugs licensed in the last decade have been copycats of already existing medicines. The website has become so influential that last month the government launched its own copycat.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforgery\nhijack\nhijacking\nimaging\nimitable\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\nCopycat behaviour, often bad or criminal behaviour, is influenced by other, similar behaviour: I don't believe that these cartoons lead to copycat violence. copycat murders The lawsuit may encourage copycat claims by other investors.\nintentionally done or made to be very similar to something else: At the market you can buy copycat designer handbags and perfumes. This was the first time that health watchdogs had approved a copycat version of a biotech drug.\nThesaurus: synonyms, antonyms, and examples\nlooking or being almost but not exactly the samesimilarI have a sofa quite similar to yours.likeShe's a lot like her mother.alikeThe girls look alike.closeMy cousin and I are quite close in age.something likeI was worried something like this would happen.\nSee more results »\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforgery\nhijack\nhijacking\nimaging\nimitable\nmail merge\nmimetic\nphotostatic\npiracy\npirate\npirated\nplagiarism\ntranscript\nXerox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrime - general words\nSimilar and the same\nto intentionally do the same thing as someone else has done, or make something very similar to something else: The restaurants that are succeeding today are those that are not copycatting somebody else. I think it's very sad when kids feel the need to copycat.\nMore examplesFewer examplesThey suggested she was trying to copycat Princess Diana's famous TV interview of 1995.Doesn't this film just copycat the plot of \"The Terminator\"?Many well-known brands are copycatted and sold in markets all over the world.\nSMART Vocabulary: related words and phrases\nCrime - general words\nanti-crime\nanti-fraud\nanti-narcotics\narrestable\ncaper\ncarrying-on\ndelinquent\ndriving under the influence\nDUI\nfelonious\nfeloniously\nfelony\nillegality\noutrage\npetty crime\nprotection racket\nrap sheet\nsecond-degree\nwrongdoing\nzero tolerance\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nAdd to word list\nAdd to word list\ndone to copy someone or something\nA copycat crime is one that appears to be a copy of another crime because it is so similar.\nAdd to word list\nAdd to word list\nmade or done in exactly the same way as something else: cheap copycat products Sales of the product have fallen by 42% since copycat versions were launched.\na product that is a copy of another company's product: The jeans company says it will fight to have all copycats removed from stores and destroyed."}