{"id":108785,"name":"copy","type":"verb","us_sound":"ˈkɑː.pi","us_link":"../audio/c/copy.mp3","uk_sound":"ˈkɒp.i","uk_link":"../audio/c/ukcop__019.mp3","content":"copy verb [I or T]\n(REPRODUCE)\nAdd to word list\nAdd to word list\nA2 to produce something so that it is the same as an original piece of work: They've copied the basic design from the Japanese model and added a few of their own refinements. Patricia's going to copy her novel onto a flash drive and send it to me.disapproving He was always copying from/off other students (= cheating by copying), but never got caught.\nB2 to behave, dress, speak, etc. in a way that is intended to be like someone else, for example, because you admire that person: He tends to copy his brother in the way he dresses. copy and paste\nIf you copy and paste something on a computer screen, you move it from one area to another: A significant percentage of students admit to copying and pasting text from websites.\nSee more\nMore examplesFewer examplesThey've copied the basic design from the Japanese model and added a few of their own refinements.She cheated in the test by copying from the boy in front.All authors need to be wary of inadvertent copying of other people's ideas.Make sure the file you're copying to is open before you click 'Paste'.She tried to copy the actress's clothes.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\ncopy verb [I or T]\n(UNDERSTAND)\nused, especially when communicating by radio, to tell someone that you have heard or understood, or to ask if someone has heard or understood you: He pressed the call button on his walkie-talkie: \"We've got them.\" \" Copy that. Stay where you are.\" \"Rodriguez, do you copy?\"— \"Yes, sir.\"— \"What's your position?\"\nMore examplesFewer examplesThe dispatcher came back, giving him a staticky message.\" Copy,\" he replied.Bravo 2 zero, this is Alpha Omega, do you copy?Mouse: Computer, Magic Mouse here, I need the cursor moving now! Before that window disappears! Computer: Copy that, Magic. LUKE: I'm sorry. I-I really don't enjoy talking this early in the morning. ZACH: Oh, hey, copy that. I'm right there with you.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nBroadcasting: radio\nPhrasal verbs\ncopy something down\ncopy someone in\ncopy something out\ncopy noun\n(VERSION)\nB1 [ C ] something that has been made to be exactly like something else: This painting is only a copy - the original hangs in the Louvre. I always keep a copy of any official or important letters that I send off. Could you make a copy of (= use a special machine to copy) this for tomorrow's meeting, please?\nB2 [ C ] a single book, newspaper, record, or other printed or recorded text of which many have been produced: The library has copies of all the national and local newspapers.\nMore examplesFewer examplesWe enclose a copy of our latest brochure, with our compliments.Would you make a copy for everybody in the office and a few extra ones for the visitors.Could you print out a copy of that letter for me?I'd really like a copy of the photograph - could you send me one?I seem to have acquired two copies of this book.\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSamples and examples\ncopy noun\n(TEXT)\n[ U ] written text that is to be printed, or text that is intended to help with the sale of a product: We need someone who can write good copy for our publicity department.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\ncopy verb [T]\n(PRODUCE)\nAdd to word list\nAdd to word list\nto produce something that is exactly like another thing, or to do something meant to be like someone or something else: The design was copied from a 19th-century wallpaper. He copied the file onto a diskette.\ncopy noun\n(TEXT)\n[ U ] text that is to be printed, or text that is used to sell a product: She writes advertising copy.\ncopy noun\n(SOMETHING PRODUCED)\n[ C ] something that is exactly like another thing: I always keep copies of letters I have written. Please make two copies of this.\n[ C ] A copy is also a single unit of something produced in large numbers, usually for sale: I had a copy of her latest CD somewhere. We ordered ten copies of the book.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a single book, newspaper, CD, or other printed or recorded product, of which many have been produced: The 600-page volume has become an instant hit, selling 250,000 copies since its publication in October.a copy of sth Order your copy of her new album today! The company is offering a free copy of their anti-virus software.\n[ C ] a document or other printed material that is exactly the same as another one, produced, for example, by using a photocopier or printing it more than once from a computer: Enclosed is a signed copy of the contract.make/take a copy I will need to take a copy of your passport.\n[ C ]\n&#160; IT a computer file, document, etc. that is created to be exactly the same as another one: Before working on the file, make a copy and save it in another folder.\n[ C ]\n&#160; COMMERCE a product that is made to look the same as another product, especially illegally: If you look closely at the label, you can tell it's a copy. The factories were for making illegal copies of software, CDs, and DVDs. Compare\nbootleg\npirate\n[ U ]\n&#160; MARKETING the words used in advertising to help sell a product: The advertising copy is tested with consumer surveys.\n[ U ] writing that is going to be printed in a book, magazine, etc.: The copy will be checked several times before publication.\nSee also\nadvance copy\nbody copy\ncarbon copy\ncertified copy\nhard copy\nknocking copy\noffice copy\ntop copy\nto make a copy of a letter, document, etc.: He was asked to copy the documents to keep on record. copy sth to sb The report was copied to all the senior members of the department.\nIT to make a copy of a computer file, document, email, etc.: Copy the files and put them in a new folder.copy sth to sb Every email I send out, I also copy to my boss.\ncopy and paste\nIT to make a copy of something on a computer screen and put it in a different place in a document or in a new document, file, or directory: Copy and paste the text from the box into a word processor document.\nto use someone else's idea, design, etc., often illegally: It is a system that works well and that others can copy. Phrasal verb\ncopy sb in"}