{"id":109218,"name":"cordially","type":"adverb","us_sound":"ˈkɔːr.dʒə.li","us_link":"../audio/c/uscoos_023.mp3","uk_sound":"ˈkɔː.di.ə.li","uk_link":"../audio/c/ukcoran005.mp3","content":"cordially adverb\n(friendly)\nAdd to word list\nAdd to word list\nin a way that is friendly, but formal and polite: \"Hello,\" she said cordially. I told him, very firmly but cordially, we couldn't do it.\nformal used when politely inviting someone somewhere, agreeing to something, asking something, etc.: You are cordially invited to attend our annual wine-tasting evening. You are cordially reminded not to smoke in your hotel room.\nused to end a letter in a way that is friendly, but formal and polite: We look forward to seeing you again in six months. Cordially, William Green. I love the flowers, but please stop sending them. Cordially, Agnes.\nMore examplesFewer examplesAt her office, there's always a welcoming cup of coffee and time to greet a guest cordially. The meeting started cordially but before long old resentments started to surface.The choice was cordially approved by the leaders of the Liberal Party.We cordially welcome you again to this Court.Let me know your thoughts, Cordially, Bill.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\nWritten greetings\ncordially adverb\n(strongly)\nin a way that is strongly felt, especially with feelings of dislike: On a personal level, they came to be cordially disliked. She hated Mr Jefferson cordially.\nMore examplesFewer examplesWe hate each other cordially.He was cordially detested for his brutality and injustice. A political secretary who cordially disliked me happened to be standing nearby.\nSMART Vocabulary: related words and phrases\nNot liking\nabhor\nabide\nabominate\nanti-American\nanti-British\ncivil\ncup\ncut\ndespise\ndetest\ndisdain\ndisdainful\ndisdainfully\ngo off\nmisanthropically\nnon-fan\nnot be someone's cup of tea idiom\nnot go much on something idiom\nnot have a civil word to say about someone idiom\ntire\nSee more results »\nSee\ncordial"}