{"id":109271,"name":"core","type":"noun","us_sound":"kɔːr","us_link":"../audio/c/core.mp3","uk_sound":"kɔːr","uk_link":"../audio/c/ukcop__028.mp3","content":"core noun\n(IMPORTANT PART)\nAdd to word list\nAdd to word list\nC2 [ S or U ] the basic and most important part of something: The lack of government funding is at the core of the problem.\nMore examplesFewer examplesThe radicals in the party were clearly sacked to propitiate the conservative core.Hardline rightwingers form the core of the movement.The core of our workforce comes from local families.A desire for justice is at the core of his arguments.The core of her philosophy is respect for life.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCentres of objects\nImportant and essential things\ncore noun\n(CENTRE)\nC2 [ C ] the hard central part of some fruits, such as apples, that contains the seeds: Don't throw your apple core on the floor!\nRoman Samokhin/iStock/Getty Images Plus/GettyImages\n[ C ] the centre of a planet: The earth's core is a hot, molten mix of iron and nickel.\nneyro2008/iStock/Getty Images Plus/GettyImages\n[ C ]\n&#160; physics\n&#160; specialized The core of a nuclear reactor (= a device in which atoms are changed to produce energy) is the place where fission (= the dividing of atoms) happens.\n[ C ]\n&#160; anatomy\n&#160; specialized the muscles around your pelvis, hips, and abdomen that you use in most body movements: These exercises are designed to strengthen your core.\n[ C ]\n&#160; geology\n&#160; specialized a long, thin cylinder-shaped mass of material taken out of the earth for study\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCentres of objects\nAstronomy\nMachines - generators & pumps\nSubstances & structures in the body\nThe human torso\nSamples and examples\nGeology - general words\nIdiom\nto the core\ncore adjective\n(IMPORTANT)\nmost important or most basic: They are cutting back production of some of their core products. core value, belief, issue, etc.\na value, belief, etc. that is basic and more important than any other: The final status negotiations would focus on the core issues of the peace process.\nSee more core business/operations/activities\nthe most important or largest part of a company's business activities: The company's core operations include entertainment and aviation.\nSee more core curriculum/subjects/courses\nthe most important parts of a course of study, that all students must learn: We want to see greater provision of subjects outside the core curriculum.\nSee more\nfound in the main part of the body, but not the arms or the legs: Pilates is good for strengthening the core muscles.\nSMART Vocabulary: related words and phrases\nImportant and essential things\n-based\namenity\nbare\nbe-all\nbig league\nfocal point\nforeground\nfundament\ngrandaddy\nheavyweight\nhot button\nimperative\nneed\nnexus\nnub\nnucleus\npivot\nprecondition\nthe grandaddy of something idiom\nthe name of the game idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body\nThe human torso\nto remove the core from a piece of fruit: Peel and core the pears before cooking them.\nSMART Vocabulary: related words and phrases\nRemoving the skin or seed from fruit & vegetables\nhull\npare\npeel\npit\npitted\nseed\nseeded\nshell\nshelling\nshuck\nskinless\nspud bashing\nstone\nstoned\ntop\ntop and tail idiom\nunshelled\nwinnow\nused in newspapers, magazines, and on social media to form words describing a particular type of style in clothes, music, furniture, etc.: Cottagecore is an internet aesthetic that celebrates an idealized rural life. The website has a section on classic novels entitled \"Lit-core\". When are fashion journalists going to stop putting the word \"-core\" at the end of everything? See also\nmumblecore\nnormcore\nMore examplesFewer examplesOn social media, words that end with -core typically refer to a particular style or aesthetic.What do you consider to be hipstercore music?The gardencore aesthetic includes makeup in soft, mushroom and earth tones, and jewellery inspired by fairies, fruit, flowers, plants, and woodland creatures. \"Americancore\" is used satirically to refer to an aesthetic that involves being as stereotypically American as possible.\nSMART Vocabulary: related words and phrases\nFashion\nanti-fashion\nclothes horse\ncollection\ncome\ncouture\ncouturier\ncover girl\nfashion statement\nfashionista\nfast fashion\ngeek chic\nhaute couture\nlook\nmissy\nmock croc\nmode\nmodel\nmodelling\nrocker\nsteampunk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nTypes of music\ncore noun [C]\n(FRUIT)\nAdd to word list\nAdd to word list\nthe hard, central part of some fruits, such as apples, which contains the seeds\ncore noun [C]\n(CENTER)\nthe center or most important part of something: Farmers formed the core of traditional party support. Safety concerns are at the core of the new federal policies.\nearth science The core of the earth is its center, made up of a liquid inner core and a solid outer core.\ncore adjective [not gradable]\n(CENTRAL)\ncentral; basic: We want to appeal to our core supporters without turning off undecided voters. The notion of love is one of the core values of our civilization. We have to concentrate on the core business, management said.\ncore verb [T]\n(FRUIT)\nto remove the core of fruit\nAdd to word list\nAdd to word list\nthe most important or most basic part of something: the core of sth The core of the bank's business is in Hong Kong.be at the core of sth The internet is increasingly at the core of the telecoms business.\nmost important: core activities/operationscore products/services They are cutting back production of some of their core products. core customers/workerscore values For a company to achieve a competitive advantage it is important to have core values and a clearly defined purpose. a core market/business"}