{"id":109636,"name":"cornish","type":"adjective","us_sound":"ˈkɔːr.nɪʃ","us_link":"../audio/c/cdo1121uscorn1137.mp3","uk_sound":"ˈkɔː.nɪʃ","uk_link":"../audio/c/cdo1121ukcorn1113.mp3","content":"Add to word list\nAdd to word list\nrelating to Cornwall in southwest England, or its people: The film has the magnificent Cornish coastline as a backdrop. My mother is Cornish.\nusing or relating to the ancient Celtic language spoken in Cornwall: Tyack is a Cornish word meaning \"farmer\".\nMore examplesFewer examplesDolphins and porpoises can be seen from Cornish beaches.The documentary follows the lives of Cornish fishermen.Du Maurier knew every inch of the Cornish countryside she described in her novels.Floods devastated the Cornish seaside town.A Cornish teacher came to set each day and helped actors with pronunciation. Bugaboo might come from an old Celtic word (most likely bucca-boo, an old Cornish word for a devil or spectre).\nSMART Vocabulary: related words and phrases\nTowns & regions: named regions of countries\nAberdeen City\nAberdeenshire\nAffrilachian\nAK\nAL\nEssex\nfife\nfl.\nFlintshire\nMissouri\nMissourian\nMN\nMonmouthshire\nMontana\nStirling\nStirlingshire\nStrathclyde\nSuffolk\nthe Fertile Crescent\nthe Sunbelt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLanguage names\n[ U ] an ancient Celtic language spoken in Cornwall, especially in the past: Cornish is closely related to Breton and Welsh. Her last words were in Cornish. the Cornish [ plural ]\nthe people of Cornwall in southwest England: Tourists usually receive a warm welcome from the Cornish.\nMore examplesFewer examplesThe last native speaker to use Cornish as a first language died in 1891, but the language was revived in the 20th century.Estimates of the number of people who speak fluent Cornish range from a few hundred to several thousand.Second home owners were accused of driving up house prices and pushing out the Cornish.There are around 3,500 Cornish with a working knowledge of the language.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nGujarati\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nNauruan\nRomany\nUzbek\nVietnamese\nYiddish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries"}