{"id":109557,"name":"corner","type":"noun","us_sound":"ˈkɔːr.nɚ","us_link":"../audio/c/corner.mp3","uk_sound":"ˈkɔː.nər","uk_link":"../audio/c/ukcoran030.mp3","content":"Add to word list\nAdd to word list\nA2 the point, area, or line that is formed by the meeting of two lines, surfaces, roads, etc.: You go around corners too fast when you're driving! There's a postbox on the corner (= the place where the street crosses another). Click the icon in the bottom right-hand corner of the screen. I have a bruise where I hit my leg on the corner of the table. They live just around/round the corner (= very close although not in the same road) - so we see them all the time.\nCopyright Xinzheng. All Rights Reserved/Moment/GettyImages\nC2 a part of a larger area, often somewhere quiet or far away: They live in a remote corner of Scotland, miles from the nearest store.\na kick in football or a shot in hockey that is taken from the corner of the playing area\nMasakazu Watanabe/Aflo/GettyImages\nMore examplesFewer examplesHe sat in a dim corner of the waiting-room.The cows were all standing in one corner of the field.They stood on the street corner handing out leaflets.We watched until the car had turned the corner.The stamp goes in the top right-hand corner of the envelope.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoad junctions\nFootball/soccer\nHockey\nIdioms\nall/the four corners of the world/earth\n(just) around the corner\nbe in a tight corner\nhave a corner on a market\nout of/from the corner of your eye\ncorner verb\n(TURN)\n[ I ] If a vehicle corners well, badly, etc., it drives around corners in the stated way: It's a powerful car, but it doesn't corner well.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\nlock\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\ncorner verb\n(TRAP)\n[ T ] to force a person or an animal into a place or situation from which they cannot easily escape: Once the police had cornered her in the basement, she gave herself up.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nIdiom\ncorner the market\nAdd to word list\nAdd to word list\nthe point or angle formed when two lines or surfaces meet: the corner of a table We could put that chair in the far corner of the room.\nA corner is also a place where two streets meet: I’ll meet you at the corner of Pine and Market at 7:30.\nA corner can also be a part or area of a place: They lived in a remote corner of Wyoming. Idiom\ncorner the market\nto force a person or animal into a place or situation from which there is no escape: [ T ] After a chase, the police cornered him in a hallway.\ncorner the market (in sth)\nAdd to word list\nAdd to word list\nto get control of an area of business so that it is difficult for other companies to be successful in it: Small low-cost airlines have cornered the market in cheap flights."}