{"id":109815,"name":"corporate","type":"adjective","us_sound":"ˈkɔːr.pɚ.ət","us_link":"../audio/c/corporate.mp3","uk_sound":"ˈkɔː.pər.ət","uk_link":"../audio/c/ukcorne027.mp3","content":"Add to word list\nAdd to word list\nC1 [ before noun ] relating to a large company: corporate finance a corporate merger corporate executives\nformal of or shared by a whole group and not just of a single member: All adults take corporate responsibility for the upbringing of the tribe's children.\nMore examplesFewer examplesThe trend towards downshifting, where employees swap the stress of corporate life for more quality time, tempted 6% of the UK workforce last year.The company's guests at Ascot are entertained in the corporate hospitality area.At about this time the new ideas about 'corporate management' had begun to infiltrate into local government.Once he started at Paramount in 1967, he moved rapidly up the corporate ladder.Protesters have called the building a monument to corporate greed.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharing\nAdd to word list\nAdd to word list\nrelating to a business, especially a large business: corporate bosses Analysts are expecting share prices to fall in the first quarter of next year because of poor corporate earnings.\nCorporate America/Britain/Germany, etc.\nused to refer to large companies that have a lot of influence in the economy of the US, Britain, Germany, etc.: Corporate America is starting to look at the millions of cars it owns for traveling salesmen as an area where it can save money.\n[ C ] a company, especially a large one: major corporates\ncorporates\n[ plural ]\n&#160; FINANCE bonds in companies: Their current split is 48% in stocks; 42% in bonds, mostly good-yielding corporates; and the rest in cash. See also\nbody corporate"}