{"id":109824,"name":"corporatist","type":"adjective","us_sound":"ˈkɔːr.prə.tɪst","us_link":"../audio/c/cdo0623uscorp0725.mp3","uk_sound":"ˈkɔː.pər.ə.tɪst","uk_link":"../audio/c/cdo0623ukcorp0727.mp3","content":"Add to word list\nAdd to word list\nsupporting or relating to the idea of corporatism (= the control of a country, society, or organization by large groups who share the same interests): His corporatist ideas on economics were very popular at the time. The country is heading in the direction of an authoritarian, nationalistic, corporatist state, he says.\nMore examplesFewer examplesSome political observers at the time argued that, given the unequal influence of certain interest groups on public policy, British politics could better be described as \"corporatist\" rather than pluralist.They knew that the establishment would revert to their corporatist roots and oppose the change.The president's plans to bolster the country's industry looked disturbingly corporatist to some.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\na person who supports the idea of corporatism (= the control of a country, society, or organization by large groups who share the same interests): A closer examination of his policies and actions in office reveals that he is very much a corporatist. They saw the world as being crudely divided between corporatists and free-marketeers.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratization\ndemocratize\ndespotic\ndespotically\ndespotism\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nSupporters, members & defenders"}