{"id":109847,"name":"corpse","type":"noun","us_sound":"kɔːrps","us_link":"../audio/c/corpse.mp3","uk_sound":"kɔːps","uk_link":"../audio/c/ukcorps001.mp3","content":"Add to word list\nAdd to word list\nC2 a dead body, usually of a person: The actor had to play a corpse lying in a morgue. Synonyms\nbody (PHYSICAL STRUCTURE)\ncadaver specialized\ncarcass\nstiff (BODY) slang\nMore examplesFewer examplesThe corpse was in an advanced stage of decomposition.Most of the corpses were badly burned, making identification almost impossible.The corpse had lain preserved in the soil for almost two millennia.\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\npush\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nto start laughing in a way you cannot control during a performance, or to make someone else do this; a word used by actors and performers: The scene was so ludicrous it was hard to play without corpsing. He had a tendency to corpse in the middle of the sketch. She started giggling, with that helpless gurgle that has corpsed so many of her fellow actors.\nMore examplesFewer examplesHe was able to deliver the most absurd lines straight faced, without corpsing.It's every broadcaster's nightmare to corpse on air.The closing credits include out-takes of fluffed lines and corpsing actors.She plays Lady Britomart Undershaft (a name that nearly corpsed her and her co-star on opening night).\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nappearance\nblocking\ncamp\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nAdd to word list\nAdd to word list\na dead body, esp. of a human"}