{"id":109890,"name":"correct","type":"adjective","us_sound":"kəˈrekt","us_link":"../audio/c/correct.mp3","uk_sound":"kəˈrekt","uk_link":"../audio/c/ukcorps008.mp3","content":"Add to word list\nAdd to word list\nA2 in agreement with the true facts or with what is generally accepted: a correct answer \"Is that the correct spelling?\" \"I don't know - look it up in a dictionary.\" It's not correct to describe them as \"students\".formal \"Your name is Angela Black?\" \"That is correct.\" Synonym\nright (CORRECT)Opposite\nincorrect\nThesaurus: synonyms, antonyms, and examples\nagreeing with factscorrectThat answer is correct.rightAll his answers were right.trueIs it true that you were born in Sweden?faithfulThis is a faithful account of what happened on the night of 30 May.\nSee more results »\nB1 taking or showing great care to behave or speak in a way that is generally accepted and approved of: He's very correct in his dress/speech/manner, isn't he?\nMore examplesFewer examplesPut a tick opposite the answer that you think is correct.Your information is correct but you left out one thing.Let's get this straight - you're travelling to Frankfurt on Monday and Brussels on Tuesday, is that correct?I got eight correct answers and two wrong ones in last week's exam.You must follow correct procedure at all times.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuitable and acceptable\nRelated words\ncorrectly\ncorrectness\nB2 to show or tell someone that something is wrong and to make it right: Students said it was helpful if the teacher corrected their pronunciation. I have 30 homework assignments to correct.\nIf a medical treatment corrects a particular condition, it cures the condition or makes it easier to manage: glasses to correct poor vision a chair that corrects bad posture correct me if I'm wrong (but)...\nsaid as a polite and slightly formal way of disagreeing with someone: Correct me if I'm wrong, but I think we arranged the meeting for the 12 December.\nSee more\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle\nfiddle (around) with something\nfine-tune\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nAdd to word list\nAdd to word list\nin agreement with the true facts or with a generally accepted standard: It’s your responsibility to see that your tax return is correct. Do you have the correct time? \"Did you testify that you recognized this man?\" \"That’s correct.\" correctly adverb us\nYour browser doesn't support HTML5 audio\n/kəˈrekt·li/\nHave I pronounced your name correctly? correctness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kəˈrekt·nəs/\nto show or fix what is wrong; make right: He knew she was mistaken but made no effort to correct her. It is the policy of this newspaper to correct errors of fact that appear in its news columns. Doctors can now use laser surgery to correct certain eye problems.\nAdd to word list\nAdd to word list\n[ I or T ] if prices, values, etc. correct or correct themselves, they change and become more normal after a period of being too high, too low, etc.: The market is positioned to correct and that is what's happening. Experts believe this is merely a slowdown in the economy that will correct itself.\n[ T ] to change an amount, a calculation, etc. in order to make it more accurate, by considering certain facts: These figures have been corrected to allow for inflationcorrect sth for sth The mid-year review did not correct the accounts for exchange-rate fluctuation."}