{"id":109954,"name":"correspondent","type":"noun","us_sound":"ˌkɔːr.əˈspɑːn.dənt","us_link":"../audio/c/correspondent.mp3","uk_sound":"ˌkɒr.ɪˈspɒn.dənt","uk_link":"../audio/c/ukcorps019.mp3","content":"correspondent noun [C]\n(REPORTER)\nAdd to word list\nAdd to word list\na person employed by a newspaper, a television station, etc. to report on a particular subject or send reports from a foreign country: a war correspondent the education correspondent for the Guardian\nMore examplesFewer examplesIn her latest dispatch, Clare Duggan, our war correspondent, reported an increase in fighting.She spoke emotionally about her experiences as a war correspondent.Our foreign correspondent filed this report earlier today.Perhaps her most productive period was her five-year stint as a foreign correspondent in New York.Our racing correspondent has the following tips for the 3.15 and the 3.45 at Newmarket .\nSMART Vocabulary: related words and phrases\nBroadcasting: radio & television presenters\nanchor\nanchorman\nanchorwoman\nannouncer\nbroadcaster\nco-host\ncommentator\ncompere\ndeejay\ndesk\ndisc jockey\ndisk jockey\nDJ\nemcee\nnewsreader\npresenter\nshock jock\nsportscaster\ntalking head\nweather forecaster\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNews reporting & the press\ncorrespondent noun [C]\n(LETTER WRITER)\nformal someone who writes letters: I'm a terrible correspondent - I never seem to get the time to write.\nSMART Vocabulary: related words and phrases\nPeople who write for work or pleasure\nautobiographer\nbelletrist\nblogger\nBraillist\nchronicler\ncolumnist\ncub reporter\nhumorist\nnovelist\npoet laureate\nsatirist\nscribbler\nscribe\nscriptwriter\nscrivener\nShakespeare\nsongwriter\nspeechwriter\nstylist\ntweep\nSee more results »\ncorrespondent noun [C]\n(REPORTER)\nAdd to word list\nAdd to word list\na person employed by a newspaper, magazine, television station, etc., to report news on a particular subject or from a place that is far away: He works as a correspondent in Moscow.\ncorrespondent noun [C]\n(LETTER WRITER)\na person who writes letters to another person: Willa was not a good correspondent, and often didn’t write for months.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a person who writes a letter or email: an email correspondent\na person who works for a newspaper, television station, etc. and whose job is to report on a particular subject or from another country: business/labour/legal, etc. correspondent Our guest is financial correspondent at the New York Times.\nBANKING a\ncorrespondent bank"}