{"id":109948,"name":"correspond","type":"verb","us_sound":"ˌkɔːr.əˈspɑːnd","us_link":"../audio/c/eus71022.mp3","uk_sound":"ˌkɒr.ɪˈspɒnd","uk_link":"../audio/c/ukcorps017.mp3","content":"correspond verb [I]\n(MATCH)\nAdd to word list\nAdd to word list\nB2 to match or be similar or equal: The money I've saved corresponds roughly to the amount I need for my plane ticket. The American FBI corresponds to the British MI5. His story of what happened that night didn't correspond with the witness's version.\nMore examplesFewer examplesTheir accounts of what happened that evening don't correspond at all.We both added up the figures again, but our totals still didn't correspond.That is not much of a punishment - it doesn't correspond with the seriousness of the offence.Her reply corresponded with yours, so I suppose I must believe you.My views on politics seldom correspond with those of my father.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\nequal\nequalization\neven (something) out\nfavour\nflatlining\nhomologous\nhomologous series\nmatch\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\ncorrespond verb [I]\n(WRITE)\nB2 to communicate by writing a letter or sending an email: I've been corresponding with several experts in the field.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\ncorrespond verb [I]\n(BE SIMILAR)\nAdd to word list\nAdd to word list\nto be similar or the same in some way: Her version of that meeting does not correspond with what I remember (= I remember it differently).\ncorrespond verb [I]\n(WRITE)\nto exchange letters: I corresponded with him when he was at school. We correspond by e-mail.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS to communicate with someone by letter or email: correspond with sb There has been some problem in the way insurers are corresponding with customers.\nto match something, or be similar or equal to something: closely/directly correspond to/with sth The dip in their sales in-store directly corresponds to the increase in sales online."}