{"id":109901,"name":"correction","type":"noun","us_sound":"kəˈrek.ʃən","us_link":"../audio/c/eus71019.mp3","uk_sound":"kəˈrek.ʃən","uk_link":"../audio/c/ukcorps009.mp3","content":"correction noun\n(CHANGE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a change made to something in order to correct or improve it, or the action of making such a change: She was disappointed to see her essay returned with a huge number of corrections in red ink.\n[ C or U ]\n&#160; finance &amp; economics\n&#160; specialized (also market correction) a change in prices in a financial market, especially when they go down after a period of being too high in relation to the real situation in a company, the economy, etc.: It looks like last week's correction is over and prices are going to go higher.\nMore examplesFewer examplesI must make one important correction to what you said in your introduction - I'm Belgian, not German.After you have done the corrections, could you print out the document please?I've noticed several more corrections I'd like to make to the book, if it's not too late.I have one correction for the newsletter - our phone number has changed.Make sure you do all those spelling corrections carefully before you send off the letter.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\nfiddle (around) with something\nfine-tune\nfix something up\nmess\nreconstruct\nreconstruction\nrectifiable\nrectification\nrefine\nremedy\nrevise\nscratch\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\nsort something out\ntinker\nSee more results »\ncorrection noun\n(PUNISHMENT)\n[ U ] old-fashioned punishment of a type that is intended to improve bad behaviour corrections [ plural ]\n&#160; law\n&#160; US formal\nthe set of methods available for punishing and treating people who have committed crimes: a corrections officer\nSee more\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\ngross misconduct\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsort\nsort something out\nspare the rod and spoil the child idiom\nSee more results »\nAdd to word list\nAdd to word list\na change to make something right or correct, or the act of making such changes: [ C ] I made a number of corrections to the manuscript. [ U ] Several errors in this report need correction.\nAdd to word list\nAdd to word list\nFINANCE, STOCK MARKET\n&#160; (also market correction) a change in the prices in a financial market, especially when they go down after a period when they have been too high in relation to the real situation in companies, the economy, etc.: It looks like last week's correction is over and prices are going to go higher.\nthe fact of making something, for example an amount or a calculation, more accurate: correction to sth No corrections to these figures will be allowed once the form has been submitted. See also\ntechnical correction"}