{"id":110057,"name":"corrupt","type":"adjective","us_sound":"kəˈrʌpt","us_link":"../audio/c/corrupt.mp3","uk_sound":"kəˈrʌpt","uk_link":"../audio/c/ukcorru002.mp3","content":"corrupt adjective\n(BAD)\nAdd to word list\nAdd to word list\nC1 dishonestly using your position or power to get an advantage, especially for money: Both companies are under investigation for corrupt practices. The whole system was corrupt - every official she approached wanted money before helping her.\nThesaurus: synonyms, antonyms, and examples\ndeceiving others and not telling the truth dishonestThe press called out the campaign's dishonest tactics.untrustworthyHe made the mistake of basing his news story on an untrustworthy source.deviousIt was a devious plan - but would it work?deceitfulShe's deeply deceitful and not to be trusted.\nSee more results »\nmorally bad: a corrupt society\nMore examplesFewer examplesHe called for checks to discover whether corrupt officials are being bribed to connive in shoddy construction.A powerful and corrupt elite has bled this country dry.One election cannot erase 65 years of a corrupt one-party political process.Their accusations of corruption are hypocritical - they have been just as corrupt themselves.The old corrupt, totalitarian regime was overthrown.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimpersonation\nimposture\nlaunder\nmalfeasance\nmalpractice\nnobble\npyramid scheme\nsiphon\nvishing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorally wrong and evil\ncorrupt adjective\n(ON COMPUTER)\nWhen information on a computer becomes corrupt, it cannot be used because it has changed and become wrong: corrupt data a corrupt file\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\ncorrupt verb [T]\n(MAKE BAD)\nC1 to make someone or something become dishonest or immoral: The study claimed that violence on television corrupts the minds of children.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimpersonation\nimposture\nlaunder\nmalfeasance\nmalpractice\nnobble\npyramid scheme\nsiphon\nvishing\nSee more results »\ncorrupt verb [T]\n(ON COMPUTER)\nto change information on a computer so that it is wrong and cannot be used: Most of the data on the hard drive was corrupted when the power went out.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nRelated word\ncorruptible\nAdd to word list\nAdd to word list\ndishonest and willing to use your position or power to your own advantage, esp. for money: It’s been called the most politically corrupt city in the nation.\nCorrupt also means bad: Your philosophy is corrupt. corruption noun [ U ] us\nYour browser doesn't support HTML5 audio\n/kəˈrʌp·ʃən/\npolitical corruption\nto make someone dishonest and willing to use their position or power for personal advantage, esp. to get money: Power corrupts, and absolute power corrupts absolutely. Don’t let your friends corrupt you (= have a bad moral influence on you).\nIf information in a computer is corrupted, it is damaged and can no longer be used.\nAdd to word list\nAdd to word list\nusing your position or power dishonestly or illegally for your own advantage, especially to make money: a corrupt businessman/official/manager, etc. On the advice of a corrupt financial adviser, the accused understated their income by tens of thousands of dollars. corrupt activities/practices\nIT used to describe information on a computer that has been damaged or changed in some way and cannot be used: corrupt data/files\nto influence someone into doing bad or dishonest things: It is said that power can corrupt people.\nIT to change or damage the information on a computer file so that it cannot be used: Most of the data on the hard drive was corrupted."}