{"id":109950,"name":"correspondence","type":"noun","us_sound":"ˌkɔːr.əˈspɑːn.dəns","us_link":"../audio/c/correspondence.mp3","uk_sound":"ˌkɒr.ɪˈspɒn.dəns","uk_link":"../audio/c/ukcorps018.mp3","content":"correspondence noun\n(WRITING)\nAdd to word list\nAdd to word list\n[ U ] letters, especially official or business letters: Any further correspondence should be sent to my new address.\n[ U ] the action of writing, receiving, and reading letters, especially between two people: Her correspondence with Jim lasted many years.\nSMART Vocabulary: related words and phrases\nLetters, notes and cards\naerogramme\nair letter\nbillet-doux\nchain letter\nChristmas card\nget-well card\ngreetings card\nhandbill\nhate mail\ninvitation\ninvite\njunk mail\nplace card\npoison-pen letter\npostcard\nPPS\nPS\nrejection\nround robin\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunicating & keeping in touch\ncorrespondence noun\n(MATCH)\n[ C usually singular, U ] a connection between two things: The survey found no correspondence between crime and unemployment rates.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nAdd to word list\nAdd to word list\nletters written from one person to another, or the activity of writing and receiving letters: She was behind in her correspondence, and had at least six letters to write.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMUNICATIONS written communications such as letters and emails: Keep copies of all correspondence. email/written correspondencecorrespondence between sb and sb He was ordered to supply copies of any correspondence between his office and the client in question.correspondence from/to/with sb Telephone calls and correspondence to the company were ignored. private/personal/official correspondence\n[ U ]\n&#160; COMMUNICATIONS the act of sending and receiving written communications: They entered into an agreement by correspondence.be in correspondence with sb I have been in correspondence with the bank for nearly a year about this.enter into correspondence (with sb) No correspondence will be entered into.\n[ C, usually singular ] a connection between two things: a close/direct correspondence between sth and sth There is not necessarily a direct correspondence between salary level and job satisfaction.\nSee also\ncommercial correspondence"}