{"id":110301,"name":"cosmetic","type":"noun","us_sound":"kɑːzˈmet̬.ɪk","us_link":"../audio/c/cosmetic.mp3","uk_sound":"kɒzˈmet.ɪk","uk_link":"../audio/c/ukcorru021.mp3","content":"cosmetics [ plural ]\nAdd to word list\nAdd to word list\nsubstances that you put on your face or body that are intended to improve your appearance: We sell a wide range of cosmetics and toiletries at a very reasonable price.\nSee more\ncosmetic adjective\n(NOT REAL)\ndisapproving Cosmetic changes, etc. are intended to make you believe that something is better when, really, the problem has not been solved: They were offered a few cosmetic improvements to their working conditions, but nothing of significance. Synonym\nsuperficial (FALSE APPEARANCE)\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse\nfalse modesty\nfalsifiable\nfalsify\nmountebank\nout-bluff\npass something off as something\nphoney\nphony-baloney\nprofessed\npurport\nquackery\nSee more results »\ncosmetic adjective\n(IMPROVING)\n[ before noun ] used to refer to substances or treatments that are intended to improve your appearance: a cosmetic cream\nSMART Vocabulary: related words and phrases\nBeauty treatments\naesthetic\naesthetician\nbeautician\nbeauty\nbeauty salon\nelectrolysis\nexfoliation\neye mask\nfake tan\nfiller\nFrench manicure\nFrench tip\nmicroneedling\nnail art\nrasul\nsauna\nself-tan\nsunbathe\nsunbed\nwaxing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMake-up & skin care\nRelated word\ncosmetically\nAdd to word list\nAdd to word list\n(esp. of changes and improvements) intended to improve the appearance of something without changing its basic structure; superficial: Whether the change is more cosmetic than concrete is a matter of opinion.\nAdd to word list\nAdd to word list\na cream or other substance that you put on your skin, hair, etc. in order to improve its appearance: Europe is the world's largest market for cosmetics. cosmetics industry/retailer, etc. The cosmetics industry has remained strong during the recession.\nused to describe a small change, etc. that is made in order to make something seem better than it was before, and that does not really affect its basic character: We are committed to addressing the root causes of our problems rather than making only short-term cosmetic changes.\nrelating to a substance or treatment that is used to improve someone's appearance: The popularity of cosmetic surgery continues to soar."}