{"id":110446,"name":"cost","type":"noun","us_sound":"kɑːst","us_link":"../audio/c/eus71027.mp3","uk_sound":"kɒst","uk_link":"../audio/c/ukcossa004.mp3","content":"cost noun\n(MONEY SPENT)\nAdd to word list\nAdd to word list\nA2 [ U ] the amount of money needed to buy, do, or make something: at no extra cost When you buy a new computer, you usually get software included at no extra cost (= for no additional money).cover the cost In most families, two salaries are essential to cover the cost of (= pay for) raising a family.cut the cost The supermarket chain announced that it was cutting the cost (= reducing the price) of all its fresh and frozen meat.rising cost of It's difficult for most people to deal with the rising cost of (= increasing price of) healthcare.at cost I was able to buy the damaged goods at cost (= for only the amount of money needed to produce or get the goods, without any extra money added for profit). costs [ plural ]\nthe amount of money needed for a business or to do a particular job: cut costs We need to cut our advertising costs.\nSee more\nMore examplesFewer examplesWhether or not we go to Spain for our holiday depends on the cost.Do you agree with the principle that everyone should pay something towards the cost of healthcare?The average cost of a new house has gone up by 5 percent to £76 500.Their estimate of the cost of the project was wildly inaccurate.My main concern about moving to London is the cost of housing.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\ncost noun\n(SOMETHING LOST/GIVEN)\nB2 [ S or U ] something that is given, needed, or lost in order to get a particular thing: cost in We were going to paint the house ourselves, but when we considered the cost in time and effort, we decided to get a painter to do it for us.at the cost of The driver managed not to hit the child who ran in front of his car, but only at the cost of injuring himself.at personal cost She has finally got the job she wanted, but at great personal cost (= she has had to give up other things that were important to her).to my cost UK It's not worth getting into an argument with Paula, as I learned to my cost (= from my unpleasant experience of having done so).\nMore examplesFewer examplesI didn't read the contract fully before I signed it but I'm counting the cost now.Victory in the war was achieved at the cost of great human suffering.He tried to fight for justice, but in the end the personal cost was too high.She supported the refugees at great personal cost.I discovered to my cost that he was a violent man.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nIdiom\nat all costs\ncost verb [T]\n(MONEY)\nA2 cost | cost If something costs an amount of money, you must pay that amount to buy or do it: \"How much does this book cost?\" \"It costs £25.\"it costs something to do something It costs a lot to buy a house in this part of Sydney. [ + two objects ] The trip will cost you $1,000.\nThesaurus: synonyms, antonyms, and examples\nto have a certain monetary valuecostHiring a car for the week will cost close to £300!beThe cakes were £1.50 each or two for £2.sell forThe tickets sell for £100 each. fetchThe medieval manuscript fetched a record-breaking £1.2 million at auction. go for somethingHouses around here usually go for about £500,000. set someone back (something)Phew, that ring looks like it set you back.\nSee more results »\ncosted | costed to calculate the future cost of something: My boss asked me to cost the materials for the new fence and gate.be costed (out) Has your plan been properly costed (out)?\nMore examplesFewer examples\"How much will the trip cost?\" \"No more than £40.\"Smaller cars have better mileage and so cost less to run.The repairs to our car cost much more than we were expecting.These shoes only cost £20.The projected extension to the motorway near London is going to cost over £4 million.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccounting\nEstimating value\ncost verb [T]\n(DESTROY)\nB2 cost | cost to cause someone to lose or destroy something valuable: Drinking and driving costs lives (= can cause accidents in which people die). [ + two objects ] His affairs cost him his marriage (= his marriage ended because of them).\nMore examplesFewer examplesAlcoholism cost me my job, my health and finally my family.Many of the fans believe that the omission of Heacock from the team cost England the match.Ireland squandered several chances, including a penalty that cost them the game.They won the war, although it cost them millions of lives.Writing the book cost me my job and my marriage.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nseismic\nsour\nwreck\nSee more results »\nIdioms\ncost someone dear\ncost an arm and a leg/a small fortune\nit'll cost you\ncost noun\n(MONEY)\nAdd to word list\nAdd to word list\n[ C/U ] the amount of money needed to buy, do, or make something, or an amount spent for something: [ C ] Education costs continue to rise. [ U ] Most computers come with software included at no extra cost. [ U ] The area has both high-cost and low-cost housing.\n[ C/U ] law Costs is the money given to a person who wins a legal case to pay for the cost of taking the matter to a law court.\ncost noun\n(SOMETHING GIVEN OR LOST)\n[ U ] that which is given, needed, or lost in order to obtain something: He supported the refugees at great personal cost. Idioms\nat any cost\nat cost\ncost (someone) an arm and a leg\ncost verb [T]\n(PAY MONEY)\nto need you to pay a particular amount of money in order for you to buy or do something: The trip will cost (you) $1000. It costs a lot to buy a house these days.\ncost verb [T]\n(GIVE OR LOSE SOMETHING)\nto be forced to give or lose something in order to obtain something: If you give him a chance to hit the ball, it could cost you the ballgame.\nAdd to word list\nAdd to word list\n[ C or U ] money that has to be spent in order to buy, do, or make something: Some people are reluctant to seek the help of a financial adviser because of the cost.the cost of (doing) sth What's the cost of an international call?cut/lower/reduce the cost If states shared the risk of catastrophic events, this would lower the cost for policyholders.increase/raise/push up the cost New standards will increase the cost of making and selling diesel vehicles.the cost increases/rises/goes up Raw material costs have risen faster than expected.the cost goes down/drops/falls The cost of farm subsidies is expected to fall thanks to large exports and healthy prices.an increase/rise in the cost of sth an increase in the cost of goods and servicestravel/childcare/healthcare costs All travel costs will be reimbursed by your employer.legal/medical/insurance costs Republican candidates offered tax credits to lower health insurance costs.high/rising/spiralling cost(s) Spiralling fuel costs have hit motorists hard.additional/average/extra cost The average cost of insuring a family car in 2011 was £360.estimated/projected cost Total projected cost is $2.5 billion.cover/pay/meet the cost A one-off disposal fee covers the cost of collection and recyclingat a cost of $4 billion/£150,000, etc. plans to build ten new power stations at a cost of £2 billion eachthe cost to sb \"What will the cost to taxpayers be?\" is the question on everyone's lips. Strategic alliances can provide growth at a fraction of the cost of going it alone. Apartments in Brooklyn often sell at half the cost of apartments in Manhattan.\ncosts [ plural ]\nmoney that a company or organization has to spend regularly: Company legislation deals with key issues such as costs, advertising, and promotional spend.the costs of (doing) sth Small companies find it hard to bear the costs of promotion and distribution.cut/reduce/rein in costs There was a drive to cut costs by using fewer suppliers.high/rising/escalating costs Escalating costs have adversely affected profits. increase/rise in costs Technological advances have sparked most of the rise in costs, industry analysts claimed.reduction in costs A reduction in costs should help boost end-of-year figures. administrative/labour/production costs energy/fuel costsadditional/actual/extra costs The OFT said yesterday that credit card providers could only charge for the actual costs of processing late payments.incur costs Adequate compensation should be provided for any costs incurred.cover/recover/recoup costs Because private farmers can't recoup their costs, they are cutting production.costs rise/go up/increase Staff costs have risen by 20% in the past two years.costs come/go down Alternative energy sources will become more widely used as costs come down.\n[ U ]\n&#160; ACCOUNTING the amount of money that is spent to produce goods or services, before any profit is added for the manufacturer or producer: Mass-market retailers often sell items such as bread and milk at cost to pull in customers. Supermarkets were accused of encouraging irresponsible drinking by selling beer and cider at below cost. See also\ncost price\n[ C ]\n&#160; ACCOUNTING an amount of money that a company has to pay and that appears in its accounts: The amount paid for the lease should be entered as a cost in the profit and loss account. The depreciation of the value of equipment is treated as a cost.\n[ S or U ] something that is given, needed or lost in order to get a particular thing: cost to sb/sth We will help you run your business with less cost to the environment.at a cost to sth She continued in the job, but at a great cost to her health.cost in sth They felt that continuing with the project was not worth the cost in time and effort. considerable/enormous/great cost\ncosts [ plural ] (also legal costs)\nLAW the money that helps pay for the lawyers and the court in a legal case, usually paid by the person or organization that has lost the case: They were fined $50,000 and ordered to pay $10,000 in costs. See also\naccrued cost\nacquisition cost\nbid costs\ncarrying cost\nconversion cost\ncurrent cost\ncustomer acquisition cost\ndepreciated cost\ndirect cost\ndiscretionary costs\neconomic cost\nemployment costs\nfactor cost\nfactory cost\nfirst cost\nfixed cost\nhard cost\nhigh-cost\nhistoric cost\nholding cost\nincremental cost\nindirect cost\ncost price\nlife cycle cost\nlow-cost\nmarginal cost\noperating cost\nopportunity cost\noverhead cost\nprime cost\nreal cost\nreplacement cost\nrestructuring cost\nrunning cost\nselling cost\nset-up cost\nsocial cost\nsoft cost\nstandard cost\nstandby cost\nstart-up cost\nsunk cost\nswitching cost\ntransaction cost\nunit cost\nvariable cost\ncost | cost if something costs a particular amount of money, you have to pay that amount in order to buy or have it: cost $1 million/£500,000, etc. Calls cost 60 cents per minute.cost sb $1 million/£500,00, etc. Deregulation allowed the company to fix electricity prices, costing consumers billions of dollars.cost more/less than Stamp duty is up to 3% on properties costing more than £250,000.cost about/around/up to luxury apartments costing up to £900,000 eachbe expected/estimated to cost The project, which was originally expected to cost $1 billion, is now estimated at $1.8 billioncost as little/much as Hundreds of items, some costing as little as $1, are for sale.\nif something costs you your job, an opportunity, etc. it prevents you from keeping or having it: The airline folded, costing 3.000 jobs.cost sb sth Problems with our suppliers could cost us the opportunity to grow our business.\nACCOUNTING\n&#160; costed to calculate the price of something or to decide how much it will cost: Has the project been costed yet?cost sth at The new rail line was costed at £150 billion.\ncost (sb) a fortune/a bomb/the earth informal\nto be very expensive: The court case will cost the company a fortune."}