{"id":110791,"name":"cough","type":"verb","us_sound":"kɑːf","us_link":"../audio/c/cough.mp3","uk_sound":"kɒf","uk_link":"../audio/c/ukcossa026.mp3","content":"Add to word list\nAdd to word list\nB1 to force air out of your lungs through your throat with a short, loud sound: The smoke made me cough. I coughed all night long.\nto make a sound like a cough: The car engine coughed a few times, but wouldn't start.\nMore examplesFewer examplesShe took too big a gulp of whisky and started to cough and splutter.He coughed loudly to warn them he was coming.She is coughing terribly.Some idiot coughed all the way through the concert.The smoke made me cough.\nSMART Vocabulary: related words and phrases\nNoises made by the body\nbelch\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnorer\nsnoring\nsnort\nwheeze\nwind\nyawn\nSee more results »\nPhrasal verbs\ncough something up\ncough (something) up\nB1 the act of coughing, or the sound this makes: a dry cough (= one that does not produce mucus) a hacking (= very bad and loud) cough\nan illness that makes you cough a lot: a smoker's cough Emily has a very bad/nasty cough.\nMore examplesFewer examplesYou should see a doctor about that cough.I'm sorry - is my cough annoying you?Symptoms of the illness include a high temperature and a persistent dry cough.Have you seen a quack about that cough?The cough, wheeze and shortness of breath are things that go with smoking, not with age.\nSMART Vocabulary: related words and phrases\nNoises made by the body\nbelch\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnorer\nsnoring\nsnort\nwheeze\nwind\nyawn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColds & flu\nAdd to word list\nAdd to word list\nto force air out of your lungs through your throat with a short, loud sound, often unwillingly: The smoke from the bonfire made me cough. fig. The car engine coughed a few times, but wouldn’t start. Phrasal verbs\ncough up something\ncough up something\nan act of forcing air out of your lungs through your throat with a short, loud sound, often unwillingly: a dry cough There are lots of coughs and colds going around this winter."}