{"id":110804,"name":"could","type":"modal verb","us_sound":"kʊd","us_link":"../audio/c/could.mp3","uk_sound":"kʊd","uk_link":"../audio/c/ukcossa027.mp3","content":"could modal verb\n(CAN)\nAdd to word list\nAdd to word list\nA2 past simple of \"can\", used to talk about what someone or something was able or allowed to do: When I was younger I could stay up all night and not get tired. It was so noisy that we couldn't hear ourselves speak. You said we could watch TV when we finished our homework. We asked if the computer could access the internet.\nMore examplesFewer examplesShe walked off before I could say anything.I could never have achieved this without the encouragement of my husband and family.I could see by the look on their faces that something was wrong.I wish I could find (the) time to do more reading.Even when you win a match you always feel you could have played better.\ncould modal verb\n(PERMISSION)\nB1 used as a more polite form of \"can\" when asking for permission: Could I speak to Mr Davis, please? Excuse me, could I just say something?\nMore examplesFewer examplesCould I borrow your pen?Could we see her now, please?Could I have some more pudding?Could I use your bathroom, please?Could I leave the children with you this morning?\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\nmagic word\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon (me) idiom\nproblem\nsay\nthank you\nwelcome\nwonder\nwould\nyou're welcome idiom\nSee more results »\ncould modal verb\n(REQUEST)\nA2 used as a more polite form of \"can\" when asking someone to provide something or do something: Could you lend me £5? Could you turn that music down a little, please?\nMore examplesFewer examplesPlease could you explain why you're so late.I'm frozen - could you close the window?I've got rather a full week next week - could we postpone our meeting?If you could get that report finished by Thursday I'd be very grateful.Ben, could you hand round the biscuits?\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nticket\nSee more results »\ncould modal verb\n(POSSIBILITY)\nB1 used to express possibility, especially slight or uncertain possibility: A lot of crime could be prevented. She could arrive anytime now. This new drug could be an important step in the fight against cancer.could have Be careful with that stick - you could have hit your sister!\nMore examplesFewer examplesPassengers could face long delays.The temperature could fall below zero overnight.You could be the Queen of England, for all I care - you're not coming in here without a ticket.Anything could happen in the next half hour.It is not inconceivable that she could be lying.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\ncould modal verb\n(SUGGESTION)\nB1 used for making a suggestion: We could go out for a drink after work tomorrow, if you want.could always You could always call Susie and see if she will babysit.\nMore examplesFewer examplesYou could offer to buy her a new one.Could you get a bigger house?We could try mending it with glue.I could look after Toby for you.We could have lunch one day.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\ncould modal verb\n(SHOULD)\nused for saying, especially angrily, what you think someone else should do: Well, you could try to look a little more enthusiastic! I waited ages for you - you could have said that you weren't coming!\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nGrammar\nCouldCould comes first in the verb phrase (after the subject and before another verb): …\nCould: formCould comes first in the verb phrase (after the subject and before another verb): …\nCould: usesWe often use could to express possibility in the present and the future. …\nCould: pastWe don’t usually use could to talk about single events that happened in the past. …\nCould, may and mightWe use could, may and might to express degrees of possibility. Many native speakers disagree on which one expresses more or less certainty. …\nCan, could or may: typical errorsCould in the present only expresses weak possibility. Can expresses strong possibility: …\nIdiom\ncould do with something\ncould\n(CAN)\nAdd to word list\nAdd to word list\npast simple of can: You said we could watch television when we finished our homework. When I was younger I could stay up all night and then go to work. Idioms\ncould care less\ncould have died\ncould use\ncould modal verb\n(ASK PERMISSION)\npresent tense could used as a more polite form of can when asking for permission: Could I speak to Mr. Harley, please?\ncould modal verb\n(REQUEST)\npresent tense could used as a more polite form of can when making a request: Could you lend me $5?\ncould modal verb\n(BE POSSIBLE)\nused to express possibility, esp. slight or uncertain possibility: A lot of these problems could be prevented. It could be days before we hear from her. I could have been an actor.\ncould modal verb\n(SUGGEST)\npresent tense could used for making a suggestion: We could go to the movies.\ncould modal verb\n(SHOULD)\npresent tense could used for saying what you think someone else should do: You could try to look a little more enthusiastic."}