{"id":110945,"name":"counterattack","type":"noun","us_sound":"ˈkaʊn.t̬ɚ.ə.tæk","us_link":"../audio/c/counterattack.mp3","uk_sound":"ˈkaʊn.tər.ə.tæk","uk_link":"../audio/c/ukcounc011.mp3","content":"Add to word list\nAdd to word list\nan attack intended to stop or oppose an attack by an enemy: The military expects insurgents to mount a counterattack on supply lines. He ordered a swift counterattack against the invaders.\nin politics, etc., criticism or arguments intended to stop or oppose someone who has opposed or criticized you : The Republicans have still not been able to launch a strong counterattack against the new healthcare system. There were questions about his integrity, but he always had an explanation - and a counterattack.\nin sports, a move forward in an attempt to score points, goals, etc., at a time when your opponent is moving in the opposite direction or trying to score: Birmingham City were caught out by a counterattack in the last minute of the game.\nan action in business intended to stop or oppose an action against you by a competitor: The tech giant launched a counterattack against its rival.\nMore examplesFewer examplesA counterattack by the Germans later in the day forced the division to relinquish many of its gains.Coal advocates face a counterattack from environmentalists in the debate over global warming.The speed of South Africa's counterattacks in the second half was impressive.The company's strategy was designed as a counterattack against Biolab's stock action.\nSMART Vocabulary: related words and phrases\nResponding to an attack\nbeat\nbeat someone off\nbeat someone/something back\ncapitulate\ncounter-assault\ncountercharge\nfend someone off\nfight\nhold\nparry\npull\npull back\nrefight\nrepel\nrepulse\nresist\nresistance\nstrike\nward someone/something off\nwhite flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding\nWinning, losing & scoring in sport\nBusiness - general words\nMergers & acquisitions\nto attack an enemy in order to stop or oppose their attack on you: The air force counterattacked and repelled the invasion.\nto criticize or argue against an opponent who has criticized or opposed you: Mr Deforge counterattacked by bringing charges for defamation.\nin sports, to move forward in an attempt to score points, goals, etc., at a time when your opponent is moving forward or trying to score: We have the ability to catch teams out by counterattacking with speed.\nto take action against a competitor in business who has taken action against you: Engineers from a rival company counterattacked with a new product.\nMore examplesFewer examplesThe American commodore counterattacked and forced the British to surrender.The enemy fired machineguns, and we counterattacked them.The Senator counterattacked, saying that the controversy \"has revealed just how far we've fallen in our culture.\"They have counterattacked the media for publishing baseless accusations.England were lucky not to concede a goal when the Scots counterattacked.\nSMART Vocabulary: related words and phrases\nResponding to an attack\nbeat\nbeat someone off\nbeat someone/something back\ncapitulate\ncounter-assault\ncountercharge\nfend someone off\nfight\nhold\nparry\npull\npull back\nrefight\nrepel\nrepulse\nresist\nresistance\nstrike\nward someone/something off\nwhite flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnswering & responding\nWinning, losing & scoring in sport\nBusiness - general words\nMergers & acquisitions\nAdd to word list\nAdd to word list\nan attack intended to stop or oppose an attack by an enemy or competitor counterattack verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑʊn·tər·əˌtæk/\nFaced with a lawsuit for negligence, he counterattacked by filing charges against his accusers."}