{"id":111508,"name":"county","type":"noun","us_sound":"ˈkaʊn.t̬i","us_link":"../audio/c/eus71060.mp3","uk_sound":"ˈkaʊn.ti","uk_link":"../audio/c/ukcount016.mp3","content":"Add to word list\nAdd to word list\nB2 a political division of the UK or Ireland, forming the largest unit of local government, or the largest political division of a state in the US: County Antrim A county usually consists of several towns and the rural areas that surround them. Rutland is the smallest county in England. Texas is divided into 254 counties.\nMore examplesFewer examplesBinns was a dab hand at cricket and played for his county in his youth.Our school won the county football shield this year.The county Board of Education has decided to cancel high school gymnastics and golf programs.Bounded on the east by Lake Winnebago, the county is traversed by the Wolf and Fox rivers.Judge Davis upheld the county court's decision.\nSMART Vocabulary: related words and phrases\nUK politics: local government & politics\nadministrative\nalderman\nalderwoman\nanti-city\nauthority\ncouncilmember\ncouncilwoman\ncounty borough\ncounty council\ndevelopment area\nenterprise zone\nmunicipality\nparish\nparish council\nparochial\nprefecture\nshire\nthe North-South divide\nunitary\nunitary authority\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nbehaving in a way that is typical of rich people with a high social position who live in large houses in the countryside: She mixes with a very county set.\nSMART Vocabulary: related words and phrases\nRich people\nadvantaged\nballer\nbeautiful\nchampagne socialist\ndeb\nelite\nfat cat\ngilded\nmagnate\nmillionairess\nmulti-millionairess\nnouveau riche\npreppy\nscion\nsocialite\nsquattocracy\nsquillionaire\ntax exile\nthe jet set\nyuppify\nSee more results »\nAdd to word list\nAdd to word list\nthe largest political division of most states in the US: Texas is divided into 254 counties."}