{"id":111523,"name":"country","type":"noun","us_sound":"ˈkʌn.tri","us_link":"../audio/c/country.mp3","uk_sound":"ˈkʌn.tri","uk_link":"../audio/c/ukcount012.mp3","content":"country noun\n(POLITICAL UNIT)\nAdd to word list\nAdd to word list\nA1 [ C ] an area of land that has its own government, army, etc.: What is the largest country in Europe? Sri Lanka is my native country, but I've been living in Belgium for the past five years. The climate is cooler in the east of the country. the country\nC2 all the people who live in a country: The whole country celebrated the signing of the peace treaty.\nMore examplesFewer examplesAfter ten years of military dictatorship, the country now has a civil government.French cheeses are exported to many different countries.The Arab countries include Iraq, Saudi Arabia, Syria, and Egypt.The government has done little or nothing to help the poorest people in this country.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\ncountry noun\n(NATURAL LAND)\nA2 [ S or U ] land that is not in towns, cities, or industrial areas and is either used for farming or left in its natural condition: in the country He lives out in the country somewhere. Would you prefer to live in the country instead of a town? Country life isn't always as peaceful as city-dwellers think.across country It's often quicker to travel across country and avoid the major roads completely.\nMore examplesFewer examplesWe would dearly love to sell our flat and move to the country.Five soldiers died after their bus was ambushed on a country road.They have a house in the country and a flat in London.I found not having a car quite a handicap when I was living in the country.We spent a luxurious weekend at a hotel in the country.\nSMART Vocabulary: related words and phrases\nTowns & regions: the countryside\nAONB\nArea of Outstanding Natural Beauty\nbackcountry\nbeauty spot\ncountrified\ncountryman\ncountrywoman\ngreenfield\ngreenfield site\nhillbilly\nhinterland\nlandscape\nrural\nrusticity\nstick\nthe backwoods\nupstate\nwild\nwoodsy\nyokel\nSee more results »\ncountry noun\n(PARTICULAR AREA)\n[ U ] an area of land considered in relation to a particular feature: Stratford-upon-Avon is the capital of Shakespeare country. The empty roads make this area good cycling country.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\ndry land\necoregion\nenclosure\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntransect\nSee more results »\ncountry noun\n(MUSIC)\n[ U ] short form of\ncountry music\nSMART Vocabulary: related words and phrases\nFolk & ethnic music\nbandura\nbluegrass\ncountry and western\ncountry music\nfolk\nfolk rock\nfolk song\nhornpipe\nmahonia\nraga\nsession\nskiffle\nskirl\nthroat singing\nGrammar\nGeographical placesWe use the before the names of rivers. We usually write the without a capital letter. If we use the word river, we usually write it without a capital letter: the river Thames, the river Severn, the Yangtze river. …\nNationalities, languages, countries and regionsWhen we refer to a nation or region, we can use: …\nIdioms\nacross country\ngo to the country\ncountry noun\n(POLITICAL UNIT)\nAdd to word list\nAdd to word list\n[ C ] an area of land that forms an independent political unit with its own government; a nation considered esp. as a place: Cuba is my native country, but I now live in Florida.\ncountry noun\n(NATURAL LAND)\n[ U ] land that is not in towns, cities, or industrial areas and is either used for farming or left in its natural condition: I’m spending next weekend in the country with a friend."}