{"id":110880,"name":"counsellor","type":"noun","us_sound":"ˈkaʊn.səl.ɚ","us_link":"../audio/c/counselor.mp3","uk_sound":"ˈkaʊn.səl.ər","uk_link":"../audio/c/ukcossa030.mp3","content":"Add to word list\nAdd to word list\nC2 someone who is trained to listen to people and give them advice about their problems: The college now has a counsellor to help students with both personal and work problems. a marriage guidance counsellor\nC2 US a lawyer: [ as form of address ] I don't think that question is relevant, counselor.\nUS someone who takes care of children at a summer camp\nMore examplesFewer examplesThe doctor suggested that I might like to see a counsellor to help me deal with stress better.A trained counsellor can provide non-judgmental support, as often it is hard to speak openly to family and friends.My colleague found that his sessions with the grief counsellor helped him work through his feelings.There's an excellent counsellor at the alternative health clinic in town, and you can get various therapies there too.He thinks people are too soft these days and that we'd be better off without all these counsellors and therapists.He hired Jeffrys as his counselor.His counselor made the case very forcibly.\nSMART Vocabulary: related words and phrases\nCounselling & psychotherapy\nabreact\nabreaction\nanalyst\nbehaviour modification\nbehaviour therapy\ncognitive behavioural therapy\ncognitive therapy\ngroup therapy\nmarriage guidance\nnon-directive\nproactive aggression\npsychoanalyst\npsychotherapy\nreactive aggression\nself-harm\nself-harming\nsex therapy\nstress management\ntough love\nvictim support\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving advice\nLawyers & legal officials\nParenting & caring for children\nAdd to word list\nAdd to word list\na person who has been trained to do the job of listening to people who have problems or who want to achieve something, and giving them advice: An employment counselor helps individual clients to set goals for themselves in education, training and employment. See also\ncareer counsellor\ncommercial counsellor\ndebt counsellor"}