{"id":111090,"name":"counterfactual","type":"adjective","us_sound":"ˌkaʊn.t̬ɚˈfæk.tʃu.əl","us_link":"../audio/c/cdo0318uscoun1151.mp3","uk_sound":"ˌkaʊn.təˈfæk.tʃu.əl","uk_link":"../audio/c/cdo0216counuk0461.mp3","content":"Add to word list\nAdd to word list\nthinking about what did not happen but could have happened, or relating to this kind of thinking: Thoughts about how an embarrassing event might have turned out differently are known to psychologists as counterfactual thinking.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nlet me see/let's see idiom\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nsomething such as piece of writing or an argument that considers what would have been the result if events had happened in a different way to how they actually happened: One approach is to consider a counterfactual: what if the wave of global trade liberalization that began after the second world war had never taken place?\nMore examplesFewer examplesThey compare actual income distributions in 2018 to a counterfactual that assumes incomes had continued to keep pace with growth in per capita Gross Domestic Product (GDP).We can solve this missing data problem by constructing counterfactuals: how much a college graduate would earn if she had chosen to be a high school graduate. You can't prove a counterfactual such as the claim that if there had been video, that officer never would have been charged. A counterfactual is a mental simulation where you think about something that happened, and then imagine an alternate ending.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nmanifesting\nreach\nrevisualization\nriot\nrun riot idiom\ntheorize\nthink of something\nthrow\nvision\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuesses and assumptions"}