{"id":111095,"name":"counterfeit","type":"adjective","us_sound":"ˈkaʊn.t̬ɚ.fɪt","us_link":"../audio/c/counterfeit.mp3","uk_sound":"ˈkaʊn.tə.fɪt","uk_link":"../audio/c/ukcounc019.mp3","content":"Add to word list\nAdd to word list\nmade to look like the original of something, usually for dishonest or illegal purposes: counterfeit jewellery/passports/coins Synonym\nfake Opposites\ngenuine\nreal\nSMART Vocabulary: related words and phrases\nForgery\nanti-counterfeiting\nanti-piracy\nbootleg\nfake\nfaker\nforge\nforgery\nhijack\nhijacking\nknock off (something)\npiracy\npirate\npirated\nplagiarism\nplagiarize\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nTrue, real, false, and unreal\nRelated word\ncounterfeiter\nsomething that is made to look like the original of something else, usually for dishonest or illegal purposes: This watch may be a counterfeit, but it looks just like the original. Inspect the tickets carefully for possible counterfeits. Synonyms\nfake (PERSON OR OBJECT)\nforgeryOpposite\noriginal\nMore examplesFewer examplesThe agency has an electronic database to help them compare genuine medications against suspected counterfeits.Investors bought wines from the top chateaux which turned out to be worthless counterfeits. Employers are not expected to be experts in detecting counterfeits.\nSMART Vocabulary: related words and phrases\nForgery\nanti-counterfeiting\nanti-piracy\nbootleg\nfake\nfaker\nforge\nforgery\nhijack\nhijacking\nknock off (something)\npiracy\npirate\npirated\nplagiarism\nplagiarize\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nto make something look like the original of something else, usually for dishonest or illegal purposes: Two women and a man have been convicted of counterfeiting $100 bills. We have made it significantly more difficult for them to counterfeit this document. Synonym\nforge (COPY)\nMore examplesFewer examples49 percent of respondents were aware that drugs and other medicines are counterfeited.The brothers were surprisingly skilled at the fine detail work required to counterfeit coins.The department added high-tech features designed to make it more difficult to counterfeit the note.\nSMART Vocabulary: related words and phrases\nForgery\nanti-counterfeiting\nanti-piracy\nbootleg\nfake\nfaker\nforge\nforgery\nhijack\nhijacking\nknock off (something)\npiracy\npirate\npirated\nplagiarism\nplagiarize\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nAdd to word list\nAdd to word list\ncopied exactly in order to make someone believe that the copy is the original: A lot of brand-name merchandise sold on the streets is counterfeit. counterfeit noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑʊn·tərˌfɪt/\nThe bank said this $100 bill was a counterfeit. counterfeit verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkɑʊn·tərˌfɪt/\nThey were accused of counterfeiting credit cards and selling them.\nAdd to word list\nAdd to word list\ncounterfeit money, goods, etc. are illegal copies of the real thing, made to deceive people: counterfeit bills/notes/software Counterfeit card fraud is a growing problem. At least 41% of the drugs in circulation were thought to be counterfeit.\nto make illegal copies of something such as bank notes, DVDs, or official documents: Criminals can empty bank accounts by accessing consumer PIN numbers and counterfeiting cards.\nan illegal copy of something such as a bank note, DVD, or official document: Many of the watches sold on the market are counterfeits."}