{"id":110871,"name":"counsel","type":"verb","us_sound":"ˈkaʊn.səl","us_link":"../audio/c/council.mp3","uk_sound":"ˈkaʊn.səl","uk_link":"../audio/c/ukcossa029.mp3","content":"Add to word list\nAdd to word list\nto give advice, especially on social or personal problems: The police have provided experts to counsel local people affected by the tragedy. My job involves counselling unemployed people on/about how to find work. Compare\nadvise\nThesaurus: synonyms, antonyms, and examples\nto give someone advicegive adviceCan you give me some advice about what to wear?adviseThe doctor advised me to get plenty of rest.counselHe counselled the young man to keep his silence.recommendDoctors recommend regular exercise.advocateI would advocate a system that is fair to everyone.\nSee more results »\nSMART Vocabulary: related words and phrases\nCounselling & psychotherapy\nabreact\nabreaction\nanalyst\nbehaviour modification\nbehaviour therapy\ncognitive behavioural therapy\ncognitive therapy\ncounsellor\ngroup therapy\nmarriage guidance\nnon-directive\nproactive aggression\npsychoanalyst\nreactive aggression\nself-harm\nself-harming\nsex therapy\nstress management\ntough love\nvictim support\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving advice\n[ U ] formal advice: I should have listened to my father's wise counsel, and saved some money instead of spending it all. Synonym\nadvice\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nC2 [ S ]\n&#160; law\n&#160; specialized one or more of the lawyers taking part in a legal case: The judge addressed counsel. Counsel for the defence (= the lawyer giving advice to the accused person) argued convincingly that his client was not guilty.\nMore examplesFewer examplesHis conviction was quashed in March 1986 after his counsel argued that the police evidence was a tissue of lies.From 1940 to 1943, he was general counsel of the House committee investigating un-American activities.He provided wise counsel to the young boys in his care.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nagony uncle\nbrain trust\nclinic\nconsultant\nconsulting\ncounselling\nMonday-morning quarterback idiom\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\nsteer\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLawyers & legal officials\nIdioms\na/the counsel of despair\nkeep your own counsel\nAdd to word list\nAdd to word list\nto give advice, esp. on social or personal problems: He was counseling athletes not to take steroids.\nadvice: The president sought counsel from his advisers.\nlaw Counsel is one or more of the lawyers taking part in a case or legally representing a person or organization: Maloney skipped the meeting on the advice of counsel.\nAdd to word list\nAdd to word list\na lawyer or group of lawyers whose job is to speak for someone in a court of law: defence counsel/counsel for the defence prosecuting counsel/counsel for the prosecution\nUS a person or group of people whose job is to give legal advice to a company or large organization: counsel for/to sb/sth She acts as tax counsel for the National Association of Realtors. Dent later became White House counsel to the president. See also\ngeneral counsel"}