{"id":110853,"name":"council","type":"noun","us_sound":"ˈkaʊn.səl","us_link":"../audio/c/council.mp3","uk_sound":"ˈkaʊn.səl","uk_link":"../audio/c/ukcossa029.mp3","content":"Add to word list\nAdd to word list\na group of people elected or chosen to make decisions or give advice on a particular subject, to represent a particular group of people, or to run a particular organization: the United Nations Security Council This play is supported by a grant from the local arts council.\nB2 the group of people elected to govern a particular area, town, or city, and organize services for it: Edinburgh City Council The town/city council is/are responsible for keeping the streets clean.UK The local council has/have decided not to allocate funds for the project.\nMore examplesFewer examplesThe local council has remained deaf to all the objections to its proposals.The local council has decreed that the hospital should close.The council is encouraging the development of the property for both employment and recreation.They've been engaged in a legal battle with the council for several months.The council is to examine ways of reducing traffic in the city centre.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncounter-power\ndean\ndeputy\ndominatrix\nmistress\nmovers and shakers\nmulti-headed\nofficer\nofficialdom\nvice presidency\nvice president\nvicegerency\nvicegerent\nwarden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: local government & politics\nAdd to word list\nAdd to word list\na group of people elected or chosen to make decisions or give advice on a particular subject, to represent a particular group of people, or to run a particular organization: the UN Security Council The council is being pressured to approve the plan.\nAdd to word list\nAdd to word list\na group of people who are responsible for making official decisions about a particular activity or advising people about something: the UN security council a council meeting/member a governing/ruling councilsit on/serve on/be elected to a council Solomon, an accountant from Portland, has been elected to the five-member investment council.\nGOVERNMENT in the UK, an organization consisting of people who have been elected to govern a town, city, or area: Councils can no longer fund all the services for which they are responsible. a local/town/city council a council member/meeting/workersit on/serve/be elected to a council Councillor Jim McCabe has sat on the local council for over 20 years.\nGOVERNMENT in the US, a group of people who have been elected to govern a city: A bill was passed by the council banning the dumping of waste within city boundaries. The city council vetoed the budget proposal. a council meeting/membersit on/serve on/be elected to a council The current mayor was first elected to the council in 2009. See also\nworks council"}