{"id":111548,"name":"coupe","type":"noun","us_sound":"kuːp","us_link":"../audio/c/cdo0123uscoup0639.mp3","uk_sound":"kuːp","uk_link":"../audio/c/cdo0123ukcoup0808.mp3","content":"Add to word list\nAdd to word list\na glass, used especially for some alcoholic drinks, with a wide, shallow bowl (= the round part that holds the drink) and a stem (= a thin vertical part between the base and the bowl): He brought her a foamy cocktail served in a coupe. a champagne coupe We decided to begin the evening with a coupe of champagne.\nanother spelling of\ncoupé\nMore examplesFewer examplesTry serving desserts in a stemmed glass such as a coupe.In my opinion, the champagne coupe is far more pleasurable than the common flute.Two coupes of Dom Perignon, please.\nSMART Vocabulary: related words and phrases\nDishes, bowls, cups & glasses\nballon\nbeaker\nbowl of something\ncake stand\nchafing dish\ncrock\nfinger bowl\nflute\nglassware\ngo-cup\ngoblet\nsalver\nsaucer\nserving board\nside dish\nside plate\ntumbler\ntureen\nwashbowl\nwine glass\nSee more results »\na car with a fixed roof, two doors, two or four seats, and usually a sloping back: The model is available as a three-door hatchback or coupé. He drove a BMW coupe.\nFrederic Pitchal/Sygma/Sygma/GettyImages\nin the past, a closed vehicle pulled by a horse, with seats for two passengers facing forwards: The driver stopped the horse and a great personage stepped from the coupé. The horse-drawn coupe was considered ideal for women to use to pay social calls.\nMore examplesFewer examplesThis car looks like no other sports coupé.The magazine cover had a picture of a Renault Coupé, which was currently in development.This was the top-selling small coupe for four years running.The distinctive coupe body style puts stylishness and sportiness before practicality.\nSMART Vocabulary: related words and phrases\nCars\n4×4\nall-wheel drive\nartic\nautomobile\nbanger\nbeetle\nblack cab\nclassic car\ncrock\nhardtop\nJeep\nMerc\nMk\nsport utility vehicle\nsportily\nstation wagon\nstock car\nsupercar\ntown car\ntuktuk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCarriages & carts"}