{"id":111567,"name":"coupon","type":"noun","us_sound":"ˈkuː.pɑːn","us_link":"../audio/c/coupon.mp3","uk_sound":"ˈkuː.pɒn","uk_link":"../audio/c/ukcount025.mp3","content":"Add to word list\nAdd to word list\na piece of paper that can be used to get something without paying for it, or at a reduced price: If you collect ten coupons from the newspaper, you can get a free beach towel.\nUK a piece of paper, especially a part of an advertisement in a newspaper or magazine, that a reader can send to an organization in order to get information about its products or services: To find out more about our products, fill in the coupon and send it to us at the address given below.\nsdominick/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nAdvertising and marketing\nad\nad agency\nadman\nadverse publicity\nadvert\ndetoxify\ndifferentiator\ndogfooding\nflyer\nfreesheet\no.n.o.\non-brand\noverexpose\noverexposure\noverhype\ntout\nunadvertised\nunbilled\nunbranded\nunmarketable\nSee more results »\nAdd to word list\nAdd to word list\na piece of paper that you can use to buy a product or service at a reduced price or to get it free, or to get information: Send in this coupon with your name and address for a free travel brochure. You can collect points from the soda bottles and use them to get discount coupons.\nAdd to word list\nAdd to word list\nCOMMERCE a piece of paper or card that customers can use to buy goods and services at a lower price, or to get them free: This week shoppers can use discount coupons to get money off gasoline.cut out/clip a coupon Clip this coupon for $10 off your next purchase. money-saving/money-off coupons\nFINANCE\n&#160; (also coupon rate) the rate of interest that is paid on a bond: The bonds have a coupon of 6.25 per cent. a high-coupon/low-coupon bond\nFINANCE a part of a printed bond that can be separated from it when the bond's owner wants to be paid interest by the issuer (= organization from which it was bought): The Securities of this series are issuable only in registered form without coupons in denominations of $1,000.\nSee also\ninternational reply coupon\nzero coupon bond"}