{"id":111555,"name":"couple","type":"noun","us_sound":"ˈkʌp.əl","us_link":"../audio/c/couple.mp3","uk_sound":"ˈkʌp.əl","uk_link":"../audio/c/ukcount022.mp3","content":"couple noun\n(SOME)\nAdd to word list\nAdd to word list\nB1 [ S ] two or a few things that are similar or the same, or two or a few people who are in some way connected: The doctor said my leg should be better in a couple of days. A couple of people objected to the proposal, but the vast majority approved of it. We'll have to wait another couple of hours for the paint to dry. She'll be retiring in a couple more years. The weather's been terrible for the last couple of days. Many economists expect unemployment to fall over the next couple of months. I'm sorry I didn't call you, but I've been very busy over the past couple of weeks.\nMore examplesFewer examplesTake a couple of steps backwards.She lived in Rome for a couple of years, where she taught English.Take a couple of weeks off - you need a break.The getaway car was abandoned a couple of kilometres from the scene of the robbery.There's not much in the way of entertainment in this town - just the cinema and a couple of pubs.\nSMART Vocabulary: related words and phrases\nNumbers: groups of things according to number\nbaker's dozen\nbrace\ncompanion\ndozen\ndyad\ndyadic\ngross\nnull\npair\nquaternity\nscore\ntriad\ntrinity\ntrio\ntwosome\ncouple noun\n(TWO PEOPLE)\nB1 [ C, + sing/pl verb ] two people who are married or in a romantic or sexual relationship, or two people who are together for a particular purpose: a married couple An elderly couple live (US lives) next door. Should the government do more to help young couples buy their own homes? The couple skated spectacularly throughout the competition.\nMore examplesFewer examplesA fashionable couple posed elegantly at the next table.Lawyers for the couple have announced that they are starting divorce proceedings.It's normal for couples to argue now and then.Margot and Tom seem like a very happy couple - have they been married long?All the other guests at the party were couples, and I felt rather strange on my own.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\ncouple verb\n(JOIN)\n[ T usually passive, usually + adv/prep ] to join or combine: The sleeping car and restaurant car were coupled together. High inflation coupled with low output spells disaster for the government in the election.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\ncouple verb\n(HAVE SEX)\n[ I ] formal When two people or two animals couple, they have sex.\ncouple noun\n(SOME)\nAdd to word list\nAdd to word list\n[ U ] two or a few things that are similar or the same, or two or a few people who are in some way connected: I’m packing a couple of sweaters in case it gets cold.\ncouple noun\n(TWO PEOPLE)\n[ C ] two people who are married or who spend a lot of time together esp. in a romantic relationship: We’re having two couples over for dinner."}