{"id":111634,"name":"courtesy","type":"noun","us_sound":"ˈkɝː.t̬ə.si","us_link":"../audio/c/eus71064.mp3","uk_sound":"ˈkɜː.tə.si","uk_link":"../audio/c/ukcouri006.mp3","content":"Add to word list\nAdd to word list\nB2 polite behaviour, or a polite action or remark: You might get along better with your parents if you showed them some courtesy. [ + to infinitive ] He could at least have had the courtesy to say sorry. The president welcomed her visitors with the usual courtesies. (by) courtesy of\nby permission of: Jessie J appears courtesy of Universal Records.\nbecause of: He got his black eye courtesy of a bloke he insulted at the bar last night.\nSee more\nMore examplesFewer examplesHe replied sharply, and without his wonted courtesy.At least do him the courtesy of listening to what he has to say.He did have the courtesy to thank her for her efforts.Always hold the door for the person behind you - it's just common courtesy.She treated them with the greatest courtesy.\nSMART Vocabulary: related words and phrases\nPolite and respectful\ncandy coat\ncandy-coated\nchivalric\nchivalrous\nchivalrously\ncourtly\ncouth\ndeferential\ndeferentially\neuphemistic\ngraciousness\nhyper-civilized\nkeep a civil tongue in your head idiom\nmanner\nminced oath\nsugarcoat\nsuper-polite\ntactful\ntactfully\nultra-civilized\nSee more results »\nAdd to word list\nAdd to word list\npolite behavior, or a polite action: [ U ] They should teach drivers to show pedestrians some courtesy. Idiom\ncourtesy of someone\nAdd to word list\nAdd to word list\npolite behaviour, or a polite action or remark: He was treated with courtesy and hospitality. I have written to the customer relations director twice but he has not had the courtesy to reply. As a courtesy, we will email you if there is any change to these arrangements.\n(by) courtesy of\nwith the permission of someone: Photo courtesy of Department of Transportation and Public Facilities\nbecause of, or provided by, someone or something: Dealers were not excited about the market's performance, noting that the strong gains came courtesy of a handful of stocks. This offer comes to you courtesy of the One World travel company.\nprovided at no cost: There is a courtesy bus provided to take you to the terminal. AA Insurance now offers a courtesy car until all claims are settled."}