{"id":111608,"name":"course","type":"noun","us_sound":"kɔːrs","us_link":"../audio/c/coarse.mp3","uk_sound":"kɔːs","uk_link":"../audio/c/ukclutc018.mp3","content":"course noun\n(CLASSES)\nAdd to word list\nAdd to word list\nA1 [ C ] a set of classes or a plan of study on a particular subject, usually leading to an exam or qualification: They're going away on a training course next week. I'd like to do (US take) a writing course when I retire.UK Tim did a three-year course in linguistics at Newcastle.\nMore examplesFewer examplesI did a course in creative writing.Julie has signed up for courses on English and French this year.There are still some vacancies for students in science and engineering courses.The course comprises a class book, a practice book and an audio tape.She's been offered a place on the nursing course.\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nwork placement\nworkshop\nSee more results »\ncourse noun\n(SPORTS AREA)\nB1 [ C ] an area of land or water used for a sports event: a golf course/cross-country course See also\nracecourse mainly UK\nMore examplesFewer examplesHe spends every weekend out on the golf course.We walked the course the horses would have to run later.The race was cancelled because the course was waterlogged.He ran the course in less than an hour.Flags mark the course the cyclists will be taking.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nring\nrink\nsideline\nskatepark\nupright\nSee more results »\ncourse noun\n(DEVELOPMENT)\nC1 [ S ] the often gradual development of something, or the way something happens, or a way of doing something: Did the scandal have any effect on the course of the election? In the course of (= during) the interview it became clear that he was not the right person for the job. What would be an appropriate course (of action) in such a situation? If our rivals are spending more on advertising, we'll have to follow the same course. The defendants are also accused of attempting to pervert the course of justice.\nThesaurus: synonyms, antonyms, and examples\nnecessary actionactionThey are considering legal action.course of actionThey have not yet decided on a particular course of action.measureMeasures are in place to prevent flooding.stepThese simple steps will ensure that infections are not spread.\nSee more results »\nin the course of time UK (also US over the course of time)\nafter a period of time: I assume they plan to have children in the course of time.\nSee more with the course of time\nUK (also US over the course of time) gradually: With the course of time, I've learned to live with my disability.\nSee more\nMore examplesFewer examplesOnce we have committed to this course of action there is no going back.We came up against a lot of problems in the course of building our extension.In the course of history, love has driven men and women to strange extremes.I was grateful for his letter which hastened the course of the enquiry.He has been accused of obstructing the course of justice .\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\ncourse noun\n(DIRECTION)\nC1 [ C usually singular, U ] the direction in which a vehicle, especially an aircraft, spacecraft, or ship, moves, or the path along which a river flows: The pilot avoided a collision by changing course. Changing the course of the river would cause serious environmental damage to the whole valley.figurative The debate completely changed course after Liz made her speech. on course\nlikely to happen, or likely to succeed as planned: Because of the recession, we're on course for/to have record unemployment levels.\nSee more off course\nin a position where something or someone is unlikely to achieve what is wanted or needed, or to operate smoothly: They need to know why their policies are off course. Uncertainty can easily blow the stock market off course. She is very determined and will not allow anyone to knock her off course.\nMore examplesFewer examplesAll attempts at diplomacy have broken down and the two states now appear to be on a collision course.He drove in an erratic course down the road.Some of the frontier between Germany and Poland follows the course of the river OderThe ship held its course.Most parents try to steer a middle course between imposing very strict discipline and letting their kids run wild.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ngo\ninto\nmultidirectional\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nImpossible and improbable\ncourse noun\n(MEAL)\nA2 [ C ] a part of a meal that is served separately from the other parts: a four-course lunch A traditional British main course consists of a meat dish with potatoes and other vegetables.\nMore examplesFewer examplesIf you make the main course, I'll make a dessert.I've only eaten one course and I'm already full.By the time the fourth course was served, I was stuffed to the gills.The average cost of a full three-course meal - appetizer, main course and dessert - including tip and a modest wine is about $25.I had salmon for my main course.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\ncourse noun\n(MEDICAL TREATMENT)\n[ C ] a fixed number of regular medical treatments: My doctor's put me on a course of antibiotics.UK She needed a six-month course of physiotherapy after she broke her leg.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nbooster\nCaplet\nchemotherapy\ndosage\nelixir\nenema\ninjectable\ninjection\njab\njag\nknockout drops\nmedication\nmixture\npatent medicine\npharmaceutical\nphial\nprescription\nwonder drug\nSee more results »\ncourse noun\n(LAYER)\n[ C ]\n&#160; architecture\n&#160; specialized a continuous horizontal layer of bricks or other building material\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\ndrywall\nfibro\nflagged\nflagstone\nflitch\nparticle board\npaving\nprestressed\nputty\nrazor wire\ntwo-by-four\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\ncourse noun\n(BLOOD)\ncourses [ plural ] old use\nthe bleeding from a woman's uterus (= the organ in the body in which a baby develops before birth) that happens about once a month when she is not pregnant: Her courses ceased and she knew that she was with child.\nSee more Grammar\nOf courseWe use of course to refer to things that are obvious or already known to the speaker and listener, or to everybody: …\nIdioms\nof course\nof course not\nto flow quickly or in large amounts: Tears were coursing down his cheeks. You could almost hear the blood coursing through her veins as she passed the finishing line.figurative A new wave of idealism is coursing through our schools.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\ncourse noun [C]\n(DIRECTION)\nAdd to word list\nAdd to word list\nthe particular path something such as an aircraft or ship takes as it moves, or the path along which a river flows: A southern course will take our flight over Texas. The ship was blown off course (= away from its course) in the storm.\ncourse noun [C]\n(DEVELOPMENT)\nthe often gradual development of something, or the way something happens, or a way of doing something: He always chats with waiters and waitresses and becomes their best friends during the course of dinner.\ncourse noun [C]\n(CLASSES)\na set of classes in a subject at a school or university: He taught a course in film history at Harvard University.\ncourse noun [C]\n(SPORTS AREA)\nan area used for a sports event: a golf course\ncourse noun [C]\n(MEAL)\na part of a meal served separately from the other parts: the meat course Idioms\nof course\nof course not\nAdd to word list\nAdd to word list\na series of lessons on a particular subject: course in/on sth We provide courses in commerce, finance, and basic marketing. During the course, students will learn traditional business and project management skills.run/teach/offer a course My company offers a lot of in-house training courses.enrol on a course He has enrolled on a book-keeping course.be on/go on/do a course Going on a course is a great way of learning in a focused environment.take a course (in sth) She decided to take a course in recruitment practice to expand her career.pass/fail/complete a course Students who fail to complete the course will not be awarded a certificate.a course runs/takes place Our courses run between September and May.a two-year/part-time/full-time, etc. course a three-day ICT course an MBA/a management course a degree/distance-learning course See also\ncorrespondence course\nrefresher course\nsandwich course\ntraining course"}