{"id":111617,"name":"court","type":"noun","us_sound":"kɔːrt","us_link":"../audio/c/cdo1119uscour0253.mp3","uk_sound":"kɔːt","uk_link":"../audio/c/ukcatsu010.mp3","content":"court noun\n(LAW)\nAdd to word list\nAdd to word list\nB2 [ C usually singular, U ] a place where trials and other legal cases happen, or the people present in such a place, especially the officials and those deciding if someone is guilty: Protestors gathered outside the court to await the verdict. He's due to appear in court again on Monday. Please describe to the court exactly what you saw. the European Court of Human Rights The lack of evidence means that the case is unlikely to go to court. take someone to court\nto take legal action against someone: She's threatening to take me to court for not paying the bill on time.\nSee more settle (a case) out of court\nto solve a legal disagreement without taking legal action: The newspaper has agreed to settle out of court.\nSee more\nMore examplesFewer examplesWhat the witness said in court was not consistent with the statement he made to the police.The members of the jury left the court with a police escort.He arrived in court handcuffed to two police officers.The court awarded the women $100,000 each to recompense them for nine years of lost wages.They chose a famous barrister to represent them in court.\nSMART Vocabulary: related words and phrases\nLaw courts\nappellate\nbefore\nbench\nchamber\nchancery\ncircuit court\ncourthouse\ncourtroom\ncriminal court\nCrown Court\nHigh Court\nindustrial tribunal\njury box\njustice\nkangaroo court\nthe Inns of Court\nthe Supreme Court\ntribunal\nvenue\nwitness box\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudges & juries\ncourt noun\n(SPORT)\nB1 [ C ] an area drawn out on the ground that is used for playing sports such as tennis and basketball: a tennis/volleyball/basketball/squash court They were penalized for having too many players on the court.\nMore examplesFewer examplesWe have squash courts available at work.When she walked onto court for the final, the crowd went wild.A new basketball court has been built in the park.Once on the badminton court, she becomes really aggressive.I'll meet you at the tennis courts.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ngoal line\nground staff\nhalf\nout of bounds idiom\nplayability\nplayable\nplaying field\npump track\nrecreation center\nring\nrink\nsideline\nskatepark\nupright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTennis & racket sports\ncourt noun\n(OPEN AREA)\n[ C ] mainly UK an area or a short road that is not covered by a roof and is mostly or completely surrounded by buildings: You really should go and see the medieval court in the castle. Court mainly UK\nused in the names of some roads, and buildings containing apartments\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncompound\ncourtyard\nfarmyard\nforecourt\nformal\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\ncourt noun\n(ROYALTY)\n[ C or U ] the official home of a queen or king: the courts of Renaissance Europe He quickly lost his popularity at court.\n[ S, + sing/pl verb ] the important people who live in the official home of a queen or king or who work for or advise them\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmiss\nmister\nmonarch\nmonarchist\nroyal prerogative\nroyalist\nroyally\nRt. Hon.\nShah\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who help or serve people professionally\ncourt verb\n(PLEASE)\n[ T ] to try to please someone because you want them to join you: Adams is being courted by a number of football clubs.\nSMART Vocabulary: related words and phrases\nRelationships: finding a partner\na heavy date idiom\nbe on the pull idiom\nchase\ncomputer dating\ncourtship\ncruising\ngo back to someone\nheavy\nhook up\ninternet dating\nlonely\nlonely hearts idiom\nmatch\nonline dating\npersonal ad\npin\npull\npursue\nsingles bar\nspeed dating\nSee more results »\ncourt verb\n(TRY TO GET)\n[ T ] to try to get something, especially attention or support from other people: She courts publicity by inviting journalists to extravagant parties.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nhunting ground\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nneedle\nscout\nscratch\nsearch\nseek someone/something out\nseeker\nshake someone down\ntroll\nSee more results »\ncourt verb\n(RISK)\n[ T ] to risk something unpleasant, especially by behaving stupidly or carelessly: Drinking and driving is simply courting disaster.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ncompromise\ndare\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\ncourt verb\n(HAVE A RELATIONSHIP)\n[ I or T ] old-fashioned to have a romantic relationship with someone that you hope to marry: They courted for two years before getting married.\nSMART Vocabulary: related words and phrases\nRelationships: finding a partner\na heavy date idiom\nbe on the pull idiom\nchase\ncomputer dating\ncourtship\ncruising\ngo back to someone\nheavy\nhook up\ninternet dating\nlonely\nlonely hearts idiom\nmatch\nonline dating\npersonal ad\npin\npull\npursue\nsingles bar\nspeed dating\nSee more results »\ncourt noun\n(LAW)\nAdd to word list\nAdd to word list\n[ C/U ] the place where trials and other legal cases happen: [ U ] He is bringing charges against us and said, \"I’ll see you in court.\" [ U ] The newspaper agreed to settle the case out of court (= agreed to a deal that avoided a trial).\n[ C/U ] The court is the judge or judges who are in charge of the way a legal case happens and sometimes make decisions about it.\ncourt noun\n(SPORTS)\n[ C ] a rectangular area used as the playing area in some sports: a racquetball/tennis court\ncourt verb [T]\n(PLEASE)\nto try to please someone in the hope of receiving that person's support, approval, or affection, or to try to get something that benefits you: Both candidates had been courting independent voters, who are likely to decide the election.\ncourt verb [T]\n(RISK)\nto increase the risk of something bad happening: If you hire people who are not very sharp or creative, you're courting disaster.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW a room or building in which trials and legal cases are decided, or the group of people, including, for example, a judge and other officials, who listen to and make decisions on legal cases: Different courts are responsible for different types of cases. Unless a solution can be reached, the case will go to court later this month. The legality of electronic signatures is to be tested in court.the court found/held The website was shut down after a US district court held that the copying of albums was a violation of copyright law.court case/hearing/trial The court case is due to be heard next month. Compare\ntribunal\ntake sb to court\nLAW to take legal action against someone: Unless they resolve the matter, I intend to take them to court.\nsettle (a case) out of court\nLAW to end a legal disagreement without taking legal action: The firm has agreed to settle out of court.\nSee also\nAdmiralty court\nappeal court\nappeals court\ncivil court\ncommercial court\ncounty court\ncriminal court\nCrown Court\ndistrict court\nfederal court\nView all\nHigh Court\nlabour court\nlaw court\nout-of-court\ntribunal\nstate court\nSupreme Court\nto try to attract people, especially in order get something from them, for example, attention or support: At this stage of a presidential race, candidates spend nearly all their time courting voters in their own party. Traditionally, the company has courted customers aged 50 or over.\nFINANCE to formally discuss with another company the possibility of buying or getting control of it: The company is courting two takeover targets as it prepares to grow its healthcare business."}