{"id":111574,"name":"courage","type":"noun","us_sound":"ˈkɝː.ɪdʒ","us_link":"../audio/c/courage.mp3","uk_sound":"ˈkʌr.ɪdʒ","uk_link":"../audio/c/ukcount027.mp3","content":"Add to word list\nAdd to word list\nB2 the ability to control your fear in a dangerous or difficult situation: They showed great courage when they found out about their baby's disability. [ + to infinitive ] People should have the courage to stand up for their beliefs. It took me months to summon/pluck up the courage to ask for a promotion. Synonym\nbravery\nThesaurus: synonyms, antonyms, and examples\nbraverybraveryA policeman who chased a burglar despite a serious leg injury has received an award for bravery. courageYou have shown great courage in coming to testify.pluckYou have to admire his pluck.gutsI didn't have the guts to go on my own.valourUK The Victoria Cross is Britain's highest military award for valour. heroismI witnessed an example of heroism that made me proud to be British.\nSee more results »\nhave the courage of your convictions\nto be brave and confident enough to do what you believe in: Although many of his policies were unpopular, he had the courage of his convictions to see them through.\nSee more\nMore examplesFewer examplesSergeant Havers was mentioned in dispatches for his courage.Harry's courage during his illness was evident to everyone.When I looked down and saw how far I had to jump, my courage failed me .After years of abuse from her husband, she eventually found the courage to leave him.I spent a week gathering the courage to say no.\nSMART Vocabulary: related words and phrases\nBravery\naudaciousness\naudacity\nbackbone\nballs\nbell\nbell the cat idiom\ndaring\nderring-do\nDutch courage\nfearlessness\nfighting spirit\ngrit\ngut\nheart\nintestinal fortitude\nliquid courage\nnerve\npluck\nswash\nvaliance\nSee more results »\nAdd to word list\nAdd to word list\nthe ability to control fear and to be willing to deal with something that is dangerous, difficult, or unpleasant: He lacked the courage to tax the American people to pay for his Great Society programs. It took me several months to get up the courage to ask her to lunch. courageous adjective us\nYour browser doesn't support HTML5 audio\n/kəˈreɪ·dʒəs/\nShe showed herself to be a courageous journalist."}