{"id":111677,"name":"cousin","type":"noun","us_sound":"ˈkʌz.ən","us_link":"../audio/c/cousin.mp3","uk_sound":"ˈkʌz.ən","uk_link":"../audio/c/ukcouri017.mp3","content":"Add to word list\nAdd to word list\nA2 a child of a person's aunt or uncle, or, more generally, a distant (= not close) relation: My brother's wife and I both had babies around the same time, so the cousins are very close in age. Many of our distant cousins, whom we hadn't seen for years, came to my sister's wedding. See also\nfirst cousin\nsecond cousin\nThesaurus: synonyms, antonyms, and examples\nyour relativesrelativeAll my relatives gather every year for a family reunion.extended familyHe has a very large extended family.relationShe is a distant relation of his, though I don't quite remember how.kinHe remained true to his kin.mother's/father's side (of the family)I have aunts and uncles on my mother's side of the family.\nSee more results »\na member of a group of people with similar origins: We Americans owe a great deal to our European cousins.\nsomething that is related to or similar to another thing: The cardoon is a close cousin of the artichoke. The work is a contemporary cousin to Mozart's \"Magic Flute\".\nMore examplesFewer examplesI went over to Ireland for my cousin's wedding.Tiago has nine cousins - five girls and four boys.She ran excitedly down the hall to greet her cousins.All of the cousins are very close and love meeting up.Daniel and Ralph are cousins - their mums are sisters.A cousin of the ubiquitous peach, the apricot is available in many varieties. The film has a dark fatalism that renders it a close cousin to Blade Runner.These games are like their popular PS2, GameCube, and Xbox cousins, except no console is needed.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfilial\nfilially\nfirst cousin\nfraternal\ngrand-nephew\nkinswoman\nkith and kin\nlong-lost\nloved one\nmaiden aunt\nrelationship\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\nAdd to word list\nAdd to word list\na child of a person’s aunt or uncle"}