{"id":111744,"name":"cove","type":"noun","us_sound":"koʊv","us_link":"../audio/c/cove.mp3","uk_sound":"kəʊv","uk_link":"../audio/c/ukcouri021.mp3","content":"cove noun [C]\n(COAST)\nAdd to word list\nAdd to word list\na curved part of a coast that partly surrounds an area of water: You have to drive on a dirt road to reach the cove. The cottage is set in a sheltered cove. Compare\nbay noun (COAST)\nPeter Lewis/Oxford Scientific/GettyImages\nMore examplesFewer examplesThe island has many sandy beaches and secret coves.The photograph showed two boys in a canoe in a cove.We swam with dolphins at Discovery Cove.\nSMART Vocabulary: related words and phrases\nBays & gulfs\narm\nbasin\nbay\nchannel\ngulf\nHudson Bay\ninlet\nlagoon\nnarrows\nsea coast\nsound\nstrait\nthe Bay of Bengal\nthe Bay of Fundy\nthe Gulf of Mexico\nthe Persian Gulf\ncove noun [C]\n(ON CEILING)\nmainly UK (US usually cove molding) a long, curved piece of wood, plaster (= a smooth building material that becomes hard when it dries), etc. placed along the top edge of a wall where it joins the ceiling: Where a doorway extends to ceiling height, it may be necessary to interrupt the cove at either side. Frame-mounted art lights and cove lighting are examples of accent lighting. Synonyms\ncove moulding\ncovingRelated word\ncoved\nMore examplesFewer examplesIf there isn't a cornice or cove, you can give the impression of one by painting a stripe immediately under the ceiling.Apply the adhesive to the two surfaces of the cove that will be in contact with the wall and ceiling, and push firmly and evenly into position.\nSMART Vocabulary: related words and phrases\nParts of buildings: walls & parts of walls\nalcove\nbalcony\nbaseboard\ncavity wall\nchimney breast\ncwtch\ndado\ndamp course\ndamp-proof\ndamp-proofing\nparapet\npartition\nparty wall\npebbledash\nplasterboard\nveranda\nwainscot\nwainscoted\nwainscoting\nwallboard\nSee more results »\ncove noun [C]\n(MAN)\nUK old-fashioned a man: He's an odd-looking cove.\nAdd to word list\nAdd to word list\na curved part of a coast that partly encloses an area of water; a small bay"}