{"id":111754,"name":"covenant","type":"noun","us_sound":"ˈkʌv.ən.ənt","us_link":"../audio/c/eus71067.mp3","uk_sound":"ˈkʌv.ən.ənt","uk_link":"../audio/c/ukcouri023.mp3","content":"Add to word list\nAdd to word list\na formal agreement or promise between two or more people: The contract contained a restrictive covenant against building on the land. Synonyms\naccord\nagreement (SAME OPINION)\ncompact (AGREEMENT) formal\nconcordat specialized\npact\ntreaty\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nfinance &amp; economics\n&#160; UK specialized a formal agreement to pay a fixed amount of money regularly, especially to a charity\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nwelch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrusts & funds\n[ I or T ] formal or old-fashioned to make a formal agreement or promise: We covenant together to support each other. She was accused of covenanting with the devil.\n[ T ]\n&#160; finance &amp; economics\n&#160; UK specialized to make a formal agreement to pay a fixed amount of money regularly, especially to a charity: Five percent of our profits are covenanted to charity. The business will covenant 100% of net profits to be reinvested back into community projects.\nMore examplesFewer examplesThey covenanted with the landlord to pay the rent.The husband covenanted to pay the wife £300 per month. He is said to have covenanted the money to his close associates.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nwelch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrusts & funds\nAdd to word list\nAdd to word list\na formal agreement between countries, organizations, or people\nAdd to word list\nAdd to word list\nLAW a part of a formal written agreement in which it is stated what must or must not be done, or in which someone promises to do or pay something: The lease contains a covenant that no animals can be kept on the property. Any loss of rent may be claimed as damages for breach of covenant (= failure to do as promised). See also\ndeed of covenant\nrestrictive covenant\nLAW to officially agree to do or not do something: If business premises suffer serious fire damage the landlord usually covenants to reinstate the premises."}