{"id":111771,"name":"coverage","type":"noun","us_sound":"ˈkʌv.ɚ.ɪdʒ","us_link":"../audio/c/coverage.mp3","uk_sound":"ˈkʌv.ər.ɪdʒ","uk_link":"../audio/c/ukcouri026.mp3","content":"coverage noun [U]\n(REPORT)\nAdd to word list\nAdd to word list\nC1 media the reporting of a particular important event or subject: What did you think of the BBC's election coverage?\nMore examplesFewer examplesThere's a good arts coverage in the newspaper, but not much political commentary.I can remember watching live TV coverage of the first lunar landing, so that dates me .The wedding received extensive coverage in the newspapers.Sometimes it seems that press coverage of an event is inversely proportional to its true importance .Satellite technology offers the opportunity, as never before, for continuous television coverage of major international events.\nSMART Vocabulary: related words and phrases\nNews reporting & the press\nambulance chaser\nbreaking news\nbury the lede idiom\ncitizen journalism\ndispatch\ninvestigative journalism\ninvestigative journalist\njournalism\njournalist\njournalistic\njournalistically\nphotojournalist\npress baron\npress conference\npress gallery\nscoop\nspoiler\nsyndicate\nthe Associated Press\nthe Press Association\nSee more results »\ncoverage noun [U]\n(DEALING WITH)\nthe fact of dealing with or directing attention to something: These books give very good grammar coverage (= they deal with grammar very well).\nSMART Vocabulary: related words and phrases\nNews reporting & the press\nambulance chaser\nbreaking news\nbury the lede idiom\ncitizen journalism\ndispatch\ninvestigative journalism\ninvestigative journalist\njournalism\njournalist\njournalistic\njournalistically\nphotojournalist\npress baron\npress conference\npress gallery\nscoop\nspoiler\nsyndicate\nthe Associated Press\nthe Press Association\nSee more results »\ncoverage noun [U]\n(PROTECTION)\nC1 US (UK cover) financial protection so that you get money if something bad happens: They have a national program that provides health/medical coverage for every citizen. There is no coverage for expenses under $5 000. Synonym\ninsurance\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\npolicyholder\nprotect\nthird-party insurance\nunderwrite\nSee more results »\ncoverage noun [U]\n(REPORTING)\nAdd to word list\nAdd to word list\nthe job and responsibility of reporting or writing about a particular subject for television, radio, or a newspaper or magazine: The TV station is trying to improve its coverage of local news.\ncoverage noun [U]\n(PROTECTION)\nthe state or condition of being protected from financial loss, damage, accident, or having something stolen; insurance: I’ve got $50,000 worth of coverage for the contents of my house.\nAdd to word list\nAdd to word list\nINSURANCE\n&#160; US (also insurance coverage) →\ncover : Compare these health insurance plans to ensure that you have adequate coverage for your needs.\nCOMMERCE the area in which a particular service is available, or particular goods are sold: Check out the wireless service provider's coverage before you sign a contract. Market coverage: our markets include East, Southeast and South Asia.\nCOMMUNICATIONS writing about a particular event or subject: detailed/full/in-depth/wide coverage The press picked up the story and gave it wide coverage. The President's gathering was closed to media coverage. See also\nextended coverage"}