{"id":111769,"name":"cover","type":"verb","us_sound":"ˈkʌv.ɚ","us_link":"../audio/c/cover.mp3","uk_sound":"ˈkʌv.ər","uk_link":"../audio/c/ukcouri025.mp3","content":"cover verb\n(PLACE OVER)\nAdd to word list\nAdd to word list\nA2 [ T ] to put or spread something over something, or to lie on the surface of something: The light was so bright that I had to cover my eyes. Snow covered the hillsides.cover someone (up) with something She covered him (up) with a blanket.cover something with something Cover the meat with a layer of cheese.be covered with/in The bandages were covered with/in blood.be covered by/with How much of the earth's surface is covered by/with water?\nThesaurus: synonyms, antonyms, and examples\nto put something over someone or somethingcoverI covered her with a blanket to keep her warm.spreadI spread peanut butter on my bread.smother something in/with somethingThe chicken was absolutely smothered in butter sauce.coatCoat the cherries in chocolate.plasterHis laptop cover was completely plastered with stickers.cakeHis shoes were caked in mud.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto lie on the surface of someone or somethingcoverSnow covered the ground.overlayClicking this button will overlay your map with satellite images of the terrain. blanketThe fields were blanketed with early-morning mist.enshroudThe mountaintops were enshrouded in a thick veil of cloud.buryThe shed was completely buried by rubble.be carpeted with somethingThe aisle was carpeted with rose petals.\nSee more results »\nMore examplesFewer examplesCan't you just cover the mark with a dab of paint?Tropical rain forests used to cover 10% of the earth's surface.She was wearing a rather daring skirt that only just covered her bottom.She covered every wall in her bedroom with posters of her favourite pop star.The new chairs were covered in protective plastic wrappings.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\ncover verb\n(DEAL WITH)\nB1 [ T ] to deal with or direct attention to something: This leaflet covers what we've just discussed in more detail. Do these parking restrictions cover residents as well as visitors? The salesman's territory covers the whole of the southeast.\nThesaurus: synonyms, antonyms, and examples\nto be about somethingbe aboutWhat is the story about?have (got) to do withWhat's that got to do with it?relate toThat relates to what I was saying earlier about the need for reform.concernThe film concerns the complicated nature of marriage.coverWe will cover the passive voice later in the course.deal withWe will deal with the use of antidepressants in chapter three.\nSee more results »\nMore examplesFewer examplesThe magazine covers a broad range of subjects, from sewing to psychology.The existing laws covering libel in this country are thought by many to be inadequate.The Official Secrets Act covers everything from nuclear weapons to army boots.Is there a course that covers Italian sculpture from the 14th to the 17th century?I'd like to know how to clean it, but the instruction booklet doesn't seem to cover that kind of thing.\nSMART Vocabulary: related words and phrases\nRegarding and concerning\nabout\napply to\napropos\napropos of something\naround\nas\nconnection\ndeal with someone\ndepartment\nhereof\nin respect of something idiom\nin the brain/looks department idiom\ninto\nrange\nsay\nsomething\nthereof\ntowards\nvis-à-vis\nwise\nSee more results »\ncover verb\n(REPORT)\nC1 [ T ] to report the news about a particular important event: She's covering the American election for BBC television.\nMore examplesFewer examplesThe story wasn't covered on the national news.He was in Greece covering the Olympics.He was sent to Russia to cover the elections there.\nSMART Vocabulary: related words and phrases\nNews reporting & the press\nambulance chaser\nbreaking news\nbury the lede idiom\ncitizen journalism\ncorrespondent\ndispatch\nhot off the press idiom\ninvestigative journalism\ninvestigative journalist\njournalism\njournalist\njournalistic\nphotojournalism\nphotojournalist\npress baron\npress conference\nscoop\nspoiler\nthe Associated Press\nthe Press Association\nSee more results »\ncover verb\n(PROTECT)\nC1 [ T ] to protect someone against loss, damage, accident, or having something stolen, by having insurance: cover someone against/for something Does your travel insurance cover you against/for the loss or theft of cash? cover yourself\nto do something to protect yourself from blame or criticism in the future: I kept copies of my expense receipts, just to cover myself. Make sure you take notes of the meeting, just to cover yourself. He claimed to be following up on information from an informant to cover himself while illegally accessing confidential information. We believe that some employees doctored their schedules to cover themselves. She covered herself by making sure she always had someone else present in the room when she talked to the defendant.\nMore examplesFewer examplesDoes our insurance cover us for accidental damage?If you crashed the car, you wouldn't be covered on my insurance.The policy doesn't cover anything taken outside the home.Their medical insurance doesn't cover cosmetic surgery.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nassessor\nassurance\nbancassurance\nbroking\nclaim\ncomprehensive\ncopay\nindemnify\nlife assurance\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefending and protecting\ncover verb\n(TRAVEL)\nB2 [ T ] to travel a particular distance: We covered 400 km in three hours.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\ncover verb\n(BE/GIVE ENOUGH)\nC1 [ T ] to be or give enough money to pay for something: cover the cost The selling price barely covered the cost of the raw materials.cover expenses For some writers, having to cover expenses like meals and travel makes it unaffordable to speak at book festivals. Their small budget had to cover everything from staff costs to buying furniture. He charged them rent in order to cover his mortgage payments. Her godmother offered to cover her tuition fees.\nSMART Vocabulary: related words and phrases\nEnough\nadequacy\nadequate\nadequately\nfill\ngo\ngo round\ngood\nhold out\nrespectable\nrespectably\nsatiable\nsatisfiable\nsay\nsay when idiom\nsufficiency\nsufficient\nsufficiently\nthat\nthat will do idiom\nthe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\ncover verb\n(GIVE PROTECTION)\n[ T ] to aim a gun or shoot at someone to try to stop them from shooting or escaping, or to protect someone else: The police officer was covered by her colleagues while she ran towards the gunman's hideout.\n[ T ] When soldiers or police officers cover a place such as a road or building, they are in a position from which they can watch and defend it: All the exits are covered, so they can't escape.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDefending and protecting\ncover verb\n(SPORTS)\n[ T ] US (UK mark) to prevent a member of the opposing team from taking control of the ball by staying close to them all the time: The Bullets kept assigning different players to cover him.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\ncover verb\n(DO SOMEONE'S JOB)\n[ I or T ] to do someone else's job or duty when they are absent: cover something for someone I'm going to the doctor's tomorrow, so do you think you could cover my shift for me?cover for Sorry, I'm already covering for someone else.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\ncover verb\n(RECORD)\n[ T ] to make a recording of a song or tune that has already been recorded by someone else: I think more singers have covered \"Yesterday\" than any other song.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nremix\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nIdioms\ncover all the bases\ncover someone's back\ncover your back\ncover your backside/behind/rear\ncover your tracksPhrasal verb\ncover something up\ncover noun\n(SOMETHING PLACED OVER)\nB1 [ C ] something that is put on or over something else, usually to protect it, to keep something in, etc.: I keep my computer printer under a protective plastic cover. Remove the packaging and pierce the plastic cover before microwaving.\nB1 [ C ] the stiff outside part of a book or magazine, usually made of thick paper or cardboard: Who should we put on the cover of the magazine this month? Paperback books have soft covers. read something from cover to cover\nto read a book, magazine, etc. all the way through from the beginning to the end: On Sundays, I stay in bed all morning and read the paper from cover to cover.\nSee more\n[ C ] Indian English an envelope send something under plain cover UK formal\nto send something in a plain envelope: These are the type of books that are generally sent under plain cover.\nSee more send something under separate cover formal\nto send something in a separate envelope: I'll send my CV along under separate cover.\nSee more covers [ plural ]\nthe blankets, sheets, etc. on a bed: Martha threw back the covers and bounced out of bed.\nSee more\nMore examplesFewer examplesThe book has a diagonal black stripe on the cover.I'll use this material to make some new chair covers.She levered up the drain cover and looked inside.She puts a plastic cover was over her keyboard to keep the dust off.Do you have a protective cover over the mattress?\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsubstratum\nsuperstratum\ntar paper\nuncover\nvarnish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\ncover noun\n(PROTECTION)\nC1 [ U ] shelter or protection in an unpleasant or dangerous situation: take cover We took cover from the storm in a bus shelter.under cover of The burglar broke into the house under cover of darkness.\n[ U ] plants, especially bushes, that are used as shelter by animals\n[ U ] protection by someone who has a gun: cover from We needed more cover from the enemy aircraft.\nC1 [ U ] UK (US coverage) financial protection so that you get money if something bad happens: cover for I've got £20,000 worth of cover for the contents of my house. Do you have cover for accidental damage? Synonym\ninsurance\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe & enclosed spaces\nProtection and protectors\nInsurance\ncover noun\n(SONG)\n[ C ] (also cover version) a performance or recording of a song or tune that has already been recorded by someone else: How many cover versions have been made of \"My Way\"?\nSMART Vocabulary: related words and phrases\nCopying and copies\nanti-counterfeiting\nanti-piracy\nape\nbiomimicry\nblueprint\nfacsimile\nforge\nforgery\nhijack\nhijacking\nimaging\nmimetic\nphotostat\nphotostatic\npiracy\npirate\npirated\ntranscript\nwarmed-over\nXerox\nSee more results »\ncover noun\n(CRICKET)\n[ U ]\n&#160; sports\n&#160; specialized in cricket, the position of a fielder (= a player who tries to stop the other team from scoring by stopping or catching the ball) which is in front of the batter (= the player hitting the ball) on the off side (= the side of the field opposite the side where the batter stands): The ball was athletically fielded at cover. He was caught at cover from a mistimed drive. covers [ plural ]\nin cricket, the large area of the field which is in front of the batter (= a player who tries to hit the ball) on the off side (= the side of the field opposite the side where the batter stands): He usually fields in the covers.\nSee more\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\ncover verb\n(PLACE OVER)\nAdd to word list\nAdd to word list\n[ T ] to put or spread something over something, or to lie on the surface of something: Once the rice comes to a boil, turn down the flame and cover the pot. She covered the child with a blanket.\n[ T ] If something covers an area of a particular size, it is equal to an area of that size: Grand Canyon National Park covers over a million acres.\ncover verb\n(TRAVEL)\n[ T ] to travel a particular distance: We covered 600 miles in the last two days. fig. Her lecture covered a lot of ground, from Renaissance art to modern art.\ncover verb\n(INCLUDE)\n[ T ] to deal with or include someone or something: The travel guide covers all the museums and historic places.\ncover verb\n(REPORT)\n[ T ] to report or write about a particular subject for a newspaper, magazine, television, or radio: Harold covers sports for the Times, and Joan covers real-estate developments.\ncover verb\n(BE ENOUGH)\n[ T ] to be enough money to pay for: Will $150 cover your expenses?\ncover verb\n(PROTECT)\n[ T ] to protect someone or something from financial loss, damage, accident, or having something stolen; to insure: Our car insurance covers us up to $250,000 for personal injury.\ncover verb\n(DO JOB)\n[ I always + adv/prep ] to do a job or duty for someone who is absent: Can you cover for me while I'm at the dentist on Monday?\ncover verb\n(TAKE CARE OF)\n[ T ] to deal with or take care of something: Could you cover the phones while I’m away from the office? Idioms\ncover (all) the bases\n(from) cover to cover\ncover your tracksPhrasal verbs\ncover for someone/something\ncover up (something)\ncover noun\n(SHELTER)\n[ U ] shelter or protection, esp. in a dangerous situation: Folks heard the storm was coming and took cover.\ncover noun\n(PLACE OVER)\n[ C ] something that is placed over something, often for protection, or that lies over something else to form a layer: I keep my computer printer under a plastic cover.\n[ C ] The cover of a book or magazine is the stiff, outside part of it, usually made of thick paper or cardboard.\n[ C ] A cover is also a layer of a material used to keep a person in bed warm: [ pl ] On cold days, she pulled the covers up to her chin.\nAdd to word list\nAdd to word list\n[ T ] to include or deal with something: The seminars cover such topics as making an impact at interview, employability, and what companies are looking for. Have I covered all your questions?\nCOMMERCE to serve customers in a particular area: Our delivery service covers the entire metropolitan area.\n[ T ]\n&#160; FINANCE to be enough money to pay for something: My wife earns enough to cover the mortgage. We only sold enough to cover our costs - we made no profit at all. The amount was not sufficient to cover all his debts. The government's guarantee will cover the first £50,000 of people's savings.\n[ I or T ]\n&#160; INSURANCE to protect someone or something against loss, damage, accident, etc., by insurance: The policy covers employee and public liability, equipment loss, materials, and personal accidents.cover (sb) against/for sth In general, buildings insurance covers (you) against damage to the house itself and outbuildings such as conservatories and greenhouses.\n[ T ] to protect yourself from being blamed for something: cover yourself (against something) Always inform a senior colleague of your intentions, in order to cover yourself against accusations of bullying.\n[ T ]\n&#160; FINANCE if a financial organization can cover a loan, it is protected against loss by having enough collateral (= property that a person borrowing money agrees to give to the organization if they fail to pay the debt): The approval for a home equity loan is usually easy as the lender has collateral to cover the loan amount.\n[ T ]\n&#160; FINANCE, STOCK MARKET to buy shares, currency, etc. that you have arranged to sell in the future, especially if the price is rising and you had expected it to go down: Tokyo stocks advanced 1.1% Thursday as futures rose and investors scrambled to cover short positions.\n[ I or T ]\n&#160; HR to do someone else's job when they are absent: cover (for sb) We are expected to cover for each other if someone is absent or is late arriving in the morning. While he was on sick leave, a colleague covered his job.\n[ C ] the stiff outside part of a book or magazine: She became the first woman to appear on the cover of Business Week.\n[ U ]\n&#160; INSURANCE\n&#160; UK (also insurance cover); ( US coverage) financial protection against loss, damage, injury, etc., which an insurance company sells: health/liability/life/travel cover A firm employing staff needs to have employers' liability cover.buy/get/take out cover (for/against sth) Homeworkers can get insurance cover for copiers and faxes but premium costs vary widely.provide cover (for/against sth) The policy provides cover for loss or damage to property owned by the insured. For a small additional premium, you can increase this cover to £100,000.\n[ U ]\n&#160; FINANCE the fact of being enough to pay for something: The property that is being offered as collateral will be sufficient cover for the loan amount.\n[ U ]\n&#160; HR the situation in which someone does someone else's job when they are absent: Employees need cover for days they have to stay home to care for sick children. See also\ncontinental cover\ndividend cover\nforward cover\ninterest cover"}