{"id":111843,"name":"cowardly","type":"adjective","us_sound":"ˈkaʊ.ɚd.li","us_link":"../audio/c/cowardly.mp3","uk_sound":"ˈkaʊ.əd.li","uk_link":"../audio/c/ukcover014.mp3","content":"Add to word list\nAdd to word list\n(of a person) not at all brave and too eager to avoid danger, difficulty, or pain : He was too cowardly to give the order. When they criticize us anonymously they come across as cowardly. These are not cowardly people, but they are cautious.\nB2 (of an action) showing that someone is not at all brave and is too eager to avoid danger, difficulty, or pain: This was a particularly brutal and cowardly attack. They are guilty of a cowardly failure to address the problem. It was cowardly not to own up to the mistake. Synonyms\nchicken child's word\ncraven formal disapproving\nfainthearted\nlily-livered literary\npusillanimous formal\ntimid\nweak-kneed informal disapproving\nyellow (NOT BRAVE) informalRelated word\ncoward\nMore examplesFewer examplesThey think we're weak and cowardly.Was he too decent to do it, or simply too cowardly?They tried to characterize him as a cowardly shirker of responsibility.He said he was the victim of a cowardly campaign of character assassination.I think it was a cowardly way for management to go about things.Their failure to ask tough questions and hold their leaders to account is cowardly in the extreme.\nSMART Vocabulary: related words and phrases\nCowardly\nbe afraid of your own shadow idiom\nbottle\nbottle out\nchicken\nchicken out\nfainthearted\ngutless\nlily-livered\npantywaist\npusillanimity\nshadow\nspinelessness\ntimid\ntimidity\ntimidly\ntimorous\nwimp\nwimp out\nwimpy\nyellow-bellied\nSee more results »\nin a way that shows someone is not at all brave and is too eager to avoid danger, difficulty, or pain: We will not retreat or act cowardly.\nSMART Vocabulary: related words and phrases\nCowardly\nbe afraid of your own shadow idiom\nbottle\nbottle out\nchicken\nchicken out\nfainthearted\ngutless\nlily-livered\npantywaist\npusillanimity\nshadow\nspinelessness\ntimid\ntimidity\ntimidly\ntimorous\nwimp\nwimp out\nwimpy\nyellow-bellied\nSee more results »"}