{"id":112326,"name":"cranesbill","type":"noun","us_sound":"ˈkreɪnz.bɪl","us_link":"../audio/c/cdo1121uscran1219.mp3","uk_sound":"ˈkreɪnz.bɪl","uk_link":"../audio/c/cdo1121ukcran1218.mp3","content":"Add to word list\nAdd to word list\na plant whose flowers are pink, purple, white, or blue and have five petals that are all similar: Bees and other pollinators like single petal flowers like strawberries, cranesbill and daisies that provide easy access. For a shady area under the trees where nothing seems to grow, try the cranesbill or geranium. Synonym\ngeranium\nMore examplesFewer examplesPurple patches of cranesbill lay amongst the buttercups and clover.Other good perennials to grow in clay soil include cranesbills, particularly Geranium malviflorum.This month's magazine features a visit to a country house garden to look at true geraniums, or cranesbills. The grass is scattered with the dusky blue and magenta petals of meadow cranesbill.\nSMART Vocabulary: related words and phrases\nFlowers & flowering plants\naconite\nadam-and-eve\naeonium\nAfrican daisy\nagapanthus\nelderflower\nelephant ear\nerythronium\neuphorbia\nevening primrose\nlords-and-ladies\nlotus\nlove-in-a-mist\nlupin\nmallow\nself-heal\nsenecio\nsensitive plant\nShasta daisy\nshepherd's purse\nSee more results »\na plant with pink, purple, white, or blue flowers which have five petals that are all similar: Most shade-loving cranesbills flower in spring. Single petal flowers like strawberries, cranesbill, and daisies provide easier access for bees and other pollinators.\nMore examplesFewer examplesButtercups, daisies, and cranesbill were all pushing through the new grass of the meadows.On the grassy banks along the track, wild flowers such as cranesbill and strawberry grew.Geranium psilostemon is one of the longest-lived of all the cranesbills so prepare its site well.\nSMART Vocabulary: related words and phrases\nFlowers & flowering plants\naconite\nadam-and-eve\naeonium\nAfrican daisy\nagapanthus\nelderflower\nelephant ear\nerythronium\neuphorbia\nevening primrose\nlords-and-ladies\nlotus\nlove-in-a-mist\nlupin\nmallow\nself-heal\nsenecio\nsensitive plant\nShasta daisy\nshepherd's purse\nSee more results »\nSynonym\ngeranium"}