{"id":112496,"name":"crash","type":"verb","us_sound":"kræʃ","us_link":"../audio/c/crash.mp3","uk_sound":"kræʃ","uk_link":"../audio/c/ukcraps002.mp3","content":"crash verb\n(HAVE AN ACCIDENT)\nAdd to word list\nAdd to word list\nB1 [ I or T ] If a vehicle crashes or someone crashes it, it is involved in an accident, usually a serious one in which the vehicle is damaged and someone is hurt: We skidded on the ice and crashed. The plane crashed into a mountainside. Her brother borrowed her motorbike and crashed it.\nMore examplesFewer examplesConvinced the plane was about to crash, many people were sobbing and in hysterics.They had a narrow escape when their car crashed.The ill-fated aircraft later crashed into the hillside.The plane appeared to have crashed because of a mechanical problem.The plane crashed mere minutes after take-off.\nSMART Vocabulary: related words and phrases\nOn the road: accidents involving vehicles\na screech of brakes phrase\nanti-collision\nbird strike\nbrake\ncar crash\ncrash-landing\ncropper\nderailment\nfender bender\novershoot\nprang\nroad toll\nrubbernecking\nrun (something) into something/someone\nrun someone/something down\nrun someone/something over\nsideswipe\nsmash\nspin\nstack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\ncrash verb\n(MAKE A NOISE)\n[ I or T, usually + adv/prep ] to hit something, often making a loud noise or causing damage: We could hear waves crashing on/against the shore. Suddenly, cymbals crashed and the orchestra began playing. A dog came crashing through the bushes. Without warning, the tree crashed through the roof.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang\nbang around\nbowl someone over\ncannon\ncatch\ncollision\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\ncrash verb\n(FAIL)\nC1 [ I ] If something such as a business crashes, it suddenly fails or becomes unsuccessful: Investors were seriously worried when the stock market began to crash.\nB2 [ I ] If a computer or system crashes, it suddenly stops operating: My laptop's crashed again.\nThesaurus: synonyms, antonyms, and examples\nto break downbreak downThe lift has broken down again.stop workingI don’t understand it - my phone just stopped working.crashWhen a computer crashes, you reboot.failThe train’s brakes failed, causing it to derail.\nSee more results »\n[ I ] to suddenly fall to a low level: Foods with a low glycaemic index, such as oats, won't cause your energy level to spike and crash. Demand slumped and prices crashed.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfloat\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nMachines - not functioning\nComputer concepts\nBecoming and making smaller or less\ncrash verb\n(SLEEP)\n[ I ] informal to sleep at someone else's house for the night, especially when you have not planned it: They crashed on my floor after the party.\nSMART Vocabulary: related words and phrases\nAnimal physiology: sleep & sleeping\nbeauty\nbed\nbunk\nbunk down\nbye-byes\ncatch/cop/get some z's idiom\ncount\ndelayed sleep phase pattern\ndoss\ndrift off\ndrop\npower nap\nsleep\nsnooze\nsnoozing\nsomnambulate\nsomnambulist\nsomnolence\nsoporifically\nyour beauty sleep idiom\nSee more results »\ncrash verb\n(ENTER WITHOUT PERMISSION)\n[ T ] informal to go to a party or other event without an invitation: We tried to crash the party, but the bouncers wouldn't let us in. See also\ngatecrash informal\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nIdiom\ncrash and burnPhrasal verb\ncrash out\ncrash noun [C]\n(ACCIDENT)\nB1 an accident involving a vehicle, usually a serious one in which the vehicle is damaged or someone is hurt: a car crash She had a crash on the way to work. They were only slightly injured in the crash. Synonyms\naccident\ncollision (ACCIDENT)\nsmash (ACCIDENT) UK\nsmash-up UKCompare\nfender bender US informal\nprang noun UK informal\nThesaurus: synonyms, antonyms, and examples\na traffic accidentaccidentAn accident on the M11 is blocking traffic in a northerly direction.collisionPolice responded to the collision and closed the road.head-onBoth drivers were injured in the head-on collision.shuntUK My insurance company refused to pay out after my little shunt.crashA serious crash on the motorway yesterday led to its closure for two hours.car crashHe died in a car crash.\nSee more results »\nErik Von Weber/The Image Bank/GettyImages\nMore examplesFewer examplesVictims of the crash will be compensated for their injuries.Human error has been blamed for the air crash.There was an extended news bulletin because of the plane crash.The crash was caused by metal fatigue in one of the propeller blades.The barrier absorbed the main impact of the crash.\nSMART Vocabulary: related words and phrases\nOn the road: accidents involving vehicles\na screech of brakes phrase\nanti-collision\nbird strike\nbrake\ncar crash\ncrash-landing\ncropper\nderailment\nfender bender\novershoot\nprang\nroad toll\nrubbernecking\nrun (something) into something/someone\nrun someone/something down\nrun someone/something over\nsideswipe\nsmash\nspin\nstack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\ncrash noun [C]\n(NOISE)\nB2 a sudden loud noise made when something breaks or falls: I heard a loud crash in the kitchen. The vase landed on the floor with a crash.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\ncrash noun [C]\n(FAILURE)\nC1 a sudden large fall in the value of a country's businesses: They lost a lot of money in the Stock Market crash.\na situation when a computer or system suddenly stops operating: a computer crash\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailures\nComputer concepts\nquick and involving a lot of effort: The company undertook a crash programme of machine replacement.\nSMART Vocabulary: related words and phrases\nFast and rapid\n(at) full speed/tilt/pelt idiom\napace\nas fast as your legs would carry you idiom\nas if it is going out of style idiom\nat a rate of knots idiom\nfleet\nhypersonic\nin the twinkling of an eye idiom\nJack Robinson\nlickety-split\nlight speed\nprompt\nsmartly\nsouped-up\nspanking\nspeed of light\nspread like wildfire idiom\nstreak\nsuper-express\nwildfire\nSee more results »\ncrash noun [C]\n(ACCIDENT)\nAdd to word list\nAdd to word list\na serious accident in which one or more cars, trucks, or other vehicles hit something, or in which an aircraft hits the ground or another aircraft: She was killed in an airplane crash in 1983.\ncrash noun [C]\n(NOISE)\na loud noise that sounds as if it is caused by something violently breaking apart or hitting something else: There was a loud crash, and we rushed over to see what had fallen.\ncrash noun [C]\n(FAILURE)\na sudden loss of value of investments, or a failure of a business\ncrash verb\n(GO WHERE NOT INVITED)\n[ T ] infml to go to a party or other event without an invitation: Some guys tried to crash the party but they weren’t allowed in.\ncrash verb\n(SLEEP)\n[ I ] slang to sleep, or to stay at a place to sleep temporarily: I was so tired after work, I crashed on the sofa.\ncrash verb\n(NOISE)\n[ always + adv/prep ] to fall or hit something in a noisy or violent way: [ I ] All the dishes the waitress was carrying crashed to the floor.\n[ always + adv/prep ] To crash is also to move in a noisy or violent way: [ I ] A big black bear came crashing through the underbrush.\ncrash verb\n(FAIL)\n[ I ] (of investments) to lose value, or (of a business) to lose money and be unable to continue to operate: When the market crashed, everyone lost money.\n[ I ] If a computer crashes, it suddenly stops operating.\ncrash verb\n(HIT VIOLENTLY)\n[ I/T ] (of a vehicle on the ground) to hit another vehicle or a large object violently, or (of an aircraft) to fall and violently hit the ground, a building, etc., or hit another aircraft while flying: [ I ] The plane crashed into the mountainside, killing all aboard.\ncrash adjective\n(QUICK)\ninvolving great effort to achieve a lot quickly: took a crash course in cooking\nA crash diet is a way of losing body weight quickly by eating very little.\nAdd to word list\nAdd to word list\nECONOMICS a sudden serious fall in the value of something, for example, of shares or of a particular area of business: A crash in China could also affect the global economy if the country's demand for imports and raw materials drops sharply. They had lost all their money in the Wall Street Crash of 1929. The stock market crash has had a major impact, with many investors still nursing big losses.crash in sth The crash in the property market has led to many houses being repossessed by mortgage companies.\nIT a sudden failure of a computer or system: Wednesday's state computer crash created far more problems than officials first realized.\n[ I ]\n&#160; ECONOMICS, FINANCE to suddenly lose value, in a way that is serious: crash from sth to sth Its share price has crashed from nearly £7 in November to just £0.50. Most experts agree that the market crashed because of unbridled speculation, low margins, and a lack of government oversight.\n[ I or T ]\n&#160; IT if a computer or system crashes, or if someone or something crashes it, it suddenly stops working: The server crashed twice and we had no idea why. The message will highlight the error that crashed the computer."}