{"id":112543,"name":"crater","type":"noun","us_sound":"ˈkreɪ.t̬ɚ","us_link":"../audio/c/crater.mp3","uk_sound":"ˈkreɪ.tər","uk_link":"../audio/c/ukcraps008.mp3","content":"Add to word list\nAdd to word list\nthe round hole at the top of a volcano, or a hole in the ground similar to this: the huge crater of Vesuvius a bomb crater With a good telescope, you can see craters on the moon. Compare\nabyss (HOLE) literary\ncanyon\nchasm\ncleft\ncrevasse\ndefile noun literary\ngorge noun (VALLEY)\ngulf (AREA) formal\ngully\nravine\nrift\nsinkhole noun (HOLE)\nChris Saulit/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nGeology: earthquakes & volcanic eruptions\naftershock\ndormant\nfault line\ngeyser\nlahar\nlava\nnon-volcanic\nphreatic\npyroclastic\nquake\nseismically\nseismograph\nshock wave\ntectonically\ntemblor\nthe Richter scale\ntremor\nvolcanic\nvolcano\nvulcanicity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: caves, cracks & crevices\nRelated word\ncratered\ncrater verb\n(FORM HOLE)\n[ T ] to make one or more round holes in the surface of something: They bombed the runway in order to crater it and make it unusable. The surface has been cratered by asteroid impacts.\n[ I ] to develop one or more round holes in the surface: The streets had started to crack and crater.\nMore examplesFewer examplesAbandoned mine shafts are everywhere, puncturing mountains and cratering the desert.The lawn was cratered but survived.The bullet pierced the outer case, cracked through the glass screen and cratered the left side of the keyboard.\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npiercing\npinprick\nshaft\nspyhole\nvoid\nSee more results »\ncrater verb\n(FALL)\n[ I ] mainly US (of a price, market, business, etc.) to fall or fail suddenly: If people grew too much corn, the surplus would cause the price to crater. The financial crisis circled the globe, sending financial markets cratering.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\n[ T ] mainly US to cause a price, market, business, etc. to fall or fail suddenly: How are they going to afford the interest payments without cratering the economy?\nMore examplesFewer examplesThe ill effects of the financial crisis caused Republicans' polling numbers to crater in many states.You could see the market starting to crater.Movies were already cratering before the economy turned down.She keeps nagging him to spend more time with her and their daughter, even as his business is cratering.While the sector's woes aren't enough to crater the shaky US economy, it could slow it.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nfreeze\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nAdd to word list\nAdd to word list\nearth science a large hole in the top of a volcano (= mountain made from liquid rock)\nA crater is also a large hole made by something hitting the ground with force: The meteorite left a crater six feet deep."}