{"id":112726,"name":"creation","type":"noun","us_sound":"kriˈeɪ.ʃən","us_link":"../audio/c/creation.mp3","uk_sound":"kriˈeɪ.ʃən","uk_link":"../audio/c/ukcream005.mp3","content":"Add to word list\nAdd to word list\nB2 the act of creating something, or the thing that is created: the creation of a new political party Their policies all emphasize the creation of wealth. This 25-foot-high sculpture is her latest creation. The fashion magazines were full of the latest Paris creations (= fashionable new clothes).\nMore examplesFewer examplesThe president has promised a new constitution and the creation of democratic power structures.The creation of independent states has led to a resurgence of nationalism.We sent her a copy of the book in acknowledgment of her part in its creation.These battles led to the creation of new kingdoms.She was responsible for the creation of a new charity.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerativity\ngrind something out\nhandmade\nknock\nknock off (something)\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\nin the Bible, the making of the world by God\nSMART Vocabulary: related words and phrases\nThe Bible - people, events & places\nAdam\nannunciation\napocalypse\napostolic\nEden\nepistle\nepistolary\nevangelist\nJesus Christ\nJudgment Day\nMadonna\npost-biblical\nPromised Land\npsalm\nresurrection\nthe ark\nthe disciples phrase\nthe last judgment\nthe Last Supper\nthe Second Coming\nSee more results »\nAdd to word list\nAdd to word list\nIn the Bible, (the) Creation is the making of the world by God.\nA creation is something that is made: [ C ] The fashion magazine had photos of the latest Paris creations.\nAdd to word list\nAdd to word list\nthe act or process of making, producing, or building something, or something that has been made, built, or produced: the creation of wealth Some local people are protesting at the creation of a national park in the county. The government should be concentrating on job creation , not on cutting benefits for the unemployed. See also\ncredit creation\njob creation\nventure creation"}