{"id":112733,"name":"creative","type":"adjective","us_sound":"kriˈeɪ.t̬ɪv","us_link":"../audio/c/eus75512.mp3","uk_sound":"kriˈeɪ.tɪv","uk_link":"../audio/c/ukcream007.mp3","content":"Add to word list\nAdd to word list\nB1 producing or using original and unusual ideas: a creative person/artist/designer/programmer creative talents/powers/abilities creative thinking\nThesaurus: synonyms, antonyms, and examples\nimaginativeimaginativeShe is often brilliantly imaginative in filling out the details of the writer's life.creativeThe designer is either a creative genius or completely bonkers.inventiveThe company was known for hiring inventive people who could dream up new products.innovativeShe was an innovative, entrepreneurial thinker.visionaryAn organization doesn't grow if you don't have a visionary leader to take you into the future.\nSee more results »\ndescribing or explaining things in unusual ways in order to deceive or give a false impression: They used rather creative methods to impress investors.\nMore examplesFewer examplesShe has been described as the creative colossus of the literary world.She's very creative on the design front .Like many creative individuals, she can be very bad-tempered.Excessive managerial control is inimical to creative expression.This early in the morning it's hard to get the creative juices flowing .\nSMART Vocabulary: related words and phrases\nInspiration and inspiring\nanti-creative\napostolic\nblue-sky\nbreathe (new) life into sth idiom\ncreatively\ndivergently\nengage\nenthral\nentrance\ngrip\nincentivize\ninspiration\nkindle\nPromethean\nre-engage\nshow\nshow (someone) the way idiom\nstimulating\nvisionary\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nCheating & tricking\nRelated words\ncreatively\ncreativity\na person whose job involves producing original ideas or doing artistic work: Several leading creatives are involved in the advertising campaign.\nSMART Vocabulary: related words and phrases\nTypes of employment\nadmin\nadministrative\nadministrative assistant\nadministratively\nat the coalface idiom\njobless\njoblessness\njobseeker\nlabour-intensive\nlackey\nrecertify\nredundancy\nredundant\nretcon\nroustabout\nwhite-collar\nwho's who idiom\nwilderness years idiom\nwork experience\nwork placement\nSee more results »\nAdd to word list\nAdd to word list\nproducing or using original and unusual ideas: a creative designer/person creative talents creatively adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/kriˈeɪ·t̬ɪv·li/\nAdd to word list\nAdd to word list\nproducing or using original and unusual ideas: creative artist/designer/person We attract creative people who want to get involved in building companies up.creative ability/potential/talent Every member of the organization has creative potential. We felt that it was a creative solution to a difficult problem. creatively adverb\nWorking in a cutting-edge environment makes us think more creatively. creativity noun [ U ]\nThe organization celebrates and rewards creativity in its staff.\ninformal a person whose job is to suggest new ideas or design, draw, or write things: The company has a team of 10 creatives working on the project. Compare\nsuit"}