{"id":112711,"name":"create","type":"verb","us_sound":"kriˈeɪt","us_link":"../audio/c/create.mp3","uk_sound":"kriˈeɪt","uk_link":"../audio/c/ukcream004.mp3","content":"create verb\n(MAKE)\nAdd to word list\nAdd to word list\nB1 [ T ] to make something new, or invent something: Charles Schulz created the characters \"Snoopy\" and \"Charlie Brown\". The Bible says that God created the world. He created a wonderful meal from very few ingredients. It's important to create a good impression when you meet a new client.\nThesaurus: synonyms, antonyms, and examples\nto make somethingmakeCan I make you a cup of coffee?produceCalifornia produces a lot of grapes.createLeonardo da Vinci created the masterpiece we know as \"Mona Lisa\".inventAlexander Graham Bell is credited with inventing the telephone.developThey are working to develop the next generation of underwater vehicles.manufactureThe car is manufactured in Germany.\nSee more results »\nMore examplesFewer examplesThe merger of these two companies would create the world's biggest accounting firm.The design company is planning to join up with a shoe manufacturer and create a new range of footwear.A large mirror in a room can create the illusion of space.As a parent you try to create a stable home environment for your children to grow up in.The prime minister claims that he wants to create a classless society.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerativity\ngrind something out\nhandmade\nknock\nknock off (something)\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\ncreate verb\n(BE ANGRY)\n[ I ] UK old-fashioned to show that you are angry: If she sees you with an ice cream she'll only start creating.\nSMART Vocabulary: related words and phrases\nBecoming angry and expressing anger\n(almost) burst a blood vessel idiom\nape\nballistic\nbananas\nbay for blood idiom\nblow\nchip\nfume\nget bent out of shape idiom\nget your knickers in a twist idiom\ngive someone evils idiom\ngo ape idiom\nroof\nsharp\nsplenetically\nstew\nstrop\ntemper\ntempered\nthrow\nSee more results »\nAdd to word list\nAdd to word list\nto cause something to exist, or to make something new or imaginative: He created some of the most magnificent works of art ever made. The new hotel is expected to create 200 jobs.\nAdd to word list\nAdd to word list\nto make something exist: create problems/responsibilitiescreate jobs/opportunities, etc. The new development will create hundreds of jobs in the area.create money/wealth We'll help you create wealth using tried-and-tested investment strategies.\nto make something new, especially to invent something: In 1991, McCahill and his researchers created an easy way to navigate the internet and find information on it, known as 'Gopher'.\nto form a new company, etc.: There are strict guidelines to be followed when you are creating a new company."}