{"id":112665,"name":"cream","type":"noun","us_sound":"kriːm","us_link":"../audio/c/cream.mp3","uk_sound":"kriːm","uk_link":"../audio/c/ukcraps029.mp3","content":"Add to word list\nAdd to word list\nA2 [ U ] the thick, yellowish-white liquid that forms on the top of milk: strawberries and cream Do you like cream in your coffee?UK a cream cake (= cake with cream in it)\nMaximilian Stock Ltd./Photolibrary/GettyImages\nA2 [ U ] the colour of cream\ndesifoto /DigitalVision Vectors/GettyImages\nB1 [ C or U ] a soft substance that you rub into your skin: face/hand cream moisturizing cream Put some sun cream on to protect your face.\nmoonHo Joe/iStock/Getty Images Plus/GettyImages\n[ C ] a type of sweet that is soft inside: chocolate/peppermint creams\npamela_d_mcadams/iStock/Getty Images Plus/Getty Images /GettyImages\n[ U ] a thick liquid used for cleaning things: cream cleaner cream of mushroom, tomato, etc. soup\nsoup that has been made into a smooth thick liquid and usually has cream in it: Not many people keep a can of cream of tomato soup in their kitchen, but it makes an excellent base for casseroles.\nSee more\nMore examplesFewer examplesI had this fabulous dessert with alternate layers of chocolate and cream.These cakes are filled with fresh cream.Serve the tarts hot with custard or whipped cream.Would you like peaches and cream for dessert?The pasta was served in a cream sauce spiked with black pepper.\nSMART Vocabulary: related words and phrases\nDairy products & eggs\nalbumen\nbeurre noisette\nbrown butter\nbutter\nbutterfat\ncurd\ndairy\nDevonshire cream\ndouble cream\ndried milk\nlacteal\nlactic\nlight cream\nmilk fat\nmylk\nsour cream\nsoya milk\nsunny side up idiom\nUHT\nultra-pasteurized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBlack, white & grey\nToiletry & perfumes\nSweets\nCleaning agents\nIdiom\nthe cream of something\nA2 having a yellowish-white colour: a cream shirt\nMore examplesFewer examplesDo you think the cream dress and the blue jacket go together?Huw wants dark red walls, but I'd rather a more neutral colour like cream.She looked beautiful in a cream satin dress.The woodwork has all been painted a sort of off-white or cream colour.I'd just choose a cream bedcover which would bring out the colour of the cushions and curtains.\nSMART Vocabulary: related words and phrases\nLess common colours\napple green\nargent\nashy\navocado\nbisque\ncarmine\ndun\nearth tone\nemerald\npuce\nrust\nsaffron\nsalmon pink\nsanguine\nsapphire\nsky blue\nslaty\ntangerine\ntaupe\nverdure\nSee more results »\nto make food into a smooth, thick liquid: Cream the butter and sugar together.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nPhrasal verb\ncream something/someone off\ncream noun [U]\n(LIQUID)\nAdd to word list\nAdd to word list\nthe thick, yellow-white liquid that forms on the top of milk: Do you take cream in your coffee?\nCream is also a pale yellow-white color.\nCream also refers to any of various foods that contain cream or that are smooth like cream: cream of chicken soup chocolate cream pie\ncream noun [U]\n(THICK SUBSTANCE)\na thick, smooth substance that you put on your skin to keep it soft or to treat it medically: a facial cream Idiom\nthe cream of the crop"}