{"id":112789,"name":"credit","type":"noun","us_sound":"ˈkred.ɪt","us_link":"../audio/c/credit.mp3","uk_sound":"ˈkred.ɪt","uk_link":"../audio/c/ukcream021.mp3","content":"credit noun\n(PRAISE)\nAdd to word list\nAdd to word list\nB2 [ U ] praise, approval, or honour: She got no credit for solving the problem. Her boss took credit for it/took (all) the credit instead. To her (great) credit, she admitted she was wrong. I gave him credit for (= thought that he would have) better judgment than he showed. be a credit to someone/something\nto do something that makes a person, group, or organization feel proud or receive praise: She is a credit to her family.\nSee more do your family, parents, teacher, etc. credit\nto cause someone who has been or is responsible for you to receive praise by your good behaviour or successful actions: She does her teachers credit.\nSee more all credit to someone\nused to show that you think a person deserves a lot of praise for something that they have done: All credit to her, she did it all herself.\nSee more\nMore examplesFewer examplesWe only deal with companies that have a good credit record.He has a good credit history .The government has imposed a sharp credit squeeze in an attempt to hold down inflation.We can get a year's interest-free credit on a sofa.\nSMART Vocabulary: related words and phrases\nPraising and applauding\nacclaim\nacclamation\naccolade\nadulate\nadulation\ncomplimentary\nenthronement\neulogistic\neulogistically\neulogize\neulogy\nhail\nhonour\novation\npaean\npanegyric\npanegyrical\npanegyrist\nrave\nslap\nSee more results »\ncredit noun\n(MONEY)\nB1 [ U ] a method of paying for goods or services at a later time, usually paying interest as well as the original money: They decided to buy the car on credit. The shop was offering six months' (interest-free) credit on electronic goods. Compare\ndebit noun\nB1 [ C or U ] money in your bank account: I was relieved to see from my statement that my account was in credit.\nMore examplesFewer examplesHer credit is good .UK Now I've paid in that cheque, I'm in credit again.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nProfits & losses\ncredit noun\n(COURSE UNIT)\nB2 [ C ] a unit that represents a successfully finished part of an educational course: Each of these classes is worth three credits.\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nwork placement\nworkshop\nSee more results »\ncredit noun\n(LIST OF NAMES)\nthe credits [ plural ]\na list of people who helped to make a film or a television or radio programme, that is shown or announced at the beginning or the end of it: Everyone in the cinema was in tears by the time the credits rolled.\nSee more Idiom\n(to give) credit where credit's due\ncredit verb\n(PAY)\n[ T ] to pay money into a bank account: They credited my account with $20 after I pointed out the mistake.\nMore examplesFewer examplesThey've credited my account with another £100.We'll credit you with the remaining amount next week.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank balance\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\nelectronic banking\ngiro\ninvestment bank\npin\nsafe deposit box\nstatement\nstress test\nsuperbank\nthe Square Mile\nSee more results »\ncredit verb\n(BELIEVE)\n[ T not continuous ] to believe something that seems unlikely to be true: He even tried to pretend he was my son - can you credit it? It was hard to credit some of the stories we heard about her.\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\nSMART Vocabulary: related words and phrases\nBelieving\naccept\nallegedly\narticle of faith\nascribe something to something\nascription\nbelief\ndeluded\nevidently\nfeel it in your bones idiom\ngive someone the benefit of the doubt idiom\ngospel\nhold\nrecognize\nroom for doubt idiom\nsee something in someone/something\nseeing is believing idiom\nself-deceit\nself-deceiving\nstock\nword\nSee more results »\nPhrasal verb\ncredit someone with something\ncredit noun\n(PAYMENT LATER)\nAdd to word list\nAdd to word list\n[ U ] a method of buying goods or services that allows you to pay for them in the future: We bought our sofa on credit. The bank offers small businesses credit.\ncredit noun\n(PRAISE)\n[ C/U ] praise or approval, esp. to recognize achievement: [ U ] You have to give him credit for being so honest. [ U ] How can he take credit for work he didn’t do?\ncredit noun\n(MONEY AVAILABLE)\n[ C/U ] an amount of money available to you because you paid for something earlier, or a record of this money: [ C ] We returned the clothes and got a store credit.\n[ C/U ] A credit is also an amount of money you do not have to pay: [ C ] a tax credit\ncredit noun\n(COURSE UNIT)\n[ C ] a unit of measurement of the value contributed by an educational course to a college degree: Comparative religion is a three-credit course. Idioms\na credit to someone/something\nto someone’s credit\ncredit verb [T]\n(BELIEVE)\nto believe or trust something that may not be true: If you can credit what the doctor says, the illness isn’t serious. creditable adjective us\nYour browser doesn't support HTML5 audio\n/ˈkred·ət̬·ə·bəl/\nShe gave a creditable performance of a woman in love. Phrasal verb\ncredit someone with something\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE, FINANCE a method of paying for goods or services at a later time, usually paying interest as well as the original amount: give/extend/offer credit to sb U.S. banks are reluctant to extend credit to the troubled nation.deny/refuse sb credit Have you ever been refused credit?on credit They've purchased all sorts of leisure equipment on credit. The card has no annual fee and users get up to eight weeks' interest-free credit.\n[ U ]\n&#160; FINANCE the money lent by financial organizations to companies, governments, people, etc.: domestic/foreign/international credit The central bank attributed the rise in domestic credit during the period to a rise in private sector credit.cheap/affordable/easy credit Rising house prices were fueled by easy credit. Agricultural borrowers are concerned about credit availability as the farm economy weakens.\n[ U ]\n&#160; FINANCE the amount of risk when lending money to a particular person or organization, based on how likely they are to pay it back: weak/poor/bad credit Too many mortgages had been granted to home buyers with weak credit.good credit They will let you take the goods and pay later if your credit is good.\n[ C ]\n&#160; BANKING a payment of money into a bank account: His bank statement shows two credits of $5000 each. Compare\ndebit noun\nin credit\nBANKING\n&#160; UK if a person or their bank account is in credit, there is money in the account: As long as you stay in credit, there will be no charges for normal transactions on your account.\n[ C ]\n&#160; ACCOUNTING\n&#160; ( abbreviation CR) an amount recorded on the right side of a company's financial accounts, which shows a decrease in assets or an increase in debt: The accounting system automatically generates a credit to the account that was debited. Compare\ndebit verb\n[ C or S ]\n&#160; TAX an amount by which someone is allowed to reduce the amount of tax they pay, because they have spent money on a particular thing: He introduced a new tax break in the form of a child-care credit. See also\ntax credit\n[ C or U ]\n&#160; ACCOUNTING, COMMERCE an amount of money that you have available to spend with a store or business, for example, because you returned a product or paid too much for it: If you are dissatisfied with any item, it may be returned within 14 days for credit, refund, or exchange.\n[ U ] praise for doing something good: credit for sth The whole team deserves credit for bringing the project in on time.take (the) credit She felt he had taken the credit for her idea.\nSee also\nbank credit\nbank giro credit\nbilateral credit\ncarbon credit\nconfirmed letter of credit\nconsumer credit\ndeferred credit\ndocumentary credit\nemission credit\nexport credit\nView all\nextended credit\nlong-term credit\nmedium-term credit\npollution credit\nrevolving line of credit\nsecured credit\nshort-term credit\ntax credit\ntrade credit\nunsecured credit\nBANKING, FINANCE to show that money has been added to something such as an account: When dividends are received the shareholder's account will be credited.credit sth with €10/€1000, etc. Within a week my card was credited with the $219 difference.credit €10/€1000, etc. to sth The bank mistakenly credited almost $1 million to his account.\nACCOUNTING to record an amount on the right side of a company's financial accounts to show a decrease in assets or an increase in debt: credit sth to sth A fair amount should be periodically credited to 'reserve' for depreciation."}