{"id":112842,"name":"creep","type":"verb","us_sound":"kriːp","us_link":"../audio/c/creep.mp3","uk_sound":"kriːp","uk_link":"../audio/c/ukcreed002.mp3","content":"Add to word list\nAdd to word list\nC2 to move slowly, quietly, and carefully, usually in order to avoid being noticed: She turned off the light and crept through the door. Someone was creeping around outside my window. The spider crept up the wall. The traffic was creeping along at a snail's pace.\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto move slowlycrawlThere'd been a bad accident on the motorway and traffic was crawling.trundleLorries trundle through the narrow lanes.creepHe crept downstairs, hardly making any noise.trudgeThey trudged wearily through the snow.strollWe spent the afternoon strolling around Budapest.ambleHe ambled over to the window.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving to avoid being seen\nprowl\nskulk\nslink\nsneak\nspirit\nstalk\nstalking\nsteal\nstealth\nstealthily\nstealthy\nYou can also find related words, phrases, and synonyms in the topics:\nSlow and moving slowly\nPhrasal verbs\ncreep in/creep into something\ncreep over someone\ncreep up\ncreep up on/behind someone\ncreep up on someone\ncreep noun\n(PERSON)\n[ C ] UK someone who tries to make someone more important like them by being very polite and helpful in a way that is not sincere: Making coffee for the boss again? You creep!\nC2 [ C ] an unpleasant person, especially a man: He was such a creep - he was always staring at me in the canteen. [ as form of address ] Leave me alone, creep!\nSMART Vocabulary: related words and phrases\nPraising insincerely or too eagerly\nbackhanded compliment\nbootlicker\nbow and scrape idiom\ncrawler\ncupboard love\ngrovel\ngrovelling\ngrovellingly\nhagiographic\nidealization\nobsequious\nobsequiously\npeople pleaser\nplay up to someone\nschmooze\nsycophantic\nsycophantically\ntoady\ntoadying\nunctuous\nSee more results »\ncreep noun\n(GROWTH)\n[ U ] the gradual growth or increase of something in a way that was not expected or wanted: There is growing evidence that labour cost creep is becoming a problem. See also\nmission creep\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\ngive someone the creeps\nto cause someone to have uncomfortable feelings of nervousness or fear: Living next to a graveyard would give me the creeps.\nSee more\ncreep verb [I always + adv/prep]\n(MOVE CAREFULLY)\nAdd to word list\nAdd to word list\npast tense and past participle crept us/krept/ to move quietly and carefully, usually in order to avoid being noticed: I crept around the corner, hoping my brother wouldn’t see me.\ncreep verb [I always + adv/prep]\n(MOVE SLOWLY)\npast tense and past participle crept to move very slowly: We were creeping along in rush-hour traffic. Phrasal verb\ncreep up on someone\ncreep noun [C]\n(PERSON)\na person you think is unpleasant and to be avoided: That guy upstairs is such a creep.\nAdd to word list\nAdd to word list\nto change very slowly, especially to increase: Fuel prices dropped in April, but they are starting to creep higher now. Phrasal verbs\ncreep in/creep into sth\ncreep up/creep upwards\nslow and gradual change, especially when something increases: Gasoline price creep has been noticeable recently. The economic crisis now has a new dimension: the steady creep of inflation."}