{"id":112897,"name":"creme","type":"noun","us_sound":"krem","us_link":"../audio/c/cdo0623uscrem0772.mp3","uk_sound":"krem","uk_link":"../audio/c/cdo0623ukcrem0770.mp3","content":"Add to word list\nAdd to word list\na soft substance that you use to improve the appearance of your skin or hair or use as make-up: She believes that a good eye creme is essential if you're over 30. This creme blusher is easy to apply.\n[ U ] mainly US a soft, usually sweet, food substance that looks or tastes similar to cream: This is a sandwich made with peanut butter and marshmallow creme. The snack cakes have a delicious creme filling.\n[ C ] mainly UK a sweet or biscuit with a soft, sweet filling: Do you prefer coconut cremes or caramels? Would you like one of these chocolate sandwich cremes? Synonym\ncreamSee also\ncrème anglaise\ncrème brûlée\ncrème caramel\ncrème fraîche\nMore examplesFewer examplesI prefer to use self-tanning creme rather than spray tan. This creme rinse conditions the hair beautifully.For dessert I had the vanilla creme pie, and my friend had the chocolate cupcakes. They used to buy old-fashioned selection boxescontaining fruity cremes, nougats, and the occasional champagne truffle.All that's left is a coffee creme and a hazelnut whirl.\nSMART Vocabulary: related words and phrases\nToiletry & perfumes\naftershave\nagarbatti\nair freshener\nbath bomb\nbath salts\nbathroom tissue\nbinturong\ncarbolic soap\nemery board\nfacecloth\npowder puff\nsanitary\nscrub\nshave\nshower gel\nSPF\nswab\ntoilet soap\ntowelette\nylang-ylang\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMake-up & skin care\nPuddings, desserts & ices\nDairy products & eggs\nSweets\nA creme liqueur (= a strong, sweet alcoholic drink) is rich and sweet: In this cocktail, the cream is replaced with an Irish creme liqueur. There was still a drop of crème de cassis at the bottom of the bottle. See also\ncrème de menthe\nMore examplesFewer examplesA Kir Royale is a mixture of champagne and creme de cassis.Add some icing sugar and a drizzle of creme de peche.\nSMART Vocabulary: related words and phrases\nSpirits & distilling\nabsinthe\namaretto\napplejack\nbenedictine\nbitter\ncordial\ncrème de menthe\ncuraçao\ndistil\ndistillation\nliqueur\nmalt\nmalt whisky\nmother's ruin\nouzo\nsloe gin\nsmall-batch\nsotol\nspirit\ntoddy\nSee more results »"}