{"id":112951,"name":"creole","type":"noun","us_sound":"kriˈoʊl","us_link":"../audio/c/creole.mp3","uk_sound":"kriˈəʊl","uk_link":"../audio/c/ukcreed015.mp3","content":"Add to word list\nAdd to word list\na language that has developed from a mixture of languages: creole-speaking tribes A creole develops a wider range of words, grammatical structures, and styles than is found in a pidgin.\nMore examplesFewer examplesDocuments provide evidence that creoles are continuously changing.Pidgins become creoles when they are used by people as a mother-tongue.Many Afro-Caribbean Englishes are creoles.\nSMART Vocabulary: related words and phrases\nLanguage names\nAlbanian\nAmerican English\nAmharic\nAngrezi\nAramaic\nEbonics\nFilipino\nFinno-Ugric\nGeorgian\nGreenlandic\nGujarati\nMoldovan\nMongolian\nMontenegrin\nMonégasque\nNauruan\nRomany\nUzbek\nVietnamese\nYiddish\nSee more results »\nCreole noun\n(LANGUAGE)\n[ C or U ] an American or Caribbean language that is a combination of a European language and another language and is a main language in parts of the southern US and the Caribbean\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\nMFL\npidgin\nplain English\nPolari\nrhyming slang\nshibboleth\nslang\nslangily\ntongue\nSee more results »\nCreole noun\n(PERSON)\n[ C ] someone who is related to the first Europeans who came to the Caribbean or the southern US\n[ C ] a person of mixed African and European origin who speaks a language that is a combination of a European language and an African language\nrelating to Creoles (= people related to the first Europeans who came to the Caribbean or the southern US, or people of mixed African and European origin): I love Creole cooking, so hot and spicy. The restaurant plays live creole music some evenings.\nMore examplesFewer examplesThe zest of the fruit is widely used in creole cuisine.A creole nanny wearing a striped uniform is pushing the twin boys gently around.Add breadcrumbs and creole seasoning, and scatter over the pasta mixture.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\nMFL\npidgin\nplain English\nPolari\nrhyming slang\nshibboleth\nslang\nslangily\ntongue\nSee more results »\nCreole noun [C]\n(LANGUAGE)\nAdd to word list\nAdd to word list\nany of several languages developed in some Caribbean islands that combine African languages and Indian languages with French or Spanish: Creole is one of the official languages of Haiti.\nCreole noun [C]\n(PERSON)\na white person who is related to the original group of Spanish or French people who came to the Caribbean or Louisiana, or a person of color from some Caribbean islands who is of mixed African and European origin and who speaks esp. French Creole"}