{"id":113084,"name":"cretaceous","type":"adjective","us_sound":"krɪˈteɪ.ʃəs","us_link":"../audio/c/usa31126.mp3","uk_sound":"krɪˈteɪ.ʃəs","uk_link":"../audio/c/uka31126.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between around 144 and 65 million years ago, in which plants with flowers first appeared: the Cretaceous period Cretaceous rocks Sponges are often preserved inside flints, which were originally deposited as hard layers within the Cretaceous chalk.\nMore examplesFewer examplesIt thrived in the late Cretaceous period only a few million years before all the dinosaurs on Earth became extinct.There was an abundance of ammonites, considered index organisms of the uppermost Cretaceous environment.The volcanoes in question may have erupted too early to account for the Cretaceous warming.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nsyncline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Cretaceous\nthe period between around 144 and 65 million years ago, in which plants with flowers first appeared: In the Cretaceous, beetles and flies were the first pollinators. Fossil remains from the Cretaceous are almost always found in sedimentary deposits.\nMore examplesFewer examplesThe Cretaceous was the last of the Mesozoic periods and had the most dramatic and varied life forms.The researchers concluded that the dinosaurs were doing well at the end of the Cretaceous.Widespread volcanic eruptions swept India at the end of the Cretaceous.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nsyncline\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}