{"id":113127,"name":"crew","type":"noun","us_sound":"kruː","us_link":"../audio/c/crew.mp3","uk_sound":"kruː","uk_link":"../audio/c/ukcrew_001.mp3","content":"crew noun\n(group of people)\nAdd to word list\nAdd to word list\nB1 [ C, + sing/pl verb ] a group of people who work together, especially all those who work on and operate a ship, aircraft, etc.: an ambulance/lifeboat crew a TV/film/camera crew The aircraft has/carries a crew of seven. See also\naircrew\n[ C ] the people who work on a ship, aircraft, etc. who are not officers: Apart from the ten officers, a crew of 90 takes care of the 300 passengers.\nMore examplesFewer examplesA Spanish crew member had been washed overboard in the storm.He is a member of our camera crew.Ambulance crews battled to rescue people trapped in the wreckage.\nSMART Vocabulary: related words and phrases\nAir travel: workers on/with aircraft & spacecraft\nair hostess\nair marshal\nair traffic control\nair traffic controller\naircrew\naviator\nbaggage handling\nballoonist\ncabin crew\nco-pilot\ncosmonaut\nflight attendant\nground crew\nnavigator\npurser\nsky marshal\nskycap\nspaceman\nspacewoman\nwingman\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who work on boats & ships\nGroups of people\ncrew noun\n(rowing)\n[ U ] US the sport of rowing a boat (= causing it to move through water using poles with flat ends called oars): I'd never participated in any team sports until I did crew. She donated millions of dollars to make women's crew a varsity sport. Porterfield would go on to row crew for the US national team. He plays hockey and rows on the crew team.\nRobert Llewellyn/Corbis/GettyImages\nIf you crew a boat, or crew for someone on their boat, you help to sail it.\nSMART Vocabulary: related words and phrases\nSailing & boating\nage of sail\naweigh\nbale\nbargee\nbargeman\nbear away\nmaritime\nocean-going\noutsail\nportage\nrafter\nrafting\nsail\nsailing\nsea legs\nseafaring\nseamanship\nseaworthy\nshipboard\nunder sail idiom\nSee more results »\nAdd to word list\nAdd to word list\nall the people who work together, esp. to operate a ship or aircraft, or all the people of lower rank: [ U ] The captain and crew would like to welcome you on board. [ C ] Jack worked on a road-repair crew.\nAdd to word list\nAdd to word list\na group of people who work together, especially all those who work on and operate a ship, plane, etc.: an ambulance/lifeboat crew a TV/film/camera crew The aircraft has/carries a crew of seven.\nthe people who work on a ship, plane, etc. who are not officers: Apart from the 10 officers, a crew of 90 looks after the 300 passengers."}