{"id":113242,"name":"criminal","type":"noun","us_sound":"ˈkrɪm.ə.nəl","us_link":"../audio/c/criminal.mp3","uk_sound":"ˈkrɪm.ɪ.nəl","uk_link":"../audio/c/ukcrew_013.mp3","content":"Add to word list\nAdd to word list\nB1 someone who commits a crime: a dangerous/violent criminal Synonyms\ncrook (CRIMINAL) informal\nculprit\nevildoer\nfelon specialized\nthe guilty party\nmalefactor formal\noffender\noutlaw\nperpetrator\nvillain UK informal\nwrongdoer formal\nMore examplesFewer examplesToday's problem child may be tomorrow's criminal.The police officer told the criminal that he had the right to remain silent.If you spend any time in prison, you're labelled as a criminal for the rest of your life.Many of the country's toughest criminals are held in this prison.Many people argue that allowing a criminal to go free is better that imprisoning an innocent person.\nSMART Vocabulary: related words and phrases\nCriminals - general words\nabettor\naccessory\naccomplice\nanti-gang\nbe in the frame (for something) idiom\ndelinquent\ngangbanger\ngangland\njuvenile delinquent\nlawbreaker\nlowlife\nperp\nperpetrator\nprevious\nprobationer\nrecidivist\nviolator\nwanted\nwhite-collar criminal\nwrongdoer\nSee more results »\nB2 relating to crime: criminal activity a criminal act/offence criminal behaviour a criminal investigation\nvery bad or morally wrong: It's criminal to charge so much for a book. The way we waste this planet's resources is criminal.\nMore examplesFewer examplesTo this day she remains impenitent about her criminal past.When the authorities inquired into his background, they found he had a criminal record.Researchers have just completed the largest-ever survey of criminal behaviour in the UK.She has strenuously denied any criminal wrongdoing.The 19-year-old will be appearing in court on Thursday where she will face criminal charges.\nSMART Vocabulary: related words and phrases\nLegal & illegal\nbang to rights idiom\nbootleg\nchargeable\nconcealed carry idiom\ncontroverted election\ncriminally\nillegality\nimproper\nlegality\nlegitimately\nlicensed\nlicit\nlicitly\nnon-criminal\nshady\ntreasonable\nunlawful\nunsanctioned\nvalidity\nvalidly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorally wrong and evil\nRelated words\ncriminality\ncriminally\nAdd to word list\nAdd to word list\ninvolving or having the character of a crime: She may face criminal charges for lying to a grand jury. He had an extensive criminal record (= an official record of having committed many crimes). The way she blames other people for her own mistakes is criminal (= wrong). criminally adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈkrɪm·ə·nəl·i/\nParents can be held criminally responsible for their children’s actions.\na person who has committed a crime or been found guilty of committing a crime\nAdd to word list\nAdd to word list\na person who commits a crime: a convicted criminal.\nrelating to crime, or to the laws, etc. that deal with crime: criminal activity/behaviour a criminal act/offence a criminal investigation"}