{"id":113234,"name":"crime","type":"noun","us_sound":"kraɪm","us_link":"../audio/c/crime.mp3","uk_sound":"kraɪm","uk_link":"../audio/c/ukcrew_012.mp3","content":"crime noun\n(ACTIVITY)\nAdd to word list\nAdd to word list\nB1 [ U ] illegal activities: The rate of violent crime fell last month. serious crime gun/knife crime a life of crime a rising crime rate a crime wave crime prevention See also\ncybercrime\norganized crime\npetty crime\nwhite-collar crime\nB1 [ C ] an illegal act: He has admitted committing several crimes, including fraud. The defendant is accused of/charged with a range of crimes, from theft to murder. He should not be allowed to question the victims of his alleged crimes. A knife was found at the scene of the crime/the crime scene. See also\nhate crime\ncrime against humanity\nwar crime\n[ S ] an unacceptable or very unreasonable act or situation: To have hundreds of homeless people sleeping in the streets of a rich city like London is a crime . It would be a crime (= very wrong) to spend such a beautiful day indoors.\nMore examplesFewer examplesSomething must be done to reduce the level of crime in the area.Someone of your description was seen in the area on the night of the crime.The jury has to decide whether a person is guilty or innocent of a crime.In Britain, half of all violent crime is perpetrated by people who have been drinking alcohol.There are few crimes more truly shocking than the murder or abuse of children.\nSMART Vocabulary: related words and phrases\nCrime - general words\nanti-crime\nanti-fraud\nanti-narcotics\narrestable\ncaper\ncarrying-on\ndelinquent\ndriving under the influence\nDUI\nfelonious\nfeloniously\nfelony\nillegality\noutrage\npetty crime\nprotection racket\nrap sheet\nsecond-degree\nwrongdoing\nzero tolerance\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDifficult situations and unpleasant experiences\ncrime noun\n(BOOKS, ETC.)\n[ U ] books, films, and TV shows about crimes being committed and investigated (= examined to find the truth about them): I read all kinds of books, but crime is my favourite genre. crime fiction/novels a crime writer/novelist See also\ntrue crime\nMore examplesFewer examplesHe made films in such varied genres as war dramas, crime, Westerns, and comedy.Agatha Christie is sometimes known as \"the Queen of Crime\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndime novel\ne-reader\neasy read\nexercise book\nfiction\nmust-read\nnovel\nnovelette\nnovelistic\nnovelistically\ntrilogy\nvade mecum\nworkbook\nya\nyoung adult\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema ratings & types of film\nIdiom\ncrime doesn't pay\nAdd to word list\nAdd to word list\nan action or activity that is against the law, or illegal activity generally: [ U ] Violent crime has been reduced. [ C ] It’s a crime to yell \"fire\" in a crowded theater if there isn’t one. [ C ] If you commit a crime, you will be punished.\nPeople say something is a crime if it is wrong: [ C usually sing ] It’s a crime that people go to bed hungry in this country.\nAdd to word list\nAdd to word list\n[ U ] illegal activities: The area was plagued with failing schools, rising crime and poor healthcare. Unemployment is associated with a rising crime rate. crime prevention petty/serious crime The judicial system has been too soft on corruption and white-collar crime. The number of cases of computer crime has continued to increase. The new database will help in the fight against identity fraud and organized crime.combat/tackle crime Most local stores were involved in the initiative to tackle retail crime.\n[ C ] an illegal act: commit a crime The former chief executive had committed a crime and was brought to justice.be accused of/charged with/convicted of a crime The defendant is accused of a range of crimes, from fraud to embezzlement of company funds."}