{"id":113322,"name":"cringe","type":"verb","us_sound":"krɪndʒ","us_link":"../audio/c/cringe.mp3","uk_sound":"krɪndʒ","uk_link":"../audio/c/ukcrew_022.mp3","content":"Add to word list\nAdd to word list\nto suddenly move away from someone or something because you are frightened: She didn't think she was afraid of being vaccinated, but cringed when she saw the needle. This scene will have audiences cringing in fear.\ninformal to feel very embarrassed, and often show this by a physical movement or expression: I cringed at the sight of my dad dancing. Their praise was so gushing it made me cringe. When I hear my own voice played back I just sit there cringing.\nMore examplesFewer examplesHe cringed and whimpered like a terrified animal.He looked so angry that it made her want to cringe in the corner.When I think of the clothes I used to wear at the time, I cringe!Although he's been acting for years, he still cringes when he sees himself on screen.She cringes with guilt when she describes the way she behaved at the time.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerkily\njerkiness\njerky\njig\njiggle\nquake\nquiver\nshaky\nshook\nshudder\nsquirm\ntoss\ntremulous\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmbarrassing\nvery embarrassing, because of being so bad or silly: Everything he posts on social media seems so cringe. When you're watching the show you constantly think \"this is cringe\", but it's completely addictive! Synonyms\ncringe-making\ncringeworthy\ncringey\nMore examplesFewer examplesWhat's the most cringe thing you've ever done?\nSMART Vocabulary: related words and phrases\nEmbarrassing\nawkward\nblushingly\ncringe comedy\ncringe-making\ncringeworthy\ncurl up and die idiom\nembarrass\nembarrassing\nembarrassingly\ninformation\npainful\nshow\nshow up\nspare\nspare someone's blushes idiom\nspot\nTMI\ntoe-curling\ntoo much information idiom\nSee more results »\nused for showing that you think something is very embarrassing or bad: She walked in full of confidence, slipped and fell over — cringe! Who wants fat-free chocolate cake? Cringe!\nMore examplesFewer examplesThey share every intimate detail of their medical conditions. Cringe!\nSMART Vocabulary: related words and phrases\nEmbarrassing\nawkward\nblushingly\ncringe comedy\ncringe-making\ncringeworthy\ncurl up and die idiom\nembarrass\nembarrassing\nembarrassingly\ninformation\npainful\nshow\nshow up\nspare\nspare someone's blushes idiom\nspot\nTMI\ntoe-curling\ntoo much information idiom\nSee more results »\nAdd to word list\nAdd to word list\nto feel embarrassed and ashamed about something: I cringed when I realized what I’d said.\nTo cringe is also to pull back in fear from someone or something that seems powerful and dangerous: He cringes every time he hears the dentist’s drill."}