{"id":113629,"name":"crisis","type":"noun","us_sound":"ˈkraɪ.sɪs","us_link":"../audio/c/crisis.mp3","uk_sound":"ˈkraɪ.sɪs","uk_link":"../audio/c/ukcripp003.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a time of great disagreement, confusion, or suffering: The country's leadership is in crisis. an economic/financial crisis We have a family crisis on my hands - my 16-year-old sister is pregnant.\n[ C ] an extremely difficult or dangerous point in a situation: crisis talks A mediator has been called in to resolve the crisis. in crisis\nexperiencing a time of great difficulty, danger, or suffering: The series focuses on understanding the political, economic, and social forces shaping parts of the world that are in crisis.\nSee more\n[ C ] mainly US (also crisis point) a moment during a serious illness when there is the possibility of suddenly getting either better or worse: He's passed the crisis - the fever's started to go down. a crisis of confidence\na sudden loss of confidence: With inflation at 500 percent, the country faces a crisis of confidence.\nSee more Synonyms\ncalamity\ncataclysm literary\ncatastrophe\ndisaster\nemergency\ntragedy\nMore examplesFewer examplesIt may yet be possible to find a peaceful solution to the crisis.The country is in the midst of an economic crisis.Talks were held in Madrid about the fuel crisis.Falling house prices are illustrative of the crisis facing the construction industry.The two groups will meet next week to try to defuse the crisis.The media never tire of telling us that Europe is somehow \"in crisis\". Plastic surgery is fine for people with a strong self-image but bad for people \"in crisis\" - getting divorced, coping with a death, or who've just lost a job, for example.\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nAdd to word list\nAdd to word list\nan extremely dangerous or difficult situation: [ C ] an economic crisis [ U ] People react in times of crisis, but ignore us the rest of the time.\nAdd to word list\nAdd to word list\na situation that is extremely difficult or dangerous, when there are many problems: a major/serious/global crisis an economic/financial/political crisisa looming/impending/growing crisis This matter needs to be discussed, in the light of the looming pensions crisis.cause/create a crisis The ban, fortunately, did not create a crisis in the dairy industry.face a crisis The industry is facing a serious staffing crisis.a crisis arises/occurs/deepens This article examines how the debt crisis arose,address/resolve/solve a crisis A mediator has been called in to resolve the crisis. The country's leadership is in crisis.\ncrisis of confidence\na situation when people become less confident and start to worry: The company's poor trading figures provoked a crisis of confidence on the stock markets."}