{"id":113655,"name":"crispness","type":"noun","us_sound":"ˈkrɪsp.nəs","us_link":"../audio/c/uscreva017.mp3","uk_sound":"ˈkrɪsp.nəs","uk_link":"../audio/c/ukcripp007.mp3","content":"crispness noun [U]\n(OF FOOD)\nAdd to word list\nAdd to word list\n(of fruit or vegetables) the quality of being fresh, firm, and pleasant to eat: Celery loses its crispness when it is no longer good to eat. The broccoli was cooked to the right degree of crispness.\n(of cooked foods such as pastry and biscuits) the quality of having been cooked well enough to be dry and hard in a pleasant way: The skins can be left on the potatoes for extra crispness. For maximum crispness, cook the pizza on a pizza stone.\nMore examplesFewer examplesHarvest lettuce in the morning to preserve the crispness it acquires overnight.He pulled back the husk of an ear of corn to test its crispness.The sausages lack crispness or sizzle.The top of the pie has an amazing crispness to it.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatant\nerect\nfirm\nfirmness\nfossilized\nharden\nramrod\nrigid\nrigidity\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVarious qualities of food\ncrispness noun [U]\n(OF PAPER, CLOTH)\n(of cloth or paper) the quality of being stiff and smooth: Damp clothes had dried to a crispness over a string line in the kitchen. The e-book's screen is designed to replicate the crispness of a paper page.\nMore examplesFewer examplesI knew he was an officer from the crispness of his uniform.He could feel the lacquered crispness of her hair on his ear.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatant\nerect\nfirm\nfirmness\nfossilized\nharden\nramrod\nrigid\nrigidity\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »\ncrispness noun [U]\n(OF IMAGE, SOUND)\n(of an image or sound) the quality of being very clear: Two factors determine the crispness of the computer image. Her performance was memorable for the purity and crispness of her tone.\nMore examplesFewer examplesThere is a crispness to details and a weight and solidity to objects in this video game.New audio technology gives music a crispness and clarity previously available only on vinyl LPs.The crispness of the picture was such that you could pick out every grain of rock on a New Mexico mountainside.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nin plain sight idiom\nobtrude\npalpable\npalpably\nparallax\npatently\nperceivable\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\ncrispness noun [U]\n(OF SPEECH, WRITING)\n(of a way of speaking, writing, or behaving) the quality of being quick, confident, and effective: His writing lacks the crispness it once had. The storytelling loses its crispness in the final half-hour.\nMore examplesFewer examplesThis character's lines have to be delivered with absolute crispness.His personal observations, delivered with his customary crispness, are a joy to read.There was no desire in their play and no crispness to their passing.\nSMART Vocabulary: related words and phrases\nNot saying much\na few well-chosen words idiom\nabruptly\nabruptness\nboo\nbriefly\ncat\nconcisely\nconciseness\nlaconic\nmonosyllabic\nmonosyllabically\nnot say boo idiom\npithily\npithy\nquiet\nquietness\nreticence\nreticent\nreticently\ntaciturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHurrying and doing things quickly\nConfidence & self-assurance\ncrispness noun [U]\n(OF AIR)\n(of the air) the quality of being cold, dry, and fresh: The day darkened to night and they inhaled the slight crispness of the air. the perfect crispness of an October night\nMore examplesFewer examplesThere was a hint of autumn crispness in the air.He was constantly clearing his wet brow with a handkerchief despite the day's crispness.I was stopped in my tracks by the delicious crispness of the air.\nSMART Vocabulary: related words and phrases\nCold\nBaltic\nbitingly\nbitter\nbitterly\nbone-chilling\nbrass\nchilled\ncooling\ndank\nfrigid\nfrostbite\nfrozen\nisothermally\nkeenness\nminus\noccluded front\nperished\npiercingly\npolar vortex\nwintry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCool\nSee\ncrisp"}