{"id":113770,"name":"critical","type":"adjective","us_sound":"ˈkrɪt̬.ɪ.kəl","us_link":"../audio/c/critical.mp3","uk_sound":"ˈkrɪt.ɪ.kəl","uk_link":"../audio/c/ukcripp014.mp3","content":"critical adjective\n(NOT PLEASED)\nAdd to word list\nAdd to word list\nB2 saying that someone or something is bad or wrong: a critical report The report is highly critical of safety standards at the factory.\nMore examplesFewer examplesShe is critical of the president's globalist foreign policy.She was highly critical of the insensitive and peremptory way in which the cases had been handled.Many people were critical of the resurgent militarism in the country.She is a prolific writer with critical views and a sharp tongue.She is very critical of the way we bring up our children.\nSMART Vocabulary: related words and phrases\nCritical & uncomplimentary\nacidulous\naloof\nastringency\nastringently\nbarbed\nbe all very well idiom\ncaptious\ncensorious\ndamning\nderogatory\nhypercritical\npungently\nscarifying\nscarifyingly\nscathing\nscathingly\nscorchingly\nuncomplimentary\nvenomous\nwitheringly\nSee more results »\ncritical adjective\n(IMPORTANT)\nB2 of the greatest importance to the way things might happen: The president's support is critical (to this project). a critical decision\nMore examplesFewer examplesThe avoidance of injury is critical to a professional athlete.It is critical that we keep the content of the letters secret.Continued funding is critical for the project.He left a case containing critical documents on the train.Continual stirring is critical to a good custard.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\ncritical adjective\n(GIVING OPINIONS)\nC2 giving opinions or judgments on books, plays, films, etc.: She has written a major critical appraisal/study of Saul Bellow's novels. His last film won/received critical acclaim (= was praised by film critics).\nMore examplesFewer examplesStudying has certainly sharpened my critical faculties .Despite his great commercial success he still yearns for critical approval.The play opened to great critical acclaim.He has written a long critical piece evaluating the exhibition.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\ncritical adjective\n(SERIOUS)\nB2 extremely serious or dangerous: Both drivers are critical/in a critical condition (= so badly hurt that they might die) after the 120 mph crash.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\nbe no laughing matter idiom\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\ncritical adjective\n(IMPORTANT)\nAdd to word list\nAdd to word list\nof the greatest importance: critical industries What happens in the next 48 hours is critical.\ncritical adjective\n(VERY BAD)\nvery bad or dangerous: He was admitted to Metropolitan Hospital in critical condition.\ncritical adjective\n(JUDGING ENTERTAINMENT)\nshowing approval by those whose job is to judge entertainment: The movie was a financial and critical success.\ncritical adjective\n(DISAPPROVING PERSON)\nexpressing an opinion about something or someone, esp. a negative opinion: My mother is always so critical of the way I dress!\nAdd to word list\nAdd to word list\nextremely important to the progress or success of something: critical to/for sth Logistics and distribution are critical to an e-commerce venture's success. Critical decisions need to be taken. We see this as a critical time and potentially a turning point in the crisis.\nextremely serious or dangerous: be in critical condition As a result of unchecked pollution, the Chesapeake Bay is in critical condition. The company had a loss of $511,000 and a critical shortage of cash.\nsaying that someone or something is bad or wrong: A highly critical report was released Tuesday on BP's five U.S. refineries.critical of sb/sth He is very critical of his manager.\nusing careful judgment: We need to do some critical thinking to solve this problem. critically adverb\nThe small business market as a whole is critically important. Regional or bilateral trade deals need to be looked at more critically."}