{"id":114096,"name":"crossed","type":"adjective","us_sound":"krɑːst","us_link":"../audio/c/cdo0622uscros0455.mp3","uk_sound":"krɒst","uk_link":"../audio/c/cdo0622ukcros0600.mp3","content":"crossed adjective\n(BODY PART)\nAdd to word list\nAdd to word list\n(of someone's arms, legs, or fingers) in a position where one arm, etc. is placed over the other one: He just sat at the table with crossed arms and refused to eat. The children all sit on the floor with legs crossed. Her legs were crossed at the ankles. Opposite\nuncrossed keep/have your fingers crossed (also fingers are crossed, fingers crossed)\nused when you hope very much that something will happen in the way that you want: We're all keeping our fingers crossed for good weather on the day. I had my fingers crossed that it would work. He's injured at the moment but fingers crossed he'll be able to play. All they could do was wait with their fingers crossed.\nMore examplesFewer examplesShe rested her head on her crossed arms.I smoothed down my skirt over my crossed legs.You may be able to tell a lot from the couple's body language, for example if their arms are crossed or their legs are crossed away from each other.He held up his crossed fingers and smiled.\nSMART Vocabulary: related words and phrases\nPosture\nattitude\nbearing\ncarriage\ncarry\ndeportment\northostatic\npose\nposition\npostural\nposture\npower pose\npower posing\nsoldierly\nstrike\nstrike an attitude idiom\nsuck\nsuck something in\nYou can also find related words, phrases, and synonyms in the topics:\nHoping and hopefulness\nGood luck and bad luck\ncrossed adjective\n(WITH LINE/PATH ACROSS)\nhaving a line drawn across it: The crossed lines inscribed on the object may represent the four points of the compass. She will make sure the contract has every t crossed and every i dotted (= that it is very careful and completely correct).\nhaving a path, river, bridge, etc. going across it: The golf course is crossed in three places by streams. Opposite\nuncrossedSee also\nget your wires crossed\nMore examplesFewer examplesThe letters included a distinctive symbol: two crossed lines through a circle, resembling the crosshairs of a gun.They hiked for two hours uphill on a rough dirt track crossed by dozens of streams.The area is a desert, racked by dust storms and crossed by ancient dry riverbeds.\nSMART Vocabulary: related words and phrases\nDescribing handwriting & print\nasemic\nautographic\nchicken scratch\ncrabbed\ncursively\nhandwritten\nillegibility\nillegible\njoined up\nlegibility\nlegible\nlegibly\nnon-character\npencilled\nspidery\ntypewritten\nuncrossed\nundecipherable\nundeciphered\nwriting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrossing and moving through\ncrossed adjective\n(MIXED)\ncrossed with\nbred with a different animal or plant, or combined with a different type of thing, to produce something new: The dogs are often Siberians or Malamutes crossed with greyhounds. The bar looks like a coffee shop crossed with a cocktail lounge. They were the epitome of 1960s cool crossed with classic British style.\nSMART Vocabulary: related words and phrases\nMixing and mixtures\namalgam\nbe neither one thing nor the other idiom\nblend\nblend in/blend into something\nblender\nblitz\ndecoction\nemulsion\nguaraná\nhomogeneous mixture\nhybridize\nmethylate\nmingle\nmosaic\nmush\nneither\nsaturated solution\nscramble\nsubstance\nsynthesis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVariety and mixtures\ncrossed adjective\n(CHEQUE)\nfinance &amp; economics\n&#160; UK specialized (of a cheque) having two lines drawn across it to show that it must be paid into a bank account: A crossed cheque gives some protection against fraud if it falls into the wrong hands. Opposite\nuncrossed\nMore examplesFewer examplesUncrossed cheques should be crossed immediately to avoid fraud.A crossed check bears on its face two parallel transverse lines and cannot be presented for cash.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\ncashback\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\nnon-money\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »"}