{"id":114052,"name":"crossable","type":"adjective","us_sound":"ˈkrɑː.sə.bəl","us_link":"../audio/c/cdo0623uscros0784.mp3","uk_sound":"ˈkrɒs.ə.bəl","uk_link":"../audio/c/cdo0623ukcros0781.mp3","content":"crossable adjective\n(POSSIBLE TO CROSS)\nAdd to word list\nAdd to word list\nIf a road, river, etc. is crossable, you are able to cross it from one side to the other: It will take us an hour to walk to the crossable part of the river. A crossable gap in traffic is defined as the time needed to cross at walking speed, plus a safety buffer.\nMore examplesFewer examplesWhen we got to the bottom of the mountain, the stream was easily crossable.Once she had decided to return to America, the Atlantic Ocean suddenly seemed crossable.For architects with these powerful digital resources, traditional construction boundaries suddenly appeared crossable.I couldn't tell my mother what I had done, as there are some lines that aren't crossable.\nSMART Vocabulary: related words and phrases\nCrossing and moving through\nbash through (something)\nbreak\nbreak through something\ncriss-cross\ncrossed\ncut\ncut across something\nford\npenetrate\npenetration\npenetrative\npercolate\npierce\nplough\nrip\nscissor\nspan\nstraddle\ntransit\nuncrossed\nSee more results »\ncrossable adjective\n(POSSIBLE TO MIX)\nIf a plant or animal is crossable with another of a different type, they can be bred together in order to produce a new variety (= type of plant or animal): The most crossable wheat varieties originate from Asia. Species within each gene pool are usually crossable with each other.\nMore examplesFewer examplesHe grows both crossable and non-crossable varieties of the plant.\nSMART Vocabulary: related words and phrases\nBreeds & breeding\nbeget\nbreed\nbreeder\nbreeding\nbreeding ground\nbrood mare\ncrossbred\nheritage\nheritage breed\ninbred\ninbreeding\ninterbreed\npedigreed\npuppy farm\npuppy mill\npurebred\nrare breed\nstud\nthoroughbred\nwell bred\nSee more results »\nRelated word\ncross"}