{"id":114282,"name":"crowd","type":"noun","us_sound":"kraʊd","us_link":"../audio/c/crowd.mp3","uk_sound":"kraʊd","uk_link":"../audio/c/ukcross029.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] a large group of people who have come together: A crowd of about 15,000 attended the concert.\nThesaurus: synonyms, antonyms, and examples\nan audienceaudienceThe audience went wild after every song she sang.viewerThe show attracts millions of viewers every week.listenerListeners tune in regularly for his cheery banter.crowdThose New Yorkers can be a tough crowd to please.houseIt's a full house tonight.spectatorThe spectators cheered when the balloon went up.\nSee more results »\n[ S ] informal a group of friends or a group of people with similar interests: She goes around with a friendly crowd. \"Who was there?\" \"Oh, the usual crowd.\"\nMore examplesFewer examplesA crowd had gathered to hear her speak.In her bright yellow coat, she was easily identifiable in the crowd.A big crowd of demonstrators were protesting against cuts in health spending.He pushed his way to the front of the crowd to get a better look.The crowd was cheering and urging her on all through the race.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudiences and spectators\nFriends, acquaintances & contemporaries\nIdiom\nfollow the crowd\nto make someone feel uncomfortable by standing too close to them or by watching them all the time: I need some time to do this work properly, so don't crowd me.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncurb\ncurtail\ncurtailment\ndamage limitation\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nPhrasal verbs\ncrowd (something) into something\ncrowd someone/something out\ncrowd around (someone/something)\nAdd to word list\nAdd to word list\na large group of people who have gathered together: A crowd formed outside the club. Crowds of people watched the fireworks.\ninfml A crowd is also a group of friends: I don’t know many people in Edsel’s crowd.\nA crowd is also a group of people with similar interests: the art/theater crowd\n(of people) to fill a place: [ T ] Street vendors crowded the sidewalks. [ I ] As soon as he appeared, reporters crowded around him.\nIf you crowd someone, you make the person uncomfortable by standing too close: [ T ] Don’t crowd me!\nIf people crowd into a place, they fill it completely: [ I ] Commuters crowded into the train. Phrasal verb\ncrowd out someone/something"}