{"id":114420,"name":"cruel","type":"adjective","us_sound":"ˈkruː.əl","us_link":"../audio/c/cruel.mp3","uk_sound":"ˈkruː.əl","uk_link":"../audio/c/ukcrowe018.mp3","content":"Add to word list\nAdd to word list\nB1 extremely unkind and unpleasant and causing pain to people or animals intentionally: Don't tease him about his weight - it's cruel. Children can be very cruel to each other. Synonyms\nbarbaric\nbarbarous formal\nbrutal\ncallous\nhard (SEVERE)\nharsh (UNKIND)\ninhuman\nsadistic\nsavage\ntyrannical\ntyrannous\nvicious\nThesaurus: synonyms, antonyms, and examples\nnot kind to someone or something and causing paincruelTeasing them for being overweight is cruel.callousHe had a callous disregard for the feelings of others.cold-bloodedThe budget is based on a cold-blooded analysis of the markets.ruthlessHe was a ruthless dictator.heartlessHe has been described as a heartless boss by several employees.\nSee more results »\ncausing suffering: His death was a cruel blow.\nMore examplesFewer examplesIt's so cruel to keep a pony chained up like that all the time.Can't you see that you're really frightening your little brother? Don't be so cruel.We appear to have been the victims of a cruel practical joke.Fate played a cruel trick on him when he was badly injured in his first international game.Keeping animals in these conditions is unbelievably cruel - the farmer ought to be prosecuted.\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruelly\ncruelty\ncutthroat\ndespiteful\nmeanness\nmental cruelty\nmerciless\nmercilessly\nmordant\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nunchristian\nSee more results »\nRelated word\ncruellyIdiom\nbe cruel to be kind\nAdd to word list\nAdd to word list\nextremely unkind and intentionally causing pain: Her classmates made some cruel remarks. Is the death penalty cruel and unusual punishment? I think it’s cruel to put a dog in a cage. cruelly adverb us\nYour browser doesn't support HTML5 audio\n/ˈkru·ə·li/\nShe treated him cruelly before the divorce."}