{"id":114439,"name":"cruise","type":"noun","us_sound":"kruːz","us_link":"../audio/c/cruise.mp3","uk_sound":"kruːz","uk_link":"../audio/c/ukcrowe026.mp3","content":"Add to word list\nAdd to word list\nB1 a journey on a large ship for pleasure, during which you visit several places: He and his wife went on a cruise to the Bahamas. We took a 12-night river cruise from Vienna to Amsterdam.\nMore examplesFewer examplesThey're going on a cruise round the Med.They've just set off on a round-the-world cruise.Do you dream of a luxury skiing holiday or a Caribbean cruise?\nSMART Vocabulary: related words and phrases\nSailing & boating\nage of sail\naweigh\nbale\nbargee\nbargeman\nbear away\nmaritime\nocean-going\noutsail\nportage\nrafter\nrafting\nsail\nsailing\nsea legs\nseafaring\nseamanship\nseaworthy\nshipboard\nunder sail idiom\nSee more results »\nB2 [ I or T ] (of a ship or person) to sail around for pleasure: They spent the summer cruising around the Mediterranean. The ship has never before cruised in Alaskan waters. He pictured himself buying a yacht and cruising the Caribbean.\n[ I ] (of a vehicle or driver) to travel at a continuous speed that is not too fast or does not use too much fuel: The airplane could cruise at 350 mph and carry 10 passengers. Most people use their cars mostly for town driving, not for cruising on open roads.\n[ I or T ] to move or travel slowly around an area, usually looking for something or someone: She said the police should spend more time patrolling on foot rather than cruising in vehicles. Groups of teenagers cruised down the boulevard with their friends. I was cruising around the car park looking for a space. Shoppers look for bargains while cruising the supermarket aisles. She cruised the room trying to find someone interesting to talk to.\n[ I ] to move in a relaxed way, without effort: We saw a school of dolphins cruising along the shore. The ad shows an elderly woman with a walking stick cruising past a driver stuck in traffic.\n[ I ] to do something easily or without effort: Arsenal cruised to a 4-0 win over Chelsea last Saturday. The candidate cruised to victory in her constituency. When he works hard, he's brilliant, but when he’s just cruising, the rest of the team cruises too.\n[ I or T ] slang to go around public places looking for someone to have sex with: He spends the weekends cruising bars. Bobby was cruising for one-night stands.\nMore examplesFewer examplesThey are cruising off the west coast of Vancouver Island. Thousands of spectators watched the tall ships cruise the Detroit River.After launch, the probe will cruise for 6 months before intercepting the comet beyond Earth's orbit. The car is more fuel efficient because the engine can run on just three of six cylinders when cruising. A guy cruised up in a convertible and offered me a lift.He goes cruising the streets looking for places to rob.Our department is doing all the work while the rest of the business is cruising.\nSMART Vocabulary: related words and phrases\nSailing & boating\nage of sail\naweigh\nbale\nbargee\nbargeman\nbear away\nmaritime\nocean-going\noutsail\nportage\nrafter\nrafting\nsail\nsailing\nsea legs\nseafaring\nseamanship\nseaworthy\nshipboard\nunder sail idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nSlow and moving slowly\nCalm and relaxed\nAdvancing and moving forward\nEasiness and simplicity\nPassive and not working\nRelationships: finding a partner\nRelated word\ncruising\nAdd to word list\nAdd to word list\nto travel at a continuous speed: The plane is cruising at 240 knots.\nIf you cruise in a car, you drive for pleasure: We went cruising around downtown on Friday night.\nCruise can also mean to travel on large ships for pleasure.\na trip on a large ship for pleasure: a Caribbean cruise"}