{"id":114516,"name":"crunchy","type":"adjective","us_sound":"ˈkrʌn.tʃi","us_link":"../audio/c/crunchy.mp3","uk_sound":"ˈkrʌn.tʃi","uk_link":"../audio/c/ukcrumb007.mp3","content":"crunchy adjective\n(SOUND)\nAdd to word list\nAdd to word list\nIf something is crunchy, it is firm and makes a short loud noise when it is eaten, pressed, etc. : The toast was delicious, hot, and crunchy. The chips have a crunchy coating. She heard footsteps in the crunchy snow.\nmusic\n&#160; informal specialized (of music, especially an electric guitar sound) rough and loud, and often distorted (= made to sound strange and slightly unpleasant): They play crunchy modern rock. a crunchy guitar sound Related word\ncrunchily\nMore examplesFewer examplesThe pie filling was sweet and the crust deliciously crunchy.The cereal stays crunchy even with milk poured over it.The seeds add a lovely crunchy texture to the salad.The bread has a crunchy outside and a soft, chewy inside.It sounded like he was eating something crunchy.The dry leaves were crunchy underfoot.The tracks feature drums that sound as if they were recorded in a tin shed, crunchy guitars and grinding bass lines.Distortion pedals produce a crunchier and grittier tone.\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nhomegrown\nhomemade\nhoppy\ninstant\nisotonic\nnutritious\nnutty\nripe\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nsugarcoat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHard and firm\nDescribing qualities of sound\ncrunchy adjective\n(PERSON)\nUS informal sometimes disapproving living in a way that shows you care about the environment and have generally liberal opinions (= accepting and encouraging social change): Using cloth nappies may earn you the title of a crunchy mama. Being crunchy usually means that you don't just go along with mainstream ideas.\nMore examplesFewer examplesI consider myself a crunchy parent, but after I lost my job I started buying cheap, low-welfare meat.We are not a crunchy, tree-hugging, granola-eating group.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nfood insecurity\nparticulate\nreclamation\nsequestration\nsingle-use\nskip diving\nsmoggy\nsolar power\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nModern & fashionable\ncrunchy adjective\n(MAKING NOISE)\nAdd to word list\nAdd to word list\n(of food) firm and making a loud noise when it is eaten: crunchy toast"}