{"id":114603,"name":"crustily","type":"adverb","us_sound":"ˈkrʌs.təl.i","us_link":"../audio/c/cdo0623uscrus0800.mp3","uk_sound":"ˈkrʌs.təl.i","uk_link":"../audio/c/cdo0623ukcrus0797.mp3","content":"crustily adverb\n(HARD LAYER)\nAdd to word list\nAdd to word list\nin a way that has a hard outer layer: The crustily pan-fried salmon was absolutely delicious. French citizens in the rural South eat baguettes just as crustily delicious as those eaten in Paris.\nMore examplesFewer examplesThey sold fruit-filled pastries and crustily rustic loaves of bread. The pieces of chicken are rolled in breadcrumbs, brushed with oil, and baked until the crumbs are crispy and crustily brown.\nSMART Vocabulary: related words and phrases\nVarious qualities of food\ncandy coat\ncandy-coated\ncitric\ncordon bleu\ncreamily\nfarmhouse\nfruity\nhomegrown\nhomemade\nhoppy\ninstant\nisotonic\nnutritious\nnutty\nripe\nshelf-stable\nsingle-estate\nstore-bought\nsugar-coated\nsugarcoat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHard and firm\ncrustily adverb\n(EASILY ANNOYED)\nIf you say that people, especially older people, do something crustily, you mean that they are complaining and are easily annoyed: \"You don't need to come round if you don't have time,\" she replied, a little crustily. News coverage of last week's devastating fires showed some older residents crustily refusing to evacuate.\nMore examplesFewer examplesI felt sorry for the poor gardener whose hard work in my grandfather's garden was so crustily dismissed.He whistled for a few minutes, and then said crustily, \"I am going to sea - you may go home if you don't want to join me!\"\nSMART Vocabulary: related words and phrases\nBad-tempered\nargumentative\nbad-tempered\nbe hell on wheels idiom\nbe like a bear with a sore head idiom\nbe spoiling for a fight idiom\ngrouchy\ngrumpily\ngrumpiness\ngrumpy\nhave a short fuse idiom\npettishly\npetulance\npetulancy\npetulant\npetulantly\nstroppy\nsurlily\nsurliness\ntestily\ntestiness\nSee more results »\nRelated word\ncrusty"}