{"id":114561,"name":"crush","type":"verb","us_sound":"krʌʃ","us_link":"../audio/c/crush.mp3","uk_sound":"krʌʃ","uk_link":"../audio/c/ukcrumb010.mp3","content":"crush verb\n(PRESS)\nAdd to word list\nAdd to word list\nC2 [ T ] to press something very hard so that it is broken or its shape is destroyed: The package had been badly crushed in the post. Add three cloves of crushed garlic. His arm was badly crushed in the car accident.\n[ T ] UK to press paper or cloth so that it becomes full of folds and is no longer flat: My dress got all crushed in my suitcase.\n[ T ] If people are crushed against other people or things, they are pressed against them: Tragedy struck when several people were crushed to death in the crowd.\nMore examplesFewer examplesUse the back of a wooden spoon to crush the garlic.Many people were crushed underfoot when the police tried to break up the demonstration.Sugar is obtained by crushing and processing sugar cane.He sat on top of Mum's hat and crushed it flat!Try not to crush your jacket on the journey - hang it up in the back of the car.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmill\nnoncompressible\npinch\npound\npresser\npulp\npulverization\nscrunch\nsnap\nsquash\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking things more or less smooth or straight\ncrush verb\n(SHOCK)\n[ T usually passive ] to upset or shock someone badly: He was crushed by the news of the accident.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nhit/touch a (raw) nerve idiom\nnerve\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\nshatteringly\ntear\ntoxic\nSee more results »\ncrush verb\n(BEAT)\n[ T ] to defeat someone completely: The president called upon the army to help crush the rebellion. France crushed Wales by 36 to 3 in last Saturday's match in Paris. Synonyms\nannihilate informal\nbeat (DEFEAT)\nconquer\ndefeat\nhammer (DEFEAT) informal\nthrash (DEFEAT) informal\ntrounce informal\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\noutfox\nsew\nslaughter\nsweep\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\ntakedown\nthrash\nSee more results »\ncrush verb\n(perform well)\n[ T ] informal to perform extremely well in a particular situation, competition, etc.: The company isn't just crushing the commercial realm, it is also innovating corporate culture. Norway is crushing the Winter Olympics. They did OK in the semi-finals but crushed it (= did extremely well) in the finals.\nSMART Vocabulary: related words and phrases\nSurpassing in quality or number\ncatch\ncatch (someone) up\ncompare\ncrown\ndo something for an encore idiom\neclipse\nencore\nenvelope\noutdo\noutflank\noutgo\noutman\noutmuscle\nput/leave someone in the shade idiom\nshade\nshame\nsteal a march on someone idiom\nsteal someone's thunder idiom\nsurpass\ntower\nSee more results »\ncrush noun\n(LIKING)\nC2 [ C ] informal a strong but temporary feeling of liking someone: She has a crush on one of her teachers at school.\nThesaurus: synonyms, antonyms, and examples\nto love someoneloveI love you.adoreHe absolutely adores his wife.dote onShe dotes on her grandkids.be crazy aboutI'm just crazy about our new daughter-in-law - she's perfect for our son. be mad aboutUK He's absolutely mad about his new boyfriend.be in loveI think I'm in love with her.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nloveloveI have a great love and respect for her.adorationShe described her complete adoration of her brother.romanceTheir relationship was nothing but romance and bliss.passionThe passion had gone out of their relationship.infatuationNo one expected their infatuation with each other to last.crushHe had a crush on his French tutor.\nSee more results »\nSMART Vocabulary: related words and phrases\nLoving and in love\nabsence\nabsence makes the heart grow fonder idiom\nadore\nadoring\nadoringly\nadorkable\nendearment\never-loving\nfall for someone\nfall in love idiom\nfeelings for someone idiom\ngaga\nmadly\nmoon\nmoon over someone/something\npash\npotty\nshine\ntreasure\nworship\nSee more results »\ncrush noun\n(PRESS)\nC2 [ S ] a crowd of people forced to stand close together: I had to struggle through the crush to get to the door.UK You can come in our car, but it'll be a bit of a crush (= there will be a lot of people in it).\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nflashmob\nflock\nfocus group\nfoursome\nfraternity\nline (someone) up\nmafia\nmob\npublic\nquaternity\nrabble\nretinue\nsandwich generation\nsquad\nsyndicate\nSee more results »\ncrush verb [T]\n(PRESS)\nAdd to word list\nAdd to word list\nto press something very hard so that it is broken or its shape is destroyed: The package got crushed in the mail. Her car was crushed by a falling tree.\ncrush verb [T]\n(SHOCK)\nto upset or shock someone badly: I was crushed because I didn't complete the race.\ncrush verb [T]\n(DESTROY)\nto defeat someone completely: They'll stop at nothing to crush the opposition.\ncrush noun\n(ATTRACTION)\n[ C ] infml a strong but temporary attraction for someone: She had a crush on Matthew in sixth grade.\ncrush noun\n(PRESS)\n[ U ] a crowd of people: I can’t stand the crush of holiday shoppers at the mall."}