{"id":114611,"name":"crutch","type":"noun","us_sound":"krʌtʃ","us_link":"../audio/c/crutch.mp3","uk_sound":"krʌtʃ","uk_link":"../audio/c/ukcrumb017.mp3","content":"Add to word list\nAdd to word list\n[ C usually plural ] a stick with a handle and a part that fits around your lower arm, or a stick with piece that fits under the arm, that you lean on for support if you have difficulty in walking because of a foot or leg injury: Martin broke his leg and has been on crutches for the past six weeks. Anna uses crutches and sometimes a wheelchair.\nno_limit_pictures/iStock/Getty Images Plus/GettyImages\n[ S ] often disapproving something that provides help and support and that you depend on, often too much: Humour can be a crutch for shy people. I would never use my illness as a crutch or an excuse.\n[ C ] UK another spelling of\ncrotch\nMore examplesFewer examplesHe quickly learned to walk with crutches on his prosthetics.At the moment I have to use a crutch.We met a young soldier on crutches.In his view, bike stabilisers are a short cut to confidence but ultimately a crutch that you will have to wean your child off.As an atheist, he believes that religion is just an emotional crutch.Don't use an online translator as a crutch for your own laziness.Reading myself to sleep became a crutch that I depended on.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nearplug\nElastoplast\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHelping and co-operating\nThe human torso\nParts of clothes\nAdd to word list\nAdd to word list\na stick with a piece that fits under or around the arm which someone who is having difficulty walking leans on for support: Marty was on crutches for six weeks when he broke his leg."}