{"id":115116,"name":"cultivate","type":"verb","us_sound":"ˈkʌl.tə.veɪt","us_link":"../audio/c/eus71103.mp3","uk_sound":"ˈkʌl.tɪ.veɪt","uk_link":"../audio/c/ukcull_012.mp3","content":"cultivate verb [T]\n(USE LAND)\nAdd to word list\nAdd to word list\nC1 to prepare land and grow crops on it, or to grow a particular crop: Most of the land there is too poor to cultivate. The villagers cultivate mostly maize and beans.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\ngrain\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\ncultivate verb [T]\n(DEVELOP)\nC2 to try to develop and improve something: She has cultivated an image as a tough negotiator.\nIf you cultivate a relationship, you make a special effort to establish and develop it, because you think it might be useful to you: The new prime minister is cultivating relationships with East Asian countries.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\nleavening\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nrationalize\nrectify\nremedial\nreorganize\nrepair\nrepolish\nrestructure\nrevamp\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\nRelated word\ncultivation\ncultivate verb [T]\n(GROW)\nAdd to word list\nAdd to word list\nto prepare land and grow crops on it, or to grow a particular crop: He cultivated soybeans on most of the land.\ncultivate verb [T]\n(DEVELOP)\nto create a new condition by directed effort: We’re trying to help these kids cultivate an interest in science.\nTo cultivate is also to try to become friendly with someone because that person may be able to help you: to cultivate friendships cultivation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌkʌl·təˈveɪ·ʃən/\nSimple changes in rice cultivation can reduce methane emissions.\nAdd to word list\nAdd to word list\nPRODUCTION to prepare land and grow crops on it, or to grow a particular crop: Corn, or maize, is indigenous to Mexico and has been cultivated there for some 6,000 years.\nto try to develop and improve something: She has cultivated an image as a shrewd investor.\nif you cultivate a relationship, you make a special effort to develop it, because you think it might be useful to you: He cultivated business contacts in ten major cities.\ncultivation noun [ U ]\nthe cultivation of crops/the land This course will help with the cultivation of key marketing skills. If you wish to retain customers, you must work at the cultivation of the customer relationship."}