{"id":115630,"name":"curl","type":"noun","us_sound":"kɝːl","us_link":"../audio/c/curl.mp3","uk_sound":"kɜːl","uk_link":"../audio/c/ukcurio004.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] a piece of hair that grows or has been formed into a curving shape, or something that is the same shape as this: tight/loose curls Her hair fell in curls over her shoulders. Curls of smoke were rising from the chimney. Compare\nwave noun (HAIR CURVES)\nenginakyurt11/iStock/Getty Images Plus/GettyImages\n[ C or U ] UK (also curve) the curved shape in which a ball moves when it is hit or kicked in a particular way: The curl on the shot sent it looping around the keeper into the far corner of the net.\n[ C or U ] an exercise using weights in which you move your arm or leg from straight to bent and back: She uses 5-pound weights for bicep curls. Twice a week, do both leg extensions and leg curls on a weight machine.\nSMART Vocabulary: related words and phrases\nHair\nanti-dandruff\nas bald as a coot phrase\nbaldness\nbedhead\ncoily\nfuzzy\nkink\nshaggy\nsideburns\ntash\ntextured\ntousle\ntousled\ntress\ntuft\nunkempt\nunshorn\nwavy\nwig\nwiry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometry: bends, loops & curves\nGeneral terms used in ball sports\nExercising & training\ncurl verb\n(MAKE A SHAPE)\n[ I or T ] to make something into the shape of a curl, or to grow or change into this shape: Does your hair curl naturally, or is it permed? A new baby will automatically curl its fingers round any object it touches.\n[ I or T ] to make a ball move in a curved shape by hitting or kicking it in a particular way or of a ball, to move in this way: He curled the ball into the top right hand corner. Peterson's free-kick curled just wide. curl your lip\nto show by an upward movement of one side of your mouth that you feel no respect for something or someone: Her lip curled at what he said.\nSee more\nSMART Vocabulary: related words and phrases\nHairdressing\nbarber's pole\nbewigged\nbraid\ncolourist\ndip dye\nfoil\ngel\nhairdressing\nhairstylist\nhenna\nhighlight\nloose\nperoxide\nscalp\ntexture\ntint\ntong\ntonsorial\ntrim\nwigged\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\ncurl verb\n(SPORT)\n[ I ] to play the sport of curling (= a game played on ice in which stones are slid towards a mark): \"Learn to curl\" sessions teach you the basics of curling.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nIdiom\ncurl up and diePhrasal verb\ncurl up\nAdd to word list\nAdd to word list\na piece of hair having a curving shape, like part of a circle, or something else having a circular shape: [ C ] He loved that dark curl at the back of her neck. [ C ] We watched the curls of smoke rise from his pipe.\nto form or cause something to form a curving or twisted shape: [ T ] If I don’t curl my hair, it looks too stringy. Phrasal verb\ncurl up"}