{"id":115696,"name":"currency","type":"noun","us_sound":"ˈkɝː.ən.si","us_link":"../audio/c/currency.mp3","uk_sound":"ˈkʌr.ən.si","uk_link":"../audio/c/ukcurio014.mp3","content":"currency noun\n(MONEY)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the money that is used in a particular country at a particular time: foreign currency\nMore examplesFewer examplesTake some foreign currency to cover incidentals like the taxi fare to your hotel.Five people were indicted for making and selling counterfeit currency.The Central Bank intervened in the currency markets today to try to stabilize the exchange rate.The currency has lost so much of its value that barter has become the preferred way of doing business.In 1971, Britain switched over to a decimal currency.\nSMART Vocabulary: related words and phrases\nCurrencies\nAltcoin\nariary\nbimetallism\nbitcoin\nCDN\ndecimal currency\nECU\nescudo\nguilder\nkrone\nlira\nmulti-currency\nnon-convertible\nnon-dollar\npaisa\npieces of eight\nrouble\nrupiah\nshilling\ntraveller's cheque\nSee more results »\ncurrency noun\n(ACCEPTANCE)\n[ U ] the state of being commonly known or accepted, or of being used in many places: His ideas enjoyed wide currency during the last century. Many informal expressions are gaining currency in serious newspapers.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\ncurrency noun\n(MONEY)\nAdd to word list\nAdd to word list\n[ C/U ] the money in use in a particular country: [ C ] The US dollar fell yesterday against most foreign currencies.\ncurrency noun\n(ACCEPTANCE)\n[ U ] fml the state of being commonly known or accepted, or of being used in many places: The idea that computer use enhances students’ motivation has gained currency in recent years.\nAdd to word list\nAdd to word list\nMONEY, FINANCE the system of money that is used in a particular country at a particular time: domestic/foreign/local currency The deal will be done in the local currency.stable/strong/weak currency They benefited from having a stable currency over a long period of time.buy/sell currency Currency is bought on the currency foreign exchange, also known as the forex exchange.devalue/revalue a currency The Central bank devalued the currency to curb rising inflation.a currency rises/falls Stocks jumped and the currency rose for the first time in several weeks.currency dealing/trade/trading This website will give you top tips on the foreign exchange markets from currency trading experts.. currency dealer/trader See also\nbasket of currencies\nblocked currency\nconvertible currency\ndecimal currency\ndigital currency\ndual currency\ne-currency\nfixed currency\nfloating currency\nhard currency\ninconvertible currency\nnon-convertible currency\npaper currency\npegged currency\nreserve currency\nsingle currency\nsoft currency\nunit of currency"}