{"id":115698,"name":"current","type":"adjective","us_sound":"ˈkɝː.ənt","us_link":"../audio/c/currant.mp3","uk_sound":"ˈkʌr.ənt","uk_link":"../audio/c/ukcurio012.mp3","content":"Add to word list\nAdd to word list\nB2 of the present time: Have you seen the current issue of (= the most recently published) Vogue magazine? The word is no longer in current use.\nMore examplesFewer examplesWho is the current editor of the Times?A lot of businesses are being hurt by the current high interest rates.I wouldn't work for them even if they paid me twice my current salary.What are your current child-care arrangements?Most of the current troubles stem from our new computer system.\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nminute\nmodern-day\nmoment\npresently\nright\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\nSee more results »\nRelated word\ncurrently\ncurrent noun [C]\n(FLOW)\na movement of water, air, or electricity in a particular direction: to swim against/with the current He was swept out to sea by the strong current. Switch off the electric current before changing the bulb.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFloods, tides & currents\ncurrent noun [C]\n(FEELING)\na particular opinion or feeling that a group of people have: There is a growing current of support for environmental issues among voters.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\ncurrent adjective\n(HAPPENING NOW)\nAdd to word list\nAdd to word list\nof the present time or most recent: Under current state law, students can drop out of school legally at age 17.\ncurrent noun [C]\n(MOVEMENT)\na movement of water or air: The boat drifted with the current until it was miles from shore.\nphysics Electric current is the passage of electricity through a wire.\nAdd to word list\nAdd to word list\nhappening or existing at the present time: A lot of businesses are being hurt by the current high interest rates. The group said it would return to profit within the current financial year. They offered to pay me twice my current salary. Who is the current editor of the Times?\nan opinion or a feeling that a group of people have: The general current of opinion is against such drastic cuts in public spending. There is a growing current of support for environmental issues among consumers."}