{"id":115742,"name":"cursed","type":"adjective","us_sound":"ˈkɝːst","us_link":"../audio/c/cdo0123uscurs0670.mp3","uk_sound":"kɜːst","uk_link":"../audio/c/ukcurio024.mp3","content":"cursed adjective\n(SHOWING ANGER)\nAdd to word list\nAdd to word list\n[ before noun ] old-fashioned used to describe something that is annoying to you in an angry way: It's a cursed nuisance, having to work late every evening! See also\naccursed old-fashionedRelated word\ncursedly\nSMART Vocabulary: related words and phrases\nAnnoying\naccursed\naggravating\nannoying\nannoyingly\nball-ache\nfrustratingly\ngadfly\ngalling\ngallingly\ngratingly\nirritatingly\nlimit\nmaddening\nmither\nnaggingly\nsickeningly\nspiteful\nstupid\ntrying\nvexatious\nSee more results »\ncursed adjective\n(HAVING BAD LUCK)\nexperiencing problems and unhappiness: In recent years I've been cursed with worsening eyesight.\nThesaurus: synonyms, antonyms, and examples\nhaving bad things happen by chanceunluckyShe is one of the unluckiest people I've ever met.unfortunateThe unfortunate souls who were lost during the voyage were commemorated once the ship reached port. haplessHe's always been a hapless, helpless bumbler. star-crossedBehold the tale of two star-crossed lovers, doomed to spend their lives apart.lucklessThe luckless council member was caught in the middle of three major ethics investigations of her colleagues.\nSee more results »\nexperiencing bad luck caused by a magic curse: humorous I think my car is cursed - it never starts when I need it.\nThesaurus: synonyms, antonyms, and examples\nresulting in bad things happening by chanceunluckyAn unlucky bounce led to the winning goal against the home team.unfortunateNo one was to blame - it was just an unfortunate accident.ill-fatedSeven crew members were killed on the ill-fated voyage.ill-starredHis ill-starred reign began with a famine and ended with civil war.\nSee more results »\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhold on idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMagic"}