{"id":115788,"name":"curtain","type":"noun","us_sound":"ˈkɝː.tən","us_link":"../audio/c/curtain.mp3","uk_sound":"ˈkɜː.tən","uk_link":"../audio/c/ukcurta002.mp3","content":"Add to word list\nAdd to word list\nA2 a piece of material, especially cloth, that hangs across a window or opening to make a room or part of a room dark or private: Heavy curtains blocked out the sunlight. to draw (= open or close) the curtains\ndarksite/iStock/Getty Images Plus/GettyImages\na thick layer of something that makes it difficult to see anything behind it: They could see nothing through the curtain of rain/smoke.\nthe large screen of heavy material in a theatre that separates the stage from the area where people are watching\nMint Images/Mint Images RF/GettyImages curtains\nUK (also hair curtains) a short or medium-length hairstyle in which hair is parted (= separated) in the middle of the head and falls on each side of the face: The eighties had mullets but in the nineties, it was all about curtains.\nSee more\nMore examplesFewer examplesThe audience was still laughing as the curtain fell.He pulled the curtain aside.I'm trying to match up this wallpaper with some suitable curtain material.A coat of paint and new curtains would really cheer the kitchen up.I peered through a chink in the curtains and saw them all inside.\nSMART Vocabulary: related words and phrases\nCurtains & wallpaper\nblind\ncurtain rail\ncurtain rod\ndrape\ndrapes phrase\nfinial\nflocked wallpaper\nfloor-length\nhang\nhung\nnet curtain\nrehang\nroller blind\nshade\nsunshade\nvalance\nvenetian blind\nwall hanging\nwallpaper\nwindow shade\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCoverings and layers\nTheatres, cinemas & their parts\nSee also\ncurtains twitchIdioms\nbe curtains for someone\nthe curtain falls on something\nAdd to word list\nAdd to word list\na piece of cloth or other material that hangs across a window or space to decorate a room or to make it dark or private: In the restaurant, arches covered with beaded curtains divide the room.\nIn a theater, the curtain is a large, movable sheet of heavy material that separates the stage from the area where people are sitting.\nThe curtain is also the time at which a performance begins: The curtain is at 8 o’clock."}