{"id":115927,"name":"cushion","type":"noun","us_sound":"ˈkʊʃ.ən","us_link":"../audio/c/cushion.mp3","uk_sound":"ˈkʊʃ.ən","uk_link":"../audio/c/ukcurta011.mp3","content":"cushion noun [C]\n(SOFT THING)\nAdd to word list\nAdd to word list\nB1 (US also pillow) a bag made of cloth, plastic, or leather that is filled with soft material, often has an attractive cover, and is used especially on chairs for sitting or leaning on: She sank back against/into the cushions. See also\npincushion\npattonmania/iStock/Getty Images Plus/GettyImages cushion of air\na layer of air often used to support a machine or vehicle: A hovercraft travels on a cushion of air.\nSee more\nMore examplesFewer examplesStuff the cushion and then sew up the final seam.My aunt was busy straightening furniture and plumping cushions.The cushions blend well with the colour of the carpet.The new yellow cushions nicely set off the pale green of the chair covers.\nSMART Vocabulary: related words and phrases\nCushions & furniture coverings\nantimacassar\ncanopy\nloose covers\npillow\nplump\nplush\nreupholster\nrunner\nscatter cushion\nscatter rug\nslipcover\nsoft furnishings\nsoft goods\ntable runner\nthrow pillow\nthrow rug\nupholster\nupholstered\nupholsterer\nupholstery\ncushion noun [C]\n(EDGE)\nin games such as billiards and snooker, the raised edge around the outside of the playing table: The cue ball bounced back off the cushion. I potted a red along the cushion into the corner pocket.\nSMART Vocabulary: related words and phrases\nSnooker, pool & billiards\nbaize\nbilliard\nbilliard ball\nbreak\nbreak (something) off\ncannon\ncarom\ncue\nframe\nmiscue\npocket\npool\npot\nrack\nre-rack\nre-spot\nsnooker\nsnooker ball\ntriangle\nSee more results »\ncushion noun [C]\n(PROTECTION)\nC2 something that makes the effects of a bad situation less severe: You should aim to build up a cushion of money in case of emergencies.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nto make the effect or force of something softer: The soft grass cushioned his fall. The striker cushioned the ball on his chest and turned and volleyed it into the net.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\ninoculation\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nIdiom\ncushion the blow\nAdd to word list\nAdd to word list\na large, usually square bag filled with soft material, used as a movable part of a chair or sofa, for sitting on or resting your back against, or a similar but smaller bag used to make yourself more comfortable while sitting: She sank back against the sofa cushions.\nto soften or protect someone or something from the effects of a fall, moving too quickly into something, sitting or lying on a hard object, etc.: The soft grass cushioned his fall (= made it hurt less).\nAdd to word list\nAdd to word list\nto make the effect or force of something less severe: For two years subsidies have cushioned the impact of accelerating inflation.cushion sb/sth against sth Governments can use fiscal policy to cushion the economy against future recessions.\ncushion the blow\nto make a bad situation less severe: Earnings expectations are worsening, but interest rates are not expected to fall to cushion the blow.\nsomething that makes the effects of a bad situation less severe: You should aim to build up a cushion of three months' income in your savings account, for emergencies."}