{"id":116005,"name":"customer","type":"noun","us_sound":"ˈkʌs.tə.mɚ","us_link":"../audio/c/customer.mp3","uk_sound":"ˈkʌs.tə.mər","uk_link":"../audio/c/ukcurta027.mp3","content":"Add to word list\nAdd to word list\nA2 a person who buys goods or a service: a satisfied customer Mrs Wilson is one of our regular customers.\nThesaurus: synonyms, antonyms, and examples\na person who buys somethingshopperHoliday shoppers mobbed the sale.customerShops were lowering prices to attract more customers.punterUK The shop's running a raffle to pull in the punters.patronShe's been a regular patron of the pub for years.consumerConsumers did not spend as much last quarter as analysts predicted.buyerWe haven't found a buyer for the house yet.\nSee more results »\nMore examplesFewer examplesWould you mind waiting? I'm dealing with another customer at the moment.The chairman of the bank believes in the personal touch and always sends a signed letter to each customer.The shop is giving away a sample pack to every customer.Shops are being forced to put their prices down in order to attract customers.Mrs Wilson is one of our regular customers.\nSMART Vocabulary: related words and phrases\nPeople who buy things\nanti-consumer\nbidder\nbuyer\nconsumer\ncouponer\nfoot traffic\nimporter\nlate adopter\nmulti-client\nmystery shopper\nprosumer\npunter\npurchaser\nrag-and-bone man\nragman\nscrap dealer\nspeculator\ntradesman\ntradespeople\nwholesaler\nSee more results »\nIdioms\na tough/tricky, etc. customer\nthe customer is always right\nAdd to word list\nAdd to word list\na person who buys goods or a service: We try to give all our customers good service.\nAdd to word list\nAdd to word list\na person or an organization that buys a product or service: Our new ordering system means we can serve customers more efficiently. The company's simple strategy is to focus on the customer. We need to convert more website visitors to paying customers. We aim to respond to all customer complaints within 24 hours. appeal to/attract/bring in customers techniques to attract new customersa big/good/major customer The farm's biggest customer is a restaurant chain.a loyal/regular customer We like to reward loyal customers with special offers.future/potential/prospective customers a cost-effective way to reach prospective customersa satisfied/happy customer Studies show that each satisfied customer will tell one other person about your company.a dissatisfied/unhappy customer The store has changed its image in an effort to win back unhappy customers.customer expectations/needs/preferences They adapt their services to meet customer needs in different countries.customer evaluation/feedback/testing We now need to trial these products and get customer feedback before developing them further. See also\nexternal customer\ninternal customer\npreferred customer\nrepeat customer\ntarget customer\nultimate consumerCompare\nconsumer\nthe customer is always right\nused to emphasize that, in business, it is very important not to disagree with a customer or make them angry: Our customer service representatives are trained to believe in the old saying that the customer is always right."}