{"id":115995,"name":"custom","type":"noun","us_sound":"ˈkʌs.təm","us_link":"../audio/c/custom.mp3","uk_sound":"ˈkʌs.təm","uk_link":"../audio/c/ukcurta024.mp3","content":"custom noun\n(USUAL WAY)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a way of behaving or a belief that has been established for a long time: a local/ancient custom [ + to infinitive ] In my country, it's the custom (for women) to get married in white.\n[ S ] something you usually do: He left the house at nine exactly, as is his custom.\nMore examplesFewer examplesIt's a custom which is beginning to die out.She covered her head out of deference to Muslim custom.The women gathered around the coffin and began to wail, as was the custom in the region.The song was a custom handed down through the generations.What customs do you have for New Year in your country?\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ndemi-monde\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHabitual behaviour\ncustom noun\n(TRADE)\n[ U ] the support given to a business, especially a shop, by the people who buy things or services from it: Most of our custom comes from tourists nowadays. If we don't give good service, people will take their custom elsewhere.\nSMART Vocabulary: related words and phrases\nPeople who buy things\nanti-consumer\nbidder\nbuyer\nconsumer\ncouponer\nfoot traffic\nimporter\nlate adopter\nmulti-client\nmystery shopper\nprosumer\npunter\npurchaser\nrag-and-bone man\nragman\nscrap dealer\nspeculator\ntradesman\ntradespeople\nwholesaler\nSee more results »\ncustom noun\n(OFFICIAL CHECK)\ncustoms [ plural ]\nB1 the place at a port, airport, or border where travellers' bags are looked at to find out if any goods are being carried illegally: to go through customs\nSee more\nused before another word to mean \"specially designed for a particular person or purpose\": custom-designed custom-built software\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesigner\ndevise\ndream something up\nergonomic\nergonomically\nmodularization\nnanotechnology\nnon-imitative\noperational research\noriginator\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\ncustom noun\n(TRADITION)\nAdd to word list\nAdd to word list\n[ C/U ] a way of behaving or a belief that has been established for a long time among a group of people: [ C ] It was a time-honored custom of the club that blue chairs were reserved for senior members only. [ C ] She’s studying the language and customs of the Hopi Indians.\ncustom noun\n(USUAL ACTIVITY)\n[ C ] something you usually do: He left the house at nine exactly, as was his custom.\ncustom adjective [not gradable]\n(MADE ONCE)\nmade for a particular person to buy: custom drapes/woodworking\ncustomize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈkʌs·təˌmɑɪz/\nWe will customize existing software to meet our clients’ needs.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE\n&#160; mainly UK the support given to a business, especially a store, by the people who buy things or services from it: Most of our custom comes from tourists. If we don't give good service, people will take their custom elsewhere. lose/need/want sb's custom See also\nbusiness\n[ C or U ] a way of behaving or doing something which has existed for a long time and is considered as the usual way: There is a custom that banks buy at the top of the market and sell at the bottom. The solicitors suggested that the advice from the British Bankers' Association counted only as custom and practice and was not in fact law.\nPRODUCTION specially designed for a particular person or purpose: custom-designed/made/built Getting parts for custom-built cars can take six months to a year. The company was founded in 1921 as a builder of custom homes. Banks and private companies pay for custom news feeds that serve their own needs. The music industry is being turned upside down by our ability to go to a website and download MP3 music tracks or get custom CDs made."}