{"id":116028,"name":"cut","type":"verb","us_sound":"kʌt","us_link":"../audio/c/cut.mp3","uk_sound":"kʌt","uk_link":"../audio/c/ukcut__001.mp3","content":"cut verb\n(USE KNIFE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to break the surface of something, or to divide or make something smaller, using a sharp tool, especially a knife: to cut a slice of bread I cut myself/my hand on that glass/with that knife. Cut the meat up into small pieces. This knife doesn't cut very well. Where did you have your hair cut? [ + obj + adj ] Firefighters had to cut the trapped driver loose/free (= cut the metal to allow the driver to get out of the car) using special equipment. He fell off the swing and cut his head open (= got a deep cut in his head). He cut the cake in/into six (pieces) and gave each child a slice.\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\nMore examplesFewer examplesI cut my finger chopping onions last night.Don't just hack away at the bread - cut it properly!Could you cut me a small piece of cheese, please?He cut the cake into six pieces.The razor slipped while he was shaving and he cut himself.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ncut verb\n(REDUCE)\nB2 [ T ] to make something shorter, lower, smaller, etc.: to cut prices/costs to cut overtime/wages\nMore examplesFewer examplesWe need to cut our advertising costs.Computerization should enable us to cut production costs by half.Our expectations are that the UK will cut its interest rate.The government announced today that it is to cut funding for the arts for next year.The supermarket chain announced that it was cutting prices on all its fresh and frozen meat.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\ncut verb\n(REMOVE)\nB2 [ T ] to remove something from something else: The sex scenes had been cut out of the TV version of the film. cut and paste\nto move words or pictures from one place to another in a computer or internet document, app, post, etc.: It seems like the error is due to some sloppy cutting and pasting.\nSee more cut someone out of your will\nto decide not to leave someone any of your money or possessions when you die: It seems incredible that he would cut his own children out of his will.\nSee more\nMore examplesFewer examplesAny scenes of violence had been cut.We will have to cut the bits about the president's wife.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\ncut verb\n(MISS)\n[ T ] mainly US informal to not go, especially to a place where you should be: Your son has been cutting classes.\nSMART Vocabulary: related words and phrases\nAvoiding action\nabrogate\nabrogation\navoid\navoid something like the plague idiom\navoidance\ndoss\neschew\nevade\nevader\nevasion\nfiddle\nfiddle around\nfight shy of idiom\ninsure\nrun for the hills idiom\nshirk\nshort circuit\nshrink from something\nshy away from something\nsteer\nSee more results »\ncut verb\n(STOP)\n[ I or T ] to stop or interrupt something: to cut an engine/a motor \"Cut! (= stop filming!)\" shouted the director. cut someone short\nto stop someone from talking before they have finished what they were saying: He started to explain, but she cut him short.\nSee more cut it/that out! informal\nused to tell someone to stop talking or stop behaving in an annoying way: Just cut it out! I've had enough of your time wasting.\nSee more\nSMART Vocabulary: related words and phrases\nCancelling and interrupting\nadjourn\nadjourn to somewhere\narrest\ncall someone/something off\ncancellable\ndiversion\nhalt\nin midstream idiom\ninterrupt\nkick\nkick something into touch idiom\nrain\nscratch\nscrub\nshut\nshut (something) off\nsuspend\nsuspensive\ntake a break\nuncancelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing something to end\ncut verb\n(GROW TEETH)\ncut a tooth\n(of a baby) to grow a new tooth: The baby's cutting a tooth. That's why she's crying.\nSee more\ncut verb\n(TAKE SHORT WAY)\n[ I usually + adv/prep ] to go through or across a place, especially in order to get somewhere quickly: to cut through a passage cut a corner UK (also US cut the corner)\nto fail to keep to your own side of the road when going round a corner: Is it possible to fail a driving test by cutting a corner?\nSee more\nSMART Vocabulary: related words and phrases\nCrossing and moving through\nbash\nbash through (something)\nbreak\nbreak through something\ncriss-cross\ncrossable\ncrossed\nford\npenetrable\npenetration\npenetrative\npercolate\npierce\nrip\nrip through something\nscissor\nspan\nstraddle\ntransit\nuncrossed\nSee more results »\ncut verb\n(CHANGE DIRECTION)\n[ I ] to change direction quickly while in motion and head towards a different place: The player cut back to the inside and picked up a few extra yards for the first down. I had to slam on my brakes when another car cut in front of me from two lanes away.\nSMART Vocabulary: related words and phrases\nChanging direction\nabout-face\nabout-turn\nbear\nbranch\nbranch off\ndecoy\ndo an about-face\ndo an about-turn\nexcursive\nexcursively\nflippy\nping-pong\nregear\nreverse\nsheer\nslew\nsomeone's back is turned idiom\nswerve\nturn around\nwheel\nSee more results »\ncut verb\n(CARDS)\n[ I or T ] to choose a playing card by dividing a pile of cards into two parts: Who's going to cut the cards?\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\ncut verb\n(RECORD)\n[ T ] to record music or speech on a record: When did the Stones cut their first record?\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nremix\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nIdioms\ncan't cut it\ncut your coat according to your cloth\ncut corners\ncut someone dead\ncut down the angle\ncut someone down to size\ncut a fine figure\nbe cut from the same cloth\ncut it/things fine\ncut loose\nMore idioms\ncut your losses\ncut no ice with someone\ncut off your nose to spite your face\ncut a rug\ncut someone some slack\ncut a swathe through something\ncut your political, professional, etc. teeth\ncut the crap!\ncut the ground from under someone's feet\ncut to the chase\ncut (someone) to the quick\nbe cut up\ncut up rough\ncut both/two ways\nnot be cut out for something\nyou could cut the atmosphere with a knife\nPhrasal verbs\ncut across something\ncut back\ncut something back\ncut down\ncut something down\ncut in\ncut someone in\ncut into something\ncut something off\ncut someone off\nMore phrasal verbs\ncut someone/something off\ncut something out\ncut someone out\ncut out\ncut through something\ncut something up\ncut someone up\ncut up\ncut noun\n(INJURY)\nB1 [ C ] an injury made when the skin is cut with something sharp: a deep cut\nThesaurus: synonyms, antonyms, and examples\ndamage to the bodyinjuryHe was treated for minor injuries.woundMost of the casualties had gunshot wounds.cutHe walked away from the car crash with only cuts and bruises. gashHe was bleeding profusely from a deep gash in his leg.scratchShe had little scratches all over her arms. lacerationA doctor's report said the laceration had cut the jugular vein.\nSee more results »\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ncut noun\n(MEAT)\n[ C ] a piece of meat cut from a particular part of an animal: Sirloin is the most expensive cut of beef.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ncut noun\n(STYLE)\n[ S ] the shape into which something is cut: I don't like the cut of these jeans.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ncut noun\n(SHARE)\n[ S ] informal a share of something, usually money: When am I going to get my cut?\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\ncut noun\n(REDUCTION)\nC1 [ C ] a reduction in the number, amount, or rate of something: a cut in expenditure/interest rates/hospital waiting lists cuts [ plural ]\nreductions in public spending: Students and workers were out on the streets protesting against the cuts.\nSee more\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\ncut noun\n(PART REMOVED)\n[ C ] the act of removing a part from a book, film, etc., or a part that is removed: The movie contains some very violent scenes, so some cuts were made when it was shown on TV.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\ncut noun\n(PASSAGE)\nUS (UK cutting) a deep, narrow passage made through a hill for a road, railway, or canal\nSMART Vocabulary: related words and phrases\nDitches, dams & tunnels\ncutting\ndam\ndam something up\ndike\nditch\ndyke\ngroin\ngroyne\nha ha\ninspection chamber\nspillway\nsubway\nthe Channel Tunnel\nthe Chunnel\ntrench\ntunnel\ntunneller\nunderpass\ncut noun\n(IN CRICKET)\nin cricket, an attacking shot hit through an area level with or just behind or just in front of the batter (= the player who tries to hit the ball), on the right-hand side for a right-handed batter: He's a back-foot player and scores most of his runs from cuts and pulls. She couldn't keep the cut down and was caught at point.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\ncut noun\n(IN SPORT)\nUS informal in sports such as golf and baseball, an act of trying to hit a ball with a stick: She took a good cut at it with a five wood. He was taking some powerful cuts during batting practice.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nIdioms\na cut above\ncut and thrust\ncut verb\n(DIVIDE)\nAdd to word list\nAdd to word list\n[ I/T ] to use a sharp tool such as a knife to break the surface of something, divide something, or make something smaller: [ T ] Cut the apple in half. [ T ] She wanted to have her hair cut (= made shorter). [ M ] We had to cut two trees down (= remove them) to make room for the swimming pool. [ M ] The children cut the pictures out (= removed them by cutting) and stuck them in their scrapbooks.\n[ I/T ] A person who is cut is injured by something sharp that breaks the skin and causes bleeding: [ T ] I stepped on a piece of glass and cut my foot.\ncut verb\n(REDUCE)\n[ T ] to make less in size, amount, length, etc.: We’ve got to cut costs. The original movie was almost four hours long, but it was later cut to two hours.\ncut verb\n(MISS)\n[ T ] to stay away from a class, talk, performance, etc., that you have a duty to go to: He was cutting classes and getting failing grades.\ncut verb\n(STOP)\n[ I/T ] to stop or interrupt something, or to stop working suddenly or cause this to happen: [ I always + adv/prep ] Since his illness he’s cut out eating sweets altogether. [ T ] Because of failing grades, he was cut (= released) from the team. [ I ] “Cut! (= Stop filming!)” shouted the director.\ncut verb\n(GROW TEETH)\n[ T ] to grow a new tooth: The baby was cranky last night because she’s cutting a tooth.\ncut verb\n(CROSS)\n[ I always + adv/prep ] to go through or across a place, esp. in order to get somewhere quickly: To get to school I cut through the field.\ncut verb\n(CARDS)\n[ I/T ] to divide a pile of cards into two parts: [ I/T ] Who’s going to cut (the cards)?\ncut verb\n(RECORD)\n[ T ] to make a recording of music or speech on a record: When did Elvis cut his first record?\nphrasal verb cut across something\nto include several things that usually are separated from each other: Iron deficiency in women cuts across all socioeconomic levels.\nphrasal verb [ M ] cut back (something)\nto reduce or stop: He was advised to cut back on sugary sodas. Cancel the service, or cut it back to “basic.”\nphrasal verb [ M ] cut down (something)\nto reduce something in amount, size, or number of times repeated: I’ve decided to cut down on snacks. Seat belts have cut down the number of injuries in car accidents.\nphrasal verb cut in\ncut verb\n(INTERRUPT)\nto interrupt someone who is talking: I was talking to Jeff when Amy cut in.\nphrasal verb [ M ] cut someone in\nto include someone in a plan, activity, or process: Next time you get free concert tickets, cut me in.\nphrasal verb [ M ] cut off something/someone\ncut verb\n(STOP)\nto stop or interrupt something suddenly, or to stop someone from speaking: We were cut off in the middle of our phone conversation.\nphrasal verb [ M ] cut off someone/something\ncut verb\n(DRIVE)\n(of a driver or vehicle) to move suddenly in front of another driver or vehicle, leaving too little space: He claimed that a truck had cut him off just before the accident.\nphrasal verb [ M ] cut someone out\nto keep someone from taking part in a plan, activity, or process: Some critics say the proposed amendment is effectively cutting others out of the planning process.\nphrasal verb cut out for something\nto be the right type of person for a particular job or activity: He’s just not cut out for politics.\nphrasal verb [ M ] cut something short\nto stop something suddenly before it is completed: We cut short our vacation when we learned of my mother’s illness.\nphrasal verb cut through something\nto understand something that is not easy to understand: She can cut through the confusing statistics and get at the important facts. Idioms\ncut both ways\ncut corners\nCut it out!\ncut off your nose to spite your face\ncut someone some slack\nnot cut it\ncut noun [C]\n(REDUCTION)\na reduction in the size, amount, length, etc., of something: Many workers had to take a cut in pay. For the TV version, they made several cuts in the movie.\ncut noun [C]\n(SOMETHING DIVIDED)\nsomething made by cutting: She went to the butcher’s to get a good cut of meat.\nA cut is an injury to the skin made by a sharp object: She had a nasty cut on her hand.\nA cut is also the particular way clothing looks: the cut of a suit\ninfml A cut is also a share: I was part-owner of the business, and when my sister sold it, I said I wanted my cut.\ncut adjective [not gradable]\n(DIVIDED)\n(of flowers) removed from their roots by being cut through their stems so they can be used for decoration: These cut flowers will last three days in fresh water.\nAdd to word list\nAdd to word list\nto make something lower, smaller, shorter, etc.: cut sth (from sth) (to sth) We have cut our wage bill from £12,000 to £8,000 per week.cut sth (from sth) We need to cut 50% from our advertising budget.cut sth (by sth) The manufacturing group aims to cut its carbon emissions by 20% over the next five years. cut jobs/staff/the workforce Schmitz Chemicals plans to cut 20,000 jobs worldwide. cut borrowing/costs/spending cut output/production See also\nprice-cutting\nto remove something from a document, especially from a document on a computer screen: The report is too long – I need to cut 500 words. I'll cut and paste some photos from our online catalogue into my presentation.\ncut a deal\nto reach an agreement: The carmaker has cut a deal with unions to limit pay rises.\ncut both/two ways\nto work in two ways, or to have two opposite effects: Setting prices high cuts both ways – it could lose some customers, but it also suggests high-quality.\ncut corners\nto do something in a way that saves time or money, but that reduces quality: If a restaurant cuts corners on ingredients, it will lose customers.\ncut it informal\nto successfully do what you are asked to do: Some people work well under pressure; others can't cut it. For heavy office use, this printer just doesn't cut it.\ncut it/things fine informal\nto leave very little, or not enough, time to do something: It's two o'clock now, so you're cutting it fine if you need to be at the airport by three.\ncut your losses\nto avoid losing any more money than you have already lost: The manufacturer has decided to cut its losses and sell its unprofitable divisions. Phrasal verbs\ncut back\ncut down\ncut into sth\ncut sb off\na reduction in the amount or level of something: a 0.25% cut in interest rates The supermarket is expected to make drastic job cuts to its 9,000-strong workforce.big/deep/swingeing, etc. cuts There will need to be big cuts in public spending. price/spending/tax, etc. cuts job/pay/wage, etc. cutsmake/propose/threaten, etc. cuts The industry regulator announced that it is proposing price cuts of at least 7%.\ninformal a share in an amount of money: If you make a profit on the deal, I'll expect a cut."}