{"id":116033,"name":"cutaway","type":"noun","us_sound":"ˈkʌt̬.ə.weɪ","us_link":"../audio/c/cdo1121uscuta1267.mp3","uk_sound":"ˈkʌt.ə.weɪ","uk_link":"../audio/c/cdo1121ukcuta1250.mp3","content":"cutaway noun [C]\n(IN FILM)\nAdd to word list\nAdd to word list\nan occasion when a piece of film or an image showing a different subject or person is shown during a film, television programme, etc.: There are occasional cutaways to the interviewer smiling or nodding. The film has a documentary look, with unsteady camera shots and quick cutaways.\nMore examplesFewer examplesThe story is told in a rather random way, with sudden cutaways to irrelevant characters.We love our shows to have a fast pace, interesting cutaways, and funny music.The video simply features the band playing the song from beginning to end, with no cutaways.Her family was the subject of several camera cutaways during the speech.\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\naudition\nauteur\ncanister\ncomputer-animated\nfog machine\nframing\nframing device\ngreen screen\nhelmer\nlinear\nprop\nreshoot\nrestage\nrun through something\nscreen test\nSFX\nspecial effect\nSee more results »\ncutaway noun [C]\n(PICTURE)\na picture of something with some outer parts not included so that you can see the inside: The sketch shows a cutaway of a Georgian house. To explain how the mechanism works, we really need a cutaway.\npart of a picture or piece of material that has been cut away to form a hole: The report is in a card folder with a cutaway so you can see the title page.\nMore examplesFewer examplesCutaways show how Roman buildings were constructed and what people did inside them. The image is framed within a curved oblong hole, as if seen through a cutaway in a book cover.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ndiagram\nfig\nflowchart\ngraph\ngraph paper\nhistogram\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\nscatterplot\ntabular\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nCutting off and disconnecting\ncutaway noun [C]\n(GUITAR)\nmusic\n&#160; specialized a guitar that is designed with a space at the top of its body on one side of the neck (= long narrow part), or the space itself: She usually plays an electro-acoustic cutaway. Guitars without a cutaway tend to have a fuller sound.\nMore examplesFewer examplesA cutaway is slightly lighter and easier to handle for some players.It is easier to reach the higher frets on a guitar with a cutaway.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\ndrumstick\npedal steel\npenny whistle\npercussion\npercussionist\npercussive\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »\ncutaway noun [C]\n(CLOTHES)\na coat or jacket that is short at the front and long at the back, usually worn for formal occasions: I love the velvet blazers and cutaways. The groom wore a cutaway with a bright red pocket handkerchief.\nSMART Vocabulary: related words and phrases\nCoats, jackets & cloaks\nachkan\nanorak\nBarbour\nbarn coat\nbaseball jacket\nDJ\ndonkey jacket\ndouble-breasted\ndoublet\ndown jacket\nmac\nmackintosh\nmantle\nNehru jacket\noilskin\nsingle-breasted\nslicker\nsmoking jacket\nsports jacket\nstole\nSee more results »\ncutaway adjective [before noun]\n(FILM)\n(of an image or short piece of film) shown during a film, television programme, etc. and having a different subject to the main subject: There will be no cutaway shots of a candidate while his or her opponent is speaking.\nMore examplesFewer examplesThe player's wife was seen to react in cutaway shots during the coverage.We will show comments from the public in a cutaway section.\nSMART Vocabulary: related words and phrases\nCinema & theatre: production, direction & recording\nacquire\nacquisition\narmourer\naudition\nauteur\ncanister\ncomputer-animated\nfog machine\nframing\nframing device\ngreen screen\nhelmer\nlinear\nprop\nreshoot\nrestage\nrun through something\nscreen test\nSFX\nspecial effect\nSee more results »\ncutaway adjective [before noun]\n(PICTURE)\n(of a picture or model) with some outer parts not included so that you can see the inside: The cutaway diagram shows the virus with its protein spikes on the outer layer, an intermediate layer and the inner layer containing RNA. There was a cutaway picture showing the inside of the reactor.\nMore examplesFewer examplesOnly half the ship was recovered, which made a spectacular display like a giant cutaway diagram.The cutaway model shows where an electrical cable can be plugged in to charge batteries in the hybrid vehicle.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ndiagram\nfig\nflowchart\ngraph\ngraph paper\nhistogram\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\nscatterplot\ntabular\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\ncutaway adjective [before noun]\n(CLOTHES)\n(of a coat or jacket) short at the front and long at the back, and usually worn for formal occasions : He wears a formal black cutaway coat and trousers.\na piece of clothing designed with parts cut out of it so that it has holes or is shorter than you would expect: One popular version of the cutaway swimsuit is the one-strap. I like the black velvet dress with cutaway shoulders.\nMore examplesFewer examplesThe bosses are invariably depicted wearing old-fashioned cutaway coats and spats.A cutaway collar complements a tie with a chunky knot.She wore a pink shirt with cutaway sleeves.Tina went for stylish cropped trousers and a cutaway T-shirt.\nSMART Vocabulary: related words and phrases\nCoats, jackets & cloaks\nachkan\nanorak\nBarbour\nbarn coat\nbaseball jacket\nDJ\ndonkey jacket\ndouble-breasted\ndoublet\ndown jacket\nmac\nmackintosh\nmantle\nNehru jacket\noilskin\nsingle-breasted\nslicker\nsmoking jacket\nsports jacket\nstole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\ncutaway adjective [before noun]\n(GUITAR)\nA cutaway guitar is designed with a space at the top of its body on one side of the neck (= long narrow part): There are advantages and disadvantages to a cutaway guitar.\nMore examplesFewer examplesShe bought a cutaway steel-string acoustic.\nSMART Vocabulary: related words and phrases\nMusical instruments\naccordion\nacoustically\naerophone\nalphorn\nalto\ndrum machine\ndrumbeat\ndrumhead\ndrumroll\ndrumstick\npedal steel\npenny whistle\npercussion\npercussionist\npercussive\ntuning peg\nukulele\nunpitched\nunplugged\nuntuned\nSee more results »"}