{"id":116125,"name":"cutoff","type":"noun","us_sound":"ˈkʌt̬.ɑːf","us_link":"../audio/c/cutoff.mp3","uk_sound":"ˈkʌt.ɒf","uk_link":"../audio/c/ukcut__013.mp3","content":"cutoff noun [C]\n(STOP)\nAdd to word list\nAdd to word list\nthe act of stopping the supply of something: The US has announced a cutoff of military aid to the country.\na fixed point or level at which you stop including people or things: 31 March is the cutoff date for applications to be accepted.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhang\njack something in\nkill something stone-dead idiom\nknock\nknock off (something)\nlay\nlid\nsnap\nstamp on something\nstamp something out\nstanch\nstaunch\nstem\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRange and limits\ncutoff noun [C]\n(TROUSERS)\ncutoffs [ plural ] (also cutoff jeans)\na pair of jeans or trousers that has had the bottom parts of the legs removed: She was wearing a pair of cutoffs over blue leggings.\nSee more\ncutoff noun [C]\n(LIMIT)\nAdd to word list\nAdd to word list\na fixed point or limit at which something is stopped: The cutoff for blood donations is usually age 65.\ncutoff noun [C]\n(ROAD)\na road that leaves another and provides a shorter route: We took the cutoff and saved 20 minutes on the trip home.\nAdd to word list\nAdd to word list\na fixed point or level at which something stops: an age/income cutoff There is an income cutoff for eligibility.keep/put/set a cutoff at sth The return on your investment depends on how the FTSE 100 index performs, and they have set a cut-off at 60% - or 9.9% tax-free a year. The current cutoff for subsidy payments is $2.5 million.\na situation in which you stop doing, making, paying, or supplying something: The dispute over prices has led to a temporary cut-off in deliveries. The country's government is in danger of collapse because of the international cutoff of revenue and aid.\nrelating to a fixed point or level at which something stops: a cutoff date/point January 31 is the cutoff date for claims to be filed."}