{"id":116128,"name":"cutout","type":"noun","us_sound":"ˈkʌt̬.aʊt","us_link":"../audio/c/cutout.mp3","uk_sound":"ˈkʌt.aʊt","uk_link":"../audio/c/ukcut__015.mp3","content":"cutout noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\na shape that has been cut out from something, especially a flat one that can stand vertically: Fed-up residents have resorted to using cardboard cutouts of children placed near the edge of the road so that passing drivers will see them and slow down. I had my photo taken with a life-size cut-out of the actor. See also\ncardboard cutout\na space made in something such as a material or object by cutting part of it out: You can make cut-outs in the dough with cookie cutters if you like. The glow of the candle shines through star-shaped cutouts.\nMore examplesFewer examplesVisitors to the casino are encouraged to have a picture taken with a life-sized cut-out of the boxing champion.Magazine cutouts, often depicting women, decorate the salon walls.She was standing next to a cut-out of the President.The one-piece swimsuits with plunge fronts and cut-outs seemed to be designed only for those with flat, toned tummies.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHoles, hollows and dips\nMaking holes in things\ncutout noun [C]\n(SAFETY DEVICE)\na device that, for safety reasons, stops or interrupts a circuit, used, for example, in a motor or engine: A safety cut-out had switched off the power when she opened the hatch. a cutout fuse/switch\nMore examplesFewer examplesSafety features include an anti-scald cut-out, which switches off the heater at a pre-set maximum temperature.\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ndisc brake\ndistributor\ndrive shaft\ninternal combustion engine\nmuffler\nneutral\nplug\nsuspension\ntailpipe\ntappet\nSee more results »\n(of a shape) having been cut out from something: The model scenery even had a green mountain and a sky with cutout stars.\n(of an object, piece of clothing) having holes in it made by cutting parts out: Forget bikinis, there's only one item to wear on the beach this summer and that's a cut-out swimsuit.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHoles, hollows and dips\nMaking holes in things\nAdd to word list\nAdd to word list\na shape cut out, or to be cut out, from something: This children’s book has animal cutouts."}