{"id":116141,"name":"cutter","type":"noun","us_sound":"ˈkʌt̬.ɚ","us_link":"../audio/c/cdo0123uscutt0674.mp3","uk_sound":"ˈkʌt.ər","uk_link":"../audio/c/cdo0123ukcutt0838.mp3","content":"cutter noun [C]\n(TOOL)\nAdd to word list\nAdd to word list\na tool or device for cutting something: Slide the frittata out of the pan and slice it with a pizza cutter. a hedge/wire/pastry cutter This cutter has a six-inch blade. His woodworking shop is full of power tools, blades, bits, and cutters. See also\nbolt cutters\nbox cutter\ncookie cutter\nglass cutter\nMore examplesFewer examplesShe was using an electric hedge cutter.You need pliers and a wire cutter.I put a potato into the machine and pressed down on the arm of the cutter.Roll out the icing and cut a star or tree shape with a cutter.The cardiologist uses a small cutter to remove the abnormal tissue.Firefighters took 40 minutes to saw through the metal frame using a hydraulic cutter.\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ndevice\nfan\ngadget\ngrabber\nhaft\nhardware\npower tool\nprecision instrument\nratchet\nspacer\nspreader\nstuffer\ntoolkit\nutensil\nutility belt\nSee more results »\ncutter noun [C]\n(WORKER)\na person, especially a worker, who cuts something: The exploitation of sugar cane cutters in Haiti is well known. He worked at the meat plant for 35 years as a cutter. See also\nwoodcutter\na person whose job is to cut cloth for making clothes: To succeed in this business, you need a good dress designer and a good cutter. All of the stylists in this salon are expert cutters.\nMore examplesFewer examplesThe sole job of the cutters was to trim the reeds to a regular length, which was tedious work.Her father was a diamond cutter in Antwerp.Tree cutters went from door to door offering their services.She had a highly skilled job as a garment cutter.\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ndrudge\ngang\nlabour market\nmachinist\nmanpower\nnight shift\nrelay\nsalaryman\nskeleton staff\nslogger\nstaff\nthe shop floor\nworkforce\nworkhorse\nworking group\nworking party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCutting and stabbing\ncutter noun [C]\n(REDUCING)\nsomeone or something that reduces a tax, a cost, etc.: The candidate highlighted his record as a tax cutter. Many of these changes are potential cost cutters.\nMore examplesFewer examplesFar from being job cutters, the new management intend to increase staff levels.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndepress\ndiscount\ndrop off\nfreeze\nmark something down\noverdiscount\npost-devaluation\nprojected value\npromo code\nspiral\nSee more results »\ncutter noun [C]\n(BOAT)\nsailing\n&#160; specialized a fast, light boat, used for example as a patrol boat (= checking an area for crime or danger) or for carrying small loads: When the ship reached the American coast it was greeted by a US coastguard cutter.\nsailing\n&#160; specialized a small, fast sailing ship: A little white cutter with red sails was coming in towards them.\nMore examplesFewer examplesThe larger ships carry cutters that go out and do rescues. After he retires, he and his wife plan to go sail his cutter off the Devon coast.\nSMART Vocabulary: related words and phrases\nPassenger, cargo & military ships\nbanana boat\ncar ferry\nclipper\ncoaster\ncontainer ship\nCorvette\nfireship\nflagship\njetfoil\nliner\nschooner\nsemi-submersible\nship\nsteamboat\nstoreship\nsubmersible\ntall ship\ntransport ship\ntrawler\nwarship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoats & sailing craft\ncutter noun [C]\n(SPORT)\nin cricket, a throw in which the ball suddenly changes direction after it hits the ground: He was a great slow wicket bowler, famous for bowling cutters. See also\nleg cutter\noff cutter\nin baseball, a hard throw in which the ball moves slightly as it reaches the batter (= the player who tries to hit the ball): His cutter has become a devastating weapon. The hitter swung and missed at a cutter. Synonym\ncut fastball\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatsman\nbatswoman\nbatting average\nbowl someone out\nbowling\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\nsix\ntest match\nuppishly\nwalk\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders"}