{"id":116186,"name":"cv","type":"noun","us_sound":"ˌsiːˈviː","us_link":"../audio/c/uscuria030.mp3","uk_sound":"ˌsiːˈviː","uk_link":"../audio/c/ukcut__022.mp3","content":"Add to word list\nAdd to word list\nB1 mainly UK (US usually résumé) abbreviation for\ncurriculum vitae formal : a short written description of your education, qualifications, previous jobs, and sometimes also your personal interests, that you send to an employer when you are trying to get a job\nUS a written description of the previous work of someone who is looking for a job at a college or university: Applicants interested in applying for the position should submit their CVs to the Anatomy Department no later than 15 February.\nMore examplesFewer examplesI see from your CV, Miss Taylor, that you worked for two years in Hong Kong.Before I apply for the job, I must update my CV and print it out again.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nabstract\nbiodata\ncatch-all\ncurriculum vitae\ngist\nhandout\nin short idiom\nnutshell\nresume\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nsummarization\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\ntrot\nupsum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nAdd to word list\nAdd to word list\na written description of your education, achievements, and previous employment, used esp. to show someone who may employ you in a new job, or to qualify for an honor\nAdd to word list\nAdd to word list\na short written description of your education, qualifications, previous jobs, and sometimes also your personal interests, that you send to an employer when you are trying to get a job: Please send a full CV and covering letter quoting reference \"EC99\" to the above address. This type of project management is a great thing to have on your CV.\nUS a written document giving a description of your previous work, previous employment, etc. that you show to someone when you are applying for a job, a university course, etc.: Applicants for the position should submit their CVs to the Anatomy Department no later than February 23. See also\ncurriculum vitae"}