{"id":97394,"name":"cyclic","type":"adjective","us_sound":"ˈsɪk.lɪk","us_link":"../audio/c/cdo0622uscycl0463.mp3","uk_sound":"ˈsɪk.lɪk","uk_link":"../audio/c/cdo0622ukcycl0606.mp3","content":"cyclic adjective\n(REPEATED)\nAdd to word list\nAdd to word list\nrelating to or involving a cycle of events (= a set of events that are repeated regularly in the same order): Tourism industry experts said US appetites for travel are cyclic. Cyclic changes in a star's position can reveal bodies that are orbiting it. Synonym\ncyclicalOpposite\nnon-cyclic\nMore examplesFewer examplesLife is cyclic but not everyone is on the same cycle, so friendships can get out of sync.Cyclic breast pain is related to a woman's menstrual cycle.Some people blamed the ozone hole on natural forces, including small cyclic variations in the sun's energy output.\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninline\nlinearity\nlinearly\nlitany\nmerry-go-round\npriority\nprocession\nsecondly\nsequence\nsequencing\nstring\ntrain\nwave\nSee more results »\ncyclic adjective\n(CHEMISTRY)\nchemistry\n&#160; specialized relating to a structure of molecules (= the simplest units of a chemical substance) that contain atoms in closed rings: We would see a cyclic molecule such as cyclohexane A as a flat ring with the hydrogen atoms around it. His work on the structure of the metal carbonyls had suggested that a cyclic structure was improbable. Opposite\nnon-cyclic\nMore examplesFewer examplesA traditional jet fuel has more straight- and branched-chain hydrocarbon molecules called alkanes, whereas the new fuel has more cyclic molecules that look like pairs of rings.The reaction produces a cyclic sulfonium compound.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nchemical formula\ndistilled water\nelectrolyte\nendothermic\nepitaxial\nepitaxially\nepitaxy\nexothermic\ninorganic chemistry\nionic bond\nnonreactive\npreatomic\nreactive\nreactivity\nreduction\nSee more results »"}