{"id":97382,"name":"cycle","type":"noun","us_sound":"ˈsaɪ.kəl","us_link":"../audio/c/cycle.mp3","uk_sound":"ˈsaɪ.kəl","uk_link":"../audio/c/ukcyber009.mp3","content":"cycle noun\n(BICYCLE)\nAdd to word list\nAdd to word list\nB2 [ C ] UK a bicycle: Cycles cannot be taken on this train. A thousand people took part in the region's biggest-ever cycle race.\nMore examplesFewer examplesSecure locking for cycles is available here.We're looking for a cycle hire shop.\nSMART Vocabulary: related words and phrases\nBicycles\nbackie\nbackpedal\nbalance bike\nbicycling\nbike path\nbike rack\nBMX\nchopper\nfreight bike\nhandlebar\nkeirin\nkickstand\nmountain biker\npushbike\nreflector\nskibob\nstabilizer\ntandem\ntraining wheels\ntrishaw\nSee more results »\ncycle noun\n(SERIES)\nB2 [ C ] a group of events that happen in a particular order, one following the other, and are often repeated: the life cycle of a moth They are trapped in a cycle of violence.\n[ C ] one in a series of movements that a machine performs: the washing machine's spin cycle\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ninconsecutive\ninline\nlinear\nlinearity\nlinearly\nlitany\nprecedence\npriority\nprocession\nsecondly\nsequence\nstring\ntrain\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRepeating an action\ncycle noun\n(LITERATURE/MUSIC)\n[ C, + sing/pl verb ] a group of plays, poems, songs, etc. written by one person and connected with each other by dealing with the same characters or ideas: It's one in a cycle of plays that are being performed on successive evenings.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\ndirector's cut\nhokum\none-shot\npaean\nparodic\nparody\npassion project\npolice procedural\npsychological\nslow\nsmash\ntragicomedy\nSee more results »\ncycle noun\n(BASEBALL)\n[ C ] In baseball, if a player hits for the cycle, they hit a single (= a hit that allows them to reach first base), a double (= a hit that allows them to reach second base), a triple (= a hit that allows them to reach third base), and a home run (= a hit that allows them to run around all four bases) in the same game: He was the first player in the team's history to hit for the cycle.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\ncycle verb\n(RIDE BIKE)\nB1 [ I or T ] mainly UK to ride a bicycle: Most of the kids cycle or walk to school. We have cycled all the way from Scotland. She was so determined to get fit she often cycled eight miles to the nearest swimming pool. Related word\ncycling\nMore examplesFewer examplesWe cycled through scenic hill country.They ski in the winter and cycle in the summer.It's too far to cycle.He cycled 40 minutes to work every morning and back again in the evening.I cycled the 60 miles with a friend and it cost us very little because we slept in a tent.\nSMART Vocabulary: related words and phrases\nBicycles\nbackie\nbackpedal\nbalance bike\nbicycling\nbike path\nbike rack\nBMX\nchopper\nfreight bike\nhandlebar\nkeirin\nkickstand\nmountain biker\npushbike\nreflector\nskibob\nstabilizer\ntandem\ntraining wheels\ntrishaw\nSee more results »\ncycle verb\n(REPEAT)\nto go through or repeat a cycle (= a series of events that happen in the same order one after the other, and are often repeated): The earth cycles through natural heating and cooling trends. People with bipolar disorder can cycle between depression and mania. He spent his adult life cycling in and out of prison.\nMore examplesFewer examplesThe festival cycles between the three cities.Survivors of addiction have cycled through the criminal justice system and rehabilitation.Active in Republican circles, he has cycled in and out of government and the private sector.\nSMART Vocabulary: related words and phrases\nRepeating an action\nbe at it again idiom\nbe/sound like a broken record idiom\nbinge-watch\nbingeable\nblitz\ngo/run round in circles idiom\nhere we go (again) idiom\niteration\niterative\niteratively\nkeep on doing something\nkeep your eye in idiom\nrepetition\nrepetitive\nrepetitively\nreplicable\nreprise\nreproduce\nreproducible\nrewrite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrder and sequence - general words\ncycle noun [C]\n(BICYCLE)\nAdd to word list\nAdd to word list\nshort form ofbicycle\ncycle noun [C]\n(SERIES)\na complete set of events that repeat themselves regularly in the same order, or a regularly repeated period of time: Some economists predict the business cycle will turn downward.\nAdd to word list\nAdd to word list\na group of events that happen in a particular order, one following the other, and often repeated: Interest rates tend to move in cycles. Spending quickly becomes a vicious cycle - the more you have the more you spend.\nECONOMICS a pattern of successful periods followed by less successful periods that often happens in an industry, a market, a business, etc.: Normally, the business has cycles, and every 10 years it peaks. If you sell goods in a seasonal industry, then cycles of consumer demand are an important dimension of your environment.boom-and-bust/market cycles Security prices tend to move up and down over various market cycles and logic says to invest when prices are low. The company's markets had passed the bottom of the cycle and were slowly growing again.\nECONOMICS a single successful period, period of failure, etc. that is part of a regular series: a boom/down cycle The country is still in a boom cycle. The market is still in its growth cycle.a cycle of debt/poverty The Credit Union tries to wean borrowers off the cycle of debt by offering financial counseling and payment plans.\na regular period of time during which an activity, job, etc. is done: a two-year/3-month/annual, etc. cycle a budget/planning/sales cycleproduct/product-development cycles They work to shorten product-development cycles and to boost manufacturing productivity. See also\nthe accounting cycle\nbilling cycle\nbusiness cycle\nfamily life cycle\njob cycle\nKondratieff cycle\nlife cycle"}