{"id":98021,"name":"cynical","type":"adjective","us_sound":"ˈsɪn.ɪ.kəl","us_link":"../audio/c/cynical.mp3","uk_sound":"ˈsɪn.ɪ.kəl","uk_link":"../audio/c/ukcyber023.mp3","content":"Add to word list\nAdd to word list\nC2 believing that people are only interested in themselves and are not sincere: She has a pretty cynical view of men. I've always been deeply cynical about politicians.\nused to say that someone's feelings or emotions are used to your own advantage: She works in that most cynical of industries - advertising. He praises my cooking but it's just a cynical ploy to get me to make him dinner.\nsports\n&#160; UK specialized not showing fairness or respect to an opposing player: Most of my injuries have come from bad cynical tackles. Cynical fouls by defenders with no intention of playing the ball were the reason referees were asked to get tough in the first place.\nMore examplesFewer examplesMany people have become cynical about the stage-managed debates between politicians which regularly appear on television.15 years in the teaching profession had left him world-weary and cynical.\"He's only pretending to like classical music so that Emma will go out with him.\" \"Don't be so cynical - you don't know that.\"I thought the actor's appeal was very moving, but my husband saw it as a cynical attempt to get publicity.How did my trusting little child suddenly turn into such an angry, cynical teenager?\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspected\nsuspicion\nsuspiciously\nunchallengeable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nControlling and being in charge\nUnsuitable and unacceptable\nGeneral terms used in ball sports\nRelated words\ncynically\ncynicism\nAdd to word list\nAdd to word list\nnot trusting or respecting the goodness of other people and their actions, but believing that people are interested only in themselves: Listening to politicians for too long can make you cynical. She’s become cynical about men. cynicism noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈsɪn·əˌsɪz·əm/\nHe’s often been accused of cynicism, but he says he’s just realistic."}