{"id":200365,"name":"jag","type":"noun","us_sound":"dʒæɡ","us_link":"../audio/j/usb00650.mp3","uk_sound":"dʒæɡ","uk_link":"../audio/j/ukb00650.mp3","content":"jag noun [C]\n(PERIOD OF BEHAVIOUR)\nAdd to word list\nAdd to word list\ninformal a short period when someone behaves repeatedly in a particular way or does a lot of a particular thing: a crying/sneezing/coughing jag She says she's on a health jag.\nMore examplesFewer examplesHe was a sensitive person, prone to crying jags.Apart from a few late-night chocolate jags, my diet is pretty good.He began stealing things and then went on an arson jag.His entire first novel was written during a 90-hour jag. I've been on a jag lately of making different salad dressing recipes trying to find the perfect one.\nSMART Vocabulary: related words and phrases\nContinually & repeatedly\n24/7\nad nauseam\nagain\nalway\nalways\nhour\nhour after hour idiom\nhourly\nimmemorial\nmorning\nmorning, noon, and night idiom\nnight\nprevalently\nquick-fire\nrecurrently\nrepeated\nrepeatedly\nrumble\nstreak\nyear in, year out idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\njag noun [C]\n(INJECTION)\nScottish English informal (UK jab); (US shot) an injection (= an amount of a drug or vaccine put into the body using a needle): The doctor gave her a jag of morphine. I was offered a hepatitis B jag.\nan amount of something such as a drug that gives you a particular feeling, especially a feeling of energy, or this feeling itself: We have a kettle and coffee in our room so we can give ourselves a jag of caffeine when we want. Diving into cold water is a cheap and easy way of getting an adrenalin jag. Synonyms\nhigh\nshot\nMore examplesFewer examplesHow many people have died of the disease compared to vaccinated people who died as a result of the jag?You know that feeling when you are inwardly screaming for a jag of coffee?He was as lively as a toddler on a sugar jag.\nSMART Vocabulary: related words and phrases\nMedicine in different forms\nblister pack\nbolus\nCaplet\nchemotherapy\ndosage\ndose\nelixir\ninjectable\ninjection\njab\nknockout drops\nmedicate\nmedication\nmixture\noverdose\npatent medicine\nphial\npillbox\nprescription\nwonder drug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImmunology & vaccination\nEnergetic and lively\njag noun [C]\n(SHARP POINT)\na line, shape, or object that forms a sharp point: A lone jag of lightning sliced through the dark sky. Far below me I could see moss-covered jags of rocks. Related word\njagged\nMore examplesFewer examplesThere were thunder clouds, and jags of lightning flashed in the sky. A dramatic fault line cuts a dark jag across the planet's surface.Medieval painters showed waves as jags and curves of line.The line on the gauge was interrupted by spikes, small jags representing pulses.\nSMART Vocabulary: related words and phrases\nRough, irregular and uneven\nabrasion\nabrasive\nabrasiveness\nbumpy\ncoarsely\njaggedly\njaggy\njerky\nknobbly\nleathery\npockmarked\nraggedly\nraggedness\nraggedy\nroughness\nrugged\nunsteadily\nunsteady\nwonkiness\nwonky\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSharp and blunt"}