{"id":200439,"name":"jail","type":"noun","us_sound":"dʒeɪl","us_link":"../audio/j/jail.mp3","uk_sound":"dʒeɪl","uk_link":"../audio/j/ukganja004.mp3","content":"Add to word list\nAdd to word list\nB1 a place where criminals are kept to punish them for their crimes, or where people accused of crimes are kept while waiting for their trials: the country's overcrowded jails a 13-year jail sentence/term The financier was released from jail last week. They spent ten years in jail for fraud. They don't throw anyone in jail for parking illegally, but they will tow your car and charge you a fine. Synonym\nclink\nMore examplesFewer examplesArrangements were made to move the prisoners to another jail.He faces three years in jail for selling narcotics.He's stayed out of trouble since he was released from jail last year.There has been a mass breakout from one of Germany's top security jails.He has been languishing in jail for the past 20 years.\nSMART Vocabulary: related words and phrases\nPrisons & parts of prisons\napproved school\nBastille\nboot camp\nborstal\nbrig\nclink\ngaol\ngaoler\nhalfway house\nHMP\nmatron\npanopticon\npenal colony\npenitentiary\nprison\nprison camp\nstraightjacket\nstraitjacket\nthe gulag\nyoung offender institution\nSee more results »\nto put someone in a jail: He was jailed for three years. Synonym\nimprison\nMore examplesFewer examplesHe was jailed for four months for drink-driving.Protestors were executed, jailed or otherwise persecuted.He was jailed for 15 years for stabbing his wife to death.California's \"three strikes and you're out\" bill means that from now on criminals found guilty of three crimes are jailed for life.He was jailed for revealing secrets to the Russians.\nSMART Vocabulary: related words and phrases\nPutting people in prison\nat His/Her Majesty's pleasure idiom\nbang\nbang someone up\nbar\nbehind bars idiom\nbird\nimmured\nimprison\nimprisonment\nincarcerate\nincarceration\nintern\nlock\npen\nrestraint\nrot\nrot in jail, prison, etc. idiom\nsend\nsend someone down\nstretch\nSee more results »\nAdd to word list\nAdd to word list\na place where criminals are kept as a punishment for their crimes or while waiting for trial: [ C ] County jails are already overcrowded. [ U ] He was sentenced to six months in jail. jail verb [ T ] us\nYour browser doesn't support HTML5 audio\n/dʒeɪl/\nHe was jailed for three years."}