{"id":200971,"name":"jazz","type":"noun","us_sound":"dʒæz","us_link":"../audio/j/jazz.mp3","uk_sound":"dʒæz","uk_link":"../audio/j/ukjaund016.mp3","content":"Add to word list\nAdd to word list\nA2 a type of modern music originally developed by African-Americans, with a rhythm in which the strong notes often come before the beat. Jazz is usually improvised (= invented as it is played).\nExamples\nI've never really gone in for classical music, but I love jazz.The famous jazz musician, Duke Ellington, was a composer, arranger and pianist.I wish there was more jazz on the radio.The drums and double bass usually form the rhythm section of a jazz group.They booked a jazz band for their wedding.\nSMART Vocabulary: related words and phrases\nJazz & blues\nacid jazz\nbebop\nblues\nbluesman\nbluesy\nfree jazz\nfunk\nfunky\nhonky-tonk\njazzily\njazzy\nragtime\nrhythm and blues\nscat\nskiffle\nstride piano\nswing\ntrad jazz\ntraditional jazz\ntwelve-bar blues\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of music\nIdiom\nand all that jazz\na brand name for a type of apple that is a cross (= a mixture of two things combined) between a Royal Gala and a Braeburn: Jazz are juicy and great in salads. Jazz apples have a reddish colour that is broken up by patches of greenish-yellow or orange. Jazz apples were developed in New Zealand in the 1980s and introduced on the market in 2000.\nMore examplesFewer examplesI pulled my Jazz apple out of the bag and took a bite.I don't remember seeing Jazz apples at the farmers markets or in the supermarkets around here.\nSMART Vocabulary: related words and phrases\nTypes of fruit\nackee\nalligator pear\nalpine strawberry\namla\naçaí\ncooker\ncooking apple\ncopra\ncrab apple\ncranberry\nloquat\nlychee\nmajhool date\nmandarin\nmango\nsalmonberry\nsaskatoon\nsatsuma\nsatsuma plum\nscuppernong\nSee more results »\nAdd to word list\nAdd to word list\na type of music of African-American origin with a strong rhythm in which the players improvise (= invent music that has not been written)"}