{"id":201101,"name":"jelly","type":"noun","us_sound":"ˈdʒel.i","us_link":"../audio/j/jelly.mp3","uk_sound":"ˈdʒel.i","uk_link":"../audio/j/ukjehov006.mp3","content":"jelly noun\n(SUBSTANCE)\nAdd to word list\nAdd to word list\nA2 [ C or U ] a sweet soft food made by cooking fruit with sugar to preserve it. It is smooth, without any pieces of fruit in it. Jelly is eaten on bread: a peanut butter and jelly sandwich apple jelly Compare\njam noun (FOOD)\nmarmalade\nistetiana/Moment/GettyImages\n[ C or U ] UK (US trademark Jell-O) a soft, sweet, usually brightly coloured food made from sugar, gelatine, and fruit flavours, that shakes slightly when it is moved: I've made a strawberry jelly for the children's tea. jelly and ice cream\nEdith64/iStock/Getty Images Plus/GettyImages\n[ U ] any soft, slightly wet substance that shakes slightly when it is moved: Frogs' eggs are covered in a sort of transparent jelly.\nMore examplesFewer examplesLeave the jelly in the fridge to set.I was shaking like a jelly before my exam.Add a spoonful of redcurrant jelly to the sauce.The jelly mould was shaped like a crown.The contents of the bag had turned into an amorphous mass of jelly.\nSMART Vocabulary: related words and phrases\nJams & spreads\napple butter\nconfiture\nconserve\nfilling\ngianduja\ngolden syrup\nhoney\nlekvar\nlemon butter\nlemon curd\nmanuka\nmarmalade\nmembrillo\nnut butter\npaste\nPB&amp;J\npeanut butter\npreserve\nquince paste\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPuddings, desserts & ices\nSubstances & structures in the body\nAnimal physiology: bodily fluids & their production\njellies\n[ plural ] (also jelly shoes) shoes made from coloured transparent plastic, worn especially at the beach: Are jellies comfortable?\nSee more\njelly noun\n(CREATURE)\nUS a jellyfish (= a sea creature with a soft, oval, almost transparent body): Jellies are usually densest in the ocean south of Winyah Bay. With the numbers of jellies booming, more swimmers are getting stung.\nSMART Vocabulary: related words and phrases\nSea creatures\nabalone\namphipod\nanemone\nbarnacle\nbarrier reef\ncowrie\ncrab\ncray\ncrayfish\ncrustacean\nlittleneck clam\nlobster\nmarron\nmollusc\nmussel\nshellfish\nshipworm\nshrimp\nsnow crab\nsoft-shell clam\nSee more results »\nIdioms\nbeat someone to a jelly\nturn to jelly\nAdd to word list\nAdd to word list\na soft, sweet, slightly solid food made by boiling fruit juice with sugar: grape/apple jelly a peanut butter and jelly sandwich\nJelly is also a substance that is almost solid: petroleum jelly"}