{"id":201717,"name":"job","type":"noun","us_sound":"dʒɑːb","us_link":"../audio/j/job.mp3","uk_sound":"dʒɒb","uk_link":"../audio/j/ukjimda016.mp3","content":"job noun\n(EMPLOYMENT)\nAdd to word list\nAdd to word list\nA1 [ C ] the regular work that a person does to earn money: a temporary/permanent job When she left college, she got a job as an editor in a publishing company. It's very difficult trying to bring up two children while doing a full-time job. He's never managed to hold down (= keep) a steady (= permanent) job. She's applied for a job with an insurance company. He gave up his job to become a full-time novelist. After a disastrous first month in office, many people are beginning to wonder if the new president is up to (= able to do) the job. Hundreds of workers could lose their jobs. Synonyms\nappointment (JOB)\nposition (RANK)\npost (JOB)\nsituation old useCompare\nemployment (WORK)\nwork noun (ACTIVITY)\nThesaurus: synonyms, antonyms, and examples\na jobjobShe got a job as a lab assistant.occupationPlease fill in your name, age, and occupation.postThere's a post for a lecturer open in my department. positionShe's applied for a part-time editing position.appointmentThere are going to be several new appointments in the department this year.careerShe's had a very successful career in marketing.\nSee more results »\nout of a job\nC2 without a job: How long have you been out of a job?\nSee more\nMore examplesFewer examplesI've applied for an office job I saw advertised in the paper.How is Mary enjoying her new job?It's a tragedy that so many young people are unable to find jobs.The company plans to shut down four factories and cut 10 000 jobs.Increasing the number of women in top management jobs will be a slow process.\njob noun\n(PIECE OF WORK)\nA2 [ C ] a particular piece of work: The builders are aiming to get the job done by the end of the month. He spent the afternoon doing jobs around the house.UK informal Will you be able to carry all the shopping back home on your bike, or will it have to be a car job (= will you need the car)?\nMore examplesFewer examplesThey were working like crazy to get the job done on time.I've got plenty of jobs to keep you busy.He's really good at tricky painting jobs.I spent the afternoon pottering around the garden doing a few odd jobs.Hey - you did a great job tidying your bedroom. Well done!\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nslave\nslog\nslouch\nspadework\nsubtask\nsweat\nSee more results »\njob noun\n(RESPONSIBILITY)\nB2 [ S ] something that is your responsibility: [ + to infinitive ] She believed her job as a politician was to represent the views of her party and the people who voted for her. I know it's not my job to tell you how to run your life, but I do think you've made a mistake.\nMore examplesFewer examplesIt's my job to keep a check on stock levels.It is the job of the inspectors to enforce compliance with the regulations.I don't envy you the job of cooking for all those people.Whose job was it to bring the tickets?It was my job to make sure there was enough food to go round.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\nbrother\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\npigeon\nportfolio\nsomeone's answer to someone/something idiom\nstick\nSee more results »\njob noun\n(PROBLEM)\n[ S ] informal a problem or an activity that is difficult: [ + -ing verb ] It was a real job getting the wheel off the bike. We were only given an hour for the exam, and I had a job finishing it.\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nteaser\nteething troubles\nthe tip of the iceberg idiom\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »\njob noun\n(EXAMPLE)\n[ C ] informal an example of a particular type: It's an original, not one of those imitation jobs.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\ninstance\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\njob noun\n(CRIME)\n[ C ] slang a crime in which money or goods are stolen, or an action or activity that is dishonest or unpleasant: He was put in prison for five years for doing a bank job.US He really did a job on her, telling her that he would always love her and then moving to Fiji with someone else. See also\nhatchet job informal\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\nkleptomania\npiratical\npiratically\nplunder\npoach\npoaching\nrustle\nsnaffle\nsnarf\nSee more results »\nIdioms\nbe just the job\ndo a good/bad job\ndo the job\ndo/make a good/bad job of something\ngood job!\nit's more than my job's worth\njob done\njobs for the boys\njust the man/woman for the job\non-the-job\njob noun [C]\n(EMPLOYMENT)\nAdd to word list\nAdd to word list\nthe regular work that a person does to earn money: a full-time/part-time/permanent/temporary job to get/quit a job The new supermarket will create 50 new jobs in the area. She’s applied for a job with an insurance company. How long have you been out of a job (= unemployed)? on the job\nIf you do something on the job, you do it while at work: He keeps falling asleep on the job. The company provides on-the-job training (= training while you work).\njob noun [C]\n(PIECE OF WORK)\na particular piece of work: I should have this job done by lunchtime. A microwave oven makes the job of preparing meals a lot easier.\ninfml A job can be work done on or to something to improve or repair it: a paint job\nIf you do a good/bad job, you do a piece of work of that quality: Jamie did a wonderful job on that sales presentation.\njob noun [C]\n(DUTY)\na responsibility or duty: [ + to infinitive ] I know it’s not my job to tell you how to run your life, but I do think you’ve made a mistake.\njob noun [C]\n(CRIME)\nslang a crime in which money or goods are stolen: a bank job an inside job (= a crime committed by someone who works for the company it was committed against)\nAdd to word list\nAdd to word list\nthe regular work that someone does to earn money: a job with sth She applied for a job with an advertising agency. Many people found themselves out of a job as a consequence of the global recession. have/get/take a job apply for/look for/find a jobcreate/cut/shed jobs The government is creating new job opportunities for mothers returning to the workplace. leave/quit/lose a job a paid/unpaid/well-paid job The deputy Chairman has been appointed to the top job. first/new job a full-time/part-time job a permanent/temporary/steady job a Saturday/weekend job\na particular piece of work or task that needs to be done or achieved: the job of doing sth The job of redesigning the offices went to the lowest bidder. The company continues to send many of its accounting and computer jobs to India. Larger firms enjoy economies of scale, which means they can do the job cheaper. Staff are currently paid by the job regardless of the time it takes.\na responsibility that someone or something has: It's not my job to deal with staff's personal problems. The assembly's main job is to draft a constitution.\nIT a task which is done by a computer program: a print job\ndo a good/bad/better, etc. job of sth (also make a good/bad/better, etc. job of sth)\nto do something well, badly, better, etc.: We need to do a better job of marketing the product.\ndon't give up the day job informal humorous\nused for telling someone that they will never be successful with something they are trying to do and should keep doing their real job instead\njobs for the boys UK disapproving\nwork that someone in a position of power gives to friends or relations: Labour sharply criticized the board's appointment of the former trade minister as an example of jobs for the boys.\nit's more than my job's worth UK\nused for telling someone that you cannot do something because you would lose your job if someone discovered you had done it: It's more than my job's worth to let you into the building after hours.\non the job\nwhere someone works and while they do their job: Sixteen coal miners died on the job last year.\nwalk off the job US\nto stop working and refuse to continue doing your job until your employer agrees to what you want: Union members threatened to walk off the job unless their employer agreed to stop hiring work out to contractors. See also\ndead-end job\ndesk job\noff-the-job\non-the-job\nto do work for different people without being employed by them permanently: job about/around/for After drama school, he spent eight years jobbing about from show to show. See also\njobbing adjective Phrasal verb\njob sth out"}