{"id":201758,"name":"jock","type":"noun","us_sound":"dʒɑːk","us_link":"../audio/j/jock.mp3","uk_sound":"dʒɒk","uk_link":"../audio/j/ukjimda023.mp3","content":"jock noun\n(PERSON)\nAdd to word list\nAdd to word list\n[ C ] US often disapproving a man or boy who is enthusiastic about and good at sport: He didn't want to be thought of just as a dumb jock who played football. In high school, either you were a games geek or a sports jock.\nMore examplesFewer examplesThe jocks and cheerleaders mingle together on one side of the school courtyard.He is the school's top basketball jock. He still has the boyish good looks of a high-school jock.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nanchor\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\njock noun\n(UNDERWEAR)\nUS short for\njockstrap : a tight piece of underwear worn by men to support and protect their sexual organs when playing sport: He was sitting in the corner of the locker room wearing only his jock. jocks [ plural ] Australian English\na piece of underwear worn by men and boys that covers the area between the waist and the tops of the legs: He was only wearing a pair of jocks.\nSee more\nSMART Vocabulary: related words and phrases\nUnderwear\nbase layer\nBasque\nbinder\nbloomer\nbodice\nfalsies\nFrench knickers\nG-string\ngirdle\nhipster\nshapewear\nshorts\nsinglet\nskivvy\nslip\nunmentionables\nuplift\nvest\nVPL\nwedgie\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSportswear & swimwear\na man who comes from Scotland. This word is considered offensive by some people.\nAdd to word list\nAdd to word list\na person, esp. a young man, who is extremely enthusiastic about and good at sports: Everyone on campus thought I was just another dumb jock."}