{"id":201892,"name":"join","type":"verb","us_sound":"dʒɔɪn","us_link":"../audio/j/join.mp3","uk_sound":"dʒɔɪn","uk_link":"../audio/j/ukjocul017.mp3","content":"join verb\n(CONNECT)\nAdd to word list\nAdd to word list\nB1 [ T ] to connect or fasten things together: A long suspension bridge joins the two islands. Join the two pieces together using strong glue. The island is joined to the mainland by a road bridge. If you join (up) the dots on the paper, you'll get a picture.\nB1 [ I or T ] If roads or rivers join, they meet at a particular point: The A11 joins the M11 south of Cambridge. The River Murray and the River Darling join east of Adelaide.\nMore examplesFewer examplesThe two pieces of cloth are joined with Velcro.The babies were joined at the head.The two buildings are joined by a covered bridge.The river joins the sea further south.Turn left where the path joins a larger track.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\njoin verb\n(DO TOGETHER)\nA2 [ I or T ] to get involved in an activity or journey with another person or group: I don't have time for a drink now, but I'll join you later. Why don't you ask your sister if she would like to join us for supper? We took the ferry across the Channel and then joined (= got on) the Paris train at Calais. If you're buying tickets, please join the queue (= stand at the end of it). I'm sure everyone will join me in wishing you a very happy retirement (= everyone else will do this too). The police have joined with (= they have begun to work with) the Drug Enforcement Agency in trying to catch major drug traffickers. The design company is planning to join up with a shoe manufacturer and create a new line of footwear.\nMore examplesFewer examplesIf you want tickets you'll have to join the queue.Would you like to join us for dinner tonight?\"Do you want to join me on a ten-mile run?\" \"Not likely !\"\"Come in and join the festivities - what will you have to drink?\"I hope they won't think I'm anti-social if I don't join them in the bar.\nSMART Vocabulary: related words and phrases\nCreating alliances\naffiliate\nalign\nalign against someone/something\nalliance\nally\nally yourself to/with someone\nassociate with someone\nattach\ncling\ncosiness\nforce\ngo\ngo in on something\nhobnob\nintegrate\nnetwork\npair\npair off\npair up\npairing\nSee more results »\njoin verb\n(BECOME A MEMBER)\nA2 [ I or T ] to become a member of an organization: I felt so unfit after Christmas that I decided to join a gym. It's a great club. Why don't you join? join the ranks\nto become one of a particular large group of people: When I leave school at the end of this month, I'll probably have to join the ranks of the unemployed.\nSee more\nMore examplesFewer examplesThey tempted him to join the company by offering him a large salary and a company car.We had to pay a stiff membership fee to join the health club.He joined the air force in 1964 and spent ten years in the service.I've just joined the local golf/squash/tennis club.We were surprised when he announced he wanted to join the clergy .\nSMART Vocabulary: related words and phrases\nOrganizations - joining & leaving\naddition\naffiliation\nanti-assimilation\nassimilation\nassimilationist\nassimilative\nassimilatory\nblackball\ndisenrollment\nenrol\nenrolment\nenter\nentryway\nexit\ninitiation ceremony\njoiner\nnon-joiner\non the books idiom\nonto\nsit\nSee more results »\nIdioms\nbe joined in marriage/matrimony\njoin battle\njoin duty\njoin hands\njoin the club!Phrasal verbs\njoin in (something)\njoin up\na place where two things meet or are fastened together: She'd stitched the two pieces together really carefully so that you couldn't see the join.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\njoin verb [I/T]\n(DO WITH)\nAdd to word list\nAdd to word list\nto do something with or be with someone or something: [ T ] Why don’t you ask your sister if she would like to join us for dinner? [ T ] I’m sure everyone will join me in wishing you a very happy birthday. [ I ] Won’t you join with us in planning the party?\njoin verb [I/T]\n(BECOME A MEMBER)\nto become a member of an organization: [ T ] I’ve decided to join a gym. [ I ] It’s a great club – why don’t you join?\njoin verb [I/T]\n(FASTEN)\nto cause something to be attached or fastened to another thing, or to bring two or more things together in this way; connect: [ T ] A long suspension bridge joins the island with the mainland.\nIf roads or rivers join, they meet at a particular point: [ I ] The Missouri River and Mississippi River join north of St. Louis. join hands\nIf two or more people join hands, they hold each other’s hands, esp. before doing some activity: This folk dance begins with everyone joining hands to form a circle.\nIdiom\njoin the clubPhrasal verbs\njoin in (something)\njoin up\nAdd to word list\nAdd to word list\n[ T ] to connect or fasten two or more things together: join sth to sth Small screws are used to join the front panel to the sides.join sth together The pieces are joined together with glue.\n[ I or T ] to become a member of a club, etc., or to start working for a company or an organization: Have you joined the pension plan? I joined the company immediately after college.\n[ I or T ] to get involved in an activity with another person or group: join sb for sth Will you join us for dinner?join sb in doing sth I'm sure everyone will join me in wishing James a very happy retirement.\n[ I or T ]\n&#160; TRANSPORT to get on a bus, train, or plane: Passengers who joined at Manchester should have their tickets ready for inspection.\njoin the dots\nto connect two things or ideas in order to produce something new, or to show the relationship between different things: We need to join the dots between our current products and the needs of this new market.\njoin forces\nto act with somebody else in order to do something: The two companies have joined forces to make the Web applications available to a wider public.\nPhrasal verbs\njoin in\njoin sth up\njoin up with sb/sth\njoin with sb/sth\na place where two things meet or are connected together: Oil is leaking out at the join between the two pipes."}