{"id":201961,"name":"joke","type":"noun","us_sound":"dʒoʊk","us_link":"../audio/j/joke.mp3","uk_sound":"dʒəʊk","uk_link":"../audio/j/ukjocul025.mp3","content":"joke noun\n(FUNNY)\nAdd to word list\nAdd to word list\nB1 [ C ] something, such as a funny story or trick, that is said or done in order to make people laugh: Did I tell you the joke about the chicken crossing the road? She spent the evening cracking (= telling) jokes and telling funny stories. She tied his shoelaces together for a joke. I hope Rob doesn't tell any of his dirty jokes (= jokes about sex) when my mother's here. He tried to do a comedy routine, but all his jokes fell flat (= no one laughed at them). Don't you get (= understand) the joke?\nMore examplesFewer examplesHe tried to cheer everyone up by telling a joke.That's an old joke - I've heard it about a thousand times.Why does no one ever laugh at my jokes?Do you know any funny jokes?A Christmas cracker usually contains a paper hat, a joke and a novelty.\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\njocose\nlightly\nmordancy\nnon-serious\npawky\nphotobomb\nphotobombing\nrib\nstanding joke\nwag\nwisecrack\nSee more results »\njoke noun\n(BAD/SILLY)\nC1 [ S ] informal a person or thing that is very bad or silly: Our new teacher's a joke - he can't even control the class. The new software is a complete joke - it keeps crashing. The test was a joke (= was very easy) - everyone finished in less than an hour.\nSMART Vocabulary: related words and phrases\nMocking and taunting\ncaricature\nderide\nderision\nderisive\nderisively\nlampoon\nlay yourself open to ridicule idiom\nmake a mockery of something idiom\nmake a monkey out of someone idiom\nmimic\nmimicry\nmock\nmockery\npiss\nridicule\nsardonic\nsardonically\nscoff\nscoffer\ntauntingly\nSee more results »\nIdioms\nbe no joke\nget/go beyond a joke\nthe joke is on someone\nmake a joke of something\ntake a joke\nB1 to say funny things: They joked and laughed as they looked at the photos. It's more serious than you think, so please don't joke about it. [ + speech ] \"I didn't expect to be out so soon\", he joked, after spending nine months in hospital.\nB1 If you think that someone is joking, you think that they do not really mean what they say: I thought he was joking when he said Helen was pregnant, but she really is. She wasn't joking (= she was serious) when she said she was going to move out of the house.\nThesaurus: synonyms, antonyms, and examples\nto tease someoneteaseThe boys teased her mercilessly on the playground.jokeI've lost your passport. Only joking!kidI'm sorry, I forgot to get you a birthday present. Just kidding!pull someone's legIs that really your car or are you pulling my leg?ribHis brothers were ribbing him about his new girlfriend.make fun ofThe other children made fun of him because he wore glasses.\nSee more results »\nMore examplesFewer examplesI thought she was joking but she was deadly serious.Just blow off his comments, he's only joking.The normally dour Mr James was photographed smiling and joking with friends.He jokes about it now, but at the time it was very serious.Don't joke about it! It's not funny.\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\njocose\nlightly\nmordancy\nnon-serious\npawky\nphotobomb\nphotobombing\nrib\nstanding joke\nwag\nwisecrack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot believing\nIdioms\njoking apart/aside\nonly joking!\nyou must be joking\nyou're joking!\njoke noun\n(AMUSING)\nAdd to word list\nAdd to word list\n[ C ] something, such as an amusing story or trick, that is said or done in order to make people laugh: He told a joke about a farmer and a lawyer that made Nicholas burst into laughter.\njoke noun\n(RIDICULOUS)\n[ U ] infml something considered to be so bad or worthless that it is ridiculous: The playing conditions on the muddy field were a joke. The midterm exam was a joke (= too easy).\njoke verb\n(AMUSE)\nto say things in an amusing or playful manner: [ I ] He joked about how I was always cleaning. [ + that clause ] They’ve always joked that the place is so wet, the bullfrogs have to sit on the fences."}