{"id":202167,"name":"journal","type":"noun","us_sound":"ˈdʒɝː.nəl","us_link":"../audio/j/journal.mp3","uk_sound":"ˈdʒɜː.nəl","uk_link":"../audio/j/ukjolli016.mp3","content":"journal noun [C]\n(MAGAZINE)\nAdd to word list\nAdd to word list\nC1 a serious magazine or newspaper that is published regularly about a particular subject: a medical/trade journal\nMore examplesFewer examplesHe became editor of the legendary Irish journal 'The Bell'.He'd lifted whole passages from a journal.The job was being advertised in a steel industry trade journal.He's had several articles published in scholarly journals.The library subscribes to all the major science journals.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncomic\neditorial\nfold\nglossy magazine\nhouse journal\nhouse organ\nlad mag\nmagazine\norgan\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\ntabloid\nSee more results »\njournal noun [C]\n(DIARY)\nC2 a written record of what you have done each day, sometimes including your private thoughts and feelings: She kept a travel journal during her trip to South America. Synonym\ndiary\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\nmake time idiom\npack\nprogramme\nschedule\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nsqueeze someone/something in\nSee more results »\njournal noun [C]\n(MAGAZINE)\nAdd to word list\nAdd to word list\na magazine or newspaper, esp. one that deals with a particular subject: a scientific journal The Wall Street Journal\njournal noun [C]\n(RECORD)\nwriting a record of what you have done, or of descriptions or thoughts, written each day or frequently over a long period; a diary: He kept a journal for over 50 years.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a magazine, newspaper, or website containing news and information about a particular industry or profession: a medical/scientific journal A new online medical journal devoted to neglected tropical diseases was founded last week. a trade/industry/professional journal the Wall Street Journal\nACCOUNTING one of the books in which records of a company's financial activities are recorded, for example, what they buy and sell See also\ntrade journal"}