{"id":202364,"name":"judgment","type":"noun","us_sound":"ˈdʒʌdʒ.mənt","us_link":"../audio/j/eus72651.mp3","uk_sound":"ˈdʒʌdʒ.mənt","uk_link":"../audio/j/ukjoyfu027.mp3","content":"judgment noun\n(DECIDE)\nAdd to word list\nAdd to word list\nC2 [ U ] the ability to form valuable opinions and make good decisions: to show good/sound/poor judgment I don't think you have the right to pass judgment (on others) (= to say whether you think other people are good or bad). I'm going to reserve judgment (on the decision) (= not say whether I think it is good or bad) for the time being.\nB2 [ C ] a decision or opinion about someone or something that you form after thinking carefully: It proved difficult to come to/form/make a judgment about how well the school was performing. Synonyms\nappraisal\nassessment\nestimation (OPINION)\nevaluation\nrating in someone's judgment\naccording to someone's opinion: In my judgment, we should let the solicitor deal with this.\nSee more\nMore examplesFewer examplesTrust your own judgment and don't be guided by what anyone else thinks.I have absolute faith in her judgment.How could you humiliate me by questioning my judgment in front of everyone like that?Are the company's current difficulties a result of bad luck or bad judgment?I reserve judgment on this issue until we have more information.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nperspicacity\nprofundity\nsubtlety\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudgments and analyses\njudgment noun\n(LEGAL)\n[ C or U ] an official legal decision: It is the judgment of this court that you are guilty of murder. We are still waiting for the court to pass/pronounce judgment (= give a decision) on the case.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nIdiom\nagainst your better judgment\njudgment noun [C/U]\n(DECISIONS)\nAdd to word list\nAdd to word list\nthe ability to make decisions or to make good decisions, or the act of developing an opinion, esp. after careful thought: [ U ] to show good/poor judgment [ U ] They questioned his judgment in buying land he had never seen.\nA judgment is a decision: [ C ] We were asked to make a number of difficult judgments.\njudgment noun [C/U]\n(LAW)\na decision in a court of law\nAdd to word list\nAdd to word list\n[ C or U ] a decision that you make, or an opinion that you have, after considering all the facts in a situation: Shareholders should back the company's judgement and take up their rights. Financial analysts make informed judgments about how stock markets are likely to perform.make/form/reach a judgment (about/on sth) We tend to make judgments about people at work based on our first impressions.\n[ U ] the ability to make good decisions or to form sensible opinions about something: Careful judgement will be needed in deciding whether it is trade policy or environmental policy which must be adjusted. Newspaper editors are sometimes guilty of errors in judgement.sound/good/poor judgment Sound judgment is essential because decisions we make directly affect people's health and safety. professional/business judgmentexercise/use your judgment We rely on trustees to exercise their judgment in overseeing financial procedurestrust/doubt/question sb's judgment Junior employees are often reluctant to question the judgment of their bosses. People should not be forced, against their better judgment, into taking out loans they cannot repay.in sb's judgment In my judgement, this is the biggest foreign policy mistake the country has ever made.\n[ C or U ]\n&#160; LAW a final decision made by a judge in a court of law: HM Revenue &amp; Customs is using the recent judgement to argue that UK shareholders in offshore companies should pay income tax.judgment against sb/sth They won a $2.8 million judgment against the insurer for shortchanging them for storm damage to their home. a County Court/Supreme Court judgmenta €500,000/$16.8 million, etc. judgment She won a $450,000 judgment after convincing jurors she was subject to sexual harassment. hand down/issue/uphold a judgment\npass judgment\nto express an opinion, especially a criticism: It's up to our court system, not individual citizens, to pass judgment and punish them.pass judgment on sb/sth The shares were only floated this summer, so it is too early to pass judgement on their performance.\nreserve judgment\nto wait until more information about something is available before expressing an opinion, making a decision, or taking action: People in the industry are reserving judgement until more details of the takeover emerge.reserve judgment on/about sth The three appeal judges reserved judgment on both cases.\nsit in judgment on sb\nto criticize someone, especially when you have no right to do so: Campaigners insist it is the job of politicians to govern, not to sit in moral judgment on people's lifestyles.\nSee also\ndefault judgment\ndeficiency judgment\nsummary judgment\nvalue judgment"}