{"id":202359,"name":"judging","type":"verb","us_sound":"dʒʌdʒ","us_link":"../audio/j/judge.mp3","uk_sound":"dʒʌdʒ","uk_link":"../audio/j/ukjoyfu026.mp3","content":"Add to word list\nAdd to word list\npresent participle of\njudge\nB1 to form, give, or have as an opinion, or to decide about something or someone, especially after thinking carefully: So far, he seems to be handling the job well, but it's really too soon to judge. [ + question word ] It's difficult to judge whether the new system really is an improvement. The meeting was judged (to have been) a success. You shouldn't judge by/on appearances alone. I'm hopeless at judging distance(s) (= guessing how far it is between places).\nC2 to express a bad opinion of someone's behaviour, often because you think you are better than them: You have no right to judge other people because of what they look like or what they believe.\nC1 to officially decide who will be the winner of a competition: I've been asked to judge the children's poetry competition. judging by/from (also to judge by/from)\nB2 used to express the reasons why you have a particular opinion: Judging by what he said, I think it's very unlikely that he'll be able to support your application.\nMore examplesFewer examplesYou shouldn't judge people by their external appearances .Not everyone judges success by the same standards - some people think happiness is more important than money.The competition will be judged by a panel of experts.There are various points to look out for when you're judging dogs in a competition.I can't really be objective when I'm judging my daughter's work.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nDecisions and deciding\nRefereeing & judging in sport\nIdiom\nyou can't judge a book by its cover"}