{"id":202346,"name":"judge","type":"noun","us_sound":"dʒʌdʒ","us_link":"../audio/j/judge.mp3","uk_sound":"dʒʌdʒ","uk_link":"../audio/j/ukjoyfu026.mp3","content":"judge noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nB2 a person who is in charge of a trial in a court and decides how a person who is guilty of a crime should be punished, or who makes decisions on legal matters: a British high-court judge a US Supreme Court judge\nMore examplesFewer examplesThe judge reminded the witness that she was under oath.The judge will pronounce sentence on the defendant this afternoon.In Britain, judges wear white wigs in court.She wrote an article attacking the judges and their conduct of the trial.He shouted abuse at the judge after being sentenced to five years imprisonment.\nSMART Vocabulary: related words and phrases\nJudges & juries\nbench\nchallenge\nchief justice\ncourt of inquiry\ndismiss\nempanel\nfederal bench\njurist\njuror\njury nullification\njury service\njustice\nrecuse\nresentence\nrule\nset something aside\nsheriff\nsum\nsum (something/someone) up\nworship\nSee more results »\njudge noun [C]\n(DECIDE)\nB1 the person who officially decides who is the winner of a competition: a panel of judges\nC2 a person who has the knowledge to give an opinion about something or is able to decide if someone or something is good or bad: She's such a bad judge of character. \"I really don't think you should have another drink.\" \"I'll be/Let me be the judge of that (= I am able to make my own decision about that).\"\nSMART Vocabulary: related words and phrases\nRefereeing & judging in sport\nadjudicate\nadjudication\nadjudicator\nassistant referee\ncall\ncooler\nfair play\nfourth official\njury\nref\nreferee\nregulation time\nscore\nscorekeeper\nscorer\nsending off\nsin-binning\nsplit decision\numpire\nyellow card\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who analyse and judge\nB1 to form, give, or have as an opinion, or to decide about something or someone, especially after thinking carefully: So far, he seems to be handling the job well, but it's really too soon to judge. [ + question word ] It's difficult to judge whether the new system really is an improvement. The meeting was judged (to have been) a success. You shouldn't judge by/on appearances alone. I'm hopeless at judging distance(s) (= guessing how far it is between places).\nC2 to express a bad opinion of someone's behaviour, often because you think you are better than them: You have no right to judge other people because of what they look like or what they believe.\nC1 to officially decide who will be the winner of a competition: I've been asked to judge the children's poetry competition. judging by/from (also to judge by/from)\nB2 used to express the reasons why you have a particular opinion: Judging by what he said, I think it's very unlikely that he'll be able to support your application.\nSee more\nMore examplesFewer examplesYou shouldn't judge people by their external appearances .Not everyone judges success by the same standards - some people think happiness is more important than money.The competition will be judged by a panel of experts.There are various points to look out for when you're judging dogs in a competition.I can't really be objective when I'm judging my daughter's work.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nDecisions and deciding\nRefereeing & judging in sport\nIdiom\nyou can't judge a book by its cover\njudge noun [C]\n(LAW)\nAdd to word list\nAdd to word list\na person who is in charge of a court of law: The judge dismissed the charge after a preliminary hearing.\njudge noun [C]\n(PERSON WHO DECIDES)\na person who is qualified to form or give an opinion about something: a good judge of character\nA judge is also a person who officially decides who has won a competition.\njudge verb [I/T]\n(DECIDE)\nto have or give an opinion, or to decide about something or someone, esp. after thinking carefully: [ I ] He seems to be handling the job well, but it’s really too soon to judge. [ + question word ] It’s hard to judge how old he is. [ T ] I’m hopeless at judging distances (= guessing how far it is between places). [ T ] What gives you the right to judge people (= decide how good or bad they are)?\nTo judge a competition is to decide officially who has won. Judging by/from (also to judge by/from)\nJudging by/from or to judge by/from refers to the reasons you have for thinking something: Judging by their home, they seem to be quite wealthy.\nAdd to word list\nAdd to word list\nLAW a person who is in charge of a court of law and who makes final decisions in legal disagreements: All three judges found him guilty of professional misconduct. a High Court/Supreme Court judge\nsomeone who decides who should win a competition: A panel of judges chose six team projects as winners. See also\nbankruptcy judge\ncircuit judge\ndistrict judge\nfederal judge\n[ I or T ] to decide whether you think someone or something is good, bad, effective, etc.: Long-term investors have experience in judging risk.judging from/by sth Judging by the opinion polls, support for the mainstream right has hardly changed. judge whether/how/what Delegates must try to judge whether countries are meeting their quotas of greenhouse gas reductions.be judged to be/have Crops that are judged to have an overall benefit will be approved for planting.\n[ T ] to decide who should win a competition: The same criteria are used to judge all contestants.\n[ T ]\n&#160; LAW to make a final decision in a legal disagreement: be judged guilty/innocent of sth A disciplinary hearing judged them guilty of \"gross misconduct\".be judged to have done/be sth The company was judged to have broken antitrust laws and now faces a fine. I want the book to be judged on its merits, not on my reputation."}