{"id":202446,"name":"juggling","type":"noun","us_sound":"ˈdʒʌɡ.lɪŋ","us_link":"../audio/j/usjs___014.mp3","uk_sound":"ˈdʒʌɡ.lɪŋ","uk_link":"../audio/j/ukjudic012.mp3","content":"juggling noun [U]\n(ENTERTAINMENT)\nAdd to word list\nAdd to word list\nthe action of juggling objects (= throwing and catching several of them at the same time) in order to entertain people: The Chinese circus includes aerial dance, double trapeze and juggling.\nOliver Rossi/Stone/GettyImages\nMore examplesFewer examplesThere is a circus workshop for those who fancy mastering the art of walking on stilts, riding unicycles or juggling. A recent study found that juggling causes certain areas of the brain to grow, and improves your hand-eye co-ordination.The game lets you take on unusual challenges such as virtual banana juggling.\nSMART Vocabulary: related words and phrases\nMiscellaneous games & activities\nair hockey\nbeer pong\nbelly dancing\nbran tub\nbuildering\nChinese puzzle\njigsaw\njump rope\nkeepy-uppy\nkite\nkorfball\nLARP\nLARPer\norigami\npinball\nsubworld\nsudoku\ntable football\ntabletop\ntailgating\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCarnival, fairground & circus\njuggling noun [U]\n(MANAGING)\nthe activity of trying to manage your life or job when you are involved in several different activities that all demand your time: The point is not just to help women do the \"juggling\" but to acknowledge that caring is a vital contribution to the economy.\nMore examplesFewer examplesShe is responsible for booking study centres, mailing course materials to students and keeping tutors briefed, which requires some juggling.The media reacts to women who give up well-paid jobs to look after children with references to \"juggling\" and \"the myth of having-it-all\".It can get hectic but I'm a very methodical worker and I'm pretty good at juggling.\nSMART Vocabulary: related words and phrases\nCoping and not coping\nbalancing act\nbe left holding the baby idiom\nbear up\nbite\nbite off more than you can chew idiom\ncut\nhand\nhead\nhold\nkeep body and soul together idiom\nkeep the wolf from the door idiom\nkeep your head above water idiom\nkeep/hold your end up idiom\nlive (from) hand to mouth idiom\nmanage\nstretch to something\nstride\nsubsist\nsubsistence\ntake something in your stride idiom\nSee more results »"}