{"id":202438,"name":"juggle","type":"verb","us_sound":"ˈdʒʌɡ.əl","us_link":"../audio/j/juggle.mp3","uk_sound":"ˈdʒʌɡ.əl","uk_link":"../audio/j/ukjudic010.mp3","content":"juggle verb\n(ENTERTAIN)\nAdd to word list\nAdd to word list\n[ I or T ] to throw several objects up into the air, and then catch and throw them up repeatedly so that one or more stays in the air, usually in order to entertain people: We all watched in amazement as he juggled with three flaming torches.\nSMART Vocabulary: related words and phrases\nCarnival, fairground & circus\nacrobatics\naerialist\namusement arcade\namusement park\nbig dipper\nbig top\nclownish\nclownishly\ncoconut shy\ncontortionist\ncustard pie\nDodgem (car)\nhigh wire\nIndian club\njuggler\njuggling\nmerry-go-round\nmidway\ntrapeze artist\nunicycle\nSee more results »\njuggle verb\n(MANAGE)\nC2 [ T ] informal to succeed in arranging your life so that you have time to involve yourself in two or more different activities or groups of people: Many parents find it hard to juggle children and a career.\nSMART Vocabulary: related words and phrases\nCoping and not coping\nbalancing act\nbe left holding the baby idiom\nbear up\nbite\nbite off more than you can chew idiom\ncut\nhand\nhead\nhold\nkeep body and soul together idiom\nkeep the wolf from the door idiom\nkeep your head above water idiom\nkeep/hold your end up idiom\nlive (from) hand to mouth idiom\nmanage\nstretch to something\nstride\nsubsist\nsubsistence\ntake something in your stride idiom\nSee more results »\njuggle verb\n(CHANGE)\n[ T ] informal to change results or information recorded as numbers so that a situation seems to be better than it really is: It won't matter if we juggle the figures - no one will know.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\nmove the goalposts idiom\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »\nAdd to word list\nAdd to word list\nto throw several objects into the air, catch them, and keep them moving so that at least one is always in the air: [ T ] fig. Many women find it hard to juggle a family and a career (= to arrange their lives so that they have time for both).\nAdd to word list\nAdd to word list\nto try to do two or more jobs or activities at the same time, because you do not have a lot of time: Senior executives are under pressure to juggle the increasing demands of their workload.juggle sth and/with sth Flexible working hours help staff juggle work and family life.\nif you juggle data or resources, you use them in a way that will bring you an advantage or that may be dishonest: Analysts think the Treasury may be able to juggle its accounts for the next few months.\nFINANCE to buy and sell shares, bonds, etc. on a regular basis in order to make a lot of money: While individual investors may be able to juggle asset allocation themselves, diversifying into 100 or more different assets usually requires a professional fund manager."}