{"id":202578,"name":"jump","type":"verb","us_sound":"dʒʌmp","us_link":"../audio/j/jump.mp3","uk_sound":"dʒʌmp","uk_link":"../audio/j/ukjudic027.mp3","content":"jump verb\n(IN THE AIR)\nAdd to word list\nAdd to word list\nA2 [ I ] to push yourself suddenly off the ground and into the air using your legs: The children were jumping up and down with excitement. She ran across the grass and jumped into the water. He had to jump out of an upstairs window to escape. Our cat is always jumping up on/onto the furniture.\nThesaurus: synonyms, antonyms, and examples\nto jumpjumpThe kids jumped up and down when they heard we were going to Disneyland.leapThe deer leaped out of the forest.boundHe bounded on stage, punching the air with both fists.launch yourselfShe rocked back and forth on her skis before launching herself down the slope.bounceThe kids were bouncing happily on the trampoline.hopI stubbed my toe and hopped to the kitchen to get some ice.\nSee more results »\nA2 [ I or T ] to push yourself suddenly off the ground in order to go over something: Can you jump over/across this stream? All the horses are finding it difficult to jump the last fence.\nMore examplesFewer examplesThe children have jumped on the couch so much that they've ruined the springs.In desperation, they jumped out of the window to escape the fire.This will be her third try at jumping the bar.My little daughter started jumping up and down with rage when she heard she couldn't go.The rider was thrown as the horse jumped the fence.\nSMART Vocabulary: related words and phrases\nJumping\na hop, skip, and a jump idiom\nbound\ncaper\nclear\nfrisk\nhop\nhurdle\nlaunch\nleap\noutjump\noutleap\npile\npile on/onto (someone)\npounce\nskip\nvault\njump verb\n(MOVE/ACT SUDDENLY)\nB1 [ I usually + adv/prep ] to move or act suddenly or quickly: He suddenly jumped to his feet/jumped up and left. She jumped in/into a taxi and rushed to the station.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nB2 [ I ] If a noise or action causes you to jump, your body makes a sudden sharp movement because of surprise or fear: The loud explosion made everyone jump. I almost jumped out of my skin when I heard a loud crash downstairs.\nMore examplesFewer examplesI jumped out of bed and ran downstairs.He released the handbrake and the car jumped forwards.I tore my sweaty clothes off and jumped into the shower.Whenever anyone criticizes her husband, she immediately jumps to his defence.I enjoyed the movie but I found it quite bitty, jumping from one family's story to another.\nSMART Vocabulary: related words and phrases\nHurrying and doing things quickly\naccelerate\nacceleration\nagainst the clock idiom\nagainst time/the clock idiom\nalacrity\nbash\ndispatch\nget a move on idiom\nget a wiggle on idiom\ngrab-and-go\ngrease\nhacky\nprecipitately\nprompt\npromptly\npromptness\nquickie\nrattle something off\nstroke\ntear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking short, sudden movements\nSurprising and shocking\njump verb\n(INCREASE)\n[ I ] to increase suddenly by a large amount: House prices have jumped dramatically. The cost of building the road has jumped by 70 percent.\nMore examplesFewer examplesThe price of petrol suddenly jumped 5p per litre.Tell the children to be careful because the depth of the water jumps quite unexpectedly.This year my son's height has jumped dramatically - he's taller than his sister now.The price of the shares jumped after the takeover announcement.I wouldn't expect the interest rate to jump again for some time.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\njump verb\n(SEQUENCE)\n[ I usually + adv/prep ] If a story, film, play, etc. jumps, it moves suddenly between different parts of it: The movie is about his adult life, but it keeps jumping (back) to when he was a child. His talk was hard to follow because he kept jumping from one subject to another.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\njump verb\n(AVOID)\n[ T ] to avoid or leave out a point or stage from the correct order in a series: You have to follow the instructions exactly, you can't just jump a few steps ahead.\nSMART Vocabulary: related words and phrases\nAvoiding action\nabrogate\nabrogation\navoid\navoid something like the plague idiom\navoidance\ndoss\neschew\nevade\nevader\nevasion\nfiddle\nfiddle around\nfight shy of idiom\ninsure\nrun for the hills idiom\nshirk\nshort circuit\nshrink from something\nshy away from something\nsteer\nSee more results »\njump verb\n(ATTACK)\n[ T ] informal to attack someone suddenly: They were just walking home when a bunch of guys jumped (on) them.\njump verb\n(MOVE PAST/AWAY)\n[ T ] to go past or away from something illegally or wrongly: The police video showed that she had jumped the (traffic) lights. Several sailors jumped ship (= left their ship without permission) in New York. jump bail\nto fail to appear for a court trial after being released until the trial in exchange for payment: I'd never have thought Hugh would jump bail.\nSee more\nSMART Vocabulary: related words and phrases\nMoving in order to avoid contact\navoid\navoid something like the plague idiom\navoidance\nbypass\ncircumnavigate\nclear\ndodge\nduck and dodge (something) idiom\nduck and weave idiom\nevasively\nevasiveness\nfall\nfall back\nshrug away\nsidestep\nskirt\nsteer\nsteer clear of someone/something idiom\nweave\nSee more results »\njump verb\n(BUSY)\nbe jumping old-fashioned informal\nIf a place is jumping, it is crowded and full of life: This joint (= place of entertainment) is really jumping tonight.\nSee more Idioms\nbe jumping up and down\ngo (and) jump in the lake\njump all over someone\njump down someone's throat\njump for joy\njump in with both feet\njump the gun\njump the queue\njump through hoops\njump to conclusions\nMore idioms\njump to it\njump the shark\nPhrasal verbs\njump at something\njump in\njump on someone\njump out at someone\njump noun [C]\n(MOVEMENT)\nB1 a sudden movement off the ground and into the air: He won with a jump of 8.5 metres. a parachute jump Several horses fell at the last jump (= fence or other thing to be jumped over).\na sudden sharp movement because of surprise or fear: The door slammed and Rita woke up with a jump.\nMore examplesFewer examplesOnly one competitor made a clear jump of the highest fence.She copped out of the parachute jump at the last minute with some feeble excuse.The athlete's third, and winning, jump was an exhibition of skill and strength.He needs a good jump to score more than 9000 pts.I was going to do a parachute jump but I wimped out at the last minute.\nSMART Vocabulary: related words and phrases\nJumping\na hop, skip, and a jump idiom\nbound\ncaper\nclear\nfrisk\nhop\nhurdle\nlaunch\nleap\noutjump\noutleap\npile\npile on/onto (someone)\npounce\nskip\nvault\nYou can also find related words, phrases, and synonyms in the topics:\nDance & choreography\nMaking short, sudden movements\njump noun [C]\n(INCREASE)\na sudden increase: Interest rates are now at 6.75 - that's a jump of almost 2 percent.\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\nexplosive\ngo up\ngrowing\ngrowingly\nheighten\nhot up\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice increases\nIdioms\nfrom the jump\nget a jump on someone/something\nbe/stay/keep one jump ahead\njump verb\n(RAISE UP SUDDENLY)\nAdd to word list\nAdd to word list\n[ I/T ] to push yourself off the ground and into the air using your legs and feet: [ I ] The kids were jumping up and down with excitement. [ I ] The cats jumped up onto the table.\n[ I/T ] To jump sometimes means to lift yourself off the ground in order to go over something: [ T ] Can you jump this fence?\njump verb\n(MOVE QUICKLY)\n[ I ] to move suddenly or quickly: A man jumped out of the bushes. He jumped to his feet and ran out the door.\n[ I ] If a noise or action causes you to jump, your body makes a sudden movement because of surprise or fear: The thunder made us all jump. jumps the light\nIf a car jumps the light, it starts moving past a traffic light while the light is still red.\njump verb\n(OMIT STAGES)\n[ I/T ] to move up or go across suddenly from one point or stage to another without stopping at the stages in between: [ I always + adv/prep ] Her book jumped from fifth place to first place on the best-seller list. [ T ] The forest fire jumped the road and spread to the other side. jump to conclusions\nIf you jump to conclusions, you judge a situation quickly and emotionally without having all the facts: It’s not fair to jump to conclusions about a whole group of people based on one incident.\njump verb\n(INCREASE)\n[ I ] to increase suddenly by a large amount: Home prices in the area have jumped to an all-time high.\njump verb\n(ATTACK)\n[ T ] infml to attack suddenly: He was jumped and robbed by two guys on his way home from work. Idioms\njump all over someone\njump the gun\njump through hoopsPhrasal verb\njump at something\njump noun [C]\n(RAISING UP SUDDENLY)\na push into the air from a surface, like the ground or ice, using your legs and feet: The skater’s jump was high but not graceful.\njump noun [C]\n(OMITTING STAGES)\na move from one point or stage to another without stopping at the stages in between: He made a big jump from general manager to president of the company.\nAdd to word list\nAdd to word list\nif prices, profits, shares, etc. jump, they increase by a large amount in a short period of time: Interest rates look set to jump over the coming months.jump from sth to sth The PMI index jumped from 54.5 to 56.1 in March, its highest level for six years. jump (by) 31%/98 points/€116, etc. The airline's full-year pre-tax profits jumped 56% despite the impact of higher oil prices. Overall music sales have jumped more than 19 percent in the last twelve months.\njump ship informal\nto leave a company or organization in order to work for another, especially in order to get a higher salary or better working conditions: Loyalty bonuses were paid to staff so they wouldn't jump ship.\njump on the bandwagon\nto become involved in an activity that a lot of others are already involved in because it is successful: More and more companies have jumped on the broadband discount bandwagon.\nPhrasal verbs\njump at sth\njump in\njump into sth\njump on\na sudden large increase in the price, value, or amount of something: The tech stocks in the index posted the biggest jumps.a jump in sth Universities and colleges have reported a dramatic jump in the number of applications.a jump of 50%/150 points/€150, etc. Net casino revenues increased by 19% to $41 million, a jump of 138% over the fourth quarter of 2008.a 25%/90 point/20 pence, etc. jump Heavyweight stock helped to drag the FTSE 100 higher with a 27.5p jump to 742p.a jump from sth The increase in home repossessions, showing a 31% jump from last year's figures, is depressing property values. a jump in profits/sales/inflation a big/sharp/significant jump\nget/have a jump on sb/sth US informal\nto have an advantage over other companies or people: Big companies are always looking to get a jump on their rivals."}