{"id":202729,"name":"jurassic","type":"adjective","us_sound":"dʒəˈræs.ɪk","us_link":"../audio/j/eus15634.mp3","uk_sound":"dʒʊəˈræs.ɪk","uk_link":"../audio/j/epd15923.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between around 208 and 146 million years ago, in which the first birds appeared and the single piece of land broke up into separate continents: The allosaurus was a fearsome predator that lived during the Jurassic Period 150 million years ago. New Mexico's Jurassic formations hint of isolated dinosaur populations.\nMore examplesFewer examplesDuring the early and middle Jurassic period, great seas covered much of the present Southwest United States.But it isn't theory that excites the average person, it's the idea of a shiny new time machine gliding into the Jurassic Age.His rock-based observations matched up with data from a computer model on Jurassic paleoclimatic patterns.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Jurassic\nthe period of time between around 208 and 146 million years ago, in which the first birds appeared and the single piece of land broke up into separate continents: Dinosaurs were far better adapted to life in the Jurassic. The brontosaurs had long necks that enabled them to reach the high-growing conifers prevalent in the Jurassic.\nMore examplesFewer examples Intriguingly, there is very little evidence of any widespread glaciation 150 million years ago, during the geological period known as the Jurassic.In addition in the Jurassic there were some truly great coelurosaur types with fearsome talons.It suggests that life in the Jurassic and Cretaceous was more New Age than anyone had imagined.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}