{"id":202757,"name":"jurisdiction","type":"noun","us_sound":"ˌdʒʊr.ɪsˈdɪk.ʃən","us_link":"../audio/j/jurisdiction.mp3","uk_sound":"ˌdʒʊə.rɪsˈdɪk.ʃən","uk_link":"../audio/j/ukjun__015.mp3","content":"Add to word list\nAdd to word list\nthe authority of a court or official organization to make decisions and judgments : The court has no jurisdiction in/over cases of this kind. School admissions are not under/within our jurisdiction.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nRelated word\njurisdictional\nAdd to word list\nAdd to word list\npolitics &amp; government the official authority to make (esp. legal) decisions and judgments: The Supreme Court ruled that the US government had no jurisdiction over crimes committed on Indian lands.\nAdd to word list\nAdd to word list\n[ U ] the authority that a particular court of law or official organization has to make laws, rules, or legal decisions: A law passed in 2006 sought to strip the federal courts of jurisdiction to consider the detainees' plight.the jurisdiction of sth The appellant challenged the jurisdiction of the court.jurisdiction in sth For the rules as to jurisdiction in bankruptcy proceedings, including debtors' petitions, see Chapter 1.jurisdiction to do sth He dismissed the case but retained jurisdiction to resolve any disputes over the settlements.jurisdiction over sth The United States Court of Appeals has exclusive jurisdiction over patent appeals.subject to/under/within the jurisdiction of sb/sth If the claim relates to employment matters it will normally be within the jurisdiction of the industrial tribunal. Cable and satellite channels are outside the jurisdiction of the FCC. exercise/establish/assume jurisdiction expand/extend/limit jurisdictionassert/lack jurisdiction An industrial tribunal claimed that it lacked jurisdiction to hear the appellant's complaint of unfair dismissal.\n[ C ] a country, state, or other area where a particular set of laws or rules must be obeyed: The financial community would like to see conformity of rules and regulations between different jurisdictions. foreign/local/state jurisdictions"}