{"id":202743,"name":"jury","type":"noun","us_sound":"ˈdʒʊr.i","us_link":"../audio/j/jury.mp3","uk_sound":"ˈdʒʊə.ri","uk_link":"../audio/j/ukjetsa014.mp3","content":"Add to word list\nAdd to word list\nB2 a group of people who have been chosen to listen to all the facts in a trial in a law court and to decide if a person is guilty or not guilty, or if a claim has been proved: members of the jury The jury has/have been unable to return a verdict (= reach a decision). Police officers aren't usually allowed to be/sit/serve on a jury.\nC1 a group of people chosen to decide the winner of a competition\nMore examplesFewer examplesThe jury delivered a verdict of not guilty.The members of the jury left the court with a police escort.Not surprisingly, the jury found them both guilty.The decision about whether he is innocent or guilty rests with the jury.He went free because the jury decided there was a reasonable doubt about his guilt.\nSMART Vocabulary: related words and phrases\nJudges & juries\nchallenge\nchief justice\ncourt of inquiry\ndismiss\nempanel\nfederal bench\njudge\njurist\njuror\njury nullification\njury service\njustice\nrecuse\nresentence\nrule\nset something aside\nsheriff\nsum\nsum (something/someone) up\nworship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who analyse and judge\nRefereeing & judging in sport\nIdiom\nthe jury is (still) out\nAdd to word list\nAdd to word list\na group of people who have been chosen to listen to the facts of a trial in a law court and to decide whether a person is guilty or not guilty, or whether a claim has been proved: [ U ] a trial by jury/a jury trial [ C ] My husband served on a jury in a criminal case a few months ago.\nA jury is also a group of people chosen to judge a competition: [ C ] The jury chose an unexpected winner for the literary prize. Idiom\nthe jury is still out\nAdd to word list\nAdd to word list\n( US also jury panel) a group of people who have been chosen to listen to the facts in a court action and decide whether a person is guilty or not guilty or whether a claim has been proved: He was flanked by two prison officers as he awaited the jury's verdict. Last year a California jury awarded $172m to staff who had been forced to work through meal breaks.a jury acquits/convicts/deliberates The jury convicted seven of the men of conspiracy, but acquitted nine others. A series of suspicious phone calls took place between the defendants, a jury heard yesterday.\nthe jury is out (on sth)\nused to say that people have not yet decided whether something is good or bad: The jury is still out on whether she is the right person to revive the company's fortunes. See also\ngrand jury"}