{"id":202796,"name":"just","type":"adverb","us_sound":"dʒʌst","us_link":"../audio/j/just.mp3","uk_sound":"dʒʌst","uk_link":"../audio/j/ukjun__019.mp3","content":"just adverb\n(NOW)\nAdd to word list\nAdd to word list\nA2 now, very soon, or very recently: \"Where are you, Jim?\" \"I'm just coming.\" I'll just finish this, then we can go. He'd just got into the bath when the phone rang. The children arrived at school just as (= at the same moment as) the bell was ringing. The doctor will be with you in just a minute/moment/second (= very soon). It's just after/past (UK also gone) ten o'clock. just now\nA2 a very short time ago: Who was that at the door just now?\nat the present time: John's in the bath just now - can he call you back?\nSee more\nMore examplesFewer examplesI went to that new club that's just opened.We've just bought a new rug for the living room.They've just come back from Amsterdam.Hello there - we were just talking about you.I've just tried ringing him but there was no answer.\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nminute\nmodern-day\nmoment\npresently\nstate\nstill\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\nIn the past\njust adverb\n(EXACTLY)\nB1 exactly or equally: This carpet would be just right for the dining room. The twins look just like each other. Things turned out just as I expected. You've got just as many toys as your brother. Thank you, it's just what I've always wanted. I can't help you just now/yet. Just then, the lights went out. I can just imagine Sophie as a police officer.informal approving That dress is just you (= suits you very well).\nMore examplesFewer examplesLuckily, he had just the right amount of money with him.This paint is just the right colour for my kitchen.He always knows just the right thing to say.It was just the right weather for a marathon.I'm just as upset about it as you are.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\njust adverb\n(ONLY)\nB1 only; simply: \"Would you like another drink?\" \"OK, just one more.\" It was just a joke. His daughter's just a baby/just a few weeks old. We'll just have to (= the only thing we can do is) wait and see what happens. She lives just down the road (= very near). Just because you're older than me doesn't mean you can tell me what to do.\nB1 used to make a statement or order stronger: He just won't do as he's told. It's just too expensive.\nused to reduce the force of a statement and to suggest that it is not very important: Can I just borrow the scissors for a second? I just wanted to ask you if you're free this afternoon.\nMore examplesFewer examplesWe were just chatting about what we did last weekend.We sat in a bar most of the evening just chewing the fat.I'm just chilling out in front of the TV.\"What did you talk about?\" \"Oh, just chit-chat.\"He's just trying to advance his own career.\nSMART Vocabulary: related words and phrases\nMerely and barely\nall\nall of something idiom\nat a pinch idiom\nbarely\nbut\nby a whisker idiom\nby inches idiom\nhardly\nill\nlittle\nmere\nmerely\nmerest\nnarrowly\nnothing\nnothing more than idiom\nonly\nscarce\nscarcely\nwhisker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: very & extreme\njust adverb\n(ALMOST)\nB1 almost not or almost: We arrived at the airport just in time to catch the plane. This dress (only) just fits. \"Can you see the stage?\" \"Yes, only just/just about.\" I've just about finished painting the living room. be just possible\nIf something is just possible, there is a slight chance that it will happen or is true: It's just possible that we might be going away that weekend.\nSee more\nMore examplesFewer examplesIt's just conceivable that the hospital made a mistake.We just managed to put out the fire.They only just arrived in time.I could only just hear what she was saying.There was just enough food for everyone.\nSMART Vocabulary: related words and phrases\nMerely and barely\nall\nall of something idiom\nat a pinch idiom\nbarely\nbut\nby a whisker idiom\nby inches idiom\nhardly\nill\nlittle\nmere\nmerely\nmerest\nnarrowly\nnothing\nnothing more than idiom\nonly\nscarce\nscarcely\nwhisker\nSee more results »\njust adverb\n(VERY)\nB1 very; completely: It's just dreadful what happened to her.\nMore examplesFewer examplesDon't you just adore lying in a hot bath?My wedding day was just the happiest day of my life.I find I just can't communicate with her.Instant coffee just doesn't compare with freshly ground coffee.He had so much pressure on him in his job that eventually he just couldn't cope.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nJustJust is a common adverb in English, especially in speaking. It has different meanings. …\nJust meaning ‘simply’ or ‘absolutely’We can use just meaning ‘simply’ or ‘absolutely’ to add emphasis to a statement: …\nJust meaning ‘exactly’ …\nJust meaning ‘only’[in a clothes shop] …\nJust and expressions of timeJust can mean ‘recently’ or ‘a very short time before or after speaking’: …\nJust for emphasisWe also use just to emphasise an imperative: …\nJust to soften expressionsWe use just in speaking to soften what we say, especially in requests: …\nIdioms\nisn't it/aren't they just?\nit's just one of those things\njust a minute/moment/second\n(it's) just as well (that)\njust like that\njust my luck!\n(I'm) just saying\nmight just as well\nC2 fair; morally correct: The judge's sentence was perfectly just in the circumstances. I don't really think he had just cause to complain.\nSMART Vocabulary: related words and phrases\nJustice and fairness\nall's fair in love and war idiom\nanti-bias\nanti-discrimination\nanti-egalitarian\nanti-nepotism\ndo justice to someone/something idiom\ndue process\nEDI\nEDIB\negalitarian\nfairness\nget your just deserts idiom\nit's a fair cop idiom\njustice\njustness\nsportsmanlike\nsportsmanship\nunbought\nundemocratically\nwithout fear or favour idiom\nSee more results »\nRelated words\njustly\njustnessIdiom\nget your just deserts\nthe just formal\npeople who behave in a morally correct way\nSMART Vocabulary: related words and phrases\nJustice and fairness\nall's fair in love and war idiom\nanti-bias\nanti-discrimination\nanti-egalitarian\nanti-nepotism\ndo justice to someone/something idiom\ndue process\nEDI\nEDIB\negalitarian\nfairness\nget your just deserts idiom\nit's a fair cop idiom\njustice\njustness\nsportsmanlike\nsportsmanship\nunbought\nundemocratically\nwithout fear or favour idiom\nSee more results »\njust adverb [not gradable]\n(NOW)\nAdd to word list\nAdd to word list\nnow or (almost) at the same time, or very soon, or very recently: He just left – if you run, you can catch him. It was just past (= very soon after) midnight. We got the children off to school just as the bus was about to leave. We’re just about to begin (= We will begin very soon). The doctor will see you in just a minute/moment/second (= very soon).\njust adverb [not gradable]\n(EXACTLY)\nexactly: Beth looks just like her mother. [ + question word ] It was just what I expected.\njust adverb [not gradable]\n(ONLY)\nonly; simply: I’ll just check my e-mail, then we can go for coffee. I just called to wish you a happy birthday. We’ll just have to wait and see what happens.\nJust can be used to make a statement stronger: He just won’t listen to me.\njust adverb [not gradable]\n(ALMOST)\nalmost not or almost: We arrived at the airport just in time to catch the plane. Matthew weighed just (= slightly) over seven pounds at birth. \"Are you finished yet?\" \"Just about.\"\njust adverb [not gradable]\n(VERY)\nvery; completely: You look just wonderful! It’s just amazing how powerful the new computers are. Idioms\njust a moment\njust in case\njust now\njust one of those things\nsomeone would just as soon do something\njust adjective\n(FAIR)\nmorally correct; fair: a just verdict"}