{"id":202803,"name":"justice","type":"noun","us_sound":"ˈdʒʌs.tɪs","us_link":"../audio/j/justice.mp3","uk_sound":"ˈdʒʌs.tɪs","uk_link":"../audio/j/ukjun__020.mp3","content":"justice noun\n(FAIRNESS)\nAdd to word list\nAdd to word list\nB2 [ U ] fairness in the way people are dealt with: There's no justice in the world when people can be made to suffer like that. The winner has been disqualified for cheating, so justice has been done (= a fair situation has been achieved). Synonyms\nequity (FAIRNESS) formal\nfairness (FAIR TREATMENT)\nimpartialityOpposite\ninjustice\nMore examplesFewer examplesWhat poetic justice that Collins has to go to court to plead to be allowed to die, just like his innocent victims pleaded to be allowed to live.That photo doesn't really do justice to her good looks.The final score doesn't do justice to our team's performance.She felt that her exam results didn't do her justice.The book presents a vision of a society based on equity and social justice.\nSMART Vocabulary: related words and phrases\nJustice and fairness\nall's fair in love and war idiom\nanti-bias\nanti-discrimination\nanti-egalitarian\nanti-nepotism\ndo justice to someone/something idiom\ndue process\nEDI\nEDIB\negalitarian\nfairness\nget your just deserts idiom\nit's a fair cop idiom\njustness\nkarma\nsportsman\nsportsmanlike\nsportsmanship\nundemocratically\nwithout fear or favour idiom\nSee more results »\njustice noun\n(LAW)\nB2 [ U ] the system of laws in a country that judges and punishes people: the justice system in this country consists of a series of law courts at different levels. The police are doing all they can to bring those responsible for the bombing to justice. They are victims of a miscarriage of justice (= when the law has been carried out wrongly). He has been accused of obstructing the course of justice (= preventing the law being put into action).\nMore examplesFewer examplesThe perpetrators of the massacre must be brought to justice as war criminals.We shall do everything necessary to bring the murderer to justice.The state must ensure the independence and impartiality of the justice system.The defendants are also accused of attempting to pervert the course of justice.Butch Cassidy and the Sundance Kid were fugitives from justice .\nSMART Vocabulary: related words and phrases\nLaw courts\nappellate\nbefore\nbench\nchamber\nchancery\ncircuit court\ncourthouse\ncourtroom\ncriminal court\nCrown Court\ndock\nHigh Court\nindustrial tribunal\njury box\nkangaroo court\nnonjudicial\nthe Inns of Court\ntribunal\nvenue\nwitness box\nSee more results »\njustice noun\n(JUDGE)\n[ C ] US a judge in a law court: The president is expected to name a new Supreme Court justice within the next few days. Justice Ben Overton\n[ C ] UK used before the name of a judge in the High Court: Mr Justice Ellis\nMore examplesFewer examplesLord Justice Wallace is expected to deliver his verdict early next week.The re-trial will be heard before the justices.Justice Woolf is hearing the case in closed session.All but one of the justices agreed that the appeal should be dismissed.The Supreme Court of the United States has nine members - a chief justice and eight associate justices.\nSMART Vocabulary: related words and phrases\nJudges & juries\nbeak\nchallenge\nchief justice\ncourt of inquiry\ndismiss\nempanel\nfederal bench\njudge\njurist\njuror\njury nullification\njury service\nJustice of the Peace\nresentence\nrule\nset something aside\nsheriff\nsum\nsum (something/someone) up\nworship\nSee more results »\nIdioms\ndo justice to someone/something\ndo justice to yourself\njustice noun\n(FAIRNESS)\nAdd to word list\nAdd to word list\n[ U ] the condition of being morally correct or fair: He accused the police of false arrest and demanded justice.\njustice noun\n(LAW)\n[ U ] the system of laws by which people are judged and punished: the criminal justice system\njustice noun\n(JUDGE)\n[ C ] a judge, esp. of one of the higher courts of law: a justice of the US Supreme Court\nAdd to word list\nAdd to word list\n[ U ] the system of laws within a country or state by which people are judged and punished: The decision was welcomed as a great day for the British justice system. Prosecutors alleged that she had obstructed justice by lying to investigators. local/international justicea miscarriage/obstruction of justice Under the new scheme, victims of miscarriages of justice would be entitled to compensation.\n[ U ] the quality of being fair and right: justice for sb We want justice for those who have suffered because of the company's actions. social/racial justice\n[ C ] in the US, a judge in a court of law, especially a higher court: a Supreme Court/Chief Justice\nin the UK, a title used before the name of a judge in the High Court: Mr Justice Cooke"}