{"id":202893,"name":"juvenile","type":"adjective","us_sound":"ˈdʒuː.və.nəl","us_link":"../audio/j/juvenile.mp3","uk_sound":"ˈdʒuː.vən.aɪl","uk_link":"../audio/j/ukjuven001.mp3","content":"Add to word list\nAdd to word list\nC1 law\n&#160; specialized relating to a young person who is not yet old enough to be considered an adult: juvenile crime/offenders He was later taken to juvenile detention for violating the terms of his parole. Compare\nadult adjective\nmedical\n&#160; specialized affecting children rather than adults: The following year, he was diagnosed with juvenile diabetes. juvenile arthritis\nbiology\n&#160; specialized A juvenile animal is young and not fully grown: juvenile salmon juvenile crabs\ndisapproving silly and typical of a child: juvenile behaviour a juvenile sense of humour He was ridiculed in a rather juvenile and at times spiteful way.\nSMART Vocabulary: related words and phrases\nDescribing people who are young\nadolescent\nadolescently\nat your mother's knee idiom\nbe knee-high to a grasshopper idiom\nflower\nfresh-faced\njuvenility\nknee-high\nmother\npre-puberty\nprepubescent\npubescent\ntender\ntweenager\nunderage\nya\nyoof\nyoung\nyoung adult\nyute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nAnimal young\nPhysically and mentally mature & immature\nlaw\n&#160; specialized a person who is not old enough to be considered an adult: He was still a juvenile when the crime was committed. Some of those programs fail in that they transfer juveniles to adult correctional systems Synonym\nminor Compare\nadult noun\nThesaurus: synonyms, antonyms, and examples\na childchildWhen I was a child the summers seemed to go on for ever.boyThere's a new boy in my class. girlThe girl's name is Sally.kidI'm off to pick up the kids from school.kiddieI saw her with a little kiddie in a pushchair.little oneThe little ones must be hungry by now.\nSee more results »\nbiology\n&#160; specialized a young animal that is not yet fully grown: The marsh protects fish eggs and juveniles that need to evade predators until they can mature and move into open water.\nSMART Vocabulary: related words and phrases\nYoung people\nadolescence\nadolescent\nboyhood\ndelinquent\nemo\nephebe\nladdishness\nlarrikin\nmall rat\nminor\nned\nskinhead\nteen\nteenager\nteenybopper\ntween\ntweenager\nyouth\nyouth culture\nyute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal young\nAdd to word list\nAdd to word list\nof, by, or for a young person who is not yet an adult: He studied both adult and juvenile crime."}