{"id":185949,"name":"yank","type":"verb","us_sound":"jæŋk","us_link":"../audio/y/yank.mp3","uk_sound":"jæŋk","uk_link":"../audio/y/ukxray_020.mp3","content":"Add to word list\nAdd to word list\n[ T usually + adv/prep ] informal to pull something forcefully with a quick movement: He tripped over the cord and yanked the plug out. She yanked open the cupboard door and everything fell out.\nThesaurus: synonyms, antonyms, and examples\nto pull somethingpullPull your chair over here so you can see the screen. dragShe dragged the canoe down to the water.haulThey hauled the boat out of the water.towYou shouldn't drive fast when your car is towing a trailer.yankShe marched to the door and yanked it open.wrenchThe phone had been wrenched from the wall.\nSee more results »\n[ T often passive ] mainly US informal to suddenly remove someone or something: I was yanked out of school and forced to go to work.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntrail\ntwitch\nwrest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and extracting\na quick forceful pull of something: Give the door a yank and it should open. A single yank of the lever opened the trapdoors.\nMore examplesFewer examplesGive the chain a good yank.As he gave the door a good yank, he lost his balance and fell flat on his back.\nSMART Vocabulary: related words and phrases\nPulling\ndraft\ndrag\ndraught\ndraw something up\nhaul\nheave\nheave-ho\nheft\nhitch something up\npluck\nreel\nreel something in/out\nretract\nretractable\nsuck\ntow\ntow-away\ntrail\ntwitch\nwrest\nSee more results »\na person from the US: disapproving The place was full of Yanks.\nAdd to word list\nAdd to word list\nto pull something forcefully with a quick movement: They yanked open the screen door to run into the kitchen for cookies. yank noun [ C ] us\nYour browser doesn't support HTML5 audio\n/jæŋk/\nShe gave a yank to the reins and the horse stopped."}