{"id":186016,"name":"yard","type":"noun","us_sound":"jɑːrd","us_link":"../audio/y/yard.mp3","uk_sound":"jɑːd","uk_link":"../audio/y/ukxray_024.mp3","content":"yard noun [C]\n(UNIT OF MEASUREMENT)\nAdd to word list\nAdd to word list\nB1 (written abbreviation yd) a unit of measurement equal to three feet or approximately 91.4 centimetres\nExamples\nHis angled shot beat the goalkeeper from 20 yards.His horse collapsed just 40 yards from the winning post.A cricket pitch is 22 yards long.A yard is equal to 3 feet.The garden of their new house is 30 yards in length.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nfooter\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nSee more results »\nyard noun [C]\n(WORK AREA)\nan area of land in which a particular type of work is done, often one from which goods are sold: a lumber yard a scrap yard See also\nboatyard\ndockyard\njunkyard mainly US\nlumberyard US\nshipyard\nstockyard\nMore examplesFewer examplesSince they set up a builder's yard next door, our house has depreciated in value.The state of the economy has led to many small businesses ending up in the knacker's yard.I bought a cheap, replacement headlight from the scrap yard.A lot of heavy lorries use this road on the way to the builder's yard.There's a recycling point for old fridges at the scrap yard.\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncompound\ncourt\ncourtyard\nfarmyard\nforecourt\nformal\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nSee more results »\nyard noun [C]\n(LAND NEXT TO BUILDING)\nan area of land next to a building that usually has a hard surface and that is used for a special purpose : The house has a small yard at the back. The children played in the school yard. a prison yard See also\nbackyard\nbarnyard US\nfarmyard\nMore examplesFewer examplesHe was chopping wood in the yard.From the window we could see the children playing in the yard.The prisoners were exercising in the yard.When the bell rang, the schoolchildren ran out into the yard.He hung the washing out to dry in the yard.\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncompound\ncourt\ncourtyard\nfarmyard\nforecourt\nformal\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nSee more results »\nyard noun [C]\n(GARDEN)\nA2 US (UK garden) a piece of land next to a house, usually used for growing flowers, grass, and other plants: The kids were playing in the yard.\nMOCCABUNNY/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncompound\ncourt\ncourtyard\nfarmyard\nforecourt\nformal\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nSee more results »\nyard noun [C]\n(MEASUREMENT)\nAdd to word list\nAdd to word list\n(abbreviation yd.) a unit of measurement of length equal to 3 feet or approximately 0.914 meter\nyard noun [C]\n(LAND AROUND HOUSE)\na piece of land surrounding a house, usually grassy land with trees and other plants: The kids are playing in the yard out back.\nyard noun [C]\n(LAND NEXT TO BUILDING)\nan area of ground next to a building that is used for a particular, usually business, purpose: a boat yard a lumber yard\nAdd to word list\nAdd to word list\nMEASURES a unit of measurement equal to 3 feet or 91.4 centimetres\nan area of land next to buildings used for a particular purpose such as building, storing, or selling goods: a builders' yard See also\ndockyard\nsalvage yard\nshipyard\nstockyard"}