{"id":186174,"name":"yawn","type":"verb","us_sound":"jɑːn","us_link":"../audio/y/eus75052.mp3","uk_sound":"jɔːn","uk_link":"../audio/y/ukxray_030.mp3","content":"Add to word list\nAdd to word list\nB1 to open the mouth wide and take a lot of air into the lungs and slowly send it out, usually when tired or bored: I can't stop yawning - I must be tired.\nMore examplesFewer examplesHe yawned loudly in the middle of her speech.I was so tired, I couldn't help yawning.\nSMART Vocabulary: related words and phrases\nNoises made by the body\nbelch\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\ncough\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnorer\nsnoring\nsnort\nwheeze\nwind\nSee more results »\n[ C ] an act of yawning: stifle a yawn Her eyes watered as she tried to stifle (= stop) a yawn.\nWilhelmina Cornelia Van Der Zwan/EyeEm/GettyImages a yawn [ S ] informal\nsomething or someone that is very boring: The film was a total yawn. The whole conference was a bit of a yawn. A two-hour meeting - what a yawn! Frankly, most of these shows are a yawn. So far, the contest has been a total yawn. His latest album is, sadly, a yawn that lacks the verve of his debut.\nThesaurus: synonyms, antonyms, and examples\na person or thing that is not exciting or interestingboreHe just goes on and on - what a bore.crashing boreTheir candidate is a crashing bore and won't garner any attention.snoozeThe stories in the magazine are all a snooze, but the photos are fab.snoozefestThe game was a total snoozefest.a yawnEven though it's a classic, I thought the book was a bit of a yawn.a wet weekendUK You're about as fun as a wet weekend.\nSee more results »\nSMART Vocabulary: related words and phrases\nNoises made by the body\nbelch\nborborygmus\nbreak\nbreak wind idiom\nbruit\nburp\nclear\ncough\nfootfall\nfootstep\ngrumble\npass wind idiom\nsneeze\nsneezy\nsnorer\nsnoring\nsnort\nwheeze\nwind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who are boring and old-fashioned\nBoredom, tedium and boring things\nAdd to word list\nAdd to word list\nto open the mouth wide and take in and let out a deep breath without conscious effort, usually when you are tired or bored: She yawned, covering her mouth with her hand. yawn noun [ C ] us\nYour browser doesn't support HTML5 audio\n/jɔn/\nIt had been an especially long day, she thought, barely stifling a yawn."}