{"id":186989,"name":"yeah","type":"adverb","us_sound":"jeə","us_link":"../audio/y/yeah.mp3","uk_sound":"jeə","uk_link":"../audio/y/ukyd___004.mp3","content":"Add to word list\nAdd to word list\nA2 yes: \"Do you like your job?\" \"Yeah, it's all right I suppose.\" \"Will you drive?\" \"Yeah, sure.\"\nMore examplesFewer examples\"Did you enjoy the film?\" \"Yeah, it was great.\"\"Have you seen Andrew?\" \"Yeah, he was on his way to the library.\"As a child she was told to say \"yes\" not \"yeah\".\"The cheque's in the post.\" \"Yeah, yeah!\"Yeah, looking back now, I wish I'd done things differently.\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nno way idiom\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nSee more results »\nGrammar\nTagsTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: usesTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: formTags consist of one of the auxiliary verbs be, do or have, or the main verb be, or a modal verb, plus a subject, which is most commonly a pronoun: …\nQuestion tagsQuestion tags turn statements into yes-no questions. There are two types. …\nImperative tagsA tag after an imperative clause softens the imperative a little. The tag verb is most commonly will but we can also use would, could, can and won’t: …\nStatement tagsWe can use a statement tag to emphasise or reinforce an affirmative statement. The tag is also affirmative. They typically invite the listener to agree or sympathise in some way, or to offer a parallel comment. Statement tags are very informal: …\nUniversal tags: right, yeahWe can use right and yeah in very informal situations instead of question tags: …\nIdiom\nyeah, right!\nAdd to word list\nAdd to word list\n(spelled the way it is often spoken) yes: \"Will you drive?\" \"Yeah, sure.\""}