{"id":186999,"name":"year","type":"noun","us_sound":"jɪr","us_link":"../audio/y/year.mp3","uk_sound":"jɪər","uk_link":"../audio/y/ukyd___005.mp3","content":"Add to word list\nAdd to word list\nA1 [ C ] a period of twelve months, especially from 1 January to 31 December: Annette worked in Italy for two years. 2005 was one of the worst years of my life. We went to Egypt on holiday last year. At this time of year the beaches are almost deserted. This species keeps its leaves all year (round) (= through the year).\n[ C ] a period of twelve months relating to a particular activity: The financial/tax year begins in April.\nA2 [ C ] the part of the year, in a school or university, during which courses are taught: the academic/school yearUK She's now in her final/first/second year at Manchester University.US My daughter is in her freshman/sophomore/junior/senior year.\n[ C, + sing/pl verb ] UK (US class) a group of students who start school, college, university, or a course together: Kathy was in the year above me at college.\nMore examplesFewer examplesWe look forward to greater success in the coming year.I'm still in contact with her - we write a couple of times a year.I'm contemplating going abroad for a year.We have put some money on one side for next year's summer holiday.He served four years in prison for robbery.\nSMART Vocabulary: related words and phrases\nSpecific periods of time\nall day\nAnthropocene\naround-the-clock\nBritish Summer Time\nBST\nCambrian\nCretaceous\nhour\nhour-long\nhr\nJurassic\nlunar month\nnightlong\nOligocene\nOrdovician\nPalaeocene\nPalaeogene\nPrecambrian\nwk\nyear-long\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nYears & yearly\nSchools in general\nStudents & pupils\nIdioms\nfor a man/woman/person of his/her years\nfor years\nfrom/since the year dot\nin/through all the years\nof the year\nput years on someone\ntake years off someone\nyear in, year out\nused to refer to a student in a particular year group at a school, college, or university: I like teaching the first-years, but the second-years can be difficult. a first-year student\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\npupil\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nSee more results »\nAdd to word list\nAdd to word list\nany period of twelve months, or a particular period of twelve months beginning with January 1: last/next year She brought along her eight-year-old daughter. My parents have been married for 30 years. Richard earned his degree in the year 1995. You can get cheaper fares now, so it’s a good time of year to travel abroad.\nIn a school, a year refers to the part of the year during which courses are taught: September is the start of the new academic year. Idioms\nin years\nyear in and year out\nAdd to word list\nAdd to word list\n(also calendar year) a period of 365 or 366 days, starting on January 1st and ending on December 31st: The project took five years to complete. last/next/this year the following/previous year\na period of twelve months relating to a particular activity: He earns $68,000 a year.\nyears\na long time: It's taken years to get funding for the project. He's been doing the same job for years.\nof the year\na thing or person of the year is one that has been chosen as the best in a particular area or activity for that year: She won the Business Woman of the Year award in 2010.\nyear after year\nevery year for a long period: The fund produces terrific results year after year.\nyear by year\nif something increases, develops, etc. year by year, it happens each year over a period of time: Savers should monitor their funds year by year. Credit card fraud is still increasing on a year-by-year basis.\nyear in, year out\nif something happens year in, year out, it has been happening for a while and is expected to continue in the same way: Investors should choose a fund that does consistently well year in, year out. See also\namount falling due after one year\namount falling due within one year\nbeginning of year\nend-of-year\nfinancial year\nfiscal year\ntax year\nyear-ago\nyear end\nyear-on-year\nView all\nyear-over-year\nyear to date"}