{"id":187211,"name":"yes","type":"adverb","us_sound":"jes","us_link":"../audio/y/yes.mp3","uk_sound":"jes","uk_link":"../audio/y/ukyd___024.mp3","content":"Add to word list\nAdd to word list\nA1 used to express willingness or agreement: \"Would you like a glass of wine?\" \"Yes, thanks.\" \"Do you like Thai food?\" \"Yes, I love it.\" \"He's a really nice guy.\" \"Yes, he is.\" \"Report to me at nine o'clock tomorrow morning.\" \"Yes, sir.\" \"Have you had enough to eat?\" \"Yes, thank you.\"say yes If you'd say yes (= agree) to the request you'd avoid a lot of trouble.\nThesaurus: synonyms, antonyms, and examples\nto accept something that is offeredacceptThey were charged with accepting illegal contributions. takeShe offered him the job and he took it.say yes (to)I asked him to marry me and he said yes.take someone up onThank you – I’d like to take you up on your offer.\nSee more results »\nyes, sir\nUS used for emphasis: We visited all 50 states - yes sir, all 50.\nSee more\nA1 used to show that you are listening to someone, or that you are ready to listen and to give them an answer or information: \"Dad.\" \"Yes, what do you want, honey?\" Yes, can I help you?\nA2 used when you are disagreeing with a negative statement: \"I'm not a very good cook, though.\" \"Yes, you are - you make wonderful food!\" yes?\nused at the end of a sentence to invite someone to agree with you or to check that you have understood something correctly: It's better this way. Yes? You are going to help me, yes?\nMore examplesFewer examples\"Did the kids enjoy their trip to the zoo?\" \"Oh, yes, they were full of it when they got back this afternoon.\"Oh yes, now I know who you mean.I asked him if he wanted to come to dinner with my parents, and surprise, surprise, he said yes!\"Did I hear you say your children cleared up after the party?\" \"Oh yes, I've got them well-trained!\"Sorry, I can't today. Now if you'd asked me yesterday, I would have said yes.\nSMART Vocabulary: related words and phrases\nWords & phrases expressing agreement & acceptance\naccha\nachha\namen\namen to that idiom\nas you wish/like idiom\nbeggar\ncouldn't agree more/less idiom\nfair\nhear\nI know idiom\nmind\nquite\nshould\nsize\nvery\nwilco\nwill do idiom\nyou can say that again! idiom\nyou can't say fairer than that idiom\nyou do you idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nLinguistics: question words & expressions\nGrammar\nYesYes is the opposite of no. We usually use yes to show that we agree with something, accept something or are willing to do something: …\nIdioms\noh yes\nyes and no\na vote supporting a particular plan of action or a reply accepting an invitation: \"Have you had any replies yet?\" \"Six yeses and two noes so far.\" Opposite\nno\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nno way idiom\nnot that idiom\nopposed\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyou bet idiom\nSee more results »\nGrammar\nYesYes is the opposite of no. We usually use yes to show that we agree with something, accept something or are willing to do something: …\nAdd to word list\nAdd to word list\nused to express approval, willingness, or agreement: \"Would you like a glass of water?\" \"Yes, please.\" \"Is Chambers Street in this direction?\" \"Yes, just keep going and you’ll come to it.\" If you would say yes (= agree), you’d save us all a lot of trouble.\nYes can be used to show that you are ready to listen to someone or to answer someone’s request for information: \"Daddy.\" \"Yes, what do you want, honey?\" yes noun [ C ] us\nYour browser doesn't support HTML5 audio\n/jes/\nThe answer is yes. Idiom\nyes, sir"}