{"id":187245,"name":"yet","type":"adverb","us_sound":"jet","us_link":"../audio/y/yet.mp3","uk_sound":"jet","uk_link":"../audio/y/ukyd___027.mp3","content":"yet adverb\n(UNTIL NOW)\nAdd to word list\nAdd to word list\nA2 still; until the present time: I haven't spoken to her yet. He hasn't finished yet. \"Are you ready?\" \"Not yet - wait a minute.\" the best, worst, etc. yet\nB2 the best, worst, etc. until now: Of all the songs I've heard tonight, that's the best yet.\nSee more as yet C1 formal\nuntil and including this time: We haven't needed extra staff as yet, but we may in the future.\nSee more\nMore examplesFewer examplesWait for it! I haven't said 'go' yet.We haven't discussed the matter in detail yet.Has he found himself a place to live yet?The details of the contract have not yet been settled.His new novel is advertised as his steamiest yet.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\nday\nfar\nhitherto\nin\ninside\ninterim\nmeanwhile\nnow\npending\nthus\ntill\ntime\nto\nto date idiom\nuntil\nup to (doing) something idiom\nwait till/until ... idiom\nSee more results »\nyet adverb\n(IN THE FUTURE)\nC1 from now and for a particular period of time in the future: She won't be back for a long time yet. Our holiday isn't for weeks yet. have yet to\nC2 If you have yet to do something, you have not done it: They have yet to make a decision.\nSee more\nMore examplesFewer examplesThe issue of funding has yet to be addressed.The new daytime soap opera has yet to show signs that it's clicking with the television audience.Don't panic, there's bags of time yet.He won't be home for ages yet ... Oh, I spoke too soon - here he is now!The full details have yet to be confirmed.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuture\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nSee more results »\nyet adverb\n(EVEN NOW)\nC2 even at this stage or time: We could yet succeed - you never know.might yet You might yet prove me wrong.may yet He may win yet.\nMore examplesFewer examplesWe might yet be able to book a holiday.I may yet get rich.It could yet turn out to be an important discovery.It may yet turn out to have been the correct decision.He could yet choose to abandon the project.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nyet adverb\n(MORE)\nB2 used to add emphasis to words such as another and again, especially to show an increase in amount or the number of times something happens: yet another Rachel bought yet another pair of shoes to add to her collection.yet again I'm sorry to bother you yet again.yet more He's given us yet more work to do.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nGrammar\nAlready, still or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready, yet or still?We use still not yet or already to refer to the continuation of a situation: …\nNegatives with already, still, yetNegatives with yet mean that something has not happened up to now: …\nYetYet is an adverb or conjunction. …\nYet as an adverbWe use yet as an adverb to refer to a time which starts in the past and continues up to the present. We use it mostly in negative statements or questions in the present perfect. It usually comes in end position: …\nYet as a conjunctionYet as a conjunction means ‘but’ or ‘nevertheless’. We use it to show contrast. It often occurs after and: …\nYet for emphasisWe use yet for emphasis, with a meaning similar to ‘even’, especially before more, another and again: …\nAs yetAs yet means ‘up to now, but the situation will definitely change’. We only use it in negative contexts: …\nHave yet to and be yet toWe use have yet to and be yet to in more formal contexts. We use them to refer to events which are necessary or which must happen at some time, but which have not happened at the time of speaking: …\nB1 (and) despite that; used to add something that seems surprising because of what you have just said: simple yet effective(and) yet He's overweight and bald, (and) yet somehow, he's attractive.\nMore examplesFewer examplesYou say that you're good friends and yet you don't trust him. Isn't that a bit of a contradiction?The government is being accused of (having) double standards in the way it is so tough on law and order yet allows its own MPs to escape prosecution for fraud.He claims that he is completely committed to the project and yet this is manifestly untrue.He's had the benefit of an expensive education and yet he continues to work as a waiter.You see, to my untutored eye that just looks like a load of random brush strokes and yet it's a very valuable painting.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nGrammar\nAlready, still or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready, yet or still?We use still not yet or already to refer to the continuation of a situation: …\nNegatives with already, still, yetNegatives with yet mean that something has not happened up to now: …\nYetYet is an adverb or conjunction. …\nYet as an adverbWe use yet as an adverb to refer to a time which starts in the past and continues up to the present. We use it mostly in negative statements or questions in the present perfect. It usually comes in end position: …\nYet as a conjunctionYet as a conjunction means ‘but’ or ‘nevertheless’. We use it to show contrast. It often occurs after and: …\nYet for emphasisWe use yet for emphasis, with a meaning similar to ‘even’, especially before more, another and again: …\nAs yetAs yet means ‘up to now, but the situation will definitely change’. We only use it in negative contexts: …\nHave yet to and be yet toWe use have yet to and be yet to in more formal contexts. We use them to refer to events which are necessary or which must happen at some time, but which have not happened at the time of speaking: …\nyet adverb [not gradable]\n(NOW/THEN)\nAdd to word list\nAdd to word list\n(used in negative statements and questions) at this time or at that time; now or then: \"Is dinner ready?\" \"Not yet.\" Has Janet finished her homework yet? He had not yet decided what to do.\nyet adverb [not gradable]\n(IN THE FUTURE)\nin the future; still: The best was yet to come.\nyet adverb [not gradable]\n(IN ADDITION)\n(used esp. when describing a long process or an event in a series) in addition; once more: The governor commissioned yet another study. She didn’t want to explain yet again why she was disappointed.\nyet adverb [not gradable]\n(EVEN NOW)\neven at this stage or time: We may yet succeed – you never know.\nyet conjunction, adverb [not gradable]\n(DESPITE THAT)\ndespite that: Melissa was not doing well in her physics course, yet overall she had a B average."}