{"id":187425,"name":"yield","type":"verb","us_sound":"jiːld","us_link":"../audio/y/yield.mp3","uk_sound":"jiːld","uk_link":"../audio/y/ukyield001.mp3","content":"yield verb\n(PRODUCE)\nAdd to word list\nAdd to word list\nC2 [ T ] to supply or produce something positive such as a profit, an amount of food or information: an attempt to yield increased profits The investigation yielded some unexpected results. Favourable weather yielded a good crop.\nMore examplesFewer examplesThe process yields oil for industrial use.Burning waste yields energy that can be used for electric power or heating.The excavation yielded some superb artifacts.Early radio equipment yielded poor sound quality.The experiments yielded some surprising results.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nmint\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nSee more results »\nyield verb\n(GIVE UP)\n[ I or T ] to give up the control of or responsibility for something, often because you have been forced to: They were forced to yield (up) their land to the occupying forces. Despite renewed pressure to give up the occupied territory, they will not yield.\nMore examplesFewer examplesThey refused to yield power.They had to yield control of the river area.\nSMART Vocabulary: related words and phrases\nStop having or doing something\nabdicate\nabdication\nbail out\nbandh\nbomb out\nbreak with something\nforfeit\nforfeitable\nforgo\nforsake\nforswear\nghost\ngive up the ghost idiom\nlay\nrelinquishment\nself-denying\nself-denyingly\nself-sacrifice\nself-sacrificing\nthrow\nSee more results »\nyield verb\n(BEND/BREAK)\n[ I ] formal to bend or break under pressure: His legs began to yield under the sheer weight of his body.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\nsuppleness\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nyield verb\n(STOP)\n[ I ] US (UK give way) to stop in order to allow other vehicles to go past, especially before you drive onto a bigger road: If you're going downhill, you need to yield to bikers going uphill.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nPhrasal verb\nyield to something\nan amount of something positive, such as food or profit, that is produced or supplied: Crop yields have risen steadily. Yields on gas and electricity shares are consistently high. Synonym\nproceeds\nMore examplesFewer examplesThis year's yield was very large.Scientists have greatly increased the yield of crops such as wheat, rice and corn.Farmers add fertilizer to increase the yield.The fertile soil enabled farmers to produce abundant yields.Plant breeding has increased yields and has improved the nutritional value of several crops.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nyield verb\n(PRODUCE)\nAdd to word list\nAdd to word list\n[ T ] to supply or produce something positive such as a profit, an amount of food, or information: Some mutual funds are currently yielding 15% on new money invested.\n[ T ] If something yields information, it provides it: A letter found by the FBI last week may yield new clues.\nyield verb\n(GIVE UP)\n[ I/T ] to give up the control of or responsibility for something, often because you have been forced to: [ T ] to yield power\n[ I/T ] If you yield to something, you accept that you have been defeated by it: [ I ] It’s easy to yield to the temptation to borrow a lot of money.\n[ I/T ] To yield to traffic coming from another direction is to wait and allow it to go first.\nyield noun [C usually pl]\n(PRODUCE)\na profit or an amount esp. of a crop produced: Over the past 50 years, crop yields have risen steadily in the US.\nAdd to word list\nAdd to word list\nFINANCE the total amount of profit or income produced from a business or investment: The bond's yield fell to 6.09%.high/low yield These securities are speculative and may involve greater risks and have higher yields.an increase/reduction in yield The payout on a 25-year policy is reduced to £100,271, which represents a reduction in yield from 13.3% to 13%. a 30-day/30-year yield\nPRODUCTION the total amount of a crop, product, etc. that is produced or supplied: Over a 15-year period, the average yield of dairy cows in the UK had increased by 34%. These salts continuously bombard agricultural soils, stressing plants and reducing crop yields.\nMONEY the average amount of money that an airline receives from each passenger for each mile they travel or that a hotel receives from each guest for each night they stay: Yield management is not really new to hoteliers, since identical rooms have been sold for higher prices during high season and for lower prices during low season for generations. See also\nbond yield\ncurrent yield\ndividend yield\nearnings yield\neffective yield\nequity yield\ngilt yields\ngross yield\nhigh-yield\ninitial yield\nmaturity yield\nnet yield\nnominal yield\nredemption yield\nrunning yield\ntrue yield\nFINANCE to supply or produce a profit, income, etc.: The stake, analysts say, could yield $700m a year in revenue. British shares currently yield 3.3%.yield profit/returns Even the most unglamorous sectors of the market can yield big returns.\nPRODUCTION to supply or produce a crop, product, etc.: Oil fields and reserves are yielding more oil than had been thought possible, because of technological advances.\nto supply or produce information, results, etc.: yield benefits/information/results Subsequent product tests yielded better results. His emails to company executives yielded no response."}