{"id":187452,"name":"yip","type":"noun","us_sound":"jɪp","us_link":"../audio/y/cdo0318usyip5674.mp3","uk_sound":"jɪp","uk_link":"../audio/y/cdo0318ukyip1613.mp3","content":"yip noun\n(SOUND)\nAdd to word list\nAdd to word list\n[ C ] a short, sharp cry: Prairie dog chatter is described by observers as a series of yips, or high-pitched barks.\nMore examplesFewer examplesFor almost 40 years, he has been hearing and recording the sounds of nature, quiet moments interrupted only by grunts of sea lions, yips of coyotes and rumbling of glaciers. It sounded like a food fight in a dolphinarium - full of yips and yodels and wild splashing.He gave a yip of dismay.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nbray\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\ngive someone a shout idiom\nholler\nhowl\nraise\nshout\nshouty\nshriek\nsquawk\nthe hairdryer treatment\nthunder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal (non-human) sounds\nyip noun\n(NERVOUSNESS)\nthe yips [ plural ]\nin sports, especially golf, a condition when a player is not able to hit, throw, or kick the ball well, usually because of nervousness: He gave up competitive golf after developing a serious case of the yips on his putting.\na state of nervousness: \"People have the yips about a conservative owning a newspaper in a liberal town,\" she said.\nMore examplesFewer examplesYou see quite a few guys get the yips, not only in the golf swing but a ton of guys with putting and chipping.In the latest study researchers recruited 25 golfers, who complained of the yips and studied them making dozens of putts of varying lengths, measuring the electrical activity in their muscles.The conscious mind is often a drag on many activities. Too much thinking can give a golfer the yips. When they had forged nine points ahead of Liverpool after 29 games, it looked all over. But then Leeds started to get the yips and Liverpool steadily closed the gap.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nball game\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nAnxiety and worry - general words\nIf an animal such as a dog yips, it makes a short, sharp cry: The dogs yipped at each other from their crates in the back of the van. A pack of coyotes is heard yipping at night.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbleat\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »"}