{"id":197990,"name":"yorkist","type":"noun","us_sound":"ˈjɔːr.kɪst","us_link":"../audio/y/cdo0623usyork4772.mp3","uk_sound":"ˈjɔː.kɪst","uk_link":"../audio/y/cdo0623ukyork4804.mp3","content":"Add to word list\nAdd to word list\nsomeone who was on the side of the House of York during the English Wars of the Roses (1455–1487), fought between the Houses of Lancaster and York: Henry VII married Elizabeth of York to heal the rift between the Yorkists and Lancastrians. Richard Duke of York was hailed by Yorkists as a legitimate pretender to the English throne. Compare\nLancastrian\nMore examplesFewer examplesJames Tyrell had committed himself to the Yorkists by 1471, when he was knighted at Tewkesbury.By 1458 the flames of war were being fanned across England between the Yorkists on the one side, and the Lancastrians on the other.Four thousand Yorkists turned away from the city of Canterbury after being denied entry by the mayor.\nSMART Vocabulary: related words and phrases\nMiddle Ages (medieval Period) 501-1500\nalchemy\nbestiary\nBlack Death\nbubonic plague\nbyzantine\nchivalric\nHegira\nHejira\njoust\nLancastrian\nmangonel\nmediaeval\nMoorish\nNorman\npre-Columbian\npre-feudal\nthe Norman Conquest\ntroubadour\nvassal\nViking\nSee more results »\nbelonging or relating to the side of the House of York during the English Wars of the Roses (1455–1487) fought between the Houses of Lancaster and York: The dispute had its origins in the battle of Wakefield, at which Sir Thomas Harrington of Hornby was killed on the Yorkist side. A Lancastrian through his mother's descent from John of Gaunt, Henry VII reconciled the Yorkist faction by marrying Edward IV's daughter Elizabeth. Compare\nLancastrian\nMore examplesFewer examplesHe allied himself with Richard, Duke of Gloucester (later Richard III), and accompanied a Yorkist army headed for Edinburgh.The town again rallied itself to the Yorkist cause when in 1470 it assisted King Edward IV in quelling a Lancastrian uprising at the battle of Loosecoat Field.The duke had been accepted as protector by most of the Yorkist establishment.\nSMART Vocabulary: related words and phrases\nMiddle Ages (medieval Period) 501-1500\nalchemy\nbestiary\nBlack Death\nbubonic plague\nbyzantine\nchivalric\nHegira\nHejira\njoust\nLancastrian\nmangonel\nmediaeval\nMoorish\nNorman\npre-Columbian\npre-feudal\nthe Norman Conquest\ntroubadour\nvassal\nViking\nSee more results »"}