{"id":198016,"name":"you","type":"pronoun","us_sound":"juː","us_link":"../audio/y/u.mp3","uk_sound":"juː","uk_link":"../audio/y/ukevil_013.mp3","content":"you pronoun\n(PERSON/PEOPLE ADDRESSED)\nAdd to word list\nAdd to word list\nA1 used to refer to the person or people being spoken or written to: You look nice. I love you. You said I could go with you. You're coming tonight, aren't you? Are you two ready? You painted that yourself? That's great! you and yours\nyou and your family: Here's wishing a Happy New Year to you and yours!\nSee more\nMore examplesFewer examplesI'm sorry that I wasn't able to phone you yesterday.Are you frightened of spiders?Did you put the car in the garage?Are you sure there isn't any way of solving this problem?Do you prefer plain or striped shirts?\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou-all\nYours truly phrase\nyous\nSee more results »\nyou pronoun\n(PEOPLE GENERALLY)\nA2 people in general: You learn to accept these things as you get older. You can't get a driving licence till you're 17 in this country. Too much alcohol is bad for you. How do you get this thing to start?\nMore examplesFewer examplesOn a clear day you can see the mountains from here.With this model you get a radio, CD player and cassette deck all in one.I don't like body builders who are so overdeveloped you can see the veins in their bulging muscles.If you listen carefully to this piece of music, you can hear a flute in the background.There was a penalty clause which said you had to pay half the cost if you cancelled your booking.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nme\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nPronouns: one, you, we, theyOne, you, we and they are generic personal pronouns. We can use one, you, we and they to refer to ‘people in general’. …\nOne, you and weWe can use one, you or we when we are making generalisations and not referring to any one person in particular. When used like this, one, you and we can include the speaker or writer: …\nTheyWe can use they to talk about a wide group of people, such as an authority or an institution. In such cases, they does not refer to specific people: …\nIdioms\nyou and me both\nyou and whose army?\nyou do you\nyou got it\nyou pronoun\n(PERSON/PEOPLE)\nAdd to word list\nAdd to word list\nthe person or people spoken to: You look nice. I love you. Are you two ready?\nyou pronoun\n(PEOPLE GENERALLY)\npeople in general; anyone: How do you get this thing to start? Idioms\nyou bet\nyou can say that again\nyou can’t miss it\nyou can’t win them all\nyou know\nyou know something\nyou mean\nyou name it\nyou never can tell\nyou said it\nMore idioms\n(do) you see what I mean\nyou’re telling me\nyou’re welcome"}