{"id":198023,"name":"young","type":"adjective","us_sound":"jʌŋ","us_link":"../audio/y/young.mp3","uk_sound":"jʌŋ","uk_link":"../audio/y/ukyield024.mp3","content":"Add to word list\nAdd to word list\nA1 having lived or existed for only a short time and not old: young adults/children His girlfriend's very young. The trees in this part of the forest are still fairly young. Philippa is the youngest person in the family. Angela is two years younger than Clare. the Younger\nused after someone's name to show that they are the younger of two people who have the same name, especially a father and son: He played a large part in the administration of George Bush the Younger.\nSee more\nsuitable for young people: young fashion/ideasa bit/too young Be honest now - do you think this dress is a bit/too young for me (= is more suitable for someone younger)? look young for your age\nto look younger than you really are: I'm told that I look young for my age.\nSee more\nMore examplesFewer examplesJan is married with three young children.A young girl came up to me and asked for money.The team has several talented young players waiting in the wings.He's a very versatile young actor who's as happy in horror films as he is in TV comedies.The paper is targeted specifically at young people.\nSMART Vocabulary: related words and phrases\nDescribing people who are young\nadolescent\nadolescently\nat your mother's knee idiom\nbe knee-high to a grasshopper idiom\nflower\nfresh-faced\njuvenile\njuvenility\nknee-high\nmother\npre-puberty\npubescent\nteenage\ntender\ntweenager\nunderage\nya\nyoof\nyouthfulness\nyute\nSee more results »\nIdioms\nyoung at heart\nyoung lady/man\nyoung love\nthe young\nB2 young people considered together as a group: I have nothing against miniskirts, but I think they're strictly for the young.\nthe babies of an animal: Meanwhile, the mother flies back to the nest to feed her young.\nSMART Vocabulary: related words and phrases\nYoung people\nadolescence\nadolescent\nboyhood\nemo\nephebe\nladdish\nladdishness\nlarrikin\nmall rat\nminor\nskinhead\nTeddy boy\nteen\nteenager\nteenybopper\ntween\nyoungster\nyouth\nyouth culture\nyute\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal reproduction\nAdd to word list\nAdd to word list\n(esp. of something living) at an early stage of development or existence; not old: Young children should not be left alone at home. I work with wonderful young people mostly in their late teens. The new law creates a new driver’s license for those as young as 14.\nyoung people in general: Society can provide the young with valuable opportunities to help their communities.\nYoung are the babies of an animal: The bird flew back to the nest to feed her young."}