{"id":198052,"name":"yourself","type":"pronoun","us_sound":"jʊrˈself","us_link":"../audio/y/yourself.mp3","uk_sound":"jɔːˈself","uk_link":"../audio/y/ukyield027.mp3","content":"yourself pronoun\n(PERSON/PEOPLE ADDRESSED)\nAdd to word list\nAdd to word list\nA2 used when the subject of the verb is \"you\" or the person being spoken to, and the object is the same person: Be careful with that knife or you'll cut yourself! Katie, control yourself!\nA2 used for emphasis when the subject is \"you\": Did you make the dress yourself? You can do that yourself. be yourself\nto behave in your usual manner, rather than behaving in a way you think other people might like: The best thing you can do is to go into the interview and just be yourself. (all) by yourself\nA2 alone or without help from anyone else: I'm amazed you managed to move those boxes all by yourself. Do you like being by yourself sometimes or do you get lonely?\nThesaurus: synonyms, antonyms, and examples\nwithout help(all) by yourselfI don't think I can fix the car alone - can you help?(all) on your ownUK I learnt the song all on my own. single-handedlyShe single-handedly saved the company from bankruptcy.unassistedAfter years of using a cane, intensive physio enabled her to walk unassisted.unaidedAfter six months of treatment I can finally walk unaided.independentlyThe charity helps people to live independently.\nSee more results »\n(all) to yourself\nfor your use only: So you have the whole house to yourself this weekend? not be/seem/feel yourself\nnot to be, seem, or feel as happy or healthy as usual: Why don't you go home early if you're not feeling yourself? in yourself\nUK informal used when asking someone about their state of mind when they are physically ill: I know you must still be uncomfortable, but how are you in yourself?\nMore examplesFewer examplesI'm ready to go home now but I don't want to drag you away if you're enjoying yourself.\"Might I have some more bread?\" \"Please, help yourself!\"Don't even think about lifting me up, Ted, you might do yourself an injury.\"I don't think I'll come to the party tonight.\" \"All right, suit yourself!\"So it's finally clicked that you're going to have to get yourself a job, has it?\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nhimself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nYou can also find related words, phrases, and synonyms in the topics:\nBehaving, interacting and behaviour\nAlone\nUnaided and working alone\nExcluding\nMoods\nyourself pronoun\n(PEOPLE GENERALLY)\nB2 used when both the subject and object of the verb are \"you\" and \"you\" is also being used to refer to people generally: You tell yourself everything's all right but you know it's not really.\nMore examplesFewer examplesActing is very competitive - you've got to really push yourself if you want to succeed.Treat minor ailments yourself.Taking responsibility for yourself is part of the process of growing up.Mispronunciation can be a serious obstacle to making yourself understood in a foreign language.Time passes so quickly when you're enjoying yourself.\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nhimself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nself\nthemself\nthemselves\nthyself\nGrammar\nPronouns: reflexive (myself, themselves, etc.)Reflexive pronouns end in -self or -selves. They refer back to the subject forms of personal pronouns (underlined in the example below): …\nReflexive pronouns for same subject and objectWe often use reflexive pronouns when the subject and the object of the verb refer to the same person or thing: …\nReflexive pronouns for emphasisWe can use reflexive pronouns for emphasis: …\nReflexive pronouns + by meaning aloneWe often use reflexive pronouns with by to mean ‘alone’ or ‘without any help’: …\nReflexive pronouns for politenessWe sometimes use reflexive pronouns instead of personal pronouns for politeness, but not as the subject of a clause: …\nAdd to word list\nAdd to word list\nthe person or people being spoken to; the reflexive form of you: Be careful with that knife or you’ll cut yourself.\nYourself is sometimes used to emphasize the subject of the sentence: Did you girls actually raise this money yourselves? (all) by yourself\nIf you do something (all) by yourself, you do it alone or without help from anyone: You’re old enough to take the bus by yourself, aren’t you, Joyce? (all) to yourself\nIf you have something (all) to yourself, you have it for your use only: Now that Neil and Sam are away, you’ve got the whole house to yourself."}