{"id":198050,"name":"yours","type":"pronoun","us_sound":"jʊrz","us_link":"../audio/y/eus75059.mp3","uk_sound":"jɔːz","uk_link":"../audio/y/ukyield026.mp3","content":"yours pronoun\n(PERSON/PEOPLE ADDRESSED)\nAdd to word list\nAdd to word list\nA2 the one(s) belonging to or connected with the person or group of people being spoken or written to: Is this pen yours? Unfortunately my legs aren't as long as yours. I've got something of yours (= that belongs to you). Yours is the room on the top floor, on the left.\nB1 used at the beginning of some phrases written at the end of a letter, before giving a name: Yours, Jack Yours faithfully/sincerely, K. Maxwell.\nMore examplesFewer examplesDo you consider him a friend of yours?Who works in the office next to yours?That aftershave of yours is smelling out the whole house.Sorry, I stupidly forgot to bring my copy of the report - could I look at yours?There's an old pair of shoes of yours lying in the bottom of the wardrobe.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nYou can also find related words, phrases, and synonyms in the topics:\nWritten greetings\nyours pronoun\n(PEOPLE GENERALLY)\nused to show that something belongs to or is connected with people generally: Other people's children always seem to be better behaved than yours.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nIdiom\nyours truly\nAdd to word list\nAdd to word list\nbelonging to or connected with the person or people being spoken to, or that which belongs to you: Our apartment isn’t as large as yours, but it suits us. I’ve got something of yours (= that belongs to you).\nYours faithfully\nAdd to word list\nAdd to word list\nwritten at the end of a formal letter that begins 'Dear sir' or 'Dear madam', before signing your name: I look forward to hearing from you. Yours faithfully, Jane Brown.\nYours sincerely\nwritten at the end of a less formal letter that begins with the name of the person you are writing to, before signing your name: I look forward to hearing from you. Yours sincerely, Jane Brown."}