{"id":198047,"name":"your","type":"determiner","us_sound":"jʊr","us_link":"../audio/y/your.mp3","uk_sound":"jɔːr","uk_link":"../audio/y/ukyield021.mp3","content":"your determiner\n(PERSON/PEOPLE ADDRESSED)\nAdd to word list\nAdd to word list\nA1 belonging or relating to the person or group of people being spoken or written to: Is this your bag? It's not your fault. Your mother is driving me crazy. What's your problem?\nMore examplesFewer examplesPut your toys away now - it's time for bed.Are you still in touch with any of your old school friends?Shall I top up your drink?The green of your scarf tones in with your shoes.I'm sorry I forgot to mention your name. I just wasn't thinking.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyours\nyour determiner\n(PEOPLE GENERALLY)\nB1 belonging or relating to people generally: Of course you want the best for your children. Garlic is good for your blood.\ninformal said before a typical example of something is given: This isn't your usual science fiction novel, but then Brinkworth isn't exactly your typical author.\nMore examplesFewer examplesAfter you've had a baby you lose the muscle tone in your stomach.The blurb on the back of the book says that it 'will touch your heart'.This is the easiest way to top up your mobile phone card.On the plane, the flight attendant brings you a towelette after your meal.A good diet and plenty of exercise will help you to keep your body healthy.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\nthe\ntheir\ntheirs\nthine\nthy\nus\nyer\nyours\nYou can also find related words, phrases, and synonyms in the topics:\nTypifying, illustrating and exemplifying\nGrammar\nPronouns: possessive (my, mine, your, yours, etc.)We use pronouns to refer to possession and ‘belonging’. There are two types: possessive pronouns and possessive determiners. We use possessive determiners before a noun. We use possessive pronouns in place of a noun: …\nyour pronoun\n(BELONGING TO YOU)\nAdd to word list\nAdd to word list\nbelonging to or connected with the person or people being spoken to; the possessive form of you: Is this your umbrella? Let’s take your car because it has more room than mine.\nyour pronoun\n(OF PEOPLE GENERALLY)\nbelonging to or connected with any person or people generally: Exercise is good for your health. Idiom\nin your face"}