{"id":134966,"name":"each","type":"pronoun","us_sound":"iːtʃ","us_link":"../audio/e/each.mp3","uk_sound":"iːtʃ","uk_link":"../audio/e/ukdynam013.mp3","content":"Add to word list\nAdd to word list\nA1 every thing, person, etc. in a group of two or more, considered separately: When you run, each foot leaves the ground before the other comes down. There are five leaflets - please take one of each.each of Each of the companies supports a local charity.each and every one of Each and every one of the flowers has its own colour and smell. We each (= every one of us) wanted the bedroom with the balcony, so we tossed a coin to decide. The bill comes to £79, so that's about £10 each. each to his/their own (also to each their own)\nused to say that everyone likes different things: You actually like modern jazz, do you? Each to their own.\nSee more each way\nIf you put an amount of money each way on a horse race, you will win money if the horse you have chosen comes first, second, or third: I laid a bet of £50 each way on Blue Streak.\nSee more\nMore examplesFewer examplesWe have only a small amount of food and clothing to deal out to each refugee.Start by dealing everyone five cards each.He cut the cake into six pieces and gave each child a slice.Your salary will be paid on the third week of each calendar month.You must consider each problem as an aspect of the whole.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nGrammar\nEachEach is a determiner or a pronoun. …\nEach: meaning and useWe use each to refer to the individual things or persons in a group of two or more: …\nEach ofWe use each of before other determiners and before the plural object pronouns us, you and them: …\nEach + pronouns and possessivesWe use each with plural pronouns and possessives, especially when we don’t want to say he/she, women/men, etc.: …\nEach referring to a subjectWhen we use each to refer to the subject of the clause, it usually appears in the normal mid position for adverbs, between the subject and the main verb, after the modal verb or first auxiliary verb, or after be as a main verb: …\nEach or every?We use each to refer to individual things in a group or a list of two or more things. It is often similar in meaning to every, but we use every to refer to a group or list of three or more things. …\nAdd to word list\nAdd to word list\nevery thing, person, etc., in a group of two or more, considered separately: There are five leaflets – please take one of each. Each of the brothers has a different personality. It’s 500 miles each way. The bill comes to $80, so that’s $20 each."}