{"id":135035,"name":"early","type":"adjective","us_sound":"ˈɝː.li","us_link":"../audio/e/early.mp3","uk_sound":"ˈɜː.li","uk_link":"../audio/e/ukdynam030.mp3","content":"Add to word list\nAdd to word list\nA1 near the beginning of a period of time, or before the usual, expected, or planned time: If you finish early you can go home. If you arrived earlier, you'd have more time. I like being a little early for interviews.early (on) in They scored two goals early (on) in the game.early (in) I hate having to get up early (in the morning).early night I'm going to have an early night (= go to sleep before my usual time). She was a poet living in the early 15th century.early age He learned to read at the early age of three.it's early to It's a little early to be sowing carrot seeds, isn't it?early days/years Henry Ford was a pioneer during the early days/years of car manufacture. My earliest (= first) memory is of being shown around our new house. These are some of my early (= first) attempts at sculpture. Here's a dish I prepared earlier (= I made a short time ago). Compare\nlate adjective adverb (NEAR THE END)\nEarly flowers and vegetables are ones that are ready early in the year, before most other ones. at the earliest\nC2 used after a date or time to show that something will not happen before then: I'm very busy, so I won't be with you till four o'clock at the earliest.\nSee more\nMore examplesFewer examplesPlant growth is most noticeable in spring and early summer.She's probably in her early forties.She wasn't feeling well, so she went home early.Diagnosis of the disease is difficult in the early stages.We had expected to arrive an hour late, but actually we were early.\nSMART Vocabulary: related words and phrases\nEarly\nahead\nahead of\nbe up with the lark idiom\nbelatedly\nbetter\nbetter late than never idiom\nget ahead of yourself idiom\nget out over your skis idiom\nill-timed\nin good time idiom\npostdate\npremature\nprematurely\nprepone\npumpkin\nschedule\nshort\nthe early bird catches the worm idiom\ntimeously\nturn into a pumpkin idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBefore, after and already\nTypes of plant\nGrammar\nEarlyEarly is an adverb or an adjective. …\nIdioms\nan early bath\nearly to bed and early to rise (makes a man healthy, wealthy, and wise)\nit's early days\ndrive/send someone to an early grave\nAdd to word list\nAdd to word list\nnear the beginning of (a period of time), or before the usual, expected, or planned time: I got up early this morning to walk the dog. Sheena’s in her early thirties. She arrived early for the interview. If you finish early (= before the end of the allowed time) you can go home. Detroit has been an automotive center since the early days/years (= the beginning time) of car manufacturing. Here’s a dish I prepared earlier (= I made a short time ago). It was a great race for Needles, who took the lead early on (= soon after the start).\nat your earliest convenience\nAdd to word list\nAdd to word list\nused to ask someone to do something, or to say that you will do something as soon as possible: Please give me a call back at your earliest convenience on extension one two four seven."}