{"id":135050,"name":"earmark","type":"verb","us_sound":"ˈɪr.mɑːrk","us_link":"../audio/e/earmark.mp3","uk_sound":"ˈɪə.mɑːk","uk_link":"../audio/e/ukearma001.mp3","content":"Add to word list\nAdd to word list\nto keep or intend something for a particular purpose: be earmarked for Five billion dollars of this year's budget is already earmarked for hospital improvements. Synonyms\nallocate\napportion formal\nappropriate formal\nreserve\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nmaintain\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nAdd to word list\nAdd to word list\nto intend something for a particular purpose: Ten thousand dollars of this year’s budget is earmarked for the renovation of the building.\nAdd to word list\nAdd to word list\nLAW, POLITICS\n&#160; US in the US, a legal request that is added to a law to make sure that an amount of money from the US Congress’s budget is spent on a particular project: Members of the Party used the 111th Congress to request hundreds of earmarks that added more than $1 billion to the federal budget. Earmarks often result in the expenditure of large sums of taxpayer money to help a limited number of people.\nLAW, POLITICS\n&#160; US an amount of money from the US Congress’s budget to be spent on a particular project: A senator obtained an earmark of $1.5 million last year to deal with a beetle that attacks trees, lawns, and crops.\na characteristic or feature that is typical of a person or thing: He said the plan had all the earmarks of an economic disaster because it would increase customer costs.\nto keep or plan to use something for a particular purpose: earmark sth for sth The money had been earmarked for airport improvements.earmark sth as sth Africa was earmarked as a growth area.earmark sth to do sth Around 100 stores are earmarked to be sold."}