{"id":135071,"name":"earnings","type":"noun","us_sound":"ˈɝː.nɪŋz","us_link":"../audio/e/earnings.mp3","uk_sound":"ˈɜː.nɪŋz","uk_link":"../audio/e/ukearma008.mp3","content":"Add to word list\nAdd to word list\nB2 the amount of money that someone is paid for working: Average earnings for skilled workers are rising. Compare\npay noun\nwage noun\nremuneration formal\nsalary\nstipend\na company's profits in a particular period: report earnings Sun Microsystems reported earnings that were slightly better than the market had been expecting.\nMore examplesFewer examplesHaving a big mortgage is a real drain on your earnings.She predicts pretax earnings of over $13 m for the company this year.Wages rose by 2.9% last year, but real earnings still fell by 1.3%.The rise in the value of the dollar has depressed the company's earnings this year.He got into trouble by lying to the tax office about his earnings.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nlivelihood\nmake an honest living idiom\npro rata\nprorate\npull\npull something down\nraise\nrake something in\nremonetize\nrevenue\nsick pay\nSee more results »\nAdd to word list\nAdd to word list\nthe amount of money that you are paid for the work you do, or the profit that a company makes\nAdd to word list\nAdd to word list\nFINANCE a company's or industry's profits in a particular period: Earnings from record sales topped £5 million.lower/strong/record earnings It was one of the few companies that showed strong earnings. Sun Microsystems reported earnings that were slightly better than the market had been expecting. expected/forecast earnings\nHR, WORKPLACE the money that a person makes for the work that they do: Family credit is reduced as earnings rise. They are suing each other for loss of earnings. weekly/monthly earnings See also\nannual earnings\naverage earnings\ncore earnings\nheadline earnings\nloss of earnings\nretained earnings"}