{"id":135058,"name":"earn","type":"verb","us_sound":"ɝːn","us_link":"../audio/e/earn.mp3","uk_sound":"ɜːn","uk_link":"../audio/e/ukearma003.mp3","content":"Add to word list\nAdd to word list\nA2 to receive money as payment for work that you do: I earn $80,000 a year. How much do you earn, if you don't mind me asking?earn a living You can't expect to earn a living (= be paid enough money to live on) from your painting.earn something from something [ + two objects ] Coffee exports earn (= give) Brazil many millions of dollars a year./Brazil earns many millions of dollars a year from coffee exports.\nC2 to get something that you deserve: It's been a tough six months and I feel I've earned a few weeks off. See also\nwell earned\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nMore examplesFewer examplesAs a personal trainer to the rich and famous, he earns over a million dollars a year.He earns a bit of extra pocket money by babysitting.Many people are more interested in job satisfaction than in earning large amounts of money.A person's gross income is the money they earn before tax is deducted from it.You should put the money in a savings account where it will earn interest.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nkilling\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGetting, receiving and accepting\nAdd to word list\nAdd to word list\nto receive money as payment for work that you do, or to get something that you deserve because of your abilities or actions: [ T ] This month’s raise means that I’ll be earning $45,000 a year. [ T ] After all the work I’ve done, I’ve earned a vacation.\nAdd to word list\nAdd to word list\n[ I or T ] to receive money as payment for work that you do: How much do you earn? When I started earning, I decided to open a savings account.earn a salary/a wage/an income A typical manager will earn a salary of at least $69,000. Brokers earn commission on each sale.earn sb sth She turned down an advert that would have earned her £1 million.\n[ T ] to make a particular amount of money from a product or business activity: His last three films have earned more than $437 million worldwide. In 1994, BBA earned pretax profit of 84.3 million pounds.earn sth from sth The region earns billions of dollars from tourism.\n[ T ] to get an amount of money as profit or interest on an investment or loan: You can buy and sell these unit trusts when you choose, and you earn dividends. Any spare cash is best put in a savings account where it will earn interest. Local governments use the fund as a money-market account to earn interest on surplus cash.\n[ T ] to collect a reward for doing business with a particular company or for a particular activity. You can use these rewards to buy goods or get some other advantage: Apply now to start earning loyalty points Organizations can earn carbon credits by registering an energy saving project.\nearn a living (also earn your living)\nto be paid the money that you need to live on: He earns a living as a self-employed consultant."}