{"id":135099,"name":"earth","type":"noun","us_sound":"ɝːθ","us_link":"../audio/e/earth.mp3","uk_sound":"ɜːθ","uk_link":"../audio/e/ukearma015.mp3","content":"earth noun\n(PLANET)\nAdd to word list\nAdd to word list\nB1 [ S or U ] (also Earth) the planet third in order of distance from the sun, between Venus and Mars; the world on which we live: The earth takes approximately 3651/4 days to go round the sun.on earth The circus has been described as the greatest show on earth (= in the world). Mercury, Venus, Earth, and Mars are called \"rocky planets\".\nVitalij Cerepok/EyeEm/GettyImages\nMore examplesFewer examplesIt was Ptolemy who propounded the theory that the earth was at the centre of the universe.The satellite slowly rotates as it circles the earth.As every schoolboy knows, the earth revolves around the sun.Meteorites often burn up in the atmosphere before they reach the Earth.Theories abound about how the earth began.\nSMART Vocabulary: related words and phrases\nAstronomy\nalbedo\nAndromeda\nAquarius\nAries\nasteroid\ngalactic\ngalaxy\nGemini\ngeostationary orbit\ngibbous\nnova\nobservatory\norbit\norbital\nOrion\nstellar\nsubstellar\nsunspot\nsupergiant\nsupermassive\nSee more results »\nearth noun\n(GROUND)\nB2 [ S or U ] the land surface of the world rather than the sky or sea: The earth was shaking and people rushed out of their houses in panic. He had enjoyed the voyage but was happy to feel the earth beneath his feet once more.\nB2 the usually brown, heavy and loose substance of which a large part of the surface of the ground is made, and in which plants can grow: The ploughed earth looked rich and dark and fertile.\nJavier Román/EyeEm/GettyImages\nMore examplesFewer examplesTheir hoofs threw up clods of earth as they galloped across the field.There was a large mound of earth in the middle of the field.A large worm wriggled in the freshly dug earth.In the spring you almost feel you can smell the earth.I like to get my hands in the earth when I'm gardening.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSoil\nearth noun\n(WIRE)\n[ C usually singular ] UK (US ground) a wire that makes a connection between a piece of electrical equipment and the ground, so the user is protected from feeling an electric shock if the equipment develops a fault\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nearth noun\n(HOLE)\n[ C ] a hole in the ground where an animal such as a fox lives\nSMART Vocabulary: related words and phrases\nAnimal dwellings - natural\nanthill\narboreal\nburrow\nbyre\ncobweb\neyrie\nfoxhole\nguest\nhabitat\nhole\nholt\nlair\nlodge\nnest\nrabbit hole\nrookery\nsett\nspider's web\nwarren\nwildlife corridor\nSee more results »\nGrammar\nEmphatic questions with whatever and what on earthWe can ask emphatic questions using whatever or what on earth to express shock or surprise. We stress ever and earth: …\nEmphatic questions with wherever and where on earthWe can ask emphatic questions using wherever or where on earth to express shock or surprise. We stress ever and earth: …\nEmphatic questions with whoever and who on earthWe can ask emphatic questions using whoever or who on earth to express shock or surprise. We stress ever and earth: …\nIdioms\ncome back down to earth\ncost, charge, etc. the earth\nthe earth moved\nhow, what, why, etc. on earth...\nlike nothing (else) on earth\nto put an earth (= wire) between a piece of electrical equipment and the ground: You could get a nasty shock from that water heater if it isn't earthed properly.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nearth noun [U]\n(PLANET)\nAdd to word list\nAdd to word list\nthe planet third in order of distance from the sun, after Venus and before Mars; the world on which we live: Earth looks incredibly beautiful from space. His trainer called him the greatest boxer on earth (= in the world).\nearth noun [U]\n(SUBSTANCE)\nthe loose substance of which a large part of the surface of the ground is made, and in which plants can grow; the land surface of the earth rather than the sky or sea: The plowed earth looked dark and fertile. Idiom\non earth"}