{"id":135180,"name":"ease","type":"verb","us_sound":"iːz","us_link":"../audio/e/ease.mp3","uk_sound":"iːz","uk_link":"../audio/e/ukearma029.mp3","content":"ease verb\n(MAKE LESS)\nAdd to word list\nAdd to word list\n[ I or T ] to make or become less severe, difficult, unpleasant, painful, etc.: ease a problem To ease the problem of overcrowding, new prisons will be built.ease pain These pills should ease the pain. After the arrival of the United Nations soldiers, tension in the area began to ease.\nMore examplesFewer examplesNew measures have been introduced to ease traffic congestion in the city.After the Second World War lots of prefabs were put up to ease the housing crisis.A decisive win would certainly help to ease the pressure on the team's captain.This latest incident will do nothing to ease tensions between the two countries.The new laws are intended to ease the burden of social welfare costs.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making less strong\nease verb\n(MOVE)\n[ T + adv/prep ] to move or to make something move slowly and carefully in a particular direction or into a particular position: ease something into something She eased the key into the lock, anxious not to wake anyone. I eased myself out of the chair.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nlag\nsluggish\nsluggishly\nsluggishness\nsnail\nsteadily\nwander\nSee more results »\nIdiom\nease someone's mindPhrasal verbs\nease up/off\nease someone out\nease noun [U]\n(NO DIFFICULTY)\nthe quality of needing little effort or not being difficult: with ease She won the 400 metre race with ease.for ease of The doors are extra-wide for ease of access (= so that people can get in without difficulty).\nMore examplesFewer examplesShe performed the task with her accustomed ease.After three months of training she was running ten miles with ease.They reached their targets with ease.Having tried the device I can vouch for its ease of use.Ease of access to credit cards has changed the way we shop.The screen is backlit for ease of reading.\nSMART Vocabulary: related words and phrases\nEasiness and simplicity\n(as) easy as pie/ABC/anything/falling off a log idiom\na walk in the park idiom\naccessibility\nat the push of a button idiom\nat the stroke of a pen idiom\nbe a matter of something idiom\nfail-safe\nfoolproof\nfrictionless\nfrictionlessly\nfriendly\nover-simple\nover-simply\npainlessly\npainting\npainting by numbers idiom\nwalk\nwalk into something\nwieldy\nwith your eyes closed/shut idiom\nSee more results »\nease noun [U]\n(COMFORT)\nthe state of being comfortable or relaxed, or free from worry or pain: They live lives of great comfort and ease. He came into the room and sat down with his usual good-natured ease. at (your) ease\nB2 relaxed: He felt completely at ease.\nSee more at ease\n(of a soldier) standing with feet apart and hands behind the back: The soldiers come to attention when an officer enters the room and stand at ease when the officer allows it.\nSee more\nMore examplesFewer examplesShe has a carefree attitude, a sense of ease.His life of ease had not prepared him to deal with such hardships.The balm seemed to give her ease.\nSMART Vocabulary: related words and phrases\nCalm and relaxed\n(as) cool as a cucumber idiom\nat (your) leisure idiom\nbe at peace with the world idiom\nbiddable\ncalmly\neasy-going\nequilibrium\nfluidly\nfree-flowing\ngaily\npeaceably\npeacefully\npeacefulness\nplacable\nplacid\nunpressurized\nunruffled\nunshockable\nunstrained\nunstressed\nSee more results »\nease verb [I/T]\n(LESSEN)\nAdd to word list\nAdd to word list\nto make or become less severe, difficult, unpleasant, or painful: [ T ] These pills should ease the pain.\nease verb [I/T]\n(MOVE)\nto move something slowly and carefully in a particular direction or into a particular position: [ I ] I eased through the crowd to the stage. Phrasal verbs\nease up\nease up\nease noun [U]\n(EASY EFFORT)\nfreedom from difficulty, effort, or pain: She won the match with ease (= without difficulty). He felt completely at ease (= relaxed and comfortable) with them. at ease\nSoldiers who are at ease stand in a slightly relaxed position with their feet apart and their hands behind their back.\nAdd to word list\nAdd to word list\n[ I or T ] to make something less severe, difficult, etc. or to become less severe, difficult, etc.: ease the burden/pressure/problem He made proposals to ease the tax burden on lower earners. The rise in interest rates may prompt the government to ease fiscal policy again. the tension/pressure/crisis eases\n[ I ]\n&#160; FINANCE to become lower in value: a rate/price eases Interbank interest rates in the domestic money market eased in the week to Nov. 15. the dollar/market eases\n[ I or T ] to move gradually to a different level, or to make something do this: ease back/down/upwards Freight rates eased upwards.\nthe fact that something does not involve difficulty or effort: We rated the products for ease of use, quality, and price. Actuarial analysts can figure pension fund liabilities with ease."}