{"id":135207,"name":"east","type":"noun","us_sound":"iːst","us_link":"../audio/e/east.mp3","uk_sound":"iːst","uk_link":"../audio/e/ukeasil004.mp3","content":"Add to word list\nAdd to word list\nA2 the direction from which the sun rises in the morning, opposite to the west, or the part of an area or country that is in this direction: The points of the compass are north, south, east, and west. Which way is east? Most of the country, except the east, is rural.in the east of Her home is in the east of France.to the east of According to the map, the village lies about ten kilometres to the east of here. the East\nB2 Asia, especially its eastern and southern parts: She spent her childhood in the East - mostly in China. In this class, we will be studying how medieval trade routes westernized the East.\nthose countries in Europe that had communist governments before the 1990s: The collapse of Communism changed East-West relations for ever. If you were from the US or the UK, it was nearly impossible to get a tourist visa to visit any countries in the communist East.\nMore examplesFewer examplesThe sun rises in the east and sets in the west.The transcontinental railway goes from New York in the east to San Francisco in the west.There will be rain showers in the east.The climate is cooler in the east of the country.The army had been positioned to the north and east of the city.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nDirection of motion\nCountries, nationalities & continents: continents & regions of the world\nGrammar\nEast or eastern; north or northern? …\nIdiom\nback east\nA2 in or forming the east part of something: Cambridge is in East Anglia. The east wall of the mosque is covered with a beautiful mosaic. east wind\na wind coming from the east: Officials are worried that the east wind will continue to spread wildfires.\nSee more\nMore examplesFewer examplesRimini is a thriving holiday resort on the east coast of Italy.There was a cool east wind blowing and clouds were gathering on the horizon.On the east side of the hill, the land falls away sharply.Few climbers attempt to ascend the east face of the mountain.The visitors stood for several minutes at the east door of the cathedral, looking down the nave.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nGrammar\nEast or eastern; north or northern? …\nA2 towards the east: We'll drive east for a few more miles, then turn south.east of They were the first people to travel east of the mountains (= into the area beyond and to the east of the mountains).due east We walked due (= directly) east for two kilometres.face east The garden faces east, so we'll get the morning sun.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ngo\ninto\nmultidirectional\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPoints of the compass\nGrammar\nEast or eastern; north or northern? …\nAdd to word list\nAdd to word list\nthe direction where the sun rises in the morning that is opposite west, or the part of an area or country that is in this direction: The points of the compass are north, south, east, and west. Most of the state’s heavy industry is in the east. the East\nThe East is Asia, esp. its eastern and southern parts: She spent her childhood in the East, mostly in China and Japan. the East\nIn the US, the East is the part of the country east of the Mississippi River."}