{"id":135194,"name":"easy","type":"adjective","us_sound":"ˈiː.zi","us_link":"../audio/e/easy.mp3","uk_sound":"ˈiː.zi","uk_link":"../audio/e/ukeasil013.mp3","content":"easy adjective\n(NOT DIFFICULT)\nAdd to word list\nAdd to word list\nA1 needing little effort: an easy exameasy for Would a ten o'clock appointment be easier for you? [ + to infinitive ] It's easy to see why he's so popular.easy to She's very easy to talk to. The easiest thing to do would be for us to take the train home.It isn't easy doing something It isn't easy being a parent.no easy matter Getting into the movie business is no easy matter. I don't trust that easy (= relaxed) charm of his.informal My car can do 250 kph, easy. Opposite\ndifficult\nThesaurus: synonyms, antonyms, and examples\neasyeasyI can tell you how to do that - it's easy!simpleThe recipe is so simple - you just mix all the ingredients together.straightforwardIt seems like a fairly straightforward assignment.a piece of cakeMy last exam was a piece of cake.\nSee more results »\nMore examplesFewer examplesThis machine is comparatively easy to use.This problem should be easy enough for someone who's done physics at A level.She doesn't find it easy to talk about her problems.The irregularity of English spelling means that it is easy to make mistakes.The booklet presents explains things in an easy, non-technical way.\nSMART Vocabulary: related words and phrases\nEasiness and simplicity\n(as) easy as pie/ABC/anything/falling off a log idiom\na walk in the park idiom\naccessibility\nat the push of a button idiom\nat the stroke of a pen idiom\nbe a matter of something idiom\nfail-safe\nfoolproof\nfrictionless\nfrictionlessly\nfriendly\nover-simple\nover-simply\npainlessly\npainting\npainting by numbers idiom\nwalk\nwalk into something\nwieldy\nwith your eyes closed/shut idiom\nSee more results »\neasy adjective\n(COMFORTABLE)\ncomfortable or calm; free from worry, pain, etc.: They both retired and went off to lead an easy life in the Bahamas.easy about I don't feel easy about leaving him alone in the house all day.with an easy mind/conscience With the harvest finished, I was able to relax with an easy mind/conscience.\nSMART Vocabulary: related words and phrases\nCalm and relaxed\n(as) cool as a cucumber idiom\nat (your) leisure idiom\nbe at peace with the world idiom\nbiddable\ncalmly\neasy-going\nequilibrium\nfluidly\nfree-flowing\ngaily\npeaceably\npeacefully\npeacefulness\nplacable\nplacid\nunpressurized\nunruffled\nunshockable\nunstrained\nunstressed\nSee more results »\nRelated word\neasinessIdioms\nan easy touch\n(as) easy as pie/ABC/anything/falling off a log\neasier said than done\nthe easiest thing in the world\neasy come, easy go\neasy does it!\nbe easy game/meat\neasy on the eye/ear\ngo easy\nI'm easy\nMore idioms\non easy street\ntake it/things easy\neasy adjective, adverb\n(NOT DIFFICULT)\nAdd to word list\nAdd to word list\nneeding little effort; not difficult: She looked through the test trying to find an easy question. Would a 10 a.m. appointment be easier for you? [ + to infinitive ] She is very easy to talk to. Let’s run the last two miles at an easy (= not fast) pace.\neasy adjective, adverb\n(COMFORTABLE)\n[ -er/-est only ] free from worry, pain, or trouble; comfortable or calm: With three children to support, her life has been far from easy. I don’t feel easy about leaving him alone in the house all day. Idioms\neasier said than done\n(as) easy as pie\neasy does it\nthe easy way out\nclose/end/finish easier\nAdd to word list\nAdd to word list\nSTOCK MARKET to be lower in price at the end of a period of time: Tokyo stocks closed easier on profit-taking.\non/down easy street\ninformal having a lot of money and living comfortably: You'd think a windfall that large would put Smith on easy street."}