{"id":135277,"name":"eavesdropper","type":"noun","us_sound":"ˈiːvz.drɑː.pɚ","us_link":"../audio/e/useaste007.mp3","uk_sound":"ˈiːvz.drɒp.ər","uk_link":"../audio/e/ukeasil023.mp3","content":"Add to word list\nAdd to word list\na person who listens to someone's private conversation without them knowing: Doris mouthed the words, looking towards the door for fear of eavesdroppers. A lot of prison slang was probably invented to confuse eavesdroppers.\na person who listens to someone without them knowing, using an electronic listening device: The eavesdroppers, armed with radio scanning equipment, can pick up talk from inside homes. When intercepted conversations are clearly innocent, police eavesdroppers are supposed to switch off after a few minutes.\na person who steals private information by secretly picking up an electronic signal or entering a computer system: He suggests manually locking the car in any situation when an eavesdropper might be able to pick up the key fob's signal. The eavesdropper will know exactly which search query you typed. Related word\neavesdrop\nMore examplesFewer examplesReaders become like eavesdroppers who overhear a conversation that is not really meant for their ears.A small group of eavesdroppers were listening intently for evidence of a treacherous crime.The audience becomes an instant eavesdropper witnessing a family's tragedy. The country's mobile networks are vulnerable to eavesdroppers. To protect data from eavesdroppers the system lets users encrypt the packets of data transmitted.\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naural\naurally\nbe all ears idiom\ncatch\ncloth ears\near\nearshot\neavesdropping\ngrommet\nhark\nhark at someone! idiom\nhearing\nlend an ear idiom\nmishear\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: spying and espionage\nStealing\nOperating computers"}