{"id":135275,"name":"eavesdrop","type":"verb","us_sound":"ˈiːvz.drɑːp","us_link":"../audio/e/eavesdrop.mp3","uk_sound":"ˈiːvz.drɒp","uk_link":"../audio/e/ukeasil022.mp3","content":"Add to word list\nAdd to word list\nto listen to someone's private conversation from close by without them knowing: eavesdrop on He was eavesdropping on our conversation. He beckoned me into a little side room where no one could eavesdrop.\nThesaurus: synonyms, antonyms, and examples\nto listen to someone or somethinglistenAre you listening to me? I'm talking to you.hearAn audience gathered to hear him speak.eavesdropHe was eavesdropping on our conversation.listen in onI wish my brother would stop listening in on my phone calls.hear someone outAt least hear me out before you make up your mind.\nSee more results »\nto listen to someone without them knowing using an electronic listening device, for example attached to a telephone line: The intelligence agency was instructed to eavesdrop and collect information to be analysed by other agencies. Police need a warrant if they want to eavesdrop on telephone conversations.\nto steal private information by secretly picking up an electronic signal or entering a computer system: This vulnerability allows an attacker to eavesdrop on wireless traffic and collect enough information to bypass the secret shared authentication key.\nMore examplesFewer examplesI didn't mean to eavesdrop, but I heard you mention my name.I sat at the next table trying desperately to eavesdrop.Have you eavesdropped on any good gossip lately?The government has more power than ever to eavesdrop on its citizens.How many big companies eavesdrop on employees' personal e-mail conversations?Your privacy is guaranteed, as the signal is encrypted and cannot be eavesdropped on.\nSMART Vocabulary: related words and phrases\nUsing the ears\nattend\naural\naurally\nbe all ears idiom\ncatch\ncloth ears\near\nearshot\neavesdropper\neavesdropping\ngrommet\nhark\nhearing\nlend an ear idiom\nmonaural\nmonaurally\noverhear\nprick\nprick (something) up\nsensorineural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: spying and espionage\nStealing\nOperating computers\nRelated words\neavesdropper\neavesdropping\nAdd to word list\nAdd to word list\nto listen secretly to someone’s private conversation"}