{"id":135558,"name":"echo","type":"noun","us_sound":"ˈek.oʊ","us_link":"../audio/e/echo.mp3","uk_sound":"ˈek.əʊ","uk_link":"../audio/e/ukec___014.mp3","content":"echo noun [C]\n(SOUND)\nAdd to word list\nAdd to word list\nC2 a sound that is heard after it has been reflected off a surface such as a wall or a cliff: The echoes of his scream sounded in the cave for several seconds. Thick carpet would reduce the echo in this hallway.\nMore examplesFewer examplesYou could hear the echo of footsteps in the stairwell of the building.He shouted into the mouth of the cave and waited for the echo.Bats have very poor eyesight but they use echoes to locate objects in the dark.There's nobody down the well - it's the echo of your own voice you are hearing.It was quite spooky when a second later the echo could be heard repeating down the valley.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\necho noun [C]\n(SIMILAR DETAIL)\na detail that is similar to and makes you remember something else: echo of There are echoes of Mozart in her first piano compositions.\nSMART Vocabulary: related words and phrases\nRemembering, reminding and reminders\naide-mémoire\nannal\nawaken someone to something\nbe engraved on someone's memory/mind idiom\nbe etched on/in someone's memory idiom\ncommit\nhooky\nif my memory serves me right idiom\nimprint\nindelible\njog\njog someone's memory idiom\nremember\nremind\nremind someone of something/someone\nreminder\nreminisce\nresonance\nresonant\nstamp\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\necho verb\n(SOUND)\nC2 [ I ] If a sound echoes or a place echoes with a sound, you hear the sound again because you are in a large, empty space: echo around The sound of footsteps echoed around the hall.echo with Suddenly, the building echoed with the sound of gunfire.\nMore examplesFewer examplesMy voice echoed around the hall.A heavy artillery barrage echoed through the night.A loud bang echoed through the district.Sobbing and screaming echoed round the small space.Charities and aid agencies have all echoed this view.\nSMART Vocabulary: related words and phrases\nSound & its properties\nacoustic\nacoustically\nanechoic\naurally\ncrosstalk\ndiapason\nhigh definition\nmonaural\nmonaurally\nmono\nquadraphonic\nreverberate\nreverberative\nringing\nsilken\nsonic\nsound wave\nsoundproof\nthunder\nunlistenable\nSee more results »\necho verb\n(SIMILAR DETAILS)\nC2 [ T ] to repeat details that are similar to, and make you think of, something else: The design of the church echoes that of St. Paul's Cathedral. I've heard the prime minister's view echoed throughout the party.\nSMART Vocabulary: related words and phrases\nSaying again\ncascade\ndin something into someone\ndrill\ndrum\ndrum something into someone\nflog\nflog yourself to death idiom\ninculcate\nlabour\nreaffirm\nrecap\nrehash\nreiteration\nrelay\nrepetitively\nrephrase\nrestate\nrestatement\nretell\nretread\nSee more results »\nIdiom\necho down/through the ages\necho noun [C]\n(SOUND)\nAdd to word list\nAdd to word list\na sound that is heard again after it has been reflected off a surface such as a wall or a cliff: The cave was filled with the echoes of our voices.\necho noun [C]\n(SIMILAR QUALITY)\na quality or other detail that is similar to and makes you remember something else: The son’s behavior is a clear echo of his father’s.\necho verb\n(MAKE SOUNDS)\n[ I ] to fill a place with repeating sounds, or to be filled with these sounds: The sound of footsteps echoed through the hall.\necho verb\n(REPEAT)\n[ T ] to express or think what someone else has said or thought: Brownell’s comments echoed the opinion of the majority of the commission members."}