{"id":135670,"name":"economical","type":"adjective","us_sound":"ˌiː.kəˈnɑː.mɪ.kəl","us_link":"../audio/e/economical.mp3","uk_sound":"ˌiː.kəˈnɒm.ɪ.kəl","uk_link":"../audio/e/ukecono003.mp3","content":"Add to word list\nAdd to word list\nB2 not using a lot of fuel, money, etc.: economical on There's increasing demand for cars that are more economical on fuel. What's the most economical way of heating this building?\nThesaurus: synonyms, antonyms, and examples\ncosting less money than expectedcheapThe meal was cheaper than I expected.affordableThere's very little affordable housing around here.inexpensiveThey sell inexpensive children's clothes.reasonableI thought the food was very reasonable.dirt cheapMost of the books they sell are dirt cheap.\nSee more results »\nMore examplesFewer examplesA big car like that is not very economical on fuel, is it?You should buy ordinary everyday foodstuffs in bulk - it's more economical.I had to buy a new washing machine as it would not have been economical to get it repaired.She's very economical with the wrapping paper, isn't she? She cut it without an inch to spare.This central heating system is extremely economical to run.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncompliment\ncostless\ndownmarket\neconomically\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBudgeting money\nGrammar\nEconomic or economical?Economic and economical are adjectives. …\nIdiom\neconomical with the truth\nAdd to word list\nAdd to word list\nnot using a lot of money, energy, etc.: With rents so high, it wasn’t economical to continue to live in the city.\nAdd to word list\nAdd to word list\nnot using a lot of fuel, money, space, etc.: What's the most economical way of heating this building? Most printer software lets you fit four pictures per sheet to make the most economical use of the space available. There's increasing demand for cars which are more economical on fuel. It's a shame this industry could not be a bit more economical with the costs."}