{"id":135669,"name":"economic","type":"adjective","us_sound":"ˌiː.kəˈnɑː.mɪk","us_link":"../audio/e/economic.mp3","uk_sound":"ˌiː.kəˈnɒm.ɪk","uk_link":"../audio/e/ukecono001.mp3","content":"economic adjective\n(COUNTRY'S ECONOMY)\nAdd to word list\nAdd to word list\nB2 [ before noun ] relating to trade, industry, or money: The country has been in a very poor economic state ever since the decline of its two major industries.economic policy The government's economic policies have led us into the worst recession in years. Synonyms\nfinancial\nmonetary\npecuniary formalCompare\nfiscal\nMore examplesFewer examplesI don't think we should expand our business in the current economic climate.People's voting habits are influenced by political, social, and economic factors.The country is in the midst of an economic crisis.On Wall Street today, the Dow Jones rose 55 points following good economic figures.Ministers are concerned by the low level of economic activity.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrenchment\nstagflation\nthe public purse\nSee more results »\neconomic adjective\n(MAKING A PROFIT)\nmaking a profit, or likely to make a profit: We had to close our London office - with the rent so high it just wasn't economic.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ndeficit\nlose\nlose your shirt idiom\nmargin\nmuck\nout-of-pocket\npi\npocket\nprofit from something\nprofit warning\nprofitability\nrake-off\ntrade surplus\nwinnings\nSee more results »\nGrammar\nEconomic or economical?Economic and economical are adjectives. …\nAdd to word list\nAdd to word list\nrelating to trade, industry, and money: economic growth/policies economically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌI·kəˈnɑm·ɪ·kli, ˌek·ə-/\nAdd to word list\nAdd to word list\nECONOMICS relating to trade, industry, and money: economic conditions/situation The plan also recognized the need to react to the challenging economic conditions facing football clubs around the world.economic boom/expansion/upswing Employers faced record-low unemployment levels during the economic boom.economic downturn/slowdown The government-subsidized corporation may run into trouble in an economic downturn.economic collapse/crisis/depression This legislation aims to pull the country out of economic crisis by giving tax breaks for companies to hire more workers.economic recovery/regeneration He was instrumental in providing the framework for post-war economic recovery. economic change/reformeconomic benefits/interests These laws serve to protect our long-range security and economic interests. economic data/figures/statistics economic factor/issue/problem economic equality/inequality/justice They discussed the consequences of the banking crisis for US economic policy. The Chancellor's chief economic adviser yesterday made what might be his last budget briefing to journalists. She warned this would lead to a decline in economic performance and poorer public services. Government-led investment in infrastructure and technology aims to boost individual consumption and economic competitiveness. Some consider the foundations of economic freedom to be personal choice, voluntary exchange, and open markets. We could put more pressure on the private sector to create more economic opportunities for minorities.\nCOMMERCE making a profit, or likely to make a profit: We had to close our London office - with the rent so high it just wasn't economic.\nNATURAL RESOURCES not using a lot of money, fuel, etc.: It's often more economic to buy office supplies in bulk. See also\neconomical"}