{"id":135668,"name":"economy","type":"noun","us_sound":"iˈkɑː.nə.mi","us_link":"../audio/e/economy.mp3","uk_sound":"iˈkɒn.ə.mi","uk_link":"../audio/e/ukecono008.mp3","content":"economy noun\n(SYSTEM)\nAdd to word list\nAdd to word list\nB2 [ C ] the system of trade and industry by which the wealth of a country is made and used: global economy Technology companies are driving the global economy. the German/US economythe state of the economy Investors remain cautious about the state of the economy.weak economy Tourism can help to boost a weak economy. strong economy A strong economy results in higher property prices. Tourism contributes millions of pounds to the local economy.\nMore examplesFewer examplesThe lowering of interest rates will give a much-needed boost to the economy.Ten years of incompetent government had brought about the virtual collapse of the country's economy.The government plans to cut taxes in order to stimulate the economy.Any decrease in tourism could have a serious effect on the local economy.Further increases in imports could destabilize the economy.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nrecession\nretrench\nstagflation\nthe public purse\nSee more results »\neconomy noun\n(SAVING MONEY)\n[ C or U ] the intentional saving of money or, less commonly, the saving of time, energy, words, etc.: make economies They've had to make economies since Nathan lost his job. This can be done by machines with more speed and economy. She writes with such economy - I've never known a writer say so much in so few words.\nSMART Vocabulary: related words and phrases\nBudgeting money\nbalance\nbudget\nbudgetary\ncouponing\ncut back\ncutback\ndefund\ndraw/pull in your horns idiom\neconomize\neconomy drive\neconomy-size\nmake ends meet idiom\non a shoestring idiom\npinch\npocket\nput/lay something on/to one side idiom\nsave (something) up\nsave on something\nset someone against someone\ntighten your belt idiom\nSee more results »\neconomy noun\n(SYSTEM)\nAdd to word list\nAdd to word list\n[ C ]\n&#160; social studies the system of trade and industry by which the wealth of a country or region is made and used: Tourism contributes millions of dollars to the region’s economy.\neconomy noun\n(SAVING MONEY)\n[ U ] the careful use and management of money or of time, energy, words, etc.: For the purpose of economy, you may prefer to use a cheaper cut of meat in this recipe.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; ECONOMICS the system of making money and producing and distributing goods and services within a country or region: On average, China accounts for almost half of the total export growth of East Asian economies. The property and construction industries are no longer as dominant in the economy as they used to be. India has one of the fastest-growing economies in the world.the global/national/local economy Political leaders expressed concern at the effect of increasing oil prices on the global economy. a booming/strong/robust economy a slowing/weak/stagnant economyan emerging/a developing/a developed economy Hong Kong, Singapore, South Korea, and Taiwan are often categorized as emerging economies.stimulate/boost/jump-start the economy New legislation has boosted the rural economy as well as supporting local communities.an economy grows/slows/recovers In the year to the second quarter of 2007, the UK economy grew by 3.1%. a knowledge-/service-/cash-based economya slowdown/downturn in the economy The Society of Motor Manufacturers and Traders said the decline in sales reflected the downturn in the economy.\n[ C or U ] the fact of not spending more money, using more resources, etc. than you need to: Many manufacturing processes have been outsourced to Eastern Europe for reasons of economy. Higher licence fees can tempt commercial organizations to make economies on service quality.\n[ U ]\n&#160; TRANSPORT →\neconomy class : Executives at the firm now fly economy, rather than club class.\na false economy\nsomething that seems to be a good way of saving money but is not: Going abroad without travel insurance is a false economy if you are ill and need costly medical treatment. See also\nthe black economy\nbubble economy\ncommand economy\ndual economy\nexchange economy\nexperience economy\nfree economy\nfuel economy\nthe global economy\nGoldilocks economy\nView all\ninformal economy\ninformation economy\nknowledge economy\nmanaged economy\nmarket economy\nmixed economy\nthe new economy\nparallel economy\nplanned economy\npolitical economy\nreal economy\nservice economy\nthe shadow economy\nsubsistence economy"}