{"id":135673,"name":"economics","type":"noun","us_sound":"ˌiː.kəˈnɑː.mɪks","us_link":"../audio/e/economics.mp3","uk_sound":"ˌiː.kəˈnɒm.ɪks","uk_link":"../audio/e/ukecono005.mp3","content":"Add to word list\nAdd to word list\nB1 the way in which trade, industry, or money is organized, or the study of this: Their ideas sound fine in principle, but they haven't worked out the economics behind the policies. She's in her third year of studying economics at York University.\nMore examplesFewer examplesI'm afraid my grasp of economics is rather limited.For the last decade she has acted as the president's economics guru.A graduate of law and economics from Moscow State University, he had spent his life in academia.Shelley is taking economics at university.Both their children graduated with degrees in economics.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nrecession\nretrench\nstagflation\nthe public purse\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies the scientific study of the system by which a country’s wealth is made and used\nAdd to word list\nAdd to word list\n[ U ]\n&#160; ECONOMICS the study of the way in which economies work, for example, the way in which they make money and produce and distribute goods and services: One of the laws of economics is that today's shortage is tomorrow's glut. He has a degree in economics. She's economics professor/professor of economics at the University of Berkeley. See also\napplied economics\nclassical economics\ndevelopment economics\nfinancial economics\nglobal economics\nindustrial economics\ninformation economics\nlabour economics\nmacroeconomics\nmathematical economics\nmicroeconomics\nsupply-side economics\nwelfare economics\n[ plural ]\n&#160; FINANCE business activities considered from a financial point of view, and whether or not products or services are likely to make a profit: Energy policy must be built on economics if it is to succeed. We are trying to change the economics of the digital business to let consumers benefit."}