{"id":135951,"name":"eddy","type":"verb","us_sound":"ˈed.i","us_link":"../audio/e/eddy.mp3","uk_sound":"ˈed.i","uk_link":"../audio/e/ukecono026.mp3","content":"Add to word list\nAdd to word list\nIf water, wind, smoke, etc. eddies, it moves fast in a circle: The water eddied around in a whirlpool. Synonyms\nswirl\nwhirl\n[ + adv/prep ] If a large group of people eddies somewhere, the people go there together while constantly moving around within their group: He joined the flood of students eddying toward the second-floor lockers. She watched the small groups of protesters eddy across the courtyard.\n[ + adv/prep ] to come and go in large quantities, without becoming firmly fixed: He is adept at placing Einstein in the stream of ideas and theories that eddied about in the intellectual currents of the day. But what is all this stuff that eddies in your head all the time?\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nrunoff\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRevolving, rotating and spinning\nTemporary\na fast, circular movement of water, wind, smoke, etc.: The bend in the river had caused an eddy of fast swirling water.\na situation in which a lot of things are happening or changing at one time: She was caught up in an eddy of social engagements. The swirling eddy of privacy concerns will be taken up by both House and Senate Commerce committees in the coming months.\nMore examplesFewer examplesThere is a passage between the islands and the shore filled with sunken rocks, which form violent eddies.They bicycled to a secluded spot among the willows where the water swirled into an eddy about four feet deep.If you put a particle in the middle of the light loop, it would be dragged around by gravitational force, much like the eddies created when you stir a spoon in a cup of coffee. The pictures showed that when the water reached a certain speed, it began to break into eddies, waves and cross-currents.\nSMART Vocabulary: related words and phrases\nFloods, tides & currents\natmospheric river\ndeluge\nflash flood\nflood\nfloodplain\ngyre\nhigh tide\nhigh water mark\ninundation\nlongshore drift\nlow tide\nlow-water mark\noverwhelm\ntidal\ntidally\ntide table\nturbulence\nturbulent\nwaterline\nwhelm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging frequently\nAdd to word list\nAdd to word list\n(of water, wind, smoke, etc.) to move fast in a circle: The water eddied ceaselessly in the wake of the boat. eddy noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈed·i/"}