{"id":135994,"name":"edge","type":"noun","us_sound":"edʒ","us_link":"../audio/e/edge.mp3","uk_sound":"edʒ","uk_link":"../audio/e/ukecono028.mp3","content":"edge noun\n(OUTER POINT)\nAdd to word list\nAdd to word list\nB1 [ C ] the outer or furthest point of something: edge of He put pink icing around the edge of the cake. They built the church on the edge of the village. A man was standing at the water's edge with a small boy. I caught (= hit) my leg on the edge of the table as I walked past. Synonyms\nbrink\nmargin (OUTER PART)\nperiphery\ndoeh/iStock / Getty Images Plus/GettyImages\nMore examplesFewer examplesKeep away from the edge of the cliff - you might fall.The alligators build their nests out of grass near the water's edge.The vase rolled off the edge of the table and smashed.Shred the lettuce and arrange it around the edge of the dish.I'd frayed the edges of my jeans as that was the fashion in those days.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\ntip\nSee more results »\nedge noun\n(BLADE)\nB2 [ C ] the side of a blade that cuts, or any sharp part of an object that could cut: Careful with that open can - it's got a very sharp edge.\nChanawat Phadwichit/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\ngimlet\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\npincer\nplunger\nprong\nrasp\nrazor knife\nreamer\nsander\ntrowel\nSee more results »\nedge noun\n(ALMOST)\n[ C usually singular ] the point just before something very different and noticeable happens: on the edge of The company is on the edge of collapse.bring something to the edge The government had brought the country to the edge of a catastrophe. push/drive someone over the edge informal\nIf an unpleasant event pushes someone over the edge, it makes them start to behave in a crazy way: She had been driven over the edge by the separation from her husband.\nSee more\nSMART Vocabulary: related words and phrases\nTurning points & deciding moments\nbe at a crossroads idiom\nbreakthrough\nbrink\nclimax\ncoming of age\ncrunch\nD-Day\ndefining moment\nflashpoint\nif/when it comes to the crunch idiom\nlandmark\nmake or break something idiom\npoint of no return\nred-letter day\nroad\nroad to Damascus idiom\nthe moment of truth idiom\nturning point\nU-turn\nwatershed\nSee more results »\nedge noun\n(ADVANTAGE)\nC2 [ S ] an advantage over other people: have the edge over In terms of experience, she definitely had the edge over the other people that we interviewed.\nSMART Vocabulary: related words and phrases\nAdvantage and disadvantage\nace\nan ace up your sleeve idiom\nattraction\nbe well in there idiom\nbe/stay/keep one jump ahead idiom\nhave the inside track idiom\nhave the odds/cards stacked against you idiom\nhead start\nhold all the cards idiom\nin\nleg\nlock\nmilk\nracing start\nsaving grace\nscent blood idiom\nsecret weapon\nsilver lining\nstick\nthe best of both worlds idiom\nSee more results »\nedge noun\n(ANGER/NERVOUSNESS)\n[ U ] a small but noticeable amount of anger in someone's voice: edge to/in There's a definite edge to/in her voice when she talks to her husband. on edge\nC2 nervous and not relaxed: Is something wrong? You seem a bit on edge this morning.\nSee more\nSMART Vocabulary: related words and phrases\nTalking angrily\nbite\nbite someone's head off idiom\nbite/snap someone's head off idiom\nblusteringly\ndress\ndress down\nfling\nharangue\nhue\nhuff\ninvective\njump\nmouth\npiece\nroasting\nspit\nspit blood/venom idiom\nstorm\ntongue-lashing\nupbraid\nSee more results »\nedge noun\n(CRICKET)\n[ C ]\n&#160; sports\n&#160; specialized in cricket, a hit of the ball with the edge of the bat: inside edge There were a couple of early inside edges.outside edge He got an outside edge and was caught at second slip.\nMore examplesFewer examplesHe survived what seemed an edge behind to bat with brilliance.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nIdioms\non the edge of your seat\ntake the edge off something\nedge verb\n(MOVE)\n[ I or T + adv/prep ] to move slowly with gradual movements or in gradual stages, or to make someone or something move in this way: edge its way A long line of traffic edged its way forward.edge up Inflation has edged up to five percent over the last two years. Synonym\ninch\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nworm\nSee more results »\nedge verb\n(WIN NARROWLY)\n[ I or T ] to win by a very small amount; to beat or move ahead of another person or team by a very small amount: Opinion polls showed him edging into a slight lead. Germany edged Australia 5-4. Both players gave a good performance but I think Nick just edged it.\nMore examplesFewer examplesKuwait edged ahead on goals scored in qualifying rounds.Argentina edged into a 1-point lead.The new Channel 4 show just edged in front of the BBC in the ratings.She edged her rival into second place.With the help of a bit of luck, we edged the game.\nSMART Vocabulary: related words and phrases\nWinning and defeating\nannihilate\nannihilation\nbank\nbe gunning for someone idiom\nbe one in the eye for someone idiom\nconvincing\nmoral victory\nmove/go in for the kill idiom\nnear thing\noutclass\noutcompete\nscrape\nsew\nslaughter\nstomp on someone/something\nsweep the board idiom\ntake someone down\ntake someone to the cleaner's idiom\ntake something apart\nthrash\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQualifications: school & vocational\nedge verb\n(CRICKET)\n[ T ] in cricket, to hit the ball with the edge of the bat: She edged the ball between the two slip fielders. He edged a catch behind off the final ball of the day.\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nglance\nlength\nmaiden\npavilion\nsix\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nedge verb\n(SKIING)\n[ T ] to turn a ski sideways so that one edge goes into the snow: Shaped skis have made it easier to turn and edge the skis with less effort. He's not getting low enough to use his centre of gravity to edge the ski.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice rink\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nPhrasal verb\nedge someone/something out\nedge noun\n(OUTER POINT)\nAdd to word list\nAdd to word list\n[ C ] the outer or farthest point of something: the edge of a cliff/table They walked down to the water’s edge. fig. Hitchcock’s films often kept moviegoers at the edge of their seats (= kept them eagerly interested).\nedge noun\n(LIMIT)\n[ C usually sing ] a point beyond which something unpleasant or very noticeable is likely to happen: It was reported that the company is on the edge of collapse. The loss of his job almost pushed him over the edge.\nedge noun\n(BLADE)\n[ C ] the side of a blade that cuts, or any sharp part of an object: Careful with that open can – it’s got a very sharp edge.\nedge noun\n(ADVANTAGE)\n[ U ] an advantage: Because of her experience she has the edge over the other applicants.\nedge noun\n(NERVOUS CONDITION)\non edge\nIf you are on edge, you are nervous and not relaxed: Carly seemed on edge while her family was away.\nedge verb [always + adv/prep]\n(MOVE)\nto move slowly with gradual movements or in gradual stages: [ T ] A long line of traffic edged its way forward. [ I ] Inflation has begun to edge up during the last six months.\nAdd to word list\nAdd to word list\na technical system that allows people to access large amounts of data on the internet at high speeds without using wires\nget/gain/have an edge (over/on sb/sth)\nto get or have an advantage in a particular situation: Internet banks may have the edge over their old-technology rivals when it comes to charges and rates, but they are not immune from complaints.\ngive sb an edge (over/on sb/sth)\nto give someone an advantage in a particular situation: A consortium of private-equity investors gave the group the edge in the competition to acquire MGM.\nlose your edge\nto no longer have an advantage that you used to have: Over the years, Germany to some extent lost its edge as a manufacturing base because of cheaper wages in Eastern Europe.\nbe on the edge of sth\nto nearly be in a particular situation, or to be close to achieving something: Scientists hope we are on the edge of a new and greener economy.\npush sb/sth over the edge\nto put someone or something into a difficult or dangerous situation: As the number of house repossessions and bankruptcies increases, those already struggling with debt could be pushed over the edge. See also\ncompetitive edge\ncutting-edge\nleading edge\nedge (sth) down/lower\nto get less or lower by a small amount, or to make something do this: Sales edged down from $1.775 billion to $1.772 billion in the fourth quarter.\nedge (sth) up/higher\nto increase by a small amount, or to make something do this: There is still some nervousness that US authorities might try to edge up interest rates to support the dollar after its recent falls. Phrasal verb\nedge sb/sth out"}