{"id":136072,"name":"edition","type":"noun","us_sound":"ɪˈdɪʃ.ən","us_link":"../audio/e/eus71438.mp3","uk_sound":"ɪˈdɪʃ.ən","uk_link":"../audio/e/ukedgil012.mp3","content":"Add to word list\nAdd to word list\nB2 a particular form in which a book, magazine, or newspaper is published: paperback/hardback edition The paperback/hardback edition of his book is published in July. The regional editions of the paper contain specific information for that area.\na single broadcast of a series of radio or television programmes: This morning's edition of 'Women's Hour' is at the earlier time of a quarter to ten.\nthe total number of copies of a particular book, newspaper, etc. that are published at the same time: first edition She collects first editions of 19th-century authors.\nUS one of a series of repeated events: The 77th edition of the Indianapolis 500 was held before an estimated 450,000 fans.\nMore examplesFewer examplesAll citations are taken from the 1973 edition of the text.The revised edition of the book includes many useful annotations.Teaching posts are advertised in Tuesday's edition of the paper.Tomorrow's edition will include a centre-spread on the Spanish royal family.I've only read the abridged edition of her novel.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncomic\neditorial\nfold\nhouse journal\nhouse organ\njournal\nlad mag\nmagazine\norgan\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\ntabloid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\nBroadcasting in general\nPublishing: printing & word processing\nEvents and occurrences\nAdd to word list\nAdd to word list\nwriting a particular form in which a book, magazine, or newspaper is published, or the total number of copies of a book, magazine, or newspaper that are published at the same time: a regional edition of a newspaper The book comes in both paperback and hardback editions.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a newspaper, magazine, or book published in a particular form or on a particular date: today's/yesterday's/this week's, etc. edition The piece was published in yesterday's edition of the Financial Times. the current/latest edition a paperback/online/print edition See also\nlimited edition"}