{"id":136075,"name":"editorial","type":"adjective","us_sound":"ˌed.əˈtɔːr.i.əl","us_link":"../audio/e/editorial.mp3","uk_sound":"ˌed.ɪˈtɔː.ri.əl","uk_link":"../audio/e/ukedgil014.mp3","content":"Add to word list\nAdd to word list\nrelating to the editor (= the person in charge) or editors of a newspaper, magazine, television programme, etc. and to the power to decide what is published or shown in it: editorial independence The newspaper's staff insisted on complete editorial independence from its owners.editorial decision Editorial decisions on the show are made by senior news editors.\nrelating to someone who writes, corrects, or changes pieces of text to be published, or their work: editorial content There are more ads on the page than editorial content.editorial staff They increased the budget so they could hire more editorial staff. Many jobs in publishing are marketing jobs rather than editorial.\nMore examplesFewer examplesShe has complete creative and editorial control of the series.This is the view of the editorial board of the Wall Street Journal.Broadcasting a 40-day live event is a major test for both our technical and our editorial teams.She worked as an editorial assistant for a UK-based publisher.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines\nabove/below the fold idiom\nannal\nanti-press\nback copy\nbroadsheet\ncirculation\ncomic\nfold\nglossy magazine\nhouse journal\nhouse organ\njournal\nlad mag\norgan\nrag\nreader\nsentinel\nserialize\nSunday paper\nsupermarket tabloid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEditing & compiling\nan article in a newspaper that expresses the editor's (= the person in charge of the newspaper's) opinion on a subject of particular interest at the present time: All the papers deal with the same subject in their editorials. The Times and The Observer published editorials criticizing the minister. Synonyms\nleader (NEWSPAPER) UK\nleading article UKCompare\ncolumn\nop-ed noun US\nMore examplesFewer examplesSeveral newspapers ran angry editorials denouncing the move.A leading conservative journal printed an editorial headlined \"Pardon Him\".\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony aunt\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\nleader\nmasthead\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\nsplash\nspread\nSee more results »\nAdd to word list\nAdd to word list\na statement in a newspaper or magazine, or on radio or television, that expresses the opinion of the editors or owners on a subject of particular interest: an editorial on the new tax proposal\nrelating to editors or editing: an editorial staff He insisted that it was an editorial decision to cut the story."}