{"id":136129,"name":"education","type":"noun","us_sound":"ˌedʒ.əˈkeɪ.ʃən","us_link":"../audio/e/eus75651.mp3","uk_sound":"ˌedʒ.ʊˈkeɪ.ʃən","uk_link":"../audio/e/ukedgil018.mp3","content":"Add to word list\nAdd to word list\nB1 the process of teaching or learning, especially in a school or college, or the knowledge that you get from this: receive an education As a child he received most of his education at home. It's a country that places great importance on education. She lectures in education (= the study of education) at the teacher training college. It's important for children to get a good education.\nMore examplesFewer examplesI'm very fortunate to have had such a good education.They had a difference of opinion about their child's education.It's a disgrace that the government spends so much on guns and so little on education.Most children in the UK remain in full-time education until they are at least 16 years old.A college education is often the best route to a good job.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\nhothouse\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocializing\nspecial education\nSRE\nsynchronous\ntutelage\nSee more results »\nAdd to word list\nAdd to word list\nthe process of teaching or learning in a school, or the knowledge that you get from this: a high school/college education\nEducation is also the study of methods and theories of teaching: She has a master’s degree in early childhood education.\nAdd to word list\nAdd to word list\nthe process of teaching and learning, or the organizations such as schools where this process happens: Investment in education is crucial to ensure that the workforce is equipped for the information economy. We see corporations increasingly active in the takeover of formerly public services, such as energy, transport, healthcare, or education. She is director of education and training at a City law firm."}