{"id":136248,"name":"effective","type":"adjective","us_sound":"əˈfek.tɪv","us_link":"../audio/e/eus71443.mp3","uk_sound":"ɪˈfek.tɪv","uk_link":"../audio/e/ukeeril006.mp3","content":"effective adjective\n(SUCCESSFUL)\nAdd to word list\nAdd to word list\nB2 successful or achieving the results that you want: The lighting for the production made a very effective use of shadow. She's a very effective teacher. This style of decoration is simple yet effective. Opposite\nineffective\nThesaurus: synonyms, antonyms, and examples\nachieving the results that are hoped forsuccessfulThe operation was successful, and the tumour was removed.effectiveThis cream is one of the most effective acne treatments you can find.efficaciousDetractors claim the new law won't be any more efficacious than current legislation is. productiveWe had a productive conversation, and he's back on track now.\nSee more results »\nmedical\n&#160; specialized (used about a treatment or drug) working well when used by people in general, as opposed to only under carefully controlled scientific testing conditions: How effective a drug is depends on many factors, including how consistently the patient follows the instructions for taking it. It's an extremely effective cure for a headache. Compare\nefficacious specialized\nMore examplesFewer examplesYoga is a very effective technique for combating stress.I've never found screaming and shouting at my staff to be very effective.This tiny capsule contains two types of effective painkilling ingredients.If the law is to be effective it must be applied fairly.\nSMART Vocabulary: related words and phrases\nEfficient and effective\nbe firing on all cylinders idiom\nbusinesslike\nclockwork\ncome together\ncut through something\ndeveloped\ndispatch\nergonomic\nergonomically\nergonomics\nhigh-functioning\nhyper-efficient\npunch\nseamlessly\nsmoothly\nsnappily\nsnappy\nsuper-effective\nworkable\nworth your salt idiom\nSee more results »\neffective adjective\n(IN FACT)\n[ before noun ] in fact, although not officially: Although she's not officially our boss, she's in effective control of the office.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalsely\nfantastical\nfever dream\nfictional\nfictionality\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\neffective adjective\n(IN USE)\nIf a law or rule becomes effective, it starts to be used: The new laws will become effective next month.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\ncolour\nconflict\near\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\njerk\npen\nrail\nspill\nspill over\nsportswashing\nstart (something) off\ntalismanic\nSee more results »\nRelated word\neffectivenessGrammar\nEfficient or effective?Efficient and effective are adjectives. …\neffective adjective\n(PRODUCING RESULTS)\nAdd to word list\nAdd to word list\nproducing the intended results, or (of a person) skilled or able to do something well: an effective policy/strategy We’ve found that giving away samples of our product is the most effective way to promote it. She’s an effective administrator and knows how to get things done.\neffective adjective\n(IN USE)\n(of rules or laws) in official or legal use: The law becomes effective next month.\nAdd to word list\nAdd to word list\nsuccessful in achieving the result that you want: You need a workable, effective strategy for developing your business. Personal charisma alone does not make someone an effective leader. The consumer council must have clear duties and strong powers if it is to be effective.\nhaving started to operate or be used: The new Investment Management Agreements became effective on 1st November. He announced his resignation, effective immediately.\n[ before noun ] used to describe what is actually true, although it may not be intended or stated: The remainder of the stock is owned by a consortium of banks which are in effective control of the hotel. See also\ncost-effective"}