{"id":136249,"name":"effectively","type":"adverb","us_sound":"əˈfek.tɪv.li","us_link":"../audio/e/effectively.mp3","uk_sound":"ɪˈfek.tɪv.li","uk_link":"../audio/e/ukeeril007.mp3","content":"Add to word list\nAdd to word list\nB2 in a way that is successful and achieves what you want: The tablets work more effectively if you take a hot drink after them.\nC2 used when you describe what the real result of a situation is: His wife left him when the children were small, so he effectively brought up the family himself. Effectively, we have to start again from scratch.\nMore examplesFewer examplesThe department needs three more computers in order to work most effectively.The older drugs didn't deal effectively with the malaria parasite.The troops had camouflaged themselves so effectively that the enemy didn't notice them approaching.She demonstrated the software very effectively.He might have to resign or he might be demoted, but either way, his career is effectively over.\nSMART Vocabulary: related words and phrases\nEfficient and effective\nbe firing on all cylinders idiom\nbusinesslike\nclockwork\ncome together\ncut through something\ndeveloped\ndispatch\nergonomic\nergonomically\nergonomics\nhigh-functioning\nhyper-efficient\npunch\nseamlessly\nsmoothly\nsnappily\nsnappy\nsuper-effective\nworkable\nworth your salt idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrue, real, false, and unreal\nAdd to word list\nAdd to word list\nin a way that is successful and produces the intended results: Though barely winning election, he governed effectively and was reelected.\nEffectively also means having as a certain result in reality, though not in theory: If she loses this match, she’s effectively eliminated from the tournament.\nAdd to word list\nAdd to word list\nin a way that successfully achieves the result that you want: Staff must be given enough training and development to be able to do their jobs effectively.\nused when you are describing what is actually true, although it may not be intended or stated: Whoever owns those shares, effectively controls the company. See also\ncost-effectively"}