{"id":136241,"name":"effect","type":"noun","us_sound":"əˈfekt","us_link":"../audio/e/eus71442.mp3","uk_sound":"ɪˈfekt","uk_link":"../audio/e/ukeeril005.mp3","content":"effect noun\n(RESULT)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the result of a particular influence: effect on/upon The radiation leak has had a disastrous effect on/upon the environment. I tried taking tablets for the headache but they didn't have any effect. I think I'm suffering from the effects of too little sleep.to good effect She has a lot of confidence, which she uses to good effect (= to her advantage) in interviews. See also\naftereffect\nThesaurus: synonyms, antonyms, and examples\nthe result of somethingresultHis firing was a direct result of his refusal to follow the employment policies.effectThe radiation leak has had a disastrous effect on the environment.consequenceFailure to do proper safety checks may have serious consequences.outcomeIt's too early to predict the outcome of the meeting.upshotThe upshot of the discussions is that there will be no further redundancies.end resultThe end result of these changes should be a more efficient system for dealing with complaints.\nSee more results »\ntake effect\nC1 to produce or achieve the results you want: They had to wait ten minutes for the anaesthetic to take effect before they stitched up the cut.\nSee more for effect\nIf you say or do something for effect, you intentionally do it to shock people or attract their attention: I get the impression that she uses bad language in meetings for effect.\nSee more in effect\nC2 in fact, or in practice: So in effect the government have lowered taxes for the rich and raised them for the poor.\nSee more to that effect (also to the effect that)\nused to express that what you are reporting is only a short and general form of what was really said: words to that effect She said she was unhappy, or words to that effect.\nSee more\nMore examplesFewer examplesHer words had a soothing effect.This drug may have the effect of speeding up your heart rate.I worry about the effect that violent movies may have on children.Certain chemicals have been banned because of their damaging effect on the environment.It's important to protect your skin from the harmful effects of the sun.\nSMART Vocabulary: related words and phrases\nOutcomes and consequences\nadverse effect\nadversely affected\naftereffect\naftermath\nage\ncorollary\nend result\nfallout\nfirst fruit\nimplication\nin\nirony\nramification\nrepercussion\nresultant\nresultantly\nresulting\nsequel\nside effect\néclat\nSee more results »\neffect noun\n(USE)\nC2 [ U ] use: in effect The present system of payment will remain in effect (= be used) until the end of the rental agreement.come into effect When do the new driving laws come into effect?take effect The new salary increases will take effect (= begin) from January onwards.\nMore examplesFewer examplesTheir movements have been severely limited since the laws came into effect.Measures to reduce crime have yet to be put into effect.The new law will come into effect early next year.The new rates came into effect from January.It remains to be seen whether the government will bring these recommendations into effect.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\neffect noun\n(THEATRE, ETC.)\neffects [ plural ] (also special effects)\nB1 lighting, sounds, and objects that are specially produced for the stage or a film and are intended to make something that does not exist seem real: This is a movie worth seeing for its effects alone.\nSee more\neffect noun\n(POSSESSIONS)\neffects [ plural ]\n&#160; law\n&#160; specialized\na person's possessions, especially after their death: personal effects It says on the form that the insurance covers all personal effects.\nSee more Grammar\nAffect or effect?Affect is a verb meaning ‘influence or cause someone or something to change’: …\nto achieve something and cause it to happen: As a political party they are trying to effect a change in the way that we think about our environment.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nGrammar\nAffect or effect?Affect is a verb meaning ‘influence or cause someone or something to change’: …\neffect noun\n(RESULT)\nAdd to word list\nAdd to word list\n[ C/U ] the result of a particular influence; something that happens because of something else: [ C ] The medicine had the effect of making me sleepy. [ C ] Cold water slows hurricane growth, but warm water has the opposite effect. [ U ] The new management actually has not had much effect on us.\neffect noun\n(USE)\n[ U ] (esp. of rules or laws) official or legal use: Winter parking rules are in effect (= must be obeyed) . All salary increases will take effect (= begin) in January.\neffect verb [T]\n(ACHIEVE)\nto achieve something and cause it to happen: It will take years to effect meaningful changes in the educational system.\nAdd to word list\nAdd to word list\nthe result of a particular influence: have/produce an effect Anti-inflationary measures do not yet seem to be having any effect. effect of sth (on sth) The effect of the redundancies on morale has been extremely damaging.see/feel/suffer the effects of sth Businesses are already feeling the effects of the new charges.an adverse/negative/detrimental effect The slowdown will have a detrimental effect on earnings in the short term. a significant/profound/dramatic effect reduce/minimize the effects The problem is, how to deal with the demand for more and better goods while minimizing the effect on the environment. They questioned whether financial liberalization had had the desired effect (= had done what it was intended to do).\nbe in effect\nto be active or being used: At that time a total ban on financial transactions was in effect.\ncome into effect (also take effect)\nto start working or being used: On April 1 new sales taxes will come into effect. The new credit regulations will take effect next year.\nin effect\nin fact, or in practice: The ruling meant that, in effect, the company was allowed to continue to do business as usual.\nput/bring sth into effect\nto start using something or making it work: The aim is to develop new management strategies and put them into effect.\nwith immediate effect/with effect from\nused to describe a change that happens immediately or from a particular date: She was appointed chief executive with immediate effect. The company has announced the appointment of 13 new partners, with effect from 1 July 2012.\neffects\n[ plural ]\n&#160; LAW a person's possessions: After his death, an inventory was taken of his effects. Company relocation policies may cover the cost of insuring personal effects in transit. See also\ncause and effect diagram\ncurrency effect\ndemonstration effect\nthe domino effect\nhalo effect\nthe Hawthorne effect\nincome effect\nprice effect\nripple effect\nsubstitution effect\nView all\nthreshold effect\nwealth effect\nto cause something to happen: The transfer of a business is governed or effected by the law of the country in which the business is situated."}