{"id":136317,"name":"efficiency","type":"noun","us_sound":"ɪˈfɪʃ.ən.si","us_link":"../audio/e/eus71449.mp3","uk_sound":"ɪˈfɪʃ.ən.si","uk_link":"../audio/e/ukeeril021.mp3","content":"Add to word list\nAdd to word list\n[ U ] the quality of achieving the largest amount of useful work using as little energy, fuel, effort, etc. as possible: Families and business need to take steps to maximize energy efficiency. Streamlining cars increases their fuel efficiency. The design of the solar panels is inspired by the efficiency with which plants convert sunlight into sugar. The company says it wants to improve working conditions, increase efficiency, and generally make the more profitable.\nB2 [ U ] the quality of working well in an organized way, without wasting time or energy: She gets through her work with speed and efficiency. What is so impressive about their society is the efficiency of the public services.\n[ C ] something that is done to avoid wasting time, energy, or money: The report has come up with more potential savings from government efficiencies. The difficult economic climate has forced us to look for efficiencies.\n[ U ]\n&#160; physics\n&#160; specialized the relationship between the amount of energy put into a machine or process, and the amount of useful work that it produces: The efficiency of cardiac muscle (the ratio of useful work done to fuel energy burned) is 10% to 15%.\n[ C ] US an\nefficiency apartment\nMore examplesFewer examplesTo meet LEED standards, buildings must show energy efficiency, water savings, use of green materials, and more.These new hybrid engines show big efficiency gains.The program is not a model of efficiency because of the 6:1 student-to-teacher ratio.Ships from eight navies will be taking part in an exercise in the Pacific to improve their efficiency in combat.A merger would enable the company to reap the efficiencies of combining operations.They could save $159 million in suggested cuts and efficiencies.\nSMART Vocabulary: related words and phrases\nEfficient and effective\nbe firing on all cylinders idiom\nbusinesslike\nclockwork\ncome together\ncut through something\ndeveloped\ndispatch\nergonomic\nergonomically\nergonomics\nhigh-functioning\nhyper-efficient\npunch\nseamlessly\nsmoothly\nsnappily\nsnappy\nsuper-effective\nworkable\nworth your salt idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvironmental issues\nBudgeting money\nUsing and misusing\nHouses & homes\nRelated word\nefficient\nAdd to word list\nAdd to word list\nthe condition or fact of producing the results you want without waste, or a particular way in which this is done: [ U ] The use of high-speed machinery improved the efficiency of the factory. [ C usually pl ] They reduced costs through production efficiencies.\nAdd to word list\nAdd to word list\n[ U ] a situation in which a person, company, factory, etc. uses resources such as time, materials, or labour well, without wasting any: The company is looking to shed around 1,000 jobs as part of an efficiency drive. business/economic/operational efficiencyachieve/boost/improve efficiency The company invested substantial amounts of money upgrading the plant, and its workers agreed to flexible work rules that boosted efficiency. improved/increased/greater efficiency efficiency gains/improvements/savings\n[ U ] a situation in which a person, system, or machine works well and quickly: improve/increase/maximize efficiency We are looking at ways to increase the efficiency of our advertising. She does the job with great efficiency.\n[ C or U ]\n&#160; PRODUCTION the difference between the amount of energy that is put into a machine in the form of fuel, effort, etc., and the amount that comes out of it: Burning wood on an open fire has efficiencies of only 15-20% compared to wood burning stoves, chip and pellet boilers with efficiencies of up to 80-90% .\nefficiencies\n[ plural ] ways of wasting less time, money, labour, etc.: With the reorganisation, the company is aiming to achieve efficiencies in both production and marketing. Compare\ninefficiencySee also\ncost efficiency\nenergy efficiency\nfuel efficiency\nindustrial efficiency\nmarket efficiency\ntechnical efficiency\nx-efficiency"}