{"id":136410,"name":"effusion","type":"noun","us_sound":"ɪˈfjuː.ʒən","us_link":"../audio/e/useeg__019.mp3","uk_sound":"ɪˈfjuː.ʒən","uk_link":"../audio/e/ukeffor003.mp3","content":"Add to word list\nAdd to word list\n[ C usually singular ] literary a sudden and uncontrolled expression of strong emotion: effusion of They were welcomed with effusions of joy wherever they went.effusion of The effusion of patriotic expression after the Sept. 11 attacks cut across class lines.\nMore examplesFewer examplesHis latest effusion is as pleasant as a painted tin of shortbread and as comfy as an elasticated waistband.Each girl felt guilty of a maudlin effusion of sentiment.The cleverness of his writing deflates amid his effusions of feeling.\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfit to burst idiom\nflamingly\nfulminating\ngrip\nheart-stopping\npungently\nquiveringly\nrabid\nrabidly\nreinforced\nrhapsodic\nsearing\ntingle\ntorrid\nvirulent\nSee more results »\n[ C or U ]\n&#160; medical\n&#160; specialized an occasion when liquid escapes inside the body, or the fact of this happening: She had anaemia and a small pericardial effusion. Middle ear effusion was not considered a treatment failure.pleural effusion Pleural effusions present a challenge for both diagnosis and treatment.\nMore examplesFewer examplesOn the back part of the head there was an effusion of blood beneath the skull.Treatment measures are aimed at facilitating drainage of the effusion.Pericardial effusions are common, but they tend to be relatively small and do not cause significant hemodynamic problems.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nAdd to word list\nAdd to word list\nchemistry a flow of a gas through a small hole in a container"}