{"id":136462,"name":"egg","type":"noun","us_sound":"eɡ","us_link":"../audio/e/egg.mp3","uk_sound":"eɡ","uk_link":"../audio/e/ukeffor009.mp3","content":"egg noun\n(FOOD)\nAdd to word list\nAdd to word list\nA1 [ C or U ] the oval object with a hard shell that is produced by female birds, especially chickens, eaten as food: a hard-boiled/soft-boiled egg How do you like your eggs - fried or boiled?\nstockcam/E+/GettyImages\n[ C ] an object that is made in the shape of a bird's egg: a chocolate/marble egg\nMore examplesFewer examplesMix the butter with the sugar and then add the egg.Crack three eggs into a bowl and mix them together.Could you get me half a dozen eggs when you go to the shop?We had bacon and eggs for breakfast.I like eggs lightly cooked so that the yolk is still runny.\nSMART Vocabulary: related words and phrases\nDairy products & eggs\nalbumen\nbeurre noisette\nbrown butter\nbutter\nbutterfat\ncurd\ndairy\nDevonshire cream\ndouble cream\ndried milk\nlacteal\nlactic\nlight cream\nmilk fat\nmylk\nsour cream\nsoya milk\nsunny side up idiom\nUHT\nultra-pasteurized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpherical, circular and annular objects\negg noun\n(REPRODUCTION)\nB2 [ C ] an oval object, often with a hard shell, that is produced by female birds and particular reptiles and insects, and contains a baby animal that comes out when it is developed: lay an egg The cuckoo lays her egg in another bird's nest. After fourteen days the eggs hatch.\n[ C ] a cell produced by a woman or female animal from which a baby can develop if it combines with a male sex cell: Identical twins develop from a single fertilized egg that then splits into two.\nMore examplesFewer examplesOnce an egg is fertilized by the sperm, it becomes an embryo.An attempt to implant an embryo using an egg from an anonymous woman donor was unsuccessful.Genes determine how we develop from the moment the sperm fuses with the egg.A blackbird's egg is blue with brown speckles on it.In human reproduction, one female egg is usually fertilized by one sperm.\nSMART Vocabulary: related words and phrases\nAnimal reproduction\nandrogen\nanti-oestrogen\nasexual reproduction\nasexuality\nasexually\nbarrenness\ncalve\nfertile\nfetal\nimpregnate\nnonreproductive\noestrogen\nout-reproduce\npanmictic\npanmixia\nprocreation\nsemen\nspawn\nsterile\nzygote\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe development & parts of insects\nObstetrics: processes & stages connected with sexual reproduction\negg noun\n(SPORT )\nin ice hockey, a score of 0–0 at the end of a game, meaning that neither team has scored a goal: Our first game was an egg - neither team took many good shots. See also\ngoose egg\nSMART Vocabulary: related words and phrases\nHockey\nbiscuit\nblocker\nbroomball\ncarry\ncooler\neleven\nfive-hole\ngoaltender\nhockey\nlight the lamp idiom\nmajor penalty\nminor penalty\npenalty box\npipe\nquad hockey\nrhombus\nringette\nstick\nstreet hockey\ntarget man\nSee more results »\nIdioms\nhave egg on your face\nlay an egg\nput all your eggs in one basket\nwalk on eggs\negg noun [C]\n(REPRODUCTION)\nAdd to word list\nAdd to word list\nbiology an oval, rounded object with a hard shell produced by female birds and particular female reptiles, from which a baby animal is born when it is developed\nbiology An egg is also a cell produced by a woman or female animal from which a baby might develop if it combines with sperm from a male.\negg noun [C]\n(FOOD)\nthe oval or rounded object with a hard shell that is produced by chickens, collected before a baby bird can develop within it, and used as food: The recipe calls for four eggs and a pint of milk. I’d like two scrambled eggs with bacon, please. Idiom\nhave egg on your face"}