{"id":136868,"name":"either","type":"adverb","us_sound":"ˈiː.ðɚ","us_link":"../audio/e/either.mp3","uk_sound":"ˈaɪ.ðər","uk_link":"../audio/e/ukeight008.mp3","content":"Add to word list\nAdd to word list\nB1 used in negative sentences instead of \"also\" or \"too\": I don't eat meat and my husband doesn't either. \"I've never been to the States.\" \"I haven't either.\" They do really good food at that restaurant and it's not very expensive either.\nMore examplesFewer examplesI've never been here before either, so it's all strange to me too.We certainly don't lead a life of luxury but we're not poor either.\"And the dress that you bought me doesn't fit either!\" she shouted as she walked off.Actually I'm pleased you don't want to go, because I don't either.I'm not allowed another piece of cake, so you're not either!\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nGrammar\nEitherEither is a determiner, a pronoun, an adverb or a conjunction. …\nEither as a determinerWe can use either as a determiner before a noun to talk about two choices or possibilities. The noun that follows either must be a singular countable noun: …\nEither as a pronounWe can use either as a pronoun: …\nEither as an adverbWe can use either as an adverb after a negative verb: …\nEither as a conjunctionWe can use either with or as a conjunction to connect two clauses: …\nB1 used when referring to a choice between two possibilities: Either candidate would be ideal for the job. \"Do you prefer pork or beef?\" \"I don't like either.\" \"Would you like the metal or plastic one?\" \"Either will do.\"either way/in either case You can get there by train or bus - either way/in either case it'll take an hour.either… or We can either eat now or after the show - it's up to you. Either you leave now or I call the police!\nMore examplesFewer examplesYou can move the cursor either by using the mouse or by using the arrow keys on the keyboard.She either loves you or hates you - it's all or nothing with her.We got caught in pouring rain without either raincoats or umbrellas.He's either a hero or a villain, depending on your point of view.It's either Spanish or Portuguese that she speaks, but I've forgotten which.\nSMART Vocabulary: related words and phrases\nEither, or, neither, nor\nand\nand/or phrase\nelse\nneither\nnor\nor\nor else idiom\notherwise\nGrammar\nEitherEither is a determiner, a pronoun, an adverb or a conjunction. …\nEither as a determinerWe can use either as a determiner before a noun to talk about two choices or possibilities. The noun that follows either must be a singular countable noun: …\nEither as a pronounWe can use either as a pronoun: …\nEither as an adverbWe can use either as an adverb after a negative verb: …\nEither as a conjunctionWe can use either with or as a conjunction to connect two clauses: …\nEither … or…Either… or… connects two choices: …\nB2 both: Unfortunately I was sitting at the table with smokers on either side of me.\nMore examplesFewer examplesWe have students living on either side of us.I had children on either side of me.Company directors were seated on either side of me so I was on best behaviour.I was lucky because I had friends sitting on either side of me on the plane.We have family living on either side of us.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neach\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nto\nwhole\nGrammar\nEitherEither is a determiner, a pronoun, an adverb or a conjunction. …\nEither as a determinerWe can use either as a determiner before a noun to talk about two choices or possibilities. The noun that follows either must be a singular countable noun: …\nEither as a pronounWe can use either as a pronoun: …\nEither as an adverbWe can use either as an adverb after a negative verb: …\nEither as a conjunctionWe can use either with or as a conjunction to connect two clauses: …\nEither … or…Either… or… connects two choices: …\neither adverb [not gradable]\n(ALSO)\nAdd to word list\nAdd to word list\nused in negatives instead of also or too: The restaurant has good food, and it’s not expensive either.\neither adjective, pronoun, conjunction\n(CHOICE)\none or the other of two: Either person would be fine for the job. You can go by train or bus – either way it’ll take an hour. I left it either at home or in the car.\nYou can also use either to mean both: Friends sat on either side of me on the plane."}