{"id":136882,"name":"eject","type":"verb","us_sound":"iˈdʒekt","us_link":"../audio/e/eject.mp3","uk_sound":"iˈdʒekt","uk_link":"../audio/e/ukeight011.mp3","content":"Add to word list\nAdd to word list\n[ T often passive ] to push, throw, or force something out of a place : Small splatters of molten lava were ejected from the crater. When X-rays are absorbed by matter, electrons are ejected from the atoms of which it is composed.\n[ I or T ] to come out of a machine when a button is pressed, or to make something do this: How do you eject the tape? The coffee machine suddenly ejected a handful of coins.\n[ I ] to leave an aircraft in an emergency using an ejection seat (= a seat that can throw out the pilot or another person in an aircraft if they suddenly have to leave it because they are in danger): The pilot had to eject from his burning plane.\n[ T often passive ] to force someone to leave a particular place: be ejected from A number of fans had been ejected from the bar for causing trouble.\n[ T ] US (UK send off) to order a sports player to leave the playing area during a game because they have broken a rule Related word\nejector\nSMART Vocabulary: related words and phrases\nEmitting and ejecting\ndischarge\ndisplace\ndisplaced\ndisplacement\nejection\nejector\nemanate\nemission\nemitter\nexpel\nexpulsion\nexude\ngive something off\npuff\nre-emit\nsend\nsend something out\nshed\nshedding\ntoss\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBoarding and alighting from modes of transport\nIdiom\npress the eject button\nAdd to word list\nAdd to word list\nto force someone to leave a particular place, or to send out something quickly and often with force: It was difficult to eject squatters from the abandoned building.\nA player who is ejected during a game is told to leave the playing area by the referee because the player has done something wrong: Very seldom do you see any player get ejected from a playoff game in football and baseball."}