{"id":137042,"name":"elastic","type":"adjective","us_sound":"iˈlæs.tɪk","us_link":"../audio/e/elastic.mp3","uk_sound":"iˈlæs.tɪk","uk_link":"../audio/e/ukeight022.mp3","content":"Add to word list\nAdd to word list\nAn elastic material is able to stretch and be returned to its original shape or size: A lot of sportswear is made of very elastic material.\nable or likely to be changed: The project has only just started so any plans are still very elastic. In this country, time is an elastic concept.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nflowing\nfullness\njointed\nlimply\nlimpness\nloose-fitting\npliantly\nrelax\nrubbery\nsemi-flexible\nslacken\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\na type of rubber that is able to stretch and be returned to its original shape or size: His trousers were held up with a piece of elastic. See also\nelastic band UK\nSMART Vocabulary: related words and phrases\nPlastics & rubber\nBakelite\nbioplastic\nBubble Wrap\nCellophane\ncelluloid\nlatex\nLucite\nmelamine\nmicrobeads\nmicroplastics\npolypropylene\npolystyrene\npolythene\npolyurethane\npolyvinyl chloride\nthermosetting\nuPVC\nvinyl\nvulcanization\nvulcanized\nSee more results »\nAdd to word list\nAdd to word list\n(of a material) able to stretch and be returned to its original shape or size: She bunched her ponytail and slipped on an elastic hair band.\nIf something that is not a physical object is elastic, it is able or likely to be changed: Our plans are still very elastic.\nAdd to word list\nAdd to word list\nECONOMICS relating to a situation in which the number of products sold changes in relation to the product's price: We're seeing the elastic effect of lower component prices encouraging demand for PCs. Your problem is that you are in an exceptionally elastic market and your prices are simply not the lowest. Luxury goods are price elastic.\nable to change when conditions change: International law must be elastic enough to meet new conditions created by change and progress in the world."}