{"id":137178,"name":"elective","type":"adjective","us_sound":"iˈlek.tɪv","us_link":"../audio/e/eus71466.mp3","uk_sound":"iˈlek.tɪv","uk_link":"../audio/e/ukelder009.mp3","content":"elective adjective\n(MEDICAL)\nAdd to word list\nAdd to word list\n(of a medical treatment) done at a time chosen by the patient, rather than needed urgently: elective surgery Medication should be stopped two days before elective surgery. This procedure was elective and non-urgent. She had her first child by an elective Caesarean section.\nMore examplesFewer examplesLaser eye treatment quickly became the most popular elective surgery in the country.While some elective surgeries were postponed, emergency and outpatient treatment continued as normal.She had recurrent tonsillitis and was admitted for an elective tonsillectomy.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nhave something out\nimplantable\nimplantation\nincision\ninteroperative\nintraoperative\nlaughing gas\nliposuction\nresected\nresection\nrhino\nrhinoplasty\nsex change\ntransfusion\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: general words\nelective adjective\n(VOTING)\nAn elective position or system is one that involves people voting: elective office I am considering seeking elective office as a way to bring about change. At the beginning of the twelfth century, elective monarchy gradually gave way to hereditary monarchy in Europe.\nMore examplesFewer examplesThe British political party introduced rules requiring that 50% of elective offices be held by women.He referred to the country as \"an elective dictatorship\".His decision to retire from elective politics was not surprising.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nexit poll\nfirst-past-the-post\nflip\nfranchise\ngeneral election\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\na subject that someone chooses to study, in addition to the subjects that they have to study: During the MBA you will choose ten to twelve electives from a large and varied portfolio.\nMore examplesFewer examplesStudents are strongly encouraged to take two years of a foreign language, and can then choose from eight other electives.You can take my sociology class as an elective next year.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngraduate\nhall\nhall of residence\nhonor society\nOxon\nPanhellenic\npass degree\npoly\npolytechnic\nthe groves of academe idiom\nuniversity\nunselective\nvice chancellor\nwarden\nwardenship\nSee more results »\nAdd to word list\nAdd to word list\nchosen or decided by voting: an elective office\nElective also means chosen but not necessary: elective surgery"}