{"id":137463,"name":"electronics","type":"noun","us_sound":"iˌlekˈtrɑː.nɪks","us_link":"../audio/e/electronics.mp3","uk_sound":"ˌel.ekˈtrɒn.ɪks","uk_link":"../audio/e/ukelect005.mp3","content":"Add to word list\nAdd to word list\nB2 the scientific study of electric current and the technology that uses it: a degree in electronics the electronics industry\nMore examplesFewer examplesIn the electronics industry, for instance, 5000 jobs are being lost.Advances in electronics mean that the technology is already available.Cadmium is a toxic waste product of the electronics industry.The electronics division was split off into a freestanding company.The electronics industry is showing signs of stagnating after 15 years of tremendous growth.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nAdd to word list\nAdd to word list\nthe scientific study of electric current and the technology that uses it: a degree in electronics the electronics industry\nAdd to word list\nAdd to word list\n[ U ] the scientific study of electric current and the technology of using it to manufacture electronic equipment: The minimum qualification for the job is a masters degree in electronics and computer technology.\n[ plural ] the small electrical parts, such as transistors and chips, that are used in electronic equipment: The manufacturing facility makes electronics for telecommunications and medical equipment.\n[ U ]\n&#160; ECONOMICS the part of the economy that is involved in manufacturing and selling electronic equipment: electronics company/industry/sector\n[ plural ] products that use electronic parts: Sales of electronics and toys have been strong. See also\nconsumer electronics\nhome electronics\nindustrial electronics\nmicroelectronics"}