{"id":137170,"name":"election","type":"noun","us_sound":"iˈlek.ʃən","us_link":"../audio/e/eus71464.mp3","uk_sound":"iˈlek.ʃən","uk_link":"../audio/e/ukelder007.mp3","content":"Add to word list\nAdd to word list\nB1 a time when people vote in order to choose someone for a political or official job: call an election The government is expected to call an election (= allow the country to vote) very soon. Local government elections will take place in May. The first election results have started to come in. See also\nby-election\ngeneral election\nelection campaign\nMore examplesFewer examplesThere was a fall in support for the Republican party at the last election.I voted Labour in the last election.The election for the leadership of the council will take place on Tuesday.The recent free elections mark the next step in the country's progress towards democracy.He has established himself as the leading candidate in the election.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nexit poll\nfirst-past-the-post\nflip\nfranchise\ngeneral election\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government the act or occasion of being chosen for a particular job, esp. by voting: [ C ] congressional/presidential elections [ U ] His election to the Senate was all but assured. [ U ] Election Day is the first Tuesday in November.\nAdd to word list\nAdd to word list\n[ C or U ] a time when people vote to choose someone for an official job: have/hold an election By the time of the annual meeting we will be ready to hold elections for the new executive board. lose/win an electionelection as sth These are the nominees for election as director.stand/run for election (to sth) She has decided that she will run for election to the Advisory Committee.\n[ S ] the fact of being chosen for an official job by people voting for you: election as sth She embarked on a series of sweeping changes to the company after her election as director."}