{"id":137461,"name":"electronic","type":"adjective","us_sound":"iˌlekˈtrɑː.nɪk","us_link":"../audio/e/eus71477.mp3","uk_sound":"ˌel.ekˈtrɒn.ɪk","uk_link":"../audio/e/ukelect003.mp3","content":"electronic adjective\n(ELECTRICAL)\nAdd to word list\nAdd to word list\nB1 (especially of equipment), using, based on, or used in a system of operation that involves the control of electric current by various devices: an electronic keyboard/game electronic components/devices\nMore examplesFewer exampleselectronic amplificationa miniaturized electronic circuitelectronic gizmosEven with a load of electronic gadgetry, you still need some musical ability to write a successful song.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nelectronic adjective\n(COMPUTING)\nB1 relating to computers or something that is done by computers: electronic communication/cash electronic publishing\nMore examplesFewer examplesYou can use the device to scan the image and reproduce it on-screen in an electronic format.It is one of a new class of electronic products variously called 'personal communicators' or 'personal digital assistants'.Many electronic devices let you create your own skins.electronic mail\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nRelated word\nelectronically\nAdd to word list\nAdd to word list\ninvolving a system of operation that involves the control of a flow of electrons esp. in various devices including computers: electronic components/equipment electronic banking The huge electronic scoreboard showed a replay of the last goal. electronically adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪˌlekˈtrɑn·ɪk·li/\nAdd to word list\nAdd to word list\nusing, based on, or used in a system of operation which involves the control of electric current by various devices, such as microchips: electronic games/gadgets/goods They design integrated circuits and other electronic components. electronic device/equipment/product Compare\nelectrical\nIT kept in electronic form on a microchip, disk, or computer: an electronic catalogue/database electronic data/records Compare\ndigital\nINTERNET, E-COMMERCE using the internet or another electronic communication system in order to operate: electronic access/billing electronic media/publishing These days, people are using a growing array of electronic communication methods - e-mail, text messaging, instant messaging, and social networking sites.electronic payment/cash system Cheques are steadily being replaced by electronic payment systems such as debit cards.\nelectronically adverb uk/ɪˌlekˈtrɒnɪkli/ us/-ˈtrɑːnɪ-/\nThese journals will soon be available electronically."}