{"id":137518,"name":"electroplate","type":"verb","us_sound":"iˈlek.troʊ.pleɪt","us_link":"../audio/e/eus71478.mp3","uk_sound":"iˈlek.trəʊ.pleɪt","uk_link":"../audio/e/ukb00490.mp3","content":"Add to word list\nAdd to word list\nto cover the surface of a metal object with a thin layer of a different metal, often silver, using electrolysis (= method that uses electric current): The firm uses chemical baths to electroplate metal products.electroplate something onto something The attractive appearance of silver can be achieved by electroplating silver onto an article made from a cheaper metal such as nickel. electroplated brass\nMore examplesFewer examplesThe copper sulfate acid solution is used to electroplate copper foil.The printers electroplated the copper sheets with a micron-thin coating of steelThese discs could be played as they were or electroplated in copper.The base onto which the silver is electroplated is a mix of nickel, copper and zinc.His idea was to produce a metal negative of the master cylinder by electroplating a layer of metal onto the wax.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\nferrous\ngold leaf\nlode\nmagnet\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nobjects that have been electroplated: How do you polish electroplate? The cutlery was not solid silver; it was electroplate.\nMore examplesFewer examplesThe two common forms of plated silver are Sheffield plate and silverplate or electroplate.Electroplate is formed when a thin layer of pure or sterling silver is deposited electrolytically on the surface of a base metal.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\nferrous\ngold leaf\nlode\nmagnet\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »"}