{"id":137159,"name":"elect","type":"verb","us_sound":"iˈlekt","us_link":"../audio/e/elect.mp3","uk_sound":"iˈlekt","uk_link":"../audio/e/ukelder005.mp3","content":"Add to word list\nAdd to word list\nB2 to decide on or choose, especially to choose a person for a particular job, by voting: The President is elected for a four-year term of office. [ + as + noun ] We elected him as our representative. [ + noun ] She was elected Chair of the Board of Governors. [ + to infinitive ] The group elected one of their members to be their spokesperson. elect to do something formal\nto choose to do a particular thing: She elected to take early retirement instead of moving to the new location.\nSee more Synonyms\nchoose\npick (CHOOSE)\nselect\nMore examplesFewer examplesShe was elected as leader of the campaign group.He was elected in the normal manner.He was elected as party leader in 2010.Representatives were elected by ballot.Politicians should be accountable to the public who elected them.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking and choosing\nDecisions and deciding\nRelated word\nelectable\nthe elect formal\nin the Bible, people who are chosen by God\nhumorous any group of people who have been specially chosen for their particular qualities\nSMART Vocabulary: related words and phrases\nThe Bible - people, events & places\nAdam\nannunciation\napocalypse\napostolic\nEden\nepistle\nepistolary\ngospel\nJesus Christ\nJudgment Day\npassion\npost-biblical\nPromised Land\npsalm\nresurrection\nthe ark\nthe Decalogue\nthe disciples phrase\nthe last judgment\nthe Last Supper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\nGroups of people\npresident elect, prime minister elect, etc.\nthe person who has been voted to be president, prime minister, etc. but has not yet started work: The president elect has been preparing to take office in January.\nSee more\nAdd to word list\nAdd to word list\nto decide on or choose, esp. to choose a person for a particular job by voting: [ T ] We elect representatives every two years. [ T ] She was elected to the board of directors. [ + to infinitive ] He was invited to join them at the concert, but he elected to stay home and watch the ballgame.\n(of a person) who has won a vote but not yet taken office: the president-elect\nAdd to word list\nAdd to word list\nused after the title of an official job to refer to someone who has been chosen by vote to do that job, but who has not yet started doing it: Mr Theroux is chairman-elect of the Promotion Marketing Association. Compare\ndesignate adjective\nto choose a person to do a particular job by voting: elect sb as sth He was elected unanimously as Chairman.elect sb to sth In 2006, she was elected to the board of directors before taking over as president in 2009.elect sb sth He was elected executive vice president and chief financial officer. a democratically/newly/recently elected official\nelect to do sth\nformal to choose to do a particular thing: The building society elected to become a stock market company in 2008."}