{"id":137854,"name":"eligible","type":"adjective","us_sound":"ˈel.ə.dʒə.bəl","us_link":"../audio/e/eligible.mp3","uk_sound":"ˈel.ɪ.dʒə.bəl","uk_link":"../audio/e/ukelect030.mp3","content":"Add to word list\nAdd to word list\nC1 having the necessary qualities or satisfying the necessary conditions: eligible for Are you eligible for early retirement/maternity leave? You might be eligible for a grant.eligible to Only people over 18 are eligible to vote.\nAn eligible person is not married and is thought to be a suitable future marriage partner, especially because they are rich and attractive: eligible bachelor I can think of several eligible bachelors of my acquaintance.\nMore examplesFewer examplesShe hopes to be eligible for parole in 3 years.Is he eligible for a pension?A model prisoner, he became eligible for release after serving half his sentence.Is she eligible to enter the competition?Kernaghan is eligible to play for Eire.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarriage, cohabitation & other relationships\nRelated word\neligibility\nAdd to word list\nAdd to word list\nhaving the necessary qualities or fulfilling the necessary conditions: an eligible voter You have to be employed six months to be eligible for medical benefits.\nIf you refer to a man or a woman as eligible, you mean the man or woman is not married and is desirable as a marriage partner: The magazine listed 50 of the world’s most eligible bachelors. eligibility noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌel·ə·dʒəˈbɪl·ət̬·i/\nAdd to word list\nAdd to word list\nallowed to do or receive something because you satisfy certain conditions: eligible citizens/customers/employees The company will offer its 104,000 eligible employees a stock option scheme this year.eligible to do sth Nearly two-thirds of the company's current employees will be eligible to retire within five years. Of 9,475 students, 1,323 were eligible for a scholarship."}