{"id":137865,"name":"eliminate","type":"verb","us_sound":"iˈlɪm.ə.neɪt","us_link":"../audio/e/eus75660.mp3","uk_sound":"iˈlɪm.ɪ.neɪt","uk_link":"../audio/e/ukelimi001.mp3","content":"Add to word list\nAdd to word list\nC1 [ T ] to remove or take away someone or something: A move towards healthy eating could help eliminate heart disease.eliminate a possibility We eliminated the possibility that it could have been an accident.eliminate someone from something The police eliminated him from their enquiries.\nC1 [ T often passive ] to defeat someone so that they cannot continue in a competition: He was eliminated in the third round of the competition.\nThesaurus: synonyms, antonyms, and examples\nto beat someone in a race, competition, etc.beatUnited beat City 3 - 2.defeatCan Ireland defeat New Zealand in this high-stakes match?conquerThe Greeks had fought and conquered the army of Mardonius.vanquishThe superhero always vanquishes his foes and saves the world.annihilateModern superpowers succeed not by annihilating their enemies but by buying them off.hammerThe Colts got hammered by the Patriots.\nSee more results »\n[ T ] slang to murder someone: A police officer was accused of helping a drug gang eliminate rivals.\nMore examplesFewer examplesWater helps eliminate toxins from your system.Police have eliminated him from their enquiries.The virus can never be entirely eliminated from the body.The programme will minimize, though not eliminate, the problem.She hired an assassin to eliminate her rival.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuation\nexorcism\nexpunge\nexpurgate\nexpurgated\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMurder & attempted murder\nAdd to word list\nAdd to word list\nto remove or take away something: You can never totally eliminate the possibility of human error. elimination noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪˌlɪm·əˈneɪ·ʃən/\nArts programs face elimination in some school systems.\nAdd to word list\nAdd to word list\nto completely remove something that is not wanted or needed: The problem we confront today is there is no one thing that can eliminate our dependency on petroleum. The UK hopes other countries will support its proposals to eliminate debt owed by the poorest African states to international institutions. elimination noun [ U ]\nThe merger is expected to result in the elimination of 4,000 jobs at the combined company."}