{"id":138080,"name":"else","type":"adverb","us_sound":"els","us_link":"../audio/e/else.mp3","uk_sound":"els","uk_link":"../audio/e/ukelimi028.mp3","content":"Add to word list\nAdd to word list\nA2 used after words beginning with any-, every-, no-, and some-, or after how, what, where, who, why, but not which, to mean 'other', 'another', 'different', 'extra': Everybody else has (= all the other people have) agreed except for you. If it doesn't work, try something else (= something different). Let's go before they ask us to visit anyone else (= another person). It's not my bag. It must be someone else's (= it must belong to another person). The book isn't here. Where else (= in what other place) should I look? He came to see you. Why else (= for what other reason) would he come? After I'd thanked them I didn't know what else (= what other things) to say.\nMore examplesFewer examplesShe arrived before everyone else.Some species exist in this small area of forest and nowhere else on earth.I'm not buying the children anything else today - I've spent far too much money already.He looked nervously over his shoulder, making sure no one else was listening.I'm sorry, I don't know - you'll have to ask someone else.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlso, extra, and in addition\nGrammar\nElseWe use else after words beginning with any-, every-, no- and some-, to mean ‘other’, ‘another’, ‘different’ or ‘additional’. …\nElse with someone, anybody, nobody, etc.We use else after words beginning with any-, every-, no- and some-, to mean ‘other’, ‘another’, ‘different’ or ‘additional’. …\nElse with who, what, where, etc.We use else after how, what, where, who and why to mean ‘other’, ‘another’, ‘different’ or ‘additional’: …\nElse: orelseWe use or else to say what the result will be if something does not happen: …\nIdiom\nor else\nAdd to word list\nAdd to word list\n(after words beginning with any-, every-, no-, and some-, or after how, what, where, who, and why, but not which) other, another, different, additional: If it doesn’t work, try something else (= something different/another way or thing). Let’s go before anyone else (= another/an additional person) arrives. The book isn’t here – where else (= In what other place) should I look?"}