{"id":138186,"name":"email","type":"noun","us_sound":"ˈiː.meɪl","us_link":"../audio/e/e_mail.mp3","uk_sound":"ˈiː.meɪl","uk_link":"../audio/e/ukeluci012.mp3","content":"Add to word list\nAdd to word list\nA1 [ U ] the system for using computers to send messages over the internet: by email You can contact us by email or fax.email address What's your email address?\nA1 [ C ] a message or document sent using this system: I got an email from Danielle last week.\nMore examplesFewer examplesI'll forward his email to you if you're interested.I'll send you my email address once I'm online.How did people communicate in the days before email?She wondered who'd sent her the mysterious email.This software helps firms archive and retrieve emails.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nGrammar\nSaying email and internet addressesWhen we speak email and web addresses, we say each word separately. To avoid confusion, we sometimes spell out each letter of a word: …\nA2 to send an email to someone: Email me when you've got time. [ + two objects ] Has he emailed you that list of addresses yet?\nMore examplesFewer examplesTo contact our Australian branch, email us at info@cambridge.edu.au.You can email cide@cambridge.org to find out more about this dictionary.I'll email my report to you as an attachment.I'll email him later today.She emailed me with the news.\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nGrammar\nSaying email and internet addressesWhen we speak email and web addresses, we say each word separately. To avoid confusion, we sometimes spell out each letter of a word: …\nAdd to word list\nAdd to word list\na message sent from one person to another by computer: [ U ] I save all my e-mail. [ C ] She sent an e-mail to her children with the subject line, \"Sad day.\"\nto send something or write to someone using e-mail: She had emailed us about a league workshop on Wednesday. Late last week, the hospital e-mailed a statement declining to comment on the patient's case.\nAdd to word list\nAdd to word list\n[ U ] the system of sending messages over the internet: have/use email It's important to speak to people directly from time to time, rather than always using email.by email You can contact us through our website, by phone, or by email. an email service/system an email discussion/newsletter/update\n[ C or U ] a message or document, or a set of messages or documents, sent using this system: reply to/answer (an) email Faxes, phone calls, and emails have not been answered.receive/get (an) email He has received a huge amount of email in response to the blog.look at/check email She spends the first hour of her day checking her email.send/forward (sb) an email I'll send you an email with the details of the meeting. delete/save an e-mail\nto send an email to someone: E-mail us at info@businesslink.gov.uk.email sth to sb Can you email the spreadsheet to me as an attachment?email sb sth Subscribers will be emailed the dates and times of all upcoming chat forums.email sb back Email me back with your comments when you've read the report."}