{"id":138700,"name":"emcee","type":"noun","us_sound":"ˌemˈsiː","us_link":"../audio/e/usember011.mp3","uk_sound":"ˌemˈsiː","uk_link":"../audio/e/ukembry003.mp3","content":"Add to word list\nAdd to word list\nmainly US (UK usually host) a person whose job is to introduce performers in a television, radio, or stage show: emcee of He was the emcee of the live New Year's Eve show. She's an MC, hosting open mic nights. Synonym\ncompere UKSee also\nmaster of ceremonies\na rapper (= a musical performer who speaks rhythmic words over a strong beat): Women emcees in commercial hop-hop were under pressure to fit a particular image. In addition to his work as an MC and author, Chuck D is a political activist.\nMore examplesFewer examplesActor Lou Gossett Jr. was the emcee for pre-game ceremonies.We met at the Miami club where he works as MC.The scene is a New York comedy club. On stage we find the emcee, an African American woman in her mid twenties. C-SPAN host Steve Scully will return to serve as emcee for the third year.A New York-based emcee, Rekha mixes hip hop and bhangra, bringing contemporary beats to the sounds of South Asia.They'd get a singer or an MC to do stuff over their tracks.There have been longstanding rumours that she had beef with Nicki Minaj, though both emcees have denied any bad blood between them.\nSMART Vocabulary: related words and phrases\nBroadcasting: radio & television presenters\nanchor\nanchorman\nanchorwoman\nannouncer\nbroadcaster\nco-host\ncompere\ncorrespondent\ndeejay\ndesk\ndisc jockey\ndisk jockey\nDJ\nfrontman\npresenter\nshock jock\nsportscaster\ntalking head\ntelevangelist\nweather forecaster\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEntertainers in general\nSinging\nMusicians\n[ I or T ] mainly US (UK usually host) to introduce performers in a television, radio, or stage show: Jimmy Kimmel emceed the American Music Awards. Children's author Kate Harris will emcee. Synonym\ncompere UK\n[ I ] to rap (= perform by speaking rhythmic words over a strong beat): She likes to emcee in her spare time.\nMore examplesFewer examplesThe Spelling Bee will take place this Saturday at the school and Bob Shaw, meteorologist for KTVZ, will emcee the event. I will be MCing the Christmas party. The gala is MCed by former Bolshoi director Yuri Grigorovich.He ended up working all kinds of jobs, emceeing dance contests or playing bit parts in movies.A local TV host agreed to emcee.Rapping is also known as emceeing, MCing, spitting, or just rhyming.They customise records by MCing over the top.\nSMART Vocabulary: related words and phrases\nPreceding and introducing\nannounce\nantedate\nbeat\nbuild (someone/something) up\ncountdown\ncurtain-raiser\nforerunner\ngo on\nintroduction\nintroductory\nlead up to something\nlead-in\nopen the door to something idiom\npreamble\npreface\nprefix\npreliminarily\npreliminary\nprelude\nreintroduce\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrating & entertaining\nSinging\nPlaying music\nAdd to word list\nAdd to word list\nmaster of ceremonies"}