{"id":138744,"name":"emergency","type":"noun","us_sound":"ɪˈmɝː.dʒən.si","us_link":"../audio/e/eus71512.mp3","uk_sound":"ɪˈmɜː.dʒən.si","uk_link":"../audio/e/ukembry009.mp3","content":"Add to word list\nAdd to word list\nB1 something dangerous or serious, such as an accident, that happens suddenly or unexpectedly and needs fast action in order to avoid harmful results: in an emergency How would disabled people escape in an emergency?emergency exit Is the emergency exit suitable for wheelchairs?emergency landing The pilot of the aircraft was forced to make an emergency landing on Lake Geneva. Synonyms\ncalamity\ncataclysm literary\ncatastrophe\ncrisis\ndisaster\ntragedy\nMore examplesFewer examplesDuring the emergency many staff volunteered to work through the weekend.Grandma always kept a bit of money tucked away in case there was an emergency.You can land a plane on water in an emergency.I always keep a blanket and a toolkit in the trunk for emergencies.20 million people face starvation unless a vast emergency aid programme is launched.\nSMART Vocabulary: related words and phrases\nAccidents and disasters\naccident\naccidental\naccidentally\naccidentally on purpose idiom\nan accident waiting to happen idiom\ncalamitously\ncalamity\ncataclysm\ncataclysmic\ncataclysmically\ndisaster\ndisaster area\ndisastrous\ndisastrously\ndumpster fire\nmishap\nnatural disaster\nnon-emergency\nperfect storm\npost-accident\nSee more results »\nAdd to word list\nAdd to word list\na dangerous or serious situation, such as an accident, that happens suddenly or unexpectedly and needs immediate action: In an emergency, dial 911 for an ambulance.\nAdd to word list\nAdd to word list\na dangerous or serious situation that happens unexpectedly and needs fast action in order to avoid harmful results: Aim to build up risk-free savings in case of emergency. The governor declared a state of emergency as flooding forced more than 1,400 residents from their homes.\nintended to help deal with an emergency: Another $2 billion in surplus revenue will be set aside, by law, in a state emergency fund.emergency measure/plan/procedure Emergency measures introduced by major credit card issuers to stem the tide of fraud should be in place by the autumn. emergency aid/assistance/help\ndone very quickly because there is an emergency: Seven board members called for an emergency meeting."}