{"id":138866,"name":"emission","type":"noun","us_sound":"iˈmɪʃ.ən","us_link":"../audio/e/emission.mp3","uk_sound":"iˈmɪʃ.ən","uk_link":"../audio/e/ukembry027.mp3","content":"Add to word list\nAdd to word list\nC1 [ U ] the act of sending out gas, heat, light, etc.: Bioluminescence is the emission of light from living organisms. Excess infrared emission was detected around six of these stars.\nC1 [ C ] an amount of gas, heat, light, etc. that is sent out: He uses a night observation device that picks up heat emissions. There is a risk of accidents with large emissions of radioisotopes into the biosphere.\n[ C usually plural ]\n&#160; environment\n&#160; specialized an amount of a substance that is produced and sent out into the air that is harmful to the environment, especially carbon dioxide: Reducing the consumption of energy and increasing its efficient use would help control emissions. These health risks are caused by vehicle emissions. The agreement aimed to half the emissions rate in 50 years.\nMore examplesFewer examplesWe can measure the absorption or emission of light at specific wavelengths.Fluctuations in the intensity of the radio emissions from stars allow researchers to infer the amount of ejected material.Research is underway to develop ways of measuring the full-body biophoton emissions of human subjects.He has concerns about the need to curb emissions of smog-forming nitrogen oxides, sulphur dioxide and mercury. Countries and corporations are making efforts to cut their greenhouse gas emissions.Vehicles are placed on a treadmill and their emissions are measured when the gas pedal is pushed and the wheels are turning.State governors are moving toward regional emissions limits. New, tougher emission standards for cars will be brought in.\nSMART Vocabulary: related words and phrases\nEmitting and ejecting\ndischarge\ndisplace\ndisplaced\ndisplacement\nejaculation\neject\nejection\nejector\nemit\nemitter\nexpel\nexpulsion\nexude\npuff\nre-emission\nre-emit\nsend\nsend something out\nshed\ntoss\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nEnvironmental issues\nAdd to word list\nAdd to word list\n[ C, usually plural ] an amount of something, especially a gas that harms the environment, that is sent out into the air: emissions of sth The bill is intended to lower emissions of greenhouse gases.cut/reduce/limit emissions Many countries are reluctant to cut emissions if it means sacrificing economic growth. emission cuts/reductions/control California's emissions standards would cut global warming emissions nearly 30% by year 2016.\n[ U ] the act of sending gas, heat, light, etc. out into the air: Hybrid vehicles reduce the emission of pollutants by about 20%."}