{"id":139136,"name":"employment","type":"noun","us_sound":"ɪmˈplɔɪ.mənt","us_link":"../audio/e/employment.mp3","uk_sound":"ɪmˈplɔɪ.mənt","uk_link":"../audio/e/ukemplo001.mp3","content":"employment noun [U]\n(WORK)\nAdd to word list\nAdd to word list\nB1 the fact of someone being paid to work for a company or organization: Employment levels are unlikely to rise significantly before the end of next year. How long have you been looking for employment? be in employment UK formal\nto have a job: Are you in employment at the moment?\nSee more\nMore examplesFewer examplesYour contract will set out the terms and conditions of your employment.It doesn't seem likely that we will see a return to full employment in the near future.Some economists think that full employment in Europe is an unattainable goal.More and more young people are leaving rural areas to find employment in the cities.The new factory will provide employment for about a hundred local people.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment agency\nequality, diversity and inclusion\nget in\nnomination\nprospect\nreinstatement\nrelocation expenses\nresume\nretain\nrope\ntestimonial\nSee more results »\nemployment noun [U]\n(USE)\nformal use: employment of How can you justify the employment of capital punishment?\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nmine a rich seam of something idiom\nspare\nspent\ntap\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nunderused\nSee more results »\nemployment noun [U]\n(USE)\nAdd to word list\nAdd to word list\nthe use of something for a particular purpose: She studied advertisers’ employment of images in food ads.\nemployment noun [U]\n(WORK)\nwork, esp. for someone else, for which you are paid, or a period of work: After leaving Pearson, it took Friedman months to find new employment.\nAdd to word list\nAdd to word list\nwork that you are paid to do for a particular company or organization: find/look for/seek employment If you are unemployed but you are actively seeking employment, you may qualify for benefits.take up/gain/secure employment Almost half of the participants gained employment after completing the training program.provide/create/generate employment These attractions provide employment for local people and create business for local shops and cafes. Today the terminal offers employment to around 500 people. casual/full-time/part-time employment seasonal/temporary employment permanent/continuous employmentemployment opportunities/prospects Many rural workers have moved to the cities to seek better employment opportunities and improved living conditions.employment agreement/contract Under the terms of her employment contract she is entitled to five weeks paid vacation per year.\nthe number of people who have jobs, or the ability to provide jobs to other people: high/low/full employment An unemployment rate below 5% is considered full employment.employment rises/falls Glasgow had economic growth above the UK average and employment rising faster than anywhere outside London.employment rates/levels/growth The state reported employment growth of 3.1% during the past year, with the creation of 438,000 non-farm jobs.employment data/figures/records The dollar plunged against the euro, despite Friday's strong employment figures.boost/increase employment Politicians hope to boost employment by introducing a new tax credit for employers.\nin employment\nhaving a job: An employee must have been in continuous employment for two years to be eligible for a redundancy payment. The number of people in employment had risen by 315,000.\nCompare\nunemploymentSee also\nprecarious employment"}