{"id":139190,"name":"empty","type":"adjective","us_sound":"ˈemp.ti","us_link":"../audio/e/empty.mp3","uk_sound":"ˈemp.ti","uk_link":"../audio/e/ukemplo010.mp3","content":"empty adjective\n(NOTHING IN)\nAdd to word list\nAdd to word list\nA2 not containing any things or people: an empty house/street Shall I take the empty bottles for recycling? The train was empty (= there were no passengers) by the time it reached London.\nMore examplesFewer examplesPut the empty box in the rubbish bin.The room was empty except for a wardrobe standing in one corner.Could you put that crate of empty bottles outside the back door, please?I pulled into the empty parking space.When I reached the supermarket checkout, I found to my horror that my purse was completely empty.\nSMART Vocabulary: related words and phrases\nEmpty\nbare\nbarrenly\nbarrenness\nblank\nclear\ncleared\ndead\ndeserted\nemptiness\nflat\nforlorn\nhollow\nlow-traffic\nnothingness\nuncrowded\nunobstructed\nunoccupied\nuntenanted\nvacant\nvacuum\nSee more results »\nempty adjective\n(NOT SINCERE)\nC1 [ usually before noun ] not sincere or without any real meaning: empty rhetoric She dismessed his apology as empty rhetoricempty threat Too many empty threats and your child will soon learn to ignore you.empty promise They're just empty promises.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nforced\nforcedly\nfustian\nglib\nglibly\nponce\nponce about/around\nposey\npreciously\npreciousness\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\ntheatricality\nSee more results »\nempty adjective\n(WITHOUT PURPOSE)\nwithout purpose or interest: He says his life has been completely empty since his wife died. I felt empty, like a part of me had died.\nThesaurus: synonyms, antonyms, and examples\nhaving no clear plan or purposeaimlessHe was just aimless and confused after being let go from his position.directionlessThe party was plagued with weak and directionless leaders who had no clue how to govern.purposelessThe job left him feeling unfulfiled and purposeless.adriftHis son has just been utterly adrift since leaving university.emptyAfter losing him, I just feel empty inside.\nSee more results »\nSMART Vocabulary: related words and phrases\nUseless and futile\na mug's game idiom\nadrift\naimless\naimlessly\naimlessness\nairy-fairy\nfruitlessly\nfruitlessness\nfutile\nfutilely\nfutility\nnegate\nnegation\nno good idiom\nnon-viable\nunseriousness\nuntil you are blue in the face idiom\nunviability\nunviable\nunwieldily\nSee more results »\nRelated word\nemptilyIdiom\non an empty stomach\n[ T ] to remove everything from inside something: I emptied the closet and put my belongings into the black overnight case.empty (out) Would you mind emptying (out) your pockets?empty something into something Empty the soup into a saucepan and simmer gently for ten minutes. She quickly emptied her glass (= drank its contents) and ordered another drink.\n[ I ] to become empty: The place emptied pretty quickly when the fight started.\nSMART Vocabulary: related words and phrases\nEmptying\nclear\ndrain\nevacuate\nevacuation\ngut\nhollow\nhollow something out\nland\nlet\nlet someone/something out\nturn\nturn out\nunbox\nunload\nunpack\nvacate\nPhrasal verb\nempty into something\n[ C usually plural ] an empty bottle or other container, especially one that contained drink: Don't forget to recycle the empties.\nSMART Vocabulary: related words and phrases\nContainers for liquids and gases\naerosol\namphora\nbottle\nbucket\ncanister\nchurn\nflask\nhip flask\nhot-water bottle\nhottie\nhowler\ninkwell\noxygen tank\nsiphon\nsprayer\nstoup\nThermos\ntin can\ntinnie\ntravel mug\nSee more results »\nIdiom\nrunning on empty\nAdd to word list\nAdd to word list\nhaving nothing inside: He set the empty glass down.\nIf a place is empty, no one is using it or is present: It was past midnight, and the streets were empty.\nEmpty also means without any meaning or purpose: We need jobs, not empty promises. Idiom\non an empty stomach\na container with nothing in it, esp. one whose contents have been used: Bring the empties to the recycling center.\nto take out everything from inside something, or to lose what is inside so that nothing is left: [ T ] She emptied her husband’s mug in the sink. [ I ] Once the movie ended, the theater emptied quickly. [ I ] The Tombigbee River empties into Mobile Bay (= its water flows there)."}