{"id":139279,"name":"enable","type":"verb","us_sound":"ɪˈneɪ.bəl","us_link":"../audio/e/enable.mp3","uk_sound":"ɪˈneɪ.bəl","uk_link":"../audio/e/ukemplo020.mp3","content":"Add to word list\nAdd to word list\nB2 to make someone able to do something, or to make something possible: [ + to infinitive ] Computerization should enable us to cut production costs by half.\npsychology\n&#160; specialized to allow or make it possible for someone to behave in a way that damages them: It is wrong to enable or support any addict to become re-addicted to any drug. Parents must always ask themselves if they are enabling their child's drug use.\nMore examplesFewer examplesSome tests enable you to find out the sex of your baby before it's born.Only good team work will enable us to get the job done on time.I'm looking for a job which will enable me to develop my skills.The sophisticated avionics enable the helicopter to operate at night.Computerization has enabled us to do away with a lot of paperwork.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\ngo a long way toward(s) doing something idiom\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nsuccour\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAllowing and permitting\nGrammar\nEnableWhen you enable something, you make it possible for something to happen: …\nAdd to word list\nAdd to word list\nto make someone or something able to do something by providing whatever is necessary to achieve that aim: Saving enough money now will enable you to retire comfortably.\nAdd to word list\nAdd to word list\nto make someone or something able to do something, or to make something possible: enable sb/sth to do sth This software will enable us to track orders more efficiently. Recent technology has enabled the development of cheaper digital radios."}