{"id":139292,"name":"enactment","type":"noun","us_sound":"ɪˈnækt.mənt","us_link":"../audio/e/enactment.mp3","uk_sound":"ɪˈnækt.mənt","uk_link":"../audio/e/ukemplo023.mp3","content":"enactment noun [C or U]\n(MAKING LAW)\nAdd to word list\nAdd to word list\nlaw\n&#160; specialized the act of putting something into action, especially the act of making something law: enactment of The goal of the legislators was enactment of a tax bill. It is not appropriate for a judge to comment on perceived inadequacies of a legislative enactment. See\nenact\nMore examplesFewer examplesThe stage was set for worldwide enactment of the landmark global warming accord.Negotiators met to resolve issues holding up enactment of an aviation bill. Following enactment of the law, new regulations were issued affecting imports and exports of crude oil.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nenact\nenforce\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\njurisprudentially\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nprohibit\nsanction\nwrit\nSee more results »\nenactment noun [C or U]\n(PERFORMANCE)\nformal the act of performing a story or play: The founding of the town was impressively presented in dramatic enactment and dance. In a real-life enactment of every singer's worst nightmare, she sang a few phrases before stopping and announcing that she had lost her voice.\nMore examplesFewer examplesAt the festival you can see jugglers, puppeteers, historical enactments, and craftspeople demonstrating their skills.The vocalist’s austere enactment of the role must be measured a success. The playwright performed an extraordinary one-man enactment of one of his plays.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nmusic hall\nnon-musical\none-night stand\none-person\nopen mic\nroutine\nspectacular\nstrip\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntableau\ntattoo\nSee more results »\nAdd to word list\nAdd to word list\nthe making of a law, or a particular act of making a law: Supporters were pleased with the enactment of the bill."}