{"id":139768,"name":"encounter","type":"noun","us_sound":"ɪnˈkaʊn.t̬ɚ","us_link":"../audio/e/eus71529.mp3","uk_sound":"ɪnˈkaʊn.tər","uk_link":"../audio/e/ukencas018.mp3","content":"Add to word list\nAdd to word list\na meeting, especially one that happens by chance: encounter with I had an alarming encounter with a wild pig.encounter between This meeting will be the first encounter between the party leaders since the election.\nan occasion when people have sex, usually with someone they have not met before\nan occasion when two teams play against each other: encounter with In their last encounter with Italy, England won 3–2.\nMore examplesFewer examplesShe has written a memoir of her encounters with W.H. Auden over the years.I had a bruising encounter with my ex-husband last week.I had a strange encounter with a French man on my way to work.She reported an interesting encounter with an ex-soldier.It was one of a number of amusing encounters last week.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nmake yourself known idiom\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nencounter verb [T]\n(MEET)\nformal to meet someone unexpectedly: On their way home they encountered a woman selling flowers.\nMore examplesFewer examplesShe was, he says, the most violent woman he had encountered in 13 years as an officer.As we left the memorial area we encountered a group of German students.The football fans that we encountered seemed harmless enough.On my way to the station I encountered a small child, begging.He was probably the most obnoxious person I've ever encountered.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nmake yourself known idiom\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nencounter verb [T]\n(EXPERIENCE)\nB2 to experience something, especially something unpleasant: When did you first encounter these difficulties? The army is reported to be encountering considerable resistance.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nAdd to word list\nAdd to word list\nto meet someone unexpectedly, or to experience, esp. something unpleasant: In the kitchen I encountered a woman I had never seen before. He was shocked by the hostility he encountered. encounter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈkɑʊnt·ər/\nMy first encounter with death was when Abraham died.\nAdd to word list\nAdd to word list\nto experience a situation, especially something that is unexpected or unpleasant: We encountered a problem with the fuel pump during safety tests. This is the first time I have encountered racism at work.\na meeting with someone, especially one that is unexpected or unpleasant: Customer service representatives are trained to handle encounters with angry customers."}