{"id":139775,"name":"encourage","type":"verb","us_sound":"ɪnˈkɝː.ɪdʒ","us_link":"../audio/e/eus71530.mp3","uk_sound":"ɪnˈkʌr.ɪdʒ","uk_link":"../audio/e/ukencas019.mp3","content":"Add to word list\nAdd to word list\nB1 to make someone more likely to do something, or to make something more likely to happen: [ T + to infinitive ] We were encouraged to learn foreign languages at school. The council is encouraging the development of the property for both employment and recreation.\nB1 to talk or behave in a way that gives someone confidence to do something: encourage someone in something They've always encouraged me in everything I've wanted to do.\nMore examplesFewer examplesThe new teaching methods encourage children to think for themselves.We encourage the victims to talk freely about their experiences.Instead of simply punishing them, the system encourages offenders to modify their behaviour.His tutor encouraged him to read widely in philosophy.The city council is encouraging jobsharing to make it easier for parents of young children to work.\nSMART Vocabulary: related words and phrases\nEncouraging and urging on\nabet\nbarrack for someone\nbread\nbring\nbring someone out\nget out of here! idiom\ngo on\ngood/great/lovely stuff! idiom\ngoose\nhearteningly\nmentor\npave\npave the way idiom\npep talk\npermit\nprepare\nspur\nstimulus\nstoke\nurge\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUrging & persuading\nAdd to word list\nAdd to word list\nto help someone to feel confident and able to do something, or to give advice to someone to do something: Our parents always encouraged us to ask questions.\nIf something encourages an activity, it supports it or makes it more likely: The city needs to encourage job creation. encouragement noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈkɜr·ɪdʒ·mənt, -ˈkʌr·ɪdʒ-/\nMy parents gave me encouragement and support. encouraging adjective us\nYour browser doesn't support HTML5 audio\n/ɪnˈkɜr·ə·dʒɪŋ, -ˈkʌr·ə-/\nEarly results of the experiment were extremely encouraging."}