{"id":139844,"name":"encumbrance","type":"noun","us_sound":"ɪnˈkʌm.brəns","us_link":"../audio/e/eus71534.mp3","uk_sound":"ɪnˈkʌm.brəns","uk_link":"../audio/e/ukencum001.mp3","content":"Add to word list\nAdd to word list\nsomething that makes it difficult for you to do something: When you're walking 30 miles a day, the fewer encumbrances the better. He has no patience for the irritations and encumbrances of celebrity. I felt that I was a nuisance, an incumbrance. Related word\nencumber\nlaw\n&#160; specialized a mortgage (= an agreement to borrow money from a bank, etc. to buy a property) or other charge to pay on a property, or the fact that a property has a mortgage or other charge to pay on it: They were buying land without encumbrances for between $100 and $500 an acre. To make a reasonable risk evaluation it is important to know what other encumbrances there are on the property title. I confirm that no charge, hire-purchase agreement or other incumbrance affects the property.\nMore examplesFewer examplesHer cancer has not proved to be an encumbrance on her daily life.We enjoy exploring the city without the encumbrance of a car.The company has scrapped the encumbrance of fixed production targets.For him, memories of the past were merely an incumbrance.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMortgages & real estate\nAdd to word list\nAdd to word list\nLAW, PROPERTY a mortgage or other charge on a property, or the fact of a property having a mortgage, etc.: An encumbrance is a legal claim on a property that affects the owner's ability to transfer the ownership of the property.\nsomething that makes it difficult to do things: He had paid off his loans and was free of the encumbrance of debt."}