{"id":139852,"name":"end","type":"noun","us_sound":"end","us_link":"../audio/e/end.mp3","uk_sound":"end","uk_link":"../audio/e/ukencum004.mp3","content":"end noun\n(LAST POINT)\nAdd to word list\nAdd to word list\nA2 [ C ] the part of a place or thing that is furthest away from the centre: at the end This cable should have a plug at one end and a socket at the other.the end of We damaged the end of the piano when we moved it. Get to the end of the queue and wait your turn like everyone else. Our house is the third from the end on the left. Is it safe to stand the computer on (its) end? end to end\n(also end-to-end) arranged with one end of next to the end of something else: Tables were arranged end to end across the basketball court.\nSee more\nA1 [ C ] the final part of something such as a period of time, activity, or story: at the end of I always like to leave my desk clear at the end of the day. The end of the play was much more exciting than I'd expected.at an end This latest injury must surely mean that her tennis career is now at an end (= finished).no end to The statement said there would be no end to the violence until the terrorists' demands were met.\nThesaurus: synonyms, antonyms, and examples\nthe start of somethingbeginningLet's go back to the beginning. Can you tell me when you arrived at the crime scene?startI didn't like him from the very start.endThis is it – the end of the tour. openingThe opening of the ceremony was marred by protest.commencementWhat is the commencement date of their contract?kick-offWhat time is the kick-off for the banquet and show?\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\n[ S ] polite word for death: We were all by her bedside when the end finally came.meet your end He met his end (= died) in a shoot-out with the police.\n[ C ] either of the two halves of the field in some sports: The teams change ends at half-time so that neither side has an unfair advantage. bring something to an end\nC1 to make something finish: He ran out of time and brought the interview to an end.\nSee more in the end\nB1 finally, after something has been thought about or discussed a lot: We were thinking about going to Switzerland, but in the end we went to Austria.\nSee more for hours, days, etc. on end\nB2 for hours, days, etc. without stopping: He used to lock himself in his bedroom for hours on end and refuse to talk to anyone.\nSee more come to an end\nB2 to finish: Everyone wishes the war would come to an end soon.\nSee more\nMore examplesFewer examplesHer office is at the end of the corridor.Diplomacy has so far failed to bring an end to the fighting.Where is the nozzle thing that you attach to the end of this tube?The book has exercises at the end of every chapter.\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\nconclusion\ndeath\nending\nexpiration\nexpiry\nfag\nfinalization\nfinish\nswansong\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath and dying\nSurfaces on which sports take place\nend noun\n(PART OF GAME)\n[ C ] in sports including curling, bowls, and archery, a part of a game, especially one in which each team or player throws or shoots towards one end of the playing area: It was a close contest that came down to the last stone in the last end. The Canadians took singles on each of the next three ends.\nSMART Vocabulary: related words and phrases\nParts & stages of competitions\na game in hand idiom\nadded time\nbracket\ncup tie\nelimination\nevent\nfull time\nhalf\nhand\ninjury time\nkick\nkick off\nlap\nlap of honour phrase\nquarter\nshootout\nsqueaky-bum time\ntimeout\nvictory\nvictory lap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinter sports\nBowls, bowling & croquet\nTarget sports\nend noun\n(SMALL PART)\n[ C ] a small part of something that is left after most of it has been used: She makes quilts out of fabric bolt ends.cigarette end UK The floor was covered in cigarette ends.\nSMART Vocabulary: related words and phrases\nThings remaining\n(and) all the rest idiom\nbalance\nbastion\nbe left phrase\ncremains\ncutpiece\ndeposit\nground\nhangover\nredoubt\nrelic\nremainder\nremains\nremnant\nresidual\nsurvival\nthrowback\ntime capsule\nunallocated\nuneaten\nSee more results »\nend noun\n(AIM)\n[ C ] an aim, intention, or purpose: Do you have a particular end in mind? to this end\nin order to achieve this aim: He wanted science students to take an interest in the arts, and to this end he ran literature classes at his home on Sunday afternoons.\nSee more\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nend noun\n(TYPE OF ACTIVITY)\n[ S ] informal the parts of a task or process connected with one particular type of activity or person: end of things Rick's more involved with the financial end of things. someone's end of the bargain, deal, etc.\nthe area of activity for which someone is responsible: We've kept our end of the deal - let's see if they keep theirs.\nSee more\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nIdioms\nat the end of the day\nat the end of your tether\nthe end justifies the means\nend of\nend of day\nend of story\nthe end of the line/road\nget/have your end away\nkeep/hold your end up\nmake ends meet\nMore idioms\nno end\nno end of something\nnot be the end of the world\nput an end to something\nA2 to finish or stop, or to make something finish or stop: When is your meeting due to end? Her resignation ends months of speculation about her future. Their marriage ended in 1991.end in The game ended in a draw.end with I'd like to end with a song from my first album. She ended her speech on an optimistic note.\nThesaurus: synonyms, antonyms, and examples\nto finish somethingfinishDid you finish your homework?endWhat time does the concert end?completeHave you completed the questionnaire?concludeShe concluded her speech by thanking everyone who had helped her.polish offHe's just polished off two huge bowls of pasta.wind upIt's time to wind up the game now.\nSee more results »\nMore examplesFewer examplesEventually, the two girls agreed to end their quarrel.This was her final professional match, and she wanted to end her career in a blaze of glory.Their marriage ended eight years ago in an acrimonious divorce.The president ended his visit by laying a wreath at the war memorial.In Britain, the spring term starts in January and ends just before Easter.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nGrammar\nEnd or finish?We use the verbs end and finish in similar ways, to mean ‘come to a stop’: …\nIdioms\nend it (all)\nit'll (all) end in tearsPhrasal verb\nend up\nend noun [C]\n(LAST PART)\nAdd to word list\nAdd to word list\nthe last or farthest part of something or of a period of time, beyond which it does not exist: She tied one end of the rope to a tree. The punctuation at the end of this sentence is a period. Did you stay to the end of the movie? Steve can swim to the far end of the lake and back. at an end\nTo be at an end is to be finished: His career was at an end. end to end\nIf things are end to end, they are all facing in the same direction, with the back end of each against the front end of the next one: The new cars were lined up end to end.\nend noun [C]\n(PART)\na specific part or division of an activity: She takes care of the financial end of the business and I handle the marketing end.\nend noun [C]\n(INTENTION)\nsomething that your actions or efforts are intended to achieve; an aim: To accomplish that end, you will have to work hard and be lucky, too.\nend noun [C]\n(FOOTBALL PLAYER)\n(in football) one of two players who begin play farthest from the ball: a defensive end endlessly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈen·dlə·sli/\nEducation policy is endlessly debated. Idioms\nat the end of your rope\nin the end\nnot the end of the world\non end\nend verb [I/T]\n(FINISH)\nto finish or stop, or to make something finish or stop: [ I ] Our arguments always end in tears. [ T ] She ended her speech on an optimistic note. Phrasal verb\nend up\nAdd to word list\nAdd to word list\nthe time or place that something finishes: The construction will be completed by the end of the year. Sales are looking good according to the end-of-month report. We spent a long time looking for a good supplier, but we found one in the end. There are encouraging signs that the recession has come to an end. The difficult period we've been through now seems to be at an end. There is no end to the possible markets for this product. The meeting room is at the end of the corridor on the right.\nused when stating whether goods or services are expensive or cheap, or of high or low quality: the bottom/low/top end of the market This basic laptop is aimed at the low end of the market.\nan aim or purpose: We aim to halve production costs, and to this end we are investing in automating the process. We see good design not just as a means of increasing profits, but as an end in itself.\nthe parts of a task or process connected with one particular type of activity, or with a particular person: Rick's more involved with the financial end of things. Everything's ready here, but how are thing's your end?sb's end of the bargain/deal We kept our end of the bargain, but they failed to meet their deadline. See also\nback-end\nclosed-end\ndead end\nend-to-end\nfront-end\nhigh-end\nlow-end\nyear end\nto finish or stop, or to make something finish or stop: What time is your meeting due to end? Her resignation ends months of speculation about her future. Our contract with those suppliers ended in April.end in sth The negotiations ended in failure after three days.end (sth) with sth I'd like to end my presentation with a little story..."}