{"id":139973,"name":"ending","type":"noun","us_sound":"ˈen.dɪŋ","us_link":"../audio/e/ending.mp3","uk_sound":"ˈen.dɪŋ","uk_link":"../audio/e/ukencum013.mp3","content":"ending noun [C]\n(STORY)\nAdd to word list\nAdd to word list\nB1 the last part of a story: happy ending People want love stories with happy endings.\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\nMore examplesFewer examplesI didn't find the ending of the film very convincing.Sadly, there was no fairytale happy ending to the story.Knowing the ending already didn't spoil my enjoyment of the film.His last book had a rather strange ending, don't you think?The playwright wrote two different endings to the play, so that the audience could chose which they would prefer to see.\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\nconclusion\ndeath\nend\nexpiration\nexpiry\nfag\nfinalization\nfinish\nswansong\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\ntwilight\nSee more results »\nending noun [C]\n(WORD)\nB1 a part added to the end of a word: To make the plural of \"dog\", you add the plural ending -s.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsuffix\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nAdd to word list\nAdd to word list\nthe last part of a process, esp. the way in which something stops existing: The movie’s ending is so romantic!\ngrammar An ending is a part added to a word that changes its meaning: To make “dog” plural, you add the ending “-s.”"}