{"id":140351,"name":"endowment","type":"noun","us_sound":"ɪnˈdaʊ.mənt","us_link":"../audio/e/endowment.mp3","uk_sound":"ɪnˈdaʊ.mənt","uk_link":"../audio/e/ukencum025.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] money that is given to a college, hospital, etc. in order to provide it with an income, or the giving of this money: The school has received an endowment of $50,000 to buy new books for the library.\n[ C ] something that you have from birth, often a quality: There are tests that can establish a baby's genetic endowment.\nSMART Vocabulary: related words and phrases\nGrants & allowances\nanti-subsidy\nbenefit\nbenny\nbursary\ncost-of-living allowance\ndearness allowance\nexpense\nfellowship\nfringe benefit\nparachute payments\npension\npin money\nredundancy payment\nscholarship\nscrappage\nstipend\nsubsidized\nsubsidizer\nunemployment benefit\nweighting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\nAdd to word list\nAdd to word list\na gift of money that will provide an income for a college or university, a hospital, or other organization: We are trying to set up an endowment to support the library.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; SOCIAL RESPONSIBILITY money that is given to a college, hospital, etc. in order to provide it with an income, or the giving of this money: an endowment for sth The Las Vegas millionaire pledged $10 million for the project and an endowment for the school. An endowment of $11.3 billion.\n[ C ]\n&#160; INSURANCE\n&#160; (also endowment assurance); (endowment policy) a type of insurance in which you pay a regular amount of money over a particular period of time, or until you die, after which the insurance company pays an amount of money: We always aimed to ensure that customers understood that the eventual value of an endowment was not guaranteed. I was advised to take out an endowment.\n[ C ]\n&#160; PROPERTY an\nendowment mortgage : He was unhappy about the way he had been sold a mortgage endowment."}