{"id":140220,"name":"endorsement","type":"noun","us_sound":"ɪnˈdɔːrs.mənt","us_link":"../audio/e/endorsement.mp3","uk_sound":"ɪnˈdɔːs.mənt","uk_link":"../audio/e/ukencum020.mp3","content":"endorsement noun\n(APPROVAL)\nAdd to word list\nAdd to word list\n[ C or U ] the act of saying that you approve of or support something or someone: The campaign hasn't received any political endorsements.endorsement of He hoped to secure quick endorsement of the plan from the president.\n[ C or U ] the fact of a famous person appearing in an advertisement saying that they use and like a product: endorsement from products that carry an endorsement from a celebrity\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nendorsement noun\n(DRIVING LICENCE)\n[ C ] UK a mark on a driving licence that shows the driver is guilty of driving in an illegal way: endorsement on He's got a couple of endorsements on his licence already.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorse\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nendorsement noun\n(SUPPORT)\nAdd to word list\nAdd to word list\n[ C/U ] the act of making a public statement of your support for something or someone: [ U ] Both candidates have been seeking the union’s endorsement.\n[ C/U ] An endorsement is also a public statement, esp. by someone who is famous, that the person uses or likes a particular product: [ C ] Some athletes get contracts for product endorsements worth millions of dollars.\nendorsement noun\n(SIGNATURE)\n[ C ] the act of writing your name on a check: The bank won’t take checks that have no endorsements.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; MARKETING\n&#160; (also product endorsement) a statement made by someone in an advertisement, especially a well-known person, saying that they use and like a particular product: The company is considering other marketing tactics like celebrity endorsement and using cartoon characters to promote products. Artists and athletes can earn a lot of money from brands, film rights, product endorsements, and such things. an endorsement contract/deal The young swimmer has just signed a lucrative endorsement deal with a well-known swimwear maker.\n[ C or U ] a public statement made by someone saying that they approve of or support someone or something: endorsement of sth The stock exchange was boosted by the central bank's endorsement of another interest rate cut.a government/official/personal endorsement Federal regulators gave their official endorsement to a technology standard for digital TV broadcasts, clearing the way for the next-generation of TV sets. a ringing/strong/overwhelming endorsementendorsement by/from sb The plan, which would require endorsement by the federal government, is unlikely to be approved in its current form.\n[ C or U ]\n&#160; BANKING the act of signing the back of a cheque, bill of exchange, etc. that has your name on it in order to give your permission for it to be paid to someone else: What are the regulations for cheque endorsements?\n[ C ]\n&#160; INSURANCE a condition that is included in an insurance agreement: A policy endorsement can be used to modify a current policy without completely rewriting it."}