{"id":140216,"name":"endorse","type":"verb","us_sound":"ɪnˈdɔːrs","us_link":"../audio/e/eus71539.mp3","uk_sound":"ɪnˈdɔːs","uk_link":"../audio/e/ukencum019.mp3","content":"endorse verb [T]\n(SUPPORT)\nAdd to word list\nAdd to word list\nC2 to make a public statement of your approval or support for something or someone: The Council is expected to endorse the committee's recommendations.formal I fully endorse (= agree with) everything the Chairperson has said.\nto appear in an advertisement, saying that you use and like a particular product: They paid $2 million to the world champion to endorse their new aftershave.\nMore examplesFewer examplesI certainly don't endorse her views.The proposal was endorsed by the majority of members.I fully endorse what the speaker said.State governors are being urged to endorse the plan.The president doesn't endorse products himself regardless of their merits.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nendorse verb [T]\n(GIVE PERMISSION)\nto write something in order to give permission for something, especially your name on the back of a cheque, in order to make it payable (= able to be paid) to someone else\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nendorse verb [T]\n(PUNISH)\nUK to officially record on a driving licence that the driver has been found guilty of driving in an illegal way\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nendorse verb [T]\n(SUPPORT)\nAdd to word list\nAdd to word list\nto make a public statement of your approval or support for something or someone: We’re not endorsing tax increases. My wife has publicly endorsed Lunny for city council.\nIf someone endorses a product, a statement saying the person likes or uses the product is used in advertising the product.\nendorse verb [T]\n(SIGN)\nto write your name on a check: He endorsed the check and deposited it in his account.\nAdd to word list\nAdd to word list\nto state publicly that you approve of or support someone or something: endorse a decision/plan/proposal Federal safety regulators endorsed the company's decision to stop selling the product.be endorsed by sb/sth She has been endorsed by unions that represent nearly 4 million workers nationwide.endorse sb for sth The Commissioner praised the president and endorsed him for re-election. enthusiastically/strongly/vigorously endorse\nMARKETING to appear in an advertisement saying that you use and like a product: The league prohibits players from endorsing products related to alcohol, tobacco, casinos, or gambling.be endorsed by sb The new contemporary womenswear range - endorsed by well-known actress Tania Mitchell - was launched this autumn.\nBANKING to sign the back of a cheque, bill of exchange, etc. that has your name on it in order to give permission for it to be paid to someone else: To endorse a cheque the original payee just has to sign the back of the cheque and state the name of the person concerned.\nINSURANCE to include a condition in an insurance agreement: The insurer can be asked to endorse the insurance certificate to confirm that driving in the performance of the employer's business is covered by the policy."}