{"id":140390,"name":"endure","type":"verb","us_sound":"ɪnˈdʊr","us_link":"../audio/e/eus71542.mp3","uk_sound":"ɪnˈdʒʊər","uk_link":"../audio/e/ukencum029.mp3","content":"endure verb\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nB2 [ T ] to suffer something difficult, unpleasant, or painful: We had to endure a nine-hour delay at the airport. She's already had to endure three painful operations on her leg.\nThesaurus: synonyms, antonyms, and examples\nto accept or continue in a situation that is difficult or unpleasantbearI will bear the responsibility for whatever happens.endureShe endured years of hip pain before seeing a surgeon.sufferShe suffers from severe asthma. acceptI have finally accepted that I can't change who he is.resign yourself toI have resigned myself to the fact that I'll never work again.become resigned toPeople have become resigned to the fact that increased security means much longer wait times at airports.\nSee more results »\nMore examplesFewer examplesDuring the war many couples had to endure long periods of separation .The family said they had endured years of torment and abuse at the hands of the neighbours.Words alone cannot convey the untold misery endured by people in these refugee camps.By the third month of the expedition they had endured many hardships, but worse was to follow.He endured his illness with great stoicism.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nsit\nsit something out\nstruggle\nsweat it out idiom\ntolerance\ntough something out\nwait\nwait something out\nweather the storm idiom\nwithstand\nSee more results »\nendure verb\n(CONTINUE)\n[ I ] formal to continue to exist for a long time: The political system established in 1400 endured until about 1650.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nin the making idiom\ninsist on doing something\nisochronous\njag\nleg\nprotraction\npush ahead\npush on\nrun on\nrun someone/something over\nspan\nspin\nSee more results »\nRelated word\nendurable\nAdd to word list\nAdd to word list\nto experience and bear something difficult, painful, or unpleasant: [ T ] We had to endure a nine-hour delay at the airport."}