{"id":140388,"name":"endurance","type":"noun","us_sound":"ɪnˈdʊr.əns","us_link":"../audio/e/eus71541.mp3","uk_sound":"ɪnˈdʒʊə.rəns","uk_link":"../audio/e/ukencum028.mp3","content":"Add to word list\nAdd to word list\nC2 the ability to keep doing something difficult, unpleasant, or painful for a long time: Running a marathon is a test of human endurance. The pain was bad beyond endurance.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nsit\nsit something out\nstruggle\nsweat it out idiom\ntolerance\ntough something out\nwait\nwait something out\nweather the storm idiom\nwithstand\nSee more results »\nused to describe sports or activities that demand the ability to make a lot of physical effort over a long period of time, or people or animals who do these: endurance athlete Studies of elite sprinters reveal their leg muscles have more fast-twitch fibres, while marathon runners and other endurance athletes have more slow-twitch.endurance runner For endurance runners, performance is mainly a question of how efficiently the body can take in and burn oxygen.endurance sport In endurance sports, you can actually improve as you get older.\nMore examplesFewer examplesSmoothies are the drink of choice for many endurance athletes in need of quick protein and carbs for recovery.Soccer really is an endurance sport.He does speed training every morning and endurance training twice a week.The horse has been a speed racer, endurance racer, trail rider and prize winning show stallion.\nSMART Vocabulary: related words and phrases\nSports & games generally\nbattleship\nboard sport\nbuildering\nchoose\nchoose up sb/sth\nclassic\ncross-country\ndefensive\ndefensively\nhigh jinks\nland\nline\nparasport\nparkour\npickup\npre-game\npre-match\nsnooker\nsport\nthe first person\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAthletics\nExercising & training\nAdd to word list\nAdd to word list\nthe ability to continue doing something for a long time: He began visiting the gym to build up his strength and endurance."}