{"id":140427,"name":"energy","type":"noun","us_sound":"ˈen.ɚ.dʒi","us_link":"../audio/e/energy.mp3","uk_sound":"ˈen.ə.dʒi","uk_link":"../audio/e/ukendwa009.mp3","content":"energy noun\n(STRENGTH)\nAdd to word list\nAdd to word list\nB1 [ U ] the power and ability to be physically and mentally active: Since I started eating more healthily I've got so much more energy.have the energy I was going to go out this evening, but I just haven't got the energy. [ + to infinitive ] I didn't even have the energy to get out of bed.approving Her writing is full of passion and energy (= enthusiasm). energies [ plural ]\nthe total of all your power and ability to be mentally and physically active: I'm going to channel all my energies into getting a better job.\nSee more\nMore examplesFewer examplesI'm not being lazy - I'm just saving my energy for later.Her experience and energy are a winning combination in business.We were struck by the raw energy of the dancers' performances.For the past month he's been spending all his time and energy on trying to find a job.I'd like to go out this evening, but I don't think I've got the energy.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nenergy noun\n(POWER)\nB1 the power from something such as electricity or oil that can do work, such as providing light and heat: The energy generated by the windmill drives all the drainage pumps.energy conservation/efficiency The government needs to take action to promote energy conservation/efficiency.nuclear energy Fifty percent of people said they support nuclear energy, despite the dangers involved.\nMore examplesFewer examplesSolar power is the conversion of the sun's energy into heat and electricity.Plutonium is a fuel used to produce nuclear energy.The exploration for new sources of energy is vital for the future of our planet.Many countries are starting to turn their attention to new forms of energy.We must invest more in renewable energy sources such as wind and wave power.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nenergy noun\n(STRENGTH)\nAdd to word list\nAdd to word list\nthe power and ability to be physically and mentally active: [ U ] They spent a lot of time and energy on the grant proposal. [ U ] He wrote with a great burst of energy.\nYour energies are the total amount of your physical and mental strength to do something: [ pl ] All my energies were directed toward establishing an academic career.\nenergy noun\n(POWER)\n[ U ]\n&#160; physics power to do work that produces light, heat, or motion, or the fuel or electricity used for power: Certain materials acquired the ability to carry an electric charge with no loss of energy. The cost of energy rose last month.\nAdd to word list\nAdd to word list\nthe power from something such as electricity or oil, which can do work, such as providing light and heat: use/consume/waste energy 80% of the energy used to wash garments is needed to heat the water.save/conserve energy We aim to manage and conserve energy and water efficiently within all our premises.provide/produce/generate energy These power stations work 24 hours a day, providing energy to the nation. energy use/costs energy supply/production wind/wave/solar energy See also\neco-energy\ngreen energy\nnon-renewable energy\nrenewable energy\nsustainable energy"}