{"id":140542,"name":"enforce","type":"verb","us_sound":"ɪnˈfɔːrs","us_link":"../audio/e/eus71545.mp3","uk_sound":"ɪnˈfɔːs","uk_link":"../audio/e/ukendwa016.mp3","content":"Add to word list\nAdd to word list\nC1 to make people obey a law, or to make a particular situation happen or be accepted: It isn't always easy for the police to enforce speed limits. The new teacher had failed to enforce any sort of discipline.\nMore examplesFewer examplesThe army were called out to enforce the curfew.Aircraft will enforce the no-fly zone to protect UN forces on the ground.The new law was generally admitted to be difficult to enforce.It is the job of the inspectors to enforce compliance with the regulations.The changes to the tax system proved impracticable as they were impossible to enforce.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nsanction\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObeying & breaking the law\nRelated words\nenforceable\nenforcement\nAdd to word list\nAdd to word list\nto cause a law or rule to be obeyed: We need to enforce the traffic laws. enforcement noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈfɔrs·mənt, -ˈfoʊr-/\nlaw enforcement\nAdd to word list\nAdd to word list\nLAW to make sure that people obey something such as a law or rule: Regulations do not mean anything unless they are enforced. The bar had a lawsuit filed against it for not enforcing the smoking ban.\nto force somebody to do something, or to make sure that something happens: Ministers are preparing to enforce a minimum price for beer. Instead of making enforced redundancies, the company will offer employees other alternatives, such as early retirement."}