{"id":140588,"name":"engaged","type":"adjective","us_sound":"ɪnˈɡeɪdʒd","us_link":"../audio/e/engaged.mp3","uk_sound":"ɪnˈɡeɪdʒd","uk_link":"../audio/e/ukendwa023.mp3","content":"engaged adjective\n(MARRIAGE)\nAdd to word list\nAdd to word list\nB1 having formally agreed to marry: get engaged Debbie and Christa have just got engaged.engaged to She was engaged to some guy in the army.engaged to be married formal They're engaged to be married in June.\nMore examplesFewer examplesHe asked her to sign a prenuptial agreement when they got engaged.She told me that she'd been engaged three times, but had never actually married.This photo was taken when we were engaged.Where this form asks about my marital status, should I write 'engaged' or just 'single'?She got engaged to her childhood sweetheart as soon as she left school.\nSMART Vocabulary: related words and phrases\nMarriage, cohabitation & other relationships\nadulteress\naffinal\nas husband and wife idiom\nbe an item idiom\nbe shacked up idiom\nhave an affair\nhave something going with someone idiom\nhear wedding bells idiom\nhitched\nhonest\nmatrimonial\nmatrimonially\nmatrimony\nmonogamist\nménage à trois\nsame-sex marriage\nserial monogamy\nseven-year itch\nshack\nshack up\nSee more results »\nengaged adjective\n(INVOLVED/BUSY)\n[ after verb ] involved in something: engaged in They've been engaged in a legal battle with the council for several months.engaged on/upon She's part of a team of scientists who are engaged on/upon cancer research.\n[ after verb ] formal busy doing something: otherwise engaged I'd come to the meeting on Tuesday but I'm afraid I'm otherwise engaged (= doing something else).\nThesaurus: synonyms, antonyms, and examples\nnot availablebusyI'm busy all morning - can we meet up in the afternoon?tied upI'll be tied up in meetings until 3.00pm, but could meet after that.unavailableThe CEO is currently unavailable - may I take a message?engagedI can't come to tea - I'm engaged elsewhere.\nSee more results »\nMore examplesFewer examplesThe soldiers were engaged in hand-to-hand combat.Rescuers were engaged in a frantic all-night effort to reach the survivors before their supply of air ran out.So, what is this big research project you're engaged upon at the moment?We wondered whether the mysterious gentleman was engaged upon a secret government mission.During the war, she was actively engaged in the resistance.\nSMART Vocabulary: related words and phrases\nBusy and active\nabustle\narena\nbe (as) busy as a bee idiom\nbe all go idiom\nbe at work idiom\nbe back in harness idiom\nboot\nfrenetic\nfrenetically\ngangbusters\ngirlie swot\nhard-working\nmad\nplate\nrun round\nrun round in circles idiom\nrun round like a headless chicken idiom\nrush/run someone off their feet idiom\nscurry\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnavailable and inaccessible\nMachines - Functioning\nengaged adjective\n(IN USE)\nB1 If a phone or public toilet is engaged, someone is already using it: Every time I call her, she/the phone/the number is engaged.get the engaged tone UK I've been trying to call him all evening, but I keep getting the engaged tone. The sign on the toilet door said \"Engaged\". Compare\nvacant (EMPTY)\nMore examplesFewer examplesHis phone is engaged - can I put you on hold?I've called him several times but his phone is always engaged.The doctor's consulting room said \"Engaged\" on the door, but nobody was in there.When the aircraft's toilet is engaged, the \"occupied\" sign is lit up.All of the cubicles in the changing room were engaged, so we had to wait a few minutes.\nSMART Vocabulary: related words and phrases\nUnavailable and inaccessible\nbooked up\nbusy\nbusy signal\ndiscontinued\ngone\nimpenetrability\nimpenetrable\ninsusceptible\nirrecoverable\nirrecoverably\nlost\nout-of-pocket\npocket\nspoken for\ntie\ntie someone up\nunaccounted for\nunavailability\nunavailable\nunsusceptible\nSee more results »\nAdd to word list\nAdd to word list\npublicly promising that you intend to marry someone: They decided to get engaged.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS\n&#160; UK if a telephone is engaged, someone is already using it: Customers calling to book tickets found the line was constantly engaged. See also\nbusy\nbusy doing something: The president is currently engaged but you can meet with his deputy.\nbe engaged as sth\nto be working as something: At that time she was engaged as an adviser to several government departments.\nbe engaged in sth\nto be involved in something: The broadcaster is engaged in a complex legal battle over a failed joint venture."}