{"id":140634,"name":"engineer","type":"noun","us_sound":"ˌen.dʒɪˈnɪr","us_link":"../audio/e/eus75694.mp3","uk_sound":"ˌen.dʒɪˈnɪər","uk_link":"../audio/e/ukendwa030.mp3","content":"Add to word list\nAdd to word list\nA2 a person whose job is to design or build machines, engines, or electrical equipment, or things such as roads, railways, or bridges, using scientific principles: a civil engineer a mechanical/structural engineer a software engineer\na person whose job is to repair or control machines, engines, or electrical equipment: a computer engineer The engineer is coming to repair our phone tomorrow morning.\nUS (UK engine driver) a train driver\nMore examplesFewer examplesa sound engineerAs an engineer, he was a disaster.He started his working life as an engineer but later became a teacher.A top German engineer has been appointed to troubleshoot the cause of the accident.The engineer soon got the air-conditioning up and running again.\nSMART Vocabulary: related words and phrases\nCivil engineering in general\nbrownfield\nbuilt environment\ncaisson\ncivil engineer\ncivil engineering\ngeotechnical\ninfrastructure\nlineman\nlinesman\nplanning\nplanning permission\npurpose-built\nquantity surveyor\nreclamation\nribbon development\nstructural engineer\nsubsea\ntown planner\ntown planning\nurbanize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRailway workers\nengineer verb [T]\n(ARRANGE)\nto arrange cleverly and often secretly for something to happen, especially something that is to your advantage: Left-wing groups engineered a coup against the military government. I'm trying to engineer a meeting between them.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nengineer verb [T]\n(BUILD)\nto design and build something using scientific principles\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthemed\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nengineer noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\na person specially trained to design and build machines, structures, and other things, including bridges, roads, vehicles, and buildings: He is an engineer at a large electronics company.\nAn engineer is also a person whose job is to drive railroad trains.\nengineer verb [T]\n(DESIGN OR BUILD)\nto plan, design, or build according to scientific principles: The bridge is engineered to withstand an earthquake.\nengineer verb [T]\n(PLAN SKILLFULLY)\nto plan or do something in a skillful way: The administration engineered a compromise.\nAdd to word list\nAdd to word list\nPRODUCTION a person whose job is to design or build machines, engines or electrical equipment, or things such as roads, railways or bridges, using scientific principles: This is high-quality technical consultancy performed by highly trained engineers.design/mining engineer James Dyson is arguably Britain's best-known design engineer of modern times.\nWORKPLACE a person whose job is to repair or control machines, engines or electrical equipment: a service/telephone/heating engineer See also\nautomotive engineer\nchemical engineer\ncivil engineer\nelectrical engineer\nfinancial engineer\nmechanical engineer\nproduct engineer\nproject engineer\nquality engineer\nsales engineer\nView all\nsoftware engineer\nstructural engineer\nPRODUCTION to design and build something using scientific principles: If you tell us the size of the part that you need, we will engineer it to fit.\nto try to arrange for something to happen, usually something complicated or difficult: The more restrictive economic environment comes as part of China's effort to engineer a gradual slowdown of its economic boom."}