{"id":140632,"name":"engine","type":"noun","us_sound":"ˈen.dʒɪn","us_link":"../audio/e/eus75693.mp3","uk_sound":"ˈen.dʒɪn","uk_link":"../audio/e/ukendwa029.mp3","content":"Add to word list\nAdd to word list\nA2 a machine that uses the energy from liquid fuel or steam to produce movement: a jet engine a car engine My car's been having engine trouble recently. Compare\nmotor noun (DEVICE)\nsdbower/iStock/Getty Images Plus/GettyImages\n(also locomotive) the part of a railway train that pulls it along\nrobynleigh/iStock/Getty Images Plus/GettyImages\nsomething that provides power, often economic power, for other things: engine of economic growth For much of the 19th century Britain was the workshop of the world and the engine of economic growth.\nMore examplesFewer examplesTell the mechanic that the engine was making a strange grinding noise.It's fairly simple to modify the engine to run on lead-free fuel.The plane's engine failed and the pilot was forced to bail out.My car engine overheated because the water had leaked out of the radiator.The boat was about a mile from the shore when the engine suddenly died.\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ndisc brake\ndistributor\ninternal combustion engine\nmanual transmission\nmuffler\nneutral\nsuspension\ntailpipe\ntappet\nwater-cooled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Engines & motors\nRailways: trains & parts of trains\nPower to control\nAdd to word list\nAdd to word list\na machine that uses the energy from fuel or steam to produce movement: The car has a four-cylinder engine. fig. The health-care industry has been an engine of growth. The plane was forced to land because of engine problems.\nAn engine (also (also locomotive)) is a separate part of a train that pulls the other parts of the train.\nAdd to word list\nAdd to word list\na machine that uses energy to produce movement: a jet engine a car/aircraft engine\nsomething that makes something happen, or that influences it strongly: For much of the 19th century Britain was the workshop of the world and the engine of economic growth.\nIT a computer program that performs a particular task: This is a new payment engine that can handle online payments securely. See also\nsearch engine"}