{"id":140891,"name":"enjoy","type":"verb","us_sound":"ɪnˈdʒɔɪ","us_link":"../audio/e/eus71552.mp3","uk_sound":"ɪnˈdʒɔɪ","uk_link":"../audio/e/ukengin019.mp3","content":"enjoy verb [T]\n(PLEASURE)\nAdd to word list\nAdd to word list\nA1 to get pleasure from something: I really enjoyed that movie/book/concert/party/meal. [ + -ing verb ] I want to travel because I enjoy meeting people and seeing new places.\nThesaurus: synonyms, antonyms, and examples\nto get pleasure from somethingenjoyEnjoy your meal!enjoy yourselfHe's enjoying himself at his job.likeI like hiking a lot.loveAfter working in the garden, I love a good soak in the tub.relishJonathan always relishes a challenge.lap upHe lapped up all the attention they gave him.\nSee more results »\nenjoy yourself\nA2 to get pleasure from the situation that you are in: I don't think Marie is enjoying herself very much at school. Come on, why aren't you dancing? Enjoy yourselves!\nThesaurus: synonyms, antonyms, and examples\nto get pleasure from somethingenjoyEnjoy your meal!enjoy yourselfHe's enjoying himself at his job.likeI like hiking a lot.loveAfter working in the garden, I love a good soak in the tub.relishJonathan always relishes a challenge.lap upHe lapped up all the attention they gave him.\nSee more results »\nMore examplesFewer examplesI'm ready to go home now but I don't want to drag you away if you're enjoying yourself.The beer festival was a huge open-air event with music, stalls and everyone enjoying themselves.Time passes so quickly when you're enjoying yourself.Don't be spoilsport - let the children enjoy themselves a little!We all enjoyed ourselves tremendously at the party.\nenjoy! informal\nsomething you say to someone when you have given that person something and you want them to enjoy it: Here are your drinks. Enjoy!\nMore examplesFewer examplesI used to enjoy going to the theatre, but I don't get much opportunity now.After a hard day's work I enjoy a beer or two.\"It was very kind of you to look after the baby all day.\" \"Oh, it was nothing, I enjoyed it.\"I enjoyed my course at first, but after a time I got bored with it.The whole family was enjoying a leisurely stroll in the sunshine.\nSMART Vocabulary: related words and phrases\nTaking pleasure in something\nbask\nbask in something\nbask/bathe in reflected glory idiom\nbe a glutton for punishment idiom\nbe a great one for something idiom\ngad about/around (somewhere)\nget over something/someone\nget your jollies idiom\nglory in something\nglutton\ngo in for something\nluxuriate in something\nmasochism\nmasochistic\nmasochistically\nmeat\nsavour\nslaver\nwallow\nwhoop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: interjections\nenjoy verb [T]\n(GOOD THING)\nC2 to have something good or lucky: Even though he's 86, he enjoys excellent health.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nGrammar\nEnjoyThe regular verb enjoy means ‘get pleasure from something’. It usually has an object: …\nenjoy verb [T]\n(LIKE TO DO)\nAdd to word list\nAdd to word list\nto feel happy because of doing or experiencing something: We enjoyed the scenery. I enjoyed your book very much. Enjoy your weekend. She liked her job because she enjoyed meeting people.\nTo enjoy yourself is to feel happy because of a situation or an event in which you took part: I really enjoyed myself last night.\nenjoy verb [T]\n(BENEFIT)\nto have the benefit of something: The schools here enjoy strong community support. She enjoyed good health well into her 90s."}