{"id":141124,"name":"enough","type":"determiner","us_sound":"əˈnʌf","us_link":"../audio/e/enough.mp3","uk_sound":"ɪˈnʌf","uk_link":"../audio/e/ukenliv011.mp3","content":"Add to word list\nAdd to word list\nA2 as much as is necessary; in the amount or to the degree needed: enough for Is there enough dessert/Are there enough desserts for everyone? There are 25 textbooks per class. That should be enough.enough (to) Have you had enough (to eat)? I know enough about art to recognize a masterpiece when I see one. He's tall enough to change the bulb without getting on a chair.\nB2 as much as or more than is wanted: [ + to infinitive ] I've got enough work to do at the moment, without being given any more.quite enough Half an hour in his company is quite enough!enough of a Stop. You've made enough of a (= a lot of) mess already.more than enough You've drunk more than enough (= too much) already.see/hear enough I've seen/heard enough now (= I do not want to see/hear any more).have enough of I've had enough of your excuses (= I want them to stop).enough of this Enough of this! I don't want to discuss it any more. Enough already! (= No more!) enough is enough\nsomething you say when you want something to stop: Enough is enough - I don't want to argue with you any more.\nSee more enough said informal\nsomething you say to tell someone that you understand what they have said and that there is no need to say any more: \"Someone has to explain the situation to her.\" \"Enough said.\"\nSee more have had enough\nC1 to want something to stop because it is annoying you: I've had enough - I'm going home.\nSee more that's enough\nused to tell someone to stop behaving badly: That's enough, Peter. Give those toys back, please. \"Hush,\" said grandma. \"That's enough now.\" Lola, Rachel, that's enough! I'm fed up with your arguing. That's enough! We'll never resolve this if you can't be civil. That's enough! I won't tolerate any more of this behaviour!\nMore examplesFewer examplesMy concern is that you're not getting enough work done.There isn't enough contact between teachers and parents.He didn't allow us enough time to finish the test.Are there enough pencils for everyone?I hadn't had enough sleep and was feeling a bit grumpy.\nSMART Vocabulary: related words and phrases\nEnough\nadequacy\nadequate\nadequately\nfill\ngo\ngo round\ngood\nhold out\nrespectable\nrespectably\nsatiable\nsatisfiable\nsay\nsay when idiom\nsufficiency\nsufficient\nsufficiently\nthat\nthat will do idiom\nthe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: expressions telling people to stop doing something\nGrammar\nEnoughEnough is a determiner, a pronoun or an adverb. We use enough to mean ‘as much as we need or want’. …\nA2 used after an adjective, adverb, or verb to mean to the necessary degree: Is the water hot enough yet? I don't think he's really experienced enough for this sort of job.enough to She told me it was brand new and I was stupid enough to believe her.good enough to formal Would you be good enough to take my suitcase upstairs for me?\nused after an adjective or adverb to mean quite: He's bad enough, but his brother is far worse. She's gone away for six months, but strangely/oddly/funnily enough (= surprisingly), her boyfriend doesn't seem too unhappy about it.\nMore examplesFewer examplesYou don't chew your food enough - that's why you get indigestion.We're not doing enough to protect the environment from pollution.You won't be warm enough in that flimsy dress.Barry seems happy enough working for himself.Will the rope be strong enough to hold my weight?\nSMART Vocabulary: related words and phrases\nEnough\nadequacy\nadequate\nadequately\nfill\ngo\ngo round\ngood\nhold out\nrespectable\nrespectably\nsatiable\nsatisfiable\nsay\nsay when idiom\nsufficiency\nsufficient\nsufficiently\nthat\nthat will do idiom\nthe\nSee more results »\nGrammar\nEnoughEnough is a determiner, a pronoun or an adverb. We use enough to mean ‘as much as we need or want’. …\nAdd to word list\nAdd to word list\nas much as is necessary; in the amount or to the degree needed: Do we have enough lettuce for a salad? He had just enough time to make his train. [ + to infinitive ] Have you had enough to eat? [ + to infinitive ] I think she’s well enough now to make the trip. You’ll find out when we’re leaving soon enough.\nEnough can also mean as much or more than is wanted: I think we’ve heard enough. [ + to infinitive ] I have enough to do without taking on any more work. Idioms\nenough is enough\nstrangely enough"}