{"id":141190,"name":"enrich","type":"verb","us_sound":"ɪnˈrɪtʃ","us_link":"../audio/e/eus71561.mp3","uk_sound":"ɪnˈrɪtʃ","uk_link":"../audio/e/ukenliv020.mp3","content":"enrich verb\n(IMPROVE)\nAdd to word list\nAdd to word list\nC1 [ T ] to improve the quality of something by adding something else: Fertilizer helps to enrich the soil. My life was greatly enriched by knowing her.\nMore examplesFewer examplesThese trips give students the opportunity to enrich their independent studies in geography and history.The presentations could be enriched with more digital media.Her work enriches our view of the 1960s.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nenrich verb\n(GIVE MORE MONEY)\n[ T ] to make something or someone richer: enrich yourself He claimed that the large stores were enriching themselves at the expense of their customers.\nMore examplesFewer examplesThe government's economic policies are designed to enrich insiders.The reforms will not benefit ordinary people but simply enrich law firms.Unfortunately, other attorneys act like predators, exploiting patients and physicians to enrich themselves.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nenrich verb\n(ELEMENT)\nto increase the level of a particular isotope (= one form of an atom) in an element in order to make it more powerful or make it explode more powerfully: The country disclosed in 1984 that it could enrich uranium for nuclear weapons.\nMore examplesFewer examplesHe was a metallurgist employed by a European consortium that enriched uranium for nuclear power. Facilities housing plutonium and enriched uranium were often poorly guarded.Nobody knows when the regime will have enriched enough uranium for a bomb.He came forward with allegations that the government was enriching uranium at a secret site.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nfermentation\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: atoms, molecules & sub-atomic particles\nBombs & missiles\nRelated word\nenrichment\nAdd to word list\nAdd to word list\nto improve the quality of something by adding something else: The heritage of Africa has greatly enriched American life. Uranium is enriched for use in nuclear reactors.\nTo enrich is also to make richer: The rock music of the 1960s enriched the big recording companies. enrichment noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪnˈrɪtʃ·mənt/\na course offering language enrichment"}