{"id":141198,"name":"enrichment","type":"noun","us_sound":"ɪnˈrɪtʃ.mənt","us_link":"../audio/e/enrichment.mp3","uk_sound":"ɪnˈrɪtʃ.mənt","uk_link":"../audio/e/ukenliv021.mp3","content":"enrichment noun [U]\n(IMPROVEMENT)\nAdd to word list\nAdd to word list\nthe act or process of improving the quality or power of something by adding something else: The soil needs constant enrichment with organic matter. The children who do well on such tests are those whose parents read to them and take them on enrichment excursions.\nMore examplesFewer examplesEducation provides enrichment to the lives of individuals in a number of ways.She lives in a big city with endless opportunities for cultural enrichment.The research team designed and implemented a maths enrichment programme for Year 10 students.\nSMART Vocabulary: related words and phrases\nMaking things better\nadd salt to something idiom\nallay\nalleviate\nalleviation\nameliorate\ncultivate\nlevelling up\nlighten\nliven (something) up\nlubricate\nmake a difference idiom\nmake a world of difference idiom\nrectify\nremedial\nrepair\nrepolish\nrestructure\nrevamp\nrevitalize\nsharpen\nSee more results »\nenrichment noun [U]\n(MAKING WEALTHY)\nthe act of making someone richer, or of becoming richer: personal enrichment There was never any suggestion that they were seeking personal enrichment. Their goal is not the good of the people, but their own enrichment.\nMore examplesFewer examplesThey have been portrayed as bad guys, determined to bulldoze the area for their own enrichment.He has been investigated twice on suspicion of corruption and illegal enrichment.She needs to avoid unjust enrichment at the other person’s expense.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nlivelihood\nmake an honest living idiom\npro rata\nprorate\npull\npull something down\nraise\nrake something in\nremonetize\nrevenue\nsick pay\nSee more results »\nenrichment noun [U]\n(OF ELEMENT)\nthe process of increasing the level of a particular isotope (= one form of an atom) in an element in order to make it more powerful or make it explode more powerfully: uranium enrichment He said that sanctions would not force his country to suspend uranium enrichment.\nMore examplesFewer examples They have agreed to stop certain activities involving uranium enrichment and plutonium separation.There's an intention to proceed with nuclear enrichment, which they say is for peaceful purposes. The country could quickly develop atomic weapons through the production of plutonium and enrichment of uranium.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ncorrode\ndegradable\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nfermentation\nimpregnate\nre-emit\nreabsorb\nreact\nreboil\nrecondense\nscald\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: atoms, molecules & sub-atomic particles\nBombs & missiles\nSee\nenrich"}