{"id":141640,"name":"enterprise","type":"noun","us_sound":"ˈen.t̬ɚ.praɪz","us_link":"../audio/e/eus71568.mp3","uk_sound":"ˈen.tə.praɪz","uk_link":"../audio/e/ukensla013.mp3","content":"enterprise noun\n(BUSINESS)\nAdd to word list\nAdd to word list\nC1 [ C or U ] an organization, especially a business, or a difficult and important plan, especially one that will earn money: commercial enterprise Don't forget this is a commercial enterprise - we're here to make money.private enterprise Those were the years of private enterprise (= businesses being run privately, rather than by the government), when lots of small businesses were started. Her latest enterprise (= plan) is to climb Mount Everest. Synonyms\nbusiness (COMPANY)\nbusiness (SELLING)\ncommerce\nconcern (BUSINESS)\ntrade (BUSINESS)\ntrade (BUYING AND SELLING)\nMore examplesFewer examplesa state-owned enterpriseThis is an unusual act of collaboration between a museum and a commercial enterprise.The spirit of competition and free enterprise is alive and well here in Dixie.It is a government-sponsored enterprise.Because the organization is a charitable enterprise it is free from tax worldwide.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfirm\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nenterprise noun\n(PERSONAL QUALITY)\nC1 [ U ] eagerness to do something new and clever, despite any risks: enterprise in They've shown a lot of enterprise in setting up this project. We need someone with enterprise and imagination to design a marketing strategy.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nfrenzy\nfriskiness\nfrisson\nfrolic\nget-up-and-go\nglam\nhubbub\nperkiness\nphysicality\npiquancy\npizzazz\npzazz\nzeal\nzealousness\nSee more results »\nAdd to word list\nAdd to word list\nan organization, esp. a business, or a difficult and important plan, esp. one that will earn money: [ U ] private enterprise [ C ] The road is bordered by shopping centers, restaurants, retail outlets, and other commercial enterprises.\nEnterprise is also the willingness and energy to do something new that takes a lot of effort: [ U ] They’ve showed a great deal of enterprise in setting up this project.\nAdd to word list\nAdd to word list\n[ C ] an organization, a company, or a business: a manufacturing/catering/farming enterprise a large/small/medium-sized enterprise a state/state-owned/multinational enterprise a domestic/local/foreign enterprise He was responsible for building the pizza company into a billion-dollar enterprise. They run a family enterprise in their local town.enterprise development/management The grants are intended to support local small enterprise development.\n[ C ] a business plan or project, especially one that is difficult or that may fail or lose money: a business/commercial/economic enterprise What we always look for in a future business partner is a commitment to the business enterprise and its success. a successful/joint enterprise\n[ U ] business activity in general: boost/encourage/promote enterprise The government unveiled a wide range of measures to boost business and enterprise yesterday. The enterprise and development committee supports innovation in business.\n[ U ] the quality or activity of thinking of new ideas and activities in business and making them successful despite the risks involved: The prime minister applauded the innovation of private entrepreneurs and said he would like to see similar enterprise in the public sector, too. The scheme rewards young people who show initiative and enterprise. See also\nfree enterprise\nprivate enterprise\npublic enterprise"}