{"id":141660,"name":"entertainment","type":"noun","us_sound":"en.t̬ɚˈteɪn.mənt","us_link":"../audio/e/eus71570.mp3","uk_sound":"en.təˈteɪn.mənt","uk_link":"../audio/e/ukensla020.mp3","content":"Add to word list\nAdd to word list\nB1 shows, films, television, or other performances or activities that entertain people, or a performance of this type: There's not much in the way of entertainment in this town - just the cinema and a couple of pubs.formal This season's entertainments include five new plays and several concerts of Chinese and Indian music. Synonym\namusement\nMore examplesFewer examplesThis film is good family entertainment .I thought there was some in-flight entertainment on the Heathrow-New York flight.They lay on free entertainment at the club every day.What did you do for entertainment while you were staying there - just watch TV?Stars of the entertainment world turned out to celebrate his 40th year in show business.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\nmano a mano\nmusic hall\nnon-musical\none-night stand\none-person\nopen mic\nroutine\nspectacular\nstrip\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntableau\ntattoo\nSee more results »\nAdd to word list\nAdd to word list\npublic shows, performances, or other ways of enjoying yourself: [ C ] popular/family entertainments the entertainment industry [ U ] We’ve set a budget for household expenses, clothing, and entertainment.\nAdd to word list\nAdd to word list\nthe activity of taking customers or possible customers out to restaurants, bars, theatres, etc. as a way of encouraging them to do business with you: Each manager has a fixed entertainment budget. The company is cutting back on money spent on corporate entertainment this year.\nthe business of making films, television programmes, shows, etc. that entertain people: the entertainment business/industry an entertainment company/group See also\nhome entertainment"}