{"id":141504,"name":"enter","type":"verb","us_sound":"ˈen.t̬ɚ","us_link":"../audio/e/enter.mp3","uk_sound":"ˈen.tər","uk_link":"../audio/e/ukensla011.mp3","content":"enter verb\n(PLACE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to come or go into a particular place: enter through/by The police entered (the building) through/by the side door.enter the bloodstream You will begin to feel sleepy as the drug enters the bloodstream.\nMore examplesFewer examplesHer eyes brightened when she saw him enter the room.Before you can enter the country, you have to clear customs.Please knock before entering.Bathers must be fully clothed before entering the restaurant.Intruders had entered the house through a back window.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nenter verb\n(COMPETITION)\nB1 [ I or T ] to be included in a competition, race, or exam, or to arrange for someone else to do this: be entered for/in Both men have been entered for/in the 100 metres in Paris next month.enter the race All three companies have entered the race to develop a new system.enter a competition Are you going to enter the photography competition?\nMore examplesFewer examplesShe's entered a crossword competition.Another candidate has now entered the presidential race .Only people over the age of 16 can enter the competition.A total of 21 horses were entered for the race.For details on how to enter the competition, see page 134.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking part and getting involved\nenter verb\n(INFORMATION)\nB1 [ T ] to put information into a computer, book, or document: enter a password You have to enter a password to access the database.\n[ T ] formal to make a particular type of statement officially: enter a plea The prisoner entered a plea of not guilty.\nMore examplesFewer examplesBefore we leave work each day, we make a backup of all the records we have entered into the computer that day.The data is validated automatically by the computer after it has been entered.Have you entered your password?Tape recordings of conversations are transcribed by typists and entered into the database.Please enter your username and password.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\nTaking legal action\nenter verb\n(ORGANIZATION)\n[ T ] to become a member of a particular organization, or to start working in a particular type of job: enter politics/Parliament Ms Doughty entered politics/Parliament after a career in banking.\nMore examplesFewer examplesShe was a medical practitioner before she entered politics.He was in his thirties when he decided to enter the church.What made you decide to enter the fashion world?It's perhaps not the best time to enter the teaching profession.At the age of 30 he decided to enter the world of publishing.\nSMART Vocabulary: related words and phrases\nOrganizations - joining & leaving\naddition\nanti-assimilation\nassimilation\nassimilationist\nassimilative\nassimilatory\nblackball\ndisenrollment\nenrol\nenrolment\nentrant\nentry\nentryway\nexit\ninitiation ceremony\njoiner\nnon-joiner\non the books idiom\nonto\nsit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nenter verb\n(PERIOD)\nC1 [ T ] to begin a period of time: enter a stage The project is entering its final stages. The violence is now entering its third week.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwheel\nSee more results »\nPhrasal verbs\nenter into something\nenter on/upon something\nthe key on a computer keyboard that is used to say that the words or numbers on the screen are correct, or to say that an instruction should be performed, or to move down a line on the screen: Move the cursor to where it says \"New File\" and press enter.\nSMART Vocabulary: related words and phrases\nComputer hardware\n3-D printer\nassociative memory\nblackberry\nbrick\nbubblejet\ndata projector\nelectronic organizer\nflat screen\ngamepad\nhard drive\nmainframe\nmicrochip\nnumber pad\noptical character reader\noptical reader\noptically\npalmtop\npatch\nplug and play\nprinter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nenter verb\n(GO IN)\nAdd to word list\nAdd to word list\n[ I/T ] to come or go into a place: [ T ] The orchestra entered the hall. [ T ] He entered a shelter for the homeless. [ I ] Half of the museum’s visitors are children who enter for free.\n[ I/T ] To enter is also to be admitted to or become a member of an organization: [ I ] He entered the army at the age of 18.\nenter verb\n(BEGIN)\n[ I/T ] to begin or become involved in something: [ T ] The president maintained we were about to enter a period of unprecedented economic growth. [ I ] She entered into an exclusive contract with an international sports shoe company.\nenter verb\n(RECORD)\n[ T ] to make a record of something; list: Did you enter your names in the guest book? Use this computer to enter the data. He was entered (= listed officially as taking part) in the shot put and discus events.\n[ T ] law To enter is to make something, such as a statement or a piece of evidence, a part of the official record: He entered a plea of not guilty.\nAdd to word list\nAdd to word list\nto begin taking part in a particular market or area of business: enter a market/business This ruling should make it easier for first-time buyers to enter the housing market (= to buy a property for the first time).\nIT to put information into a computer: At the prompt, please enter a valid email address.enter data/information (into sth) All information is entered into a database and analyzed for patterns.\nACCOUNTING to write information into an account book, a list, etc.: All customer payments must be entered into the accounts book at the time of purchase. Before the meeting, the number of hours requested from each department is entered onto the spreadsheet opposite each project.\nif people or goods enter a country or region, they arrive there: Legitimate visa holders should be allowed to enter and leave the country, and to apply for a renewal of their visa while still in America. All cargo vessels entering the port are stopped and inspected.\nto begin a period of time: enter an era/a phase/a cycle The company entered a new era today with its first pre-tax profit. Now is not the time to buy, just as we are entering a recession. The country's economy is entering its eighth year of uninterrupted growth.\nto start working in a particular type of job, or to become a member of a particular organization: Now is a peak time for young people to enter the profession.\nto officially make an agreement or begin a discussion with another person or organization: enter a contract/agreement/partnership The two companies plan to enter a joint distribution agreement to distribute the products in their respective markets. enter discussions/talks with sb\nenter the fray\nto begin to take part in a competitive situation: The rumoured interest of a US venture capitalist triggered speculation that a rival could enter the fray.\nenter a plea of guilty/not guilty\nLAW to officially state that you are guilty/not guilty of a crime in a court of law\nenter service\nto begin to be used for the first time: The A380 - the world's biggest passenger jet - entered service in 2006. Phrasal verb\nenter into sth\none of the set of moving parts that you press with your fingers on a computer when you have typed an instruction or want to start a new line: Type in the data and then press enter."}