{"id":141652,"name":"entertain","type":"verb","us_sound":"en.t̬ɚˈteɪn","us_link":"../audio/e/eus71569.mp3","uk_sound":"en.təˈteɪn","uk_link":"../audio/e/ukensla016.mp3","content":"entertain verb\n(AMUSE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to keep a group of people interested or enjoying themselves: We hired a magician to entertain the children. Most children's television programmes aim to educate and entertain at the same time.\nMore examplesFewer examplesMilligan's anarchic humour has always had the power to offend as well as entertain.Year after year they wheel out the same third-rate celebrities to entertain us.Should the function of children's television be to entertain or to enlighten?The crowd was entertained with a display of aerobatics.The crowds were once again entertained by the number one tennis player's antics on and off the court.\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\na good time was had by all idiom\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nemcee\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\npush\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nrevel\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure\nentertain verb\n(INVITE)\n[ I or T ] to invite someone to your home and give food and drink to them: We entertain a lot of people, mainly business associates of my wife's. Now that I live on my own, I don't entertain much.\nSMART Vocabulary: related words and phrases\nCelebrating & entertaining\na good time was had by all idiom\namuse\namused\nbacchanalian\nbanqueting\nbar-hop\nemcee\nentertaining\nents\ngo to town idiom\nhoot\nhostess\npropose\npush\nregale someone with something\nrejoice\nrejoicing\nrejoicingly\nrevel\nthrow\nSee more results »\nentertain verb\n(THINK ABOUT)\n[ T not continuous ] formal to hold something in your mind or to be willing to consider or accept something: The General refused to entertain the possibility of defeat.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nlet me see/let's see idiom\nnavel\nreckon\nreflection\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nself-exploration\nweigh\nSee more results »\nentertain verb\n(AMUSE)\nAdd to word list\nAdd to word list\n[ I/T ] to keep a person or a group of people interested or amused: [ I ] Children’s games and books seek to teach and entertain at the same time. [ T ] Kerry and Bill entertained listeners of their radio show with tales of their adventures on an ocean cruise.\nentertain verb\n(INVITE)\n[ I/T ] to invite one or more people to your house and give food and drink to them: [ T ] She was a good cook and liked to entertain her friends with new dishes. [ I ] We didn’t entertain much over the holidays this year.\nentertain verb\n(THINK ABOUT)\n[ T ] to hold in your mind or to be willing to consider or accept: He entertained some doubts about how truthful the government was.\nAdd to word list\nAdd to word list\nto take customers or possible customers out to restaurants, bars, theatres, etc. as a way of encouraging them to do business with you: Employees can use their expense accounts for entertaining a client."}