{"id":141755,"name":"entitle","type":"verb","us_sound":"ɪnˈtaɪ.t̬əl","us_link":"../audio/e/eus71577.mp3","uk_sound":"ɪnˈtaɪ.təl","uk_link":"../audio/e/ukentic007.mp3","content":"entitle verb [T]\n(ALLOW)\nAdd to word list\nAdd to word list\nB2 to give someone the right to do or have something: entitle someone to something Being unemployed entitles you to free medical treatment. [ + to infinitive ] The employer is entitled to ask for references.\nMore examplesFewer examplesThe voucher is valid between July and December and entitles you to 10% off all overseas flights.Children and the elderly are entitled to cheap train tickets.Everyone should be entitled to a decent standard of living.Students and pensioners are entitled to a discount.These vouchers entitle you to claim a free meal.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngreen-light\nhall pass\nhospital admission\nimprimatur\nleft\nliberty\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nsufferance\nSee more results »\nentitle verb [T]\n(GIVE TITLE)\nC1 to give a title to a book, film, etc.: Her latest novel, entitled \"The Forgotten Sex\", is out this week.\nSMART Vocabulary: related words and phrases\nNames and titles\nA.N. Other\nage\naka\nalias\nappellation\ngiven name\ngood name\nidentity\nilk\nJnr\nplace name\npseudonym\npseudonymity\npseudonymous\npseudonymously\nunchristened\nunder the name of idiom\nunidentified\nunnamed\nuntitled\nSee more results »\nentitle verb [T]\n(ALLOW)\nAdd to word list\nAdd to word list\nto give someone the right to do or have something: He’s entitled to his opinion even if you don’t agree with him. Being over 65 entitles you to a discount at the movies.\nentitle verb [T]\n(GIVE TITLE)\nto give a title to a book, movie, etc.: Her latest novel, entitled \"The Forgotten Child,\" is arriving in bookstores this week.\nAdd to word list\nAdd to word list\nto give someone the right to do or have something: entitle sb to (do) sth The chief executive will face protest at the AGM over his contract, which could entitle him to a £5m pay off.be entitled to (do) sth He was not entitled to receive any compensation.entitle sb to do sth If I have a registered trademark, does that automatically entitle me to use that mark as my domain name?be entitled to do sth He was not entitled to receive any compensation under his employment contract."}