{"id":141758,"name":"entitlement","type":"noun","us_sound":"ɪnˈtaɪ.t̬əl.mənt","us_link":"../audio/e/eus71578.mp3","uk_sound":"ɪnˈtaɪ.təl.mənt","uk_link":"../audio/e/ukentic009.mp3","content":"Add to word list\nAdd to word list\n[ C or U ] something that you have a right to do or have, or the right to do or have something: pension/holiday entitlements Managers have generous leave entitlement.\n[ U ] disapproving the feeling that you have the right to do or have what you want without having to work for it or deserve it, just because of who you are: a classic case of male entitlement\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngreen-light\nhall pass\nhospital admission\nimprimatur\nleft\nliberty\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nsufferance\nSee more results »\nAdd to word list\nAdd to word list\nsomething, often a benefit from the government, that you have the right to have: [ U ] Social Security and Medicare are popular entitlement programs in the US.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; LAW, HR a situation in which you have the right to do or have something: Almost any job which a benefit recipient takes will have some effect upon his current entitlement to unemployment benefits.\n[ C ]\n&#160; LAW, HR something that you have the right to do or have: Employee discount is seen as an entitlement and not necessarily a benefit.holiday/pension entitlement If online recruiters can be believed, 60% of British workers are failing to take their full holiday entitlement. All income and cash entitlements will be paid promptly into your account.\n[ C ]\n&#160; GOVERNMENT\n&#160; US a type of financial help provided by the US government for members of a particular group: He warned the administration would face massive budget deficits unless it reduced the soaring costs of Social Security and other entitlements. Means testing is a necessary part of all our entitlement programs."}