{"id":141997,"name":"entry","type":"noun","us_sound":"ˈen.tri","us_link":"../audio/e/entry.mp3","uk_sound":"ˈen.tri","uk_link":"../audio/e/ukentre004.mp3","content":"entry noun\n(WAY IN)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the act of entering a place or joining a particular society or organization: A flock of sheep blocked our entry to the farm. I can't go down that street - there's a \"No entry\" sign. The actress's entry into the world of politics surprised most people. She made her entry to the ceremony surrounded by a group of photographers. The burglars gained entry by a top window.\n[ C ] a door, gate, etc. by which you enter a place: I'll wait for you at the entry to the park.\nMore examplesFewer examplesThe police had to force an entry into the building.That's not the normal method of entry into the legal profession, is it?You'll need an entry visa to get into the country.No one can gain entry into the building without a security pass.Shortly after his triumphal entry into Havana in January 1959, Castro spoke on television for seven hours without a break.\nSMART Vocabulary: related words and phrases\nArrivals and departures\nadmittance\nadvent\napproach\narr.\narrival\nbourne\ncheck\nconnection\ndeparture\ndescent\ndestination\neta\ngain admittance\ngoing\ninflux\ninvasion\nmisconnect\nmisconnection\noff\noutflow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - joining & leaving\nParts of buildings: doors & parts of doors\nentry noun\n(INFORMATION)\nB1 [ C ] a separate piece of information that is recorded in a book, computer, etc.: They've updated a lot of the entries in the most recent edition of the encyclopedia. As his illness progressed, he made fewer entries in his diary.\nMore examplesFewer examplesEach entry in this dictionary has a grammar code.The main entry also cross-refers you to the appendix on page 259.I'm always interested in the new entries in a dictionary.How many entries are there in the encyclopedia?She's written all the entries for trees and shrubs.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nentry noun\n(COMPETITION)\nB1 [ C or U ] a piece of work that you do in order to take part in a competition, or the act of taking part in a competition: There have been a fantastic number of entries for this year's poetry competition. the winning entries Entry to the competition is restricted to those who have a ticket. Have you filled in your entry form yet?\nMore examplesFewer examplesThe competition entries were of such high calibre that judging them was very difficult.There were a lot of very amusing entries, but the pick of the bunch came from John Robinson.The winning entry will be the first correct answer drawn at random.My entry was ranked third in the flower show.Have you heard the winning entry in this year's Eurovision Song Contest?\nSMART Vocabulary: related words and phrases\nCompeting and contending (non-sporting)\nbe one up on someone idiom\nbid\ncat\ncatchup\nchancer\nclose-run\ndare\ngo in for something\ngo toe to toe idiom\nhyper-competitive\nin the game idiom\nintercollegiate\npit\nrunners and riders idiom\nshowing\nslugfest\nsnap at someone's heels idiom\nsuper-competitive\nthrow\ntoe\nSee more results »\nentry noun\n(WAY IN)\nAdd to word list\nAdd to word list\n[ C/U ] the act or manner of entering a place or of entering into an organization or relationship with others: [ U ] America’s entry into the war was delayed. [ U ] Entry to the basement is through a back stairway. [ U ] Police gained entry by breaking a window.\nentry noun\n(COMPETITION)\n[ C ] a person or thing that is part of a competition: There were five entries for best picture of the year.\nentry noun\n(RECORD)\n[ C ] a single written item in a list or collection of records: an entry in a diary\nentry noun\n(DICTIONARY)\n[ C ]\n&#160; English a word listed in a dictionary and the information about it, or a subject in an encyclopedia\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE a situation in which a company sells a product or service in a particular place or to a particular group of customers for the first time: entry into sth There are many benefits to be gained from the company's entry into the pharmacy market. With this takeover, the company gains entry into one of the most lucrative banking markets in the country. Among the benefits of the measures would be an increase in the flow of funds in and out of Japan, eased market entry for foreigners, more competition and reduced trading fees.\n[ U ] a situation in which someone becomes a member of an organization, a group, etc.: entry into sth She is a free market economist who oversaw Poland's entry into the EU. Rather than long academic training, people are choosing short vocational courses or direct entry to the labour market. conditions for/terms of entryentry requirement/qualification The normal minimum entry requirements for the course are three A levels.\n[ C ]\n&#160; ACCOUNTING, IT a number or other piece of information that is included in the accounts of a business or in a computer file: diary/blog/journal entry individual accounting entries Investigators have cross-referenced paper orders with computer entries made by the broker.\n[ U ]\n&#160; IT the act of putting information into a computer: She works in an office doing mailings and data entry.\n[ U ] an occasion when people or goods arrive in a country or region, or their right to arrive there: entry into sth The authorities are still trying to determine whether the vessel's entry into the disputed area was intentional or unintentional.allow/deny/refuse (sb) entry The restrictions were eased to allow entry into the United States for animals under 30 months of age. These people will be given legal right of entry to the UK next year as part of EU enlargement. an entry visa See also\nbarrier to entry\nbill of entry\nbook entry\nbook of final entry\nbook of first entry\nclosing entry\ncompound entry\ncontra entry\ncustoms entry\ndouble entry accounting\ndouble entry bookkeeping\nsingle-entry bookkeeping"}