{"id":141917,"name":"entrain","type":"verb","us_sound":"ɪnˈtreɪn","us_link":"../audio/e/cdo0319usentr0633.mp3","uk_sound":"ɪnˈtreɪn","uk_link":"../audio/e/cdo0319ukentr0551.mp3","content":"entrain verb\n(GET ON TRAIN)\nAdd to word list\nAdd to word list\n[ I ] formal to get on a train: On 2nd May we entrained for Dieppe. The night of the next day, we entrained.\nMore examplesFewer examplesEvery winter season he and Olive would entrain for the Saundersons homeland.The next day we entrained for Hanover, where I gave a seminar.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\naboard\nbestride\nboard\nclimb\ndebark\ndeplane\ndisembark\ndisembarkation\ndismount\nembark\nembarkation\nget\nget off\nget on\nget out\nhop\nin\nmount\nsettle\nstraddle\nSee more results »\nentrain verb\n(CAUSE)\n[ T or I ] formal to cause something to happen, or to be caused by something: September 11 entrained a kind of moral crash worldwide. The argument had entrained from an experiment that went horribly wrong.\nMore examplesFewer examplesShe plays a widow who entrains a legal battle when her new neighbour orders her tree to be uprooted.The Bolsheviks had entrained their ignoble withdrawal.\nSMART Vocabulary: related words and phrases\nCausing things to happen\n-induced\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nentrain verb\n(CARRY)\n[ T ] to make something part of a liquid or flow of something and carry it along: A depression over Biscay entrained a blast of cold air to western areas. A spray of water droplets from the splash becomes entrained in the airflow.\nMore examplesFewer examplesThe formula gives a rough estimate of the amount of water that could have been entrained by this fireball. Millions of tons of this entrained water sinks, circulating back down to the south along the sea bottom.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\nportable\nportage\npost-delivery\nput something/someone down\nredeliver\ntransplant\ntransportation\ntruck\nSee more results »\nentrain verb\n(COPY PATTERN)\n[ T or I ]\n&#160; biology\n&#160; specialized to make something have the same pattern or rhythm as something else: Daily injections of melatonin given at 3.30 each afternoon entrained the rats to a 24 hour cycle. I believe that the harp has a particular influence on the nervous system so that we entrain to it more strongly than, say, the violin.\nMore examplesFewer examplesThe music is to entrain the heart rate, blood pressure and respiration of the person in order to help calm them.Melatonin has both a soporific effect and an ability to entrain the sleep-wake rhythm.The time-cues are not strong enough to entrain the body clock to a 24-hour period.Experimental animals deprived of their pineal gland are slower to entrain.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\neven (something) out\nflatlining\nhomologous\nhomologous series\nhomologue\nmatch\nparallel\npassing\nplaceless\nplacelessness\nresemble\nrival\nSee more results »"}