{"id":142003,"name":"entryway","type":"noun","us_sound":"ˈen.tri.weɪ","us_link":"../audio/e/entryway.mp3","uk_sound":"ˈen.tri.weɪ","uk_link":"../audio/e/ukentre007.mp3","content":"Add to word list\nAdd to word list\na way into a place; an entrance: The doors were an entryway to a basement area. See also\nentry\nan inside area through which you enter a building or that leads to other rooms within a building: They stood in the home's entryway with its tall ceilings and dramatic arched windows. Synonyms\nhall\nhallway\na way to get into something or start to be involved in something: entryway into Trojan horses can create an entryway into your computer for malevolent users. The typewriter changed business processes and provided an entryway for women into the male-dominated workplace.\nMore examplesFewer examplesYou may have friends and relatives who like to visit and need accessible entryways. Old, broken-down fences and furniture were visible through the entryway.Inside the church's entryway are writings that appear to be in Arabic.An octagonal overlook on the second floor (rimmed with an iron railing) offers a dramatic view of the entryway beneath.We don't know whether this is a passing fad or if it's an entryway into an addiction.Interested adults can also find an entryway into biotech at community colleges.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorstop\ndoorway\ndraught excluder\nfire door\nfive-bar gate\nknocker\nletterbox\npurging\nrevolving door\nsafety gate\nscreen door\nshoji\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: passages & entrance areas\nArriving, entering and invading\nTaking part and getting involved\nOrganizations - joining & leaving\nAdd to word list\nAdd to word list\nan enclosed area through which you enter a building or a set of rooms within a building"}