{"id":141924,"name":"entrance","type":"noun","us_sound":"ˈen.trəns","us_link":"../audio/e/usad6073.mp3","uk_sound":"ˈen.trəns","uk_link":"../audio/e/ukentic016.mp3","content":"Add to word list\nAdd to word list\nA2 [ C ] a door, gate, etc. by which you can enter a building or place: There are two entrances - one at the front and one around the back. Opposite\nexit (LEAVING)\nC2 [ C usually singular ] the act of coming onto a stage, by an actor or dancer: make an entrance He makes a spectacular entrance in act two draped in a gold sheet.\n[ C usually singular ] the act of a person coming into a room in an ordinary situation, although often because there is something noticeable about it: I noticed her entrance because she slipped and fell in the doorway.\nB1 [ U ] the right to enter a place: refuse entrance The management reserve the right to refuse entrance.\nMore examplesFewer examplesThey dropped me off at the main entrance.The visitors filed through the entrance to the ticket offices.There are guards posted at every entrance.We'll meet you at the entrance.They turned us away at the entrance because we hadn't got tickets.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorstop\ndoorway\ndraught excluder\nentryway\nfire door\nknocker\nlintel\npurging\nrevolving door\nsafety gate\nscreen door\ntrapdoor\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: acting, rehearsing & performing\nArrivals and departures\nAllowing and permitting\nSomeone or something that entrances you is so beautiful or interesting that you cannot stop listening to or watching him, her, or it: He has entranced millions of people with his beautifully illustrated books. Synonym\ncaptivate\nSMART Vocabulary: related words and phrases\nInspiration and inspiring\nanti-creative\napostolic\nblue-sky\nbreathe\nbreathe (new) life into sth idiom\ncreative\ndivergent\ndivergently\nengage\nenthral\ngrip\nincentivize\nkindle\nmuse\nPromethean\nre-engage\nshow\nshow (someone) the way idiom\nstimulating\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking people excited and interested\nRelated word\nentrancing\nAdd to word list\nAdd to word list\na door, gate, etc., by which you can enter a building or place: [ C ] There are two entrances – one at the front and one at the back of the building.\nEntrance is also the right to be admitted to a place or to an organization: [ U ] Entrance to the museum is free on Sundays. [ U ] He took the entrance exam to law school yesterday.\nto hold the complete interest and attention of someone: We were entranced by mourners singing in glorious harmony, accompanied by guitar music.\nAdd to word list\nAdd to word list\n[ S ]\n&#160; COMMERCE a situation in which a company sells a product or service in a particular place or to a particular group of customers for the first time: Analysts say the investment could prove to be a shrewd entrance into a largely unexploited market.\n[ U ] the right to enter a place: allow/refuse (sb) entrance The management reserve the right to refuse entrance."}