{"id":142127,"name":"environmental","type":"adjective","us_sound":"ɪnˌvaɪ.rənˈmen.t̬əl","us_link":"../audio/e/eus71592.mp3","uk_sound":"ɪnˌvaɪ.rənˈmen.təl","uk_link":"../audio/e/ukentre020.mp3","content":"Add to word list\nAdd to word list\nB1 relating to the environment: environmental issue People are becoming far more aware of environmental issues.\nMore examplesFewer examplesMedia attention has shifted recently onto environmental issues.The government is facing pressure from environmental campaigners.The manifesto includes tough measures to tackle road congestion and environmental pollution.Indeed, it could be the worst environmental disaster in Europe this century.We will be speaking to a spokeswoman for the environmental group Greenpeace.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nRelated word\nenvironmentally\nAdd to word list\nAdd to word list\nearth science relating to the environment in which people, animals, and plants live: We’re here to discuss environmental issues. environmentally adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪnˌvɑɪ·rənˈmen·təl·i, -ˌvɑɪ·ərn-/\nAdd to word list\nAdd to word list\nENVIRONMENT relating to the environment: Environmental laws are forcing American automakers to take electric alternatives to gas engines seriously.environmental damage/harm/pollution The environmental damage from the oil spill took at least two years to repair. environmental challenges/concerns/issuesenvironmental effect/impact He's concerned about the environmental effects of genetically modified foods. environmental science/technology A cargo ship carrying toxic waste dumped its load, creating an environmental disaster that resulted in the deaths of 10 people. The oil giant has already spent some $3 billion on environmental cleanup. Businesses have a major role in environmental protection. environmentally adverb uk/ɪnˌvaɪrəˈmentəli/ us/-ˌvaɪrəˈmenṱəl-/\nIt's generally understood that large hydro plants are environmentally damaging."}