{"id":142101,"name":"envy","type":"verb","us_sound":"ˈen.vi","us_link":"../audio/e/eus71595.mp3","uk_sound":"ˈen.vi","uk_link":"../audio/e/ukentre028.mp3","content":"Add to word list\nAdd to word list\nB2 to wish that you had something that another person has: I envy her ability to talk to people she's never met before. [ + two objects ] I don't envy you the job of cooking for all those people.\nMore examplesFewer examplesSome of his colleagues envy the enormous wealth that he has amassed.Her luxurious lifestyle and personal ostentation were both hated and envied.I don't envy him his heavy workload.The man in the story starts to envy his friend's single lifestyle.She had always envied her sister's thick glossy hair and long willowy legs.\nSMART Vocabulary: related words and phrases\nEnvy and jealousy\nall right\nbe green with envy idiom\ncovet\ncovetable\ncovetous\ncovetously\ndisgustingly\nenviable\nenviably\nenvious\nenviously\nenvyingly\ngreen\ngreenly\ngrudge\njealous\njealously\npossessive\npossessively\nthreatened\nSee more results »\nB2 the feeling that you wish you had something that someone else has: I watched with envy as she set off for the airport. Compare\njealousy be the envy of someone\nC2 to be liked and wanted by a lot of people: Her hair is the envy of the office.\nSee more\nMore examplesFewer examplesEnvy is one of the seven deadly sins.She felt a stab of envy when she saw all the expensive presents Zoe had been given for Christmas.She felt a faint stirring of envy when she heard that one of her colleagues had been promoted.Ben's heading off to Spain for the week and I'm green with envy.She felt a wave of envy towards her friend, on seeing how happy she was.\nSMART Vocabulary: related words and phrases\nEnvy and jealousy\nall right\nbe green with envy idiom\ncovet\ncovetable\ncovetous\ncovetously\ndisgustingly\nenviable\nenviably\nenvious\nenviously\nenvyingly\ngreen\ngreenly\ngrudge\njealous\njealously\npossessive\npossessively\nthreatened\nSee more results »\nAdd to word list\nAdd to word list\nto wish that you had a quality or possession that another person has: I envy people so much who feel carefree.\nthe feeling that you wish you had something that someone else has: His new car is the envy of (= liked and wanted by) all his friends."}