{"id":142211,"name":"enzootic","type":"adjective","us_sound":"ˌen.zoʊˈɑː.t̬ɪk","us_link":"../audio/e/cdo1119usenzo0401.mp3","uk_sound":"ˌen.zəʊˈɒt.ɪk","uk_link":"../audio/e/cdo1119ukenzo0355.mp3","content":"Add to word list\nAdd to word list\n(of a disease) often affecting animals in a particular place: There's reason to believe the virus may now be enzootic, which means it has established itself in the animal population. The principal respiratory disease of pigs in Britain was enzootic pneumonia. Compare\nepizootic\nzoonotic\nMore examplesFewer examplesThey investigated enzootic leprosy in armadillos. Monkeypox, first identified in 1970, is enzootic in the rain forests of equatorial Africa.Health officials say plague is enzootic in New Mexico, meaning it's established in the rodent and flea population.This is an epidemiological survey of enzootic bovine leukosis in Portugal from 2005 to 2015.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine\na disease that affects animals in a particular place: Currently, six geographically separate rabies enzootics are recognized. Often all that is necessary for an enzootic to become established is for a few infected animals to be introduced into a flock or herd. Compare\nepizootic\nzoonotic\nMore examplesFewer examplesAn enzootic is a disease that is constantly present in animal populations within a specified area.A few such enzootics have been studied.It is always possible that these enzootics are mild outbreaks of shipping fever.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine"}