{"id":142220,"name":"eocene","type":"adjective","us_sound":"ˈiː.oʊ.siːn","us_link":"../audio/e/cdo1121useoce1576.mp3","uk_sound":"ˈiː.əʊ.siːn","uk_link":"../audio/e/cdo1121ukeoce1491.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 56.5 and 35.4 million years ago: Fossils show that until the end of the Eocene period a land bridge connected Eurasia with North America. rocks of Eocene age\nMore examplesFewer examplesHe proposed a new plan of classification for the Eocene mammals.Fossil Lake is an ancient lake bed left over from the Eocene epoch.Conflicting interpretations derived from different types of data leave considerable uncertainty about early Eocene temperatures.Eocene whales, for example, were very similar to modern whales.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeomorphic\ngully erosion\nhenge\nHolocene\nhoodoo\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Eocene\na period of time between about 56.5 and 35.4 million years ago. It is between the Palaeocene and the Oligocene epochs (= periods of time): During the age known as the Eocene, the earth experienced a great expansion of mammalian species. Fossils of sub-tropical species such as crocodiles and turtles have been found in the Canadian high Arctic dating from the early Eocene, 55 million years ago. See also\nPalaeocene\nOligocene\nMore examplesFewer examplesGeologists are investigating craters that date to the late Eocene, some 34 to 36.5 million years ago, such as the Popigai crater in northern Siberia.A feathered skull from the Eocene was unearthed in Denmark.The sweltering ice-free world of the Eocene warns us of what might happen if a runaway greenhouse effect sets in.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeomorphic\ngully erosion\nhenge\nHolocene\nhoodoo\npetrographically\npetrography\npetrological\npetrologically\npetrology\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}