{"id":142506,"name":"epic","type":"noun","us_sound":"ˈep.ɪk","us_link":"../audio/e/epic.mp3","uk_sound":"ˈep.ɪk","uk_link":"../audio/e/ukepee_005.mp3","content":"Add to word list\nAdd to word list\na film, poem, or book that is long and contains a lot of action, usually dealing with a historical subject: It's one of those old Hollywood epics with a cast of thousands. Compare\nfolk tale\nlegend (STORY)\nmyth (ANCIENT STORY)\nsaga\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\ndirector's cut\nhokum\none-shot\npaean\nparodic\nparody\npassion project\npolice procedural\npsychological\nslow\nsmash\ntragicomedy\nSee more results »\nin the style of an epic: epic film an epic film about the Roman Empire\nused to describe events that happen over a long period and involve a lot of action and difficulty: epic journey James has walked 1,000 miles in an epic journey across Africa.epic struggle It's been an epic struggle to keep social services going throughout the recession.\n[ before noun ] informal extremely large: epic proportion The problem of inflation has reached epic proportions.epic fail His first year in office has been an epic fail. Many people thought the decision was an epic blunder.\ninformal extremely good: The Hulk roller coaster ride was epic.\nSMART Vocabulary: related words and phrases\nTypes of film, play, book etc.\nadaptation\nAfrofuturism\nAga saga\nallegorical\nanime\nautobiographical\nboy-meets-girl\nDickensian\ndirector's cut\nhokum\none-shot\npaean\nparodic\nparody\npassion project\npolice procedural\npsychological\nslow\nsmash\ntragicomedy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLasting for a long time\nEnormous\nExtremely good\nAdd to word list\nAdd to word list\na book or movie that is long and contains a lot of action, usually about a subject from the past\nliterature An epic is also a long poem about events in the past, often involving gods or kings and queens: The Iliad is the most famous Greek epic.\nhappening over a long period and including a lot of difficulties: an epic struggle to achieve equality for African Americans"}