{"id":143103,"name":"episode","type":"noun","us_sound":"ˈep.ə.soʊd","us_link":"../audio/e/episode.mp3","uk_sound":"ˈep.ɪ.səʊd","uk_link":"../audio/e/ukepee_023.mp3","content":"episode noun [C]\n(EVENT)\nAdd to word list\nAdd to word list\nB2 a single event or group of related events: This latest episode in the fraud scandal has shocked a lot of people. The drugs, the divorce, and the depression - it's an episode in his life that he wants to forget. Synonyms\nevent\nhappening\nincident\noccurrence (HAPPENING)\nphenomenon (EXISTING THING)\na sudden short period in which someone suffers the effects of a physical or mental illness: I had an episode of severe chest pain. The fainting episode was caused by heat. He still has therapy for his PTSD and not long ago, he had an episode.\nMore examplesFewer examplesThe whole episode left me fuming at the injustice of it all.It was just another episode in an ongoing saga of marriage problems.The whole episode was a blatant attempt to gain publicity.That was a funny episode in my life.It was an episode in his life that he'd like to forget.Other severe psychiatric complications include episodes of delirium.These drugs can trigger a manic episode in people with bipolar disorder.She ended up in hospital after one particularly bad episode.\nSMART Vocabulary: related words and phrases\nEvents and occurrences\n-athon\nback story\nbe (all) part of life's rich tapestry/pageant idiom\nbenefit\nbinge\ncar wash\ndate night\ndevelopment\nedition\nepiphenomenon\nevent\ngoings-on\nhappening\npast\nproceedings\nreoccurrence\nspree\nsynchronicity\nthing\nto-ing and fro-ing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nepisode noun [C]\n(PART OF STORY)\nB2 one of the single parts into which a story is divided, especially when it is broadcast on the television or radio\nExamples\nNext up on Channel 4 is the first episode of a new medical drama set in Chicago.It's the penultimate episode of the series tonight.It's my favourite TV programme - I never miss an episode.I missed the second episode of the series so I don't know what's going on now.It is her proud boast that she has never missed a single episode of the soap opera.\nSMART Vocabulary: related words and phrases\nBroadcasting: programmes & other broadcasts\naction replay\nbinge-watch\nblooper\nbreakfast television\nbreaking news\ncommentary\nfly on the wall idiom\ngame show\nGod slot\ngreen screen\nhate-watch\npilot\nreality show\nreality TV\nrerun\nrom com\nserial\nsketch\nsoap\nsyndicate\nSee more results »\nAdd to word list\nAdd to word list\na single event or group of related events: That was an episode in my life that I’d like to forget.\nliterature An episode is a series of actions or events that take place at one time in a work of literature.\nAn episode is also one of the parts of a television or radio program that is given as a series over a period of time."}