{"id":143352,"name":"epizootic","type":"noun","us_sound":"ˌep.ɪ.zoʊˈɑː.t̬ɪk","us_link":"../audio/e/cdo0319usepiz0640.mp3","uk_sound":"ˌep.ɪ.zəʊˈɒt.ɪk","uk_link":"../audio/e/cdo0319ukepiz0557.mp3","content":"Add to word list\nAdd to word list\nthe appearance of a particular disease in a large number of animals in the same place at the same time: This is not the first rabies epizootic to strike Ethiopian wolves. Compare\nepidemic\nMore examplesFewer examplesNew regulations followed the foot-and-mouth epizootic.It is usually not economically justified to vaccinate lifestock against anthrax until there is an epizootic.A dolphin mass stranding could be caused by an epizootic.These mosquitoes were collected during an epizootic of equine encephalitis in Argentina.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine\n(of a disease) appearing in a large number of animals in the same place at the same time: Outbreaks of epizootic diseases can have a large impact on the agricultural sector. Compare\nenzootic\nMore examplesFewer examples Signs of the virus, called epizootic haemorrhagic disease, have been found in the carcasses of nearly 200 deer in New Jersey.Animals are more frequently attacked by epizootic, endemic, and contagious diseases than the human species.They did an epidemiological survey on risk factors of acute epizootic rabbit enteropathy.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\nill health\nimpairment\nincurably\ninfantile\njuvenile\noutbreak\nseizure\nsubvariant\nsystemically\nteratoma\nterminally\nthermal shock\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine"}