{"id":143447,"name":"equal","type":"adjective","us_sound":"ˈiː.kwəl","us_link":"../audio/e/equal.mp3","uk_sound":"ˈiː.kwəl","uk_link":"../audio/e/ukepito010.mp3","content":"equal adjective\n(SAME)\nAdd to word list\nAdd to word list\nB1 the same in amount, number, or size: equal to One litre is equal to 1.76 imperial pints.equal in One box may look bigger than the other, but in fact they are roughly (= almost) equal in volume.\nThesaurus: synonyms, antonyms, and examples\nexactly like each otherthe sameI have the same dress as her.identicalThe employees all wore identical blue shirts.indistinguishableThe counterfeit certificate was so good it was indistinguishable from the real thing.equalFour groups of ten is equal to two groups of twenty.\nSee more results »\nB1 the same in importance and deserving the same treatment: All people are equal, deserving the same rights as each other.equal pay/status They've got a long way to go before they achieve equal pay/status for men and women.\nMore examplesFewer examplesAre the two bags equal in weight?He believes that all children are born with equal intelligence.We must make sure that everyone gets equal shares of the food.Applicants should have a degree or a qualification of equal status.One unit of alcohol is equal to half a pint of beer or a standard measure of spirits.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nequal adjective\n(ABLE)\n[ after verb ] formal skilled or brave enough for a difficult duty or piece of work: prove equal to It's a challenging job but I'm sure you'll prove equal to it.equal to the task Do you think he's equal to the task ahead of him?\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterous\ndexterously\ndigital native\nexpert\nexpertly\npedicure\npedigreed\npolished\npractised\nproficient\nultra-slick\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nSee more results »\nB2 someone or something that has the same importance as someone or something else and deserves the same treatment: The good thing about her as a boss is that she treats us all as equals. Throughout her marriage she never considered her husband as her intellectual equal.have no equal As an all-round athlete he has no equal (= no-one else is as good). Synonym\nmatch Compare\npeer noun\nMore examplesFewer examplesShe found that if women did serious and worthwhile scientific work, male scientists were willing to treat them as equals.As a friend and companion, no one could ever be her equal.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nequal verb [L only + noun, T]\n(BE THE SAME)\nto be the same in value or amount as something else: 16 ounces equals one pound.\nto achieve the same standard or level as someone else, or the same standard or level as you did before: We raised over $500 for charity last year and we're hoping to equal that this year.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequalization\neven (something) out\nfavour\nflatlining\nhomologous\nhomologous series\nmatch\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\nequal verb [L only + noun, T]\n(RESULT IN)\nto result in something: He disputed the idea that more money equals better education.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nequal adjective\n(SAME IN AMOUNT)\nAdd to word list\nAdd to word list\nmathematics\n&#160; (symbol =) the same in amount, number, or size: One quart is equal to four cups. Divide the class into equal groups.\nequal adjective\n(DESERVING THE SAME)\nthe same in importance and (of people) deserving the same treatment: equal rights We want a society that promotes equal opportunity for all of its citizens. equally adjective us\nYour browser doesn't support HTML5 audio\n/ˈi·kwə·li/\nThe money was shared equally among the three sisters.\nequal noun [C]\n(PERSON/THING)\nsomeone or something that is the same in amount, size, or importance as another person or thing: In this country, we’re all equals with the same rights. As an all-around athlete he has no equal (= no one else is as good).\nequal verb\n(BE SAME IN AMOUNT)\nmathematics to be the same in amount, number, size, or importance as another: [ L ] 10 + 10 = 20 [ T ] We hope to equal the amount of money we raised last year.\nAdd to word list\nAdd to word list\nthe same in price, number, size, etc.: The values of cross-border and internal sales were about equal over the year.an equal amount/number/share Instead of an equal share, we got only one-fifth of the profits.equal to sth She received a bonus of $15,065, equal to 40% of her salary.equal in number/value/size Sakhalin is an island north of Japan, with oil and gas reserves equal in size to those remaining in the North Sea.\ntreating everyone in the same way or allowing everyone to have the same opportunities: Relationships within an organization are never equal. Congress should focus its efforts on providing equal access to good quality education and job skills.on an equal basis/footing/on equal terms By law, job applications from disabled people should be treated on an equal basis to those from non-disabled candidates.\nall things being equal\nif the situation remains the same as it is now, or continues as expected: All things being equal, the market should have recovered by the end of the year.\nbe equal to (doing) sth\nto have the ability, experience, or skill that is necessary to do something difficult: I'm not sure he's equal to the demands of such a high-pressure job.\nto be the same in price, number, size, etc: Pre-tax profits are likely to equal last year's despite a £41 million share buy-back programme. Casinos currently pay tax equaling 20% of their gross revenue.equal the cost/number/amount of sth If every household used energy-saving bulbs, the reduction in greenhouse-gas emissions would equal the amount produced by almost 800,000 cars.\nif one thing equals another thing, it results in that thing: Experience has shown us that more accountability equals better performance.\nsomeone or something who is as important, successful, etc. as someone or something else: be the equal of sb/be sb's equal The EU increasingly sees itself as the equal of the US. On a professional and personal level the two men were equals.treat/accept/see sb as an equal Even though I was only a trainee, I was treated as an equal by the other staff."}