{"id":143459,"name":"equality","type":"noun","us_sound":"iˈkwɑː.lə.t̬i","us_link":"../audio/e/eus71606.mp3","uk_sound":"iˈkwɒl.ə.ti","uk_link":"../audio/e/ukepito011.mp3","content":"Add to word list\nAdd to word list\nB2 the right of different groups of people to have a similar social position and receive the same treatment: equality between the sexes racial equality the government department responsible for equalities Opposite\ninequality\nMore examplesFewer examplesCivil rights include freedom, equality in law and in employment, and the right to vote.Gandhi was loved and revered for his unceasing struggle for freedom and equality.Sexual equality will not be achieved until there is more provision for childcare.We are committed to the ideal of equality.The commission discussed ways of combatting poverty and increasing social equality in the member countries.\nSMART Vocabulary: related words and phrases\nHuman rights\naffirmative action\nageism\nageist\nanti-discrimination\nanti-feminism\ndesegregation\ndiscriminate\ndiscrimination\ndistributive justice\ndiversity and inclusion\nfeminist\nfree speech\nfreedom\ngay liberation\ngay rights\nsexism\nsexist\nsister under the skin idiom\nsisterhood\nsuffragette\nSee more results »\nAdd to word list\nAdd to word list\nthe right of different groups of people to receive the same treatment: racial equality\nAdd to word list\nAdd to word list\na situation in which men and women, people of different races, religions, etc. are all treated fairly and have the same opportunities: She works as an adviser on equality and diversity at the Institute of Personnel and Development. We want to see equality and justice in the workplace.promote/campaign for/fight for equality The 2005 law was intended to promote equality for all Californians, regardless of sexual orientation. gender/racial/social equality equality of rights/treatment/accessequality for sb The Iowa Constitution has lived up to its promises of equality for everyone.equality between sb and sb The principle of equality between foreign and domestic investors needs to be adhered to more closely. equality policies/laws/legislation"}