{"id":143581,"name":"equilibrium","type":"noun","us_sound":"ˌiː.kwəˈlɪb.ri.əm","us_link":"../audio/e/equilibrium.mp3","uk_sound":"ˌek.wɪˈlɪb.ri.əm","uk_link":"../audio/e/ukepito025.mp3","content":"Add to word list\nAdd to word list\na state of balance: The disease destroys much of the inner ear, disturbing the animal's equilibrium. the country's economic equilibrium\na calm mental state: Yoga is said to restore one's inner equilibrium.\nchemistry\n&#160; specialized the state in which the reactants (= substances involved in a chemical reaction) and products (= substances produced in a chemical reaction) do not change because the rate of forward reaction (= when products are produced from reactants) is equal to the rate of reverse reaction (= when the original reactants return from the products)\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonize\nharmony\nimbalance\nin accord with someone/something\ninharmonious\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nout of alignment\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalm and relaxed\nPhysics: the state of matter\nPhysical & chemical processes\nAdd to word list\nAdd to word list\na state of balance: He devised a mathematical method to prove the existence of equilibrium among prices, production, and consumer demand.\nbiology Equilibrium is also the state of balance maintained by the various organisms that live in a particular environment.\nphysics Equilibrium also means a state of balance between opposing forces.\nEquilibrium is also a state of mental calm.\nAdd to word list\nAdd to word list\na situation in which an economy is balanced and not experiencing large changes, for example when the number of goods that people want to buy is similar to the number of goods being offered: equilibrium between sth and sth Raising the prices we charge the consumer would enable us to raise wages until we reach an equilibrium between supply and demand.equilibrium in sth Saudi Arabia has promised to make every effort to ensure equilibrium in the oil industry and to stabilize prices. See also\ngeneral equilibrium\nmarket equilibrium\npartial equilibrium"}