{"id":143713,"name":"equivalent","type":"adjective","us_sound":"ɪˈkwɪv.əl.ənt","us_link":"../audio/e/equivalent.mp3","uk_sound":"ɪˈkwɪv.əl.ənt","uk_link":"../audio/e/ukequip006.mp3","content":"Add to word list\nAdd to word list\nC1 having the same amount, value, purpose, qualities, etc.: She's doing the equivalent job in the new company but for more money. Is $50 equivalent to about £30? Synonym\ntantamount to something formal\nMore examplesFewer examplesAn imperial gallon is equivalent to 4546 cubic centimetres.This bag holds an equivalent amount, although the shape makes it look smaller.It's important to stress that this qualification is not equivalent to a degree.Surely men and women doing equivalent jobs should be paid the same amount?I think that covering up the facts is equivalent to lying really.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalently\nevenly\nevery inch idiom\nfamily\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nC1 something that has the same amount, value, purpose, qualities, etc. as something else: There is no English equivalent for \"bon appetit\" so we have adopted the French expression. Ten thousand people a year die of the disease - that's the equivalent of the population of this town.\nMore examplesFewer examplesI couldn't get any cream cheese so I bought the nearest equivalent that I could find.The medical fluid may have been infected with the human equivalent of the disease.This is the electoral equivalent of bribery.He runs the equivalent of three marathons a week.Their production of oil and gas was the equivalent of 909,000 barrels a day last year.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalently\nevenly\nevery inch idiom\nfamily\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nRelated word\nequivalence\nAdd to word list\nAdd to word list\nequal to or having the same effect as something else: A mile is equivalent to about 1.6 kilometers. equivalent equations mathematics\nEquivalent equations are two equations (= mathematical statements) that have the same solutions. equivalent noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ɪˈkwɪv·ə·lənt/\nA day on the planet Mercury is the equivalent of 176 days on Earth.\nAdd to word list\nAdd to word list\nthe same in amount, price, size, etc.: The total consumer electronics market is equivalent to approximately $100 for every person on Earth.equivalent amount/level/price Under the new scheme, companies would agree to pay the pension contributions of their employees, and in return workers would sacrifice an equivalent amount from their salary.\nsomething that is the same amount, price, size, etc. as something else or has the same purpose as something else: The FSA has spoken to its New York equivalent, the SEC, regarding the takeover. The price of a barrel of crude oil in the early 1980s went as high as $40 (the equivalent of $80 today). equivalence noun [ U ]\n&#160; formal /ɪˈkwɪvələns/\nThe plan requires national systems to achieve equivalence to World Bank standards."}