{"id":143613,"name":"equip","type":"verb","us_sound":"ɪˈkwɪp","us_link":"../audio/e/equip.mp3","uk_sound":"ɪˈkwɪp","uk_link":"../audio/e/ukepito029.mp3","content":"equip verb [T]\n(EQUIPMENT)\nAdd to word list\nAdd to word list\nB2 to provide a person or a place with objects that are necessary for a particular purpose: It's going to cost $4 million to equip the hospital. All the police officers were equipped with shields to defend themselves against the rioters.\nMore examplesFewer examplesThe thieves equipped themselves with duplicate keys to the safe.They have been charged with equipping the guerillas with arms.Before we can open the centre we have to equip it for use, which will take time and money.Didn't the teacher equip you with paper and pencils before she sent you out sketching?After equipping me with the necessary tools, he sent me up the ladder to repair the roof.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nequip verb [T]\n(SKILLS)\nto give someone the skills needed to do a particular thing: The goal of the course is to equip people with the skills necessary for a job in this technological age. A degree in the history of art is very nice but it doesn't exactly equip you for many jobs.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\ngird\ngird yourself idiom\ngo bag\ngrab bag\ngroundwork\nlay\npreparation\nset something up\nset the scene/stage idiom\nsuit\nsuit up\nsurvivalism\ntee\ntune\nSee more results »\nequip verb [T]\n(PROVIDE)\nAdd to word list\nAdd to word list\nto provide someone or something with objects that are needed for a particular activity or purpose: All of our classrooms are equipped with computers.\nequip verb [T]\n(PREPARE)\nto prepare someone or something with whatever is needed to deal with a particular situation: The convention center is equipped to handle 20,000 people daily. I am not really equipped to discuss international affairs.\nAdd to word list\nAdd to word list\nto give someone or something the tools and equipment they need to do a job: A company spokesman said it would not be equipping the new $2.5 billion plant until business conditions improve.equip sb/sth with sth Only about 15% of buses in Chicago are equipped with diesel particulate filters to reduce soot emissions into the air. Many so-called 'smart' cars now come equipped with wireless technology. All our appliances are fully equipped with the latest safety features.equip sb/sth to do sth Nearly every phone on the market is equipped to send and receive texts.equip sb/sth for sth The latest range of planes is equipped for in-flight refueling.\nto give someone the skills and knowledge they need in order to do something: equip sb/sth to do sth Small businesses are not necessarily equipped to provide the stimulus and career progression many seek. The EU and NATO now seem better equipped to deal with any new threats that may lie ahead.equip sb/sth for sth An 'efficient' balance sheet in the short term does not necessarily equip firms for success in the long term."}