{"id":143782,"name":"erase","type":"verb","us_sound":"ɪˈreɪs","us_link":"../audio/e/eus71615.mp3","uk_sound":"ɪˈreɪz","uk_link":"../audio/e/ukequip016.mp3","content":"erase verb [T]\n(MARK)\nAdd to word list\nAdd to word list\nB2 mainly US (UK usually rub out) to remove something, especially a pencil mark by rubbing it: It's in pencil so you can just erase anything that's wrong.\nSMART Vocabulary: related words and phrases\nDeleting writing\nblank\nblank something out\ncross\ncross someone/something off (something)\ncross something out\ndeletion\nedit\nedit something out\nefface\nerasable\nrub\nrub something out\nscore\nscore something out/through\nsensitivity read\nsensitivity reader\nstrike\nX, x\nSee more results »\nerase verb [T]\n(RECORDING)\nto remove recordings or information from a magnetic tape or disk: A virus erased my hard disk.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nerase verb [T]\n(SOMETHING PAST)\nto cause a feeling, memory, or period of time to be completely forgotten: He is determined to erase the memory of a disappointing debut two years ago. Woods wants a convincing victory to erase doubts about his team's ability to reach the World Cup finals. One election cannot erase 65 years of a corrupt one-party political process.\nliterary to remove or destroy something, especially something that shows that that person or thing ever existed or happened: The president said NATO expansion would finally erase the boundary line in Europe artificially created by the Cold War. Years of hard living had blurred but not erased her girlhood beauty. He was a man of mystery - erased from the history books.\nSMART Vocabulary: related words and phrases\nForgetting and forgetfulness\nabsent-minded\nabsent-mindedly\nabsent-mindedness\namnesia\namnesiac\nanterograde\nblur\nbury\nforget\nforget it idiom\nforgetful\nforgetfully\nforgetfulness\noblivion\nretrograde amnesia\nrustily\nrusty\nscatterbrained\nscatty\nsenior moment\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\nRelated word\nerasure\nerase verb [T]\n(DESTROY)\nAdd to word list\nAdd to word list\nto destroy or remove something completely: A subdirectory filled with precious data can be erased if you are not careful.\nerase verb [T]\n(RUB AWAY)\nto remove something written or a mark by rubbing: I kept changing my mind and erasing my answers on the test.\nAdd to word list\nAdd to word list\nto cancel the effect of an increase or fall in something such as an amount of debt, the price of shares, etc.: erase a deficit/debt/loss To erase the budget deficit through cuts alone would mean extreme measures such as shutting prisons and college campuses. erase a profit/gain\nto remove information or data from the place where it was stored: erase sth from sth Fraudulent accounts had been erased from the records. All personal data is securely erased in accordance with our data protection policy."}