{"id":143888,"name":"ergative","type":"adjective","us_sound":"ˈɜː˞.ɡə.t̬ɪv","us_link":"../audio/e/cdo0318userga1675.mp3","uk_sound":"ˈɜː.ɡə.tɪv","uk_link":"../audio/e/cdo0318ukerga0504.mp3","content":"Add to word list\nAdd to word list\nused to refer to a verb that can be transitive (= used with an object) or intransitive (= used without an object), with the object of the transitive verb used as the subject of the intransitive verb. For example, close is an ergative verb (I closed the door| The door closed): Ergative verbs are both transitive and intransitive. a sentence in which the main verb is ergative\nused to refer to a type of noun in which the person who does an action is the object of the verb rather than the subject: Grammatical features such as ergative pronouns can be detected. Ergative is the case marking transitive subject.\nMore examplesFewer examplesHe told me these unusual-looking grammatical patterns I had uncovered were ergative. No African language is known to have ergative characteristics.The language is said to have ergative syntax.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominative\nparticle\npostposition\npostpositional\npostpositive\npostpositively\npredicatively\nquantifier\nsingular\nsyntax\nSee more results »\nan ergative verb: The verb \"capsize\" is an ergative. Do not confuse ergatives with passives.\nMore examplesFewer examplesErgatives can be used transitively (The storm sank the ship) as well as intransitively (The ship sank).In English, the object of an ergative has to be moved to subject position.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominative\nparticle\npostposition\npostpositional\npostpositive\npostpositively\npredicatively\nquantifier\nsingular\nsyntax\nSee more results »"}