{"id":144292,"name":"error","type":"noun","us_sound":"ˈer.ɚ","us_link":"../audio/e/error.mp3","uk_sound":"ˈer.ər","uk_link":"../audio/e/ukeroge016.mp3","content":"Add to word list\nAdd to word list\nB2 a mistake: He admitted that he'd made an error. The letter contains a number of typing errors. Human error has been blamed for the air crash. With something as delicate as brain surgery, there is little margin for error (= you must not make mistakes).\nThesaurus: synonyms, antonyms, and examples\na mistakemistakeIt was just a silly mistake - no need to apologize.errorHe admitted that he'd made an error.blunderThe company was struggling after a series of financial blunders.slipIt was an understandable slip.mix-upThere was a mix-up with the bags at the airport.gaffeI made a real gaffe by calling her \"Emma\", which is the name of his previous girlfriend.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nby accidentby accidentI deleted the photo by accident.accidentallyI accidentally deleted the photo.by mistakeI deleted the files by mistake.in errorHer name was passed to the police in error.\nSee more results »\nerror of judgment\na wrong decision: Not telling the staff before they read the news in the papers was an error of judgment. The report described their refusal to send in ground troops as a serious error of judgment. Senior police officers undoubtedly made errors of judgment as they struggled to contain unprecedented levels of violence. Accepting the money was an error of judgment for which I have apologized unreservedly. In later years, the prime minister admitted that he had made an error of judgment. see the error of your ways\nto understand that you were wrong to behave in a particular way and start to behave differently: I hope you can see the error of your ways - otherwise, there is no future for you in this business.\nSee more\nMore examplesFewer examplesHospital authorities admitted that a tragic error had taken place.The reason for the disaster was engine failure, not human error.The error occurred when someone left out the decimal point.Your essay is full of spelling errors.There are some serious errors and omissions in the book.\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nfailing\nfalse move\nfaux pas\nflaw\nfossilization\nmalapropism\nmisfunction\nmisperception\nmisprint\nmisspelling\nmisstep\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nAdd to word list\nAdd to word list\na mistake, esp. in a way that can be discovered as wrong, or the making of such mistakes: [ C ] a spelling/mathematical error [ U ] Investigators said the train crash was caused by human error rather than mechanical failure.\nAdd to word list\nAdd to word list\nsomething done or written by accident that is not correct, not accurate, or does not give the right result: make/introduce an error Can I amend my VAT return online if I've made an error? correct/find an error contain/have errors The text has numerous errors, but none are particularly significant.error in sth An error in accounting led to this figure appearing in the 'profit' column.accounting/administrative/clerical error Due to an administrative error, the payment went to the wrong bank account. a grave/serious error He made an error of judgment when he failed to promote her. If you have received this e-mail in error, please notify us immediately.\nIT a situation in which something goes wrong in a computer program, or a message that this has happened: give/produce/generate an error The bug generated an error when performing a multi-scale query. a syntax/server/system error See also\nmargin of error\nunrecoverable error"}