{"id":144355,"name":"erupting","type":"verb","us_sound":"ɪˈrʌpt","us_link":"../audio/e/eus71634.mp3","uk_sound":"ɪˈrʌpt","uk_link":"../audio/e/ukeroge022.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nerupt\nerupt verb [I]\n(VOLCANO)\nC2 When a volcano erupts, it explodes and flames and rocks come out of it: Since the volcano last erupted, many houses have been built in a dangerous position on its slopes.\nMore examplesFewer examplesInner-city riots erupted when a local man was shot by police.Violence erupted in the city on Friday night.A big diplomatic row erupted as a result.Spontaneous demonstrations erupt almost daily.A legal fight has erupted between two of the world's largest oil companies.\nSMART Vocabulary: related words and phrases\nExploding and erupting\nblast\nblow\nblow (someone/something) up\nblowout\nburst\nburst in on someone/something\nburst in/into (somewhere)\ndetonate\ndetonator\nerupt\nexplosively\nexplosiveness\ngo off\ngo pop idiom\ngo up\nimplode\nimplosion\npop\nset\nunspent\nSee more results »\nerupt verb [I]\n(START SUDDENLY)\nto start suddenly and violently: At the end of a hot summer, violence erupted in the inner cities.\nto suddenly express your feelings in a noisy way: The crowd erupted in applause and cheering.\nThesaurus: synonyms, antonyms, and examples\nto get angrylose your temperShe never lost her temper, never raised her voice. explodeShe exploded with rage when she was mistaken for a cleaning lady.eruptMy ex-husband would erupt over little things.lose (your) patienceShe was starting to lose her patience with him.become enragedHe became enraged and crashed out of the room.fly into a rageI never saw him fly into a rage or treat anyone cruelly.\nSee more results »\nIf spots erupt on your skin, they suddenly appear: Two days after he'd been exposed to the substance, a painful rash erupted on his neck.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\nget down to business idiom\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\ninaugurate\nmotion\nstart out\nstart/set/get the ball rolling idiom\nstarting\nstirring\nstrike\nstrike out (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\nAppearing & disappearing\nRelated word\neruption"}