{"id":144356,"name":"eruption","type":"noun","us_sound":"ɪˈrʌp.ʃən","us_link":"../audio/e/eus71635.mp3","uk_sound":"ɪˈrʌp.ʃən","uk_link":"../audio/e/ukeroge023.mp3","content":"eruption noun [C or U]\n(VOLCANO)\nAdd to word list\nAdd to word list\nan occasion when a volcano explodes, and flames and rocks come out of it, or the act of doing this: a volcanic eruption Around the year 600, the eruption of a nearby volcano buried Ceren's buildings.\nMore examplesFewer examplesScientists fear that a volcanic eruption on the Canary Island of La Palma will send a chunk of island collapsing into the sea. Pompeii is famed for its burial by an eruption of Italy's Mount Vesuvius in AD 79.Recent eruptions have claimed the lives of journalists and scientists.\nSMART Vocabulary: related words and phrases\nExploding and erupting\nblast\nblow\nblowout\nburst\nburst in on someone/something\nburst in/into (somewhere)\ndetonate\ndetonator\nerupt\nexplosiveness\ngo off\ngo pop idiom\ngo up\nignite\nimplode\nimplosion\nlive\nnon-explosive\npop\nset\nSee more results »\neruption noun [C or U]\n(SUDDEN START)\nthe act of starting suddenly and violently: There was a violent eruption of anti-government feeling. The curfew was aimed at preventing any eruption of violence in the capital.\nthe act of suddenly expressing your feelings in a noisy way: He became increasingly prone to eruptions of bad temper. His comment triggered an eruption of laughter.\nan occasion when spots suddenly appear on your face: an eruption of spots Skin eruptions are common to many of us during times of stress.\nan occasion when a tooth appears through the gum (= the flesh surrounding the teeth) for the first time: She was taking painkillers to help with the painful eruption of a wisdom tooth.\nMore examplesFewer examplesA survey conducted one month before the eruption of the turmoil showed that 84% of people believed the government to be corrupt.She was always having to deal with eruptions of family dysfunction. He has a hair-trigger temper and a history of eruptions.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\ninaugurate\nmotion\nsail in\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nstirring\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\nAppearing & disappearing\nSkin complaints & blemishes\nThe teeth\nRelated word\nerupt"}