{"id":144390,"name":"escalated","type":"verb","us_sound":"ˈes.kə.leɪt","us_link":"../audio/e/escalate.mp3","uk_sound":"ˈes.kə.leɪt","uk_link":"../audio/e/ukeroge026.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nescalate\n[ I or T ] to become or make something become greater or more serious: His financial problems escalated after he became unemployed. The row could escalate into full-blown conflict. The decision to escalate UN involvement has been made in the hopes of a swift end to the hostilities. The escalating rate of inflation will almost certainly bring escalating prices. Synonyms\nincrease\nintensifyOpposite\nde-escalate\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\n[ T ]\n&#160; business\n&#160; specialized to involve someone more important or higher in rank in a situation or problem: You might need to escalate the issue to the next highest level management team. The customer is threatening to escalate his complaint.\nMore examplesFewer examplesThe issue could escalate into a public relations crisis.These problems can escalate very quickly.There are reports of escalating tensions in the area.Any retaliation would only escalate the violence.If you do not hear from us within 10 working days of having escalated your complaint, please contact Mr. K. Santhanam.You need to anticipate and address problems before they are escalated to the board.He warned auditors that if there was an inadequate rating, he would \"escalate the issue to the highest level possible in the government.\"\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\nfade\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nre-escalate\nre-escalation\nredouble\nresurge\nrocket\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBosses & managers\nRelated word\nescalation"}