{"id":144422,"name":"escape","type":"verb","us_sound":"ɪˈskeɪp","us_link":"../audio/e/eus71636.mp3","uk_sound":"ɪˈskeɪp","uk_link":"../audio/e/ukescap001.mp3","content":"escape verb\n(GET FREE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to get free from something, or to avoid something: Two prisoners have escaped. A lion has escaped from its cage. She was lucky to escape serious injury. He narrowly (= only just) escaped a fine. His name escapes me (= I have forgotten his name). Nothing important escapes her notice/attention.\nThesaurus: synonyms, antonyms, and examples\nto forget somethingforgetI can't believe I've forgotten her birthday!slip your mindI meant to tell you that he'd phoned, but it completely slipped my mind.be on the tip of your tongueOh, what was that movie called? It's on the tip of my tongue.escape youThe name of her book escapes me at the moment.blank outThe dinner where he admitted the affair was so painful that I must have blanked it out.\nSee more results »\nMore examplesFewer examplesIn order to escape capture, he fled to the mountains.He had to jump out of an upstairs window to escape.Refugees have been pouring into neighbouring countries to escape the civil war.Both children escaped unharmed from the burning building.In the end she left home just to escape the tyrannical rule of her mother.\nSMART Vocabulary: related words and phrases\nRunning away and escaping\nabscond\nabscond from somewhere\nabscond with someone/something\nback away\nback off\nelopement\nelude\nescapology\nextrication\nflee\nheel\nloose\nrun away\nrunaway\nscarce\nscarper\nscram\nshake\nthrow\nunderground\nSee more results »\nescape verb\n(COMPUTER)\n[ I ]\n&#160; computing\n&#160; specialized to press the key on a computer keyboard that allows you to leave a particular screen and return to the previous one or to interrupt a process: Escape from this window and return to the main menu.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nIdiom\nthere's no escaping the fact\nescape noun\n(GET FREE)\nC1 [ C or U ] the act of successfully getting out of a place or a dangerous or bad situation: He made his escape on the back of a motorcycle. an escape route They had a narrow escape (= only just avoided injury or death) when their car crashed.\n[ C ] a loss that happens by accident: an escape of radioactivity\nMore examplesFewer examplesWe've got all the exits covered, so they've no chance of escape.It was a daring escape.He told the extraordinary story of his escape.She gave a hair-raising account of her escape through the desert.It sounds as if you had a lucky escape .\nSMART Vocabulary: related words and phrases\nRunning away and escaping\nabscond\nabscond from somewhere\nabscond with someone/something\nback away\nback off\nelopement\nelude\nescapology\nextrication\nflee\nheel\nloose\nrun away\nrunaway\nscarce\nscarper\nscram\nshake\nthrow\nunderground\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and loss\nescape noun\n(FORGET)\nB2 [ S ] something that helps you to forget about your usual life or problems: Romantic novels provide an escape from reality.\n[ S ] a holiday that takes you away from your ordinary life, or a place where you go on holidays like this: The Bahamas are ideal for a tranquil, romantic holiday escape. Martha's Vineyard and Nantucket are the favourite escape for many New Yorkers.\nSMART Vocabulary: related words and phrases\nCreating a distraction\ndistract\ndistracting\ndistractingly\ndistraction\ndiversion\ndivert\nmind\nmisdirection\nput\nput someone off their stride idiom\nput something off\nrabbit hole\nsidetrack\nsmoke and mirrors\nstride\nsubject\ntake\ntake someone out of himself/herself\ntake someone's mind off something idiom\nYou can also find related words, phrases, and synonyms in the topics:\nTourism & holidays\nTime off\nescape noun\n(COMPUTER)\n[ U ]\n&#160; computing\n&#160; specialized (also escape key); (written abbreviation Esc) the key on a computer keyboard that allows you to leave a particular screen and return to the previous one or to interrupt a process: Press Esc to return to the main menu.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nAdd to word list\nAdd to word list\nto become free or get free from, or to avoid something: [ I ] to escape from prison/a burning house [ T ] The book’s faults have not escaped the notice of (= not been avoided being noticed by) critics.\nthe act or possibility of becoming free or getting away from a place where you are kept esp. by force, or of avoiding a dangerous situation: [ C ] The blast knocked me down – it was a narrow escape (= I was almost hurt badly).\nAn escape is also an unintentional loss: [ C ] an escape of radioactive fuel\nAdd to word list\nAdd to word list\nthe key on a computer keyboard which allows you to leave a particular screen and return to the previous one or to interrupt a process: Press Escape to return to the main menu. To exit the program, use Esc."}