{"id":144813,"name":"essential","type":"adjective","us_sound":"ɪˈsen.ʃəl","us_link":"../audio/e/eus71654.mp3","uk_sound":"ɪˈsen.ʃəl","uk_link":"../audio/e/ukesq__006.mp3","content":"essential adjective\n(NECESSARY)\nAdd to word list\nAdd to word list\nB1 necessary or needed: Government support will be essential if the project is to succeed. There is essential work to be done before the building can be re-occupied. Water is essential for/to living things. It is essential (that) our prices remain competitive. [ + to infinitive ] For the experiment to be valid, it is essential to record the data accurately. Synonyms\nall-important\ncrucial\nindispensable\nvital (IMPORTANT)Opposite\ndispensable\nMore examplesFewer examplesThe books on this list are essential reading for the course.Fresh fruit and vegetables form an essential part of a healthy diet.During the emergency, people stocked up on essential items like candles, medicines and tins of food.It's essential that she has this medicine every day.Computer literacy is becoming as essential as the ability to drive a car.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\ninhere in something\nnecessitate\nnecessity\nneed\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nessential adjective\n(BASIC)\nrelating to something's or someone's basic or most important qualities: I love the building as it is, and don't want to do anything to change its essential character. She believes in the essential goodness of human beings.\nThesaurus: synonyms, antonyms, and examples\nbasic knowledge, understanding, etc.basicI just need some basic information.elementaryI started an elementary-level art history course.fundamentalOne of the most fundamental principles of the rule of law is that one person cannot be punished for the actions of another.rudimentaryThey have only the most rudimentary grasp of the language.essentialWe have been able to determine the essential nature of a healthy diet.underlyingThe underlying idea is that having freedom is valuable.\nSee more results »\nMore examplesFewer examplesMany people have misjudged our country and its essential nature.Poetry should try to get at what is most essential about human experience.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\nhave it in you idiom\nhood\nhumanity\nin\npresentation\nrespect\nshape\ntrappings\nunaffiliated\nundercurrent\nvibe\nvibe check\nSee more results »\na basic thing that you cannot live without: When we go on holiday, we only take the bare essentials. This leaflet will give you the essentials of how to prepare for a hurricane. Because I live in a remote village, I regard my car as an essential. Synonyms\nbasics\nfirst principles UK\nfoundation (BASIC FACT)\nfundamentals\nnecessity\nprinciple (IDEA)\nrequirement\nrequisite formal\nthe rudiments\none of the basic or most important ideas or qualities in something: Her brilliance allowed her to distil any argument to its essentials. This was his life story stripped down to its barest essentials.\nSMART Vocabulary: related words and phrases\nImportant and essential things\n-based\namenity\nbare\nbe-all\nbig league\nflagship\nfocal point\ngrandaddy\nheavyweight\nhot button\nimperative\nkeynote\nneed\nnexus\nnub\nnucleus\npivot\nprecondition\nprerequisite\nthe grandaddy of something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nAdd to word list\nAdd to word list\nextremely important or necessary: A knowledge of Spanish is essential for this job.\nEssential also means basic to the nature of someone or something: There is an essential difference between the two sisters in their approach to life. essentially adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪˈsen·ʃə·li/\nEssentially she’s saying that she is not interested in seeing you again.\nthe basic things you need to live: The study estimated the cost of essentials for a family of four – its food, shelter, and clothing needs.\nEssentials are also the basic or most important part of something: the essentials of chemistry\nAdd to word list\nAdd to word list\nvery important or necessary: Computer literacy is becoming as essential as the ability to drive a car.an essential component/part of sth Selective expansion of our store base is an essential component of our long-term plan.essential for sth Formulating new strategies is essential for preparing the corporation to meet and sustain future needs.it is essential (that) It is essential our prices remain competitive.it is essential to do sth It is essential to research and protect your patent.essential to sth Knowledge, skills, and creativity are essential to creating high-value products.\na basic thing that you cannot live or succeed without: This leaflet will give you the essentials of how to use the word processor. Goods that were once considered luxuries are now treated as essentials by many."}