{"id":144814,"name":"essentialism","type":"noun","us_sound":"ɪˈsen.ʃəl.ɪ.zəm","us_link":"../audio/e/cdo1121usesse1584.mp3","uk_sound":"ɪˈsen.ʃəl.ɪ.zəm","uk_link":"../audio/e/cdo1121ukesse1497.mp3","content":"Add to word list\nAdd to word list\nthe idea that things have basic characteristics that make them what they are, which it is the task of science and philosophy to discover and describe: Drawing in part upon the thinking of Aristotle and Plato, essentialism was adopted by biologists in the 17th and 18th centuries and applied to the concept of species.\nthe belief that groups of people, such as men and women, have different basic characteristics that cannot be changed: To reduce women to motherhood is to confine them to the same old biological essentialism from which they spent the last century trying to escape. gender essentialism See also\nbioessentialism\nMore examplesFewer examplesA balance therefore needs to be struck between Aristotelian essentialism and Nietzschean individualism.At its crudest, essentialism is biological determinism and sees identity as a pure, unchanging essence of race or sex or class rather than something which is socially or culturally constructed.A warning against essentialism, her book traces how fiction naturalizes a society’s norms of female behaviour.We are witnessing a reversion to the type of cultural essentialism that dominated political and academic discourse until the mid-1900s.The chapters on Muslim and Middle Eastern women reject exceptionalism and essentialism in favour of comparative and historicized approaches. Come on, I thought we moved past gender essentialism three decades ago!\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nexistentialistically\nnon-philosophical\nnotional\nontological\nontologically\nontology\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nsyllogism\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nGroups of people"}