{"id":144853,"name":"establishing","type":"verb","us_sound":"ɪˈstæb.lɪʃ","us_link":"../audio/e/eus71656.mp3","uk_sound":"ɪˈstæb.lɪʃ","uk_link":"../audio/e/ukesq__009.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nestablish\nestablish verb\n(START)\nB2 [ T often passive ] to start a company or organization that will continue for a long time: The brewery was established in 1822. These methods of working were established in the last century.\nC1 [ T often passive ] to start having a relationship with, or communicating with another person, company, country, or organization: There is a strong need to establish effective communication links between staff, parents, pupils, and external bodies.\nMore examplesFewer examplesWhen the college was established in 1546, it inherited a hall from each of three antecedent institutions.The two brothers established a clothes retailing business.An international medical conference was established for the interchange of new ideas and approaches.An aid programme was established to oil the wheels of economic reform in the region.Grants will be given to establish centres of excellence in this field of research.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfloat\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelationships: general words\nestablish verb\n(ACCEPT)\nC1 [ T ] to cause something or someone to be accepted in or familiar with a place, position, etc.: His reputation for carelessness was established long before the latest problems arose. He's established himself as a dependable source of information. After three months we were well established in/at our new house/new jobs. establish yourself C1 formal\nto be in a successful position over a long period of time: He has established himself as the leading candidate in the election.\nMore examplesFewer examplesShe hit the ball so hard that her opponent had no chance to establish any rhythm in her game.Once she became a prosecutor, she quickly established herself as a masterful trial lawyer.World Music is now well established and popular with mass audiences and mainstream companies.They preach the abolition of established systems but propose nothing to replace them.Recent evidence has tended to contradict established theories on this subject.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nestablish verb\n(DISCOVER)\nC2 [ T ] formal to discover or get proof of something: Before we take any action we must establish the facts/truth. [ + question word ] Can you establish what time she left home/whether she has left home. [ + (that) ] We have established (that) she was born in 1900.\nMore examplesFewer examplesThe prosecution has to establish his guilt beyond (reasonable) doubt/ beyond a (reasonable) doubt.It's often difficult to establish who the guilty party is following a road accident.The police are still trying to establish the cause of the fire.There are tests which can establish a baby's genetic endowment.Scientists have established the relationship between lung cancer and smoking.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »"}