{"id":144854,"name":"establishment","type":"noun","us_sound":"ɪˈstæb.lɪʃ.mənt","us_link":"../audio/e/establishment.mp3","uk_sound":"ɪˈstæb.lɪʃ.mənt","uk_link":"../audio/e/ukesq__010.mp3","content":"establishment noun\n(ORGANIZATION)\nAdd to word list\nAdd to word list\nC1 [ C ] a business or other organization, or the place where an organization operates: an educational/financial/religious establishment the establishment [ S, + sing/pl verb ]\nthe important and powerful people who control a country or an organization, especially those who support the existing situation: Critics said judges were on the side of the establishment.\nMore examplesFewer examplesShe seems to have spent all her life studying in educational establishments.For an inexpensive place to stay, the guide book recommends a small family-run establishment near the cathedral.They embarked on a tour of the city's many drinking establishments.This large, rather run-down establishment offers rooms for US$8.This 16-room hotel offers more than the usual two-star establishment, though its location is not very good.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\nparent company\npartner up\npartnership\nplc\nzombie company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nPowerful people & dictators\nestablishment noun\n(START)\nC1 [ U ] the process of starting or creating something, for example, an organization: Since its establishment in 1945, the United Nations has played a dominant role in the development of international law. The establishment of new areas of employment is a priority.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfold\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nestablishment noun\n(POWERFUL PEOPLE)\nAdd to word list\nAdd to word list\n[ C ] the people who have most of the power within government or society or in a particular business or activity: the diplomatic/educational/literary establishment\n[ C ] An establishment is a particular place of business: Visitors come to shop in the fashionable new establishments downtown.\nestablishment noun\n(START)\n[ U ] the act of starting or creating something that will last a long time: She called for the establishment of nationwide academic standards.\nAdd to word list\nAdd to word list\n[ C ] a business or other organization, or the place where an organization operates: an educational/training/religious establishment What percent of your establishment's total sales are from outside your country?\n[ S ] the act of starting a business, organization, project, etc.: Since its establishment in the late 1960s the company has grown steadily. establishment of sth The establishment of new areas of employment is a priority.\nthe establishment\n[ S ] the important and powerful people who control a country, profession, or organization, especially those who support the existing situation: Critics said judges were on the side of the establishment. the business/medical/military establishment"}