{"id":144886,"name":"estate","type":"noun","us_sound":"ɪˈsteɪt","us_link":"../audio/e/eus71657.mp3","uk_sound":"ɪˈsteɪt","uk_link":"../audio/e/ukesq__011.mp3","content":"estate noun\n(PROPERTY)\nAdd to word list\nAdd to word list\nB2 [ C ] a large area of land in the country that is owned by a family or an organization and is often used for growing crops or raising animals: It's a typical country estate with a large house for the owner, farm buildings, and estate workers' houses.\n[ C ]\n&#160; law\n&#160; specialized everything that a person owns when they die : She left her entire estate to her niece.\nMore examplesFewer examplesThe estate for sale includes two miles of river frontage.What acreage is her estate ?With the income from the family estate, she's in clover.The wood lies on the southern extremity of the estate.She will inherit her father's estate when she reaches her majority.\nSMART Vocabulary: related words and phrases\nFarms & ranches\ncollective farm\ncroft\ndairy farm\ndairyman\nfarm\nfarmhouse\nfarmstead\nfish farm\ngrange\nhomestead\nkibbutz\nmarket garden\nnon-cultivated\nnon-farm\nranch\nsmallholding\nspread\nsuperfarm\ntruck farm\ntruck farming\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBelongings and possessions\nestate noun\n(BUILDINGS)\nB2 [ C ] UK a group of houses or factories built in a planned way: a housing estate an industrial estate (= a group of factories)\nMore examplesFewer examplesShe was brought up in a council estate in Liverpool.Police are blaming arsonists for the spate of fires in the Greenfields housing estate.They have a four-bedroom house on a newish estate.They live on a great concrete warren of a housing estate.The estate contains 300 new homes, about a third of which are leased to the council.\nSMART Vocabulary: related words and phrases\nTowns & regions: areas in towns & cities\nanti-development\narrondissement\nbackstreet\nbackstreets\nborough\nbotanic garden\nbusiness park\nChinatown\nindustrial estate\nmarketplace\nold town\non skid row idiom\nouter ring\nplaza\nresidential\nshantytown\nskid\nslummy\nsubdivision\nWimbledon\nSee more results »\nestate noun\n(CAR)\n[ C ] UK (also estate car); (US station wagon) a car with a lot of space behind the back seat and an extra door at the back for putting in large objects\nHenrik5000/iStock/Getty Image Plus/GettyImages\nSMART Vocabulary: related words and phrases\nCars\n4×4\nall-wheel drive\nartic\nautomobile\nbanger\nbeetle\nblack cab\nclassic car\ncrock\nhardtop\nJeep\nmarque\nMerc\nMk\nmotor\nroad racer\nsport utility vehicle\nsportily\nsupercar\ntown car\nSee more results »\nestate noun\n(STATE)\n[ U ] old use a state of being: the holy estate of marriage\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\ncome\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »\nAdd to word list\nAdd to word list\na large, privately owned area of land in the country, often with a large house\nlaw A person’s estate is everything the person owns when he or she dies.\nBr An estate is a group of houses or factories built in a planned way.\nAdd to word list\nAdd to word list\nPROPERTY a group of houses or factories built in a planned way: commercial/industrial/trading estate He rents a unit on an industrial estate. a housing estate\nPROPERTY, LAW everything that a person owns when they die: leave your estate to sb She left her entire estate to her niece.\nCOMMERCE\n&#160; UK a group of small businesses such as pubs or shops, owned and controlled by one company: estate of sth The company, which has an estate of 650 pubs, was one of the first to open smoke-free sites.\nPROPERTY a large area of land in the country which is owned by a family or an organization and is often used for growing crops or raising animals: It's a typical country estate with a large house for the owner, farm buildings and estate workers' houses. See also\nfreehold estate\nleasehold estate\nlegal estate\nlife estate\nreal estate"}