{"id":144960,"name":"estimate","type":"verb","us_sound":"ˈes.tə.meɪt","us_link":"../audio/e/estimate_estimate.mp3","uk_sound":"ˈes.tɪ.meɪt","uk_link":"../audio/e/ukesq__014.mp3","content":"Add to word list\nAdd to word list\nB2 to guess or calculate the cost, size, value, etc. of something: Government sources estimate a long-term 50 percent increase in rail fares. [ + (that) ] They estimate (that) the journey will take at least two weeks. [ + question word ] It was difficult to estimate how many trees had been destroyed.\nThesaurus: synonyms, antonyms, and examples\nto guessguessGuess who called yesterday?estimateThey estimate that the work will take at least ten weeks.divineMum had divined my state of mind rather shrewdly.surmiseFrom the expression on his face, she surmised that something bad had happened.conjectureIt would be reasonable to conjecture that lack of exercise contributed to his obesity.speculateA spokesperson declined to speculate on the cause of the plane crash.\nSee more results »\nMore examplesFewer examplesRed Cross officials estimate that 20 000 refugees streamed into the city last week.The estimated costs of the building project are well over £1 million.We had estimated about 300 visitors, but the actual number was much higher.We estimate the potential market for the new phones to be around one million people in this country alone.It has been estimated that one in eight couples is infertile.\nSMART Vocabulary: related words and phrases\nEstimating value\nappraise\nappraiser\nbook value\ncost\ncosting\nde-index\nest.\neuro\ngoodwill\nindex of leading economic indicators\npricelessly\npricing\nput a figure on it idiom\nput something at something\nquantity surveyor\nquote\nre-estimate\nrecommended retail price\nunderestimate\nvalue\nSee more results »\nRelated word\nestimated\nB2 a guess of what the size, value, amount, cost, etc. of something might be: The number of people who applied for the course was 120 compared with an initial estimate of between 50 and 100. We'll accept the lowest of three estimates for the building work. a conservative (= low) estimate a rough (= not exact) estimate\nMore examplesFewer examplesShe made a rough estimate/calculation of the likely cost.If I said there were three million unemployed, that would be a conservative estimate.Their estimate of the cost of the project was wildly inaccurate.Our estimates were only out by a few dollars.We'll accept the lowest of three estimates for the building work.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculation\nspeculative\nspeculatively\nsuspicion\nSee more results »\nAdd to word list\nAdd to word list\na judgment or calculation of approximately how large or how great something is: I can only make a rough estimate (= an amount that is not exact) of how many people will attend.\nAn estimate is also a statement of the likely cost of building something or doing some other work.\nto guess the size, cost, etc., of something: We estimated his wealth at $500 million. [ + (that) clause ] Doctors estimate (that) he has a 70 percent chance of recovering.\nAdd to word list\nAdd to word list\nto say what you believe the cost, size, value, etc. of something is, although you do not know for certain: estimate how much/many We should be able to estimate how many customers we will have each month. Several online calculators allow you to estimate your carbon emissions.estimate that sth Some analysts estimate that about a quarter of career-track hires in recent years have been women.estimate sth to be sth The knock-on economic benefit is estimated to be about 1200 jobs.estimate sth at sth Global oil reserves were estimated at 1,000 billion barrels.\na guess as to what the size, value, amount, etc. of something might be: make/give/provide an estimate (of sth) Please provide an estimate of the increased cost for your business per annum. The estimates are based on a survey done in the early 1990s, so may no longer be accurate. The best estimate puts the total number of sales at about 1,000. a preliminary/initial/early estimaterough/accurate estimate At a rough estimate, three-quarters of the farms listed are working farms. a conservative/realistic/reasonable estimate\nCOMMERCE a statement for a possible customer about how much a piece of work should cost: give sb/provide/prepare an estimate He will compile the specifications, draw up plans, and prepare an estimate.ask for/obtain an estimate (for sth) We can offer advice on how to obtain estimates for minor repairs. If it is discovered that the cost will be greater than originally estimated, a revised estimate may then be sent to you.\nSee also\ncost estimate\nearnings estimate\ninsurance estimate"}