{"id":145246,"name":"ethical","type":"adjective","us_sound":"ˈeθ.ɪ.kəl","us_link":"../audio/e/ethical.mp3","uk_sound":"ˈeθ.ɪ.kəl","uk_link":"../audio/e/uketern007.mp3","content":"Add to word list\nAdd to word list\nC2 relating to beliefs about what is morally right and wrong: ethical and legal issues the ethical dilemmas surrounding genetic research\nC2 morally right: ethical practice/trading a medical procedure that most people believe to be ethical\nfinance &amp; economics\n&#160; specialized An ethical company operates in a way that tries not to cause social or environmental harm; an ethical investment is money that is put into a company like this: We are committed to ethical business practices. She is part of a growing movement known as ethical investing. They claim to be the only UK investment adviser dealing exclusively in green and ethical funds.\nMore examplesFewer examplesTransplantation of organs from living donors raises ethical issues.Europe's varied cultural, political and ethical normsa minefield of ethical problemsIt may be feasible to clone human beings, but is it ethical?Ethical pensions are appreciated for their ability to offer relief from guilt as well as from tax.\nSMART Vocabulary: related words and phrases\nMorality and rules of behaviour\nantisocial\nantisocially\nbaseness\nbiocentric\nbioethicist\nethic\nethically\nethicist\nethos\nhonour\nliberty\nmoral\nmotto\nprinciple\nprincipled\npropriety\nsavoury\nscript\nthe rights and wrongs idiom\nwork ethic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVirtue and moral good\nInvesting money\nBusiness - general words\nRelated word\nethically\nAdd to word list\nAdd to word list\nmorally right: ethical behaviour/conduct The awards recognize companies, individuals, and nonprofit organizations for ethical behavior. ethical practice/trading Is it ethical to recruit healthcare workers from developing countries experiencing shortages?\nrelating to beliefs about what is morally right and wrong: a consultant on legal and ethical issues the ethical dilemmas surrounding genetic research ethically adverb /ˈeθɪkli/\nMany ethically minded investors would think twice before funding an industry known for misleading ads."}