{"id":145245,"name":"ethic","type":"noun","us_sound":"ˈeθ.ɪk","us_link":"../audio/e/ethic.mp3","uk_sound":"ˈeθ.ɪk","uk_link":"../audio/e/uketern006.mp3","content":"Add to word list\nAdd to word list\nC2 [ C usually plural ] a system of accepted beliefs that control behaviour, especially such a system based on morals: The ethics of journalism are much debated. He said he was bound by a scientist's code of ethics. Publication of the article was a breach of ethics. The children learned an ethic of hard work from their parents. The organization had an ethic of fair play and public service. See also\nwork ethic ethics C2 [ U ]\nthe study of what is morally right and what is not: He took a broad range of courses in sociology, religion, ethics, political thought and more.\nSee more\nMore examplesFewer examplesThe doctor has been accused of violating professional ethics.The company was known for its poor business ethics and many people refused to buy its products.Members of the society are highly qualified and governed by a strict code of ethics.He wrote an article criticizing the business community for its the lack of ethics.\nSMART Vocabulary: related words and phrases\nMorality and rules of behaviour\nantisocial\nantisocially\nbaseness\nbiocentric\nbioethicist\nethical\nethically\nethicist\nethos\nhonour\nliberty\nmoral\nmotto\nprinciple\nprincipled\npropriety\nsavoury\nscript\nthe rights and wrongs idiom\nwork ethic\nSee more results »\nAdd to word list\nAdd to word list\na system of accepted beliefs that control behavior, esp. such a system based on morals: Our school promotes an ethic of service to the community. ethical adjective us\nYour browser doesn't support HTML5 audio\n/ˈeθ·ɪ·kəl/\nNo ethical physician would prescribe that drug. ethically adverb us\nYour browser doesn't support HTML5 audio\n/ˈeθ·ɪk·li/\nLaughing at your clients is ethically wrong.\nAdd to word list\nAdd to word list\nSOCIAL RESPONSIBILITY a system of accepted rules about behaviour, based on what is considered right and wrong: business/professional ethics It would be contrary to business ethics to refuse her insurance cover. A coach is required to comply with the National Governing Body's code of ethics. We promote an ethic of cooperation and social reciprocity. See also\nwork ethic"}