{"id":145350,"name":"ethnic","type":"adjective","us_sound":"ˈeθ.nɪk","us_link":"../audio/e/ethnic.mp3","uk_sound":"ˈeθ.nɪk","uk_link":"../audio/e/uketern012.mp3","content":"Add to word list\nAdd to word list\nC1 relating or belonging to a group of people who can be seen as distinct (= different) because they have a shared culture, tradition, language, history, etc. : A question on ethnic origin was included in the census. They are the second largest ethnic group in Kenya. The factory's workforce reflects the ethnic mix from which it draws its labour. They are ethnic Hungarians (= whose families originally come from Hungary) living in Romania.\nsometimes offensive seen as different or interesting because of coming from a culture or tradition that is not Western : ethnic food ethnic costume\nMore examplesFewer examplesThere are 40 ethnic groups among the school's pupils, who speak many different languages.Judaism is both a religion and an ethnic group.Poverty has risen among most racial and ethnic groups.We do not discriminate on the basis of background or ethnic origin.Many Southeast Asian nations have large ethnic Chinese and Indian populations.Television should reflect the ethnic and cultural diversity of the country.Have ethnic tensions in the area been reduced by intermarriage?\nRelated words\nethnically\nethnicity\nan offensive word for a person belonging to an ethnic minority (= a group of people living in a country where most people are from a different group)\nAdd to word list\nAdd to word list\nrelating to or characteristic of a large group of people who have the same national, racial, or cultural origins, and who usually speak the same language: an ethnic neighborhood She loves ethnic foods, especially Ethiopian and Japanese. ethnically adverb us\nYour browser doesn't support HTML5 audio\n/ˈeθ·nɪk·li/\nan ethnically diverse community\nAdd to word list\nAdd to word list\nrelating to a race or national group of people: The factory's workforce reflects the ethnic mix of the local population.\nfrom a different race, or interesting because characteristic of an ethnic group which is very different from those that are common in western culture: ethnic food/costumes ethnically adverb\nethnically related communities ethnicity noun [ U ] /eθˈnɪsɪti/\nThe law prohibits granting preferential treatment to people based on ethnicity."}