{"id":146233,"name":"evade","type":"verb","us_sound":"ɪˈveɪd","us_link":"../audio/e/evade.mp3","uk_sound":"ɪˈveɪd","uk_link":"../audio/e/ukeuro_013.mp3","content":"Add to word list\nAdd to word list\nformal to avoid or escape from someone or something: The police have assured the public that the escaped prisoners will not evade recapture for long. She leaned forward to kiss him but he evaded her by pretending to sneeze. An Olympic gold medal is the only thing that has evaded her in her remarkable career. [ + -ing verb ] He can't evade doing military service forever.\nThesaurus: synonyms, antonyms, and examples\nto avoid doing somethingavoidAvoid swimming in areas where sharks are known to congregate.evadePlease don’t think I’m trying to evade my responsibility.dodgeHe tried to dodge his military service.run away fromI didn't often run away from difficult decisions.shrink fromI've never been one to shrink from a challenge.sidestepThis is not a responsibility you can sidestep.\nSee more results »\nevade the issue, question, etc.\nto intentionally not talk about something or not answer something: Just give me an answer and stop evading the question!\nSee more\nSMART Vocabulary: related words and phrases\nAvoiding action\nabrogate\nabrogation\navoid\navoid something like the plague idiom\navoidance\ndoss\neschew\nevader\nevasion\nfiddle\nfiddle around\nfight shy of idiom\ninsure\nrun for the hills idiom\nshirk\nshort circuit\nshrink from something\nshy away from something\nsteer\nwelch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRunning away and escaping\nAdd to word list\nAdd to word list\nto avoid something unpleasant or unwanted, or to manage not to do (something that should be done): She’s trying to evade my questions. He was convicted of evading taxes.\nAdd to word list\nAdd to word list\nto intentionally avoid doing or dealing with something that is your duty or responsbility: evade taxes/fees/faresevade the issue/question Critics say the government is still evading the issue of healthcare."}