{"id":146250,"name":"evaluate","type":"verb","us_sound":"ɪˈvæl.ju.eɪt","us_link":"../audio/e/eus71671.mp3","uk_sound":"ɪˈvæl.ju.eɪt","uk_link":"../audio/e/ukeuro_014.mp3","content":"Add to word list\nAdd to word list\nC1 to judge or calculate the quality, importance, amount, or value of something: It's impossible to evaluate these results without knowing more about the research methods employed. [ + question word ] We shall need to evaluate how the new material stands up to wear and tear.\nMore examplesFewer examplesThe effects of the drug on patients' behaviour is extremely difficult to evaluate.Her new book looks at how we can evaluate animal intelligence.In the study, ten major airlines were evaluated for on-time performance, baggage handling, fares, safety and customer service.This activity encourages students to evaluate different points of view and present their own conclusions.The magazine article evaluated ten different digital cameras and ranked them according to price and ease of use.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nRelated words\nevaluation\nevaluative\nAdd to word list\nAdd to word list\nto judge or calculate the quality, importance, amount, or value of something: Doctors evaluate the patient’s condition. [ + question word ] Have they evaluated what their next step is? evaluation noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ɪˌvæl·jəˈweɪ·ʃən/\n[ C ] Student evaluations of the class will be collected next week.\nAdd to word list\nAdd to word list\nto judge the quality, importance, amount, or value of someone or something: evaluate sb on sth Employees will be evaluated on their performance, attendance, and team skills.evaluate sth's/sb's effectiveness/impact/performance The research aims to evaluate the effectiveness of the training programme. Compare\nre-evaluate evaluative adjective\n&#160; formal uk/ɪˈvæljuətɪv/ us/-eɪṱɪv/\nThe questionnaires may be used for evaluative purposes."}