{"id":146302,"name":"evangelistic","type":"adjective","us_sound":"ɪˌvæn.dʒəˈlɪs.tɪk","us_link":"../audio/e/useucal024.mp3","uk_sound":"ɪˌvæn.dʒəˈlɪs.tɪk","uk_link":"../audio/e/ukeuro_023.mp3","content":"evangelistic adjective\n(RELIGION)\nAdd to word list\nAdd to word list\ninvolving persuading people to become Christians, often by travelling around and telling people about your beliefs: She held an evangelistic rally in Fort Worth. They are a group of evangelistic Baptists.\nMore examplesFewer examplesThe church emphasizes evangelistic work. They had just attended an evangelistic meeting. He was training for evangelistic ministry.\nSMART Vocabulary: related words and phrases\nReligious practices\nagarbatti\nallocution\nanoint\nanointment\nbaptize\nflagellate\nflagellation\nfleishig\ngenuflect\ngenuflection\nproselytize\nprostration\npurdah\npurificatory\nrebaptize\nreborn\nsmudging\ntelevangelism\nunbaptized\nunction\nSee more results »\nevangelistic adjective\n(OPINIONS)\noften talking about something because you have very strong beliefs about it, or involving persuading someone to have the same beliefs as you: She walks whenever she can, uses public transport, switches things off and is evangelistic about recycling. The new classical macroeconomists are committed believers in the power of market forces, fired with an almost evangelistic enthusiasm.\nMore examplesFewer examplesHis loyalty is unquestionable; his fervour evangelistic.She's like a convert to nudism, and her evangelistic zeal is so strong, she'll soon have you running around naked too.They have been evangelistic about constructing a drama that reaches out across social barriers.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistically\nexcited\nexcitedly\nfevered\ngo ahead\nmood\nnuts\nomnivorous\nomnivorously\non the edge of your seat idiom\nzestful\nzestfully\nSee more results »"}