{"id":146372,"name":"even","type":"adverb","us_sound":"ˈiː.vən","us_link":"../audio/e/even.mp3","uk_sound":"ˈiː.vən","uk_link":"../audio/e/ukeve__002.mp3","content":"even adverb\n(SURPRISE)\nAdd to word list\nAdd to word list\nA2 used to show that something is surprising, unusual, unexpected, or extreme: I don't even know where it is. Everyone I know likes the smell of bacon - even Mike does and he's a vegetarian. We were all on time - even Chris and he's usually late for everything. It's a very difficult job - it might even take a year to finish it. \"I never cry.\" \"Not even when you hurt yourself really badly?\" Even with a load of electronic gadgetry, you still need some musical ability to write a successful song. even as\nat the same time as: I tried to reason with him, but even as I started to explain what had happened he stood up to leave.\nSee more even if\nB2 used to say that if something is the case or not, the result is the same: Even if you take a taxi, you'll still miss your train.\nSee more even now/then\ndespite something: I've thought about it so much, but even now I can't believe how lucky I was to survive the accident.\nSee more even so\nC1 despite what has just been said: I had a terrible headache, but even so I went to the concert.\nSee more even though\nB2 although: Even though he left school at 16, he still managed to become prime minister.\nSee more\nMore examplesFewer examplesHe didn't even buy me a card for my birthday.They've already run out of money and the building isn't even half-finished .We hadn't even got as far as London when the car broke down.The new varieties of wheat grow well even in poor soil.This dishwasher even washes pots and pans .\nSMART Vocabulary: related words and phrases\nExpressions of surprise\naccha\nachha\nactually\nay\nbegorrah\nblow\nclutch\nfancy\nglory\nheavens (above)! idiom\nhell's bells\nhold on idiom\nhow about that? idiom\nI ask you! idiom\nomg\nsagebrush\nsheesh\nshit\nshock, horror! idiom\nshut\nSee more results »\neven adverb\n(EMPHASIS)\nB1 used to emphasize a comparison: The next 36 hours will be even colder with snow showers becoming more widespread. Any devaluation of the pound would make it even more difficult to keep inflation low.\nMore examplesFewer examplesThe traffic congestion in the city gets even worse during the summer.Atoms are made up of smaller particles - protons, neutrons and electrons - some of which are made up of even smaller ones, called quarks.There was quite a lot of traffic today but yesterday was even busier.People are rushing to buy property before prices rise even further.This range of computers is very fast, but their successors will be even faster.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\neven adverb\n(MORE EXACTLY)\nused when you want to be more exact or detailed about something you have just said: I find some of his habits somewhat unpleasant, disgusting even. She has always been very kind to me, even generous on occasion.\nMore examplesFewer examplesThe band seemed rather downbeat, even unconcerned about their success.The psychologist's attitude seemed far too casual, even brutal.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nConjunctions: contrastingThe conjunctions but and although/though connect ideas that contrast. Whereas is also used but it is not as common: …\nButBut is a coordinating conjunction used to connect ideas that contrast. Coordinating conjunctions connect items which are the same grammatical type. …\nAlthough/thoughAlthough/though can be used to contrast ideas. Although/though are subordinating conjunctions used to connect a subordinate clause to a main clause, like after, as, before, if, since, that, even though, even if. …\nBut or although?But cannot be used in the same way as although/though. We use but to connect items which are the same grammatical type (coordinating conjunction). …\nEven though, even ifEven though and even if are also used as subordinating conjunctions in the same way as although/though. Even though is similar to although but it makes a stronger contrast: …\nConjunctions: typical errorsWe use and to connect words in a list and to connect phrases and clauses in a sentence: …\nEvenEven is an adverb. …\nEven: positionWhen even refers to a whole clause or sentence, we usually put it in the normal mid position for adverbs, between the subject and the main verb, after the modal verb or first auxiliary verb, or after be as a main verb: …\nEven and comparativesWe often use even with comparative adjectives and adverbs to add more emphasis: …\nEven and alsoEven and also are both adverbs. …\nEventhough and even ifWe can use even with though and if. …\nEven soWe use even so to make a contrast, to mean ‘despite something’. It has a similar meaning to however or nevertheless. …\neven adjective\n(FLAT)\nflat and smooth, or on the same level: We resurfaced the floor because it wasn't even.\nMore examplesFewer examplesSpread a nice even layer of butter on each slice of bread.We chose a large even stretch of grassy to pitch our caravan on.The paving slabs were not even, and Granny had a nasty fall.You need a nice even surface to draw on - I'll get you a piece of board.I complained to the builders that the floor wasn't even.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\neven adjective\n(CONTINUOUS)\ncontinuous or regular: You should try to work at an even rate instead of taking it easy one day and working flat out the next.\nMore examplesFewer examplesThe paint isn't very even, is it? We'd better give it another coat.Her breathing became slow and even, so I knew she was asleep.The monitor showed that he had a clear even heartbeat.Try to keep the beat even - don't speed up toward the end of the piece.He runs with long, even strides, never breaking his rhythm.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\neven adjective\n(EQUAL)\nequal or equally balanced: Both sides played well - it was a very even contest. The weather forecast said that there's an even chance of thunderstorms tonight (= that it is equally likely that there will or will not be storms).\nUS (UK evens) equally likely to happen as to not happen: The chances of her getting the job are about evens.\nused to refer to a situation in which you risk money on something where the risk is equally balanced, and will pay back twice the amount of money that is paid if it is successful: an even bet If I were betting I'd take even money on United.\nMore examplesFewer examplesHalfway through the tournament Montgomery and Woods were even, but then Woods drew ahead.It really wasn't an even contest - the other team was far stronger than us.The distribution of wealth across the country from the north to the south is far from even.The children complained that the slices of pizza were not even in size.There doesn't seem to be a very even balance in their relationship in terms of household duties.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\nStatistics\nGambling & bookmaking\neven adjective\n(NUMBER)\nforming a whole number that can be divided exactly by two: 6 is an even number and 7 is an odd number.\nMore examplesFewer examplesIf you're multiplying by an even number, you know the answer can't be an odd number.The houses with odd numbers are on one side of the street, and those with even numbers are on the other.\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nreciprocal\nrecurring\nrecurring number\nremainder\nresponse variable\ntwentyfold\ntwofold\nweighting\nSee more results »\nIdioms\nget even with someone\non an even keel\nto make two things equal: Sheila was awarded a scholarship in chemistry, and now her brother has evened the score with a scholarship in economics. The whisky industry is campaigning for the taxes on different alcoholic drinks to be evened up.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\nequalization\neven (something) out\nfavour\nflatlining\nhomologous\nhomologous series\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\nPhrasal verb\neven (something) out\neven adjective\n(EQUAL)\nAdd to word list\nAdd to word list\nequal or equally balanced: The class has a pretty even mix of boys and girls. I bought the tickets, so if you pay for dinner we’ll be even (= you will not owe me any money).\neven adjective\n(CONTINUOUS)\ncontinuous or regular: We walked at an even pace.\neven adjective\n(FLAT)\nflat and smooth, or on the same level: The snow was even with the kitchen doorstep.\neven adjective\n(NUMBER)\n[ not gradable ] (of numbers) able to be exactly divided by two: The result should be an even number.\neven adverb [not gradable]\n(EMPHASIS)\nused to emphasize a comparison or the unexpected or extreme characteristic of something: Even smart people can make mistakes. She never cried – not even when she was badly hurt. Even with a good education, you need some common sense to get ahead. The new service is one of the most useful and popular on the Web. Even better, it's free to use.\neven adverb [not gradable]\n(MORE EXACTLY)\nused when you want to be more exact or detailed about something you have just said: I’d like to get a place in the Rocky Mountains, maybe Colorado or Montana – Idaho even.\nIdioms\neven if\neven so\neven though\neven verb [I/T]\n(EQUAL)\nto make equal: [ T ] Tonight’s win evens their record at 6-6. [ M ] They won the next night to even up the score. [ M ] Taking me to the movies isn’t going to even things out.\nAdd to word list\nAdd to word list\nhappening in a smooth, gradual, and regular way instead of changing a lot or changing suddenly: an even rate/pace Share prices are continuing to rise at an even rate.\nfair and equal: an even trade/deal Both parties considered the exchange an even trade, with each property valued at $1.7 million.\nan even ten/fifty/hundred, etc.\ninformal used to describe a number that ends in 0, not more or less than that number: \"Will you sell it for $45?\" \"Make it an even fifty and you got a deal.\"\non an even keel\nable to stay even and regular, and not change suddenly: get back/stay/keep on an even keel Investors are hoping the new board will help share prices get back on an even keel."}