{"id":146436,"name":"ever","type":"adverb","us_sound":"ˈev.ɚ","us_link":"../audio/e/ever.mp3","uk_sound":"ˈev.ər","uk_link":"../audio/e/ukeve__014.mp3","content":"ever adverb\n(AT ANY TIME)\nAdd to word list\nAdd to word list\nA2 at any time: Nothing ever happens here in the evening. Have you ever been to London? If you're ever/If ever you're in Rio, do give me a call. He hardly ever (= almost never) washes the dishes and he rarely, if ever, (= probably never) does any cleaning. When there's a James Bond movie on TV, I never ever miss it. If ever there was a cause for celebration, this peace treaty was it. The smell is worse than ever. I thought she was famous, but none of my friends have ever heard of her. better, bigger, more, etc. than ever\nC1 better, bigger, etc. than at any time before: We are spending more than ever on education.\nSee more as big, fast, good, etc. as ever\nas big, fast, etc. as at any time before: The restaurants are as good as ever and no more expensive.\nSee more\nMore examplesFewer examplesThe relative cheapness of foreign travel means that more people are going abroad than ever before.If you're ever in Perth, come and visit us.Blue whales are the largest creatures ever to have lived.She declared (that) it was the best chocolate cake she had ever tasted.I went to Paris last summer. Have you ever been there?\nSMART Vocabulary: related words and phrases\nAlways & never\nagain\nall along idiom\nall-time\nalong\nalways\naye\nfail\nhell\nin all my (born) days idiom\nin/through all the years idiom\ninvariably\nkingdom\nmonth\non demand idiom\nperpetual\nperpetually\ntill/until kingdom come idiom\ntill/until the cows come home idiom\nwhenever\nworld\nSee more results »\never adverb\n(ALWAYS)\nC2 continuously: United's record in cup competitions grows ever more impressive. The ever-increasing demand for private cars could be halted by more investment in public transport. Nuclear devastation was an ever-present threat. Susan and Guy moved to the country, where they lived happily ever after.\nThesaurus: synonyms, antonyms, and examples\nfor a very long timealwaysThe power plant is always running. for everI will love you for ever.permanentlyHis reputation was permanently ruined by the scandal.eternallyEvildoers shall be eternally condemned.uninterruptedlyStocks have risen uninterruptedly for the last three months.\nSee more results »\never since\nB1 continuously since that time: He's been depressed ever since he got divorced.\nSee more as ever\nin the same way as always: As ever, I was the last to find out.\nSee more yours ever UK formal (also ever yours)\nused at the end of a letter as a way of saying goodbye to someone you know well: Yours ever, Yvonne.\nSee more\nMore examplesFewer examplesThey have been deadly enemies ever since Mark stole Greg's girlfriend.She's been in and out of hospitals ever since the accident.The outlook for the region's economy is looking every better.There are ever-growing tensions between the two countries.The company's ever-falling profits this year are making its shareholders nervous.\nSMART Vocabulary: related words and phrases\nAlways & never\nagain\nall along idiom\nall-time\nalong\nalways\naye\nfail\nhell\nin all my (born) days idiom\nin/through all the years idiom\ninvariably\nkingdom\nmonth\non demand idiom\nperpetual\nperpetually\ntill/until kingdom come idiom\ntill/until the cows come home idiom\nwhenever\nworld\nSee more results »\never adverb\n(EMPHASIS)\nused for emphasizing an adjective: The orchestra is to perform its last ever concert/last concert ever tomorrow night at the Albert Hall. Yesterday the company announced its first ever fall in profits. Was she ever a fast runner! (= She was a very fast runner!) \"Are you looking forward to your vacation?\" \"Am I ever!\" (= Yes, very much!)\nin questions, used to emphasize the question word: How ever did he manage that? What ever have you done to him? Why ever would anyone/Why would anyone ever want to hurt her? ever so/ever such a B2 UK informal\nvery/a very: She's ever so pretty.\nSee more\nMore examplesFewer examplesThat was your best performance ever - congratulations!The company has had one of its best years ever.This is one of the worst natural disasters ever to befall the area.Hurricane Hugo will go down in the record books as the costliest storm ever faced by insurers.Don't you think that was the funniest movie ever?\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nEverEver is an adverb. …\nEver: at any timeWe use ever in questions: …\nEver after ifWe can use ever immediately after if or in mid position (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after main verb be): …\nEver so and ever suchWe use ever before so and such to add emphasis: …\nEver sinceWe use ever before since to emphasise that something has been true from the beginning of a specific period of time: …\nAs … as everWe can use ever with the comparative form as … as …. This shows a permanent characteristic of someone or something: …\nEver meaning ‘always’In more formal situations, we can use ever with adjectives to mean ‘always’: …\nNever or not … ever?We can use not … ever instead of never, but never is much more common: …\nIdiom\nif ever there was one\never adverb [not gradable]\n(AT ANY TIME)\nAdd to word list\nAdd to word list\nat any time: Nothing ever happens here. Have you ever been to Europe? I thought she was famous, but none of my friends have ever heard of her. We are spending more money than ever. He hardly ever washes the dishes (= almost never).\never adverb [not gradable]\n(ALWAYS)\nalways, or continuously: Her record grows ever more impressive over the years. There’s an ever-increasing demand for new styles. I have taught school ever since my children were little.\never adverb [not gradable]\n(EMPHASIS)\nused to emphasize an adjective: I saw John Coltrane’s last concert ever. Was she ever angry (= She was very angry)!"}