{"id":146464,"name":"everything","type":"pronoun","us_sound":"ˈev.ri.θɪŋ","us_link":"../audio/e/everything.mp3","uk_sound":"ˈev.ri.θɪŋ","uk_link":"../audio/e/ukeve__023.mp3","content":"Add to word list\nAdd to word list\nA2 all things: You can't blame him for everything.anything and everything He's obsessed with Britney Spears and collects anything and everything connected with her.in spite of everything Jane's been unfaithful to Jim three times, but he still loves her in spite of everything. Money isn't everything (= the most important thing).everything to His children are everything to him (= the most important part of his life). Have you been crying? Is everything all right? The thieves took everything. We did everything we could to save her but she died.everything necessary We shall do everything necessary to bring the murderer to justice. They're very busy with their new house and everything (= all the things connected with it).\nMore examplesFewer examplesRescuers are doing everything they possibly can to free the trapped people.She's new to the job so you can't expect her to know everything yet.Make sure you keep a receipt for everything you buy.Are you sure we've got everything we need for the journey?If I don't wear my glasses, everything is just a blur.\nSMART Vocabulary: related words and phrases\nSomething, anything, nothing, and everything\nacross-the-board\nanything\naught\nbazillion\nbupkis\nfresh\nmatter\nnone\nnot a dicky bird idiom\nnot a sausage idiom\nnot/nothing much idiom\nnothing\nnowt\nsweet\nsweet fanny adams idiom\nthe whole bit idiom\nwhat with one thing and another idiom\nwhatevs\nwhit\nzip\nSee more results »\nIdiom\neverything but/except the kitchen sink\nAdd to word list\nAdd to word list\nall things: They lost everything in the fire. In spite of everything, I still love him. The price of gasoline affects everything else. \"Is everything all right?\" \"Everything is fine.\" Money isn’t everything (= it is not the only important thing). Her children are everything to her (= the most important part of her life). They’re very busy with their new house and everything (= all the things connected with it). Idiom\neverything but the kitchen sink"}