{"id":146524,"name":"evident","type":"adjective","us_sound":"ˈev.ə.dənt","us_link":"../audio/e/eus75718.mp3","uk_sound":"ˈev.ɪ.dənt","uk_link":"../audio/e/ukeve__029.mp3","content":"Add to word list\nAdd to word list\nB2 easily seen or understood: The full extent of the damage only became evident the following morning. From the smell it was evident that the drains had been blocked for several days.evident to Harry's courage during his illness was evident to everyone.evident in Her love for him was evident in all that she did. Synonyms\nmanifest formal\nobviousSee also\nself-evident\nThesaurus: synonyms, antonyms, and examples\neasy to see, recognize, or understandobviousIt's obvious that she's upset.clearIt was clear that he was unhappy.apparentHer joy was apparent to everyone.plainHis disappointment was plain to see.evidentThe company president was impressed by her evident ambition.manifestHis manifest lack of interest has provoked severe criticism.\nSee more results »\nMore examplesFewer examplesHer sophistication is evident from the way she dresses.It became evident during the interview that he was not suitable for the job.You've made your feelings quite evident, thank you, sir.It's perfectly evident from her change in behaviour that she's not happy at school.The reason is for the council's decision is quite evident, isn't it?\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nin plain sight idiom\nobtrude\npalpable\npalpably\nparallax\npatently\nperceivable\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\nAdd to word list\nAdd to word list\neasily seen or understood; obvious: It quickly became evident that someone had broken in. Twain’s interest in Adam is evident in all his work. evidently adverb us\nYour browser doesn't support HTML5 audio\n/ˈev·ɪ·dənt·li/\nI thought she’d want to see me. Evidently, she doesn’t."}