{"id":146519,"name":"evidence","type":"noun","us_sound":"ˈev.ə.dəns","us_link":"../audio/e/eus75717.mp3","uk_sound":"ˈev.ɪ.dəns","uk_link":"../audio/e/ukeve__027.mp3","content":"Add to word list\nAdd to word list\nB2 one or more reasons for believing that something is or is not true: evidence of The police have found no evidence of a terrorist link with the murder. [ + to infinitive ] There is no scientific evidence to suggest that underwater births are dangerous. [ + that ] Is there any scientific evidence that a person's character is reflected in their handwriting?give evidence Several experts are to give evidence on the subject.circumstantial evidence There is only circumstantial evidence against her, so she is unlikely to be convicted.documentary evidence Campaigners now have compelling documentary evidence of the human rights abuses that they had been alleging for several years.fresh evidence Fresh evidence suggests that the statement had been fabricated.forensic evidence The traces of petrol found on his clothing provided the forensic evidence proving that he had started the fire deliberately.all the evidence All the evidence points to a substantial rise in traffic over the next few years.growing evidence that There is growing evidence that people whose diets are rich in vitamins are less likely to develop some types of cancer.\nMore examplesFewer examplesThe jury heard conflicting evidence from three different witnesses.For a long time it was thought to be a harmless substance, but we now have evidence to the contrary.She was charged with giving false evidence in court.There is abundant evidence that cars have a harmful effect on the environment.The police believe he is the thief, but all the evidence suggests otherwise .\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nprobatory\nproof positive\nprovability\nprovable\nprovably\nthe acid test\nverify\nvindicate\nvindication\nvindicative\nvindicatory\nSee more results »\nRelated word\nevidenced\nAdd to word list\nAdd to word list\nanything that helps to prove that something is or is not true: These figures are being given as evidence of economic growth. The FBI has found no evidence of a crime. The weight of the evidence is against him. Juries examine the evidence and decide on the basis of the facts.\nAdd to word list\nAdd to word list\nobjects, documents, official statements, etc. that are used to prove something is true or not true, especially for legal or insurance purposes: evidence of/for sth Despite the claims, his insurance adjuster found no evidence of flood damage to his property.evidence against sb The defendant was released after the prosecutor failed to produce enough evidence against him.evidence that sth Is there any evidence that the employer has difficulty retaining staff? give/provide/present evidence Contractors must provide evidence of valid permits before they may begin any work.consider/examine/hear the evidence A jury has heard all the evidence in this case and rendered its decision. false/circumstantial/conflicting evidence admit/allow/accept evidence growing/mounting/increasing evidence"}