{"id":146531,"name":"evil","type":"adjective","us_sound":"ˈiː.vəl","us_link":"../audio/e/evil.mp3","uk_sound":"ˈiː.vəl","uk_link":"../audio/e/ukevil_001.mp3","content":"Add to word list\nAdd to word list\nB2 morally bad, cruel, or very unpleasant: an evil dictator These people are just evil.\nThesaurus: synonyms, antonyms, and examples\na bad person, action, etc.badA very bad man is getting what he deserves.evilHe was an evil dictator who murdered his own people.wickedRapunzel was trapped inside a tower by a wicked witch.awfulShe was truly awful to him through their entire marriage.terribleHe was a terrible husband.\nSee more results »\nIf the weather or a smell is evil, it is very unpleasant.\nMore examplesFewer examplesThe film was about an evil genius who wanted to control the world.She was given a magic charm to ward off evil spirits.I don't believe that human beings are innately evil.This evil, cold-hearted killer confessed that he often drugged his victims before he killed them.In the 'Harry Potter' films, does the evil wizard, Voldemort, ever actually appear?\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\nobscenely\nturpitude\nunconscionable\nunconscionably\nunethical\nunprincipled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSerious and unpleasant\nIdiom\nthe evil eye\nB2 something that is very bad and harmful: Each new leader would blame his predecessor for all the evils of the past. Drug addiction is one of today's great social evils.lesser of two evils For the sake of long-term peace, the military option is the lesser of two evils (= the less unpleasant of two bad choices).good and evil the battle between good and evil\nMore examplesFewer examplesPoverty and ignorance, the bishop said, were the forces of evil in our society today.Frank subscribed firmly to the belief that human kindness would overcome evil.She was portrayed in the papers as the embodiment of evil.You should never meddle with the powers of evil.His new book is a gruesome tale of evil, deceit and murder.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\nobscenely\nturpitude\nunconscionable\nunconscionably\nunethical\nunprincipled\nSee more results »\nIdiom\ngive someone evils\nAdd to word list\nAdd to word list\nthe condition of being immoral, cruel, or bad, or an act of this type: [ U ] a contest between good and evil evil adjective us\nYour browser doesn't support HTML5 audio\n/ˈi·vəl/\nan evil ruler"}