{"id":146620,"name":"evolve","type":"verb","us_sound":"ɪˈvɑːlv","us_link":"../audio/e/eus71689.mp3","uk_sound":"ɪˈvɒlv","uk_link":"../audio/e/ukevil_012.mp3","content":"Add to word list\nAdd to word list\nC1 to develop gradually, or to cause something or someone to develop gradually: evolve from Did humans evolve from apes?evolve into The company has evolved over the years into a multi-million dollar organization. Bacteria are evolving resistance to antibiotics.\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nMore examplesFewer examplesThe exhibition will illustrate how life evolved from water.Each manager has left his or her own stamp on the way the company has evolved.The universe evolved from a densely packed primal inferno.Most languages are constantly evolving and changing, which is what keeps them alive.These animals have evolved all the necessary qualities to help them catch their prey.\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolved\nflourish\nflower\nformatively\nfrom A to B idiom\nfurtherance\njourney\nmature\npunctuated equilibrium\nrebuild\nregenerate\nripen\nripeness\nspread\nSee more results »\nAdd to word list\nAdd to word list\nto change or develop gradually: These countries are evolving toward more democratic societies.\nbiology If a creature evolves, it changes over time by the process of evolution.\nAdd to word list\nAdd to word list\nto develop gradually, or to make someone or something change and develop gradually: evolve into sth Over the past three years he has evolved into one of America's most successful restaurant owners.evolve from sth Many investment management companies have evolved from small entrepreneurial organizations. We must evolve new strategies to cope with changing markets."}