{"id":146659,"name":"ex","type":"noun","us_sound":"eks","us_link":"../audio/e/x.mp3","uk_sound":"eks","uk_link":"../audio/e/ukevil_014.mp3","content":"Add to word list\nAdd to word list\nSomeone's ex is a person who was their wife, husband, or partner in the past: Is she still in touch with her ex?\nSMART Vocabulary: related words and phrases\nMarriage: marital status\nbachelor\nbachelorette\nbachelorhood\nbe between jobs/marriages/boyfriends, girlfriends, etc. idiom\nbetween\nhoneymooners\nlive in\nlone\nmarried\nmarry\nmiss\nspinster\nspinsterhood\nspoken for\ntrophy wife\nunattached\nwidowed\nwidower\nwidowhood\nwifely\nSee more results »\nused to show that someone is no longer what they were: ex-prisoners ex-policemen my ex-husband my ex-girlfriend\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nof late idiom\nsometime\nstep\nstep back (in time) idiom\nthe status quo ante\nuse\nSee more results »\nAdd to word list\nAdd to word list\nsomeone you are no longer married to\nused to show that someone is no longer in the situation or condition the person had been in; former : The governor of Minnesota is an ex-wrestler.\nAdd to word list\nAdd to word list\nnot including a particular amount: It only costs £249 ex VAT!\nTRANSPORT used for stating that the price of goods includes transport to a particular place, and then transport arrangements and costs are the buyer's responsibility: For units to be shipped ex Dublin, the units have to be booked before 1200 on Saturday. See also\nex dock\nex-factory\nex quay\nex ship\nex warehouse\nex wharf\nFINANCE used to mean 'not including', to show that a particular right or advantage belongs to the seller and is not included in the sale or price of an investment: When a share goes ex-dividend, the purchaser is no longer entitled to receive the company's current dividend. Compare\ncum\nused before a job title or relationship to show that someone had that job or relationship in the past but does not have it now: He ended up suing his ex-boss for unpaid wages. an ex-colleague Formal complaints were made against the ex-chairmen and the ex-chief executive. See also\nex-all\nex-capitalization\nex-coupon\nex-dividend\nex-interest\nex-rights\nex-scrip"}