{"id":146671,"name":"exact","type":"adjective","us_sound":"ɪɡˈzækt","us_link":"../audio/e/exact.mp3","uk_sound":"ɪɡˈzækt","uk_link":"../audio/e/ukevil_017.mp3","content":"exact adjective\n(ACCURATE)\nAdd to word list\nAdd to word list\nB1 in great detail, or complete, correct, or true in every way: The exact distance is 1.838 metres. The exact time of the accident was 2.43 p.m. to be exact \"I still owe you £7, don't I?\" \"Actually, it's £7.30 to be exact.\" The exact location of the factory has yet to be decided. Synonym\npreciseOpposites\nimprecise\ninaccurate\ninexactRelated word\nexactness\nThesaurus: synonyms, antonyms, and examples\ncomplete and true in every detailexactWhat is your exact location?preciseIt was a mathematically precise model of how the wind would affect the structure.accurateWe need accurate measurements before we can begin the building project.superaccurateScientists use a superaccurate atomic clock to measure time.specificPlease make your questions as specific as possibile.\nSee more results »\nMore examplesFewer examplesI looked the word up in the dictionary to check the exact meaning.We don't yet know the exact wording of the agreement.The exact number of casualties still hasn't been confirmed.I forget the exact age difference between Mark and his brother - they're two or three years apart.Mystery still surrounds the exact circumstances of Stalin's death.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nan exact science\nproducing results that can be described and understood very accurately: We all like to think that medicine is an exact science, but that isn't always the case. Unlike astronomy, astrology cannot be described as an exact science. See also\ninexact\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nnot an exact science\nproducing results that can be understood in various ways: Diagnosis is not an exact science: two doctors can look at the same test results and come up with a different opinion. Predicting hurricane location is not an exact science: even with the best technology, the computer models have a margin of error of 80 miles. See also\ninexact\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximate\napproximately\naround\nguess\ninexact\ninexactly\nish\nloosely\nloosey-goosey\nrough\nround\nrule\nsense\nsketchy\nsome\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nSee more results »\nto demand and get something, sometimes using force or threats: to exact revenge on someone The blackmailers exacted a total of $100,000 from their victims.\nto make something necessary: Heart surgery exacts tremendous skill and concentration.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexpect\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEssential or necessary\nexact adjective\n(CORRECT)\nAdd to word list\nAdd to word list\nin perfect detail; complete and correct: The exact distance is 3.4 miles. Do you have the exact time? \"Is it 12 o’clock yet?\" \"It’s 12:03 to be exact.\"\nExact is sometimes used to increase emphasis on the following word: She’s going through the exact same things I went through.\nexact verb [T]\n(OBTAIN)\nto demand and obtain something, sometimes using threats or force: to exact revenge\nAdd to word list\nAdd to word list\ncomplete, correct, or true in every way: exact number/amount/price The exact purchase price will depend on the company’s per-share book value on the deal's closing date. We are going to provide over $50 million, $52 million to be exact, in grants.\nexact change/money\nMONEY the correct amount of cash needed to pay for something, and not more or less than the amount needed: Do you have the exact change? We’re out of quarters.\nto demand a payment from someone: Creditors may exact severe penalties if the borrower defaults.\nexact a toll/price/cost\nto create problems, loss, danger, etc. for someone or something: Alcohol and drug abusers exact a heavy toll on American businesses due to lower productivity, increased absenteeism, and accidents."}