{"id":146737,"name":"exam","type":"noun","us_sound":"ɪɡˈzæm","us_link":"../audio/e/exam.mp3","uk_sound":"ɪɡˈzæm","uk_link":"../audio/e/ukevil_030.mp3","content":"Add to word list\nAdd to word list\nA2 a test of a student's knowledge or skill in a particular subject : take an exam American students ranked fourth in those taking the geography exam. I failed my physics exam, but I passed chemistry.examination paper Helen turned over the examination paper and checked the clock.exam results Anxious students were standing around waiting for their exam results.\nUS the act of looking at or considering something carefully in order to discover something, especially a medical examination of part of your body: eye exam If you find yourself squinting to see, it may be time for an eye exam.physical exam He gets yearly blood tests and a physical exam. a pelvic/rectal/breast/neurological exam an ultrasound/a polygraph exam Synonyms\nexamination\ntest\nMore examplesFewer examplesShe got very high marks in her biology exam.I finished my exams yesterday, but I won't get the results until August.He did worse than he was expecting in the exams.You're not allowed to talk during the exam.People clustered around the noticeboard to read the exam results.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\noral\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nAnalysing and evaluating\nAdd to word list\nAdd to word list\na test of a student’s knowledge or skill in a particular subject: The final exams are scheduled for next week.\nAdd to word list\nAdd to word list\na formal test that you must pass in order to earn a particular qualification or be allowed to do a particular job: take/pass/fail an exam Candidates for supervisory jobs must take a written exam. bar/civil-service/licensing exam"}