{"id":146745,"name":"examination","type":"noun","us_sound":"ɪɡˌzæm.əˈneɪ.ʃən","us_link":"../audio/e/examination_exam.mp3","uk_sound":"ɪɡˌzæm.ɪˈneɪ.ʃən","uk_link":"../audio/e/ukexami001.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the act of looking at or considering something carefully in order to discover something: a post-mortem examinationhave an examination I had to have a medical examination when I joined the pension scheme.under examination The evidence is still under examination (= being examined).on closer examination I thought it was paint at first, but on closer examination I realized it was dried blood.\nA2 [ C ] formal an exam\nMore examplesFewer examplesThe doctor has made an initial diagnosis, but there'll be an additional examination by a specialist.Forensic examination revealed a large quantity of poison in the dead man's stomach.I had to strip down to my underwear for my medical examination.We took a sample of the river water back to the laboratory for examination.Careful examination of the plane revealed minute cracks in the fuselage and wings.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\ndive\nenquiry\ngauge\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\ninterpretive\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nreinvestigation\nthe acid test\nweigh\nSee more results »\nAdd to word list\nAdd to word list\nthe act or process of carefully looking at someone or something to learn about its condition or to discover facts: [ C ] You have to have a physical examination/exam in order to get life insurance. [ U ] The evidence is still under examination (= being examined).\nAdd to word list\nAdd to word list\n[ C or U ] the process of checking something carefully in order to discover new information or prove particular facts: examination of sth The review includes a detailed examination of city records. close/comprehensive/careful examination\n[ C ] (also exam) a formal test that you must pass in order to earn a particular qualification or to be allowed to do a particular job: take/pass/fail an examination Shortly after taking the bar examination he was offered a position at a local law firm. a certification/qualification/licensing examination See also\ncross-examination\ndirect examination\nexamination-in-chief\nre-examination\nregulatory examination"}