{"id":146765,"name":"example","type":"noun","us_sound":"ɪɡˈzæm.pəl","us_link":"../audio/e/example.mp3","uk_sound":"ɪɡˈzɑːm.pəl","uk_link":"../audio/e/ukexami004.mp3","content":"example noun [C]\n(TYPICAL CASE)\nAdd to word list\nAdd to word list\nA1 something that is typical of the group of things that it is a member of: example of Could you give me an example of the improvements you have mentioned? This painting is a marvellous example of her work. See also\nexemplify\nA1 a way of helping someone to understand something by showing them how it is used: Study the examples first of all, then attempt the exercises on the next page. for example\nA1 used when giving an example of the type of thing you mean: Offices can easily become more environmentally friendly by, for example, using recycled paper.\nSee more\nMore examplesFewer examplesThis church is a perfect example of medieval architecture.'She', 'it', and 'who' are all examples of pronouns.An early example of privatization was the enclosure of public land for private use by wealthy landlords.He's a classic example of a kid who's clever but lazy.Sweden is often held up as an example of a successful social democracy.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nfor instance idiom\nforerunner\nillustration\ninstance\njob\nqua\nquintessence\nrole model\nsample\nshowpiece\nsort\nspecimen\ntaste\nSee more results »\nexample noun [C]\n(BEHAVIOUR)\nB2 a person or a way of behaving that is considered suitable to be copied: example to He's a very good example to the rest of the class.follow someone's example He's decided to follow the example of his father and study law.\nMore examplesFewer examplesMother Teresa's goodness is an example to us all.She was an inspiring example to her followers.Senior pupils are expected to set an example to the younger children.Mary always gets on with her homework after tea - why don't you follow her example?What kind of an example are the players setting to their fans, with this kind of violent and offensive behaviour?\nSMART Vocabulary: related words and phrases\nBehaving, interacting and behaviour\nas ye sow, so shall ye reap idiom\natavism\nattachment disorder\nattitude\nbehave\nconduct\nhumanization\nhumanize\ninteract\ninteraction\nism\nmake nice idiom\nmanner\npresence\nprovincialism\nprovincialist\nprovinciality\nprovincially\nsauce\ntreat\nSee more results »\nexample noun [C]\n(PUNISHMENT)\na punishment that is intended to warn others against doing the thing that is being punished, or a person who receives such a punishment: make an example of The judge made an example of him and gave him the maximum possible sentence.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\ngross misconduct\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsort\nsort something out\nspare the rod and spoil the child idiom\nSee more results »\nIdiom\nset an example\nexample noun [C]\n(TYPICAL CASE)\nAdd to word list\nAdd to word list\nsomething that is typical of the group that it is a member of or that can be used to represent it: Let me give you an example of what I mean. For example (= as a particular case showing a more general situation), some states allow one adult to care for as many as 12 infants.\nexample noun [C]\n(BEHAVIOR)\na person or a person’s behavior when considered as suitable to copy: We want our teachers to set a good example. They followed the example of their father, who also played basketball in college.\nexample noun [C]\n(PUNISHMENT)\n(a person who receives) a punishment that is intended to warn others against doing the thing that is being punished: The judge made an example of him and sentenced him to prison.\nAdd to word list\nAdd to word list\nsomething used to represent other things because it has all the main qualities or characteristics that they also have: as an example of how/what/why Economists point to the auto industry as an example of how low consumer spending is hurting the economy. Example cover letters and sample resumés can be downloaded for free by registered job seekers."}