{"id":146755,"name":"examined","type":"verb","us_sound":"ɪɡˈzæm.ɪn","us_link":"../audio/e/examine.mp3","uk_sound":"ɪɡˈzæm.ɪn","uk_link":"../audio/e/ukexami002.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nexamine\nexamine verb [T]\n(LOOK AT CAREFULLY)\nB2 to look at or consider a person or thing carefully and in detail in order to discover something about them: Forensic scientists are examining the wreckage for clues about the cause of the explosion. The council is to examine ways of reducing traffic in the city centre. The research examined the effects of alcohol on long-term memory. [ + question word ] We need to examine how an accident like this can be avoided in the future. A psychiatrist was examined (= asked questions) on the mental state of the defendant. Synonyms\ncheck (EXAMINE)\ncheck something out (EXAMINE) informal\ninspect\nperuse formal\nscan (LOOK)\nstudy (EXAMINE)\nsurvey (LOOK AT) formal\nThesaurus: synonyms, antonyms, and examples\nto look at someone or somethinglookLook over there! A rainbow!watchI sat by the window and watched people walking past.glanceShe glanced around the room to see who was there.peepShe peeped through the curtains to see what was happening.peekHe peeked inside the box.stareDon't stare at people like that - it's rude.\nSee more results »\nMore examplesFewer examplesThe nurse pulled a screen around the bed so that the doctor could examine the patient in private.We inject the rhinoceros with a powerful sedative, so that we can then examine it closely.He squatted down and examined the front wheel of his bike.Don't sign any contract before examining its conditions carefully.We started our research into local history by examining the town's origins.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nexamine verb [T]\n(TEST)\nC2 to test someone's knowledge or skill in a particular subject: We were examined on European history.UK You'll be examined in three main areas; speaking, listening, and reading comprehension.\nSMART Vocabulary: related words and phrases\nTesting, checking and experimenting\nartefact\nassay\nbackground check\ncalibrate\ncalibration\nexperimentally\nexperimentation\nexperimenter\nfactorial\nfeeler\ninoculate\nput something to the test idiom\nrecheck\nreinspect\nreinspection\nresample\nuncheckable\nuntestable\nuntested\nwelfare check\nSee more results »"}