{"id":146901,"name":"exceptional","type":"adjective","us_sound":"ɪkˈsep.ʃən.əl","us_link":"../audio/e/exceptional.mp3","uk_sound":"ɪkˈsep.ʃən.əl","uk_link":"../audio/e/ukexami026.mp3","content":"Add to word list\nAdd to word list\nB2 much greater than usual, especially in skill, intelligence, quality, etc.: an exceptional student exceptional powers of concentration The company has shown exceptional growth over the past two years. Synonyms\nespecial formal\nspecial (NOT USUAL)\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nMore examplesFewer examplesJudges only grant marriage annulments in exceptional circumstances.a woman of exceptional perspicacityAt £30 a night, this hotel represents exceptional value for money.The peninsula is a lightly populated area of natural beauty with exceptional wildlife.an outstanding garden of exceptional beauty\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\nhigh-class\npar excellence\nshining\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nRelated word\nexceptionally\nAdd to word list\nAdd to word list\nnot like most others of the same type; unusual: This is an exceptional contract, guaranteeing no layoffs.\nExceptional also means unusually good: Davis has done an exceptional job of reporting. exceptionally adverb us\nYour browser doesn't support HTML5 audio\n/ɪkˈsep·ʃə·nəl·i/\nThe drawing had exceptionally fine detail.\nAdd to word list\nAdd to word list\nunusual; not what happens regularly or is expected: The industry is anxious to stress that this is an exceptional case. These are exceptional circumstances.in exceptional circumstances/cases This right to sell the shares will apply only in exceptional cases. A £2.5m exceptional charge from redundancies contributed to full-year losses. exceptional costs\nmuch greater or better than usual: The effort put in by the team over the last five days has been exceptional. Her leadership style produced exceptional results. exceptionally adverb\nThe quality of our products is exceptionally high. an exceptionally competitive marketplace"}