{"id":146932,"name":"excess","type":"noun","us_sound":"ɪkˈses","us_link":"../audio/e/excess.mp3","uk_sound":"ɪkˈses","uk_link":"../audio/e/ukexami030.mp3","content":"excess noun\n(TOO MUCH)\nAdd to word list\nAdd to word list\nC1 [ S or U ] an amount that is more than acceptable, expected, or reasonable: excess of An excess of enthusiasm is not always a good thing.to excess They both eat to excess (= too much).in excess of There will be an increase in tax for those earning in excess of (= more than) twice the national average wage. excesses [ plural ]\nactions far past the limit of what is acceptable: For many years people were trying to escape the excesses (= cruel actions) of the junta.\nSee more\nMore examplesFewer examplesThe store has an excess of stock which it must sell off.An excess of water causes the plant's roots to rot.The new director says there is an excess of staff and that cuts must be made.The country has an excess of cheap labour.I'll give you two dozen bottles, but if there is any excess could I have it back after the party?\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhyper\nimmoderate\nimmoderately\ninappeasable\ninessential\noverdose\nplenty\npleonasm\npleonastic\nplethora\nproliferation\nunwarranted\nweigh someone/something down\nSee more results »\nexcess noun\n(INSURANCE)\n[ U ] UK (US deductible) a part of the cost of an accident, injury, etc. that you agree to pay yourself when you buy insurance: excess on She has an excess of £200 on her home insurance policy.\nSMART Vocabulary: related words and phrases\nInsurance\nactuarial\nactuary\nassessor\nbroking\nclaim\ncomprehensive\ncopay\nguarantee\nindemnify\nloss adjuster\nmature\nnon-network\nnoncoverage\nObamacare\npi\npolicy\npolicyholder\nprotect\nthird-party insurance\nunderwrite\nSee more results »\nC1 extra: Cut off any excess pastry and put it to one side. Synonyms\nredundant\nspare\nsuperfluous\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nfiller\nfor good measure idiom\nfor luck idiom\nhand\nrate\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nthrow something in\nSee more results »\nAdd to word list\nAdd to word list\nan amount that is more than acceptable, expected, or reasonable: They both eat to excess (= a lot more than they need). The company’s losses are in excess of (= more than) $5 million. excessive adjective us\nYour browser doesn't support HTML5 audio\n/ɪkˈses·ɪv/\nWe felt the charges were excessive.\nmore than is necessary; too much: excess baggage\nAdd to word list\nAdd to word list\n[ S or U ] an amount that is more than is needed, expected, or acceptable: If you retire having saved more than £1.4m you will face a one-off 33% tax charge on the excess. Any excess over these expenses represents profit attributable to shareholders.excess of sth There is still, in many industries, an excess of productive capacity.\n[ S ]\n&#160; INSURANCE\n&#160; UK (US deductible) a part of the cost of an accident, injury, etc. that you agree to pay yourself when you buy insurance: Cover would cost £239 a year with a £75 excess, or £215 a year with a £250 excess. excess on sth The policy carries a £40 excess on most claims.\nin excess of\nmore than: Last year he earned in excess of $3 million. The Fund will not borrow money in excess of one-third of the value of its net assets.\nmore than is needed, expected, or acceptable: Rents may be lower than ownership costs, meaning renters can invest the excess cash. The machine can generate electricity using excess heat that would otherwise be wasted."}