{"id":146922,"name":"excerpt","type":"noun","us_sound":"ˈek.sɝːpt","us_link":"../audio/e/excerpt.mp3","uk_sound":"ˈek.sɜːpt","uk_link":"../audio/e/ukexami028.mp3","content":"Add to word list\nAdd to word list\na short part taken from a speech, book, film, etc.: excerpt from An excerpt from her new thriller will appear in this weekend's magazine. Synonyms\nextract\npassage (PART)Compare\nselection\nMore examplesFewer examplesIn this excerpt from the film, Joe celebrates the fact that his son attends a prestigious college. The website posted a new interview with make-up artist Scott Taylor and here is an excerpt. Her latest novel is called \"The Air We Breathe\" and you can read an excerpt on our website.The following excerpt from a March 2018 article clearly illustrates his bias.The dance is set to excerpts from Bach's \"Goldberg Variations\".\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\ninscription\nintertextual\nintertextuality\nintertextually\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nversification\nSee more results »\nto take a small part from a speech, book, film, etc. in order to publish it separately: be excerpted from This passage has been excerpted from her latest novel.excerpt from Here I excerpt from a list of recommendations given to me by a former boss.\nMore examplesFewer examplesThis story is excerpted from the new book The Mind At Work. The article is excerpted from New Scientist magazine.Please remember that these texts have been excerpted and may lack context. I came across the following. I have excerpted it for brevity's sake.He claimed they spent too much time excerpting from left-wing periodicals and not enough on original research.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nscratch\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEditing & compiling\nAdd to word list\nAdd to word list\nwriting a short part taken from a speech, book, etc. excerpt verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ekˈsɜrpt, eɡˈzɜrpt/\nThis article is excerpted from the full report."}