{"id":146896,"name":"exception","type":"noun","us_sound":"ɪkˈsep.ʃən","us_link":"../audio/e/exception.mp3","uk_sound":"ɪkˈsep.ʃən","uk_link":"../audio/e/ukexami024.mp3","content":"Add to word list\nAdd to word list\nB2 someone or something that is not included in a rule, group, or list or that does not behave in the expected way: Men are usually quite good at map-reading but Tim is the exception.exception to There are exceptions to every rule.with the exception of I like all kinds of movies with the exception of (= but not) horror movies.no exception Her books are always entertaining and this one is no exception.without exception You must report here every Tuesday without exception. make an exception\nC1 to not treat someone or something according to the usual rules: We don't usually accept late applications, but in this case we will make an exception.\nSee more take exception to something/someone\nC2 to be offended or made angry by something or someone: Why did you take exception to what he said? He was only joking.\nSee more\nMore examplesFewer examplesI wouldn't normally agree but I'll make an exception in this case.People must observe the law. Nobody should be an exception.With the exception of Jonathan Edwards, Britain had no likely medal winners in track and field.The manager only bends the rules as an absolute exception.A man who stays at home to look after the children is an exception, even today.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nnon-uniform\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nvariant\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExceptional qualities, things and people\nIdiom\nthe exception that proves the rule\nAdd to word list\nAdd to word list\nsomething that is not included, or the action of not including something: [ C ] We don’t usually accept late applications, but since you were so sick I’ll make an exception (= do something different from what is usual). [ C ] Teen movies usually aren’t very good, but this one is an exception to the rule. [ U ] Every apple in the box, without exception, was rotten.\nAdd to word list\nAdd to word list\nsomeone or something that is not included in a rule, group, or list, or that does not behave in the expected way: Most of these states have moderate property taxes; Arizona's very high business property taxes are an exception. The condition covering cotton textiles was agreed as an exception to the general trade rules. Carriage is free on all orders with the exception of urgent deliveries. Businesses exist to make a profit, and banks are no exception.\nIT a problem or special condition that stops a computer program from processing information in the normal way: The system identifies the point in the program where the exception occurred.\nINSURANCE\n&#160; (also exclusion) a risk that is not included in an insurance policy: Medical insurance has more exceptions than most types of insurance.\nLAW, PROPERTY a condition in a property agreement that limits an owner's rights\nCOMMERCE a note on a bill of lading stating that goods that have been received to be sent somewhere are damaged or less than the correct quantity\nmake an exception\nto not treat something or someone according to the usual rules: Most countries that ban the use of mobile phones while driving make an exception for hands-free phones."}