{"id":146890,"name":"except","type":"preposition","us_sound":"ɪkˈsept","us_link":"../audio/e/except.mp3","uk_sound":"ɪkˈsept","uk_link":"../audio/e/ukexami022.mp3","content":"Add to word list\nAdd to word list\nA2 not including; but not: The museum is open daily except Monday(s). The government has few options except to keep interest rates high. It's cool and quiet everywhere except in the kitchen. There is nothing to indicate the building's past, except (for) the fireplace.\nMore examplesFewer examplesShe won't eat anything except chicken nuggets and chips.The proposed change in the law would make abortion illegal except for strictly defined medical reasons.She rarely ventured outside, except when she went to stock up on groceries at the corner shop.The soldiers slept at night, except for one who stayed awake to keep watch.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexcluding\nexclusion\nexclusionist\nexclusive\nexclusively\nexclusivity\nnegative\nostracism\nostracize\notherwise\nout of it idiom\noutlier\nstand-alone\nSee more results »\nGrammar\nApart from or except for?Apart from and except for are multi-word prepositions. Apart from can mean either ‘including’ or ‘excluding’: …\nExcept or except for?We often use except and except for as prepositions to mean ‘not including’ or ‘excluding’. They are followed by a noun or noun phrase or a wh-clause. Both except and except for are correct after a noun: …\nIdioms\nexcept for\nexcept that\nAdd to word list\nAdd to word list\nnot including; but not: It’s cool and quiet everywhere except (for) the kitchen. Everyone is here except Peter.\nExcept also means with this difference or in this case only: The twins look exactly alike except (that) one is slightly taller. The deserted town is silent, except when wind rustles the weeds or bangs a door.\nto not include something or someone: When I say I didn’t like the Midwest, I except Chicago. excepting preposition, conjunction us\nYour browser doesn't support HTML5 audio\n/ɪkˈsep·tɪŋ/\nExcepting the two people who left early, I think everyone enjoyed the tour.\nAdd to word list\nAdd to word list\nused to mean 'not including' or 'but not': Our offices are open Monday through Friday except on national holidays. All money transfers, except for those between members of the same branch, will now be charged a transaction fee.\nto not include someone or something: be excepted from sth Materials used in farming are excepted from sales and use tax.excepting sth Virtually all new restaurants in the region are smoke free, excepting those connected to a bar."}