{"id":146940,"name":"exchange","type":"noun","us_sound":"ɪksˈtʃeɪndʒ","us_link":"../audio/e/exchange.mp3","uk_sound":"ɪksˈtʃeɪndʒ","uk_link":"../audio/e/ukexces004.mp3","content":"exchange noun\n(GIVING AND GETTING)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the act of giving something to someone and them giving you something else: an exchange of ideas/informationin exchange for They were given food and shelter in exchange for work. She proposes an exchange of contracts at two o'clock. Several people were killed during the exchange of gunfire.\nMore examplesFewer examplesIn exchange for the hostages, the terrorists demanded safe-conduct out of the country.The virus is contracted through exchange of bodily fluids.I might offer them my old camera in part exchange for a new one.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nexchange noun\n(CONVERSATION)\n[ C ] a short conversation or argument: brief exchange There was a brief exchange between the two leaders.\nMore examplesFewer examplesWe had a friendly exchange of views .\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nunderstand\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArguments & disagreements\nexchange noun\n(VISIT)\nB1 [ C ] an arrangement in which students, artists, or other people from one country visit another country: Are you going on the French exchange this year? a German exchange student\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVisiting\nexchange noun\n(STOCK EXCHANGE)\n[ C usually singular ] a stock exchange\nB1 to give something to someone and receive something from that person: It's traditional for the two teams to exchange shirts after the game. Every month the group meets so its members can exchange their views/opinions (= have a discussion). We exchanged greetings before the meeting. We can exchange addresses when we see each other. Exchanging houses (= going to live in someone else's house while they live in yours) for a few weeks is a good way of having a holiday.\nto take something back to a shop where it was bought and get something else instead: If you don't like the gift, you can exchange it.exchange something for something I exchanged those trousers for a larger size.\nMore examplesFewer examplesDo you want to exchange this toaster for another (one) or do you want your money back?We always exchange hugs and kisses when we meet.A cheque that is not negotiable cannot be exchanged for cash and must be paid into a bank account.They briskly exchanged greetings before starting the session.He talked about the humiliation of exchanging his clothes for the prison uniform.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nRelated word\nexchangeableIdiom\nexchange words\nAdd to word list\nAdd to word list\nto change something for something else of a similar value or type: This shirt is too small – can I exchange it for one in a larger size? Before we left the meeting, she and I exchanged phone numbers (= I told her mine and she told me hers).\nthe act of giving something to someone and getting something else that is similar: [ C ] an exchange of ideas [ C ] an exchange of prisoners\nAdd to word list\nAdd to word list\n[ C ] a place or organization where shares, currencies, commodities, etc. are bought and sold: Exchanges in France and Germany rose by about 2%. As the demand for a stock rises and falls on the exchange, the price for the stock will fluctuate.\n[ U ]\n&#160; MONEY, FINANCE the process of changing one currency for another: We offer commission-free exchange at our UK ports.exchange of sth Deregulation prevented any barrier to the free exchange of currencies.\n[ C or U ] an occasion when you give or return something to someone and they give you something else: If an item is faulty you are guaranteed a refund or an exchange.exchange of sth You may request an exchange of any or all of your shares into another mutual fund in the group. information/knowledge exchange\n[ C ] an agreement in which two people or groups visit each other's home, place of work, or place of study for a short time in order to learn more about them: on an exchange There will be the opportunity to visit Germany on an exchange. an exchange programme/visit/scheme\n[ C or U ]\n&#160; COMMUNICATIONS an occasion when one person communicates with another, and the other person replies: There was an angry exchange at the meeting. The e-mail exchange between them was released to the court along with other documents.\nin exchange (for sth)\ngiven because of something that has been given to you: There's no doubt that stocks carry risk, and reward you with the chance of higher returns in exchange. The group sold half of its London casino business in exchange for shares.\nSee also\nB2B exchange\nBaltic Exchange\nbill of exchange\nChicago Board Options Exchange\ncommodity exchange\ncurrency exchange\ndirect exchange\nduplicate of exchange\nelectronic data exchange\nforeign exchange\nView all\nfutures exchange\nindirect exchange\ninformation exchange\nInternational Securities Exchange\nLondon Commodity Exchange\nLondon Metal Exchange\nLondon Stock Exchange\nmedium of exchange\nmercantile exchange\nthe New York Stock Exchange\noptions exchange\npart exchange noun\nprivate branch exchange\nregional stock exchange\nthe Securities and Exchange Commission\nsecurities exchange\nshare exchange offer\nSingle-Minute Exchange of Die\nstock exchange\ntelephone exchange\n[ T ] to give or return something to someone and receive something from them: They shook hands and exchanged business cards. If the goods are faulty you should be able to exchange them.exchange sth for sth Under these schemes, shareholdings can be exchanged for units in a unit trust.\n[ T ]\n&#160; FINANCE to change one currency into another: exchange sth for sth In this way we will save on the costs of exchanging euro for sterling and vice versa.exchange sth into sth Larger hotels will exchange dollars into local currency.\n[ T ]\n&#160; COMMUNICATIONS to communicate with someone who then replies: We exchanged a few words before the meeting began.exchange sth with sb Users can create pages with photos and personal information, and exchange e-mail with other users.\n[ I or T ]\n&#160; PROPERTY\n&#160; UK to sign a legal document with the person you are buying property from as the last part of the process of buying it: When you exchange, you must satisfy yourself that you are happy with the condition of the home you are moving into before you move. We hope to exchange contracts next week."}