{"id":146997,"name":"excited","type":"adjective","us_sound":"ɪkˈsaɪ.t̬ɪd","us_link":"../audio/e/excited.mp3","uk_sound":"ɪkˈsaɪ.tɪd","uk_link":"../audio/e/ukexces012.mp3","content":"excited adjective\n(PERSON)\nAdd to word list\nAdd to word list\nA1 feeling very happy and enthusiastic: An excited crowd waited for the singer to arrive.excited about Are you getting excited about your holiday?excited to He said he is excited to return to San Diego.excited that I was excited that he was coming to visit.excited at She's excited at the chance to share what she's learned with others.excited for informal \"Are you excited for your first Oscar nomination?\" she asked. Compare\nunexcitedSynonyms\nthrilled\nworked upRelated word\nexcitedly\nThesaurus: synonyms, antonyms, and examples\nfeeling happy and enthusiasticexcitedThe kids are really excited about going on holiday.thrilledWe were thrilled to hear our first grandchild had been born.pumpedUS The players were pumped that they were going to finals.jazzedUS She's totally jazzed that she gets to go on the cruise.exhilaratedI've never seen fans so exhilarated by a win.overexcitedThe kids were overexcited and starting to play up.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\neager to do or have somethingeagerShe was eager to help.excitedThe children were very excited to go to the zoo.avidHe took an avid interest in the project.enthusiasticHe was very enthusiastic about the idea of moving to Spain.be dying for/to doI'm dying for a glass of waterraring toI've bought all the paint and I'm raring to get started on the decorating.\nSee more results »\nbe nothing to get excited about\nto not be especially good: It's a competent enough first novel but nothing to get excited about.\nMore examplesFewer examplesNo wonder the children are excited, - this is the first time they've been abroad.They were really excited about the project, but now they seem to have lost interest in it now.I was quite excited at the idea of leaving home, but I was a bit frightened too.A group of excited teenagers climbed onto the train with all their luggage.The kids were so excited on Christmas Eve it was difficult for them to get to sleep.\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflame\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcitedly\nfevered\ngo ahead\nmood\nnuts\nomnivorous\nomnivorously\non the edge of your seat idiom\nzestful\nzestfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuite good, or not very good\nexcited adjective\n(PHYSICS)\nphysics\n&#160; specialized (of an atom, etc.) in a higher than normal state of energy: When an electron reverts from an excited to an unexcited state, it gives out light. Opposite\nunexcited\nMore examplesFewer examplesHe and his colleagues at Cambridge University did pioneering work on the speed with which excited atoms reacted with simple molecules such as hydrogen.In this paper he proposed that a photon of energy, or light, might be emitted by excited atoms.Energy is absorbed by atoms of the substance, which raises the electrons to an excited state. This radiation is the result of transitions from high-energy excited states to lower-energy states in atomic nuclei.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nerg\nfrictional\nfrictionless\nfundamental force\nG-force\ngeothermal\ninertia\nself-propulsion\nsine curve\nsinusoid\nsolarize\nspecific heat\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: atoms, molecules & sub-atomic particles"}