{"id":147066,"name":"exclusivity","type":"noun","us_sound":"ˌek.skluːˈsɪv.ə.t̬i","us_link":"../audio/e/usexcit003.mp3","uk_sound":"ˌek.skluːˈsɪv.ə.ti","uk_link":"../audio/e/ukexces026.mp3","content":"exclusivity noun [U]\n(ONLY FOR SOME)\nAdd to word list\nAdd to word list\nthe right to have or do something that is limited to only one person or organization: Newspapers buying a story will pay more for exclusivity. Sponsors selling their wares at the Olympic Games demanded exclusivity.\nthe quality of being available only to a small number of people who are rich enough or considered good enough: The exclusivity of the hotel is what attracts some people. These schools thrive on an image of exclusivity. Once defined by exclusiveness, luxury is now available to all.\nMore examplesFewer examplesPatent protection gives us exclusive rights to market the product, and without this period of exclusivity, we couldn't make back our investment and innovation would be stifled.The media company attempted to exercise exclusivity on some videos. The contract specifies the exclusiveness of the right.For her, the appeal of the resort is its exclusivity.The programme was made cool by its exclusivity - only 56 students were invited, and only the first 20 to sign up were accepted.He launched a fierce attack on the exclusiveness of top universities.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nlimit\nlimitation\nlimitative\nlimiting\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExcluding\nexclusivity noun [U]\n(NOT INCLUDING)\nmutual exclusivity\nthe quality in two things of both not being possible at the same time: Unfortunately, there is some mutual exclusivity between the desire for quick profit and our long-term strategy.\nSee more\nAdd to word list\nAdd to word list\nthe state of being the only person, group of people, or organization that is allowed to have or do something: grant/lose/retain exclusivity (on sth) The company which developed the hardware was granted one-year exclusivity on the retails sales. Astra's global market exclusivity on the drug ended last year. an exclusivity agreement/clause/deal\n(also exclusiveness, /ɪkˈskluːsɪvnəs/) the state of being expensive and of a high quality, and therefore only for people who are rich or of a high social class: If a product lowers its quality it will not retain its exclusivity as a luxury brand.\nan agreement not to speak to other possible buyers while your business is being bought by a particular person or company: The two companies have an agreed period of exclusivity which prevents either seeking alternative buyers before the end of January 2011."}