{"id":147060,"name":"exclusive","type":"adjective","us_sound":"ɪkˈskluː.sɪv","us_link":"../audio/e/exclusive.mp3","uk_sound":"ɪkˈskluː.sɪv","uk_link":"../audio/e/ukexces023.mp3","content":"exclusive adjective\n(ONLY FOR SOME)\nAdd to word list\nAdd to word list\nC1 limited to only one person or group of people: exclusive use This room is for the exclusive use of guests.exclusive interview He gave an exclusive interview to the Times from his home in California.\nB2 expensive and only for people who are rich or of a high social class: an exclusive private club an exclusive part of town\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nMore examplesFewer examplesFrom our website you can watch exclusive video clips and audio clips.Being rich and being a Socialist are not mutually exclusive.For the programme, we were allowed exclusive access to the judges' private world.The two channels are fighting for exclusive rights to cover the championship.There is a danger of being exclusive if you're not willing to be flexible about different styles of worship.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\naside\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexclude\nexcluding\nexclusion\nexclusionist\nexclusively\nnegative\non/from the sidelines idiom\nostracism\nostracize\notherwise\nout of it idiom\nstand-alone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpensive & luxurious\nexclusive adjective\n(NOT INCLUDING)\nexclusive of something\nC2 not including something: Is the total exclusive of service charges?\nSee more See also\nmutually exclusiveRelated word\nexclusivity\na story that is published in one magazine, website, etc., and no others: The newspaper published an exclusive about the escape. Synonym\nscoop\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony aunt\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\nleader\nmasthead\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\nsplash\nspread\nSee more results »\nAdd to word list\nAdd to word list\nlimited to only one person or group of people: The pool is for the exclusive use of residents of Springfield.\nA place that is exclusive provides goods and services for a limited number of people, esp. those who are wealthy: an exclusive club\nAdd to word list\nAdd to word list\nlimited to only one person, group of people, or organization: an exclusive agreement/contract/deal The licence provides the company with an exclusive 12-year agreement for gambling rights on the island.exclusive rights/an exclusive licence to do sth They have been given exclusive rights to distribute replicas of the ring. He seems to have exclusive access to the boss. Dedicate a computer, phone, and fax for your exclusive use.exclusive to sb/sth She was approached by the marketing director to create a line of shoes exclusive to the stores.\nexpensive and of a high quality, and therefore only for people who are rich or of a high social class: an exclusive area/hotel/shop The estate agent described the houses as \"an exclusive development of detached executive homes with views of the river\".\nrelating to something that is the only official one of its type: an exclusive distributor/provider/supplier The agreement makes GE the exclusive supplier on the new jet.\nexclusive of sth\nnot including something: The price is £315.00 exclusive of VAT.\nmutually exclusive\nnot possible at the same time: Ethics, values, and high performance are not mutually exclusive."}