{"id":147046,"name":"exclude","type":"verb","us_sound":"ɪkˈskluːd","us_link":"../audio/e/exclude.mp3","uk_sound":"ɪkˈskluːd","uk_link":"../audio/e/ukexces020.mp3","content":"Add to word list\nAdd to word list\nC1 to prevent someone or something from entering a place or taking part in an activity: be excluded from Women are still excluded from the club. Microbes must, as far as possible, be excluded from the room during an operation. Tom has been excluded from school (= he is not allowed to go to school) for bad behaviour. Compare\ninclude\nC1 to intentionally not include something: The price excludes local taxes. Compare\ninclude\nto decide that something is not true or possible: exclude the possibility We can't exclude the possibility that he is dead.\nMore examplesFewer examplesIt wasn't my intention to exclude her from the list - I just forgot her.Couples who are childless can feel excluded from the rest of society.The net weight of something excludes the weight of the material that it is packed in.At that time, women were excluded from the club.People who have to, or choose to, exclude certain foods from their diet must be particularly careful about eating healthy balanced meals.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexcluding\nexclusion\nexclusionist\nexclusive\nexclusively\nexclusivity\nnegative\nostracism\nostracize\notherwise\nout of it idiom\noutlier\nstand-alone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot going to school\nConcluding and deducing\nTrue, real, false, and unreal\nAdd to word list\nAdd to word list\nto keep out or omit (something or someone): The advertised price excludes the sales tax. exclusion noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈsklu·ʒən/\n[ U ] Her exclusion from the invitation list was a mistake.\nAdd to word list\nAdd to word list\nto intentionally not include something: Under the terms of the insurance policy, it is impossible to exclude liability for death or personal injuries caused by negligence. The figure is thought to exclude the cost of product development.exclude sb/sth from sth The insurance company may exclude a particular condition from cover or ask for a higher excess.\nto prevent someone or something from entering a place or taking part in an activity: Switching to cable TV would exclude 70% of RCTV's audience. A trade deal that excludes the emerging economies would exclude new opportunities for trade among developing countries."}