{"id":147033,"name":"exclamation","type":"noun","us_sound":"ˌek.skləˈmeɪ.ʃən","us_link":"../audio/e/exclamation.mp3","uk_sound":"ˌek.skləˈmeɪ.ʃən","uk_link":"../audio/e/ukexces019.mp3","content":"Add to word list\nAdd to word list\nsomething you say or shout suddenly because of surprise, fear, pleasure, etc.: an exclamation of delight\nMore examplesFewer examplesWe all jumped up from our seats, with exclamations of surprise.The man gave an exclamation and clasped both hands to his chest.We heard exclamations of rage and frustration coming from the other room as he struggled to fix the problem.In Enid Blyton books, the children are always uttering excited exclamations, especially about food!With an exclamation of disgust, she drew back and covered her face.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nraise\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\nGrammar\nClause typesThere are four basic types of main clause: declaratives (statements), interrogatives (questions), imperatives (orders/instructions) and exclamatives (used for exclamations). …\nDeclarative clausesDeclarative clauses most commonly function as statements. The usual word order is subject (s) + verb (v) + x. Declaratives can be affirmative or negative. They make statements about how things are and how they are not. …\nInterrogative clausesInterrogative clauses most commonly function as questions. The usual word order is (wh-word) + auxiliary/modal verb (aux/m) + subject + verb + x: …\nImperative clausesImperative clauses most commonly function as commands, instructions or orders. The usual word order is verb + x. We do not usually include the subject in an imperative clause. We use the base form of the verb: …\nExclamative clausesExclamative clauses usually have one of the following word orders: …\nExclamationsWe use exclamations to express surprise or shock or a strong emotion about something. The type of phrase or clause associated with exclamations is called exclamative. …\nWhat …!We can use what + noun phrase ((+ verb) (+ tag)): …\nHow …!We often use how followed by an adjective only: …\nExclamatives with interrogative formWe sometimes make an exclamation using interrogative (question) word order: …\nAdd to word list\nAdd to word list\ngrammar a word that expresses sudden pain, surprise, anger, excitement, happiness, or other emotion: \"Ouch,\" \"hey,\" and \"wow\" are exclamations.\na sudden expression of pleasure, surprise, agreement, etc.: exclamations of delight"}