{"id":147207,"name":"excused","type":"verb","us_sound":"ɪkˈskjuːz","us_link":"../audio/e/excuse_01_00.mp3","uk_sound":"ɪkˈskjuːz","uk_link":"../audio/e/ukexcre012.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nexcuse\nB1 to forgive someone: Please excuse me for arriving late - the bus was delayed. Nothing can excuse that sort of behaviour. No amount of financial recompense can excuse the way in which the company carried out its policy. We cannot excuse him for these crimes. I asked the teacher if I could be excused from (= allowed not to do) hockey practice as my knee still hurt. Please excuse me from (= allow me to miss) the rest of the meeting - I've just received a phone call that requires my immediate attention. excuse me\nA1 a polite way of attracting someone's attention, especially of someone you do not know: Excuse me, does this bus go to Oxford Street?\nused to politely ask someone to move so that you can walk past them: Excuse me, can I just get past?\nused to tell someone politely that you are leaving: Excuse me a moment, I'll be with you shortly.\nA2 used to say sorry for something you have done by accident: Did I take your seat? Do excuse me.\nsaid before disagreeing with someone: Excuse me but aren't you forgetting something?\nUS (UK pardon?); (I beg your pardon?) used to politely ask someone to repeat something they have said because you have not heard it\nMore examplesFewer examplesWill you excuse me? I've got to make a phone call.Please excuse my stomach rumbling - I haven't eaten all day.I know you are tired, but I really can't excuse you for being so rude and selfish about this.She is almost too kind - always excusing their bad behaviour instead of dealing with it firmly.Her boss cannot excuse even the smallest error, although he himself is far from perfect.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbeg\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions"}