{"id":147206,"name":"excuse","type":"verb","us_sound":"ɪkˈskjuːz","us_link":"../audio/e/excuse_01_00.mp3","uk_sound":"ɪkˈskjuːz","uk_link":"../audio/e/ukexcre012.mp3","content":"Add to word list\nAdd to word list\nB1 to forgive someone or something: excuse someone for something Please excuse me for arriving late - the bus was delayed. Nothing can excuse that sort of behaviour. No amount of financial recompense can excuse the way in which the company carried out its policy. We cannot excuse him for these crimes.\nto allow someone not to do or attend something when they normally would have to: be excused from I asked the teacher if I could be excused from hockey practice as my knee still hurt.excuse someone from something Please excuse me from the rest of the meeting - I've just received a phone call that requires my immediate attention. You are excused—you may go. excuse me\nA1 a polite way of attracting someone's attention, especially someone you do not know: Excuse me, does this bus go to Oxford Street?\nused to politely ask someone to move so that you can walk past them: Excuse me, can I just get past?\nused to tell someone politely that you are leaving: Excuse me a moment, I'll be with you shortly.\nA2 used to say sorry for something you have done by accident: Did I take your seat? Do excuse me.\nsaid before disagreeing with someone: Excuse me, but aren't you forgetting something?\nUS (UK pardon?); (I beg your pardon?) used to politely ask someone to repeat something they have said because you have not heard it: Excuse me, I didn't quite hear what you said.\nSee more\nMore examplesFewer examplesPlease excuse my stomach rumbling - I haven't eaten all day.I know you are tired, but I really can't excuse you for being so rude and selfish about this.She is almost too kind - always excusing their bad behaviour instead of dealing with it firmly.Her boss cannot excuse even the smallest error, although he himself is far from perfect.Will you excuse me? I've got to make a phone call.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbeg\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAllowing and permitting\nB1 a reason that you give to explain why you did something wrong: good excuse for He'd better have a good excuse for being late.have an excuse I've never known him to miss a meeting - I'm sure he'll have an excuse.no excuse for There's no excuse for that sort of behaviour.\nThesaurus: synonyms, antonyms, and examples\nthe cause of somethingreasonI frankly don’t understand the reason for the delay.causeInvestigators have not yet determined the cause of the fire. rootWe need to get to the root of her problems.motiveThere seems to have been no motive for the murder.ground(s)On what grounds was she dismissed?\nSee more results »\nB1 a false reason that you give to explain why you do something: [ + to infinitive ] She was just looking for an excuse to call him.excuse for Any excuse for a holiday! make your excuses UK\nto explain why you cannot be present somewhere: Please make my excuses at the meeting on Friday.\nSee more make excuses\nto give false reasons why you cannot do something: You're always making excuses for not helping me.\nSee more\nMore examplesFewer examplesWhen I asked him why he was late, he gave me some excuse about having car trouble.I made up an excuse about having to look after the kids.I don't want to go tonight but I can't think up a good excuse.Whenever I ask him why his essay's late, he just comes out with the same old excuses.You're always making excuses for not helping me.\nSMART Vocabulary: related words and phrases\nReasons and explanations\nalibi\nargumentation\nascribe something to something\nascription\nascriptive\ncase\ndefinition\nexplanation\nexplication\nexposition\nextenuating\nextenuation\nflack\nkey\nreason\ntalk\nunclarified\nwarrantable\nwarrantably\nwherefores\nSee more results »\nIdiom\na miserable, poor, etc. excuse for something\nexcuse verb [T]\n(FORGIVE)\nAdd to word list\nAdd to word list\nto forgive someone: Please excuse me for being so late – there was a lot of traffic. It was hard to excuse him for treating me so badly. excuse someone from\nTo excuse someone from an activity is to give that person permission to stop doing it or not do it: I was excused from jury duty because I had to take care of my sick mother. excusable adjective us\nYour browser doesn't support HTML5 audio\n/ɪkˈskju·zə·bəl/\nConsidering her difficult childhood, her behavior is excusable. Idiom\nexcuse me\nthe explanation given for bad behavior, absence, etc.: You’re always making excuses for not helping with the housework.\nAdd to word list\nAdd to word list\na letter from a doctor saying that someone is too ill to go to work"}