{"id":147254,"name":"execution","type":"noun","us_sound":"ˌek.səˈkjuː.ʃən","us_link":"../audio/e/eus71697.mp3","uk_sound":"ˌek.sɪˈkjuː.ʃən","uk_link":"../audio/e/ukexcre018.mp3","content":"execution noun\n(KILLING)\nAdd to word list\nAdd to word list\n[ C or U ] the legal punishment of killing someone: Execution is still the penalty in some states for murder. The executions will be carried out by a firing squad.\nMore examplesFewer examplesMany people believe that execution has no place in the penal system of a civilized society.Henry VIII ordered the execution of two of his wives, Anne Boleyn and Catherine Howard.The convicted double murderer is facing execution in the morning.The soldiers were arrested in connection with the alleged illegal execution of prisoners during the war.Hanging was the usual form of execution practised in Britain.\nSMART Vocabulary: related words and phrases\nDeath penalties\nbehead\nboots on the ground idiom\nburn\ncapital punishment\nchair\ncondemn\ncondemn someone to (do) something\ncrucify\ndeath sentence\ndeath warrant\ndecapitate\ndecapitation\nfiring squad\ngibbet\nguillotine\nhang\nhanging\nhangman\nstake\nthe electric chair\nSee more results »\nexecution noun\n(ACTION)\n[ U ] the act of doing or performing something, especially in a planned way: in the execution of Sometimes in the execution of their duty the police have to use firearms. Although the original idea was good, its execution has been disappointing.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexploit\nfait accompli\nmove\nresponsibility\nrole-play\nrot\nstep\nstep up\nstuff\ntalk\nSee more results »\nexecution noun\n(DOING SOMETHING)\nAdd to word list\nAdd to word list\n[ U ] the act of doing or performing something in a planned way: The guitarist’s execution of the ballad was superb.\nexecution noun\n(PUNISHMENT)\n[ C/U ] the act of killing someone as a legal punishment: [ U ] Execution is still a penalty for murder.\nAdd to word list\nAdd to word list\nthe act of doing or performing something in a planned way: Effective operations managers require advanced skills in design, planning, and execution.the execution of sth The landlord may exclude the tenant from occupation, but only for a reasonable time, and only if to do so is essential for the execution of the work. the execution of an agreement/strategy/contract the execution of a deed/policy/willin execution The concept of the new Arts Centre was impressive, but it fell short in execution. See also\nwrit of execution\nSTOCK MARKET the act of buying or selling shares, etc.: The quality of market systems is measured by the competitiveness of their pricing, the speed of execution and investor confidence in the integrity and fairness of the process. When circumstances indicate that a particular broker is in a position to obtain the best price and execution, the order is placed with that broker.\nthe act of being successful with your business plans: We are looking for someone who is good at planning and capable of successful execution."}