{"id":147248,"name":"execute","type":"verb","us_sound":"ˈek.sə.kjuːt","us_link":"../audio/e/eus75721.mp3","uk_sound":"ˈek.sɪ.kjuːt","uk_link":"../audio/e/ukexcre017.mp3","content":"execute verb [T]\n(KILL)\nAdd to word list\nAdd to word list\nC2 to kill someone as a legal punishment: He was executed for murder.\nMore examplesFewer examplesShe was condemned to death and executed two weeks later.A convicted murderer was executed in North Carolina yesterday.Guy Fawkes was executed for treason after he took part in a plot to blow up the British Parliament building.Anyone caught trying to escape from the prison camp would be executed on the spot.A firing squad was ordered to take the prisoners to a nearby clearing and execute them.\nSMART Vocabulary: related words and phrases\nDeath penalties\nbehead\nboots on the ground idiom\nburn\ncapital punishment\nchair\ncondemn\ncondemn someone to (do) something\ncrucify\ndeath sentence\ndeath warrant\ndecapitate\ndecapitation\nfiring squad\ngibbet\nguillotine\nhang\nhanging\nhangman\nstake\nthe electric chair\nSee more results »\nexecute verb [T]\n(DO)\nC2 formal to do or perform something, especially in a planned way: to execute a deal/plan The whole play was executed with great precision. execute a will law\n&#160; specialized\nIf you execute someone's will, you deal with that person's money, property, etc., according to the instructions in it: Your family lawyer can advise you regarding who might be best to execute your will.\nSee more\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngo places idiom\ngrade\nkill\nrise\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nsomewhere\nstand out\nSee more results »\nexecute verb [T]\n(DO)\nAdd to word list\nAdd to word list\nto do or perform something planned: Now that we have approval, we can go ahead and execute the plan.\nexecute verb [T]\n(KILL)\nto kill someone as a legal punishment\nAdd to word list\nAdd to word list\n[ T ] to do or perform something in a planned way: Local authority officials will check that the work is being executed according to the plans submitted. execute an agreement/a plan/a contract\n[ T ]\n&#160; IT to make a computer program or instruction work: execute a command/program The software translates programs from language a human can read and understand to language a computer can execute.\n[ I ] to be successful with your business plans: The company knows the local market and has a great ability to execute.\nexecute a trade\nSTOCK MARKET to buy or sell shares, etc.: The bond trader who is believed to have executed the trade refused to comment on the transaction.\nexecute a will\nLAW to deal with a dead person's money, property, etc. according to the instructions in their will Phrasal verb\nexecute on sth"}