{"id":147262,"name":"executive","type":"noun","us_sound":"ɪɡˈzek.jə.t̬ɪv","us_link":"../audio/e/eus71698.mp3","uk_sound":"ɪɡˈzek.jə.tɪv","uk_link":"../audio/e/ukexcre020.mp3","content":"Add to word list\nAdd to word list\nC1 (informal exec, uk/ɪɡˈzek/ us/ɪɡˈzek/) someone in a high position, especially in business, who makes decisions and puts them into action: senior executive She is now a senior executive, having worked her way up through the company. the executive\nthe part of a government that is responsible for making certain that laws and decisions are put into action\na group of people who run a business or an organization: The executive of the health workers' union accepted the proposed pay increase on behalf of their members.\nMore examplesFewer examplesThe sales executive from Unilever is here to see you.Police are investigating allegations of corruption involving senior executives.A group of business executives and local politicians met the Italian trade minister to discuss the issue.Our training courses are designed to suit the needs of busy executives.In 1983 Rory was a bright young executive with a promising career ahead of him.\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nlayer\nline manager\nmajordomo\nsilent partner\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: government departments & organizations\nUK politics: legislation & law-making\nTypes of employment\nC1 relating to making decisions and managing businesses, or suitable for people with important jobs in business: His executive skills will be very useful to the company. executive cars an executive suite\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nlayer\nline manager\nmajordomo\nsilent partner\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpensive & luxurious\nAdd to word list\nAdd to word list\nsomeone in a high position, esp. in business, who makes decisions and acts according to them: [ C ] a chief executive\nUS history The executive branch of the US government, including the president, the cabinet, and several departments, manages the duties of government and its laws. executive adjective us\nYour browser doesn't support HTML5 audio\n/ɪɡˈzek·jə·t̬ɪv/\nIn the US, the president is the head of the executive branch of government.\nAdd to word list\nAdd to word list\nMANAGEMENT\n&#160; ( informal exec) someone who has an important position in business, making decisions and putting them into action: World Economic Forum is an annual meeting in Switzerland at which political leaders and business executives discuss economic issues. a high-ranking/senior/top executive an advertising/marketing/oil executive company/corporate/industry executives a financial/sales executive\na group of people who run an organization: The executive of the health workers' union accepted the proposed pay increase on behalf of their members.\nthe executive\nGOVERNMENT the part of a government that is responsible for making certain that laws and decisions are put into action, rather than making laws: Checks and balances are provided by the separation of powers between the judiciary, the executive and the legislature. Compare\nlegislature\nSee also\naccount executive\nchief executive\nthe Health and Safety Executive\nlegal executive\nnational executive\nrelating to making decisions and managing businesses or government: executive decision/duty An executive decision was made to move to another site. The organizational pyramid had executive management at the top and supervisors and employees at the bottom.\nhaving or relating to the power to take action on decisions: executive authority/leadership/power Reshaping the culture of the corporation around the needs of the entire enterprise requires executive leadership. The IMF is fully accountable to its membership, through the 24-member executive board. Compare\nnon-executive\nrelating to executives (= important people in a company who make decisions): an executive appointment/job/position executive bonuses/pay/salary They appointed a relocation officer at executive level. The interview board considered that the candidate was definitely executive material.\nsuitable for people with important jobs in business: an executive jet He had a drink in the airport executive lounge before boarding his flight. He worked in the executive suite at Northwest Airlines.\nexpensive and of a high quality: an executive car/flat/home"}