{"id":147319,"name":"exempt","type":"verb","us_sound":"ɪɡˈzempt","us_link":"../audio/e/exempt.mp3","uk_sound":"ɪɡˈzempt","uk_link":"../audio/e/ukexcre027.mp3","content":"Add to word list\nAdd to word list\nto excuse someone or something from a duty, payment, etc.: be exempted from Small businesses have been exempted from the tax increase.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfiscal year\nflat tax\ngas tax\nHMRC\nincome tax\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiberating, relaxing and releasing\nRelated word\nexemption\nwith special permission not to do or pay something: exempt from Goods exempt from this tax include books and children's clothes. Pregnant women are exempt from dental charges under the current health system. Opposite\ntaxable\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfiscal year\nflat tax\ngas tax\nHMRC\nincome tax\nregressively\nroad tax\nsales tax\nself-assessment\nshelter\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nAdd to word list\nAdd to word list\nnot having to obey a rule or to do something that is usually necessary: Nonprofit organizations are exempt from taxes. exempt verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ɪɡˈzemt/\nThe governor plans to exempt small businesses from the tax increase.\nAdd to word list\nAdd to word list\nwith special permission not to do or pay something: be exempt from sth Who is exempt from overtime?be exempt from doing sth Lawyers would be exempt from reporting information learned through confidential communication with clients. Tax-exempt organizations must stay true to the reasons they were granted exempt status. See also\nnon-exempt\ntax-exempt\nto allow someone not to do something, pay something, etc. that others have to do or pay: exempt sb from sth Some degree courses exempt you from certain professional exams.exempt sb from doing sth Local drivers are exempted from paying the tolls."}