{"id":147347,"name":"exercise","type":"noun","us_sound":"ˈek.sɚ.saɪz","us_link":"../audio/e/eus71699.mp3","uk_sound":"ˈek.sə.saɪz","uk_link":"../audio/e/ukexcre029.mp3","content":"exercise noun\n(HEALTHY ACTIVITY)\nAdd to word list\nAdd to word list\nA2 [ C or U ] physical activity that you do to make your body strong and healthy: form of exercise Swimming is my favourite form of exercise.take exercise You really should take more exercise.do exercise I do stomach exercises most days.\nMore examplesFewer examplesRegular exercise reduces the risk of coronary heart disease.This exercise is designed to develop the shoulder and back muscles.Eat healthily and take plenty of exercise.I haven't done much exercise all week, so I think I'll go for a jog this morning.A good diet and plenty of exercise will help you to keep your body healthy.\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\ncross-trainer\ncurl\njerk\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nPilates\nSpinning\nsquat thrust\nstability ball\nstar jump\nsuperheavyweight\nSwiss ball\nSee more results »\nexercise noun\n(PRACTICE)\nC2 [ C ] an action or actions intended to improve something or make something happen: Ships from eight navies will be taking part in an exercise in the Pacific to improve their efficiency in combat. It would be a useful exercise for you to say the speech aloud several times.exercise in an exercise in public relations\nA2 [ C ] a short piece of written work that you do to practise something you are learning: The book has exercises at the end of every chapter.\nMore examplesFewer examplesThese mental exercises are designed to encourage creative thinking.The cost of this exercise is proving a major hurdle.Today we're going to work on an exercise that aims to improve your interpersonal skills.One official dismissed the ceasefire as a mere propaganda exercise.Environmentalists attacked the company's ad as a public-relations exercise.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nactivity\nADL\nagency\nant\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExams, tests & exercises\nexercise noun\n(USE)\n[ U ] formal the use of something: exercise of The exercise of restraint may well be difficult.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nexercise noun\n(CEREMONY)\nexercises [ plural ] US formal\na ceremony that includes speeches and usually traditional music or activities: graduation exercises\nSee more\nexercise verb\n(DO HEALTHY ACTIVITY)\nB1 [ I or T ] to do physical activities to make your body strong and healthy: She exercises most evenings usually by running. A work-out in the gym will exercise all the major muscle groups.\n[ T ] If you exercise an animal, you make it walk or run so that it stays strong and healthy: Now he's retired he spends most afternoons exercising his dogs.\nMore examplesFewer examplesEat healthily and exercise regularly.Aerobics is one of the most stimulating ways of exercising.He would never exercise - he was terribly lazy.If I have to exercise, I'd prefer walking or cycling to organized sport.I try and keep in good shape by exercising every day.\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\ncross-trainer\ncurl\njerk\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nPilates\nSpinning\nsquat thrust\nstability ball\nstar jump\nsuperheavyweight\nSwiss ball\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWalking and walkers\nexercise verb\n(USE)\nC2 [ T ] formal to use something: exercise a right I exercised my democratic right by not voting in the election.exercise caution Always exercise caution when handling radioactive substances.exercise an option We've decided to exercise the option (= use the part of a legal agreement) to buy the house we now lease.\nMore examplesFewer examplesWe need to exercise some control on this situation before we find ourselves in serious trouble.The security forces exercised great restraint by not responding to hostile attacks and threats.The United Nations has exercised its authority to restore peace in the area.Politicians these days seem less interested in exercising real influence on world events.This piece of equipment doesn't exercise the shoulder and back muscles much.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nIdiom\nexercise someone's mind\nexercise noun\n(HEALTHY ACTIVITY)\nAdd to word list\nAdd to word list\n[ C/U ] (a) physical action performed to make or keep your body healthy: [ U ] You should get some exercise even when you’re pregnant. [ C ] I do five different exercises every morning to limber up.\nexercise noun\n(PRACTICE)\n[ C ] an action or actions intended to improve something or make something happen: The military exercises will involve several thousand soldiers. The whole thing was an exercise in futility (= actions that were useless).\n[ C ] An exercise can be written work that you do to practice something you are learning: The book has exercises at the end of every chapter.\nexercise noun\n(USE)\n[ U ] the use of something: The exercise of restraint in this situation may be difficult.\nexercise verb\n(DO HEALTHY ACTIVITY)\n[ I/T ] to do physical activities to make or keep your body healthy: [ I ] She goes to the gym to exercise every evening.\nexercise verb\n(USE)\n[ T ] fml to use something: Always exercise caution when handling poisonous substances.\nAdd to word list\nAdd to word list\n[ I or T ] to do physical activities to make your body strong and healthy: This product is aimed at people who exercise on a regular basis.\n[ T ] to use something such as a right or choice: exercise a right/power/choice The landlord may exercise his right to review the rent. exercise power/control/influence (over sth)\nexercise an option\nFINANCE to buy or sell the shares, etc. that are mentioned in an options contract (= an agreement giving the right to buy and sell shares in the future): Anyone who exercised such an option would immediately lose money.\n[ C or U ] physical activity that you do to make your body strong and healthy: do/take exercise The office has a gym for those who like to do exercise in their lunch hour. There are many types of equipment out there in the exercise market. exercise equipment/machines\n[ C ] an action or actions intended to improve something or make something happen: 10,000 scientists and businessmen took part in an exercise to identify technology trends. The outing was arranged by the firm as part of a team-building exercise. a cost-cutting exercise a brainstorming exercise\n[ U ] formal the use of something such as a right, choice, or power: The document sets out guidelines on the exercise of voting rights.\n[ U ] formal the act of doing a particular job: Many journalists have lost their lives in the exercise of their profession.\nthe exercise of an option\nFINANCE the act of buying or selling the shares, etc. that are mentioned in an options contract (= an agreement giving the right to buy and sell shares in the future): Shares will be transferred within 28 days of the exercise of an option."}