{"id":147348,"name":"exercised","type":"verb","us_sound":"ˈek.sɚ.saɪz","us_link":"../audio/e/eus71699.mp3","uk_sound":"ˈek.sə.saɪz","uk_link":"../audio/e/ukexcre029.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nexercise\nexercise verb\n(DO HEALTHY ACTIVITY)\nB1 [ I or T ] to do physical activities to make your body strong and healthy: She exercises most evenings usually by running. A work-out in the gym will exercise all the major muscle groups.\n[ T ] If you exercise an animal, you make it walk or run so that it stays strong and healthy: Now he's retired he spends most afternoons exercising his dogs.\nMore examplesFewer examplesEat healthily and exercise regularly.Aerobics is one of the most stimulating ways of exercising.He would never exercise - he was terribly lazy.If I have to exercise, I'd prefer walking or cycling to organized sport.I try and keep in good shape by exercising every day.\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\nbench\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nloosen\nresistance training\nSpinning\nstar jump\nsuperheavyweight\nsweat\nSwiss ball\ntai chi\ntaper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWalking and walkers\nexercise verb\n(USE)\nC2 [ T ] formal to use something: I exercised my democratic right by not voting in the election. Always exercise caution when handling radioactive substances. We've decided to exercise the option (= use the part of a legal agreement) to buy the house we now lease.\nMore examplesFewer examplesWe need to exercise some control on this situation before we find ourselves in serious trouble.The security forces exercised great restraint by not responding to hostile attacks and threats.The United Nations has exercised its authority to restore peace in the area.Politicians these days seem less interested in exercising real influence on world events.This piece of equipment doesn't exercise the shoulder and back muscles much.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nIdiom\nexercise someone's mind"}