{"id":147431,"name":"exhibit","type":"verb","us_sound":"ɪɡˈzɪb.ɪt","us_link":"../audio/e/exhibit.mp3","uk_sound":"ɪɡˈzɪb.ɪt","uk_link":"../audio/e/ukexert016.mp3","content":"Add to word list\nAdd to word list\nC1 to show something publicly: He frequently exhibits at the art gallery. In the summer the academy will exhibit several prints that are rarely seen. He exhibited great self-control considering her rudeness. Synonym\nshow (MAKE SEEN)Compare\ndemo verb informal\nMore examplesFewer examplesMost zoos try to exhibit animals in naturalistic settings.The crown, decorated with diamonds and other precious stones, was exhibited in a special case.The new wing of the museum had to be large enough to exhibit several huge dinosaur skeletons.We have exhibited many of his works at our gallery in recent years.One member of our pottery class is now exhibiting and selling her ceramics very successfully.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExhibiting and exhibitions\nC1 an object that is shown to the public in a museum, etc.: The museum has a fascinating collection of exhibits ranging from Iron Age pottery to Inuit clothing.\nC1 US (UK exhibition) a collection of objects that is shown to the public in a museum, etc.: Let's go see the new dinosaur exhibit.\nlaw\n&#160; specialized a thing used as evidence (= proof that something is true) in a trial: Is exhibit C the weapon that you say was used?\nSMART Vocabulary: related words and phrases\nExhibiting and exhibitions\nco-curate\nco-curator\ncurate\ncuration\nexhibition\nexhibitor\nexpo\nexposition\nfashion show\nopen day\nopen house\npremiere\npreview\nretrospective\nshow\nshowcase\nshowing\nunmounted\nviewing\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nexhibit verb\n(SHOW AN OBJECT)\nAdd to word list\nAdd to word list\n[ I/T ] to show something in public for competition, sale, or amusement: [ T ] The gallery is exhibiting his paintings and watercolors.\nexhibit verb\n(SHOW A QUALITY)\n[ T ] to show something, esp. a quality, by your behavior: He exhibited poor judgment.\nexhibit noun [C]\n(OBJECT SHOWN)\nan object or a collection of things shown publicly for people to enjoy or learn about: The museum’s exhibits range from Iron Age pottery to Eskimo clothing.\nlaw An exhibit is an item used as evidence (= proof) in a trial.\nAdd to word list\nAdd to word list\n[ I or T ] to show something publicly in a place such as museum or trade show: She has exhibited her art all over the world.exhibit at/in sth The £20,000 prize helped him to exhibit at the Paris Fashion Show.\n[ T ] formal if someone or something exhibits a quality, they show that they have that quality: Did he exhibit any leadership talents?\nan object that is shown to the public in a place such as a museum or trade show: art exhibits\nLAW an object, photograph, etc. that is shown in a court because it gives information about a crime"}