{"id":147512,"name":"exile","type":"noun","us_sound":"ˈek.saɪl","us_link":"../audio/e/eus71701.mp3","uk_sound":"ˈek.saɪl","uk_link":"../audio/e/ukexert030.mp3","content":"Add to word list\nAdd to word list\nC2 [ U ] the condition of someone being sent or kept away from their own country, village, etc., especially for political reasons: go into exile The king went into exile because of the political situation in his country.in exile The deposed leaders are currently in exile in the neighbouring country.\n[ C ] a person who is sent or kept away from their own country, etc. See also\ntax exile\nMore examplesFewer examplesHer popularity has declined since her triumphal return from exile two years ago.The opposition leader returned to a hero's welcome after seven years in exile.After the military coup, the family left for self-imposed exile in America.During the war, they had to leave their homes and go into exile.Anyone who disagreed with the powerful ruling family, the Medici, would be forced to go into exile.\nSMART Vocabulary: related words and phrases\nPunishing someone by sending them somewhere else\nbanish\nbanishment\ndeport\ndeportable\ndeportation\ndeportee\nexiled\nexpatriate\nexpel\nexpulsion\nextraordinary rendition\nrid\nrusticate\nrustication\nsend\nsend someone down\nsend something off\nshun\ntransport\nYou can also find related words, phrases, and synonyms in the topics:\nEvicting and forcing to leave\nto send someone away from their own country, village, etc., especially for political reasons: The monarch was exiled because of the coup. Compare\ndeport\nexpatriate verb formal\nSMART Vocabulary: related words and phrases\nPunishing someone by sending them somewhere else\nbanish\nbanishment\ndeport\ndeportable\ndeportation\ndeportee\nexiled\nexpatriate\nexpel\nexpulsion\nextraordinary rendition\nrid\nrusticate\nrustication\nsend\nsend someone down\nsend something off\nshun\ntransport\nRelated word\nexiled\nAdd to word list\nAdd to word list\nto send or keep someone away from his or her own country or home, esp. for political reasons\nthe condition being exiled, or a person who is exiled: [ C ] Many Cuban exiles live in Florida."}