{"id":147537,"name":"exist","type":"verb","us_sound":"ɪɡˈzɪst","us_link":"../audio/e/exist.mp3","uk_sound":"ɪɡˈzɪst","uk_link":"../audio/e/ukexist001.mp3","content":"exist verb [I]\n(BE)\nAdd to word list\nAdd to word list\nB1 to be, or to be real: I don't think ghosts exist. Poverty still exists in this country.\nMore examplesFewer examplesIt's in the poorer, underdeveloped eastern region of the country that the biggest problems exist.The English king, Arthur, is a somewhat shadowy figure who may not have even existed.Slavery still exists in many parts of the world.Laws exist to stop companies exploiting their employees.A special closeness is supposed to exist between twins.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\ncome\nextant\nfound\nhave legs idiom\nhood\nindissolubility\nlie in\nliving\nrun\nthey're\nthing\nthingness\nviability\nwe're\nwho're\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLife and living\nexist verb [I]\n(LIVE)\nC1 to live, or to live in difficult conditions: Some species exist in this small area of forest and nowhere else on earth. Few people can exist without water for more than a week.exist on No one can be expected to exist on such a low salary.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\ncome\nextant\nfound\nhave legs idiom\nhood\nindissolubility\nlie in\nliving\nrun\nthey're\nthing\nthingness\nviability\nwe're\nwho're\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiving or sleeping somewhere\nLife and living\nexist verb [I]\n(TO BE)\nAdd to word list\nAdd to word list\nto be; have the ability to be known, recognized, or understood: Can the mind exist independently of the body? Programs like Medicaid for the poor did not exist at that time.\nexist verb [I]\n(BE PRESENT)\nto be present or be a condition: Your local agency can tell you if a similar program exists in your community.\nexist verb [I]\n(LIVE)\nto be able to live: No one can be expected to exist on such a low salary."}