{"id":147565,"name":"exited","type":"verb","us_sound":"ˈek.sɪt","us_link":"../audio/e/exit.mp3","uk_sound":"ˈek.sɪt","uk_link":"../audio/e/ukexist008.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nexit\nexit verb [I or T]\n(LEAVE)\nto leave a place such as a building, room, or large vehicle: I exited quickly before anyone could see me. Please exit the theatre by the side doors.\nto leave a theatre stage: The character exits stage right. The singer took a bow before exiting the stage.\nto leave a large road and turn onto a smaller road: Detectives were following the car as it exited Route 3. Exit at junction 29.\nto leave something such as a job, an organization, a competition, or a television show: The former CEO exited the company amid growing criticism. They would be the ones exiting early from the tournament.\nMore examplesFewer examplesHe felt like a winner as he exited the debate hall.As the blast exited the exhaust tube, a wave of low pressure rippled back toward the chamber.A small number of the respondents had retired or exited farming.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ndrive\np.o.q.\npiss off\npull\npull out\npull something off\npush along\npush off\nsea\ntrack\nvamoose\nwalk\nwalk off (somewhere)\nwalk out\nwithout (so much as) a backward glance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: parts of plays, shows & films\nRoads & routes in general\nOrganizations - joining & leaving\nexit verb [I or T]\n(COMPUTER)\nB1 to end a computer program that you are using: You have to exit the program before starting another. Click here to save and exit.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »"}