{"id":147562,"name":"exit","type":"noun","us_sound":"ˈek.sɪt","us_link":"../audio/e/exit.mp3","uk_sound":"ˈek.sɪt","uk_link":"../audio/e/ukexist008.mp3","content":"exit noun [C]\n(LEAVING)\nAdd to word list\nAdd to word list\nA2 the door through which you might leave a building or large vehicle: We headed for the nearest exit.fire exit The fire exit (= the door you can escape through if there is a fire) is located at the back of the building.emergency exit Please ensure that emergency exits are kept clear at all times. Compare\nentrance\nthe act of leaving a place, especially a theatre stage: make an exit He saw Emma arrive and made a quick exit.make your exit She made her exit from the stage to rapturous applause.\nthe act of leaving something such as a job, an organization, a competition, or a television show: exit from They believed his exit from the Department of Education was likely. Scriptwriters have promised the character a dramatic exit.\nMore examplesFewer examplesAt the end of the performance, there was a mad dash for the exit.The police are covering all the exits, so they've no chance of escape.Is the emergency exit suitable for wheelchairs?There are three exits from the gallery, but only one leads directly onto the street.I thought my best plan was a discreet exit.The player says he may retire following another early exit from an international tournament.\nSMART Vocabulary: related words and phrases\nParts of buildings: doors & parts of doors\narchitrave\nback door\nbell push\nbi-fold\ncat flap\ndoorstop\ndoorway\ndraught excluder\nentryway\nfire door\nknocker\nlintel\npurging\nrevolving door\nsafety gate\nscreen door\ntrapdoor\nturnstile\nup-and-over\nweatherboarding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeparting\nCinema & theatre: acting, rehearsing & performing\nOrganizations - joining & leaving\nexit noun [C]\n(ROAD)\nA2 a smaller road used to leave a main road: Turn off the motorway at the next exit.\nFeifei Cui-Paoluzzo/Moment/GettyImages\nMore examplesFewer examplesI missed my exit and had to continue to the next one.The exit is coming up in a couple of miles.\nSMART Vocabulary: related words and phrases\nRoads & routes in general\nadopt\nadopted\napproach\nascent\nbicycle lane/path\nbike lane\ncommunication\ndead end\ndetour\nimpassable\nlane\nmilk round\nmulti-lane\nroadway\nroadworks\nroute\nRR\nshortcut\nskid marks\ntoll road\nSee more results »\nexit verb [I or T]\n(LEAVE)\nto leave a place such as a building, room, or large vehicle: I exited quickly before anyone could see me. Please exit the theatre by the side doors.\nto leave a theatre stage: The character exits stage right. The singer took a bow before exiting the stage.\nto leave a large road and turn onto a smaller road: Detectives were following the car as it exited Route 3. Exit at junction 29.\nto leave something such as a job, an organization, a competition, or a television show: The former CEO exited the company amid growing criticism.exit from They would be the ones exiting early from the tournament.\nMore examplesFewer examplesHe felt like a winner as he exited the debate hall.As the blast exited the exhaust tube, a wave of low pressure rippled back toward the chamber.A small number of the respondents had retired or exited farming.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull out\npull something off\npush along\nsea\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: parts of plays, shows & films\nRoads & routes in general\nOrganizations - joining & leaving\nexit verb [I or T]\n(COMPUTER)\nB1 to end a computer program that you are using: You have to exit the program before starting another. Click here to save and exit.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nan instruction written in a play meaning that a character leaves the stage: The most famous and intriguing of all Shakespeare's stage directions is \"Exit pursued by a bear,\" in The Winter's Tale. Exit stage left. Compare\nexeunt\nSMART Vocabulary: related words and phrases\nCinema & theatre: parts of plays, shows & films\nact\nbeat\nblooper reel\nbyplay\ncurtain call\ndream sequence\nexeunt\nfinale\nflashback\nfourth wall\nframing\nintermission\nmeet-cute\nplot hole\nscene\nset piece\nshowstopper\nstage direction\nwrap party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: casting, roles & scripts\nAdd to word list\nAdd to word list\nthe door through which you might leave a room, building, or large vehicle, or a place on a main road where a vehicle can leave it by taking a smaller road: In case of fire, use the emergency exit next to the elevator. Stay on the freeway until you get to the Ventura exit.\nAn exit is also the act of leaving a place, esp. a public place such as the stage of a theater: She made her exit to rapturous applause.\nto leave a room, building, or large vehicle, or to leave a main road: [ I/T ] Please exit (the theater) by the side doors.\nIf you exit a computer or computer program, you stop using it.\nAdd to word list\nAdd to word list\nto stop working for a company or doing a particular business activity: Departing executives usually exit the company almost immediately. Four cruise ships are being sold off as the company plans to exit its cruise-line operations.exit from sth We are exiting from retail to focus on distribution.\nFINANCE to stop investing in something: Owners of the stock, which closed at 205p yesterday, should not exit now.exit from sth Nervous investors exited from property shares.\nIT to stop using a computer program: Remember to save your work before you exit. exit the program/site/game\nthe act of stopping working for a company or doing a particular business activity: sb's exit from sth He spoke honestly about the company's exit from television.an exit strategy/route Make sure you have an exit strategy in case the job doesn't work out.\nFINANCE a way of stopping investing in something: It acquired its shares at 90p and is known to be looking for an exit.\nthe act of ending an agreement, for example a contract or a loan: an exit from sth They successfully negotiated an exit from the contract. an exit charge/penalty/fee"}