{"id":147860,"name":"expansionist","type":"adjective","us_sound":"ɪkˈspæn.ʃən.ɪst","us_link":"../audio/e/usexist011.mp3","uk_sound":"ɪkˈspæn.ʃən.ɪst","uk_link":"../audio/e/ukexist026.mp3","content":"Add to word list\nAdd to word list\nrelated to increasing the amount of land ruled by a country, or the business done by a company: The bank does not pursue an expansionist strategy. The party opposes expansionist economic policies. See\nexpansionism\nMore examplesFewer examplesThe retailer cancelled its expansionist plans to open stores in three new cities. Expansionist policies led to problems with the country’s balance of payments. They claim they are unfairly accused of expansionist ambitions.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »\na person or organization that supports increasing the amount of land ruled by a country, or the business done by a company: Critics saw him as a ruthless expansionist who symbolized uncaring big business. They were hard-line expansionists. See\nexpansionism\nMore examplesFewer examplesAfter his remarks, the prime minister was seen as both an expansionist and a neo-colonialist. The banks went from being rampaging expansionists to capital-starved risk-avoiders.The odd situation arose where socialists and expansionists were united in common disagreement with the government. Southern expansionists focused primarily on the annexation of Texas.\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nnationalism\nsecession\nself-determination\nself-governing\nself-government\nself-rule\nSee more results »"}