{"id":147858,"name":"expansionary","type":"adjective","us_sound":"ɪkˈspæn.ʃən.er.i","us_link":"../audio/e/cdo0623usexpa1360.mp3","uk_sound":"ɪkˈspæn.ʃən.ər.i","uk_link":"../audio/e/cdo0623ukexpa1352.mp3","content":"Add to word list\nAdd to word list\nfinance &amp; economics\n&#160; specialized intended to increase the amount of money that people and businesses spend: expansionary policy The government's expansionary fiscal policy has failed to stimulate the economy. Most EU member states reacted in an expansionary fashion, increasing social expenditure. As an economic stimulus budget, it was expansionary. Related word\nexpand\nintended to increase the amount of land that a country controls: The country has made no secret of its expansionary ambitions in the region. Synonym\nexpansionistRelated words\nexpansionism\nexpandCompare\nexpansive\nMore examplesFewer examplesExpansionary measures often involve increases in benefits.Fiscal policy is likely to be expansionary until the next general election.According to this theory we would expect expansionary responses under leftwing governments, and retrenchment when conservative parties are in power.He has presented an expansionary budget with more spending promises.The bank's actions are having an expansionary effect on the economy.NATO was seen as countering a threat from an expansionary Soviet empire.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmercantilism\nmonetary\npeace dividend\nretrenchment\nstagflation\nthe public purse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColonization & self-government\nAdd to word list\nAdd to word list\nused to describe a set of conditions during which something increases in size, number, or importance : The economy has entered a fresh decline after a brief expansionary period."}