{"id":147836,"name":"expand","type":"verb","us_sound":"ɪkˈspænd","us_link":"../audio/e/expand.mp3","uk_sound":"ɪkˈspænd","uk_link":"../audio/e/ukexist021.mp3","content":"Add to word list\nAdd to word list\nB2 to increase in size, number, or importance, or to make something increase in this way: The air in the balloon expands when heated. They expanded their retail operations during the 1980s.\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\nMore examplesFewer examplesI don't think we should expand our business in the current economic climate.In their second album, the band tried to expand their stylistic range.The college is not able to expand because of restrictive planning laws.Their economy has expanded enormously, while ours, by contrast, has declined.In their efforts to reduce crime the government expanded the police force.\nSMART Vocabulary: related words and phrases\nEnlarging and inflating\naugmentation\nballoon\nbloat\nbroaden\nbuild (someone/something) up\nbulk\ndeepen\nexplosively\nflare\nfluff something up\nimplacably\ninflation\nlengthen\nmaximize\npuff\nreinflate\nreinflation\nscale something up\nstretch\nwiden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nPhrasal verb\nexpand on something\nAdd to word list\nAdd to word list\nto increase something in size, number, or importance: [ I ] The air in the balloon expands when heated. [ T ] They expanded their number of stores significantly in the 1990s. expansion noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈspæn·ʃən/\nExpansion into new areas of research might be possible. Phrasal verb\nexpand on/upon something\nAdd to word list\nAdd to word list\nto increase in size, number, or importance, or to make something increase in this way: expand into sth These companies need to expand into new markets because they have reached market saturation at home. expand rapidly/greatly/significantlyexpand the range/scope/capacity Supermarkets continue to expand the range of products and services offered in their outlets. expand a business/company/programme Production capacity could expand by up to 30%, thus bringing down prices. Phrasal verb\nexpand on sth"}