{"id":147985,"name":"expense","type":"noun","us_sound":"ɪkˈspens","us_link":"../audio/e/expense.mp3","uk_sound":"ɪkˈspens","uk_link":"../audio/e/ukexpat024.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the use of money, time, or effort: worth the expense Buying a bigger car has proved to be well worth the expense.at great expense We've just had a new garage built at great expense.at someone’s expense We went on holiday at my father's expense (= he paid for it).go to the expense of It's silly to go to the expense of (= spend money on) buying new clothes when you don't really need them.\n[ C ] something that makes you spend money: Our biggest expense this year was our summer holiday. We need to cut down on our expenses. expenses C1 [ plural ]\nmoney that you spend when you are doing your job, that your employer will pay back to you: I need to get my expenses approved.\nSee more\nMore examplesFewer examplesHe claimed that the restaurant bill was a legitimate business expense.Just buy it - never mind the expense!Owning a car involves a lot of expense - it's unavoidable.She rationalized the expense by saying that the costly carpet she had bought would last longer than a cheaper one.All the time and expense involved in keeping up to date with the changes has been worthwhile.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nIdioms\nall expenses paid\nat the expense of someone\nat the expense of something\nblow/hang the expense\nno expense is spared\nAdd to word list\nAdd to word list\nan amount of money needed or used to do or buy something; cost: [ C ] We have to start cutting down on our expenses. [ U ] The house was redecorated at great expense. Idioms\nat the expense of someone\nat the expense of something\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; ACCOUNTING an amount of money that a person or business spends in order to do something: a big/major expense Waste disposal is a major expense for us.cut down on/reduce/cut expense We need to cut down on our expenses.cover/meet expenses He said the business needed to borrow to meet future expenses.bear/incur an expense In your tax return you can include tax-deductible expenses incurred as a result of employment. a business/operating/running expense legal/medical/administrative expensesunnecessary/additional/extra expense Money can be moved into the account without the unnecessary expense of being converted into sterling.\n[ U ] the large amount of money that something costs: Buying a bigger car has proved to be well worth the expense. He just had his office remodelled at great expense. Having gone to the expense of hiring an exhibition stand, you need to make the most of the selling opportunity.\nexpenses [ plural ]\nHR, ACCOUNTING money that you spend when you are doing your job, that an employer or other organization pays back to you: pay/cover/reimburse sb's expenses She was invited to speak at the conference, with an offer to cover all her expenses. travel/relocation/subsistence expenses Details of how to claim expenses can be found on the website. Committee members are paid £160 plus expenses to attend the fortnightly meetings. I need to get my expenses approved.\nall expenses paid\nif something is all expenses paid, you do not have to pay for anything yourself: She's going to a conference in Tokyo, all expenses paid. an all-expenses-paid trip to New York\nat sb's expense\npaid for by someone: They are living an extravagant lifestyle at the taxpayer's expense. If you lose your ticket, you will have to buy another at your own expense.\non expenses\nusing money that will be paid back by your employer: He took me out to lunch on expenses. I usually travel standard class on the train, even when on expenses.\nspare no expense\nto spend a lot of money in order to make something extremely good: No expense was spared in redesigning the chairman's office. See also\naccrued expense\ncapital expense\ndirect expense\nentertainment expenses\nfixed expense\ngeneral expense\nhandling expense\nindirect expense\ninterest expense\nmarketing expense\nView all\noperating expense\noverhead expense\nsales expense\ntravel expense\nto show the full amount of money paid for something as a cost in a company's accounts, rather than showing it as a lower and lower amount over a period of time: The accounting rule allows research-and-development costs to be instantly expensed or deducted from profits."}