{"id":147899,"name":"expectation","type":"noun","us_sound":"ˌek.spekˈteɪ.ʃən","us_link":"../audio/e/expectation.mp3","uk_sound":"ˌek.spekˈteɪ.ʃən","uk_link":"../audio/e/ukexpat008.mp3","content":"Add to word list\nAdd to word list\nB2 [ C usually plural ] the feeling that good things are going to happen in the future: live up to someone's expectations The holiday lived up to all our expectations (= was as good as we were expecting).have high expectations I've heard she's a stellar manager so I have high expectations (= I believe she will do a good job).expectations for What are your expectations for this job?beyond all someone's expectations We did so well - beyond all (= better than) our expectations.unrealistic expectations I think she had unrealistic expectations of motherhood.\n[ C or U ] the feeling of expecting something to happen: expectation of Considering the injuries he's had there can be little expectation of him winning the race. Our expectations are that the UK will cut its interest rate. against all expectations (also contrary to all expectations)\ndifferent from what is expected: Contrary to all expectations, she was accepted by the academy.\nSee more manage expectations\nto try to encourage people to expect a bad result, so they will not be disappointed and may be pleasantly surprised: Anticipating heavy losses, his campaign has already started managing expectations. As they await the panel's decision, advocates on each side try to manage expectations. Hoping to manage expectations, the company is saying publicly that its only goal is to equal the last quarter's performance.\nMore examplesFewer examplesContrary to all our expectations, he's found a well-paid job and a nice girlfriend.The success of our campaign has exceeded our wildest expectations.The company's results are in line with stock market expectations.She could never measure up to her mother's expectations.The concert was brilliant - it lived up to all our expectations.\nSMART Vocabulary: related words and phrases\nHoping and hopefulness\nappealingly\nboosterish\nboosterism\ncautious\ncautiously\nglass\nhopefully\nhopefulness\nill\nit's an ill wind (that blows nobody any good) idiom\nla-la land\nlife-affirming\npipe dream\nplease God idiom\nPollyanna\npositive\npositiveness\npositivism\ntrust\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nNot hopeful\nAdd to word list\nAdd to word list\nthe feeling or belief that something will or should happen: [ U ] Considering his grades, there is little expectation of his getting into medical school. [ C usually pl ] Last year’s predictions fell a bit short of expectations.\nAdd to word list\nAdd to word list\nwhat you believe or hope will happen in the future: Now the expectation is just 81 cents a share, according to a survey of a dozen analysts.expectation that sth The banks help out the government in the expectation that favours will be returned over time. The company says its revenue this year will fall $500,000 short of earlier expectations. Cost pressures are growing, and public and market expectations of inflation are rising. The group said it expected results for the second half to be in line with expectations, though there may be a shortfall in the first half of the year."}