{"id":147930,"name":"expedient","type":"adjective","us_sound":"ɪkˈspiː.di.ənt","us_link":"../audio/e/expedient.mp3","uk_sound":"ɪkˈspiː.di.ənt","uk_link":"../audio/e/ukexpat013.mp3","content":"Add to word list\nAdd to word list\nhelpful or useful in a particular situation, but sometimes not morally acceptable: It might be expedient not to pay him until the work is finished. The management has taken a series of expedient measures to improve the company's financial situation.\nSMART Vocabulary: related words and phrases\nUseful or advantageous\nadvantageous\nadvantageously\nall-singing\namiss\nasset\nfecund\nfoil\nfruitfully\nfruitfulness\ngainfully\ngeneral\npracticality\npreferential\nproductive\nproductively\nprofitable\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nRelated word\nexpediently\nan action that is expedient: a political expedient\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfigure\nfix\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill or cure idiom\nresolution\nsolve\nsurmountable\ntalk something out\nunsolvable\nuntangle\nSee more results »\nAdd to word list\nAdd to word list\nhelpful or useful in a particular situation, and without considering any moral question that might influence your decision: We thought it expedient not to pay the builder until he finished the work. expediency noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈspid·i·ən·si/ (also expedience, us/ɪkˈspid·i·əns/)\npolitical expediency\nAdd to word list\nAdd to word list\nhelpful or useful in the situation that now exists, although perhaps not the right thing to do morally or for the future: it is expedient to do sth It might be expedient not to pay him until some time after the work is finished. It would not be politically expedient to propose new fees. The management has taken a series of expedient measures to improve the company's financial situation. expediently adverb /ɪkˈspiːdiəntli/\nWe need to find the means to take decisions both expediently and with due public consultation.\nan action that is expedient: The company can save money by the simple expedient of cutting investment and hiring."}