{"id":147891,"name":"expect","type":"verb","us_sound":"ɪkˈspekt","us_link":"../audio/e/expect.mp3","uk_sound":"ɪkˈspekt","uk_link":"../audio/e/ukexpat004.mp3","content":"expect verb\n(THINK)\nAdd to word list\nAdd to word list\nB1 [ T ] to think or believe something will happen, or someone will arrive: We are expecting a lot of applicants for the job. [ + (that) ] I expect (that) you'll find it somewhere in your bedroom. I expect (that) he'd have left anyway. [ + to infinitive ] He didn't expect to see me.be fully expected to The financial performance of the business is fully expected (= almost certain) to improve.half expect someone to do something We were half expecting you not to come back. (only) to be expected\nnormal and what usually happens: All parents of small children get tired. It's to be expected.\nSee more\nMore examplesFewer examplesI don't expect we'll have any more trouble from him.Gosh, I didn't expect to see you here!I'd expected to put weight on when I gave up smoking, but I didn't.Our department expects to make five new appointments this year alone.This is your captain speaking. We expect to be landing at London Heathrow in an hour's time.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nexpect verb\n(DEMAND)\nB2 [ T ] to think that someone should behave in a particular way or do a particular thing: expect something from someone I expect punctuality from my students. [ + to infinitive ] Borrowers are expected to (= should) return books on time.\nMore examplesFewer examplesWe expect these practices to cease forthwith.Some people expect instant gratification.You shouldn't expect others to do your work for you.It annoys me that she just expects us to help.The governors and the education authority expect all pupils to attend school assembly.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nexpect verb\n(BE PREGNANT)\nbe expecting (a child/twins/a baby/etc.)\nB2 to be pregnant: She shouldn't be lifting those boxes if she's expecting.\nSee more\nRelated word\nexpectedGrammar\nExpect, hope or wait?We use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nExpectWe use expect to say that we believe that something will happen. We use expect in the following main patterns: …\nHopeWe use hope when we do not know whether something will happen or not but we want it to happen. We use hope in the following patterns: …\nWaitWe use wait when we refer to letting time pass because we are expecting that something is going to happen. We use wait in the following main patterns: …\nExpect, hope or wait: typical errorsWe don’t use wait or wait for to say that we believe that something will happen. We use expect: …\nAdd to word list\nAdd to word list\nto think or believe that something will happen, or that someone will arrive: [ T ] We are expecting about 100 people for the lecture. [ T ] His plane is expected to land at about 7:30 this evening. [ + to infinitive ] We expected to see her here, but I guess she decided not to come.\nTo expect is also to ask for something to happen because you think you have a right to ask for it: [ T ] The boss wants me to work this weekend – that’s expecting a lot! is expecting\nIf you say that a woman is expecting, you mean that she is pregnant. expectancy noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈspek·tən·si/\nThere was an air of expectancy as the chairman rose to speak. expectantly adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈspek·tənt·li/\nShe looked up at him expectantly."}