{"id":148016,"name":"experimental","type":"adjective","us_sound":"ɪkˌsper.əˈmen.t̬əl","us_link":"../audio/e/eus71711.mp3","uk_sound":"ɪkˌsper.ɪˈmen.təl","uk_link":"../audio/e/ukexper003.mp3","content":"Add to word list\nAdd to word list\nusing new methods, ideas, substances, etc. that have not been tried before, usually in order to find out what effect they have: The changes to the distribution system are purely experimental at the moment.experimental drug Some patients were given the experimental drug, while others were given a placebo.experimental vaccine an experimental malaria vaccine experimental treatment Both are experimental treatments for cancer. Her poetry is too experimental to be widely popular.\nC2 relating to or using scientific experiments (= tests): experimental data Experimental data suggests that cholesterol may play a role in the disease.experimental evidence We have been waiting many years for this kind of experimental evidence.experimental psychology We will use techniques of experimental psychology to investigate the processes involved in word recognition.experimental study observational and experimental studies of children's vocabulary development Compare\nobservational\nMore examplesFewer examplesShe is an architect known for boldly experimental designs.These approaches remain experimental and are not without risks.Mice and rats are often used as experimental animals because they are small and breed quickly.\nSMART Vocabulary: related words and phrases\nNew\nafresh\nbe ahead of the curve idiom\nbox-fresh\nbrand new\ninnovative\ninnovatively\nlatest\nlatter-day\nnewborn\nnext-gen\nnext-generation\nnovel\nnovelty\noriginal\noriginality\nthe avant-garde\nthe ink is not dry/still wet idiom\nunprecedented\nup-to-the-minute idiom\nyouth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTesting, checking and experimenting\nRelated word\nexperimentally\nAdd to word list\nAdd to word list\nusing or based on new ideas"}