{"id":148001,"name":"experience","type":"noun","us_sound":"ɪkˈspɪr.i.əns","us_link":"../audio/e/experience.mp3","uk_sound":"ɪkˈspɪə.ri.əns","uk_link":"../audio/e/ukexpat028.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] (the process of getting) knowledge or skill from doing, seeing, or feeling things: experience of Do you have any experience of working with kids? (= Have you ever worked with them?)by experience The best way to learn is by experience (= by doing things).from experience I know from experience that Tony never keeps his promises.experience for I don't think she has the experience for the job (= enough knowledge and skill for it).in your experience In my experience, people generally smile back if you smile at them. The experience of pain (= what pain feels like) varies from one person to another.\nB1 [ C ] something that happens to you that affects how you feel: I had a pretty unpleasant experience at the dentist's. It was interesting hearing about his experiences as a policeman. I did meet him once and it was an experience I shall never forget.\n[ C ] the way that something happens and how it makes you feel: dining experience They go out of their way to make sure you have a great dining experience.customer experience A spokesman for the company said that it was committed to improving the customer experience.\nMore examplesFewer examplesFighting in Vietnam was an experience that would haunt him for the rest of his life.The new job will provide you with invaluable experience.We need someone who has experience in marketing and teaching, and I think Alex is just the woman for the job.A tour of Australia is a once-in-a-lifetime experience.I know from past experience that you can't judge someone by their appearance.\nSMART Vocabulary: related words and phrases\nKnowledge and awareness\nacquaintance\nalertness\nas every schoolboy/schoolchild knows idiom\nastuteness\nat/in the back of your mind idiom\nfirsthand\ngeneral knowledge\ngnostic\ngrounding\nhave a nodding acquaintance with someone/something idiom\nmetacognition\nnescience\nnescient\noff someone's radar idiom\nomniscience\nsensibility\nstreet smarts\ntheory of mind\nvisual literacy\nwitting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nGrammar\nExperience or experiment?We use experience as a verb when something happens to us, or we feel it. It is rather formal: …\nIdiom\nput it down to experience\nB1 If you experience something, it happens to you, or you feel it: We experienced a lot of difficulty in selling our house. New companies often experience a loss in their first few years. It was the worst pain I'd ever experienced.\nMore examplesFewer examplesDid you experience any ill effects from the treatment?It's quite natural to experience a few doubts just before you get married.You can't appreciate the true awfulness of war until you've actually experienced it.Schools nationwide are experiencing a shortage of teachers.He experiences severe mood swings .\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhold on idiom\nhorse\npractical\nseat-of-the-pants\nsee life idiom\nstricken\nsurvive\ntaste\nSee more results »\nGrammar\nExperience or experiment?We use experience as a verb when something happens to us, or we feel it. It is rather formal: …\nAdd to word list\nAdd to word list\n(the process of getting) knowledge or skill that is obtained from doing, seeing, or feeling things, or something that happens which has an effect on you: [ U ] Do you have any experience working with children? [ U ] I know from experience that it can get quite cold in Maine this time of year.\nto have something happen to you, or to do or feel something: The community has experienced rapid residential growth. She began to experience sharp pains in her elbow.\nAdd to word list\nAdd to word list\n[ U ]\n&#160; HR knowledge or skill that you get from doing, seeing, or feeling things, or the process of getting this: His knowledge and experience will be a great asset to the board in our future growth.have experience of sth Do you have any experience of working with heavy machinery?gain/get experience As we gained experience of interpreting the data we were able to work faster.experience as sth They employed someone with many years' experience as a mine regulator.experience in sth Their experience in marketing and promotion has brought excellent results.work/professional experience My work experience includes one year as an accounts clerk, and two years as a shop assistant.past/previous/prior experience No previous experience is necessary as full training will be offered.extensive/considerable experience Carol has extensive experience in consumer advice and trading standards. practical/relevant experience personal/first-hand/direct experience I have three years of experience.by/from experience I know from experience that the manager's job does not end at closing time.in sb's experience In our experience, the most successful projects come from strong, diverse teams.\n[ C ] something that happens to you that affects how you feel: a good/great/positive experience We want to make visiting the website a good experience for all our users. a useful/valuable/educational experiencebe/provide/offer an experience It was an amazing experience to participate in the forum.customer/shopping/learning experience People who shop here care about the customer experience and the quality of service they receive. See also\nhands-on experience\nwork experience\nif you experience something, it happens to you or affects you: experience a problem/difficulty We experienced a lot of difficulty in selling our house. New companies often experience a loss in their first few years. This family business has experienced steady growth and now employs 40 people."}