{"id":147995,"name":"expensive","type":"adjective","us_sound":"ɪkˈspen.sɪv","us_link":"../audio/e/expensive.mp3","uk_sound":"ɪkˈspen.sɪv","uk_link":"../audio/e/ukexpat026.mp3","content":"Add to word list\nAdd to word list\nA1 costing a lot of money: Rolls Royces are very expensive.expensive to Big houses are expensive to maintain.expensive taste She has expensive tastes (= she likes things that cost a lot of money). Synonyms\ncostly (EXPENSIVE)\ndear (EXPENSIVE) mainly UK\npricey informalOpposites\ncheap\ninexpensive\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nMore examplesFewer examplesIf you send it by airmail, it'll be very expensive.I treated myself to a meal in an expensive restaurant.Toddlers don't need expensive toys and games to keep them amused.A large house like this must be expensive to heat.A lot of businesses are moving out of London because it's too expensive.\nSMART Vocabulary: related words and phrases\nExpensive & luxurious\nchampagne\ncostliness\ncostly\nexpense\nexpensively\nextravagance\ngold plate\ngraciousness\nluxuriant\nluxurious\nluxury\nluxury goods\nposhly\nposhness\nprecious\npreciousness\npremium-rate\npriceless\nritzy\nupmarket\nSee more results »\nRelated word\nexpensively\nAdd to word list\nAdd to word list\ncosting a lot of money: Housing in this part of the country is very expensive. expensively adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ɪkˈspen·sɪv·li/\nShe was expensively dressed.\nAdd to word list\nAdd to word list\ncosting a lot of money: Business class travel has become very expensive. He was looking for insurance to cover the expensive equipment in his home office.sth is expensive to do Older houses are expensive to maintain. prohibitively/extremely/hugely expensive"}