{"id":148075,"name":"expiration","type":"noun","us_sound":"ˌek.spəˈreɪ.ʃən","us_link":"../audio/e/cald4us0789.mp3","uk_sound":"ˌek.spɪˈreɪ.ʃən","uk_link":"../audio/e/cald4uk0525.mp3","content":"expiration noun [U or C]\n(END)\nAdd to word list\nAdd to word list\nmainly US (UK usually expiry, uk\nYour browser doesn't support HTML5 audio\n/ɪkˈspaɪə.ri/ us\nYour browser doesn't support HTML5 audio\n/ɪkˈspaɪr.i/) the situation in which something that lasts for a fixed length of time comes to an end or stops being in use: the expiration of a lease/visaexpiration date What is the expiration date of your credit card? (= What is the last date on which it can be used?)\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\nMore examplesFewer examplesHe was fired before the expiration of his contract.Our automated auto-renewal system will notify you when your domain name is nearing expiration.He claimed that his expectation of privacy should have continued beyond the expiration of the rental period.The pharmaceutical company faces a wave of patent expirations on its bestselling drugs .\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\nconclusion\ndeath\nend\nending\nexpiry\nfag\nfinalization\nfinish\nfinitude\nshowstopper\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\nSee more results »\nexpiration noun [U or C]\n(BREATHING)\nmedical , biology\n&#160; specialized the act of breathing out: During normal breathing, expiration is passive and no muscles are contracted. Breath intake and expiration were mostly active only in the upper half of her chest.\nMore examplesFewer examplesAsthma is characterized by recurring episodes of difficult breathing and wheezing on expiration and inspiration.The stridor is usually heard when the infant breathes in (inspiration), but can also be heard when the infant breaths out (expiration).He extinguished the candle by a sharp expiration of breath on its flame.The patient performs one or two forced expirations (huffs) from mid to low lung volume.\nSMART Vocabulary: related words and phrases\nAnimal physiology: breathing & stopping breathing\naerobic\nanaerobic respiration\nasphyxia\nasphyxiation\nbreathable\nbreathlessly\ndraw breath phrase\nheave\npuff\nshallow\nshortness\nsigh\nsleep apnoea\nsmother\nsnuffly\nstrangle\nstrangulate\nsuffocatingly\nthrottle\nwinded\nSee more results »\nAdd to word list\nAdd to word list\nthe end of a period of time during which an agreement or official document can be used: He stayed on past the expiration of his tourist visa.\nAdd to word list\nAdd to word list\n→\nexpiry : Trading was brisk as the quarterly expiration of options and futures spurred demand for shares."}