{"id":148207,"name":"explosiveness","type":"noun","us_sound":"ɪkˈsploʊ.sɪv.nəs","us_link":"../audio/e/usexpli009.mp3","uk_sound":"ɪkˈspləʊ.sɪv.nəs","uk_link":"../audio/e/ukexplo012.mp3","content":"explosiveness noun [U]\n(EXPLOSION)\nAdd to word list\nAdd to word list\nthe condition of being able to explode easily, or of exploding with a lot of force: Everyone was aware of the explosiveness of the gas. The explosiveness of a volcanic eruption dictates whether lavas are produced.\nthe quality of being very loud and sudden, like an explosion: the explosiveness of the impact\nMore examplesFewer examplesEngineers have sought ways to make fuels burn efficiently but with less explosiveness on impact.Volcanoes are evaluated based on their potential explosiveness. the explosiveness of the crashing cymbals\nSMART Vocabulary: related words and phrases\nExploding and erupting\nblast\nblow\nblowout\nburst\nburst in on someone/something\nburst in/into (somewhere)\ndetonate\ndetonator\nerupt\nexplosively\ngo off\ngo pop idiom\ngo up\nignite\nimplode\nimplosion\nlive\nnon-explosive\npop\nset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing qualities of sound\nexplosiveness noun [U]\n(EMOTION)\nthe loud or violent expression of strong feelings, or a tendency to express feelings like this: The explosiveness of his denial was absolute. Kids reach the point of explosiveness faster than adults.\nMore examplesFewer examplesPast confrontations did not have the political explosiveness of the current dispute.She grew up in a country where passionate explosiveness seems to be the norm.\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfit to burst idiom\nflamingly\nfulminating\ngrip\nheart-stopping\npungently\nquiveringly\nrabid\nrabidly\nreinforced\nrhapsodic\nsearing\ntingle\ntorrid\nvirulent\nSee more results »\nexplosiveness noun [U]\n(SPORTS)\nthe ability to suddenly increase your speed or power while playing a sport, running, etc.: The drills are designed to test speed, strength, agility, and explosiveness. After major knee surgery, he lost his explosiveness.\nMore examplesFewer examplesIn basketball, there's a lot of stopping and starting and so we need to work on our explosiveness.The 23-year-old brings an explosiveness to the Titans' backfield that has been missing for years.The sport's elite train to develop the explosiveness needed in ski jumping and the endurance vital for cross-country racing.\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterous\ndexterously\ndigital native\nexpert\nexpertly\npedigreed\npolished\npractised\nproficient\nproficiently\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nworkmanlike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting in sport"}