{"id":148206,"name":"explosively","type":"adverb","us_sound":"ɪkˈsploʊ.sɪv.li","us_link":"../audio/e/usexpli008.mp3","uk_sound":"ɪkˈspləʊ.sɪv.li","uk_link":"../audio/e/ukexplo011.mp3","content":"explosively adverb\n(BURST)\nAdd to word list\nAdd to word list\nin a way that relates to, causes, or is caused by something exploding: The substance is toxic and explosively flammable.\nin a way that is very sudden and powerful, like an explosion: During our conversation he sometimes giggles explosively. As a player he was talented and explosively energetic.\nMore examplesFewer examplesLiquid carbon dioxide seeped to the surface, where it would explosively vaporize and blast outward, like a small volcano.A-bombs require highly concentrated amounts of fissionable materials that are explosively compressed together.The volcano may erupt explosively.He coughed explosively.\nSMART Vocabulary: related words and phrases\nExploding and erupting\nblast\nblow\nblowout\nburst\nburst in on someone/something\nburst in/into (somewhere)\ndetonate\ndetonator\nerupt\nexplosiveness\ngo off\ngo pop idiom\ngo up\nignite\nimplode\nimplosion\nlive\nnon-explosive\npop\nset\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower and intensity\nNot expected or planned\nexplosively adverb\n(GROWTH)\nin a way that grows or spreads extremely quickly: India and China were enjoying explosively growing economies. These weeds cause problems because of their ability to spread explosively.\nMore examplesFewer examplesIn no other land or period in the history of the world has there been such an explosively expanding economy.The company has grown explosively to become the world's leading maker of medical devices.The company had an explosively successful initial public offering. The infection comes on explosively, just like bacterial meningitis.The disease moves explosively through herds of wild deer.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\n-ify\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nresurge\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnlarging and inflating\nexplosively adverb\n(EMOTION)\nin a way that relates to or causes strong feelings, especially anger, being loudly or violently expressed: He has an explosively combative temperament.\nMore examplesFewer examplesMoney represents our fondest hopes, our most fervent dreams, our worst nightmares, all balled up into an explosively emotional package.Most explosively, the leaked documents contained claims that the government was prepared to offer arms to terrorists. Their partnership was explosively passionate.\nSMART Vocabulary: related words and phrases\nStrong feelings\nafire\nall-consuming\nanguish\nanguished\nardent\nfit to burst idiom\nflamingly\nfulminating\ngrip\nheart-stopping\npungently\nquiveringly\nrabid\nrabidly\nreinforced\nrhapsodic\nsearing\ntingle\ntorrid\nvirulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming angry and expressing anger\nSee\nexplosive"}