{"id":148095,"name":"explain","type":"verb","us_sound":"ɪkˈspleɪn","us_link":"../audio/e/explain.mp3","uk_sound":"ɪkˈspleɪn","uk_link":"../audio/e/ukexper016.mp3","content":"Add to word list\nAdd to word list\nA2 to make something clear or easy to understand by describing or giving information about it: If there's anything you don't understand, I'll be happy to explain.explain something to someone The teacher explained the rules to the children. [ + question word ] Our guide explained where the cathedral was. He explained how the machine worked. Please could you explain why you're so late. [ + that ] She explained that she was going to stay with her sister. [ + speech ] \"Someone must have hit the wrong button,\" an official explained. Molly asked the teacher if she could explain herself a little more clearly (= say more clearly what she meant). No one has been able to explain (= give the reason for) the accident.\nThesaurus: synonyms, antonyms, and examples\nto explain somethingexplainCan you explain that again?clarifyLet me just clarify what I mean here.defineYour responsibilities are clearly defined in the contract.set outYour contract will set out the terms of your employment.set forthThe terms of the statute are set forth in Section I, Article 3.spell outThey sent me a letter spelling out the details of the agreement.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto answer someoneanswer\"Thank you\", she answered.replyThe man replied that something was missing.respondWe aim to respond to all enquiries within five working days.reactHe reacted positively to the proposal.get back toI'll look into it and get back to you.explain\"What happened?\" she asked. - \"There's no time to explain!\" he said.\nSee more results »\nexplain yourself\nto give reasons for your behaviour: He hadn't been home for three days so I asked him to explain himself. I'm not going to explain myself to someone who has never done a day's work in their life. If they get the video, you'll be explaining yourself to a police officer in the very near future. If they catch us in here, we're going to have a hard time explaining ourselves. Why would you do such a thing? Go ahead - explain yourselves.\nMore examplesFewer examplesShe tried to explain what had happened but he kept interrupting her.Any decent teacher should be able to explain the difference between transitive and intransitive verbs.Pay attention to what she's saying because she won't explain it a second time.She painstakingly explained how the machine worked.This booklet about the project explains things in an easy, non-technical way.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\nGrammar\nExplainWe use the verb explain to mean ‘make something clear or easy to understand, by describing or giving information about it’. …\nPhrasal verb\nexplain something away\nAdd to word list\nAdd to word list\nto make something clear or easy to understand by describing or giving information about it: [ I ] If there’s anything you don’t understand, I’ll be happy to explain. [ T ] The teacher explained the procedure to the students. [ + question word ] Bill explained how the program works.\nTo explain is also to give a reason for doing something: [ + question word ] He couldn’t explain why he did it. Phrasal verb\nexplain away something"}