{"id":148191,"name":"explore","type":"verb","us_sound":"ɪkˈsplɔːr","us_link":"../audio/e/explore.mp3","uk_sound":"ɪkˈsplɔːr","uk_link":"../audio/e/ukexplo007.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to search a place and discover things about it: The best way to explore the countryside is on foot. Robots, rather than astronauts, explore space now. The children have gone exploring in the woods.\nB2 [ T ] to think about, talk about, or study something, or to experience it, in order to find out more about it: explore the possibility They are exploring the possibility of collaborating on a new project.explore your options At this point we are just exploring our options.explore avenues Scientists are exploring multiple avenues to develop the most effective vaccine.explore a theme The movie explores the themes of love and loss.explore an issue The course will explore these management issues in detail.explore an idea Computers allow children to easily explore an idea, and be more experimental. Working on the play and exploring deaf culture has been a profound experience for many in the cast.\nMore examplesFewer examplesDivers exploring the wreck managed to salvage some coins and jewellery.This small town makes an excellent base for exploring the area.We went on an expedition to explore the flora and fauna of Hornchurch Wood.Virtual Reality aims to give us artificial worlds to explore, outside normal space and time.A website may have many different web pages for you to click on and explore.She saw the isolation tanks as a means to explore the nature of human consciousness. I want to spend time exploring every aspect of the local culture.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nhunting ground\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nneedle\nscout\nscratch\nsearch\nseek someone/something out\nseeker\nshake someone down\ntroll\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nDebate & discussion\nexplore verb\n(TRAVEL)\nAdd to word list\nAdd to word list\n[ I/T ] to travel to a new place to learn about it or become familiar with it: [ T ] They set out to explore the city.\nexplore verb\n(DISCOVER)\n[ T ] to try to discover; learn about: We have to explore new ways to market our products. Many scholars have explored this issue."}