{"id":148242,"name":"expose","type":"verb","us_sound":"ɪkˈspoʊz","us_link":"../audio/e/eus71722.mp3","uk_sound":"ɪkˈspəʊz","uk_link":"../audio/e/ukexplo024.mp3","content":"expose verb [T]\n(UNCOVER)\nAdd to word list\nAdd to word list\nto remove what is covering something so that it can be seen: The plaster on the walls has been removed to expose the original bricks underneath. He damaged his leg so badly in the accident that the bone was exposed.\nto allow light to shine on photographic film, as part of producing an image or in a way that destroys an image: Depending on how bright the sky is and what kind of effect you want to achieve, you might expose the film anywhere from one minute to 10 minutes.under-exposed This photograph was under-exposed (= too little light was allowed to reach the film).over-exposed Many of the show's paintings give the impression of over-exposed photographs (= in which too much light was allowed to reach the film). Police forced tourists who had photographed the incident to expose their film. Related words\noverexpose\nunderexpose\nunexposed expose yourself\nIf a man exposes himself, he shows his sexual organs in a public place to people he does not know.\nMore examplesFewer examplesWe decided to expose the wooden beams in the sitting room to give it a more old-fashioned feel.More political scandals were exposed in the newspapers today.He had undone the buttons of his shirt, exposing an unsightly expanse of white flesh.The movie is about a young police officer and his struggle to expose corruption in the force.Embarrassing details of their private life were exposed to the public.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nexpose verb [T]\n(PUT AT RISK)\nB2 to put someone at risk from something harmful or unpleasant: It is feared that people living near the power station may have been exposed to radiation.expose someone to something His comments in the interview could expose him to charges of perjury. There had been an outbreak of the virus and healthcare workers had been exposed.\nMore examplesFewer examplesAbout 800,000 children are exposed to poisons each year.He was reluctant to take commercial flights because of the fear of exposing himself to germs.Storing or distributing unlawful material could expose you to criminal liability.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ncompromise\ndare\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nlay\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\nexpose verb [T]\n(MAKE PUBLIC)\nB2 to make public something bad or dishonest: expose corruption The review exposed widespread corruption in the police force.expose someone as something The newspaper story exposed him as (= showed that he was) a liar.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\na public report of the facts about a situation, especially one that is shocking or has been kept secret: exposé of Today's newspaper contains a searing exposé of police corruption.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nexpose verb [T]\n(BE SEEN)\nAdd to word list\nAdd to word list\nto make something covered or hidden able to be seen: The plaster was removed to expose the original brick wall.\nexpose verb [T]\n(SHOW THE TRUTH)\nto publicly show that someone or something is bad or dishonest: He was exposed as a fraud and a liar.\nexpose verb [T]\n(BE HARMED)\nto create a situation or a condition that makes someone likely to be harmed: His behavior on the Senate floor exposed him to ridicule. Be sure your child wears sunscreen whenever she’s exposed to the sun.\nexpose verb [T]\n(GIVE OPPORTUNITY)\nto create conditions that allow someone to have the opportunity to learn or experience new things: Kate was exposed to new ideas when she went to college.\na public report about a situation that is shocking or that has been kept secret\nAdd to word list\nAdd to word list\nto create conditions that allow someone the opportunity to do, learn, or experience something: expose sb/oneself to sth Some expose themselves to the equity market only indirectly, through insurance and pension plans.\nto make public something bad or dishonest: The audit exposed widespread corruption in the accounting department.\nMARKETING to put something where it can be easily seen: Make sure the new models are exposed in the window.\na public report of the facts about a situation, especially one that is shocking or has been kept secret: an exposé of sth Today's newspaper contains a searing exposé of insider trading."}