{"id":148228,"name":"export","type":"verb","us_sound":"ˈek.spɔːrt","us_link":"../audio/e/eus71719.mp3","uk_sound":"ɪkˈspɔːt","uk_link":"../audio/e/ukexplo019.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to send goods to another country for sale: be exported to French cheeses are exported to many different countries. Our clothes sell so well in this country that we have no need to export. Opposite\nimport\nThesaurus: synonyms, antonyms, and examples\nto sell somethingsellAre you selling your car?retailThe company makes and retails moderately priced sportswear.deal inThey mainly deal in rare books.divestUS The investors divested themselves of the company's stock.sell offThe company is selling off the less profitable parts of its business.\nSee more results »\n[ T ] to put something from one country into use in other countries: American culture has been exported all over the world.\n[ T ] If you export information from a computer, you copy a large amount of it to a different part of the computer's memory or to another device.\nMore examplesFewer examplesWe export our products to countries as far afield as Japan and Canada.Japan exported $117 billion in merchandise to the US in 1999.Japan exports a huge quantity of cars around the world.An alarming number of these animals are being exported for the pet trade.At one time, Cornwall exported millions of tons of copper and tin around the world.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStarting and beginning\nOperating computers\nRelated words\nexportable\nexportation\nB2 a product that you sell in another country, or the business of sending goods to another country in order to sell them there: main export Coffee is one of Brazil's main exports. We plan to increase our exports over the next five years.export of The export of ivory is now strictly controlled.for export India grows tea for export.export market We are planning to develop our export market.export trade Most of the country's export trade is with Russia. Opposite\nimport\nMore examplesFewer examplesThese products are not for national consumption, but for export.The main crops grown for export are coffee and rice.Iraq's principal export is oil.Coffee exports earn Brazil many millions of pounds a year.In geography, we learned what were the main imports and exports of each country.\nSMART Vocabulary: related words and phrases\nProducts & producers\nanti-dumping\nbadging\nbegetter\nbig pharma\nbig tobacco\ndeliverable\ndry goods\ndumping\nend product\nfabricator\ngeneral-purpose\ngenerator\nhaul\nmover\nmulti-line\nmulti-product\nnon-proprietary\nnotion\noutput\nspecialize\nSee more results »\nAdd to word list\nAdd to word list\nto send goods to another country for sale or use: [ T ] Chile exports a large amount of copper to Japan. exporter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ekˈspɔr·t̬ər, -ˈspoʊr-/\nJapan is a major exporter of cars.\nsomething sold and taken out of a country and into another: [ C ] Coffee is one of Brazil’s main exports.\nExport is also the business of sending goods to another country in order to sell them there.\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE, ECONOMICS to send goods to another country for sale: Last year, the US exported $93 million worth of wine.export sth to sth French cheeses are exported to many different countries. The exchange rate is making it difficult for farms and factories to export. Oil companies had contracts with an exporting countries that fixed prices and volumes. See also\nre-export\n[ T ] to put something from one country into use in other countries: export sth to sth He believes the state's educational model can be exported to other states. American culture has been exported all over the world.\n[ T ]\n&#160; IT to copy a large amount of information on a computer either to a different part of the computer's storage space or to another form of storage such as a CD, so that it can be used for a different purpose: If they had all the right tools on the same platform they would not need to export data.export sth to/into sth The only way to do this is to export the data into a spreadsheet.export sth from sth This article tells you how to import and export files from UNIX to other systems.\nexportable adjective uk/ɪkˈspɔːtəbl̩/ us/-ˈspɔːrṱə-/\nThe value of the new television technology to the company is that it is highly exportable to other countries. Compare\nimport noun\n[ C, usually plural ] a product that you sell in another country: Coffee is one of Brazil's main exports. oil/arms/beef exportsincrease/boost/promote exports We plan to increase our exports over the next five years. ban/halt/control exports a decline/growth in exports See also\ninvisible exports\nvisible exports\n[ U ] the activity or business of sending goods to another country in order to sell them there: the export of sth The ruling banned the export of live cattle. Most of their crops are grown for export. an export company/business See also\ndirect export\nindirect export Compare\nimport verb\nimport-export"}