{"id":148248,"name":"exposing","type":"verb","us_sound":"ɪkˈspoʊz","us_link":"../audio/e/eus71722.mp3","uk_sound":"ɪkˈspəʊz","uk_link":"../audio/e/ukexplo024.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nexpose\nexpose verb [T]\n(UNCOVER)\nto remove what is covering something so that it can be seen: The plaster on the walls has been removed to expose the original bricks underneath. He damaged his leg so badly in the accident that the bone was exposed. This photograph was under-/over-exposed (= too little/too much light was allowed to reach the film). expose yourself\nIf a man exposes himself, he shows his sexual organs in a public place to people he does not know.\nMore examplesFewer examplesWe decided to expose the wooden beams in the sitting room to give it a more old-fashioned feel.More political scandals were exposed in the newspapers today.He had undone the buttons of his shirt, exposing an unsightly expanse of white flesh.The movie is about a young police officer and his struggle to expose corruption in the force.Embarrassing details of their private life were exposed to the public.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbetray\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nproduce\nspeak\nvirtue signalling\nvisualization\nwear\nwhiff\nSee more results »\nexpose verb [T]\n(PUT AT RISK)\nB2 to put someone at risk from something harmful or unpleasant: It is feared that people living near the power station may have been exposed to radiation. His comments in the interview could expose him to charges of perjury. There had been an outbreak of the virus and healthcare workers had been exposed.\nMore examplesFewer examplesAbout 800,000 children are exposed to poisons each year.He was reluctant to take commercial flights because of the fear of exposing himself to germs.Storing or distributing unlawful material could expose you to criminal liability.\nSMART Vocabulary: related words and phrases\nTaking risks\nadventurer\nall in\nbe skating on thin ice idiom\nbet the farm/ranch idiom\nbroke\ncompromise\ndare\nexpose\nhave/put your head on the block idiom\nhazard\nhigh wire\nhigh-stakes\nimperil\nput your neck on the line idiom\nre-expose\nrisk\nrun the risk of doing something idiom\nsail\nsail close to the wind idiom\nskate\nSee more results »\nexpose verb [T]\n(MAKE PUBLIC)\nB2 to make public something bad or dishonest: The review exposed widespread corruption in the police force. The newspaper story exposed him as (= showed that he was) a liar.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\nsurface\ntip\ntranspire\nunravel\nSee more results »"}