{"id":148300,"name":"expression","type":"noun","us_sound":"ɪkˈspreʃ.ən","us_link":"../audio/e/expression.mp3","uk_sound":"ɪkˈspreʃ.ən","uk_link":"../audio/e/ukexpre003.mp3","content":"expression noun\n(SHOWING)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the act of saying what you think or showing how you feel using words or actions: expression of He wrote her a poem as an expression of his love. We've received a lot of expressions of support for our campaign.freedom of expression Freedom of expression is a basic human right.give expression to It's better to give expression to (= show) your anger, rather than hiding it.find expression formal His sadness at the death of his wife found expression (= was shown) in his music. She plays the violin with great expression (= feeling).\nB2 [ C ] the look on someone's face, showing what they feel or think: I could tell from her expression that something serious had happened. Mark always has such a miserable expression on his face.\nMore examplesFewer examplesI could tell from his grim expression that the news was not good.He listened to the music with an expression of pure rapture on his face.She looked at him with a surprised expression on her face.Modernism seeks to find new forms of expression and rejects traditional or accepted ideas.In this role, Durante is able to give full expression to that wonderfully virile voice.\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and showing feelings\nThe head & face\nexpression noun\n(WORDS)\nB2 [ C ] a word or group of words used in a particular situation or by particular people: He uses a lot of unusual expressions. \"A can of worms\" is an expression that means \"a difficult situation\".\nMore examplesFewer examplesThe expression \"boy band\" was coined in the 90s.There is no English equivalent for 'bon appetit' so we have adopted the French expression.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nhedge\nmotto\noperative\nphrase\nsentence\nslogan\nsubsentence\nthe operative word idiom\nto coin a phrase idiom\nTrumpism\nSee more results »\nexpression noun\n(NUMBERS)\n[ C ] in mathematics, a symbol or group of symbols that represent an amount: 4xy2 is an expression.\nSMART Vocabulary: related words and phrases\nMathematical symbols\naddition sign\ndegree\ndivision sign\nequal sign\nfoot\nminus\nmultiplication sign\noperator\npi\nplaceholder\nplus\npoint\nsolidus\nsubtraction sign\nvalue\nX, x\nY, y\nAdd to word list\nAdd to word list\n[ C ] a word or group of words having a particular meaning or used in a particular way: That was an expression he hadn’t heard before, and wondered what it meant.\n[ C ]\n&#160; mathematics An expression is also a mathematical statement that includes numbers, symbols, or both.\nexpression noun\n(SHOW)\n[ C/U ] the act of showing a feeling or idea, or a feeling or idea that is shown: [ C ] She had such a sad expression on her face that I wondered what was wrong. [ U ] Freedom of expression is a cherished right in democracies."}