{"id":148289,"name":"express","type":"verb","us_sound":"ɪkˈspres","us_link":"../audio/e/express.mp3","uk_sound":"ɪkˈspres","uk_link":"../audio/e/ukexpre001.mp3","content":"express verb [T]\n(SHOW)\nAdd to word list\nAdd to word list\nB2 to show a feeling, opinion, or fact: Her eyes expressed deep sadness. I would like to express my thanks for your kindness.express how Words can't express how happy I am.be expressed as These figures are expressed as a percentage of the total. express yourself\nB2 to communicate what you think or feel, by speaking or writing, or in some other way: I'm afraid I'm not expressing myself very clearly. Children often express themselves in painting. He felt he was unable to express himself freely when his boss was around. We were raised to debate issues and not to be afraid to express ourselves. Everyone she meets is impressed by the ease with which she expresses herself.\nMore examplesFewer examplesLike a lot of men, he finds it hard to express his emotions.She sent them a present to express her gratitude.He didn't express an opinion on the matter.My father found it hard to express his grief when my mother died.Many politicians and members of the public expressed outrage at the verdict.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nExpressing and showing feelings\nexpress verb [T]\n(SEND FAST)\nmainly US to send something somewhere very quickly: be expressed to Your order will be expressed to you within 24 hours.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair-dash\nbox scheme\nconsign\ncourier\ndispatch\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\nexpress adjective [before noun]\n(FAST)\nmoving or being sent fast: express delivery Please send this letter by express delivery.express train She took the overnight express train to Luxor.express service The dry cleaners offer a normal or an express service.\nSMART Vocabulary: related words and phrases\nFast and rapid\n(at) full speed/tilt/pelt idiom\napace\nas fast as your legs would carry you idiom\nas if it is going out of style idiom\nat a rate of knots idiom\nfleet\nhypersonic\nin the twinkling of an eye idiom\nJack Robinson\nlickety-split\nlight speed\nprompt\nsmartly\nsouped-up\nspanking\nspeed of light\nspread like wildfire idiom\nstreak\nsuper-express\nwildfire\nSee more results »\nexpress adjective [before noun]\n(CLEAR)\nclearly and intentionally stated: express wish It is my express wish that after my death, my books be given to my old college library.express purpose The lawyer argued that the accused had gone to the victim's house with the express purpose of killing her.\nSMART Vocabulary: related words and phrases\nEasy to understand\n(as) clear as day idiom\nabundantly clear\naccessible\naccessibly\nassimilable\ndigestible\nexplicitly\nexplicitness\nexpressly\nfathomable\nhang\nin words of one syllable idiom\nlimpid\npellucidly\nperspicuity\nperspicuous\nperspicuously\npikestaff\ntaut\nwell defined\nSee more results »\nusing a service that does something faster than usual: send something express Please can you send this parcel express?\nSMART Vocabulary: related words and phrases\nCommunications - the postal system\naddy\nBFPO\ncare of idiom\ncollection box\nconsignee\ndelivery\ndirect mail\ndispatch\nfirst class\nFreepost\nmail\nmail slot\npigeonhole\npostage\npostbox\npostmark\nself-addressed\nstamp\nwindow\nzip code\nSee more results »\n[ C ] a train or bus that takes less time to do a journey than other trains or buses: The quickest way to get here is to take the uptown express. the Orient Express\n[ U ] a service that does something faster than usual: by express This parcel needs to be sent by express.\nSMART Vocabulary: related words and phrases\nRailways: trains & parts of trains\nbogie\nbullet train\ncarriage\ncowcatcher\nemergency cord\nfootplate\nfreight car\nguard's van\ninterurban\nloco\nlocomotive\nluggage van\npassenger\npuffer train\nrolling stock\nshunter\nsleeper\nsleeping car\nsmoker\nthird rail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - the postal system\nexpress verb [T]\n(SHOW)\nAdd to word list\nAdd to word list\nto show a feeling or idea by what you say or do or by how you look: She’s expressed interest in doing some camping. Several victims expressed disappointment at the small amount of money they were offered. He wrote to express his sympathy after the death of her mother. The program tries to get students to express themselves verbally.\nexpress adjective\n(FAST)\n[ not gradable ] (esp. of transportation or a service) fast, or direct: The express train makes very few stops.\nexpress adjective\n(CLEAR)\nclearly and intentionally stated: It was her express wish that art collection be given to the university’s museum.\nexpress noun [C]\n(TRAIN/BUS)\na train or bus that does not stop at many places on its route and therefore is faster in getting people to where they want to go: Change here to get the express.\nAdd to word list\nAdd to word list\nto state an opinion or fact, or say how you feel about something: express doubts/reservations International observers had expressed growing doubts that the balloting would be fair. express appreciation/gratitude/satisfactionexpress interest He said that a Chinese technology company had expressed interest in acquiring an American manufacturer of disk drives.express concern Some board members expressed concern about the proposal.\nCOMMUNICATIONS, TRANSPORT to send a package or letter somewhere by a method that is faster than usual: She says she expressed the documents yesterday.\nto show an amount or quantity in a particular way: express sth as sth Expense ratios are a mutual fund's cost of doing business and are expressed as a percentage of your assets in the plan.express sth in sth The rates of duty listed below are expressed in pounds sterling.\nCOMMUNICATIONS, TRANSPORT sent using a service that sends packages and letters faster than is possible with the usual method: Did she send it by express mail? I have an express package for you.\nexisting for the purpose of doing something quickly: If you have bags to check, you can do it curbside or at the express check-in.\nTRANSPORT able to travel at a high speed and not stopping often : express buses\nLAW clearly stated and agreed, often as a part of a contract: All payments were made with the express approval of both governments. He will be the main witness at hearings, called for the express purpose of spotlighting his views on climate change. Compare\nimpliedSee also\nexpress condition\nexpress contract\nexpress term\nCOMMUNICATIONS, TRANSPORT using a service that sends packages and letters faster than is possible with the usual method: Send the letter express, next-day delivery.\n[ C ]\n&#160; TRANSPORT a fast train or bus that does not stop often: The express skips stops to make the trip faster.\n[ U ]\n&#160; COMMUNICATIONS, TRANSPORT a service that sends packages and letters faster than is possible with the usual method: The package should arrive by express today."}