{"id":148589,"name":"external","type":"adjective","us_sound":"ɪkˈstɝː.nəl","us_link":"../audio/e/eus71733.mp3","uk_sound":"ɪkˈstɜː.nəl","uk_link":"../audio/e/ukexten013.mp3","content":"Add to word list\nAdd to word list\nB2 of, on, for, or coming from the outside: external wall the external walls of the houseexternal to Female kangaroos carry their young in pouches that are external to their bodies.for external use This cream is for external use only (= it must not be put inside the body). In later years, his paintings began to show a number of external influences (= influences coming from other people).external affairs Most news magazines have a section devoted to external affairs (= foreign news).external appearances You shouldn't judge people by their external appearances (= what they appear to be like). See also\nexterior adjective\nMore examplesFewer examplesThis medicine is for external use only and should not be taken internally.The external part of the ear is far less important than the internal parts.If the device, for example a printer, has to be plugged into your computer, it is called an external device.There are no external symptoms of the disease for several weeks.These animals, known as arthropods, all have segmented bodies and an external skeleton.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsically\nforth\nindigenous\ninside\nnon-indigenous\nopen-air\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutta\nthence\ntherefrom\nSee more results »\nRelated word\nexternally\nAdd to word list\nAdd to word list\nexisting, intended for, or happening outside a person, organization, place, country, etc.: This skin cream is for external use only. She handles the company’s external relations. His paintings show external influences (= influences coming from other people). externally adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ekˈstɜr·nəl·i/\nAdd to word list\nAdd to word list\ncoming from outside a company, organization, or country: an external applicant/candidateexternal developments/events/forces A number of external developments help to explain why the country's economy under-performed compared to others. External demand for the products of industrial countries may decline in the longer term.\nIT used to describe equipment that connects to the outside of a computer: Use an external hard drive to back up your entire system. externally adverb uk/ɪkˈstɜːnəli/ us/-ˈstɝː-/\nexternally funded research Compare\ninternal"}