{"id":148522,"name":"extension","type":"noun","us_sound":"ɪkˈsten.ʃən","us_link":"../audio/e/extension.mp3","uk_sound":"ɪkˈsten.ʃən","uk_link":"../audio/e/ukexten002.mp3","content":"extension noun\n(REACH)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the fact of reaching, stretching, or continuing; the act of adding to something in order to make it bigger or longer: extension of something to someone Martin Luther King, Jr, campaigned for the extension of civil rights to (= for them to include) black people.extension of The extension (= increasing) of police powers in the province has been heavily criticized.by extension His report contained serious criticisms of the finance director, and, by extension (= therefore), of the entire board of management.extension of The article is an extension of (= takes further) the ideas Professor Fox developed in an earlier book.extension to I've applied for an extension to my visa (= asked for it to last longer). They are hoping to get an extension of their loan (= to be given a longer period of time in which to pay it back).\nMore examplesFewer examplesThe planned extension to the motorway near London is going to cost over £4 million.The boss is refusing to let us have any extension on the deadline for this job.The new job would involve a significant extension to your current area of responsibility.The company was granted an extension allowing it to continue using the old trains for a further three months.After three extensions to his job contract, he was told they would not be renewing it again.\nSMART Vocabulary: related words and phrases\nBecoming bigger\naccrete\naccrue\nanti-growth\nballoon\nbell\nbillow\nbump\nelongate\nengorged\nenlarge\nenlargement\nexpansion\npile\npile on the pounds idiom\npuff\npuff up\nput something on\nregenerate\nscalability\nstretch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAugmenting and supplementing\nextension noun\n(PHONE)\nB2 [ C ] any of two or more phones in the same house that share the same number, or any of a number of phones connected to a switchboard in a large building such as an office: We have an extension in our bedroom. When you call, ask for extension 3276.\nSMART Vocabulary: related words and phrases\nCommunications - telephone equipment\nanswering machine\nblower\nbrick\nburner\ncall box\ncell phone\ndevice\ndumbphone\nmouthpiece\nphablet\nplatform\npowerbank\nsim\nSIM card\nsmartphone\nspeakerphone\nswitchboard\ntelephone\ntelephone booth\ntelephone exchange\nSee more results »\nextension noun\n(COMPUTER)\n[ C ] the last part of the name of a computer file, which comes after a (.) and shows what type of file it is\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nextension noun\n(HAIR)\n[ C usually plural ] (also hair extension) a long piece of hair that is added to a person's own hair in order to make the hair longer\nSMART Vocabulary: related words and phrases\nHair\nanti-dandruff\nas bald as a coot phrase\nbaldness\nbedhead\ncoily\nfuzzy\nkink\nshaggy\nsideburns\ntash\ntextured\ntousle\ntousled\ntress\ntuft\nunkempt\nunshorn\nwavy\nwig\nwiry\nSee more results »\nextension noun\n(BUILDING)\n[ C ] UK (US addition) a new part added to a house or other building: extension to We're building an extension to our house.extension on We've paid off the amount we owed for building a two-storey extension on our home.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nAndrew_Howe/E+/GettyImages\nSMART Vocabulary: related words and phrases\nParts of buildings in general\naddition\nannex\nannexe\ndownstairs\nelevation\nfaçade\nfoundation\nfrontage\nJuliet balcony\nman cave\nmulti-chambered\norgan loft\nsuperstructure\nwing\nextension noun\n(stretch)\n[ C or U ] an exercise in which you extend (= stretch out) your arm or leg, or the act of extending your arm or leg: Extensions are good for strengthening pelvic floor muscles. leg extension Ask the instructor to show you how to do leg extensions. The shoulder starts to lock up, preventing him from getting full arm extension. See also\nhip extension\nMore examplesFewer examplesThe dancers were agile and excellent in their leg extensions and intricate footwork. You are going to get much more benefit from compound movements than from a leg extension.\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\ncross-trainer\ncurl\njerk\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nPilates\nSpinning\nsquat thrust\nstability ball\nstar jump\nsuperheavyweight\nSwiss ball\nSee more results »\nintended to support students' learning by making them try different or more difficult things in addition to their basic work: extension activity The book includes lesson plans and extension activities.\nUS (UK extramural) offered by a university to people who are not studying for a degree there : extension class She teaches an extension class on computer technology.extension course He took extension courses at the University of Minnesota for two years.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClasses & courses\nextension noun\n(PHONE)\nAdd to word list\nAdd to word list\n[ C ] (abbreviation ext.) any of two or more telephones in the same house that share the same number: We have an extension in our bedroom.\n[ C ] (abbreviation ext.) An extension is also any of the telephones connected to a central system, esp. in a business.\nextension noun\n(ADDITION)\n[ C/U ] an amount by which something is increased, or something added to something else: a contract extension I applied for an extension to my visa. [ C ] We’re building an extension on our house to enlarge the kitchen.\nAdd to word list\nAdd to word list\n[ C or U ] an increase in the period of time during which something is effective: grant/offer/receive an extension When it failed to meet the deadline, the company was granted an extension. a three-month/two-year, etc. extensionextension to sth The company has negotiated an extension to the deadline for its £275 million cash-and-paper offer, originally expected tomorrow.\n[ C or U ] the fact of giving or offering something to someone: This cheap, available money led to the extension of credit around the world.\n[ C ]\n&#160; COMMUNICATIONS\n&#160; ( abbreviation ext.); ( abbreviation xtn) one of the phones in a large building that have their own numbers and are connected to a switchboard (= a piece of equipment used to direct all phone calls): Please give me a call back at extension 1247. Can you put me through to Jan Robert's extension, please?\n[ C or U ] an increase in the size or range of something: Most banks are recognizing that customers view Internet banking as an extension of existing services. We are committed to the extension of this tax credit to cover all children born after April 2010. The engineers have begun working on an extension of the canal.\n[ C ]\n&#160; IT the last part of the name of a computer file, which comes after a dot (.), and shows what type of file it is: Be sure to leave the file extension unchanged.\n[ C ] UK ( US addition) a new part that is added onto a building: The bank syndicate will finance a $460 million extension to the car factory.\nSee also\nbrand extension"}