{"id":148503,"name":"extend","type":"verb","us_sound":"ɪkˈstend","us_link":"../audio/e/extend.mp3","uk_sound":"ɪkˈstend","uk_link":"../audio/e/ukexpre029.mp3","content":"extend verb\n(INCREASE)\nAdd to word list\nAdd to word list\nB2 [ T ] to add to something in order to make it bigger or longer: We have plans to extend our house (= to make it bigger). The government has produced a series of leaflets designed to extend (= increase) public awareness of the dangers of AIDS. We're planning to extend our publishing of children's books (= increase it).\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\nB2 [ T ] to make something last longer: The bar has recently extended its opening hours (= made them longer). I need to extend my visa (= make it last longer).\nMore examplesFewer examplesThey planned to extend the car park, freeing existing parking spaces for visitors.We had to wait months for the council to approve our plans to extend the house.The company is hoping to extend its market still further.The deadline for applications is being extended, in part because of the postal strike.\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\noutstretched\nreach\nspread\nstretch\nstretch (yourself) out\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nextend verb\n(STRETCH)\n[ T ] to stretch something out: We've extended a clothesline (= made it reach) between two trees in the garden. He extended his hand as a greeting (= held out his hand for someone to shake it).\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\noutstretched\nreach\nspread\nstretch\nstretch (yourself) out\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nextend verb\n(REACH)\nB2 [ I usually + adv/prep ] to reach, stretch, or continue: extend for The Sahara Desert extends for miles.extend beyond The path extends beyond the end of the road.extend to Rain is expected to extend to (= arrive in) all parts of the country by this evening. The effects of this legislation will extend (= reach) further than the government intends.\nMore examplesFewer examplesOur property extends as far as that line of trees over there.\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\noutstretched\nreach\nspread\nstretch\nstretch (yourself) out\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nextend verb\n(OFFER)\n[ T ] formal to offer or give something to someone: extend your thanks to someone I should like to extend my thanks to you for your kindness.extend a welcome to someone The chairperson extended a warm welcome to the guest speaker. The government is extending aid to people who have been affected by the earthquake. [ + two objects ] The bank has agreed to extend us money/extend money to us (= lend us money) to buy our house.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something in\nhand something out\nhand something over\nhand something round\ninvest\noutfit\nreassignment\nrebid\nregift\nregive\nregrant\nspare\nSee more results »\nextend verb\n(INCLUDE)\n[ I + adv/prep ] to include or affect someone or something: extend to Parking restrictions do not extend to disabled people. Her new-found tolerance does not extend to single mothers. The invitation did not extend to family members.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\ncast\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\npepper\nplug\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffecting and influencing\nextend verb\n(USE ABILITY)\n[ T ] to cause someone to use all their ability: She feels that her job doesn't extend her enough.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\ngrantsmanship\nseek\nshoot\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nstrain after/for effect idiom\nSee more results »\nextend verb\n(REACH)\nAdd to word list\nAdd to word list\n[ I/T ] to reach, continue, or stretch: [ I ] Farmland extends for miles in every direction. [ I ] The meeting extended into the late hours of the night. [ T ] He extended his hand to greet me.\nextend verb\n(INCREASE)\n[ T ] to add to something in order to make it longer; increase: The store has recently extended its hours. I might have extended this essay to include more information.\n[ T ] To extend something is also to increase its range so that it includes more: The proposed law would extend health insurance to all children.\nextend verb\n(OFFER)\n[ T ] to offer or give: I would like to extend my thanks to everybody for making this evening a success. We’d like to extend our condolences to the family.\nAdd to word list\nAdd to word list\n[ I or T ] to increase the period of time during which something is effective, or to last for a particular period of time: At present they are only open four days a week but they plan to extend their hours. extend an agreement/a contract/a deadlineextend sth from sth to sth Under the proposal the presidential term would be extended from five to six years.extend into sth It looks as if the final talks will extend into June.extend for sth Don't accept any loan that extends for more years than you plan to keep the car.\n[ T ] to give or offer something to someone: extend benefits/coverage The proposal would extend medical insurance coverage to 95% of the population, including every child.extend credit By buying and packaging mortgages, Wall Street enabled the lenders to extend credit even as the dangers grew in the housing market.\n[ T ] to increase the size or range of something: The company's premises have been extended. The company's own-label range has been extended to include a dining line. The two educators are responsible for extending college business programs beyond the classroom."}