{"id":148555,"name":"exterior","type":"adjective","us_sound":"ɪkˈstɪr.i.ɚ","us_link":"../audio/e/eus71731.mp3","uk_sound":"ɪkˈstɪə.ri.ər","uk_link":"../audio/e/ukexten009.mp3","content":"Add to word list\nAdd to word list\non or from the outside: In some of the villages the exterior walls of the houses are painted pink.exterior to Exterior to the main house there is a small building that could be used as an office or studio. Synonyms\nexternal\nouterOpposites\ninner\ninterior\nMore examplesFewer examplesThey usually put a protective coating on the exterior surface of the walls.It can be hard to prove because this type of torture usually leaves no exterior marks.The car had a certain amount of exterior damage, but could be repaired.We'll need to hire a professional window cleaner to do the exterior windows.This practical all-weather jacket has three zipped inside pockets, as well exterior pockets.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexteriority\nexteriorly\nextrinsically\nforth\nindigenous\ninside\nnon-indigenous\nopen-air\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutta\nthence\ntherefrom\nSee more results »\nC1 the outside part of something or someone: The Palace of Fontainebleau has a very grand exterior.exterior of The exterior of the house needs painting.on the exterior of There are shutters on the exterior of the windows. Behind that cold exterior there's a passionate man.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexteriority\nexteriorly\nextrinsically\nforth\nindigenous\ninside\nnon-indigenous\nopen-air\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutta\nthence\ntherefrom\nSee more results »\nAdd to word list\nAdd to word list\nouter; on or from the outside: The exterior walls of the house are painted pink. exterior noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ekˈstɪər·i·ər/\nThe exterior of the house needs painting."}