{"id":148541,"name":"extent","type":"noun","us_sound":"ɪkˈstent","us_link":"../audio/e/extent.mp3","uk_sound":"ɪkˈstent","uk_link":"../audio/e/ukexten005.mp3","content":"Add to word list\nAdd to word list\nB2 area or length; amount: the full extent of From the top of the Empire State Building, you can see the full extent of Manhattan (= the area it covers).the extent of We don't yet know the extent of his injuries (= how bad his injuries are). Rosie's teacher was impressed by the extent of her knowledge (= how much she knew).in extent The River Nile is over 6,500 kilometres in extent (= length). the extent to which\nC2 the degree to which something happens or is likely to happen: She had not realized the extent to which the children had been affected.\nSee more to the extent of\nso strongly that: Some people hold their beliefs very strongly, even to the extent of being prepared to go to prison for them.\nSee more to the extent that\nto a particular degree or stage, often causing particular results: Sales have fallen badly this year, to the extent that we will have to close some of our shops.\nSee more to the same extent\nto the same degree as; as much as: The rich will not benefit from the proposed changes to the tax system to the same extent as the lower paid.\nSee more to some extent\nB2 partly: To some extent, she was responsible for the accident.\nSee more to such an extent\nso much: The car was damaged to such an extent that it couldn't be repaired.\nSee more to what extent?\nhow much: To what extent will the budget have to be modified?\nSee more\nMore examplesFewer examplesThe full extent of the damage only became evident the following morning.He unwound the rope to its full extent.Ethiopia and, to a lesser extent, Kenya will be badly affected by the drought.The mood of the meeting turned solemn when the extent of the problem became known.The extent of the flooding can only be fully appreciated when viewed from the air.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrength\nSee more results »\nextent noun [U]\n(AREA)\nAdd to word list\nAdd to word list\nthe area, length, or size of something: Approaching the airport, you could see the full extent of the island.\nextent noun [U]\n(DEGREE)\nthe degree or limit of something; how great or severe something is: To some extent it was my fault, though I didn’t mean any harm. We didn’t know the extent of his injuries. It makes sense to a certain extent to write down everything."}