{"id":148710,"name":"extra","type":"adjective","us_sound":"ˈek.strə","us_link":"../audio/e/extra.mp3","uk_sound":"ˈek.strə","uk_link":"../audio/e/ukexten030.mp3","content":"Add to word list\nAdd to word list\nA2 added to what is normal: If you need any extra help, just call me. Recently he's been working an extra two hours a day. The price includes travel and accommodation but meals are extra (= there is an additional charge for meals).\nslang too extreme and not suitable; making too much effort, or demanding too much effort and attention: Olivia's so extra - she built a model of an island when she only needed to do a rough sketch.\nMore examplesFewer examplesHe punished the class by giving them extra work.Being a single parent qualifies you for extra benefits.She waited on tables to earn some extra money.I've put a T-shirt on under my sweater for extra warmth.Have you warned them that there will be an extra person for dinner?\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExaggerating & playing down\nIdiom\ngo the extra mile\nB1 more: They pay her extra to work nights. We agreed on a price but afterwards they wanted £10 extra. I worked extra hard (= more than usual) on that essay.\nMore examplesFewer examplesDo you have to pay extra for installation?It won't cost much extra, so we might just as well stay for another night.They charge extra for any additional passengers.The hotel is full at the moment - we're extra busy because it's the tourist season.I only expected her to help with the children, but she did so much extra around the house.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nextra noun\n(SOMETHING MORE)\nB1 [ C ] something that you can get with something else if you pay a little more money: optional extra A sunroof is an optional extra on this model of the car.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\nMore examplesFewer examplesThe price of the holiday includes flights, full board, and all extras.When we'd added up all our extras, the hotel bill was enormous.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nextra noun\n(FILMS)\nC1 [ C ] a person in a film who does not have a speaking part and who is usually part of the scene, for example, in a crowd\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: actors & performers\nextra noun\n(CRICKET)\n[ C usually plural ] in cricket, a point that a team scores that is not from a hit made by a batter (= a player who tries to hit the ball) Synonym\nsundries\nSMART Vocabulary: related words and phrases\nCricket\n12th man\nbails phrase\nball-tampering\nbatswoman\nbatting average\nbowl someone out\nbreak\ncut\ndeclare\ndeep\nforward\nglance\nlength\nmaiden\npavilion\ntest match\nuppish\nuppishly\nwalk\nwicketkeeper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlso, extra, and in addition\noutside or in addition to: extraterrestrial beings (= imaginary creatures which come from outside the planet Earth) an extramarital affair (= a sexual relationship of a married person with someone other than their husband or wife) extracurricular activities (= activities which are not part of the usual school or college course)\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsay\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\nSee more results »\nAdd to word list\nAdd to word list\nadded, additional, or more than expected: Some students needed extra help. He’s been working an extra two hours a day. I bought some extra batteries.\nsomething that is added when you pay for goods or a service: We didn’t get any extras on our new car except for the CD player.\nAn extra is also a person in a movie who does not have a speaking part and is usually in the background or in a crowd.\nAdd to word list\nAdd to word list\nmore than or added to what is usual or what already exists: Without the extra help, campus leaders may face tough choices, such as whether to cut some programs. extra cash/funding/money extra compensation/income/pay extra charge/expense/fee\ngo the extra mile\nto make more effort than is expected of you: Our state government functions as well as it does because our employees routinely go the extra mile.\nmore than is usual or than exists already: The average family of four is spending anywhere from $7 to $10 extra a week on groceries alone, compared to a year ago. I'm quite happy to pay extra if the quality is right.\nsomething that is added to what is usual, and that may cost more: Borrowers are already burdened with mortgage extras such as arrangement fees, legal bills, and life assurance cover. The telephone call charges seem reasonable but there is the hidden extra of a £35 connection charge. On average, £1,700 of optional extras are ordered on every car that leaves the plant.\noutside or in addition to: Because schools rely heavily on property taxes to fund extracurricular activities, districts in less affluent areas are struggling to fund them.\nvery, or more than usual: The city passed an ordinance that requires economic impact studies for Supercenters and other extra-large stores."}