{"id":148858,"name":"extraordinary","type":"adjective","us_sound":"ɪkˈstrɔːr.dən.er.i","us_link":"../audio/e/extraordinary.mp3","uk_sound":"ɪkˈstrɔː.dɪn.ər.i","uk_link":"../audio/e/ukextra014.mp3","content":"Add to word list\nAdd to word list\nB1 very unusual, special, unexpected, or strange: He told the extraordinary story of his escape. Her voice had an extraordinary hypnotic quality. an extraordinary coincidence Opposite\nunextraordinary\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nextraordinary meeting mainly UK\na special meeting that happens between regular meetings: He presided over an extraordinary meeting of the country's leading clergy.\nSee more\nMore examplesFewer examplesWe witnessed the extraordinary sight of an old lady climbing a tree to rescue her cat.The rain forest is home to many extraordinary creatures.She has an extraordinary memory and can remember details and names that I've long forgotten.Whatever is that extraordinary object in the sky?Eastern Europe was completely transformed by the extraordinary events of 1989 and 1990.\nSMART Vocabulary: related words and phrases\nUnique and unusual\naccidental\nalt-\nalternative\natypically\nbe marked out as something idiom\nguerrilla\nincongruous\ninimitable\ninimitably\nirreplaceable\npersonalized\nquaintly\nquaintness\nquirkily\nquirkiness\nuniquely\nunmatchable\nunmatched\nunparalleled\nunrivalled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural\nAdd to word list\nAdd to word list\nvery unusual and special; different in type or greater in degree than the usual or ordinary: Being chairman gave him an extraordinary sense of power. She was an extraordinary woman, and no one will ever forget her. extraordinarily adverb us\nYour browser doesn't support HTML5 audio\n/ɪkˌstrɔr·dənˈer·ə·li/\nAdd to word list\nAdd to word list\nvery unusual, special, or unexpected: extraordinary accomplishment/achievement/effort It's an extraordinary accomplishment to be able to run a successful project for 40 years. After a rough start, this year is shaping up to be a year of extraordinary growth for the company.\n[ before noun ]\n&#160; ACCOUNTING used to describe a large cost or loss that does not happen regularly: The oil spill was handled as an extraordinary expense - a non-recurring, one-time event.\n[ before noun ] used to describe something that does not happen regularly but that is arranged for a special purpose: They convened an extraordinary meeting of shareholders to discuss the issue."}