{"id":149191,"name":"fabricate","type":"verb","us_sound":"ˈfæb.rɪ.keɪt","us_link":"../audio/f/fabricate.mp3","uk_sound":"ˈfæb.rɪ.keɪt","uk_link":"../audio/f/ukeyeto012.mp3","content":"Add to word list\nAdd to word list\nto invent or produce something false in order to deceive someone: He was late, so he fabricated an excuse to avoid trouble. He claims that the police fabricated evidence against him.\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\nespecially US to produce a product, especially in an industrial process: The company fabricates and sells steel. An electronic circuit is fabricated on a silicon wafer.\nThesaurus: synonyms, antonyms, and examples\nto build somethingbuildThe house was built in the 1950s.constructThe company wants to construct a 175-mile pipeline.put something upPutting up a wall will not solve the problem.erectIt's unlawful to erect a building until you get approval.assembleHe has a job assembling furniture in a warehouse.put togetherWithout the instruction sheet, I've got no idea how to put all these parts together.\nSee more results »\nSMART Vocabulary: related words and phrases\nLies, lying & hypocrisy\na pack of lies idiom\nartifice\nbad faith\nblack is white idiom\ncakeism\ncanard\nfalsification\nfeed someone a line idiom\nfib\nfiction\nflimflam\nlie\nmythologize\nperjure\nperjury\npolygraph\nstretch the truth idiom\nweasel words\nwhite lie\nwhopper\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nRelated words\nfabrication\nfabricator\nAdd to word list\nAdd to word list\nto invent or produce something in order to deceive: She fabricated charges that her boss was stealing money. fabrication noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˌfæb·rɪˈkeɪ·ʃən/\nThat story is a complete fabrication.\nAdd to word list\nAdd to word list\nPRODUCTION to manufacture something: Techniques for fabricating microchips on circuits are advancing all the time. The company's main business is fabricating metal parts for the aerospace industry.\nto invent a story or create a piece of false evidence in order to deceive someone: It turned out that all the qualifications in his application had been fabricated."}