{"id":149225,"name":"face","type":"noun","us_sound":"feɪs","us_link":"../audio/f/face.mp3","uk_sound":"feɪs","uk_link":"../audio/f/ukeyeto017.mp3","content":"face noun\n(HEAD)\nAdd to word list\nAdd to word list\nA1 [ C ] the front of the head, where the eyes, nose, and mouth are: She has a long, thin face.on your face She had a puzzled expression on her face.\nMichael Blann/Iconica/GettyImages\nA1 [ C ] an expression on someone's face: I was greeted by smiling faces. I could see from his face he was unhappy. make a face\nB1 (UK also pull a face) to make a strange expression with your face, for example to show that you do not like someone or something: I was making silly faces to get the baby to laugh.\nSee more\nMore examplesFewer examplesThere was a look of intense concentration on her face.The rain beat against her face as she struggled through the wind.She had a look of utter devastation on her face.She slapped him across the face.It was so cold that he wrapped a scarf tightly around his face.\nSMART Vocabulary: related words and phrases\nThe head & face\n-cheeked\n-chinned\n-faced\n-necked\ncheek\nchinless\nchiselled\nchop\ndimpled\nduck face\nfrontal\njaw\njowl\nmaxillary\nmaxillofacial\nmodiolus\nnucha\nvisage\nzygomatic\nzygomaticus\nSee more results »\nface noun\n(FRONT)\n[ C ] the front or surface of an object: face of the north face of a mountain the west face of the building\n[ C ] the front of a clock or watch that has the numbers or marks that show what time it is: a watch face with Roman numerals\nByoungJoo/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe north face of the Eiger is a very difficult climb.She abseiled down the rock face.When she received her prize I think I was the proudest parent on the face of the earth.The postcard shows a view of the magnificently carved west face of the cathedral.I rather like that watch with the square face and roman numerals.\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nback\nbase\nbases\nbed\ncrust\nescutcheon\nfront\nmeniscus\nmulti-sided\nnap\nobverse\noutside\noverlay\nplate\nrear\nside\nsubstrate\nsuperficialis\nsurface area\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWatches & clocks\nface noun\n(RESPECT)\nC2 [ U ] the respect and honour of others: lose face He thinks he would lose face if he admitted the mistake.save face She tried to save face by inventing a story about being overseas at the time.\nSMART Vocabulary: related words and phrases\nShowing respect and admiration\nadmiration\nadmire\nadmiring\nadmiringly\napproving\napprovingly\nforelock\nfreedom\nfulsome\nfulsomely\nfulsomeness\nglorify\ngrovelling\npay your respects idiom\nphilogyny\nput someone on a pedestal idiom\nregild\nrespectfully\nretire a number idiom\nworshipful\nSee more results »\nIdioms\nbe in someone's face\nin your face\ndisappear off the face of the earth\nkeep a straight face\nsomeone's face doesn't fit\nsomeone's face falls\nthe face of something\nget out of my face!\nhave a face like the back end of a bus\nin the face of something\nMore idioms\non the face of it\nto someone's face\nface verb\n(DEAL WITH)\nB2 [ T ] If you face a problem, or a problem faces you, you have to deal with it: This is one of the many problems faced by working mothers. Passengers could face long delays.be faced with You're faced with a very difficult choice there.\nB2 [ T ] to accept that something unpleasant is true and start to deal with the situation: face the fact that I think Phil has to face the fact that she no longer loves him.face facts We have to face facts here - we simply don't have enough money.face the truth He's dying but he refuses to face the truth.\nThesaurus: synonyms, antonyms, and examples\nto accept or continue in a situation that is difficult or unpleasantbearI will bear the responsibility for whatever happens.endureShe endured years of hip pain before seeing a surgeon.sufferShe suffers from severe asthma. acceptI have finally accepted that I can't change who he is.resign yourself toI have resigned myself to the fact that I'll never work again.become resigned toPeople have become resigned to the fact that increased security means much longer wait times at airports.\nSee more results »\ncan't face something/doing something\nB2 to not want to do or deal with something unpleasant: I can't face walking up all those steps again.\nSee more\nC2 [ T ] to deal with someone when the situation between you is difficult: She half hoped he would not find her, though she knew she would have to face him sooner or later.\nMore examplesFewer examplesSome of the leaders of the coup took their lives rather than face dishonour.Teachers who fail to fall in line with the new regulations may face dismissal.There's a law to protect refugees from forcible return to countries where they face persecution.He is fighting extradition to Hong Kong to face trial on fraud charges.I can't face the hassle of moving house again.\nSMART Vocabulary: related words and phrases\nDealing with things or people\naddressable\napproach\nattack\nattend to someone/something\nbe all over it idiom\nbeard the lion (in his/her den) idiom\nbed\ncut\ngrip\nhave it out with someone idiom\nhold\nhold on idiom\nI/I've got this idiom\nill-prepared\nsquare\ntend to someone/something\nto get a handle on something idiom\nto have a handle on something idiom\ntough\ntough something out\nSee more results »\nface verb\n(TURN TOWARDS)\nB1 [ I usually + adv/prep, T ] to turn or be turned towards something physically; to be opposite something: The balcony faced towards the sea. Our apartment faces south. Their houses face each other across the street.\nMore examplesFewer examplesHe made towards the door, but stopped and turned to face me.The balcony faces west.She turned around so that she was facing her opponent.She wheeled round to face him and saw him take out a gun.The window of their hotel room faced the sea.\nSMART Vocabulary: related words and phrases\nDirection of motion\nabduct\nabduction\nadduct\nadduction\naround\ncircumduction\ncross-country\ndestined\ndirection\ndirection of travel\nen route\nfollow\ngo\ninto\nmultidirectional\noutbound\noverland\nright\nstraightly\nthe right/wrong/other way around idiom\nSee more results »\nface verb\n(BUILDING)\n[ T ] If you face a building, you put an extra layer in front of what is already there: faced in/with The house was built of wood but faced in/with brick.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: construction work & workers\nIdioms\nface the music\nlet's face itPhrasal verbs\nface off\nface up to something\nface noun [C]\n(HEAD)\nAdd to word list\nAdd to word list\nthe front of the head including the eyes, nose, and mouth: Cal hid his face in his hands.\nface noun [C]\n(FRONT)\nthe front or surface of an object: We climbed the north face of Mount Washington.\nThe face of a clock or a watch is the surface that has the numbers or marks on it that show what time it is. Idioms\nat face value\nface the music\nface-to-face (with someone)\nface-to-face (with something)\nin your face\nin the face of something\non the face of it\nto someone’s face\nface verb\n(DEAL WITH)\n[ T ] to deal with a difficult situation: They are faced with major financial problems. I can’t face climbing those stairs again.\nface verb\n(BE POSITIONED)\n[ I/T ] to have the front of something positioned toward, or to turn toward something or someone: [ I always + adv/prep ] The balcony faces south. [ T ] Please face the front of the room. Phrasal verb\nface down someone/something"}