{"id":149296,"name":"facility","type":"noun","us_sound":"fəˈsɪl.ə.t̬i","us_link":"../audio/f/eus71751.mp3","uk_sound":"fəˈsɪl.ə.ti","uk_link":"../audio/f/ukeyeto030.mp3","content":"facility noun\n(BUILDING)\nAdd to word list\nAdd to word list\nB1 [ C ] a place, especially including buildings, where a particular activity happens: a nuclear research facility a military facility a new sports facility facilities B1 [ plural ]\nthe buildings, equipment, and services provided for a particular purpose: shopping facilities\nSee more the facilities\n[ plural ] a polite way of referring to a toilet in a public place: There is no running water in the annex, so students have to go over to the main buildings to use the facilities.\nSee more\nMore examplesFewer examplesProtesters have been demonstrating outside the new research facility.The training facility is scheduled to open in April 2005.New vehicles are inspected at the company's inspection facility.The hotel offers exceptional sporting facilities, including a 50 metre swimming pool.The maintenance facility is situated behind the main offices.\nSMART Vocabulary: related words and phrases\nBuildings in general\n-bedroomed\nbeach hut\nbuilding\nbunkhouse\ncampanile\ngeodesic dome\nhalf-timbered\nheritage\nheritage-listed building\nhigh-rise\nnon-residential\nnon-structural\nNorman\nobservation tower\noutstation\nresidential\nstructure\ntower\nturreted\nwarren\nSee more results »\nfacility noun\n(ABILITY)\nB2 [ C or U ] an ability to do something easily or well: facility for His facility for languages is astonishing.\n[ C or U ] a feature of a product that allows you to do something: a computer with a speech recognition facilityoverdraft facility UK He asked the bank to increase his overdraft facility.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nforte\nfunctional skills\nfunctioning\ngenius\ngift\npolish\nprestidigitation\nproficiency\nprowess\npyrotechnic\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nfacility noun\n(ABILITY)\nAdd to word list\nAdd to word list\n[ U ] an ability or skill at doing something: His facility for memorizing dates was astonishing.\nfacility noun\n(PLACE)\n[ C ] something such as a place, building, or equipment used for a particular purpose or activity: The new sports facility has a swimming pool.\nfacilities\nAdd to word list\nAdd to word list\n[ plural ] equipment, rooms, etc. that are provided for people to use: The community center has some of the newest equipment and best facilities in town. Are non-members allowed to use the facilities? recreational/sports/leisure facilities bathroom/washing/toilet facilities\n[ C ] a building or area that is used for a particular activity or purpose: The company is building a $4m training facility in Oakland. She works as a chaplain in a juvenile detention facility.\n[ C ]\n&#160; FINANCE, BANKING an arrangement that lets someone borrow money from a bank or other financial institution for an agreed period of time or up to a particular amount: a borrowing/overdraft/credit facility Do you have an overdraft facility on your account? The company has secured a $2m debt facility from another bank.\n[ C ] a special feature on a machine, computer, piece of software, etc. that enables you to do something: Another useful facility of the software is an embedded dictionary."}