{"id":149359,"name":"factor","type":"noun","us_sound":"ˈfæk.tɚ","us_link":"../audio/f/factor.mp3","uk_sound":"ˈfæk.tər","uk_link":"../audio/f/ukfacin008.mp3","content":"factor noun [C]\n(FACT)\nAdd to word list\nAdd to word list\nB2 a fact or situation that influences the result of something: People's voting habits are influenced by political, social and economic factors.contributing factor Heavy snow was a contributing factor in the accident.major factor Price will be a major factor in the success of this new product.crucial factor Grades are still a crucial factor in determining who gets into which university.deciding factor The economy is regarded as the deciding factor in the outcome of the election.key factor Production costs are the key factor in determining price.feel-good factor informal The movie's success is largely due to its feel-good factor (= its ability to make people feel happy).\nMore examplesFewer examplesDiet and exercise can influence a person's weight, but heredity is also a factor.Smoking is a causative factor in the development of several serious diseases, including lung cancer.Too little exercise is a contributory factor in heart disease.The environmental argument was a deciding factor.We need to take a lot of factors into account in our decision-making.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nfactor noun [C]\n(NUMBER)\nmathematics\n&#160; specialized in mathematics, any whole number that is produced when you divide a larger number by another whole number: Two, three, four and six are all factors of twelve.\na particular level on some systems of measurement: a wind chill factor of -20UK a factor 20 suntan cream by a factor of\nIf an amount becomes larger or smaller by a factor of a particular number, it becomes that number of times larger or smaller: Cases of leukaemia in the area near the nuclear reactor have risen by a factor of four.\nSee more\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nreciprocal\nrecurring\nrecurring number\nremainder\nresponse variable\ntwentyfold\ntwofold\nweighting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements in general\nfactor noun\n(SITUATION)\nAdd to word list\nAdd to word list\n[ C ] a fact or situation that influences a result: Economic factors had a lot to do with their decision to sell the company.\nfactor noun\n(NUMBER)\n[ C ]\n&#160; algebra a number or variable (= letter or symbol) that is being multiplied in a product (= result of multiplying): In 6×3=18, 6 and 3 are factors of the product 18.\n[ C ]\n&#160; algebra A factor of a product is a number that the product can be divided by exactly.\nAdd to word list\nAdd to word list\none of several things that affects or influences a situation: Increasing use of online newspapers was definitely a contributing factor to the company's collapse. a key/significant/major factor a critical/crucial factor a deciding/decisive factor\nFINANCE\n&#160; (also invoice factor) a business that buys the right to collect debts for another company and charges for collecting them: Using a factor can be a good way of getting better cashflow.\nthe amount that a number is multiplied or divided by: a factor of 3/10/75, etc. You should reduce your final figures by a factor of three.\nCOMMERCE a company or person that sells goods produced by another company using their own name, usually for payment\nthe . . . factor\nsomething special that a product, idea, person, etc. has that makes them successful or makes people notice them: What's missing from this organization is the leadership factor. Her latest fashion collection certainly has the wow factor. See also\nadjustment factor\ncritical success factor\nfeelgood factor\nhygiene factor\nload factor\nmotivator factor\nweighting factor\nFINANCE to sell the right to collect payments and debts owed to your company or organization to another business: How many of their operations are factored? Factoring is just one way of raising capital in the short term.\nPhrasal verb\nfactor sth in"}