{"id":149324,"name":"fact","type":"noun","us_sound":"fækt","us_link":"../audio/f/fact.mp3","uk_sound":"fækt","uk_link":"../audio/f/ukfacin003.mp3","content":"Add to word list\nAdd to word list\nA2 something that is known to have happened or to exist, especially something for which proof exists, or about which there is information: No decision will be made until we know all the facts.fact about I don't know all the facts about the case.the fact that I'm not angry that you took my car - it's just the fact that you didn't ask me first.know for a fact He knew for a fact (that) Natalie was lying. It's sometimes hard to separate fact from fiction. as a matter of fact B1 (also in (actual) fact)\nused to add emphasis to what you are saying, or to show that it is the opposite of or different from what went before: I don't work. In fact, I've never had a job.\nSee more a fact of life\nsomething unpleasant that cannot be avoided: Going bald is just a fact of life.\nSee more facts and figures\nexact detailed information: We are getting some facts and figures together and we will then have a full board meeting.\nSee more the facts of life\ndetails about sexual activity and the way that babies are born: He decided to have a talk with his son about the facts of life.\nSee more\nMore examplesFewer examplesThe fact that Debbie is always late has become a joke among her friends.Two opposed interpretations of the facts have been presented.I'm not calling you a liar - I'm just suggesting that you misunderstood the facts of the situation.He said that he wasn't completely sure of his facts.I think there is one key fact that you have overlooked.\nSMART Vocabulary: related words and phrases\nReality and truth\nactuality\napothegm\nauthenticity\naxiomatically\nfacticity\nhome truth\nimmediacy\nimpostor syndrome\nit is what it is idiom\nMcCoy\nrealia\nreality\nslice\nthe real McCoy\nthe real thing\nthe real world phrase\ntruth will out idiom\nveracity\nverisimilitude\nverity\nSee more results »\nGrammar\nIn factIn fact is a discourse marker. …\nAdd to word list\nAdd to word list\nsomething known to have happened or to exist: No one disputes the fact that the accident could have been avoided. Idioms\nfact of life\nfacts of life\nin fact"}