{"id":149404,"name":"faculty","type":"noun","us_sound":"ˈfæk.əl.t̬i","us_link":"../audio/f/eus71755.mp3","uk_sound":"ˈfæk.əl.ti","uk_link":"../audio/f/ukfacin015.mp3","content":"faculty noun\n(ABILITY)\nAdd to word list\nAdd to word list\nC1 [ C usually plural ] a natural ability to hear, see, think, move, etc.: have all your faculties Even at the age of 100, she still had all her faculties. Is he in command/possession of all his faculties (= can he still hear, speak, see, and think clearly)?\n[ C ] a special ability to do a particular thing: faculty for She has a faculty for inspiring confidence in people.sharpen someone’s critical faculties Studying has certainly sharpened my critical faculties (= taught me to think carefully about things using my judgment).\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nforte\nfunctional skills\nfunctioning\ngenius\ngift\npolish\nprestidigitation\nproficiency\nprowess\npyrotechnic\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nfaculty noun\n(IN EDUCATION)\nB2 [ C or U ] mainly US (UK usually staff, teaching staff) the people who teach in a university, college, or US high school, or in one of its departments : She is joining the faculty of the University of Washington. faculty member He has been a faculty member for 20 years.\nC1 [ C ] mainly UK (US usually college, school) a group of departments in a university or college that specialize in a particular subject or group of subjects: the Faculty of Science/Arts the Psychology/Law Faculty\nMore examplesFewer examplesHe's applied for a job in the history faculty.See the faculty website for more details.The faculty has decided to close the common room.She received a generous research grant from the faculty.Work has begun on the construction of the new faculty building.\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhousemaster\nhousemistress\ninstructor\nlecturer\nlectureship\nmentor\nresidence\nschoolie\nschoolmarm\nschoolmaster\nschoolmistress\nscribe\nsubstitute\ntutor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUniversity & college education\nfaculty noun [C]\n(COLLEGE TEACHERS)\nAdd to word list\nAdd to word list\nthe people who teach in a college or university, or in a department of a college or university\nfaculty noun [C]\n(ABILITY)\nany natural ability, such as hearing, seeing, or thinking: Even though she is 102, she still has all of her faculties."}