{"id":149426,"name":"fade","type":"verb","us_sound":"feɪd","us_link":"../audio/f/fade.mp3","uk_sound":"feɪd","uk_link":"../audio/f/ukfacin025.mp3","content":"fade verb [I or T]\n(BECOME LESS)\nAdd to word list\nAdd to word list\nB2 to (cause to) lose colour, brightness, or strength gradually: If you hang your clothes out in the bright sun, they will fade. My suntan is already fading. They arrived home just as the light was fading (= as it was getting dark). The sun had faded the blue walls.\nMore examplesFewer examplesMany of these problems may simply fade into irrelevance when the new rules come into force.My memory of childhood fades as time goes by.Her worries about her job have faded into the background since she learned about her father's illness.Hope is fading that the missing child is still alive.As she drifted into sleep, the doctor's face began to blur and fade.\nSMART Vocabulary: related words and phrases\nColourless or causing colour to fade\nashen-faced\nbleach\ncolourlessly\ndiscoloration\ndiscolour\ndrab\ndrably\ndrabness\ndull\nfrost\nghostly\nlighten\nmuted\npale\npalish\npastel\nsubdued\nwashed out\nwashy\nweathered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making less strong\nfade verb [I or T]\n(GOLF)\nIn golf, if you fade the ball, you hit it so it moves slightly to one side rather than straight in front. If a golf ball fades, it moves slightly to one side: Trying to fade the ball off the tee, he hooked into deep rough. By aiming down the left-hand side, the ball will fade back into the middle of the fairway. See also\nslice\nMore examplesFewer examplesTo fade the ball, you would still aim the clubface at the target, but this time the feet, knees, hips, and shoulders would aim off to the left of the target.The drive is tricky because you must fade the ball to end up in a flat spot about 280 yards out.His shot faded to the right and plunged into a greenside pond.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nIdiom\nbe fading away/fastPhrasal verbs\nfade away\nfade (something) in\nfade (something) out\nfade noun\n(GRADUAL CHANGE)\n[ C ] a gradual loss of colour or brightness, often until an image disappears: A fade to black would be a good way to end the sequence.fade out At that point there is a fade out so what happens next is left to our imaginations.\n[ C ] a way of ending a piece of music by making it gradually quieter and quieter: At the end of the song we just repeat the chorus until the fade. The software allows you to make fades and segue the songs together. a fade in\na gradual increase in colour, brightness, or loudness so that a picture or sound appears gradually: You could begin your web page with a fade in, allowing the visitor to concentrate on one important point before seeing the rest of the page content.\n[ C ] a gradual loss of strength or importance: That was when his career began its slow fade into obscurity. See also\nbrain fade\nMore examplesFewer examplesAt that point the scene goes into a fade until the screen turns black and the credits come up.By now, the tulips in the garden had begun their fade and the alliums were on the way in.\nSMART Vocabulary: related words and phrases\nColourless or causing colour to fade\nashen-faced\nbleach\ncolourlessly\ndiscoloration\ndiscolour\ndrab\ndrably\ndrabness\ndull\nfrost\nghostly\nlighten\nmuted\npale\npalish\npastel\nsubdued\nwashed out\nwashy\nweathered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making less strong\nBecoming and making smaller or less\nRecording sounds and images\nIncreasing and intensifying\nfade noun\n(HAIR)\n[ C ] a hairstyle in which the hair is left fairly long on top of the head, cut gradually shorter at the sides, and cut very short or completely removed lower down: At the barber shop you can get a fade for £20. The boys all had fades.\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nblow-dry\nbowl cut\nchignon\nhair extension\nhaircut\nhairdo\nkiss curl\nplait\npompadour\npony\npudding basin\nrelaxed\nshake out\nsidelock\nundercut\nSee more results »\nfade noun\n(GOLF)\n[ C or U ] in golf, the action of hitting the ball slightly to one side rather than straight in front, or the movement of the ball slightly to one side: He said he was trying to draw the ball rather than hit a fade. All you need is about two yards of fade on your ball and it's gone. See also\nslice\nMore examplesFewer examplesShe has added a soft fade on tee shots and approaches. If you overcook a fade, your next shot will be a sideways recovery. He has been hitting a lot of fade shots as he has cleverly worked his way round the course.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nfade noun\n(AMERICAN FOOTBALL)\nin American football, a passing move where the player receiving the ball runs straight at first but then moves towards the side of the playing area to catch the ball: Wideout Marvin Davis was supposed to run a fade towards the right-hand corner. The touchdown on a fade to Miller turned out to be the winning score.\nMore examplesFewer examplesA fade is often the go-to move when close to the end zone and you have a tall wide receiver.The quarterback saw Williams on the fade route but ignored him and scrambled for seven yards.\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\npick\nrush\nscrimmage\nsplit end\nSuper Bowl\ntouchdown\nSee more results »\nAdd to word list\nAdd to word list\nto lose color, brightness, or strength gradually: If you hang your clothes out in the bright sun, they will fade.\nIf something fades away/out, it becomes less clear and then disappears: The voice on the radio faded out."}