{"id":149555,"name":"failure","type":"noun","us_sound":"ˈfeɪ.ljɚ","us_link":"../audio/f/failure.mp3","uk_sound":"ˈfeɪ.ljər","uk_link":"../audio/f/ukfagge007.mp3","content":"failure noun\n(NO SUCCESS)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the fact of someone or something not succeeding: complete failure The meeting was a complete/total failure.total failure Now she finally had to admit that the project had been a total failure.failure at I'm a bit of a failure at making (= I cannot make) cakes.feel a failure I feel such a failure (= so unsuccessful) after losing my job.end in failure Their attempt to climb Everest ended in failure.doomed to failure The whole project was doomed to failure right from the start (= it could never have succeeded).\nThesaurus: synonyms, antonyms, and examples\nthe fact of not being successfulfailureFailure is not an option.breakdownThe complete breakdown of local infrastructure left residents without water or electricity.meltdownThe markets experienced a meltdown at the news of the sale. collapseThe car manufacturer's collapse left the region's economy in tatters. failHe tried to sing the anthem, but it was an epic fail.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that is not successfulfailureThe shuttle launch was a complete failure.successThe operation was a success.turkeyI really wanted to like it, but that show ended up being a real turkey.clunkerUS That pitch was a real clunker. bombUS His website was one of the biggest dotcom bombs in the history of the internet.dudMy charger doesn't work - I think I've got a dud.\nSee more results »\nMore examplesFewer examplesAnother crop failure could result in widespread famine.The computer failure was due to a glitch caused by lightning.The failure of the monsoon would destroy harvests on which 1000 million people rely.The words 'Hard disk failure - program aborted' popped up on the screen.The probable cause of death was heart failure.\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nfailure noun\n(NOT DO)\nB2 [ U + to infinitive ] the fact of not doing something that you must do or are expected to do: failure to His failure to return her phone call made her realize that something was wrong. Failure to keep the chemical at the right temperature could lead to an explosion.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not doing something you shouldfailureFailure to follow the employee guidelines can lead to your immediate termination.defaultThe bank seized his house because his mortgage was in default.malpracticeThe surgeon was sued for malpractice.derelictionHe was dishonourably discharged for dereliction of duty.neglectCorruption and neglect resulted in a government that was weakened enough to be overthrown. negligenceEducational standards deteriorated thanks to the negligence of the administration.\nSee more results »\nMore examplesFewer examplesThere are serious penalties for failure to comply with the regulations.The team blamed injuries and lack of preparation for their failure to win.He was disappointed by his failure to secure the top job with the bank.I regarded her failure to acknowledge my greeting as a slight.The Opposition is making a lot of political capital out of the government's failure to invest in education.\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nfailure noun\n(STOP)\nB2 [ C or U ] the fact of something not working, or stopping working as well as it should: heart failure He died of heart failure.kidney failure Hypertension can lead to stroke, heart attack, and kidney failure.liver failure Hepatitis A can cause sickness, diarrhoea, jaundice, and even liver failure. The accident was caused by the failure of the reactor's cooling system.business failure The number of business failures rose steeply last year.crop failure After three crop failures in a row, the people face starvation.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak\nbreak down\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nfailure noun\n(LACK OF SUCCESS)\nAdd to word list\nAdd to word list\n[ C/U ] a lack of success in doing something: [ U ] Their attempt to sail across the Atlantic Ocean ended in failure. [ C ] He was a failure as a businessman.\nfailure noun\n(SOMETHING NOT DONE)\n[ U ] the fact of not doing something you should have done: [ + to infinitive ] His failure to return her phone call told her that something was wrong.\nfailure noun\n(SOMETHING NOT WORKING)\n[ C/U ] the fact of something not working as it should: [ U ] He died of heart failure. [ C ] The new computer system was a complete failure (= It did not work).\nAdd to word list\nAdd to word list\n[ C or U ] a situation in which a company has been unsuccessful and has to stop operating: The number and seriousness of the bank failures took economists by surprise. We're finally seeing a slowdown in the rate of business failures. See also\naudit failure\nmarket failure\n[ U ] lack of success in trying to do something: If you're too scared of failure, you'll never try to achieve anything.\n[ U ] a situation in which a machine or system stops working: The cause of the crash is now thought to be engine failure.\n[ C ] someone or something that is not successful: He always thought of himself as a failure.\nfailure to do sth\na situation in which someone does not do something they should do or are expected to do: The banks' failure to regulate more reckless lending led directly to the financial crisis."}