{"id":149542,"name":"fail","type":"verb","us_sound":"feɪl","us_link":"../audio/f/fail.mp3","uk_sound":"feɪl","uk_link":"../audio/f/ukfagge004.mp3","content":"fail verb\n(NOT SUCCEED)\nAdd to word list\nAdd to word list\nB2 [ I ] to not succeed in what you are trying to achieve or are expected to do: She moved to London in the hope of finding work as a model, but failed. This method of growing tomatoes never fails.fail in He failed in his attempt to break the record. [ + to infinitive ] She failed to reach the Wimbledon Final this year.doomed to fail The reluctance of either side to compromise means that the talks are doomed to (= will certainly) fail.\nThesaurus: synonyms, antonyms, and examples\nto not work or happen as intendedfailWe tried our best, but ultimately the project failed.fall apartThings were going smoothly until we hired him, and now everything is falling apart.fall to piecesThe plan has potential, but unless we proceed carefully, it could fall to pieces. fall throughOur plans to visit fell through at the last minute.crackThe Liberal Party is cracking under the pressure of these allegations.\nSee more results »\nif all else fails\nif none of our plans succeed: If all else fails, we can always stay in and watch TV.\nSee more\nMore examplesFewer examplesIf you fail these exams, you can resit them next year.It doesn't matter if you fail, just do your best.I shudder to think what my parents will say when I tell them I've failed my exams.Agricultural companies have failed to convince consumers that GM foods are safe.If this project fails it will affect not only our department, but also the whole organization.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »\nfail verb\n(EXAM)\nA2 [ I or T ] to be unsuccessful, or to judge that someone has been unsuccessful, in a test or exam: fail in UK I passed in history but failed in chemistry.US I passed history but failed chemistry. A lot of people fail their driving test the first time. She was sure she was going to fail. The examiners failed him because he hadn't answered enough questions.\nMore examplesFewer examplesHe's dreading his driving test - he's sure he's going to fail.Just because you wrote one bad essay, it doesn't mean you're going to fail your exam.If you fail these exams, you can resit them next year.I'm not surprised he failed his exam - he didn't exactly try very hard!She knew that by failing her exams she could jeopardize her whole future.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nmoderate\noral\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nfail verb\n(NOT DO)\nB2 [ I ] to not do something that you should do: [ + to infinitive ] He failed to arrive on time.fail to The staff had been promised a rise, but the money failed to (= did not) materialize. You couldn't fail to be (= it is impossible that you would not be) affected by the movie.fail in I'd be failing in my duty if I didn't tell you about the risks involved in the project. fail to see/understand\nC2 used when you do not accept something: fail to see/understand why I fail to see why you can't work on a Saturday.\nSee more\nMore examplesFewer examplesHe has failed to fulfil his duties as a father.The guards failed to observe who delivered the package.Man's inhumanity to man never fails to shock me.Wages are failing to keep up with inflation.The police pulled him over for failing to stop at a red traffic light.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nmess\nrot\nrunning on empty idiom\nsclerotic\nscrew\nthe rot sets in idiom\nSee more results »\nfail verb\n(STOP)\nB2 [ I ] to become weaker or stop working completely: If my eyesight fails, I'll have to stop doing this job. The brakes failed and the car crashed into a tree. After talking non-stop for two hours, her voice started to fail.fail fast The old man was failing fast (= he was dying).\nThesaurus: synonyms, antonyms, and examples\nto break downbreak downThe lift has broken down again.stop workingI don’t understand it - my phone just stopped working.crashWhen a computer crashes, you reboot.failThe train’s brakes failed, causing it to derail.\nSee more results »\n[ I ] If a business fails, it is unable to continue because of money problems.\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nhedge\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - not functioning\nSuccess & failure in business\nfail verb\n(NOT HELP)\n[ T ] to not help someone when you are expected to do so: He failed her in her moment of need.courage fails When I looked down and saw how far I had to jump, my courage failed me (= I felt very frightened).\nSMART Vocabulary: related words and phrases\nDisappointing yourself and others\nabjectly\nanticlimactic\nanticlimax\nbe cracked up to be something idiom\nbe one in the eye for someone idiom\nbreak\nbubble\ndash\ndisappointingly\ndisappointment\ndisenchantment\ndishearten\ndisheartening\neye\nleave someone in the lurch idiom\nlet someone down\nlet the side down idiom\nletdown\nnon-event\nsick\nSee more results »\nUK an unsuccessful result in a course, test, or exam: get a fail John got three passes and four fails in his exams.\ninformal something that has been done very badly or gone completely wrong; a failure: epic fail My pancakes were an epic fail (= completely unsuccessful). The software crashes every time I open an email. What a fail.\nThesaurus: synonyms, antonyms, and examples\nthe fact of not being successfulfailureFailure is not an option.breakdownThe complete breakdown of local infrastructure left residents without water or electricity.meltdownThe markets experienced a meltdown at the news of the sale. collapseThe car manufacturer's collapse left the region's economy in tatters. failHe tried to sing the anthem, but it was an epic fail.\nSee more results »\nSMART Vocabulary: related words and phrases\nFailures\nanother/the final nail in the coffin idiom\nbloodbath\nbrain freeze\nbreakdown\nbusted flush\ncar crash\nflop\nfoul (something) up\nfreefall\ngame over idiom\nhash\nlemon\nloser\nlost cause\nparody\npratfall\nreversal\nslim pickings\nslush pile\ntrack record\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nwithout fail\nIf you do something without fail, you always do it: I go to the gym every Monday and Wednesday, without fail.\nused to tell someone that they must do something: Be there at nine o'clock, without fail.\nSee more\nfail verb\n(NOT SUCCEED)\nAdd to word list\nAdd to word list\n[ I ] to not be able to do what you are trying to achieve or are expected to do: [ + to infinitive ] She applied to Harvard University but failed to get accepted.\n[ I ] If you fail to see/understand what something is, you do not agree with someone’s description of a situation: [ + to infinitive ] I fail to see what the problem is (= I don’t think there is a problem).\nfail verb\n(NOT PASS)\n[ I/T ] to be unsuccessful, or to judge that someone has been unsuccessful in a test or examination: [ I/T ] A lot of people fail (their driving test) the first time. [ T ] She said she would fail any student who misses two exams.\nfail verb\n(NOT DO)\n[ I/T ] to not do something that should be done: [ + to infinitive ] He promised to help, but failed to send a check. [ + to infinitive ] She never fails to meet a deadline.\n[ I/T ] To fail is also to not help someone when expected to: [ T ] He failed her when she most needed him.\nfail verb\n(STOP)\n[ I ] to become weaker or stop working completely: The bus driver said the brakes failed.\n[ I ] If a business fails, it is unable to continue because of money problems. failing adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈfeɪ·lɪŋ/\nHe is in failing health and seldom goes outside any more.\nAdd to word list\nAdd to word list\n[ I ] to not succeeed in something you are trying to do: fail to do sth They failed to reach an agreement with the board members. fail in sth Last year the company failed in its bid to renew their contract. All their efforts seem to have failed. Some employees will not take risks because they're scared of failing.\n[ I ] if a business fails, it is unsuccessful and cannot continue to operate: Over 3000 small businesses failed in the first quarter of the year. Is it better for the economy to let unsuccessful companies fail or to bail them out?\n[ I or T ] to not pass an exam or test, or not reach a necessary standard: About half of all candidates taking the more advanced exams fail. The company repeatedly failed inspections by Health and Safety officials.\n[ I ] if a machine or system fails, it stops working: If the system fails for any reason, the emergency back-up will kick in.\n[ I ] formal to not do something that you should do: fail to do sth What can be done about clients who fail to pay their debts? See also\ntoo big to fail"}