{"id":149574,"name":"faint","type":"adjective","us_sound":"feɪnt","us_link":"../audio/f/faint.mp3","uk_sound":"feɪnt","uk_link":"../audio/f/ukfagge009.mp3","content":"faint adjective\n(SLIGHT)\nAdd to word list\nAdd to word list\nB2 not strong or clear; slight: a faint sound/noise/smell The lamp gave out a faint glow. She gave me a faint smile of recognition. There's not the faintest hope of ever finding him. She bears a faint resemblance to my sister.faint suspicion I have a faint suspicion that you may be right!\nThesaurus: synonyms, antonyms, and examples\nmaking little or no noisequietThere was a quiet tapping at the door.silentThe stadium fell silent after the goal was scored.soft\"Come here!\" he said in a soft voice.muffledI could hear muffled voices from the next room.faintThere was the faint sound of traffic in the distance.\nSee more results »\nnot have the faintest idea C2 informal\nused to emphasize that you do not know something: \"Is she going to stay?\" \"I haven't the faintest idea.\"\nSee more\nMore examplesFewer examplesThe first faint signs of an agreement began to glimmer through.She heard a faint, almost imperceptible cry.They said the printing was too faint to reproduce well.She felt a faint stirring of envy when she heard that one of her colleagues had been promoted.A gap between the curtains admitted the faint glow of a street lamp.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakling\nweakly\nweakness\nweedy\nwetly\nSee more results »\nfaint adjective\n(UNWELL)\nfeel faint\nC2 to feel weak, as if you are about to become unconscious: She felt faint with hunger.\nSee more Idiom\nfaint heart never won fair lady/maiden\nB2 to suddenly become unconscious for a short time, usually falling down: He faints at the sight of blood. I nearly fainted in the heat.faint (dead) away UK She took one look at the hypodermic needle and fainted (dead) away (= became unconscious immediately).\nMore examplesFewer examplesHis face went pale and he looked as if he might faint.You gave us a real scare when you fainted, you know.He caught me at the precise moment that I fainted.By the middle of the next day she was almost fainting from hunger.I stood up too quickly and very nearly fainted.\nSMART Vocabulary: related words and phrases\nLosing consciousness\nblack\nconcuss\nconcussed\nconcussion\nconk out\ngo out like a light idiom\nhypnotic\nhypnotically\ninsensibility\nknock\nknock someone out\nlight\nnon-responsive\npass\npass out\nsenseless\nstun\nswoon\nunresponsive\nunresponsiveness\nSee more results »\nthe act of suddenly becoming unconscious: fall into a dead faint On receiving the news, she fell into a dead faint. Synonym\nswoon old-fashioned literary\nSMART Vocabulary: related words and phrases\nLosing consciousness\nblack\nconcuss\nconcussed\nconcussion\nconk out\ngo out like a light idiom\nhypnotic\nhypnotically\ninsensibility\nknock\nknock someone out\nlight\nnon-responsive\npass\npass out\nsenseless\nstun\nswoon\nunresponsive\nunresponsiveness\nSee more results »\nfaint verb [I]\n(LOSE CONSCIOUSNESS)\nAdd to word list\nAdd to word list\nto become unconscious unexpectedly for a short time: I nearly fainted from the heat.\nfaint adjective [-er/-est only]\n(SLIGHT)\nnot strong or clear; slight: He walked along, guided only by the faint light of the moon.\nfaint adjective [-er/-est only]\n(WEAK)\nvery weak and nearly becoming unconscious: He felt faint from hunger."}