{"id":149595,"name":"fair","type":"adjective","us_sound":"fer","us_link":"../audio/f/fair.mp3","uk_sound":"feər","uk_link":"../audio/f/ukfagge012.mp3","content":"fair adjective\n(RIGHT)\nAdd to word list\nAdd to word list\nB1 treating someone in a way that is right or reasonable, or treating a group of people equally and not allowing personal opinions to influence your judgment: a fair trialit's not fair Why should I have to do all the cleaning? It's not fair!fair on It's not fair on Joe (= it is not right) to make him do all the work!fair that It's not fair that she's allowed to go and I'm not!fair to It's not fair to blame me for everything!scrupulously fair with She's scrupulously fair with all her employees (= she treats them all equally).fair comment UK She claims her article was a fair comment on (= a reasonable thing to say about) a matter of public interest.fair deal He offered to do all the cleaning if I did all the cooking, which seemed like a fair (= reasonable) deal.\nB1 If something is fair, it is reasonable and is what you expect or deserve: fair price I thought it was a fair price that she was offering.fair share I'm willing to do my fair (= equal) share of the work.fair wage All the workers want is a fair wage for the work that they do.\nIf a game or competition is fair, it is done according to the rules: It was a fair fight. it's only fair\nit is the right way to treat someone and what they deserve: I think it's only fair to tell you that we have had over 300 applications for this job.\nSee more it's fair to say\nit is true to say: I think it's fair to say (that) you've done less of the work than I have.\nSee more to be fair\nconsidering everything that has an effect on a situation, so that a fair judgment can be made: He's done the job badly but, to be fair, I gave him very little time to do it.\nSee more fair enough B2 UK informal\nsomething you say to show that you understand why someone has done or said something: \"I'm just annoyed with him because he's behaved so badly.\" \"Fair enough.\"\nSee more fair's fair informal (UK also fair dos)\nsomething that you say when you want someone to behave reasonably or treat you the same as other people: Come on, it's my turn. Fair's fair!\nSee more a fair hearing\nan opportunity to explain something or give your opinions, without other people trying to influence the situation: get a fair hearing He didn't think that he got a fair hearing in court.\nSee more fair and square\nin an honest way and without any doubt: We won the match fair and square.\nUK (US squarely) If you hit someone fair and square on a particular part of their body, you hit that person hard, exactly on that part: He hit me fair and square on the nose.\nSee more\nMore examplesFewer examplesA fair justice system is a fundamental part of a civilized society.I suppose his criticism was fair comment .Everyone should have a fair slice of the cake.They claimed that the election had been fair, but really it was a sham.This job has more than its fair share of frustrations.\nSMART Vocabulary: related words and phrases\nJustice and fairness\nall's fair in love and war idiom\nanti-bias\nanti-discrimination\nanti-egalitarian\nanti-nepotism\ndo justice to someone/something idiom\ndue process\nEDI\nEDIB\negalitarian\nfairness\nget your just deserts idiom\nit's a fair cop idiom\njustice\njustness\nsportsmanlike\nsportsmanship\nunbought\nundemocratically\nwithout fear or favour idiom\nSee more results »\nfair adjective\n(PALE)\nA2 (of skin) pale, or (of hair) pale yellow or gold: She's got fair hair and blue eyes. a fair complexion My sister has dark hair but my brother's fair (= he has fair hair).fair-haired He's fair-haired.fair-skinned All my family are fair-skinned.\nSMART Vocabulary: related words and phrases\nHair colour\nash blonde\nashy\nauburn\nbalayage\nblonde\nblondes have more fun idiom\nblondie\nbronde\nbrunette\ncarroty\nchestnut\ncolouring\nflaxen\ngray\nmousy\nperoxide blonde\nplatinum blonde\nsalt-and-pepper\nsandy\nTitian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe skin, & skin colour\nfair adjective\n(QUITE LARGE)\nC2 [ before noun ] quite large: fair amount We've had a fair amount of rain this week.fair number We've had a fair number of applicants.fair-sized It's a fair-sized garden.fair way We've come a long way, but there's still a fair way (= quite a long distance) to go.\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nfair adjective\n(AVERAGE)\nC2 [ after verb ] neither very good nor very bad: Films are rated on a scale of poor, fair, good and excellent.fair at I was fair at science but it was never my thing.\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nSMART Vocabulary: related words and phrases\nQuite good, or not very good\nacceptable\nacceptably\nadequacy\nadequate\nadequately\nhalf decent\niffy\nimpure\nindifferent\nindifferently\npassably\npatchily\npatchiness\npatchy\npresentably\nspotty\nthe/your average bear idiom\nunspectacular\nup to scratch idiom\nweedy\nSee more results »\nfair adjective\n(QUITE GOOD)\n[ before noun ] (of an idea, guess, or chance) good, but not excellent: fair idea I think I've got a fair idea of (= I understand reasonably well) what you want.fair chance She's got a fair chance of winning (= there is a reasonable chance that she will win).\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\ntip\nSee more results »\nfair adjective\n(WEATHER)\n(of weather) pleasant and dry: Fair weather was forecast for the following day.\nSMART Vocabulary: related words and phrases\nDescribing good weather\nanticyclone\nbe set fair idiom\nbone dry idiom\ncalm\nclear\nclemency\nclement\ncloudless\nfine\nglorious\ngloriously\nmild\nmildness\nnon-hostile\nset\nsettled\nsummery\nsun-drenched\nsunny\ntemperate\nSee more results »\nfair adjective\n(BEAUTIFUL)\nold use or literary (of a woman) beautiful: a fair maiden\nSMART Vocabulary: related words and phrases\nAttractive\nadorable\nadorably\nadorbs\naesthetic\naesthetically\ndelicate\ndisarming\ndisarmingly\ndistinguished\ndreamy\nloveliness\nlovely\nlusciously\nmagnetically\nmagnificent\nstunningly\nsuave\nsuavely\nsuit\nsuper-cute\nSee more results »\nIdioms\nall's fair in love and war\nby fair means or foul\na fair crack of the whip\nfair to middling\nit's a fair cop\nwith your own fair hand(s)\na large public event where goods are bought and sold, usually from tables that have been specially arranged for the event, and where there is often entertainment: craft fair I bought a wooden salad bowl at the local craft fair.\nB1 (UK also funfair); (US also carnival) an outside event where you can ride on large machines for pleasure and play games to win prizes\nOliver Vorspohl/EyeEm/GettyImages\nC1 a large show at which people who work in a particular industry meet, and sell and advertise their products: a book/antiques/toy fair a trade fair\na public event in the countryside where farm animals and farm products are sold: US a county/state fairUK a cattle/agricultural fair\n(UK also fete) a public event, often held outside, where you can take part in competitions and buy small things and food, often organized to collect money for a particular purpose: the school fair\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmasquerade\nmela\nstreet party\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShops & auctions\nfair adjective\n(RIGHT)\nAdd to word list\nAdd to word list\n[ -er/-est only ] treating someone in a way that is right or reasonable, or treating people equally and not allowing personal opinions to influence your judgment: All he asks is a fair chance to prove his innocence. I’m willing to do my fair share of the work (= equal part).\n[ -er/-est only ] If a game or competition is fair, it is done according to the rules: It was a fair fight.\n[ -er/-est only ] In some sports, esp. baseball, fair means within the playing field: The umpire ruled it a fair ball.\nfair adjective\n(AVERAGE)\n[ not gradable ] neither very good nor very bad: He’s good in physics but only fair in math.\nfair adjective\n(LARGE)\n[ not gradable ] large or great in comparison: We still had a fair amount of foreign money when we returned.\nfair adjective\n(CORRECT)\n[ not gradable ] likely to be correct; accurate: The architect’s drawing will give you a pretty fair idea of what the completed house will look like.\nfair adjective\n(WEATHER)\n[ -er/-est only ] (of weather) pleasant and dry\nfair adjective\n(PALE)\n[ -er/-est only ] (of skin) pale, or (of hair) light in color: If you have fair skin, you’ll get a sunburn easily.\nIdiom\nfair and square\nfair noun [C]\n(PUBLIC EVENT)\na public event, usually held outside, where goods and sometimes farm animals are shown and sold and where there is often food and entertainment county/state fair\nA county/state fair is one where farm animals and products from that region are shown to compete for prizes and there is food and entertainment. street fair\nA street fair is one where a city street is closed to cars so that goods and food can be sold to people walking through it.\nA fair is also a show at which people who work in a particular industry meet to sell and advertise their products: a book/antiques/toy fair\nAdd to word list\nAdd to word list\ntreating people equally and in a way that is right and reasonable: It's the government's job to make sure that the tax system is fair and equitable.be fair on sb The new regulations are not fair on working parents. Everyone has the right to a fair trial. Corporations must pay their fair share of the cost of the construction work.\na fair price, wage, rent, etc. is not too high or too low: All we're asking for is a fair wage. Local growers must be given a fair price for their produce.\nCOMMERCE, MARKETING a large event at which manufacturers, business people, and individuals advertise and sometimes sell their products and services: The Battersea Contemporary Art Fair is one of the largest in the UK."}