{"id":149633,"name":"fairly","type":"adverb","us_sound":"ˈfer.li","us_link":"../audio/f/fairly.mp3","uk_sound":"ˈfeə.li","uk_link":"../audio/f/ukfagge015.mp3","content":"fairly adverb\n(QUITE)\nAdd to word list\nAdd to word list\nB1 more than average, but less than very: She's fairly tall. I'm fairly sure that this is the right address. We get on fairly well. I saw her fairly recently.\nUK literary used to emphasize figurative expressions that describe what people or objects are doing: The answer fairly jumps off the page at you! The dog fairly flew out of the door to greet him.\nMore examplesFewer examplesThey have always dealt honestly and fairly with their customers.Journalists are meant to report fairly and impartially on every story.There is no pride in winning a game if you know you haven't won fairly.The defendant was not treated fairly by his employer and should not have lost his job.All complaints will be dealt with quickly and fairly.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\ncertain\nfaintly\nha'porth\nhalfway\nish\nlightly\nlittle\nmildly\npretty\nquite\nrather\nremotely\nseveral\nsome\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlmost\nfairly adverb\n(IN THE RIGHT WAY)\nB2 If you do something fairly, you do it in a way that is right and reasonable and treats people equally: be treated fairly He claimed that he hadn't been treated fairly by his employers. Officials will ensure that the election is carried out fairly. fairly and squarely UK (US squarely)\ncompletely: She lays the blame for the recession fairly and squarely on the government.\nSee more\nSMART Vocabulary: related words and phrases\nJustice and fairness\nall's fair in love and war idiom\nanti-bias\nanti-discrimination\nanti-egalitarian\nanti-nepotism\ndo justice to someone/something idiom\ndue process\nEDI\nEDIB\negalitarian\nget your just deserts idiom\nit's a fair cop idiom\njustice\njustness\nkarma\nsportsman\nsportsmanlike\nsportsmanship\nundemocratically\nwithout fear or favour idiom\nSee more results »\nGrammar\nFairlyWe use fairly as an adverb meaning ‘in a way which is right and just’: …\nfairly adverb\n(IN THE RIGHT WAY)\nAdd to word list\nAdd to word list\nin a way that is right or reasonable and treats people equally : It’s the responsibility of a judge to treat both sides fairly.\nfairly adverb\n(TO SOME DEGREE)\n[ not gradable ] more than a little; to some degree: I know him fairly well. I saw her fairly recently (= not very long ago)."}