{"id":149652,"name":"faith","type":"noun","us_sound":"feɪθ","us_link":"../audio/f/faith.mp3","uk_sound":"feɪθ","uk_link":"../audio/f/ukfagge021.mp3","content":"faith noun\n(TRUST)\nAdd to word list\nAdd to word list\nB2 [ U ] great trust or confidence in something or someone: have faith in She has no faith in modern medicine.great faith in You'll cope - I have great faith in you.lose faith in After the trial, his family said they had lost all faith in the judicial system.restore someone's faith in Politicians must start keeping their promises if they want to restore the people's faith in government.\nMore examplesFewer examplesThe leader's speech was impressive and confirmed her faith in the party.The people have no faith in their government, and herein lies the root of the problem.All her life she had implicit faith in socialism.When the drugs failed to cure her, she put her faith in herbal medicine.It was apparent that the captain had little faith in the rest of the team.\nSMART Vocabulary: related words and phrases\nTrusting and not trusting\naccept/take something on faith idiom\nbank\nbank on someone/something\nbelieve\nbelieve in something\ndistrustful\ndistrustfully\nhave faith! idiom\nI wouldn't trust someone as far as I could throw them idiom\nkeep faith with something/someone idiom\nmistrustfully\nnon-confidence\nnot trust someone an/one inch idiom\nput/place your faith in something/someone idiom\nreliance\ntrustable\nturn to someone/something\nuntrusting\nuntrustworthiness\nuntrustworthy\nSee more results »\nfaith noun\n(RELIGION)\nB2 [ C ] a particular religion: the Muslim/Christian/Jewish/Buddhist faith They were persecuted for their faith.practise your faith He was forced to practise his faith in secret.multi-faith society The government must recognize that we now live in a multi-faith society.the true faith They were brought up in the true faith (= the religion which the speaker believes is the only true one).\nB2 [ U ] strong belief in God or a particular religion: lose your faith Even in the bad times she never lost her faith. Her faith in God was shattered when her baby died. It's my faith that keeps me going.\nMore examplesFewer examplesProtestantism and Roman Catholicism are both denominations of the Christian faith.In a multicultural society is it not anomalous to have a blasphemy law which only protects one religious faith?He views his life as a spiritual journey towards a greater understanding of his faith.She was sustained by the strength of her religious faith.She is a pious follower of the faith, never missing her prayers.\nSMART Vocabulary: related words and phrases\nReligions & religious groups\nAbrahamic\nAfrican Methodist Episcopal Church\nAME\nanti-Catholicism\nanti-Christianity\nevangelicalism\nfaith-based\nFree Church\nGnosticism\nmulti-religious\nneo-paganism\nnon-established\npaganism\nPentecostalism\nSufism\nSunni\nsuper-church\nTaoism\nTaoist\nthe God squad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious beliefs & atheistic beliefs\nIdioms\naccept/take something on faith\nfaith can move mountains\nhave faith!\nkeep faith with something/someone\nput/place your faith in something/someone\nfaith noun\n(TRUST)\nAdd to word list\nAdd to word list\n[ U ] a high degree of trust or confidence in something or someone: [ + that clause ] I have faith that she will do the right thing.\nfaith noun\n(RELIGION)\n[ C/U ] a particular religion, or belief in God: [ C ] the Christian/Jewish/Muslim faith [ C ] We welcome people of all faiths. [ U ] Put your faith in God.\nAdd to word list\nAdd to word list\na feeling of trust that something will be successful, that people will do what they promise to do, etc.: have faith in sb/sth Board members insisted they had absolute faith in the current management team.put your faith in sb/sth You can't ask customers to put their faith in a product that hasn't been properly tested.lose faith in sb/sth Stock holders seem to have lost faith in the banking sector. See also\nbad faith\nduty of faith\ngood faith"}