{"id":149760,"name":"fall","type":"verb","us_sound":"fɑːl","us_link":"../audio/f/fall.mp3","uk_sound":"fɔːl","uk_link":"../audio/f/ukfalaf005.mp3","content":"fall verb\n(HAVE AN ACCIDENT)\nAdd to word list\nAdd to word list\nA2 [ I ] to suddenly go down onto the ground or towards the ground without intending to or by accident: The path's very steep, so be careful you don't fall. He fell badly and broke his leg. Athletes have to learn how to fall without hurting themselves. The horse fell at the first fence.fall down I fell down the stairs and injured my back.fall from The object appeared to have fallen from a great height.fall in The water's deep here, so don't fall in!fall on She slipped and fell on the ice.fall into He fell into the river and had to be rescued.fall off I fell off my bike and scraped my knee.fall out He was leaning out of the window and almost fell out.fall under She fell under a bus and was killed instantly.fall to She fell five metres to the bottom of the ravine.fall to your death He fell to his death climbing the Matterhorn.\nThesaurus: synonyms, antonyms, and examples\nto go down onto the ground suddenlyfallShe slipped and fell.dropSeveral apples dropped from the tree.collapseSeveral buildings collapsed in the earthquake.crumpleHe fainted and crumpled into a heap on the floor.tumbleA huge rock tumbled down the mountain.plungeFour of the mountaineers plunged to their deaths when their ropes broke.\nSee more results »\nfall flat on your face informal\nto fall and land with your face down: Poor Kathy fell flat on her face in the mud.\nSee more\nMore examplesFewer examplesKeep away from the edge of the cliff - you might fall.Hold onto the rail so that you don't fall.They were mocking him because he kept falling off his bike.She knocked her head against the wall as she fell.We heard a splash and then saw that Toni had fallen in the river.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\nfall verb\n(BECOME LOWER)\nB1 [ I ] to become lower in size, amount, or strength: Demand for new cars has fallen due to the recession. The standard of his work has fallen during the year. Salaries in the public sector are expected to fall by 15 percent this year.fall below The temperature could fall below zero overnight.fall by Average temperatures fell by ten degrees.fall to The pound has fallen to its lowest-ever level against the dollar.fall to a whisper When the teacher walked in, the children's voices fell to a whisper (= they became very quiet).fall sharply Share prices fell sharply this week.\nThesaurus: synonyms, antonyms, and examples\nto become smaller or lessdecreaseThe tests show that the tumour has decreased in size since we started treatment. lessenA healthy diet lessens your risk for cardiovascular disease.lowerThey've just lowered the age at which you can join.reduceThey've just reduced the price.bring downThey are bringing down their prices.dropStock prices dropped today after the company's announcement.\nSee more results »\nMore examplesFewer examplesThe temperature has fallen below zero recently.Inflation has fallen below 2%, and that's official.The flood waters fell, depositing mud over the whole area.Many economists expect unemployment to fall over the next couple of months.If your bank account balance falls below the minimum, you'll be nicked for a $5 service charge.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\nfall verb\n(COME DOWN)\nA2 [ I ] to come down onto the ground or from a high position to a lower position: The snow had been falling steadily all day. It was October and the leaves had started to fall.fall into She fell into bed, completely exhausted.fall on A bomb fell on the church and destroyed it.fall to A huge meteor fell to Earth in the middle of the desert. He begged for mercy as the blows fell on him (= as he was being hit). fall to your knees (also fall down on your knees)\nto go down on your knees to show respect or gratitude: The people all fell to their knees and began to pray.\nSee more\n[ I ] When the curtain falls in the theatre, it comes down because the play or performance has ended: The audience was still laughing as the curtain fell.\nMore examplesFewer examplesAlthough the curtain has now fallen on the Republican era, many of its values still remain.The fact that aircraft don't fall out of the sky always seems to me to defy the law of gravity.The satellite will fragment and burn up as it falls through the earth's atmosphere.Her luxuriant hair fell around her shoulders.Rain had been falling steadily all day and the ground had become a marsh.\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nspiral\ntouch\ntouch down\nSee more results »\nfall verb\n(BELONG TO)\n[ I usually + adv/prep ] to belong to a particular group, subject, or area: fall into The material falls into three categories.fall outside Matters of discipline fall outside my area of responsibility.\nMore examplesFewer examplesThey believe that all the outstanding issues should fall within the ambit of the talks.What genre does the book fall into - comedy or tragedy?This case falls outside the purview of this particular court.The matter falls outside his area of jurisdiction.This research paper falls outside my own area of expertise.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nfall verb\n(BECOME)\nB1 [ I + adv/prep, L ] to change to a particular condition from a different one: fall asleep He always falls asleep after drinking red wine.fall ill She suddenly fell ill.fall open The book fell open (= opened by chance) at a picture of Venice.fall silent The president has fallen strangely silent on the issue of gun control.fall due UK Your rent falls due (= must be paid) on the first of the month.silence falls Silence fell on the group of men (= they became silent) as they received the news.fall under She fell under the influence of (= began to be influenced by) an older student.\nMore examplesFewer examplesThey let the palace fall into ruin.The buildings had started to fall into decay.He fell unconscious shortly after the accident.Sophia fell ill while on holiday.After we'd explained about the change of plan, the children fell strangely quiet for a minute or two.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nfall verb\n(BE DEFEATED)\nC2 [ I ] to be beaten or defeated: fall from power The president fell from power during the military coup.UK The government finally fell after losing the support of the centre parties.\nC2 [ I ] If a place falls in a war or an election, an enemy army or a different political party gets control of it: fall to Rome fell to the Vandals in AD 455.UK The constituency fell to Labour at the last election, after ten years of Conservative rule.\n[ I ] literary If soldiers fall while fighting, they are killed: Many brave men fell in the fight to save the city.fall in battle During the war, he saw many of his comrades fall in battle.\n[ I ] UK In cricket, when a wicket falls, the turn of the player who is hitting the ball ends: Ten wickets fell in 22 overs.\nSMART Vocabulary: related words and phrases\nLosing and being defeated\nadmit\nbattering\nchase\nchase shadows idiom\nconcede\ndefeat\ndownfall\nfallen\ngive\ngive in\ngo down\nknuckle\nmeet\nnon-winning\nsay\nsay uncle idiom\nsuccumb\ntake a battering idiom\nunwinnable\nwhipsaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath and dying\nCricket\nfall verb\n(HAPPEN)\nC2 [ I ] to come at a particular time or happen in a particular place: Easter falls late this year.fall on My birthday will fall on a Friday this year.night/darkness falls Night/Darkness had fallen by the time we got back to the camp. In the word \"table\", the accent falls on the first syllable. The Treasury has still not decided where the cuts will fall.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nfall verb\n(HANG DOWN)\nC2 [ I usually + adv/prep ] to hang down loosely: fall around The boy's hair fell around his shoulders in golden curls.fall to The veil fell almost to her waist.\nSMART Vocabulary: related words and phrases\nHanging and suspending\nbe dripping with something idiom\ncascade\ndangle\ndangly\ndrape\ndroop\ndroopingly\ndroopy\nflow\nhang\nhung\npendant\npendent\nrehang\nsag\nsaggy\nsling\nstring\nstring someone up\nsuspend\nSee more results »\nfall verb\n(UNHAPPY)\nyour face falls\nIf your face falls, you suddenly look unhappy or disappointed: His face fell when he saw the distance he still had to go.\nSee more\nGrammar\nFell or felt?Fell is the past simple of the verb fall: …\nFall or fall down?We can use fall as a noun or a verb. It means ‘suddenly go down onto the ground or towards the ground unintentionally or accidentally’. It can also mean ‘come down from a higher position’. As a verb, it is irregular. Its past form is fell and its -ed form is fallen. Fall does not need an object: …\nIdioms\nfall between two stools\nfall by the wayside\nfall flat\nfall foul of something\nfall foul of someone\nfall in line\nfall in love\nfall into someone's arms\nfall into place\nfall into the wrong hands\nMore idioms\nfall into the/someone's trap\nfall prey/victim to something/someone\nfall short\nnearly/almost fall off your chair\nfall on deaf ears\nfall on hard times\nPhrasal verbs\nfall about\nfall apart\nfall away\nfall back\nfall back on something\nfall behind\nfall down\nfall down on something\nfall for someone\nfall for something\nMore phrasal verbs\nfall from something\nfall in\nfall in with someone\nfall in with something\nfall into something\nfall off\nfall on/upon someone\nfall on/upon something\nfall on someone\nfall out\nfall over\nfall over something/someone\nfall through\nfall to someone\nfall to\nfall noun\n(LOWER AMOUNT)\nB1 [ C usually singular ] the fact of the size, amount, or strength of something getting lower: fall in a fall in the price of petrol/the unemployment raterise and fall We could hear the rise and fall of voices in the other room. There was a fall in support for the party at the last election.\nThesaurus: synonyms, antonyms, and examples\nthe fact of getting smaller or becoming lessdecreaseThere has been a steady decrease in the number of visitors.fallA fall in the price of petrol is unlikely.fall-offThere's been a sharp fall-off in demand for the product since the company's scandal broke.falling-offThere has been a slight falling-off in public sector employment growth.riseThere has been a sharp rise in home sales this month.\nSee more results »\nMore examplesFewer examplesThe last ten years have seen a dramatic fall in the number of adoptions.The City acted swiftly to the news of a fall in the value of sterling.Yesterday the company announced its first ever fall in profits.The fall in interest rates is excellent news for borrowers.There was a larger-than-expected fall in unemployment last month.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ncontraction\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\ntelescope\ntumble\nSee more results »\nfall noun\n(SEASON)\n[ C or U ] US (UK autumn) the season after summer and before winter, when fruits and crops become ready to eat and the leaves fall off the trees: in the fall I'm starting college in the fall.next fall Next fall we'll be back in New York. a fall day/morning fall colours/foliage\nMore examplesFewer examplesIn the fall, everyone is out raking up the dead leaves.The garden is a blaze of colour in the fall.They plan to get married in the fall.Check out our new catalog for all the latest fall and winter fashions.We were planning a trip to Europe next fall.\nSMART Vocabulary: related words and phrases\nThe seasons\nautumn\nautumnal\nautumnally\ndead\nestival\nin the dead of night/winter idiom\nmidsummer\nmonsoon\nrain\nseason\nseasonal\nseasonality\nseasonally\nspring\nspring fever\nsummer\nturn the clocks forward phrase\nvernal\nwinter\nwintertime\nSee more results »\nfall noun\n(ACCIDENT)\nB2 [ C usually singular ] the act of falling down to the ground, usually without intending to or by accident: have/take a fall He had/took a nasty fall and hurt his back. the fall of the Berlin Wall (= when the Berlin Wall was destroyed)\nMore examplesFewer examplesThe soft grass cushioned his fall.I was in no mood for heroics after my fall and skied very slowly down the mountainside.The horse broke its front leg in the fall.He spent the last ten years of his life in a wheelchair after a fall which left him paralysed from the waist down.After her fall she complained that she couldn't bend her leg properly.\nSMART Vocabulary: related words and phrases\nFalling and dropping\nass\ncollapse/fall in a heap idiom\ncropper\ncrumple\ndrop\ndrop like flies idiom\ndrop off\nfaceplant\nfall away\nfly\nlet go idiom\nmic drop\nnosedive\noverbalance\nparachutist\nplunge\npratfall\nshower\nthump\nwayside\nSee more results »\nfall noun\n(MOVEMENT DOWNWARDS)\n[ C usually singular ] an amount of something that moves down onto the ground or from a higher position to a lower position: a heavy fall of snow See also\nrainfall falls [ plural ]\noften used in place names to mean a very wide waterfall, often made of many separate waterfalls: Niagara Falls\nSee more\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nspiral\ntouch\ntouch down\nSee more results »\nfall noun\n(DEFEAT)\nC1 [ C usually singular ] the fact of being defeated or losing your power: the fall of Romefall from The army took control of the city after the president's fall from power.\nSMART Vocabulary: related words and phrases\nLosing and being defeated\nadmit\nbattering\nchase\nchase shadows idiom\nconcede\ndefeat\ndownfall\nfallen\ngive\ngive in\ngo down\nknuckle\nmeet\nnon-winning\nsay\nsay uncle idiom\nsuccumb\ntake a battering idiom\nunwinnable\nwhipsaw\nSee more results »\nIdioms\ntake a/the fall for someone\nfall from grace\nfall verb\n(ACCIDENT)\nAdd to word list\nAdd to word list\n[ I ] (of people and animals) to move unintentionally or unexpectedly onto or toward the ground from a higher place: He fell and hurt his arm. Don’t fall over, honey! I fell down the stairs. She fell off the top of the ladder. Kathy tripped and fell (flat) on her face (= fell facing the ground).\nfall verb\n(MOVE DOWN)\n[ I ] to move down toward or drop to a lower position: They expect three inches of snow to fall tonight. Tears rolled down her cheeks and fell into her lap. Plaster was falling off the walls.\nfall verb\n(BECOME LESS)\n[ I ] to become less or lower in size, amount, or strength: Stock prices fell sharply in late March and early April. Her blood sugar levels fell below normal.\nfall verb\n(CHANGE STATE)\n[ L ] used to show a change from one state to another: He fell asleep reading the newspaper.\nfall verb\n(BE DEFEATED)\n[ I ] to be defeated or fail: The city fell to the enemy.\n[ I ] If soldiers fall, they die: The statue honors soldiers who fell in battle.\nfall verb\n(HAPPEN)\n[ I ] to happen at a particular time: My birthday falls on a Friday this year. By the time we got home, night had fallen (= begun).\nfall verb\n(BELONG TO)\n[ I always + adv/prep ] to belong to a particular group, or to be part of a particular subject: Archaeology falls under the general subject of natural history.\nfall verb\n(HANG DOWN)\n[ I always + adv/prep ] (of hair or cloth) to hang down loosely: Her long, dark hair fell to her waist. Idioms\nfall by the wayside\nfall flat\nfall into line (with someone/something)\nfall into place\nfall into the trap of doing something\nfall into the wrong hands\nfall short\nfall victim to somethingPhrasal verbs\nfall apart\nfall apart\nfall back on something\nfall behind (something)\nfall for someone\nfall for something\nfall into something\nfall off\nfall out\nfall out\nMore phrasal verbs\nfall through\nfall noun\n(SEASON)\n[ C/U ] (also autumn) the season of the year between summer and winter, lasting from September to December north of the equator and from March to June south of the equator, when fruits and crops finish growing and the leaves fall off the trees: [ U ] Fall is my favorite time of year. [ U ] She wants to take a vacation before fall classes start.\nfall noun\n(ACCIDENT)\n[ C usually sing ] the act of moving onto or toward the ground or to a lower position, often unintentionally or accidentally: She injured herself in a fall.\nfall noun\n(DEFEAT)\n[ C usually sing ] a defeat or loss of power: the fall of the Roman Empire\nfall noun\n(DROP)\n[ C usually sing ] to become lower in size, amount, or strength: a fall in temperature\nAdd to word list\nAdd to word list\nto become lower in value, amount, or level: House prices began to fall rapidly. Demand for new cars has fallen by over 40%. Stock prices fell sharply yesterday. Public sector salaries are expected to fall even further as the recession continues to bite. Inflation has fallen to its lowest level in 30 years.\nto gradually get to be in a worse condition or state: The factory had fallen into disuse in recent years.\nfall due\nif a payment falls due at a particular time, it must be paid at that time: The rent falls due on the first day of the month. Phrasal verbs\nfall back\nfall back on sth\nfall behind\nfall off\nfall over\nfall through\n[ C, usually singular ] a reduction in the amount or level of something: a fall in sth There are serious concerns about the fall in the value of the dollar. The FTSE 100 slumped 116 points on the back of a 160-point fall overnight on the Dow Jones. A further fall of 2% in property prices could seriously hamper economic recovery. The corporation reported a sharp fall in quarterly profits.\n[ S ] a situation in which someone or something that has been successful fails: The documentary charts the rise and fall of America's third largest car company.\nfall from grace\na situation in which someone who was popular, successful, etc. suddenly becomes unsuccessful, unpopular, etc."}