{"id":149812,"name":"false","type":"adjective","us_sound":"fɑːls","us_link":"../audio/f/false.mp3","uk_sound":"fɒls","uk_link":"../audio/f/ukfalaf022.mp3","content":"false adjective\n(NOT REAL)\nAdd to word list\nAdd to word list\nB2 not real, but made to look or seem real: false eyelashes She was wearing false eyelashes for the photo shoot.false teeth A pair of false teeth were soaking in a glass.false floor UK Modern office buildings have false floors, under which computer and phone wires can be laid.\nThesaurus: synonyms, antonyms, and examples\nmade by humansartificialHer bouquet was made of artificial flowers.syntheticThe tyres are made with synthetic rubber.man-madeNylon is a man-made fibre.fakeHe was selling fake fur jackets.\nSee more results »\nMore examplesFewer examplesHe disguised himself by shaving his head and wearing a false beard.false limbs\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalsely\nfantastical\nfever dream\nfictional\nfictionality\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nparallel universe\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNatural and artificial\nfalse adjective\n(NOT TRUE)\nB1 disapproving not true, but made to seem true in order to deceive people: false evidence She was charged with giving false evidence in court.false name When she was stopped by the police for speeding, she gave them a false name and address.false identity He assumed a false identity (= pretended he was someone else) in order to escape from the police. under false pretences disapproving (US under false pretenses)\nIf you do something under false pretences, you lie about who you are, what you are doing, or what you intend to do, in order to get something: He was deported for entering the country under false pretences.\nSee more\nMore examplesFewer examplesThe politician was awarded £50 000 damages over false allegations made by the newspaper.The two men allege that the police forced them to make false confessions.His accusations were false, but they served to besmirch her reputation.Their promises lulled us into a false sense of security.The government's claim that it would reduce taxes proved false.\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse modesty\nfalsifiable\nfalsify\nfeign\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nfalse adjective\n(NOT CORRECT)\nB1 not correct: \"Three plus three is seven. True or false?\" \"False.\" The news report about the explosion turned out to be false.false impression/idea You'll get a false impression/idea of the town if you only visit the university. Synonyms\nerroneous formal\nfallacious formal\nincorrect\nuntrue\nwrong (NOT CORRECT)\nThesaurus: synonyms, antonyms, and examples\nwrongwrongThat's the wrong answer. Read the question again.incorrectThe information on the website is incorrect.erroneousNo one could explain how the erroneous information had got into the report.inaccurateTheir estimation of the cost was wildly (= extremely) inaccurate.\nSee more results »\nMore examplesFewer examplesIt is an illogical statement, because if one part is true, then the other must be false.Your actions are based on some false presuppositions.That theory was proved false.My fears about the job turned out to be false.Teams will lose two points for any false answers.\nSMART Vocabulary: related words and phrases\nWrong\naberrant\naberrantly\nabnormal\namiss\nanomalous\nbark\nfallaciousness\nfalse negative\nfalse positive\nfalsely\nflawed\ninvalidly\nirregular\nirregularly\nliberal\nliberally\nmal-\nquarrel\nwrongheadedly\nwrongly\nSee more results »\nfalse adjective\n(NOT SINCERE)\nC1 disapproving not sincere or expressing real emotions: a false smile/laugh I didn't like her - she seemed false. Synonym\nfake\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nforced\nforcedly\nfustian\nglib\nglibly\nponce\nponce about/around\nposey\npreciously\npreciousness\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\ntheatricality\nSee more results »\nfalse adjective\n(NOT LOYAL)\nliterary disapproving A false friend is not loyal or cannot be trusted.\nSMART Vocabulary: related words and phrases\nDisloyalty, betrayal & treason\nadulterous\nbackstabber\nbetrayal\nbetrayer\nbreak ranks idiom\nchicane\ndeserter\ndesertion\nfaithless\nfaithlessly\nfaithlessness\nfifth column\nfifth-columnist\nstab someone in the back idiom\ntergiversation\nthrow someone to the lions idiom\nthrow someone under the bus idiom\ntraitor\ntreasonable\nunfaithfulness\nSee more results »\nfalse adjective [not gradable]\n(NOT REAL)\nAdd to word list\nAdd to word list\n(of things) not real, but made to look real, or (of information) not true but made to seem true in order to deceive: Haban used false identification to enter France. The company presented clients with documents containing false information.\nfalse adjective [not gradable]\n(NOT CORRECT)\nnot correct or true: \"Three plus three is seven. True or false?\" \"False.\" Note: said about information or an idea\nfalse adjective [not gradable]\n(NOT SINCERE)\n(of people or their manner) dishonest or not sincere: “I think of myself as great,” said Tyler, abandoning false modesty.\nfalsely adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔls·li/\nShe was falsely accused of shoplifting. falsify verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔl·səˌfɑɪ/\nShe falsified the accounting records. falsity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔl·sɪ·t̬i/ (also falseness, us/ˈfɔl·snəs/)\nfml We’re trying to determine the truth or falsity of your previous statement.\nAdd to word list\nAdd to word list\nnot true or correct: It is an offense to give false information on your application form.\nmade to look real, especially in order to deceive people: The wanted man is known to be travelling under an assumed name and with a false passport.\nbased on wrong information or a wrong idea about someone or something: Many immigrant workers arrive with a false impression of western countries.\nby or under false pretences\nif you do or get something by or under false pretences, you do or get it dishonestly by telling lies: The official was convicted of obtaining property by false pretences. Two executives had gained access to their rival's business plan under false pretences."}