{"id":149884,"name":"family","type":"noun","us_sound":"ˈfæm.əl.i","us_link":"../audio/f/family.mp3","uk_sound":"ˈfæm.əl.i","uk_link":"../audio/f/ukfalsi012.mp3","content":"family noun\n(SOCIAL GROUP)\nAdd to word list\nAdd to word list\nA1 [ C or U + sing/pl verb ] a group of people who are related to each other, such as a mother, a father, and their children: A new family has/have moved in next door. I come from a large family - I have three brothers and two sisters. He doesn't have any family. He's American but his family (= relatives in the past) come/comes from Ireland. This movie is good family entertainment (= something that can be enjoyed by parents and children together).family life How do you like family life (= being married, having children, etc.)?\nB1 [ C usually singular, U + sing/pl verb ] the children of a family: Women shouldn't have to choose between career and family (= having children).start a family Paul and Ana are hoping to start a family (= have children) soon.raise a family My dad died when we were small so my mum raised the family on her own.\nThesaurus: synonyms, antonyms, and examples\nyour childchildWe have three children, two girls and a boy.sonMy son is getting married in the spring. daughterHer daughter works for a multinational in the Netherlands. kidMy two kids are both grown up now.offspringI'm sure you'll be relieved once your offspring grow up and leave home.broodMy sister descended on me with her brood of five.\nSee more results »\n[ C or U + sing/pl verb ] a group of people who care about each other because they have a close relationship or shared interests: Since our time at school we have come to regard each other as family. His new employers welcomed him into their corporate family. We must work together to combat the issues affecting our African family.\n[ C, + sing/pl verb ] a pair of adult animals and their babies: family of We've got a family of squirrels living in our garden.\nMore examplesFewer examplesPeter's success at college delighted his family.He read her letter aloud to the rest of the family.She values her job above her family.There were scenes of great joy as the hostages were re-united with their families.Several families take in foreign students.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfilial\nfilially\nfirst cousin\nfraternal\ngrand-nephew\nkinswoman\nkith and kin\nlong-lost\nloved one\nmaiden aunt\nrelationship\nrelative\nremoved\nsecond cousin\nsib\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nAnimal groupings\nfamily noun\n(BIOLOGICAL GROUP)\n[ C ]\n&#160; biology\n&#160; specialized a large group of related types of animal or plant: The lion is a member of the cat family. Plant crops from the same family close together.\nMore examplesFewer examplesPecans come from the same family as the hickory.Cabbage, cauliflower, broccoli and brussel sprouts are all in the brassica family.\nSMART Vocabulary: related words and phrases\nPlants & animals - general words\nanimal kingdom\nanti-parasitic\nautotroph\nbiota\nbiped\nfauna\nflora\nflora and fauna\ngreenery\nhardily\nnon-mammalian\nnon-placental\nomnivore\nomnivorous\nparasite\nsecondary consumer\nsongster\nterrestrially\nundomesticated\nvegetation\nSee more results »\nfamily noun\n(SIMILAR THINGS)\na group of things that are related or have similar qualities: family of Phthalates are a family of chemicals used in making plastics.same family Dishes and spoons are not usually classified as art works, and yet seem to belong to the same family.product family The business plan is grouped by product family.\nMore examplesFewer examplesHydrotherapy refers to a family of therapies that treat conditions using water.The research describes a new family of algorithms for manipulating compressed images. This is one of a family of proteins that can kill bacteria by rupturing their cell membranes.The condition appears to be in the same family of diseases as paralytic polio and MS.This is the most successful new product family in the company's history.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\npale imitation\nrespecter\nsnap\nsynonymous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups and collections of things\nIdiom\nbe in the family way\nfamily noun\n(PARENTS AND CHILDREN)\nAdd to word list\nAdd to word list\n[ C/U ] a social group of parents, children, and sometimes grandparents, uncles, aunts, and others who are related: [ C ] Her family moved here when she was eleven. [ U ] Many people cope with the demands of both career and family. [ C ] She wants to get married and have a family (= have children).\nfamily noun\n(BIOLOGICAL TYPE)\n[ C ]\n&#160; biology a large group of related types of animals or plants: The lion is a member of the cat family."}