{"id":150089,"name":"fantastical","type":"adjective","us_sound":"fænˈtæs.tɪ.kəl","us_link":"../audio/f/cdo0319usfant0674.mp3","uk_sound":"fænˈtæs.tɪ.kəl","uk_link":"../audio/f/cdo0319ukfant0590.mp3","content":"Add to word list\nAdd to word list\nstrange and wonderful, like something out of a story: Fantastical Buddhist temples and medieval castles cling to Bhutan's misty valleys.\nThesaurus: synonyms, antonyms, and examples\nimaginaryimaginaryOur daughter had an imaginary friend when she was six.made-upThe comedian started with some obviously made-up stories about hanging out with the Queen.make-believeSome politicians seem to live in a make-believe world where everything revolves around their interests.non-existentThese accounts are used to sell fake or non-existent goods.fantasticHer books were filled with magicians and fantastic creatures.\nSee more results »\nso strange or extreme that it does not seem to be true or reasonable: Nobody knew what to make of the fantastical claims she had made to police.\nMore examplesFewer examplesTarot cards bear fantastical illustrations of characters dubbed the Fool, the Devil, the Sun, the Lover and Death.Her paintings show fantastical sea creatures.Back in 1882, this visionary imagined a 1950s world of flying machines, fantastical fashions, and futuristic fantasy. Some elements of his statement are perhaps fantastical; many are contradictory.Public debate revolved around numbers - as in a \"$1.3 trillion tax cut\" - that experts on both sides understood to be fantastical.\nSMART Vocabulary: related words and phrases\nUnique and unusual\naccidental\nalt-\nalternative\natypically\nbe marked out as something idiom\nincongruous\ninimitable\ninimitably\nirreplaceable\nirreplaceably\nquaintly\nquaintness\nquirkily\nquirkiness\nquirky\nunmatchable\nunmatched\nunparalleled\nunrivalled\nunsurpassable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural\nTrue, real, false, and unreal"}