{"id":150066,"name":"fantasy","type":"noun","us_sound":"ˈfæn.tə.si","us_link":"../audio/f/eus71768.mp3","uk_sound":"ˈfæn.tə.si","uk_link":"../audio/f/ukfanny008.mp3","content":"fantasy noun\n(IMAGINED SITUATION)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a pleasant situation that you enjoy thinking about but is unlikely to happen, or the activity of imagining things like this: Steve's favourite fantasy was to own a big house and a flashy car.sexual fantasy A quick search online finds more than 1,000 books on sexual fantasies.fantasy world She retreated into a fantasy world, where she could be anything she wanted.\n[ U ] a type of story or literature that is set in an imaginary world, often involving traditional myths and magical creatures and sometimes ideas or events from the real world, especially from the medieval period of history: His preferred reading was horror stories and fantasy. \"Northern Lights\" is the first book in Philip Pullman's \"His Dark Materials\" fantasy trilogy.\nMore examplesFewer examplesHalfway through the film, reality evaporates and we enter a world of pure fantasy.As a child, she frequently withdrew into her own fantasy world.His latest film has been condemned as the priapic fantasies of an old man.In the psychotherapy group, patients were free to play out their fantasies.The result is a decidedly mixed bag of campy humor, wild-eyed fantasy and high-tech special effects.\nSMART Vocabulary: related words and phrases\nUnreal things and unreality\nbirther\ncloud cuckoo land\ndelusion\ndelusional\ndelusory\nfallacy\nfalse hopes\nfalsity\nfictionalization\nfigment\nla-la land\nmake believe phrase\nnever-never land\nnon-fact\nnon-factual\nphantom\npie\npie in the sky idiom\nunreality\nuntruth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of film, play, book etc.\nfantasy noun\n(MUSIC)\n[ C ] another word for\nfantasia : The fantasies of Bach, Mozart, and Brahms provide a fun challenge to any advanced piano student. The Mozart \"Fantasy in D Minor\" didn't get the performance this piece deserves.\nSMART Vocabulary: related words and phrases\nTypes of music\nAfrobeat\nAfrobeats\nambient music\nanthemic\natonal\ndownbeat\ndrum and bass\ndubstep\nearly music\neasy listening\njazz\nKrautrock\nLatinization\nLatinize\nLatinized\nsymphonic\nsymphonically\ntechno\ntonal\ntorchy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical pieces\nAdd to word list\nAdd to word list\na pleasant but unlikely situation that you enjoy thinking about, or the activity of thinking in this way: [ C ] Writing songs was just a fantasy of mine. [ U ] She retreated from life into a world of fantasy.\nliterature Fantasy is imaginative literature, often set in strange places with unusual characters and the use of magic. fantasize verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈfænt·əˌsɑɪz/\nHe fantasized about winning the Nobel Prize."}