{"id":150132,"name":"far","type":"adverb","us_sound":"fɑːr","us_link":"../audio/f/far.mp3","uk_sound":"fɑːr","uk_link":"../audio/f/ukfanny011.mp3","content":"far adverb\n(DISTANCE)\nAdd to word list\nAdd to word list\nA2 at, to, or from a great distance in space or time: far from How far is it from Australia to New Zealand?far away Is the station far away? She doesn't live far from here. He felt lonely and far from home.far in/into One day, perhaps far in/into the future, you'll regret what you've done. as/so far as I know\nB2 used to say what you think is true, although you do not know all the facts: He isn't coming today, as far as I know.\nSee more as/so far as someone is aware\nused to say what you or someone else thinks is true, although you do not know all the facts: As far as I am aware there has never been any problem with it before. As far as we are aware, there are no other families with this surname. So far as the writer is aware, there is no memorial of him of any kind, anywhere. as/so far as I'm concerned\nB2 used to say what your personal opinion is about something: She can come whenever she likes, as far as I'm concerned.\nSee more as/so far as I can tell\nused to say what you have noticed or understood: There's been no change, as far as I can tell.\nSee more as far back as\nYou can say that something happened as far back as a particular time to show that you are surprised that it happened such a long time ago: The origins of this custom can be traced as far back as the thirteenth century. The two of them first worked together as far back as 1998. far be it from/for me to\nI certainly would not: Far be it from me to tell you how to run your life.\nSee more far from something\nC1 certainly not something: The situation is far from clear.\nSee more far from being/doing something\nC2 used to describe something that is almost the opposite of something else: She insisted that, far from being easy, it would be a difficult period for all concerned.\nSee more far from it\nC1 certainly not: He's not handsome - far from it.\nSee more from far and wide\nfrom a large number of places: People came from far and wide to see the house.\nSee more go so far as to do something\nC2 to be willing to do something that is extreme: It's good, but I wouldn't go so far as to say that it's great.\nSee more so far\nB1 until now: So far we've made £32,000.\nSee more so far so good\nC2 used to say that an activity has gone well until now: I've found a tin of beans. So far so good, but where is the tin opener?\nSee more\nMore examplesFewer examplesWe drove down the motorway as far as Bristol.The road stretched into the distance as far as the eye could see.Can you produce a report detailing what we've spent on the project so far?As far as I can recollect, his name is Edward.A gap in the clouds revealed the Atlantic far below.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nPoints in time\nfar adverb\n(AMOUNT)\nB2 very much: far better This car is far better than our old one.far more It cost far more (money) than I could afford.far too He loses his temper far too often.far rather/sooner UK I'd far rather/sooner go to the theatre than watch a DVD. by far\nB2 by a great amount: by far the best They are by far the best students in the class.\nSee more\nMore examplesFewer examplesI've got far too much clobber in my handbag.I've never played ice hockey - it's far too dangerous.He cooks a lot does Alex. He does far more than me.That hill's far too steep to cycle up.There's far more to be said - I've only had time to scratch the surface in this talk.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nFar or a long way?Far and a long way both describe something at a great distance: …\nFarther, farthest or further, furthest?Farther and further are comparative adverbs or adjectives. They are the irregular comparative forms of far. We use them to talk about distance. There is no difference in meaning between them. Further is more common: …\nIdioms\nas far as it goes\nbe a far cry from something\nby far and away\ngo far\ngo too far\nB2 used to refer to something that is not near, or the part of something that is most distant from the centre or from you: The station isn't far - we could easily walk there. [ before noun ] The children ran to the far side/corner of the room. far left/right\nC2 used to refer to political groups whose opinions are very extreme: supporters of the far left\nSee more\nMore examplesFewer examplesHe's a man of the far right.I could just see Joan on the far side of the room.It's not too far - it's about five miles from here.He ran over to the far side of the field.The job is a far cry from her previous one.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nGrammar\nFar or a long way?Far and a long way both describe something at a great distance: …\nFarther, farthest or further, furthest?Farther and further are comparative adverbs or adjectives. They are the irregular comparative forms of far. We use them to talk about distance. There is no difference in meaning between them. Further is more common: …\nfar adverb\n(DISTANCE)\nAdd to word list\nAdd to word list\ncomparative farther us/ˈfɑr·ðər/ further us/ˈfɜr·ðər/ | superlative farthest us/ˈfɑr·ðəst/ furthest us/ˈfɜr·ðəst/ at, to, or from a great distance in space or time: One day, perhaps far in the future, you’ll regret what you’ve done. How far is it from Los Angeles to San Francisco? She doesn’t live far from here.\nfar adverb\n(AMOUNT)\n[ not gradable ] much: Her new school is far better than the old one. Idioms\nas far as someone is concerned\nas far as someone knows\nby far\nfar from\nfar from it\nfar adjective\n(DISTANCE)\ndistant, or most distant from the center or from you: the far side of the park Even the closest stores are pretty far. far left (also far right)\nThe far left is the political position that is most liberal, and the far right is the political position that is most conservative.\nAdd to word list\nAdd to word list\nGOVERNMENT, FINANCE abbreviation for the Federal Acquisition Regulation: the rules that the US government must follow when it buys goods and services"}