{"id":150260,"name":"farm","type":"noun","us_sound":"fɑːrm","us_link":"../audio/f/farm.mp3","uk_sound":"fɑːm","uk_link":"../audio/f/ukfanny017.mp3","content":"farm noun [C]\n(AREA OF LAND)\nAdd to word list\nAdd to word list\nA1 an area of land, together with a house and buildings, used for growing crops and/or keeping animals as a business: a dairy farm farm animals fresh farm produce farm workerson a farm She spent the summer working on a farm.\nRichard Newstead/The Image Bank/GettyImages\na place where a particular type of animal is kept in large numbers in order to be sold: a sheep/fish farm\nMore examplesFewer examplesOur farm straddles the railway line.As agriculture became more capital intensive, many farm labourers moved to the towns and cities to look for work.The fertilizers and pesticides used on many farms are polluting the water supply.By closing the infected farms we're hoping to confine the disease to the north of the region.It was hard work on the farm but satisfying.\nSMART Vocabulary: related words and phrases\nFarms & ranches\ncollective farm\ncroft\ndairy farm\ndairyman\nfarmhouse\nfarmstead\nfish farm\ngrange\nhomestead\nkibbutz\nmarket garden\nnon-cultivated\nnon-farm\nranch\nsmallholding\nspread\nstation\nsuperfarm\ntruck farm\ntruck farming\nSee more results »\nfarm noun [C]\n(BASEBALL TEAMS)\nUS a number of baseball teams that play below the highest level and are used to prepare young players for a team that plays at the highest level: We don't have any good pitchers down on the farm. He spent three years in the farm system of the Houston Astros.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nto use land for growing crops and/or keeping animals as a business: The Stamfords have farmed this land for over a hundred years.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nPhrasal verbs\nfarm something out\nfarm someone out\nAdd to word list\nAdd to word list\nan area of land, esp. together with a house and other buildings, used for growing crops or keeping animals\nA farm can also be a place where a specific type of animal is raised in large numbers to be sold: a cattle/mink farm\nto use land for growing crops or keeping animals as a business: [ I/T ] Their family has farmed (this land) for three generations. farming noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈfɑr·mɪŋ/Phrasal verb\nfarm out something\nAdd to word list\nAdd to word list\nan area of land, usually with fields and buildings, used for raising animals and growing crops as a business: My family has worked on this farm for generations.farm building/machinery/equipment etc. Pieces of rusting farm equipment lay abandoned in the long grass.farm worker/labourer Farm workers' wages fell sharply towards the end of the century.a sheep/pig/dairy etc. farm His parents ran a small but profitable dairy farm.\na place where fish or other animals are bred: a trout/fish/salmon etc. farm Animal Rights activists demonstrated outside a local puppy farm last weekend. See also\ncube farm\nfactory farm\ntruck farm\nwind farm\nto use land to grow crops, raise animals, etc.: This area has been farmed for thousands of years.\nPhrasal verb\nfarm sth out"}