{"id":150347,"name":"farsighted","type":"adjective","us_sound":"ˈfɑːrˌsaɪ.t̬ɪd","us_link":"../audio/f/eus75739.mp3","uk_sound":"ˌfɑːˈsaɪ.tɪd","uk_link":"../audio/f/uka30015.mp3","content":"farsighted adjective\n(WISE)\nAdd to word list\nAdd to word list\n(UK also long-sighted) having good judgment about what will be needed in the future and making wise decisions based on this: Buying those shares was a very farsighted move—they must be worth ten times their original value now. It is rare to find such a farsighted and courageous politician. It was far-sighted to advocate the development of a light rail system. Opposite\nshortsighted\nMore examplesFewer examplesFarsighted brands were quick to establish an online presence. The most farsighted companies have already begun to respond by rethinking their operating model.His decisions have sometimes been controversial but have usually proved far-sighted.\nSMART Vocabulary: related words and phrases\nPredicting things and intuition\naugur\naugury\nbellwether\nbetcha\nbode\nhunch\ninkling\ninstinct\nintuit\nintuition\npremonitory\npresage\nprescience\nprescient\npresciently\nthe writing is on the wall idiom\nthere's no knowing/telling/saying idiom\nunforeseeable\nunintuitively\nunreasoning\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWise and sensible\nfarsighted adjective\n(SEEING)\nUS (UK long-sighted) able to see things clearly that are far away but not clearly see things that are near you: I'm so farsighted, I can't read the newspaper without my glasses. Many children are slightly farsighted (they cannot see close objects clearly) but don't need glasses, because they will likely outgrow the condition. Opposite\nnearsighted\nMore examplesFewer examplesMany people become more farsighted with age.He squinted at the page with his far-sighted vision.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »\nfarsighted adjective\n(ABLE TO SEE)\nAdd to word list\nAdd to word list\nable to see clearly only objects that are not close\nfarsighted adjective\n(WISE)\nable to make wise judgments about the results far in the future of an action you take now: a farsighted proposal"}