{"id":150448,"name":"fashionable","type":"adjective","us_sound":"ˈfæʃ.ən.ə.bəl","us_link":"../audio/f/fashionable.mp3","uk_sound":"ˈfæʃ.ən.ə.bəl","uk_link":"../audio/f/ukfarth013.mp3","content":"Add to word list\nAdd to word list\nB1 popular at a particular time: a fashionable nightclub/restaurant fashionable ideas/clothesit is fashionable to It's not fashionable to wear short skirts at the moment.\nThesaurus: synonyms, antonyms, and examples\nfashionablefashionableShe's so fashionable.in fashionTighter trousers for men are back in fashion.inShort jackets are in this season.coolHe was wearing a pair of cool sunglasses.hipWe went to the hip new club in town.trendyHe likes trendy clothes and modern furniture.\nSee more results »\nwearing clothes, doing things, and going to places that are in fashion: A fashionable couple posed elegantly at the next table.\nMore examplesFewer examplesThe nightclub has a very fashionable clientele.She spends the summer jet-setting around the fashionable European resorts.I tend to wear clothes that are practical rather than fashionable.Vogue magazine quickly became the bible of fashionable women.In the 1980s, shoulder pads were very fashionable in women's clothes.\nSMART Vocabulary: related words and phrases\nModern & fashionable\nbe (all) the rage idiom\nbe having a moment idiom\nbe the last word in something idiom\nfunky\nfuturistic\nfuturistically\nget with the programme idiom\ngranola\nshabby chic\nsleekly\nsleekness\nsmartly\nsmartness\nthe avant-garde\nultra-progressive\nultra-slick\nultra-sophisticated\nup to date\nup-to-the-minute idiom\nà la mode\nSee more results »\nRelated word\nfashionably\nAdd to word list\nAdd to word list\nwearing clothes, doing things, and going to places that are considered stylish or acceptable: They are a fashionable couple.\nFashionable also means popular at a particular time: fashionable restaurants/clothing fashionably adverb us\nYour browser doesn't support HTML5 audio\n/ˈfæʃ·ə·nə·bli/\nfashionably dressed women We were fashionably late (= slightly late but acceptable).\nAdd to word list\nAdd to word list\npopular at a particular time or among a particular group of people: It's no longer fashionable to boast about how big your bonus is. They bought a house in a fashionable area of the city."}