{"id":150520,"name":"fat","type":"adjective","us_sound":"fæt","us_link":"../audio/f/fat.mp3","uk_sound":"fæt","uk_link":"../audio/f/ukfarth024.mp3","content":"fat adjective\n(BIG)\nAdd to word list\nAdd to word list\nA1 having a lot of flesh on the body: get fat He eats all the time but he never gets fat. Feeding grain to cattle makes them grow fatter quickly. Children who were teased about being fat had lower self-esteem than their classmates.\nThesaurus: synonyms, antonyms, and examples\nhaving more flesh on the body than averagefatHe's got fatter as he's got older.overweightShe used to be overweight.obeseMore and more children are becoming obese.plumpHe's got rather plump since I last saw him.chubbyLook at the baby's chubby little legs.\nSee more results »\nthick or large: He passed me a fat envelope full of money. Some producers of mineral water have made fat profits.\nMore examplesFewer examplesIf you feed your dog on cakes and biscuits, it's not surprising he's so fat.Runners come in all shapes and sizes - fat and thin, short and tall.He pulled out a big fat wallet stuffed with bank notes.A grub looks like a short fat worm.Are you suggesting (that) I look fat in these trousers?\nSMART Vocabulary: related words and phrases\nAnimal physiology: fat or well-built\nbaby fat\nblob\nblubber\nblubbery\nbulky\nchubbiness\nchubster\ndumpy\nfatness\nheavyset\nlove handles\nobesity\nover-fat\npaunchiness\npaunchy\nplump\nportly\npudgy\nspare tyre\nstout\nSee more results »\nfat adjective\n(NO)\n[ before noun ] informal UK used in some phrases to mean very little or none: fat lot A fat lot of use you are! (= You are not useful in any way.) He knows it upsets me, but a fat lot he cares (= he doesn't care).\nSMART Vocabulary: related words and phrases\nSomething, anything, nothing, and everything\nacross-the-board\nanything\naught\nbazillion\nbupkis\nfresh\nmatter\nnil\nnone\nnot a dicky bird idiom\nnot a sausage idiom\nnot/nothing much idiom\nnothing\nsummat\nsweet\nsweet fanny adams idiom\nwhat with one thing and another idiom\nwhatevs\nwhit\nzip\nSee more results »\nfat adjective\n(EASY)\nUS slang In baseball, if a pitcher throws a fat pitch, they throw the ball so that it is easy to hit it hard: fat pitch I got a fat pitch which I hit for a home run.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nIdiom\nfat chance\n[ U ] the substance under the skin of humans and animals that stores energy and keeps them warm: body fat Women have a layer of subcutaneous fat (= fat under the skin), which provides them with better insulation than men.\nB2 [ C or U ] a solid or liquid substance from animals or plants and used especially in cooking: This product contains no animal fat. vegetable fats\nMore examplesFewer examplesEating too much fat causes your arteries to clog up.Try to avoid foods which contain a lot of fat.A diet that is high in fat can lead to obesity.The dog had rolls of fat along its neck.Streaky bacon contains strips of fat.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFats & oils in food & cooking\nIdioms\nthe fat is in the fire\nlive off the fat of the land\nfat adjective [-er/-est only]\n(FLESHY)\nAdd to word list\nAdd to word list\nhaving a lot of flesh on the body: Her weight’s normal but she insists she’s fat.\nFat can also mean thick or big: a fat telephone book\nfat adjective [-er/-est only]\n(WEALTHY)\ninfml having or worth a lot of money: a fat profit Idiom\nfat chance\nfat noun [C/U]\n(SUBSTANCE)\nbiology the substance under the skin of humans and animals that stores energy and keeps them warm\nFat is also a solid or liquid substance obtained from animals or plants and used esp. in cooking."}