{"id":150543,"name":"fate","type":"noun","us_sound":"feɪt","us_link":"../audio/f/fate.mp3","uk_sound":"feɪt","uk_link":"../audio/f/ukfatal002.mp3","content":"Add to word list\nAdd to word list\nB2 [ C usually singular ] what happens to a particular person or thing, especially something final or negative, such as death or defeat: decide your fate We want to decide our own fate. His fate is now in the hands of the jury.suffer a fate The disciples were terrified that they would suffer the same fate as Jesus.meet a fate Parents in children's stories often meet a harsh fate.\nB2 [ U ] a power that some people believe causes and controls all events, so that you cannot change or control the way things will happen: When we met again by chance in Cairo, I felt it must be fate. Fate has brought us together.\nMore examplesFewer examplesBut for a cruel twist of fate, he could now be running his own business.He showed a stoic resignation towards his fate.It is somehow fixed in my mind that my fate and that woman's are intertwined.By an odd quirk of fate, we ended up on the same train.The fates of both countries seem somehow entwined.\nSMART Vocabulary: related words and phrases\nInevitable\nall roads lead to Rome idiom\nautomatic\nbe (only) a matter of time idiom\nbe damned if you do and damned if you don't idiom\nbe nothing for it idiom\nbe part and parcel of something idiom\nimplacable\nimplacably\ninalienable\ninalienably\nineluctable\ninexorably\ninsuppressible\nit can't be helped idiom\nrelentless\nrelentlessly\nseal\nunavoidably\nunstoppable\nunstoppably\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFate and destiny\nIdioms\na fate worse than death\nthe Fates\nAdd to word list\nAdd to word list\nsomething that happens to a person or thing, esp. something final or negative, such as death or defeat: The fate of numerous smaller buildings is under debate. Attendance has not picked up, and the fate of the show is still in doubt.\nFate is also a power that is considered to cause and control all events, so that people cannot change or control the way things will happen: When we met again by chance, she said, \"It must be fate.\" Idiom\na fate worse than death"}