{"id":150691,"name":"fault","type":"noun","us_sound":"fɑːlt","us_link":"../audio/f/fault.mp3","uk_sound":"fɒlt","uk_link":"../audio/f/ukfatal030.mp3","content":"fault noun\n(MISTAKE)\nAdd to word list\nAdd to word list\nB1 [ U ] a mistake, especially something for which you are to blame: It's not my fault she didn't come! She believes it was the doctor's fault that Peter died.fault is with The fault was with the organizers, who failed to make the necessary arrangements for dealing with so many people.fault lies with The fault clearly lies with an administration that has cut staff and failed to ensure adequate training.through no fault of your own Through no fault of his own, he spent a week locked up in jail.\nThesaurus: synonyms, antonyms, and examples\nbe to blame for somethingbe to blameNo one can decide who is to blame.be at faultBoth the fans and the players were at fault.be someone's faultThis is all my fault.be responsibleWe're still trying to determine who was responsible for the attacks.the blame lies withSome of the blame lies with investors.the blame rests withMuch of the blame rests with the government, which has confused people with conflicting health messages\nSee more results »\nB2 [ C ] a weakness in a person's character: He has many faults, but dishonesty isn't one of them.\nB2 [ C ] a broken part or weakness in a machine or system: The car has a serious design fault.electrical fault An electrical fault caused the fire. For all the faults in our education system, it is still better than that in many other countries.\n[ C ] (in tennis and some other games) a mistake made by a player who is beginning a game by hitting the ball be at fault\nB2 to have done something wrong: be at fault for Her doctor was at fault for not sending her straight to a specialist.\nSee more find fault with someone/something\nC2 to criticize someone or something, especially without good reasons: He's always finding fault with my work.\nSee more\nMore examplesFewer examples\"It wasn't my fault.\" \"Don't worry, I'm not accusing you.\"The fault surely lies in the design of the equipment.The electrician has diagnosed a fault in the wiring.I admit it was entirely my fault.With all her faults, she's still a really good friend.\nSMART Vocabulary: related words and phrases\nFaults and mistakes\naberration\nAchilles heel\nadrift\nblack mark\nblemish\nerror\nfailing\nfalse move\nfaux pas\nflaw\nmiscue\nmisfunction\nmisperception\nmisprint\nmisspelling\nthat's/it's your funeral! idiom\ntypo\nwardrobe malfunction\nweakness\nwhat price...? idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTennis & racket sports\nfault noun\n(CRACK)\n[ C ]\n&#160; geology\n&#160; specialized a crack in the earth's surface where the rock has divided into two parts that move against each other: fault line Surveyors say the fault line is capable of generating a major earthquake once in a hundred years.\nKevin Schafer/Photolibrary/GettyImages\nSMART Vocabulary: related words and phrases\nGeography: caves, cracks & crevices\ncave\ncavern\ncrack\ncrater\ncratered\ncrevasse\ncrevice\nfissure\nfurrow\ngouge\ngrotto\ngulf\nhole\npit\npothole\nrelocation\nrut\nrutty\nspeleologist\nstalagmite\nSee more results »\nIdiom\nbe kind, generous, etc. to a fault\nfault verb\n(CRITICIZE)\n[ T ] to find a reason to criticize someone or something: I can't fault the way they dealt with the complaint.fault someone on something I can't fault you on your logic.\nSMART Vocabulary: related words and phrases\nDisapproving & criticizing\nanathematize\nanimadversion\naspersion\naw\nbackbite\nbarrel\nboo\ncriticism\ndeprecate\ndim\nfulminate\nniggle\nnot hold with something\nobloquy\nopprobrious\nopprobriously\nopprobrium\npeanut gallery\nsatirize\ntear\nSee more results »\nfault verb\n(SPORTS)\n[ I ] to hit a fault in tennis and other similar games: fault on That's the fourth serve he's faulted on today.\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\nunreturnable\nunseeded\nvolley\nSee more results »\nfault noun\n(SOMETHING WRONG)\nAdd to word list\nAdd to word list\n[ C ] a quality in a person that shows that the person is not perfect, or a condition of something that shows that it is not working perfectly: He loves me in spite of my faults. Some people find fault in everything they see.\nfault noun\n(RESPONSIBILITY)\n[ U ] responsibility for a mistake or for having done something wrong: I screwed up, so it was my fault we didn’t finish on time. The driver was at fault (= responsible) for the accident – he was going too fast.\nfault noun\n(CRACK)\n[ C ]\n&#160; earth science a crack in the earth’s surface where the rock is divided into two parts that can move against each other in an earthquake (= a sudden, violent movement of the earth’s surface)\nIdiom\nto a fault\nfault verb [T]\n(RESPONSIBILITY)\nto blame someone: Professional athletes cannot be faulted for making millions of dollars when they attract the fans that make the sport popular.\nAdd to word list\nAdd to word list\n[ C ] something that is wrong with a machine or system: The car had a serious design fault and had to be recalled. An electrical fault caused the fire.\n[ U ] the fact of being responsible for something bad that happens: be sb's fault (that) It was the traders' fault that so many billions were lost.be the fault of sb The court found that the accident was the fault of the local authority. the fault lies with sb We need to decide whether the fault lies with the buyer or the seller in this case.\nno-fault LAW\nrelating to legal processes, insurance claims, etc. in which it is not necessary to decide who is responsible for a bad situation: He introduced the nation's first no-fault auto insurance law. a no-fault contract/divorce/system"}