{"id":150826,"name":"favourite","type":"adjective","us_sound":"ˈfeɪ.vər.ət","us_link":"../audio/f/favorite.mp3","uk_sound":"ˈfeɪ.vər.ɪt","uk_link":"../audio/f/ukfault012.mp3","content":"Add to word list\nAdd to word list\nA1 best liked or most enjoyed: \"What's your favourite colour?\" \"Green.\" my favourite restaurant/book/song least favourite\nliked or enjoyed the least: Cleaning the toilets is my least favourite job.\nMore examplesFewer examplesSwimming is my favourite form of exercise.She imagined herself sitting in her favourite armchair back home.'Carmen' is my favourite opera.She'd booked a table for four at their favourite restaurant.My favourite subjects at school were history and geography.\nSMART Vocabulary: related words and phrases\nLiking more\nbias\ndruthers\neach\neach to his/their own phrase\nfave\nfavour\nfavoured\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\nprefer\npreferable\npreferably\npreference\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nB1 a thing that someone likes best or enjoys most: How clever of you to buy chocolate chip cookies - they're my favourites.\na person who is treated with special kindness by someone in authority: the teacher's favourite\nC2 the person or animal most people expect to win a race or competition: the favourite Great Gold is the favourite in the 2.00 race at Epsom. [ + to infinitive ] Brazil are favourites to win this year's World Cup.\nMore examplesFewer examplesIt would be quite an upset if the favourite didn't win.The film 'White Christmas' is a perennial favourite.The odds-on favourite to win in the 3.30 race is Killjoy.Manchester United and Arsenal were the pre-season favourites.The band was belting out all the old favourites.\nSMART Vocabulary: related words and phrases\nLiking more\nbias\ndruthers\neach\neach to his/their own phrase\nfave\nfavour\nfavoured\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\nprefer\npreferable\npreferably\npreference\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nYou can also find related words, phrases, and synonyms in the topics:\nGambling & bookmaking"}