{"id":150814,"name":"favour","type":"noun","us_sound":"ˈfeɪ.vɚ","us_link":"../audio/f/favor.mp3","uk_sound":"ˈfeɪ.vər","uk_link":"../audio/f/ukfault008.mp3","content":"favour noun\n(SUPPORT)\nAdd to word list\nAdd to word list\nB2 [ U ] the support or approval of something or someone: find favour These plans are unlikely to find favour unless the cost is reduced.in favour of The Council voted in favour of a £200 million housing development.out of favour with She is out of favour (= unpopular) with her colleagues.in favour with Her economic theories are in favour (= popular) with the current government.win someone's favour He sent her presents in an attempt to win her favour. be in favour of something/doing something\nto support or approve of something: Are you in favour of a ban on smoking? I'm not in favour of hitting children.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nin your favour\nC1 When something is in your favour, it gives you an advantage: This candidate has a lot in her favour, especially her experience of teaching. find in someone's favour\nIf a judge finds in someone's favour, he or she says that that person is not guilty.\nMore examplesFewer examplesThe majority of people in the province are in favour of devolution.He claimed that he had been pushed aside in favour of a younger person.The system of benefits is weighted in favour of those who have children.Delegates have voted in favour of the motion.54% of voters were in favour, 30% against, and the rest were undecided.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiking\nUseful or advantageous\nJudges & juries\nfavour noun\n(KIND ACT)\nB1 [ C ] a kind action that you do for someone: ask someone a favour She called to ask me a favour.do someone a favour Could you do me a favour - would you feed my cat this weekend?\nThesaurus: synonyms, antonyms, and examples\nto help someonehelpCan I help you get that?aidThe project is designed to aid poorer countries.assistThe army arrived to assist in the search.collaborateWe collaborated on the project.cooperateSeveral countries are cooperating in the relief effort.benefitThe children have benefited greatly from the new facilities.\nSee more results »\n[ C usually plural ] an advantage that you give to someone, such as money or a good job, especially when this is unfair: dispense a favour Several politicians were accused of dispensing favours to people who voted for them.\nMore examplesFewer examplesHe never even thanked me, so that's the last time I do him a favour.Can I ask you a favour?Could you do me a favour and pass these sandwiches round?The reason (that) I'm calling is to ask a favour.It is illegal for public officials to solicit gifts or money in exchange for favours.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nsponsor\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\nfavour noun\n(PRESENT)\n[ C usually plural ] a small present that you give to every guest at a wedding, party, etc.: wedding favours\nSMART Vocabulary: related words and phrases\nPresents and gifts\nChristmas box\nChristmas stocking\ncomp\nfree gift\nfreebie\ngift wrap\ngiftee\ngiveaway\ngoody bag\ngrab bag\nlittle\nnovelty\noffering\nperk\npresent\nprezzie\nsecret Santa\nstocking\nsweetener\ntoken\nSee more results »\nIdioms\nbe free with your favours\ndo me/us a favour!\nnot do someone any favours\nspeak in someone's favour\nfavour verb [T]\n(PREFER)\nto support or prefer one particular possibility: These are the running shoes favoured by marathon runners.favour something over something In the survey, a majority of people favoured higher taxes and better public services over (= rather than) tax cuts. [ + -ing verb ] I generally favour travelling by night, when the roads are quiet.\nto give an advantage to someone or something, in an unfair way: A strong wind will favour the bigger boats. She always felt that her parents favoured her brother.\nto protect or avoid using one leg, hand, arm, etc. because it is painful, injured, etc.: He limped slightly, favouring his left leg. She was leaning against the table to favour her sprained ankle. Related word\nfavoured\nMore examplesFewer examplesThe president is predisposed towards negotiation and favours a peaceful way of resolving the crisis.Jones favours a dynamic, hands-on style of management.They favour the self-regulation of the industry, and strict codes of conduct have already been issued by the Advertising Association.The committee favours the cheapest option.Which of the proposals do you favour?\nSMART Vocabulary: related words and phrases\nLiking more\nbias\ndruthers\neach\neach to his/their own phrase\nfave\nfavoured\nfavourite\ngive\ngive me ... any day/every time! idiom\nlief\nover-favour\nprefer\npreferable\npreferably\npreference\npreferred\nrather\nsoon\ntop ten\nwould (just) as soon idiom\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nUnfairness and favouring someone unfairly\nMoving unsteadily or with difficulty\nfavour verb [T]\n(LOOK LIKE)\nUS or old-fashioned UK to look similar to a parent or other relation, or to look more similar to the family of one of your parents than to the family of the other: I had not inherited my father's good looks, but favoured my mother's side of the family.\nSMART Vocabulary: related words and phrases\nBeing or appearing similar or the same\na passing resemblance idiom\nalign\naligned\nbe in good company idiom\nbe in the same ballpark idiom\nbe nothing/not much/very little in it idiom\ncorrespond\nequal\nequalization\neven (something) out\nflatlining\nhomologous\nhomologous series\nmatch\noverlapping\nparallel\npassing\nplaceless\nplacelessness\nresemble\nSee more results »\nPhrasal verb\nfavour someone with something"}