{"id":150849,"name":"fax","type":"noun","us_sound":"fæks","us_link":"../audio/f/fax.mp3","uk_sound":"fæks","uk_link":"../audio/f/ukfault015.mp3","content":"Add to word list\nAdd to word list\n[ C ] (a copy of) a document that travels in electronic form along a phone line and is then printed on paper: I'll send you a fax with the details of the proposal.\n[ C or U ] (also fax machine) a device or system used to send and receive documents in electronic form along a phone line: by fax I'll send you the agenda by fax. Do you have a fax at home?\nslobo/E+/GettyImages\nSMART Vocabulary: related words and phrases\nCommunications - messaging\nbeep\nbleeper\ndirect message\nDM\nfacsimile\nintercom\nMailgram\nmessage\nmessaging\np.m.\npage\npager\nresend\nTelemessage\ntelex\ntext\ntext message\nthnq\ntweet\ntweetstorm\nSee more results »\nB1 to send a document using a fax machine: fax something to someone I'll fax it (through/over/across) to you. [ + two objects ] Fax me your reply/Fax your reply to me.\nMore examplesFewer examplesPlease could you fax me a copy of the contract?I spent all afternoon faxing my application form.I faxed it yesterday.You can fax or email the form once you have completed it.Did you fax it, or send it by post?\nSMART Vocabulary: related words and phrases\nCommunications - messaging\nbeep\nbleeper\ndirect message\nDM\nfacsimile\nintercom\nMailgram\nmessage\nmessaging\np.m.\npage\npager\nresend\nTelemessage\ntelex\ntext\ntext message\nthnq\ntweet\ntweetstorm\nSee more results »\nAdd to word list\nAdd to word list\na document that is sent by electronic image through a telephone line: I’ll send you a fax of the proposal.\nA fax (also (also fax machine)) is also the machine that sends or receives such an image. fax verb [ T ] us\nYour browser doesn't support HTML5 audio\n/fæks/\nI faxed the changes to my publisher.\nAdd to word list\nAdd to word list\n[ C ] a document that is sent electronically along a phone line and is printed out when it is received: send sb a fax Could you send me a fax with your contact details please.\n[ C ] (also fax machine) a machine for sending and receiving documents electronically along a phone line: Do you have a fax at home?\n[ U ] a way of sending and receiving documents electronically along a phone line: send sth by fax I'll send the invoice by fax.\nto send a document electronically along a phone line using a fax machine: Please fax me a copy of your passport."}