{"id":150884,"name":"fear","type":"noun","us_sound":"fɪr","us_link":"../audio/f/fear.mp3","uk_sound":"fɪər","uk_link":"../audio/f/ukfault019.mp3","content":"Add to word list\nAdd to word list\nB1 an unpleasant emotion or thought that you have when you are frightened or worried by something dangerous, painful, or bad that is happening or might happen: Trembling with fear, she handed over the money to the gunman. Even when the waves grew big, the boy showed no (signs of) fear.a fear of I have a fear of heights.worst fear The low profit figures simply confirmed my worst fears. [ + that ] There are fears that the disease will spread to other countries.\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\nbe in fear of your life (also mainly US be in fear for your life)\nto be frightened that you might be killed: Lakisha sat inside, in fear of her life, until the police came.\nSee more be no fear of something informal\nto be no possibility that a particular thing will happen: Greta knows the city well, so there's no fear of us getting lost (= we will not get lost).\nSee more for fear that/of something\nC2 because you are worried that a particular thing might happen: They wouldn't let their cat outside for fear that it would get run over.\nSee more\nMore examplesFewer examplesThen he turned towards me and I was suddenly gripped by fear.I finally mastered my fear of flying.I was trembling with fear.You could tell she wasn't lying from the fear in her voice.Ten years later her worst fears were realized.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\ncold sweat\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nIdioms\nhave fears for someone/something\nno fear!\nput the fear of God into you\nwithout fear or favour\nB2 [ T; not continuous ] to be frightened of something or someone unpleasant: Most older employees fear unemployment. What do you fear most?\nB2 [ T; not continuous ] formal to be worried or frightened that something bad might happen or might have happened: [ + (that) ] Police fear (that) the couple may have drowned.it is feared that formal It is feared that as many as two hundred passengers may have died in the crash.it is feared He is, it is feared, at risk of torture if he is sent back to his homeland. We huddled together, fearing we might be killed. [ + to infinitive ] Fearing to go herself, she sent her son to find out the news. I fear formal mainly UK\nused to give someone news of something bad that has happened or might happen: [ + (that) ] I fear (that) she's already left.\nSee more\nMore examplesFewer examplesHe reassured people that law-abiding citizens would have nothing to fear from the enquiries.It was feared that the break-up of the oil tanker would result in further pollution.The police feared that the crowd were becoming disorderly and so they moved in with horses.The committee kept the results of the survey to itself, fearing a bad public reaction.The government fears that talking to terrorists might legitimize their violent actions.\nSMART Vocabulary: related words and phrases\nAfraid\nafraid\nafraid for someone/something\nafraid of someone/something\nbe in fear of your life phrase\nbe like a deer/rabbit caught in the headlights idiom\nbottle\nfrit\ngoosey\ngun-shy\nhave a horror of something idiom\nhorror-struck\nleaf\npanic\nquake\nshake\nshake like a leaf idiom\nshit a brick idiom\nsquirrelly\nterrified\nterror-stricken\nSee more results »\nIdiom\nnever fearPhrasal verb\nfear for someone/something\nAdd to word list\nAdd to word list\na strong emotion caused by great worry about something dangerous, painful, or unknown that is happening or might happen: [ U ] Even when the boat was rocked by waves, the boy showed no fear. [ C ] The low sales continued, confirming our worst fears. [ U ] She stood very still for fear of (= because she was worried about) being noticed. fearless adjective us\nYour browser doesn't support HTML5 audio\n/ˈfɪər·ləs/\nHe was a tough, fearless soldier.\nto be frightened about someone or something unpleasant: [ I ] The cab driver was going so fast, I feared for our safety.\nTo fear is also to be worried or upset: [ + that clause ] They fear that Congress may not allocate the money needed. Idiom\nfear the worst"}