{"id":151000,"name":"feature","type":"noun","us_sound":"ˈfiː.tʃɚ","us_link":"../audio/f/feature.mp3","uk_sound":"ˈfiː.tʃər","uk_link":"../audio/f/ukfeast010.mp3","content":"feature noun\n(QUALITY)\nAdd to word list\nAdd to word list\nB2 [ C ] a typical quality or an important part of something: The town's main features are its beautiful mosque and ancient marketplace. Our latest model of phone has several new features. A unique feature of these rock shelters was that they were dry. Synonyms\nangle (WAY OF THINKING)\naspect (FEATURE)\nfacet\ningredient\npoint (CHARACTERISTIC)\nside (PART OF SITUATION)\nstrand (PART)\n[ C ] a part of a building or of an area of land: a geographical feature This tour includes the area's best-known natural features, including the Gullfoss waterfall. The most striking feature of the house was a huge two-storey room running the entire width and height of the building.\nB2 [ C usually plural ] one of the parts of someone's face that you notice when you look at them: He has wonderful strong features.regular features She admired his good-looking face with its regular (= even and attractive) features and bright blue eyes. Her eyes are her best feature.\nMore examplesFewer examplesA unique feature of these rock shelters was that they were dry.The car has some excellent design features.He has wonderful strong features.The map shows all the important geographical features of the region.It is one of the distinctive features of her writing.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning parts of things\nThe head & face\nfeature noun\n(ARTICLE)\nC2 [ C ] a special article in a newspaper or magazine, or a part of a television or radio broadcast, that deals with a particular subject: feature on a double-page feature on global warming\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony aunt\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\nleader\nmasthead\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\nsplash\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nfeature noun\n(FILM)\n[ C ] (also feature film) a film that is usually 90 or more minutes long\nSMART Vocabulary: related words and phrases\nCinema ratings & types of film\n15\n18\naction movie\nactioner\nanimated\ncomputer-animated\ncrime\nfeature-length\nG, g\nhate-watch\nhip-hopera\nPG-13\npg.\nR-rated\nscrewball\nsexploitation\nsilent film\ntrue crime\nU, u\nX-rated\nSee more results »\nB2 to include someone or something as an important part: The movie features James Dean as a disaffected teenager. This week's broadcast features a report on victims of domestic violence. It's an Australian company whose logo features a red kangaroo.\nMore examplesFewer examplesHis latest movie featured an all-star cast.Her latest fashion collection features shimmering iridescent materials.The concert features dancers, singers and musicians of all nationalities.He's been chosen to feature in the director's next movie.There are too many radio shows featuring idiots who call in and talk trash all day.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nfeature noun [C]\n(CHARACTERISTIC)\nAdd to word list\nAdd to word list\na noticeable or important characteristic or part: This car has excellent safety features. She has fine, delicate features (= parts of the face).\nfeature noun [C]\n(NEWSPAPER/TELEVISION)\n(in newspapers and magazines or on television) a special or important article or program, esp. one that gives details about something that is not part of the main news: They're running a three-part feature on the city's child welfare agency.\nA feature is also the main movie shown in a movie program.\nfeature verb [T]\n(SHOW)\nto show or advertise someone or something as the most important or most obvious part: Tonight’s program features some outstanding performers.\nAdd to word list\nAdd to word list\nsomething that makes a product, machine, or system different, and usually better, than others of a similar type: The new smart phone has all the features of existing models, plus added extras. innovative design featuresadded/additional features The wireless network consists of a standard wireless infrastructrure, plus added features such as the ability to control the allocation of bandwidth.innovative/new feature With every software update come new features to protect users, including parental controls and spam filtering.safety/security feature Several safety features, for example, airbags, seat belts, and child seats, were tested.distinctive/distinguishing feature A distinguishing feature of Mexico's industrial structure is the large proportion of small businesses vis a vis large companies.important/key feature Reliability is the key feature of all our products. See also\ncall feature\n[ T ] to include something as part of a product, machine, or system, especially something that makes it better than others of a similar type: The latest software features built-in access to online messaging services.\n[ I ] to be included as part of something such as a plan, calculation, etc.; figure: feature in sth Wind farms, solar power, and other sources of renewable energy must now feature in the environment policy of all responsible governments."}