{"id":151090,"name":"federal","type":"adjective","us_sound":"ˈfed.ɚ.əl","us_link":"../audio/f/federal.mp3","uk_sound":"ˈfed.ər.əl","uk_link":"../audio/f/ukfeast021.mp3","content":"Add to word list\nAdd to word list\nC1 [ before noun ] relating to the central government, and not to the government of a region, of some countries such as the US: the federal government a federal agency/employee\nA federal system of government consists of a group of regions that are controlled by a central government.\nMore examplesFewer examplesThey were charged with violating federal law.All of the federal judges currently sitting in Maryland hail from Baltimore.They are accused of trying to shield the General from US federal investigators.There is strong support here for the tough economic reforms ordained in the federal capital, Prague.Managers deliberately obscured the real situation from federal investigators.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratically\ndemocratization\ndemocratize\ndespotic\ndespotically\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitics - general words\nAdd to word list\nAdd to word list\npolitics &amp; government of or connected with the central government of some countries: the federal government Federal law regulates trade with other countries. federally adverb us\nYour browser doesn't support HTML5 audio\n/ˈfed·ər·ə·li, ˈfed·rə·li/\na federally funded agency that provides free legal services to the poor\nAdd to word list\nAdd to word list\nrelating to a central government, not a state or local government: The state contributes 30% and the federal government 70% of the cost of the plan. She was charged in federal court with possessing unauthorized credit-card numbers. The employee then contacted federal agencies, including the Department of Health and Human Services. He helped secure $100 million in federal funding to rebuild the department's infrastructure. A proposed Senate bill would raise the federal tax on cigarettes by 61 cents per pack. federal laws/regulations/legislation federal grants\nhaving or relating to a system of government, especially in the US, where all the states in the country have some control over their own activities, but where central government has the main responsibility for making important decisions and laws: They have been in government for 45 of the 51 years of the German federal republic. Many Americans will protest that such local variation lies at the heart of a federal system."}