{"id":151112,"name":"federated","type":"adjective","us_sound":"ˈfed.ər.eɪ.t̬ɪd","us_link":"../audio/f/cdo1121usfede1658.mp3","uk_sound":"ˈfed.ər.eɪ.tɪd","uk_link":"../audio/f/cdo1121ukfede1546.mp3","content":"federated adjective\n(STATES)\nAdd to word list\nAdd to word list\nconsisting of a group of organizations, countries, regions, etc. that have joined together to form a larger organization or government: Brazil is a federated republic, with a civil law system. Federated systems guard against an overconcentration of power at the national level. the Federated States of Micronesia\nMore examplesFewer examplesIndependent or loosely federated provinces, with disparate interests, laws, governments, and customs tariffs, have been consolidated into a single nation.He said the central government \"must be more powerful than the federated regions.\"The Association was reorganized into a federated structure of eleven organizational member provinces.\nSMART Vocabulary: related words and phrases\nSystems of government\nabsolutism\nancien régime\nanti-apartheid\nanti-communism\nanti-federalist\ndemocratically\ndemocratization\ndemocratize\ndespotic\ndespotically\nmajority rule\nmartial law\nmatriarchal\nmatriarchy\nmeritocracy\npost-apartheid\npre-fascist\npure democracy\nregime\nreign\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: international politics & government\nfederated adjective\n(SEARCHES)\ncomputing\n&#160; specialized allowing many separate computer resources, such as collections of data (= information), to be searched at the same time: federated search Librarians can help users wade through databases by using federated search engines.federated access Federated access enables data to be accessed directly from its original location.federated database The data is stored in the federated database.\nMore examplesFewer examplesTo users and applications, data sources appear to belong to a single federated database.With larger catalogs of images, and federated or distributed search databases, I hope looking for art online will become less of a challenge and more of a pleasure. A federated network identity delivers the benefit of simplified sign-on to users by granting rapid access to resources.Independent systems connect to the Learning Resource Exchange to share learning resources in a federated way.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhexadecimal\nhill climbing\nhome automation\nhotspot\nimportation\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »\nAdd to word list\nAdd to word list\nused to describe a group of organizations, regions, countries, etc. that has joined together to form a federation (= a larger organization or government): The global accounting group runs as a federated series of national firms.\nIT used to describe a group of systems, documents, etc. that have been joined together to form a single one"}