{"id":151115,"name":"federation","type":"noun","us_sound":"ˌfed.əˈreɪ.ʃən","us_link":"../audio/f/federation.mp3","uk_sound":"ˌfed.ərˈeɪ.ʃən","uk_link":"../audio/f/ukfeast025.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] a group of organizations, countries, regions, etc. that have joined together to form a larger organization or government: the Russian federation\n[ U ] the act of forming a federation: The federation of the six original Australian states took place in 1901. He's against European federation.\nMore examplesFewer examplesThe trade federation promotes cooperation between local businesses.The chairmen are proposing that a federation of the two leagues should take place.The organization was formed in 1982 by the federation of three separate firms.Opponents argue that European federation shifts power away from nation states.A federation of charities have launched a new campaign against heart disease.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG7\nGATT\nGeneva Convention\ngeopolitical\ninternationalism\ninternationalize\noccupied\npariah\nperestroika\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nAdd to word list\nAdd to word list\na group of organizations, states, etc., that have united to form a larger organization or government: Canada is a federation of provinces and territories.\nAdd to word list\nAdd to word list\n[ C ] a group of organizations, regions, countries, etc. that have joined together to form a larger organization or government: a federation of states/companies/trade unions, etc. The United States is a federation of 50 individual states.\n[ U ] the act of forming a federation: He's against European federation.the federation of states/companies/trade unions, etc. The federation of the six original Australian states took place in 1901. See also\nlabor federation"}