{"id":151130,"name":"fee","type":"noun","us_sound":"fiː","us_link":"../audio/f/fee.mp3","uk_sound":"fiː","uk_link":"../audio/f/ukfeast028.mp3","content":"Add to word list\nAdd to word list\nB1 an amount of money paid for a particular piece of work or for a particular right or service: legal fees university fees an entrance/registration fee We couldn't pay the lawyer's fee.\nMore examplesFewer examplesThe entrance fee is six pounds, two pounds for the unwaged.Someone proposed a motion to increase the membership fee to £500 a year.The students are holding a demonstration to protest against the increase in their fees.It was something of a hollow victory - she won the case but lost all her savings in legal fees.For a nominal fee, they will deliver orders to customers' homes.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nspend\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nAdd to word list\nAdd to word list\nan amount of money charged for a service or for the use of something: an admission fee The doctor’s usual fee is $125.\nAdd to word list\nAdd to word list\nan amount of money paid for a particular piece of work or for a particular right or service: agree/charge/collect, etc. a fee He's good, but he charges huge fees.a fee of £50/$20 million/100 euros, etc. The two clubs agreed a fee of £50 million for the player.pay £1000/$20,000/90 euros, etc. in fees The airline paid $130 million in fees to advisers.cut/increase/put up, etc. fees The bank has cut its admin fees to attract new customers.fee on sth The credit-card company collects a fee on every transaction.fee for (doing) sth Some banks charge a fee for using other banks' cash machines. An agency will advise you for a fee. annual/monthly fees administrative/consulting/legal, etc. fees See also\nadvance fee\nadvisory fee\nbreak fee\nbreak-up fee\ncapitation fee\ncommitment fee\ncontingency fee\ndistribution fee\nentry fee\nflat fee\nView all\nincentive fee\nlanding charge\nlate fee\nlicence fee\nmanagement fee\nno win, no fee\nsales fee\nscale fee\ntransfer fee\nup-front fee\nuser fee"}