{"id":151150,"name":"feedback","type":"noun","us_sound":"ˈfiːd.bæk","us_link":"../audio/f/feedback.mp3","uk_sound":"ˈfiːd.bæk","uk_link":"../audio/f/ukfeed_002.mp3","content":"feedback noun [U]\n(OPINION)\nAdd to word list\nAdd to word list\nB2 information or statements of opinion about something, such as a new product, that can tell you if it is successful or liked: have feedback from Have you had any feedback from customers about the new soap? positive/negative feedback\nMore examplesFewer examplesThere was a lot of positive feedback which was very encouraging.We are always grateful to receive feedback from our listeners.There was a lot of positive feedback on your article about parenting.Feedback is very valuable as it helps us know whether we are giving out TV audience what they like.The parents do not seem to approve of the changes - the feedback so far has been rather negative.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nfeedback noun [U]\n(MACHINE)\nthe sudden, high, unpleasant noise sometimes produced by an amplifier when sound it produces is put back into it: Jimi Hendrix loved to fling his guitar around to get weird and wonderful sounds from the feedback.\nengineering\n&#160; specialized the return back into a machine or system of part of what it produces, especially to improve what is produced: feedback from Feedback from the sensors ensures that the car engine runs smoothly.\nSMART Vocabulary: related words and phrases\nAudio & video equipment\n78\naudiocassette\naudiotape\nbody cam\nboom box\nbox set\ndigital audio tape\nequalizer\nhi-fi\njukebox\nPDC\nradiogram\nstereo\nsubwoofer\ntape\ntweeter\nVCR\nvideo technology\nvideocassette\nwire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nAdd to word list\nAdd to word list\nreaction to a process or activity, or the information obtained from such a reaction: positive/negative feedback We’re hoping to get feedback on how well the program is working.\nAdd to word list\nAdd to word list\ninformation about something such as a new product or someone's work, that provides an idea of whether people like it or whether it is good: have feedback (from sb) Have you had any feedback from customers about the new soap?give sb feedback (on/about sth) The client has given us some feedback on the design. positive/negative feedback a feedback form/questionnaire/survey See also\n360-degree feedback"}