{"id":151148,"name":"feed","type":"verb","us_sound":"fiːd","us_link":"../audio/f/feed.mp3","uk_sound":"fiːd","uk_link":"../audio/f/ukfeed_001.mp3","content":"feed verb\n(GIVE FOOD)\nAdd to word list\nAdd to word list\nB1 [ T ] to give food to a person, group, or animal: I usually feed the neighbour's cat while she's away. Let's feed the kids first and have our dinner after. [ + two objects ] Do you feed your chickens corn?feed someone/something on something If you feed your dog on biscuits, it's not surprising he's so fat.feed something to someone/something The kids love feeding bread to the ducks.\nC1 [ I or T ] If a baby or animal feeds, it eats or drinks milk: The baby only feeds once a night at the moment, thank goodness. Most babies can feed themselves by the time they're a year old.\n[ T ] to be enough food for a group of people or animals: This amount of pasta won't feed ten people.\n[ T ] to produce or supply enough food for someone or something: If agriculture was more of a priority, the country would easily be able to feed itself. Feed the world/starving.\n[ T ] to give a plant substances that will help it grow: Don't forget to feed the tomatoes.\nMore examplesFewer examplesDon't forget to feed the plants while I'm away.The horse rasped my hand with his tongue as I fed him the apple.It costs a lot to feed and clothe five children.This quantity of lasagne will feed six people.It's a good idea to visit the zoo when they're feeding the animals.\nSMART Vocabulary: related words and phrases\nGiving food to people & animals\naid station\nbottle-feed\nbottle-feeding\nbreast milk\nbreastfeed\ncat-sitting\nfatted\nfatten someone/something up\nfed\nfeed someone/something up\nhand-reared\nnourish\nnursing\noverfed\noverfeed\noverfeeding\nspoon\nunderfeed\nunderfeeding\nunfed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEating\nImproving fertility & pest control\nfeed verb\n(PUT)\nC1 [ I or T, usually + adv/prep ] to supply something to a person or thing, or put something into a machine or system, especially in a regular or continuous way: be fed into The vegetables are fed into the machine at this end.be fed to The images are fed over satellite networks to broadcasters throughout the world. [ + two objects ] A member of staff had been feeding the newspaper information/feeding information to the newspaper.feed into Several small streams feed into (= join) the river near here.\n[ T ] to put fuel on or inside something that burns, to keep it burning: Remember to feed the fire while I'm out.\n[ T ] in team sports, to pass the ball or the puck to another player in your team, especially so that they can score: He fed the ball to Kanoute on the edge of the area. He fed a perfect pass to Bennett, who scored.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFuels\nGeneral terms used in ball sports\nIdioms\nbe like feeding time at the zoo\nfeed someone a linePhrasal verbs\nfeed into something\nfeed off/on something\nfeed someone/something up\nfeed noun\n(FOOD)\n[ C ] UK (US feeding) an occasion when a baby has something to eat or drink: The baby had a feed an hour ago, so she can't be hungry.\n[ U ] food eaten by animals that are not kept as pets: cattle/animal feed See also\nchickenfeed informal\n[ C ] old-fashioned a large meal\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals\nAnimal food\nfeed noun\n(MACHINE PART)\n[ C ] the part of a machine through which it is supplied with fuel or with something else that it needs: the car's oil feed the printer's paper feed\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nSee more results »\nfeed noun\n(INFORMATION)\n[ C ] a web page, screen, etc. that updates (= changes) often to show the latest information: Your Twitter feed refreshes automatically to show new tweets. A live video feed enables the \"driver\" to operate the vehicle remotely.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nfeed noun\n(BALL)\n[ C ] in team sports, an action of passing the ball or the puck from one player to another in the same team, especially so that they can score: They dominated possession in the first half and Ellis scored off a beautiful feed from Hall. He scored the first basket on a fast-break feed from Collins.\nMore examplesFewer examplesHart took a cross-ice feed from Daniels and scored from inside the right circle.A quick feed to Robinson opened the Wallabies up further.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nfeed verb\n(GIVE FOOD)\nAdd to word list\nAdd to word list\n[ I/T ] to give food to a person or animal, or of an animal to eat: [ T ] We fed the kids some leftovers. [ I ] The cows were feeding in the pasture.\n[ I/T ] If you feed a plant, you give it substances that help it grow.\nfeed verb\n(SUPPLY)\n[ T ] to supply something, esp. regularly or continuously: We had to keep feeding quarters into the parking meter.\n[ T ] If someone feeds you information, that person tells you things that may not be completely true: They fed him a line about how important this work is to our country.\nfeed noun [U]\n(FOOD)\nfood for animals, esp. animals that are not kept as pets: chicken feed\nAdd to word list\nAdd to word list\n[ T ] to give food to a person, group, or animal: These microwave meals feed two people. If agriculture were given priority, the country would soon be able to feed itself.\n[ I ] to eat something: feed on sth The beef cattle feed on grass and soya meal.\n[ I or T ] to supply something to a person or thing, or put something into a machine or system, especially in a regular or continuous way: Air is carried through a series of pipes to feed the furnace.feed sth to sb/sth The new system feeds daily updates to sales teams.feed sth into sth The data is fed into a computer and analysed.feed into sth A rise in oil prices will feed into the economy and cause general inflation.\nPhrasal verbs\nfeed back\nfeed off sth\n[ U ] food eaten by farm animals: The potato waste is used for cattle feed.\n[ C ] the part of a machine through which it is supplied with fuel or with something else that it needs: The printer has three paper feeds. the car's oil feed\n[ C ]\n&#160; IT an\nRSS feed : If you have a website, blog, audio/video content, or even photos, you can offer a feed of your content as an option."}