{"id":151184,"name":"feeling","type":"noun","us_sound":"ˈfiː.lɪŋ","us_link":"../audio/f/feeling_feel.mp3","uk_sound":"ˈfiː.lɪŋ","uk_link":"../audio/f/ukfeed_008.mp3","content":"feeling noun\n(SENSE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the fact of feeling something physical: I had a tingling feeling in my fingers. I've got this strange feeling in my stomach. My toes were so cold that I'd lost all feeling in them. Synonym\nsensation (FEELING)\nMore examplesFewer examplesI was left with a horrible feeling of emptiness.He had the feeling he was being followed.Her performance seemed to me completely lacking in feeling.People doing yoga benefit from an increased feeling of well-being.I found myself unable to articulate my feelings.\nSMART Vocabulary: related words and phrases\nThe senses in general\nhearing\nhyperacute\nhyperaesthetic\nintersensory\nnight vision\nnon-visual\nsensate\nsensately\nsensation\nsense\nsensory\nsensually\nsight\nsmell\nsynaesthesia\nsynesthesia\ntouch\nvision\nSee more results »\nfeeling noun\n(EMOTION)\nB1 [ C or U ] emotion: feeling of The feeling of loneliness suddenly overwhelmed him. There's a feeling of dissatisfaction with the government. [ + that ] I got the feeling that I was not welcome. Her performance seemed to me completely lacking in feeling. Synonym\nsensation (FEELING) feelings [ plural ]\nB1 emotions, especially those influenced by other people: Some people say that dogs have feelings.\nSee more\nSMART Vocabulary: related words and phrases\nFeelings - general words\natmospherically\naura\nbreast\ncharged\nemotional\nemotionalism\nemotionally\ngut\nhimself\nmyself\nnon-emotional\nnon-material\nsensibility\nsentience\nsentient\nspirited\nsusceptibility\nteam spirit\nthirsty\nvibe\nSee more results »\nfeeling noun\n(OPINION)\nB2 [ C ] opinion: My feeling is that we had better act quickly or it will be too late.\nMore examplesFewer examplesThere is a danger that anger at the new law may turn into anti-government feeling.The general feeling at the meeting was that a vote should be taken.The feeling among the grassroots of the Party is that the leaders are not radical enough.It's my feeling that the money spent on drug prohibition would be better spent on information and education.There is a feeling in some quarters that a change is needed.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nIdioms\nbad feeling\nfeelings for someone\nhave a/the feeling\nhurt someone's feelings\nfeeling noun\n(EXPERIENCE)\nAdd to word list\nAdd to word list\n[ C/U ] a physical or emotional experience or awareness: [ U ] My toes were so cold that I lost all feeling in them. [ C ] I have a feeling that I’m not welcome.\n[ C/U ] Your feelings are your awareness of the way you should be treated, esp. when you are treated rudely: [ pl ] He doesn’t mean to hurt your feelings.\nfeeling noun\n(OPINION)\n[ C ] an opinion or belief: My feeling is that we should wait until they come back. He has strong feelings about environmental issues.\nAdd to word list\nAdd to word list\n[ C or U ] something that you feel with your body or mind: I had a funny feeling in my stomach before my interview. The redundancies created bad feeling between the new manager and the remaining staff.\n[ C, usually singular ] an opinion or thought about something: I have a feeling that they will accept our offer. I get the feeling that staff aren't happy with the pay offer. My gut feeling is that we are launching this product too late.\n[ S ] (also feel) the character of a place or situation: The simple, clean design of the furniture conveys a sophisticated feeling."}