{"id":151177,"name":"feel","type":"verb","us_sound":"fiːl","us_link":"../audio/f/feel.mp3","uk_sound":"fiːl","uk_link":"../audio/f/ukfeed_005.mp3","content":"feel verb\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nA1 [ L or T ] to experience something physical or emotional: \"How are you feeling?\" \"Not too bad, but I've still got a slight headache.\" How would you feel about moving to a different city? He's still feeling a little weak after his operation. My eyes feel really sore. I never feel safe when Richard is driving. Never in her life had she felt so happy. My suitcase began to feel really heavy after a while. I felt like (= thought that I was) a complete idiot/such a fool. She felt his hot breath on her neck. [ + obj + -ing verb ] I could feel the sweat trickling down my back. By midday, we were really feeling (= suffering from) the heat. feel like something/doing something\nB1 to have a wish for something, or to want to do something, at a particular moment: I feel like (going for) a swim.\n[ + -ing verb ] to want to do something that you do not do: He was so rude I felt like slapping his face.\nSee more feel the cold\nto get cold quicker and more often than most people: As you get older, you tend to feel the cold more.\nSee more not feel a thing informal\nto not feel any pain: \"Did it hurt?\" \"Not at all - I didn't feel a thing.\"\nSee more\nMore examplesFewer examplesI don't feel comfortable in high heels.I feel like I've been cooped up in this flat for days.I felt unaccountably happy this morning as I left the house.Her criticism left me feeling a bit deflated.He still feels insecure about his ability to do the job.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nfeel verb\n(OPINION)\nB1 [ I or T ] to have a particular opinion about or attitude towards something: [ + (that) ] I feel (that) I should be doing more to help her. [ (+ to be) + adj ] He had always felt himself (to be) inferior to his brothers. Do you feel very strongly (= have strong opinions) about this? I feel certain I'm right.\nMore examplesFewer examplesI feel sure that I'm doing the right thing.She feels she's overdue for promotion.I felt it was my duty to tell them the truth.I feel that learning English will help my chances of promotion at work.The critics felt that the film was too long.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nfeel verb\n(TOUCH)\nB2 [ I or T ] to touch something in order to discover something about it: [ + question word ] Just feel how cold my hands are! He gently felt the softness of the baby's cheek.feel around for I was feeling around (= searching with my hand) in my bag for the keys.\nMore examplesFewer examplesHe felt the side of the kettle to see if it was still hot.He could feel the springs sticking through the mattress.Feel the temperature of the water before getting into the bath.I thought I felt a drop of rain.The vet was feeling the dog's leg to discover if it was broken.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\nGrammar\nFell or felt?Fell is the past simple of the verb fall: …\nIdioms\nfeel your age\nfeel free\nfeel it in your bones\nfeel the pain\nI feel you\nI feel your/his, etc. pain\nfeel the pinch\nfeel your way\n(do) you feel me?Phrasal verbs\nfeel for someone\nfeel someone/something out\nfeel someone up\nfeel noun\n(TOUCH)\n[ S ] the way that something feels: She loved the feel of silk against her skin.\n[ C ] mainly UK informal the action of touching something: have a feel Is that shirt silk? Ooh, let me have a feel!\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntoy\nSee more results »\nfeel noun\n(CHARACTER)\n[ S ] (also feeling) the character of a place or situation: feel to I like the decoration - it's got a Spanish feel to it.a feel of There was a feel of mystery about the place.get the feel of We were there for such a short time, we didn't really get the feel of (= get to know) the place.\nThesaurus: synonyms, antonyms, and examples\nthe character, feeling, or mood of a place or situationatmosphereThe atmosphere in the conference room was tense.ambienceIt looks like an upscale eatery, but it has a real sports-pub ambience to it.vibeThe restaurant has a casual vibe.climateDiscussion took place in a climate of deep hostility.toneHer snarky remark at the outset set the tone for the rest of the visit.feelThe tile work gives the shop a very Moroccan feel.\nSee more results »\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nfeel noun\n(UNDERSTANDING)\na feel for something (also a feeling for something)\na natural understanding or ability, especially in a subject or activity: She has a real feel for language.\nSee more get the feel of something (also get the feeling of something)\nto learn how to do something, usually a new activity: Once you get the feel of it, using a mouse is easy. It took a long time before I really got the feel of riding, but now I love it. They take part in military exercises in order to get the feel of how to fight. Once you've got the feel of the exercises, you can do them anywhere. The course taught us to get the feeling of how to handle a boat.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nfeel verb\n(EXPERIENCE)\nAdd to word list\nAdd to word list\nto experience or be aware of something emotional or physical: [ L ] \"How are you feeling?\" \"Oh, I don’t feel very good.\" [ L ] She said she didn’t want anyone to feel sorry for her. [ L ] I feel comfortable with you, Nick. [ L ] He felt compelled to report the incident. [ T ] When the anesthesia wore off, I felt a lot of pain.\nfeel verb\n(TOUCH)\n[ I/T ] to touch, esp. with the fingers, in order to examine something: [ T ] Feel the softness of the baby’s skin. [ I ] She felt around (= searched with her hands) for the light switch.\nfeel verb\n(HAVE OPINION)\n[ T ] to have as an opinion or belief: [ + (that) clause ] I feel (that) I should be doing more to help her.\nIdioms\nfeel bad\nfeel free (to do something)\nfeel good\nfeel something in your bones\nfeel like (doing) something\nfeel your wayPhrasal verbs\nfeel someone/something out\nfeel for someone\nfeel like something\nfeel like something\nfeel up to something\nfeel noun [U]\n(UNDERSTANDING)\n(also feeling, us/ˈfi·lɪŋ/) an understanding or natural ability: Marcia has a good feel for this kind of work.\nfeel noun [U]\n(TOUCH)\nthe way that something feels: I love the feel of silk against my skin.\nAdd to word list\nAdd to word list\nto experience something physical or emotional: Steve's not feeling well so he's not in the office today. We want our employees to feel good about coming to work. In some companies, workers feel pressure to work long hours. How would you feel about speaking at the conference?\nto have a particular opinion: feel (that) I feel that it's time to make some changes.feel certain (that) I feel certain I'm right.\nfeel free\nif someone tells you to feel free to do something, they mean that you can do it if you want to: feel free to do sth Feel free to email or call if you need more details.\nfeel the pinch\nto have problems with money because the things you need are too expensive or because your income has been reduced : As oil prices rise, manufacturers are starting to feel the pinch.\nfeel strongly about sth\nto have a strong opinion about something: The logo is not something we feel strongly about.\nthe way that something feels: We want our restaurants to have a homely feel.\na feel for sth\nan understanding of something, especially one that you get by experiencing something rather than learning about it: We are putting people on the ground to ensure that we are the first to get a feel for what the consumer wants.\nget the feel of sth\nto learn how to do something, usually a new activity: Once she got the feel of the business, she quickly established a reputation."}