{"id":151358,"name":"fellowship","type":"noun","us_sound":"ˈfel.oʊ.ʃɪp","us_link":"../audio/f/fellowship.mp3","uk_sound":"ˈfel.əʊ.ʃɪp","uk_link":"../audio/f/ukfeed_024.mp3","content":"fellowship noun\n(GROUP)\nAdd to word list\nAdd to word list\n[ C ] formal a group of people or an organization with the same purpose: the National Schizophrenia Fellowship the American Fellowship of Reconciliation\n[ U ] old-fashioned a friendly feeling that exists between people who have a shared interest or are doing something as a group: He enjoyed the fellowship of other actors in the company. Christian fellowship\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nsyndicate\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFriendly\nfellowship noun\n(EDUCATION)\n[ C ] the position of a fellow (= a teacher of high rank at a college): He was awarded a fellowship at the college.\n[ C ] an amount of money that is given to someone, especially a postgraduate (= someone studying for a degree at a more advanced level than a first degree), to allow them to study a subject at an advanced level: PhDs can be expensive, unless you get a fellowship.research fellowship She's applied for a research fellowship.\nSMART Vocabulary: related words and phrases\nQualifications: university & college\nAB\nassociate's degree\nBA\nbaccalaureate\nbachelor's degree\ndouble major\nDPhil\nemerita\nemeritus\ngraduation\nhonorary\nMaster's degree\nMB\nMBA\nMPhil\nMSc\npostgraduate\nPostgraduate Certificate in Education\nsumma cum laude\ntripos\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGrants & allowances\nfellowship noun\n(EDUCATION)\nAdd to word list\nAdd to word list\n[ C ] money for teaching or study given to a student studying for an advanced degree, or a position at a university paid for in this way: She applied for a fellowship to continue her studies.\nfellowship noun\n(GROUP)\n[ C/U ] people with the same purpose, experience, or interest, or a formal organization of these people: [ C ] the Artists’ Fellowship\n[ C/U ] Fellowship is also a friendly feeling that exists between people who have a shared interest or who do something as a group: [ U ] I like the game, and I enjoy the fellowship of the guys on the team.\nAdd to word list\nAdd to word list\n[ C ] the position of a fellow at a college or university: He was elected to an honorary fellowship at St John's College.\n[ C ] an amount of money that is given to postgraduate students to allow them to study a subject at an advanced level: be awarded a fellowship She was awarded a $60,000-a-year fellowship at the Duggan Institute for Global Health.apply for a fellowship He has applied for a research fellowship.\n[ C ] formal a group of people with the same interests or area of work: She is one of a small fellowship of showbusiness consultants."}