{"id":151345,"name":"fellow","type":"adjective","us_sound":"ˈfel.oʊ","us_link":"../audio/f/fellow.mp3","uk_sound":"ˈfel.əʊ","uk_link":"../audio/f/ukfeed_023.mp3","content":"Add to word list\nAdd to word list\nB2 used to refer to someone who has the same job or interests as you, or is in the same situation as you: She introduced me to some of her fellow students. Our fellow travellers were mostly Spanish-speaking tourists.\nMore examplesFewer examplesDidn't he feel guilty about betraying his fellow countrymen and women?He felt a real sense of kinship with his fellow soldiers.His fellow workers refused to accept him.He had great support from his fellow students.What do your fellow players think about that?\nSMART Vocabulary: related words and phrases\nDescribing people with the same qualities\na tough/tricky, etc. customer idiom\nbe cast in the same mould idiom\nbe of like mind idiom\nbe of the same mind idiom\nbe on the same wavelength idiom\nbe the (living/spitting) image of someone idiom\ncast\ncustomer\ndead ringer\ndoppelgänger\ndouble\nit takes a thief to catch a thief idiom\nkindred spirit\nmatch\nmeeting\nmind\nsoulmate\nstep\ntake after someone\nthief\nSee more results »\nfellow noun [C]\n(MAN)\ninformal a man, used especially in the past by people in a higher social class: He seemed like a decent fellow.\nfellow noun [C]\n(MEMBER)\nUK a member of a group of teachers of high rank at a particular college or university or of particular academic societies: Georgia's a fellow of Clare College, Cambridge.\nUK a member of an official organization for a particular subject or job: He's a fellow of the Royal Institute of Chartered Surveyors.\nUS a graduate student who has a fellowship at a university\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhomeschooler\nhousemaster\nhousemistress\ninstructor\nlecturer\nmentor\nrector\nresidence\nschoolie\nschoolmarm\nschoolmaster\nscribe\ntrainer\ntutor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\nfellow noun [C]\n(MAN)\nAdd to word list\nAdd to word list\na man: He was a big fellow with broad shoulders.\nfellow noun [C]\n(MEMBER)\na member of some groups that you must have special training to join: Dr. Rodriguez is a Fellow of the American College of Physicians.\nfellow noun [C]\n(TEACHER/STUDENT)\na teacher or student who has a fellowship at a university: He was a fellow at Harvard.\nfellow adjective [not gradable]\n(SHARED)\nused of people or a person with whom you share something, esp. the same kind of job, interest, or experience: She introduced me to a few of her fellow students.\nAdd to word list\nAdd to word list\nused to describe someone who has the same job or interests as you, or is in the same situation as you: A member of staff was sacked for stealing from fellow employees.\na member of an official organization for a particular subject or job: She is a fellow of the Royal Institute of Chartered Surveyors. a research fellow at the Institute for Fiscal Studies\na member of a group of high-ranking teachers at a particular college or university or of a particular educational society: She is a fellow of All Souls College, Oxford."}