{"id":151424,"name":"female","type":"adjective","us_sound":"ˈfiː.meɪl","us_link":"../audio/f/female.mp3","uk_sound":"ˈfiː.meɪl","uk_link":"../audio/f/ukfeed_030.mp3","content":"female adjective\n(GENDER)\nAdd to word list\nAdd to word list\nbelonging or relating to women: She was voted the best female vocalist. She was the school's first trans female athlete. See also\nfeminine (FEMALE)\nMore examplesFewer examplesHis act tended to attract a predominantly female audience.The author discusses changing ideas of female beauty.The appointment of a female director is a quantum leap for women's equality.Do you agree that male and female roles are becoming blurred ?\nfemale adjective\n(SEX)\nB1 belonging or relating to the sex that can give birth to young or produce eggs: Female lions do not have manes.\nbelonging or relating to a plant, or part of a plant, that produces flowers that will later develop into fruit: When planting cherry trees, you must plant a male tree and a female tree if you want to harvest any fruit.\nMore examplesFewer examplesOnly the female mosquito sucks blood.A female lion defends her young ferociously.A watermelon plant sprouts both male and female flowers.In the early stages of development, foetuses have the rudiments of both male and female sex organs.\nSMART Vocabulary: related words and phrases\nSpecies & genders\nclade\nclass\ncliff edge\nfemaleness\ngenera\ngenus\nhe\nholotype\nintergeneric\nmale\nmulti-species\norder\nparamecium\nphylum\nsame-gender\nshe\nspeciesism\nstrain\nsuborder\nsubspecies\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlowers - general words\nfemale adjective\n(CONNECTING PART)\nelectronics\n&#160; specialized used to refer to a piece of equipment that has a hole or space into which another part can be fitted: a female plug/connector Compare\nmale adjective (CONNECTING PART) specialized\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nRelated word\nfemalenessGrammar\nFemale or feminine; male or masculine?We use female and male to refer to the sex of humans and animals: …\nB2 a female animal: The kitten was actually a female, not a male.\nformal used in technical or scientific writing to refer to a woman or girl: The study participants included 350 males and 250 females. Note: Except in scientific writing, most people find this usage of female offensive.\nMore examplesFewer examplesThe male bird displays several characteristics which distinguish him from the female.During the rut, stags can be seen fighting for females.Males and females will be treated equally during the application process.Police are looking for a white female between the ages of 20 and 35.\nGrammar\nFemale or feminine; male or masculine?We use female and male to refer to the sex of humans and animals: …\nAdd to word list\nAdd to word list\nof the sex that can produce eggs and give birth to young: There are now more opportunities for female (= women) athletes in universities.\nIn plants and flowers, female refers to a plant which produces flowers that will later develop into fruit.\na female person or animal: The number of females competing in college sports has increased.\nAdd to word list\nAdd to word list\nbelonging or relating to women: The percentage of female managers in industry has doubled in five years.\nused to describe a piece of equipment that has a hole or space into which another part can be fitted: a female plug/connector Compare\nmale\na woman or girl: The magazine is aimed at 18–25-year-old females. The number of female-owned firms is growing."}