{"id":151447,"name":"feminine","type":"adjective","us_sound":"ˈfem.ə.nɪn","us_link":"../audio/f/feminine.mp3","uk_sound":"ˈfem.ɪ.nɪn","uk_link":"../audio/f/ukfemal003.mp3","content":"feminine adjective\n(FEMALE)\nAdd to word list\nAdd to word list\nC1 having characteristics that are traditionally thought to be typical of or suitable for a woman: With his long dark eyelashes, he looked almost feminine. The current style in evening wear is soft, romantic, and feminine. Her clothes are always very feminine. Compare\nmasculine (MALE)\nunfeminine\nMore examplesFewer examplesShe looks more feminine with longer hair.I feel more feminine in skirts and dresses.The dress combines stylish lines with an attractive floral print for a classically feminine look.\nfeminine adjective\n(GRAMMAR)\nlanguage\n&#160; (written abbreviation fem.); (f) belonging to the group of nouns that, in some languages, are not masculine or neuter: In French, \"table\" is feminine.\nlanguage used to refer to a particular form of a noun in English, such as \"actress\", that refers only to a female person. These feminine forms are now being used less often.\nMore examplesFewer examplesThe French word for 'sun' is masculine - 'le soleil', but the German word is feminine - 'die Sonne'.The definite article 'la' is used before feminine words in French and Italian.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\ngenitive\ninflected\nnominal\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nRelated word\nfemininityGrammar\nFemale or feminine; male or masculine?We use female and male to refer to the sex of humans and animals: …\nfeminine adjective\n(FEMALE)\nAdd to word list\nAdd to word list\nhaving qualities traditionally considered to be suitable for a woman: Even with the tailored look of a suit, sometimes I like to have something that’s just a little feminine.\nfeminine adjective\n(GRAMMAR)\n[ not gradable ]\n&#160; grammar\n&#160; (abbreviation fem.) being a noun or pronoun of a type that refers to females, or in some other languages, being a noun of a type that refers to things considered as female femininity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌfem·əˈnɪn·ət̬·i/\nLong hair has traditionally been regarded as a sign of femininity."}