{"id":151668,"name":"ferment","type":"verb","us_sound":"fɚˈment","us_link":"../audio/f/ferment.mp3","uk_sound":"fəˈment","uk_link":"../audio/f/ukfemal024.mp3","content":"Add to word list\nAdd to word list\nIf food or drink ferments or if you ferment it, it goes through a chemical change because of the action of yeast or bacteria, which may cause it to produce bubbles or heat, or turn sugars in it into alcohol. : You make wine by leaving grape juice to ferment until all the sugar has turned to alcohol. Sauerkraut and kimchi are both essentially fermented cabbage.\nMore examplesFewer examplesRefrigerate the beans so they do not ferment.Tap the jar to see if any bubbles rise to the top, indicating that it is fermenting.Sauerkraut is finely cut raw cabbage that has been fermented by various lactic acid bacteria.Sockerdricka is a Swedish soft drink, traditionally a fermented drink that contains ginger.To make kimchi I use the Korean fermented Chili Paste called “Gochujang\".\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\nRelated word\nfermentation\na state of confusion, change, and lack of order or fighting: The late 1960s and the early years of the 1970s were a period of ferment in western societies.in ferment The resignation of the president has left the country in ferment.\nSMART Vocabulary: related words and phrases\nSocial order & disorder\nanarchic\nanarchism\nanarchist\nanarchistic\nanarchy\nbedlam\ndisorganization\ndisorganized\ndisturb\nfree-for-all\nhavoc\ninstability\nmaelstrom\nriot\nrioting\nriotousness\nsocial exclusion\nstrife\nturbulence\nturbulent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConfusion, confusing and feeling confused\nAdd to word list\nAdd to word list\nbiology, chemistry to change chemically through the action of living substances, such as yeast or bacteria, or to use a substance to produce a chemical change\na state of confusion or excited expectation, esp. because of suddenly changing conditions: He was a central figure in the intellectual ferment of his time."}