{"id":151774,"name":"ferry","type":"noun","us_sound":"ˈfer.i","us_link":"../audio/f/ferry.mp3","uk_sound":"ˈfer.i","uk_link":"../audio/f/ukferre004.mp3","content":"Add to word list\nAdd to word list\nB1 a boat or ship for taking passengers and often vehicles across an area of water, especially as a regular service: a car ferryby ferry/on the ferry We're going to the Channel Islands by/on the ferry.take the ferry We took the ferry to Calais.\nHolger Leue/Lonely Planet Images/GettyImages\nMore examplesFewer examplesAlmost all the passengers on the ferry were French.We took the ferry across the Channel and then joined the Paris train at Calais.The ferry service has been suspended for the day because of bad weather.The strike has led to the cancellation of some ferry services and left hundreds of passengers stranded at the docks.Our ferry was two hours late because of the strike.\nSMART Vocabulary: related words and phrases\nPassenger, cargo & military ships\nbanana boat\nclipper\ncoaster\ncollier\ncontainer ship\nCorvette\ncutter\nflagship\nhovercraft\nliner\nQ-boat\nschooner\nsemi-submersible\nship\nstoreship\nsubmersible\ntall ship\ntransport ship\ntrawler\nwarship\nSee more results »\nto transport people or goods in a vehicle, especially regularly and often: ferry someone/something around I spend most of my time ferrying the children around. Synonyms\ncarry (TRANSPORT)\ncart\ndrag (PULL)\nlug informal\ntote informal\ntransport (GOODS/PEOPLE)\nThesaurus: synonyms, antonyms, and examples\nto move someone or something from one place to anothercarryThese rail cars carry coal.haulHe grew up hauling coal out of the mines six days a week.cartThe suspects were carted away by police.lugI have to lug the shopping in from the car by myself!humpHe humped the mattress up to his third-floor flat by himself.schlepI need to schlep the trash to the curb.\nSee more results »\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTransferring and transporting objects\nAdd to word list\nAdd to word list\na boat or ship for taking passengers and often vehicles across an area of water, esp. as a regular service: There’s no bridge around here, but you can take a ferry across the river.\nto transport someone or something repeatedly or regularly: As parents, we seem to spend most of our time ferrying the kids to and from their friends’ homes.\nAdd to word list\nAdd to word list\na boat or ship for taking passengers and often vehicles across an area of water, especially as a regular service: Competition from the Channel Tunnel is making life hard for the ferries. Gale-force winds have cut ferry services. ferry companies/operators"}