{"id":151903,"name":"fertilization","type":"noun","us_sound":"ˌfɝː.t̬əl.əˈzeɪ.ʃən","us_link":"../audio/f/fertilization.mp3","uk_sound":"ˌfɜː.tɪ.laɪˈzeɪ.ʃən","uk_link":"../audio/f/ukferre007.mp3","content":"fertilization noun [U]\n(LAND)\nAdd to word list\nAdd to word list\nthe action of spreading a natural or chemical substance on land or plants, in order to make the plants grow well: Leave large wood on the ground for wildlife habitat and soil fertilization. Proper fertilization of land is of great importance for good quality food.\nMore examplesFewer examplesRegular fertilization is necessary to support the growth of a tomato plant.As part of organic fertilization practice, they occasionally use cow dung and farmyard manure.One of the ideas the Romans brought to Britain was the fertilization of the soil by manuring.\nSMART Vocabulary: related words and phrases\nImproving fertility & pest control\nagrochemical\nammonium sulphate\nanti-pesticide\nbonemeal\ncoir\ncompost\nfertilize\nfungicide\nherbicide\nimprover\ninsecticidal\ninsecticide\nirrigate\nparaquat\npesticide\npotash\nrotate\nsaltpetre\nvermicompost\nweedkiller\nSee more results »\nfertilization noun [U]\n(EGG/SEED)\nthe process of causing an egg or seed to start to develop into a new young animal or plant by joining it with a male cell: In humans, fertilization is more likely to occur at certain times of the month. Following fertilization, the egg divides into two. See\nfertilize\nMore examplesFewer examplesIt takes just 15 days for a quail egg to hatch after fertilization.As is typical for frogs, fertilization occurs in the water rather than inside the mother's body.The pill is designed to suppress ovulation and prevent fertilization.\nSMART Vocabulary: related words and phrases\nAnimal reproduction\nandrogen\nanti-oestrogen\nasexual reproduction\nasexuality\nasexually\nbarrenness\ncalf\nfetal\nimpregnate\nincubate\noestrogen\nout-reproduce\npanmictic\npanmixia\nprocreation\nprocreative\nsemen\nspawn\nsterile\nzygote\nSee more results »\nAdd to word list\nAdd to word list\nbiology the process of joining male and female sexual cells to produce young"}