{"id":152117,"name":"feud","type":"noun","us_sound":"fjuːd","us_link":"../audio/f/feud.mp3","uk_sound":"fjuːd","uk_link":"../audio/f/ukfette005.mp3","content":"Add to word list\nAdd to word list\nan argument that has existed for a long time between two people or groups, causing a lot of anger and sometimes violence: family feud The family feud has been ongoing since the death of their mother.feud between a ten-year-old feud between the two countriesfeud over a bitter feud over land\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\nrhubarb\nspat\nsquabble\nSee more results »\nto have an argument with someone that exists for a long time, causing a lot of anger and sometimes violence: feud with They've been feuding with their neighbours for years. feud over Even old friends are feuding over the changes.\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nargue with someone\nargumentatively\nbandy\nbet\nbone\nconflict\ncross swords idiom\nhammer\nlock horns idiom\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nAdd to word list\nAdd to word list\nan angry and sometimes violent argument that has continued for a long time between two people, families, or groups: a feud between two influential families fig. The mayor has a longstanding feud with the media. feud verb [ I ] us\nYour browser doesn't support HTML5 audio\n/fjud/\nThe two brothers have been feuding for years."}