{"id":152193,"name":"few","type":"determiner","us_sound":"fjuː","us_link":"../audio/f/few.mp3","uk_sound":"fjuː","uk_link":"../audio/f/ukfette011.mp3","content":"few determiner, pronoun\n(SOME)\na few\nAdd to word list\nAdd to word list\nA2 some, or a small number of something: I need to get a few things in town.\nSee more\nA2 used in expressions such as \"quite a few\" to mean \"quite a large number\": I know quite a few people who have had the same problem. Lots of people at the club are under 20, but there are quite a few who aren't. I've been to Paris quite a few times. She was quite few years older than her husband. I spent a good few minutes just staring at the scene, unable to speak.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nlion\nlogjam\nmany\nmotherlode\nmulti-million\npile\nstack\nthe lion's share idiom\ntsunami\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nGrammar\nLittle, a little, few, a few(A) little and (a) few are quantifiers meaning ‘some’. Little and few have negative meanings. We use them to mean ‘not as much as may be expected or wished for’. …\nA little, a few with a nounWe use a little with singular uncountable nouns. We use a few with plural countable nouns: …\nLittle, few with a nounWe use little with uncountable nouns. We use few with plural countable nouns. They are used in formal contexts: …\n(A) little, (a) few without a nounWe can use (a) little and (a) few as pronouns. We can use them to substitute for a noun when it is obvious from the context: …\n(A) little of, (a) few ofWe use of with (a) little and (a) few when they come before articles (a/an, the), demonstratives (this, that), possessives (my, your) or pronouns (him, them): …\nA little: adverbWe use a little as an adverb of degree. It is more formal than a bit: …\nA little with adjectives, determiners, adverbsWe use a little before adjectives and adverbs to modify them. It is more formal than a bit: …\nLittle: adjectiveWe use little as an adjective to mean ‘small’: …\nIdiom\nhave a few (too many)\nfew determiner, pronoun, noun, adjective\n(NOT MANY)\nB1 a small number or not many: It was embarrassing how few people attended the party. He is among the few people I can trust. Very few people can afford to pay those prices. Few of the children can read or write yet. Few things in this world give me more pleasure than a long bath. We get few complaints.as few as According to the survey, as few as ten percent of us are happy with our jobs. The benefits of the planned changes are few. Fewer people smoke these days than used to. We received far fewer complaints than expected. Fewer than 3,500 tigers are left in the wild today. They set a new record for the fewest points scored in a season. Which picture got the fewest votes? Compare\nlittle determiner (NOT ENOUGH)Note: Few is used with countable nouns. few and far between\nC2 not happening or existing very often: Apartments that are both comfortable and reasonably priced are few and far between.\nSee more\nMore examplesFewer examplesHe created a wonderful meal from very few ingredients.There are very few fish at depths below 3,000 metres.She had a devastating beauty/charm/smile that few men could resist.It was a bit dispiriting to see so few people arriving for the meeting.The man was standing only a few feet away.The drug was equally effective and had fewer side effects.Why put the most experienced teachers in the classes with the fewest challenges?\nSMART Vocabulary: related words and phrases\nScarce, inadequate and not enough\nbe at a premium idiom\nbe thin on the ground idiom\ndearth\ndeficiency\ndeficient\ngold dust\nlousy\nmeagre\nmeagrely\nmeasly\nmingy\nnearly\nshortage\nshortfall\nshortness\nshy\nskimpily\nskinny\nsparse\nthin\nSee more results »\nGrammar\nLess or fewer?We use the quantifiers less and fewer to talk about quantities, amounts and degree. Less and fewer are comparative words. …\nLess and fewer with a nounWe usually use less with uncountable nouns. We use fewer with plural nouns: …\nLess and fewer with ofWhen we use fewer or less before articles (a/an, the), demonstratives (this, that), possessives (my, your) or pronouns (him, them), we need to use of. We use less of with singular nouns and fewer of with plural nouns: …\nLess and fewer without a nounWe can leave out the noun when it is obvious: …\nLittle, a little, few, a few(A) little and (a) few are quantifiers meaning ‘some’. Little and few have negative meanings. We use them to mean ‘not as much as may be expected or wished for’. …\nA little, a few with a nounWe use a little with singular uncountable nouns. We use a few with plural countable nouns: …\nLittle, few with a nounWe use little with uncountable nouns. We use few with plural countable nouns. They are used in formal contexts: …\n(A) little, (a) few without a nounWe can use (a) little and (a) few as pronouns. We can use them to substitute for a noun when it is obvious from the context: …\n(A) little of, (a) few ofWe use of with (a) little and (a) few when they come before articles (a/an, the), demonstratives (this, that), possessives (my, your) or pronouns (him, them): …\nA little: adverbWe use a little as an adverb of degree. It is more formal than a bit: …\nA little with adjectives, determiners, adverbsWe use a little before adjectives and adverbs to modify them. It is more formal than a bit: …\nLittle: adjectiveWe use little as an adjective to mean ‘small’: …\nIdioms\na man/woman of few words\nno fewer than\nAdd to word list\nAdd to word list\na small number, not many, or not enough (of something): He is one of the few (people) I can trust to keep a secret. a few\nA few means a small number of: I’m going to the supermarket to get a few things. We’ve been having a few problems with the new computer. \"How many tomatoes do we need?\" \"Just a few.\" Idiom\nfew and far between"}