{"id":152275,"name":"fibre","type":"noun","us_sound":"ˈfaɪ.bɚ","us_link":"../audio/f/fiber.mp3","uk_sound":"ˈfaɪ.bər","uk_link":"../audio/f/ukfette024.mp3","content":"fibre noun\n(THREAD)\nAdd to word list\nAdd to word list\n[ C ] any of the thread-like parts that form plant or artificial material and can be made into cloth: The fibres are woven into fabric.\n[ C or U ] threads when they are in a mass that can be used for making products such as cloth and rope: Natural fibres such as cotton tend to be cooler. artificial/man-made/natural fibre\n[ C or U ] one of various thread-like structures in the body, such as those found in muscle: muscle fibre(s)\n[ C or U ]\n&#160; computing\n&#160; specialized a very thin glass or plastic thread through which light can travel to carry information, especially in phone, television, and computer systems: The data travels down the fibres literally at the speed of light.fibre broadband The growth of fibre broadband subscriptions clearly indicates consumer demand for ultra-fast speeds. Synonym\noptical fibre\nMore examplesFewer examplesGlass fibre is often used as roof insulation.They refuse to buy clothes made of artificial or synthetic fibres.\nSMART Vocabulary: related words and phrases\nTextiles: general words\nbaize\nBargello\nbias\nbrocade\ncloth\ncutpiece\nmulti-stranded\nmultifilament\nnap\npadding\npile\npill\nplush\nreweave\nsuiting\nswatch\nthe weft\nwebbed\nwebbing\nyarn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubstances & structures in the body\nCords, ropes, cables & string\nCommunications - general words\nfibre noun\n(FOOD)\nC1 [ U ] a substance in certain foods, such as fruit, vegetables, and brown bread, that travels through the body as waste and helps the contents of the bowels to pass through the body easily: dietary fibre You should eat more dietary fibre to reduce the risk of bowel cancer.\nMore examplesFewer examplesIf you ate more fibre you wouldn't get constipated.You should eat more food that contains a lot of fibre, e.g. fruit, vegetables, and bread.\nSMART Vocabulary: related words and phrases\nFood - general words\naliment\nbed\nbowl of something\nbox scheme\ncarb\ndelicacy\nfarm box\nfast casual\nfast food\nfayre\nfood\ngrub\nmouthful\nnon-food\nnosh\nperishables\nportion\nproduce box\nsustenance\nwhole food\nSee more results »\nfibre noun\n(CHARACTER)\n[ U ] strength of character: moral fibre He lacked the moral fibre to be leader.\nSMART Vocabulary: related words and phrases\nStrength of will and determination\naggressiveness\nbitter\nbloody-mindedness\ncharacter\ncharacter-building\ndetermination\ninflexibility\ninsusceptible\nintransigence\ninveteracy\nmettle\npushiness\nrecalcitrance\nresiliently\nresolution\nresolve\nsingle-mindedness\ntoughness\nunsusceptible\nwilfulness\nSee more results »\nIdiom\nwith every fibre of your being\nAdd to word list\nAdd to word list\n[ C or U ] a thread-like part made from plants or artificial material which can be made into products: Natural fibres such as cotton tend to be cooler. artificial/man-made/synthetic fibre(s) They use lightweight carbon fiber for auto bodies. The data-carrying capacity of a strand of optical fibre is doubling every year."}