{"id":152449,"name":"fickle","type":"adjective","us_sound":"ˈfɪk.əl","us_link":"../audio/f/fickle.mp3","uk_sound":"ˈfɪk.əl","uk_link":"../audio/f/ukfickl001.mp3","content":"Add to word list\nAdd to word list\ndisapproving likely to change your opinion or your feelings suddenly and without a good reason: She's so fickle - she's never been interested in the same man for more than a week! The world of popular music is notoriously fickle.\nThesaurus: synonyms, antonyms, and examples\nalways becoming differentchangingWe must navigate changing attitudes about women in leadership.changeableBritish weather is notoriously changeable.variedHe has had a rich and varied career.fluidOur travel plans are fluid because of the train strike.dynamicThe Japanese economy is much more dynamic than our own.\nSee more results »\nFickle conditions are likely to change suddenly and without warning: Fickle winds made sailing conditions difficult.\nSMART Vocabulary: related words and phrases\nChanging frequently\ncapricious\ncapriciously\ncapriciousness\nchangeable\nchangeful\ninconsistency\ninconsistent\ninconsistently\ninconstant\ninconstantly\npatchiness\npatchy\nping-pong\nprotean\nraggedly\nunpredictable\nvariability\nvolatility\nyo-yoing\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing bad weather\nRelated word\nfickleness\nAdd to word list\nAdd to word list\nlikely to change your opinion or your feelings suddenly and without a good reason: He criticized the fickle behavior of football fans who cheer you one week and boo you the next.\nThe weather is described as fickle if it tends to change suddenly: Fickle winds made sailing conditions difficult. fickleness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈfɪk·əl·nəs/\nAdd to word list\nAdd to word list\nlikely to change suddenly and without warning: Do Americans know how to invest in fickle markets? The art market is as fickle and hard to predict as any other.\nlikely to change your opinion or your feelings suddenly and without a good reason: Brand loyalty is hard to get from the notoriously fickle internet community. fickleness noun [ U ]\nMany e-businesses are complaining about the fickleness of investors."}