{"id":152470,"name":"fiction","type":"noun","us_sound":"ˈfɪk.ʃən","us_link":"../audio/f/fiction.mp3","uk_sound":"ˈfɪk.ʃən","uk_link":"../audio/f/ukfickl003.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the type of book or story that is written about imaginary characters and events and not based on real people and facts: work of fiction The book is a work of fiction and not intended as a historical account. a writer of children's fiction\nC1 [ C or U ] a false report or statement that you pretend is true: [ + that ] At work she kept up the fiction that she had a university degree. When he's telling you something, you never know what's fact and what's fiction.\nMore examplesFewer examplesThis is the acclaimed historian John Taylor's first sortie into fiction.Romantic fiction and reference books are a staple of many public libraries.A thwarted love affair is the (very) stuff of fiction.Fact is intermingled with fiction throughout the book.For many television viewers the dividing line between fact and fiction is becoming increasingly blurred.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmust-read\nnovel\nnovelette\nnovelistic\nnovelistically\ntrilogy\nvade mecum\nworkbook\nya\nyoung adult\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiterature\nLies, lying & hypocrisy\nAdd to word list\nAdd to word list\nliterature the type of book or story that is written about imaginary characters and events and does not describe real people or deal with facts, or a false report or statement that you pretend is true: [ U ] She wrote detective fiction and made a good living at it. [ C usually sing ] It was a fiction, though widely believed, that he had once been rich. fictional adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈfɪk·ʃə·nəl/\nThe characters in the movie are purely fictional."}