{"id":152663,"name":"fierce","type":"adjective","us_sound":"fɪrs","us_link":"../audio/f/fierce.mp3","uk_sound":"fɪəs","uk_link":"../audio/f/ukfickl025.mp3","content":"Add to word list\nAdd to word list\nB2 physically violent and frightening: a fierce attack/battlefierce fighting Two men were shot during fierce fighting last weekend.\nThesaurus: synonyms, antonyms, and examples\nviolentviolentHer ex-boyfriend was violent.aggressiveShe was very aggressive towards the TV reporters.ferociousA ferocious dog guarded the house.fierceThe battle for the stronghold was fierce, with hundreds of soldiers killed.savageIt was a savage attack.brutalHe was jailed for the brutal crime.\nSee more results »\nB2 strong and powerful: Fierce winds prevented the race from taking place. Firefighters had to retreat from the fierce heat.\nB2 showing strong feeling or energetic activity: fierce opposition The expansion plans will face fierce opposition from environmentalists.fierce resistance Despite fierce resistance, the merger went ahead.fierce competition There is fierce competition to join the Special Branch.\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nUS informal difficult: The chemistry exam was fierce!\ninformal approving looking confident and acting in a way that shows that you feel good about yourself and your appearance: The girl group look fierce around a swimming pool in the video for their new single.\nMore examplesFewer examplesThere was fierce combat between the two sides.His detractors claim that his fierce temper makes him unsuitable for party leadership.Despite fierce competition she made a gallant effort to win the first medal of the championships.She has published a fierce anti-war polemic.There's fierce rivalry for the job.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierceness\nfighting words\nflex\noutrage\nproactive aggression\npugnacious\npugnaciously\npugnacity\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysically strong and powerful\nEnergetic and lively\nStrong feelings\nComplicated and difficult to do\nConfidence & self-assurance\nRelated word\nfiercenessIdiom\nsomething fierce\nAdd to word list\nAdd to word list\nviolent and forceful: fierce thunderstorms The city had been under fierce attack.\nFierce can also mean severe or extremely strong: She’s a fierce critic of US policies. He was a fierce competitor."}