{"id":152726,"name":"fight","type":"verb","us_sound":"faɪt","us_link":"../audio/f/fight.mp3","uk_sound":"faɪt","uk_link":"../audio/f/ukfifte008.mp3","content":"Add to word list\nAdd to word list\nB1 [ I or T ] to use physical force to try to defeat another person or group of people: There were children fighting in the playground. The soldiers fought from house to house.fight with They fought with (= on the side of) the North during the Civil War.fight against The army fought against the rebels along the eastern border.fight over The birds were fighting over (= competing for) a scrap of food.fight like cats and dogs They fight like cats and dogs (= fight or argue very angrily and violently).fight to the bitter end/to the death They fought to the bitter end/to the death (= until everyone on one side was dead or completely defeated).\nThesaurus: synonyms, antonyms, and examples\nto fightfightAll this is really not worth fighting over.scrapTwo boys were scrapping in the playground.brawlThe football hooligans are out brawling again.clashStudents clashed with police during demonstrations at five universities.struggleSome of the customers struggled with the robbers, but to no avail. come to blowsSupporters nearly came to blows with each other before the match.\nSee more results »\nB2 [ I or T ] to use a lot of effort to defeat or achieve something, or to stop something happening: He fought the disease bravely for three years.fight crime We need the public's help in fighting crime.fight against He fought against racism. Vitamin C is thought to help fight colds and flu.fight for They had to fight hard for improvements to the road system.fight for your life One of the passengers was fighting for her life (= so ill or injured that she might die) last night after receiving multiple injuries in the collision. With debts of over $2 million, the corporation is fighting for its life (= people are trying hard to stop it being destroyed)fight (back) I had to fight (back) (= tried hard not to show or produce) the tears when he said he was leaving.fight something off The bank fought off (= successfully prevented) a takeover by another bank recently. I was getting a cold at the start of the week but I seem to have fought it off (= got rid of it).\nB2 [ I ] informal to argue: I wish they wouldn't fight in front of the kids.fight about I could hear them fighting about money again.\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\n[ I or T ] in sports such as boxing and wrestling, to compete against another fighter to try to win a competition: He hopes to fight the WBC middleweight champion in July.fight for He will fight for the heavyweight title later this year.\nMore examplesFewer examplesWe didn't win this time, but we live to fight another day.Several opposition groups are fighting to remove the president from power.You can accuse me of cowardice, but I still wouldn't volunteer to fight in a war.These organizations have fought very hard for the rights and welfare of immigrants.They fought desperately for their lives.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nResponding to an attack\nArguing & disagreeing\nFighting sports\nIdioms\nfight your corner\nfight a losing battle\nfight fire with fire\nfight it out\nfight shy of\nhe who fights and runs away, lives to fight another dayPhrasal verb\nfight back\nB1 [ C ] an argument or an occasion when someone uses physical force to try to defeat someone: get into/start a fight Jeff's always getting into/starting fights.break up a fight The older boys broke up (= stopped) the fight.stand-up fight with UK I had a stand-up fight with her (= we argued strongly) about the phone bill.put up a fight He put up a fight when the police tried to arrest him.\nThesaurus: synonyms, antonyms, and examples\na fightfightHe got into a fight in school. fistfightHe was arrested for getting into a fistfight after the match.brawlHe was injured in a brawl outside the stadium.scuffleThere were a few scuffles between fans after the match.clashFive people were injured in clashes between strikers and owners.struggleHe managed to escape after a struggle.\nSee more results »\nB2 [ C ] a situation in which you use a lot of effort to defeat someone or achieve something, or to stop something happening: the fight against We must continue the fight against homelessness.fight with He died last week after a long fight with cancer.put up a good fight against They put up a good fight (= played well) against a more experienced team.\n[ C ] in sports such as boxing and wrestling, a competition between two fighters: title fight Williams is preparing for his world heavyweight title fight next month. win a fight Thompson won his first four professional fights.the fight Do you have tickets for the big fight (= boxing competition)? See also\nbout\n[ U ] the wish or ability to fight or act energetically: The team came out on the field full of fight.\nMore examplesFewer examplesThe place emptied pretty quickly when the fight started.Nelson Mandela is revered for his brave fight against apartheid.He had a fight at school and came home with a black eye.Police urged continued vigilance in the fight against crime.I left the pub to avoid a fight .\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArguments & disagreements\nEffort and expending energy\nFighting sports\nStrength of will and determination\nExcitement, interest, energy and enthusiasm\nIdiom\na fight to the finish\nAdd to word list\nAdd to word list\nto argue with or use force against another person or a group of people, or to oppose something: [ T ] Rebels have been fighting fierce battles with government forces. [ I ] They’re fighting against some powerful organizations. [ I ] She’s willing to fight for a more just society. [ I ] Those two little kids were fighting over a toy. [ T ] Gordon has been fighting an uphill battle to attract investors.\nTwo people who fight may be boxing: [ T ] Lewis will fight Akinwande for the heavyweight title. fighting noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈfɑɪt̬·ɪŋ/\nThe fighting lasted a long time. Idiom\nfight it outPhrasal verbs\nfight something back\nfight something off\nfight back\nan argument, or an occasion when someone uses force to defeat someone or oppose something: Isabelle is looking for a fight. A patient’s attitude is important in the fight against the disease. Have you got tickets for the fight (= a competition between two boxers)?"}