{"id":152728,"name":"fighter","type":"noun","us_sound":"ˈfaɪ.t̬ɚ","us_link":"../audio/f/eus71815.mp3","uk_sound":"ˈfaɪ.tər","uk_link":"../audio/f/ukfifte009.mp3","content":"fighter noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\nsomeone who fights in a battle or in a physical fight against an opponent: He had a reputation as a fearless fighter.\nsomeone who continues to try hard and will not give up easily when things are difficult: Our daughter has been in and out of hospital with so many different medical issues, but she is a fighter.\nMore examplesFewer examplesGovernment forces were pinned down by resistance fighters 30 miles north of the capital.The fighters had to be separated by the referee.Both fighters were exhausted by the final round.The odds are against the young Senator but he's a fighter and intends to stay in the race.She is a true fighter and she is resolved to beat this disease.\nSMART Vocabulary: related words and phrases\nSoldiers & people who fight in wars\nanti-guerrilla\nAnzac\nberserker\ncapability\ncavalryman\ncombat engineer\ncomrade\nex-serviceman\nex-servicewoman\nfoot soldier\nheadhunter\nparamilitary\nraider\nrecruit\nscout\nskirmisher\nsoldier of fortune\nunsoldierly\nvassal\nwar party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStubborn and determined people\nHeroes and cowards\nfighter noun [C]\n(AIRCRAFT)\na small, fast military aircraft used for chasing and destroying enemy aircraft: a fighter plane/aircraft a fighter pilot\nMatt Ottosen ~ Ottosen Photography/Moment/GettyImages\nMore examplesFewer examplesThe circuitry in this fighter aircraft has been protected against strong magnetic fields.A fighter plane flew over.The film stars Mark Burgess-Ashton as the gung-ho young fighter pilot.The supersonic fighter plane was shot down by a missile.The fighters are equipped with the latest radar technology.\nSMART Vocabulary: related words and phrases\nThe Air Force\nair force\nair power\nairbase\ndive-bomber\ndogfight\nflyover\ninterceptor\nroundel\nslow roll\nstealth bomber\nthe RAF\nthe USAF\nWRAF\nAdd to word list\nAdd to word list\nsomeone who is willing to argue for and put effort into what he or she believes: She proved herself to be a real fighter. Ali was the greatest fighter (= boxer) of all time.\nA fighter is also a small, fast military aircraft."}