{"id":152768,"name":"figure","type":"noun","us_sound":"ˈfɪɡ.jɚ","us_link":"../audio/f/figure.mp3","uk_sound":"ˈfɪɡ.ər","uk_link":"../audio/f/ukfifte014.mp3","content":"figure noun [C]\n(NUMBER)\nAdd to word list\nAdd to word list\nB1 the symbol for a number or an amount expressed in numbers: Can you read this figure? Is it a three or an eight? Write the amount in both words and figures.column of figures I looked quickly down the column of figures. He earns a six-figure salary (= an amount of money with six figures). in single/double figures\nC2 between 1 and 9/between 10 and 99: The unemployment rate is now in double figures.\nSee more\nMore examplesFewer examplesThe anticipated inflation figure is lower than last month's.These figures are expressed as a percentage of the total.This month's sales figures offer a glimmer of hope for the depressed economy.These figures mean that almost 7% of the working population is unemployed.The lawn was laid out in the form of the figure eight.\nSMART Vocabulary: related words and phrases\nNumbers generally\nbinary number\nC, c\ncardinal\ncontextual variable\ncontinuous variable\ncontrol variable\ncrore\nD, d\ndigit\nlakh\nlog\nmode\nnos.\nnumber\nordinate\noutcome variable\nplace value\nprimality\nquantitatively\nwhole number\nSee more results »\nfigure noun [C]\n(SHAPE)\nB2 the shape of the human body, or a person: I could see two tall figures in the distance. A strange bearded figure (= person) entered the room.central/key/leading figure figurative She was a central/key/leading figure in (= was an important person in) the movement for constitutional reform.\na painting, drawing, or model of a person: There are several reclining figures in the painting.\nB1 a woman's body shape: She's got a beautiful figure.get your figure back She got her figure back (= returned to her usual shape) after having the baby.\nMore examplesFewer examplesShe chiselled a figure out of the marble.He was a familiar figure on the lecture circuit.His geniality, reliability and ability made him a popular figure.The inert figure of a man could be seen lying in the front of the car.Bill perceived a tiny figure in the distance.\nSMART Vocabulary: related words and phrases\nThe body\n-bodied\nanimal\naxial\nbiodynamics\nbiomechanics\nbod\nbodily\nbody\nbuild\ncorporal\ncorporeal\ncorporeality\nendomorph\nflesh\nframe\nhyperphysical\ninternally\nmesomorph\nmind-body\nphysical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople in general\nPictures\nfigure noun [C]\n(PICTURE)\nB2 (written abbreviation fig.) a picture or drawing, often with a number, in a book or other document: Please see figures 8 and 9.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nIdioms\na fine figure of a man/woman\nput a figure on it\nfigure verb\n(EXPECT)\nB1 [ I ] mainly US to expect or think that something will happen: [ + (that) ] We figured (that) you'd want to rest after your trip.\nMore examplesFewer examplesHe figured that they would offer the job to someone else.I figure that you'll want to eat before we go out.We figured that the train would be delayed.They figured that there might be a problem with the building work.She figures that she'll be able to save money by cycling to work.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nfigure verb\n(APPEAR)\n[ I usually + adv/prep ] to be, appear, take part, or be included in something: figure in Their names did not figure in the list of finalists. They denied that violence and intimidation had figured prominently in achieving the decision.\nSMART Vocabulary: related words and phrases\nIncluding and containing\nabsorptive capacity\naccessibly\nall in\nassimilable\nassimilate\ncarry\nconcern\ndrag\ndraw\nEDI\nEDIB\nembody\nembracingly\nencompass\nincorporation\ninvolve\nnumber someone/something among someone/something\nO, o\npack something in\nplug\nSee more results »\nfigure verb\n(NUMBER)\n[ T ] US to calculate an amount: I'm still figuring my taxes.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nsum\nsum total\nwork something out\nSee more results »\nIdioms\ngo figure!\nit figuresPhrasal verb\nfigure something/someone out\nfigure noun [C]\n(NUMBER)\nAdd to word list\nAdd to word list\na number or an amount: The collection was valued at $20 million, a figure that might cover the cost of having artists recreate the drawings.\nfigure noun [C]\n(SHAPE)\na shape or form: geometric/abstract figures\nfigure noun [C]\n(BODY)\nthe shape of a person’s body, or a body seen not clearly or from a distance: I could see two figures crossing the field in the distance.\nfigure noun [C]\n(PERSON)\nA particular type of figure is a person with that characteristic: Our consultants are prominent figures in their field.\nfigure noun [C]\n(PICTURE)\n(abbreviation fig.) a picture or drawing, often numbered, in a book or document: Figure 10.3 shows the maximum length of the bridges. Idiom\na figure of speech\nfigure verb [I/T]\n(EXPECT)\nto expect, believe, decide, or think that something will happen or that certain conditions will exist: [ + (that) clause ] They figured (that) about twenty people would be there. [ I ] You can’t figure on going out and being back in two hours.\nfig. If something figures, you are unhappy about it but you expected it: [ I ] \"He’ll be late for dinner.\" \"That figures!\"\nPhrasal verb\nfigure out someone/something\nAdd to word list\nAdd to word list\nan amount shown as a number, used especially in documents and reports: Overall Christmas sales figures released earlier this week were disappointing.official/government figures US exports to Saudi Arabia were valued at 6.2 billion dollars, according to official figures.latest/final/interim figure The latest figures show that average spending on food is now around 15% of income.closing/opening/preliminary figure Many professionals prefer this chart as it shows the full range of the price movements rather than just the closing figure.a high/low figure A high figure may indicate that the economy is overheating, as consumers borrow in order to live beyond their means.average/rough/approximate figure He was able to give me an approximate figure of £36,000. In five years they plan to have 2,010 stores - almost double the current figure.the actual/exact figure I can't remember the exact figure, but it was $10 billion or thereabouts.unemployment/crime figures There was positive news in the labour market, with unexpectedly good unemployment figures.listening/viewing/attendance figures Listening figures for the breakfast show have risen, helping the station push its audience share back over 10 per cent.\na number shown as a symbol rather than a word: The figure 6 was clearly marked on the door. Write 'twelve thousand and fifty six' in figures.\nan important or well-known person: public/industry/political figure Public figures from athletes to religious leaders have campaigned on the issue.central/key/major figure She is a central figure in the sport and the president of its dominant organization.senior/leading/prominent figure The controversial paper was attacked by many prominent figures within the scientific establishment.government/corporate figure Normally a routine overseas trip by a government figure would hardly warrant attention.\nput a figure on sth\nto give an exact amount or number: It is difficult to put a figure on the cost of the repair work, as it is still rising.\nsingle/double figures\nthe numbers 1 to 9/10 to 99: Many of these companies have low price-earnings ratios, some in single figures. There are fears that inflation could soon run into double figures.\nsix-figure/seven-figure\nused to describe a number in the hundreds of thousands or millions: She has a top City job with a six-figure salary.\n[ T ] to calculate something: figure that Economists figure that the average snowmobiler spends about $555 per visit to the Yellowstone area.\n[ I ] to appear or to be included in something: figure in sth The cost of higher education is expected to figure prominently in all of the parties' policies this November. Phrasal verb\nfigure out"}