{"id":152861,"name":"file","type":"noun","us_sound":"faɪl","us_link":"../audio/f/file.mp3","uk_sound":"faɪl","uk_link":"../audio/f/ukfifte022.mp3","content":"file noun\n(CONTAINER)\nAdd to word list\nAdd to word list\nA2 [ C or U ] any of several different types of container used to store papers, letters, and other documents in an ordered way, especially in an office: a box/envelope file secret/confidential/personnel filesin the file You'll find it in the files under \"C\".on file We keep your records on file for five years.\nmalerapaso/iStock / Getty Images Plus/GettyImages\nMore examplesFewer examplesI've lost a file containing a lot of important documents.I deleted the file by accident.In 1982, the management ordered the deletion of all computer files on this subject.I've reorganized my files so that I can easily find what I'm looking for.Make a file for these documents and write \"finance\" on the tab.\nfile noun\n(WRITTEN RECORD)\n[ C ] written records that are kept about a particular person or subject: open a file on The police have opened a file on local burglaries.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nfile noun\n(COMPUTER)\nA2 [ C ] information stored on a computer as one unit with one name: What's the file name? I'm going to copy/save this file.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nfile noun\n(LINE)\n[ C or U ] a long line of people or animals, one behind another: file of They were horrified to see files of ants marching through the kitchen.in (single) file They walked in (single) file (= one behind another).\n© Marco Bottigelli/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nThings collected in lines or rings\nchain\ncolumn\ncrocodile\ninterrow\nline\nqueue\nrank\nring\nrope\nrow\nsingle file\nstring\nthread\ntier\ntrain\ntwo-tier\nfile noun\n(TOOL)\n[ C ] a thin, flat or rounded metal tool with rough surfaces for rubbing wooden or metal objects to make them smooth or to change their shape\nSMART Vocabulary: related words and phrases\nTools\n-pronged\nadjustable spanner\nadze\nAllen key\nauger\nawl\ngimlet\ngouge\ngrapnel\ngrappling iron\ngrindstone\nguillotine\npincer\nplunger\nprong\nrasp\nrazor knife\nreamer\nsander\ntrowel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: carpentry & joinery\nfile verb\n(STORE/RECORD INFORMATION)\n[ T ] to store information in a careful and particular way: file something under something We file these reports (= put them in a file) under country of origin.\n[ T ] to send a document to an official authority, especially a tax authority, giving information or making a request: Not filing a tax return can get you into big trouble. A separate form should be filed for each tax year that nondeductible contributions are made. Related word\nfiler\n[ T ]\n&#160; law\n&#160; specialized to officially record something, especially in a law court: The police filed charges against the two suspects.\nThesaurus: synonyms, antonyms, and examples\nto accuse someone of somethingaccuseHe was accused of statutory rape.make an accusation againstShe was arrested for making false accusations against her former employer.level an accusation againstFerguson was furious at the accusations levelled against his player.level a charge againstShe denied all the charges levelled against her.hurl accusations atShe hurled accusations at her ex-husband across the courtroom.charge someone withHe was charged with three counts of fraud.\nSee more results »\n[ T ] News reporters file a story by sending it to their office, usually by phone, email, or other electronic method: Our foreign correspondent filed this report earlier today.\nMore examplesFewer examplesIf you wish to take the matter further, you can file charges against him.Two of the directors have filed a lawsuit against their former employer.She's filing a petition for divorce.Please file these documents with the others.All the folders have been carefully numbered and filed away.\nSMART Vocabulary: related words and phrases\nOffice practices\nadmin\nadministrative\nadministratively\nbadge in\nbadged\ndictate\ndictation\nhuman resources\nhygiene factor\nin-house\ninteroffice\nkaizen\nphotocopy\nphotostat\npower breakfast\npower lunch\npp\nremittance\nscrum\ntyping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\nTaxation\nCourt cases, orders & decisions\nNews reporting & the press\nfile verb\n(WALK IN A LINE)\n[ I usually + adv/prep ] to walk in a line, one behind another: file through The visitors filed through the entrance to the ticket offices.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhoof it idiom\nrace walking\nrambler\nrambling\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\ntrekking pole\nwalk\nwalkable\nwalkabout\nwalkies\nSee more results »\nfile verb\n(TOOL)\n[ I + adv/prep, T ] to use a file in order to make an object smooth or to change its shape: file (down) File (down) the sharp edges. [ + obj + adj ] The surface had been filed smooth.file your nails She filed her nails.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »\nPhrasal verb\nfile for something\nfile noun\n(COLLECTION)\nAdd to word list\nAdd to word list\n[ C/U ] a folded piece of stiff paper used to store papers, letters, or other documents in an ordered way, esp. in an office, or a box or container in which documents are stored: [ C ] You’ll find it in the files under C. [ U ] We keep your records on file for five years.\n[ C/U ] A file in a computer is a collection of information stored as one unit with one name: [ C ] I’m going to copy/save this file.\nfile noun\n(LINE)\n[ C/U ] a line of people or animals, one behind another: [ U ] They walked (in) single file.\nfile noun\n(TOOL)\n[ C ] a usually flat tool with rough surfaces for rubbing objects to make them smooth or to change their shape\nfile verb\n(STORE)\n[ T ] to store papers, letters, or other documents in an ordered or particular way: We file the reports by zip code.\n[ T ] To file something can mean to make an official record of it, or to begin a legal process: to file an insurance claim to file criminal charges\nfile verb\n(WALK IN LINE)\n[ I always + adv/prep ] to walk in a line, one behind another: The bride’s family filed in.\nfile verb\n(USE TOOL)\n[ I/T ] to use a tool with rough surfaces in order to make an object smooth or to change its shape: [ T ] She carefully filed her nails before applying nail polish.\nAdd to word list\nAdd to word list\nIT a collection of information that is stored on a computer as one unit under one name: text/computer/image file Click on the command and a box pops up showing how big the text file is and how long it should take to save to your hard drive.save/create/copy a file It's best to save the file to a common directory.open/read/view a file You will need Adobe Acrobat installed in order to open the file.write to/edit a file It is necessary to designate a group of people who are allowed to edit the file.close/delete a file If you reboot your computer with the startup disk in the drive, you'll get to a prompt from which you can delete the file.\na written record kept on a person, subject, or organization: Employees who get an award for good work have a notice of it put in their employee file. The FBI does not keep a file on every citizen of the United States.refer to/read a file The company won't know the full details until they have read his file.\na container used to store papers and other documents together, especially in an office: Many organizations are doing good work around policy, but too often it sits forgotten in a file somewhere.\non file\nkept as part of a written record on paper or on a computer: I received an acknowledgment from the HR department that my name was on file. You should keep it on file for future reference. See also\nbox file\ndata file\nlog file\nPDF\nprogram file\ntext file\nzip file\nto store information or documents carefully so that they are easy to find, either in a place such as a folder or desk, or on a computer: The effective e-manager will make it clear where on the system to file documents.file sth under sth An organization with initials in the name, eg W H Smith, will be filed under the initial, in this case W.file sth away It's tempting to file away all the paperwork relating to your pension and forget about it.\nLAW to officially record something such as a complaint: file a lawsuit/a suit/charges He is planning to file a lawsuit against the current chairman for an alleged violation of a clause in his contract. file a complaint/claim/petition\nACCOUNTING to officially send something such as your accounts: Any gain or loss should be reported when you file your tax return. It was found that the company had failed to file accounts at Companies House."}