{"id":152976,"name":"fill","type":"verb","us_sound":"fɪl","us_link":"../audio/f/fill.mp3","uk_sound":"fɪl","uk_link":"../audio/f/ukfill_001.mp3","content":"fill verb\n(SPACE)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to make or become full; to use empty space: fill something with something I filled the bucket with water. I could hear the tank filling. She filled most of her time watching TV.figurative Happy sounds filled the room (= could be heard everywhere in the room).\nC2 [ I or T ] to put a substance into an empty space: fill (in) Before painting, fill (in) all the cracks in the plaster.be filled with These cakes are filled with cream.fill a need/gap in the market figurative The product clearly filled a need/gap in the market.\n[ T ] to make someone have a particular feeling: fill someone with something figurative The thought of it fills me with (= makes me feel) dread.\n[ T ] to put a substance into a hole in a tooth to repair it: You should get that cavity filled.\nMore examplesFewer examplesOn New Year's Eve, thousands of revellers fill Trafalgar Square.The thought of speaking in front of so many people fills me with horror.The setting sun filled the sky with a deep orange glow.The perfume of the roses filled the room.The bath was filling with water.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nround\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiring feelings in others\nFeelings - general words\nDentistry\nfill verb\n(JOB)\nC1 [ T ] to give a job or position to someone: fill a job/post/vacancy I'm sorry, the job/post/vacancy has already been filled.fill something with someone We would prefer to fill the position with (= give it to) a recent graduate.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nGrammar\nFull or filled?Full is an adjective, and means ‘containing a lot’: …\nIdioms\nfill your boots\nhave big shoes to fillPhrasal verbs\nfill something in/out\nfill someone in\nfill in\nfill out\nfill (something) up\nfill someone up\nsomeone's fill is as much as they want or can deal with: eat/drink your fill He took only a few minutes to eat/drink his fill.fill of I'd had my fill of his rude remarks.\nSMART Vocabulary: related words and phrases\nEnough\nadequacy\nadequate\nadequately\ngo\ngo round\ngood\nhold\nhold out\nrespectable\nrespectably\nsatiable\nsatisfiable\nsay\nsay when idiom\nsufficiency\nsufficient\nsufficiently\nthat\nthat will do idiom\nthe\nSee more results »\nAdd to word list\nAdd to word list\nto make or become fuller or full; to use empty space: [ T ] I filled the bucket. [ I ] After all that rain, the reservoirs are finally filling. [ T ] The dentist says I need to have four teeth filled (= treated to replace decayed material).\nIf a product or service fills a need, it gives people something they want.\nTo fill a job or position is to employ someone to do that job: [ T ] I’m sorry, the position has already been filled. Idiom\nfill someone’s shoesPhrasal verbs\nfill someone/something with something\nfill in\nfill in someone\nfill in/out something\nfill out\nfill up something\nan amount that is enough: to eat/drink your fill Idiom\nget your fill of something\nAdd to word list\nAdd to word list\nto employ someone to do a job: fill a vacancy/post/position It took us over a year to fill that vacancy.\nto do a job: fill a vacancy/post/position A former state district judge will fill the vacancy created following the CEO's resignation. He was political editor of the Sunday Mirror, then filled the same role at Today newspaper.\nto provide something such as a product or service that someone wants or needs: fill a gap/niche The theory is that the government's venture-capital funds can fill a gap in the market for start-ups.fill a demand/need A new business must fill both a need and a demand. Selling something people need but don't want is noble but not profitable.\nto supply a customer with the product or service they have requested: The defence ministry called for bids to fill an order for 126 fighter jets. Phrasal verbs\nfill in\nfill out\nfill up"}