{"id":153015,"name":"film","type":"noun","us_sound":"fɪlm","us_link":"../audio/f/film.mp3","uk_sound":"fɪlm","uk_link":"../audio/f/ukfill_007.mp3","content":"film noun\n(MOVING PICTURES)\nAdd to word list\nAdd to word list\nA1 [ C or U ] mainly UK (US movie) a series of moving pictures, usually shown in a cinema or on television and often telling a story: What's your favourite film? We took the children to (see) a film. She had a long career in films/film (= the business of making films). a film star/critic the film industry a film-maker Her last film was shot (= made) on location in South America. I hate people talking while I'm watching a film. Would you like to go and see a film tonight?\nMore examplesFewer examplesThe music was specially composed for the film.I didn't find the ending of the film very convincing.Is the film available on DVD?The end of the film was much more exciting than I'd expected.I like films with a lot of action.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nfranchise\nprojection\nremake\nrerelease\nrescreen\nreshoot\nreshow\nsting\ntheatrical\nSee more results »\nfilm noun\n(MATERIAL)\n[ C or U ] (a length of) dark plastic-like material that can record images as photographs or as a moving picture: roll of film I developed my last roll of film from the trip last night. a 24 exposure/16 mm/high-speed film A passer-by recorded the incident on film. I'm getting my film developed at the chemist's.\nMore examplesFewer examplesThe film had been over-exposed.She develops her own film.Digital cameras do not need film.We shot 7 rolls of film on our holiday.The editor had carefully cut and spliced the sections of film together.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngrainy\nhalation\nhappy slapping\nhi-res\nhigh-resolution\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nfilm noun\n(LAYER)\nC2 [ C ] a thin layer of something on a surface: film of Everything in the room was covered in a fine film of dust. a film of smoke\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratify\nlagging\nlayer\nlayered\nlined\nseam\nsheath\nstratum\nsubstratum\nsuperstratum\ntar paper\ntarpaulin\nuncover\nvein\nSee more results »\nB1 to record moving pictures with a camera, usually to make a film for television or the cinema: Most of the scenes were filmed in a studio. They filmed for a week in Spain.\nMore examplesFewer examplesThe crew has gone to Africa to film a wildlife documentary.They were filmed against a background of dark fir trees.The old newsreels were filmed in black and white.He's just completed filming his 17th feature film.A special lens was needed in order to film this sequence.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nfranchise\nprojection\nremake\nrerelease\nrescreen\nreshoot\nreshow\nsting\ntheatrical\nSee more results »\nPhrasal verb\nfilm over\nfilm verb [I/T]\n(PICTURE)\nAdd to word list\nAdd to word list\nto make pictures of something in making a movie, or to make a movie: [ T ] Her last movie was filmed in Spain.\nfilm noun\n(MATERIAL)\n[ U ] (a length of) dark, thin material like plastic on which you can record images as photographs or as moving pictures: a roll of film I didn’t get my film developed yet.\nfilm noun\n(LAYER)\n[ C ] a thin layer of something on something else: A film of oil glistened on the surface of the water.\nfilm noun\n(PICTURE)\n[ C ] a movie"}