{"id":153070,"name":"filter","type":"noun","us_sound":"ˈfɪl.tɚ","us_link":"../audio/f/eus71821.mp3","uk_sound":"ˈfɪl.tər","uk_link":"../audio/f/ukfill_015.mp3","content":"filter noun [C]\n(EQUIPMENT)\nAdd to word list\nAdd to word list\nC2 any of several types of equipment or devices for removing solids from liquids or gases, or for removing particular types of light: a water filter a dust filter Ozone is the earth's primary filter for ultraviolet radiation.\na thin piece of plastic or glass placed in front of a camera lens in order to change the colour or amount of light entering it: I like to experiment with different light filters on my camera.\n8ran/iStock/Getty Images Plus/GettyImages\na tool for selecting or removing a particular type of information: You can apply filters to capture the most relevant data. A filter on the company computer network is designed to block obscene material.\na tool for creating special effects on an image: There's a filter that makes all your pictures look like old sepia photographs. Instagram/Snapchat filters\nSMART Vocabulary: related words and phrases\nStraining & filtering devices\nair filter\nbutter paper\ncoffee filter\nfilter bed\nfilter paper\nfunnel\ngreaseproof paper\nHEPA filter\nhopper\nparchment paper\nsalad spinner\nsieve\nsifter\nskimmer\nstrainer\ntea strainer\nwater filter\nwringer\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nTools\nComputer programming & software\nfilter noun [C]\n(TRAFFIC)\nUK a green, arrow-shaped light that is part of a set of traffic lights and tells drivers when they can turn left or right: a traffic filter a left/right filter\nalxpin/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nRoads: lights, signs & markings on roads\nanti-billboard\nBelisha beacon\nbillboard\nbollard\nbus lane\nlamppost\nmilestone\nno standing phrase\nno waiting phrase\npylon\nreflector\nroadblock\nsharrow\nsignpost\nstop light\nstop sign\nthe lights phrase\nwait\nyellow line\nzebra crossing\nSee more results »\nfilter verb\n(APPEAR GRADUALLY)\nC2 [ I + adv/prep ] to appear or happen gradually or to a limited degree: filter down News filtered down to us during the day.filter in Reports about an accident began to filter in.filter through Sunlight filtered through the branches.\nSMART Vocabulary: related words and phrases\nAppearing & disappearing\nact\nappear\nBermuda Triangle\nbubble up\ncreep\ncreep in/creep into something\ndeliquesce\ndissolve\nmelt away\npass\nre-emergence\nreappear\nreappearance\nrematerialize\nspring\nsprout\nvanish\nvanish/go up/disappear in a puff of smoke idiom\nvanishing\nwind\nSee more results »\nfilter verb\n(REMOVE)\nC2 [ T ] to remove solids from liquids or gases, or to remove particular types of light, using special equipment: The water is filtered to remove any impurities.filter (out) Devices in the two chimneys would filter (out) (= remove) radioactive dust.\n[ T ] to select or remove a particular type of information from something: This command filters the search results by location.filter out The software is well suited to small mobile phone screens because it filters out unnecessary information. Most email apps use spam filtering tools.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeparating and dividing\nTaking and choosing\nComputer concepts\nPhrasal verb\nfilter in\nAdd to word list\nAdd to word list\na piece of equipment or a device for removing solids from liquids or gases, or for limiting the particular type of light, sound, or electricity going through it: an oil filter a coffee filter\nIf something filters down, in, out, or through, it appears or happens gradually or to a limited degree: [ I always + adv/prep ] Reports of the accident began to filter in. [ I always + adv/prep ] Sunlight filtered through the branches.\nAdd to word list\nAdd to word list\na computer program that receives and processes information before displaying it or preventing it from being seen: Junk email filters help define which email messages are spam. This web filter enables administrators to monitor user behaviour.\nto use a computer program to process information before displaying it or preventing it from being seen: The company, whose products filter email and internet content, confirmed a record second quarter yesterday. filtering noun [ U ]\nEmail filtering is the removal of unwanted email, for example spam or a phishing attempt, before it reaches your mailbox."}