{"id":153133,"name":"final","type":"adjective","us_sound":"ˈfaɪ.nəl","us_link":"../audio/f/final.mp3","uk_sound":"ˈfaɪ.nəl","uk_link":"../audio/f/ukfill_022.mp3","content":"Add to word list\nAdd to word list\nA2 last: a final warning/offer the final chapters of a book the final yearsin its final stages The game is in its final stages. in the final analysis\nused when you are talking about what is most important or true in a situation: In the final analysis, it is the drug companies that are going to profit from this policy.\nSee more that's final\nused to show that you are certain you will not change your decision about something: I'm not coming and that's final.\nSee more\nMore examplesFewer examplesThe project is in its final stages and should be completed by August.The final figures showed that most departments had stayed within budget.That's my final offer - you can take it or leave it.The runners are now on their final lap of the track.It's up to the manager to make the final decision.\nSMART Vocabulary: related words and phrases\nFinal and finally\nantepenultimate\nas a last resort idiom\nat the end of the day idiom\nback end\nclosing\nconclusion\neventual\neventually\nfinally\nhear/see the last of something idiom\nlast\nlast chance saloon\nlast-ditch\nlastly\nlatest\nnext to last\nnon-final\nthe last someone heard/saw of someone/something idiom\nultimate\nultimately\nSee more results »\nfinal noun\n(COMPETITION)\nB1 [ C ] the last in a series of games, races, or competitions, usually the one in which the winner is chosen: through to the final Last year we got through to the final. The men's basketball final will be on Sunday. the finals [ plural ]\nthe last set of games in a competition: Do you think she will make it to the finals this year in the US Open?\nSee more\nMore examplesFewer examplesGermany are playing against Brazil in the cup final tonight.Arsenal lost the second game, but got through to the final on aggregate.Saturday's 2-0 defeat dashed their hopes of reaching the final.Montgomery drew level with Greene in the 100 metres final, but never passed him.Who won the men's finals in the tennis?\nSMART Vocabulary: related words and phrases\nParts & stages of competitions\na game in hand idiom\nadded time\nbracket\ncup tie\nelimination\nevent\nfull time\nhalf\nhand\ninjury time\nkick\nkick off\nlap\nlap of honour phrase\nquarter\nshootout\nsqueaky-bum time\ntimeout\nvictory\nvictory lap\nSee more results »\nfinal noun\n(EXAM)\nfinals [ plural ] UK\nthe exams taken at the end of a university or college course: take your finals I'm taking my finals in June.\nSee more\n[ C ] US (also final exam) a test taken on a subject at the end of a school year or college course: The final exam for this class will be on 21 May. When is your chemistry/French/algebra final? I've got three finals left for the year, and then I'm done. If you fail the final exam, you will have to retake the class. Finals week starts next Monday, so I'll be busy studying until then.\nSMART Vocabulary: related words and phrases\nExams, tests & exercises\nachievement test\nAdvanced Placement\nAP\naptitude test\nassessment\ncan do phrase\ndictation\nexternal examination\nfail\nmoderate\npop quiz\npractical\nprobationary\nproctor\npsychometric\nquiz\nre-mark\nrubric\nsit\nviva\nSee more results »\nfinal adjective [not gradable]\n(LAST)\nAdd to word list\nAdd to word list\nlast: The other team scored twice in the final minute. The recommendation will be sent to the City Council for final approval. infml I’m not coming and that’s final (= I do not want to discuss it any longer).\nfinal noun [C usually pl]\n(COMPETITION)\nthe last in a series of games, races, or competitions: The women’s basketball finals will be on Sunday. finalist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈfɑɪn·əl·əst/\na finalist for the award\nAdd to word list\nAdd to word list\nlast in a series, or happening for the last time: final payment/instalment/dividend Shareholders will get a final payment of 30.2p a share through the issue of redeemable shares.final quarter/stage/period Sales jumped in the final quarter, reaching $53.8 million.final warning/notice/reminder He was fined two weeks' wages and given a final warning about his conduct.final review/inspection/report The realtor will do a final inspection of the property on Thursday.\ncompletely decided, with no further changes: Our offer is final. Once you sign the agreement it's final.final decision/ruling/judgement The German courts are expected to make a final ruling in September.\nthe most correct or most complete possible: final estimate/balance/invoice Any fees already paid will be deducted from the final balance.final draft/release/version The final draft includes spreadsheets and an updated sales forecast.final result/product/design Construction will be postponed until the council approves the building's final design. Compare\npreliminary adjective"}