{"id":153151,"name":"finance","type":"noun","us_sound":"ˈfaɪ.næns","us_link":"../audio/f/eus71824.mp3","uk_sound":"ˈfaɪ.næns","uk_link":"../audio/f/ukfill_030.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] (the management of) a supply of money: corporate/personal/public finance the minister of finance/the finance ministerfinance department You need to speak to someone in the finance department.finance committee The finance committee controls the school's budget. finances [ plural ]\nB2 the money that a person or company has: We keep a tight control on the organization's finances.\nSee more\nMore examplesFewer examplesHe turned down a job in the finance division.Now that the finance has been secured, the production of the film is assured.Following the scandal, he was relieved of his post as deputy finance minister.I'd like to buy a new car, but my finances are in such a bad state that I can't afford to.The company's finances are in a mess.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\ninterest\ninterest rate\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nprincipal\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nB2 to provide the money needed for something to happen: The city council has refused to finance the project.\nMore examplesFewer examplesThe terrorists financed themselves by robbing banks.The City Council had financed the new building to the tune of over 4 million pounds.A syndicate of banks are financing the deal.They are still seeking someone to finance the project.A backer has agreed to finance the development.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nAdd to word list\nAdd to word list\nthe management of money, or the money belonging to a person, group, or organization: [ U ] corporate/personal finance [ pl ] the city’s finances financial adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/fəˈnæn·ʃəl, fɑɪ-/\nfinancial problems financially adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/fəˈnæn·ʃə·li, fɑɪ-/\nWe’re in fairly good shape financially.\nAdd to word list\nAdd to word list\n[ U ] UK (also financing) money borrowed from an investor, bank, organization, etc. in order to pay for something: raise/get/obtain finance Other ways of raising finance include equity release on a home and flexible mortgages.arrange/provide/offer finance for sth The state-owned bank provides finance for buying homes.require/need/seek finance All of these strategies required finance.\n[ U ] the activity or business of managing money, especially for a company or government: finance industry/sector Employment is expected to grow in finance, insurance, real estate, trade and services industries.finance minister/director/committee The finance director reported a 3% rise in sales.\n[ U ]\n&#160; ECONOMICS the study of the way money is used and managed in the economy: There, he studied corporate finance and learned how to read income statements and balance sheets.\nfinances\n[ plural ] money that is available for a person, company, government, etc. to use, and the way that it is used: manage/control/handle your finances Many customers use online banking services to manage their finances.personal/public/government finances Recession and ill-judged tax cuts have put extra strain on the public finances. Compare\nfund noun See also\nbusiness finance\nconsumer finance\ncorporate finance\ndebt finance\nequity finance\nhigh finance\nmezzanine finance\nmortgage finance\npersonal finance\nproject finance\nView all\npublic finance\n[ T ] to provide or lend the money needed to pay for something : finance a project/development/programme 20% of the budget has been set aside to help finance the project.be financed by/with/through Corporate acquisitions will likely be financed through the issuance of high-yield bonds."}