{"id":153177,"name":"find","type":"verb","us_sound":"faɪnd","us_link":"../audio/f/find.mp3","uk_sound":"faɪnd","uk_link":"../audio/f/ukfinan007.mp3","content":"find verb\n(DISCOVER)\nAdd to word list\nAdd to word list\nA1 [ T ] to discover, especially where a thing or person is, either unexpectedly or by searching, or to discover where to get or how to achieve something: I've just found a ten-pound note in my pocket. I couldn't find Andrew's phone number. You'll find the knives and forks in the left-hand drawer. Researchers are hoping to find a cure for the disease. [ + two objects ] Has he found himself a place to live yet? [ + obj + adj ] She was found unconscious and bleeding. [ + that ] The study found that men who were married lived longer than those who were not. Do you think they'll ever find a way of bringing peace to the region? We're really struggling to find (= get) enough money to pay the rent. After years of abuse from her husband, she eventually found the courage to leave him. I wish I could find (the) time to do more reading.\nThesaurus: synonyms, antonyms, and examples\nto find someone or somethingfindI've looked everywhere for my keys but can't find them.discoverThe missing wallet was discovered under the chair.locatePolice are still trying to locate the suspect.uncoverReporters uncovered evidence of corruption.unearthOur investigation unearthed mountains of evidence that implicated the city.come acrossWe came across a lovely little restaurant in the village.\nSee more results »\nB1 [ T ] to realize that something exists or has happened: [ + (that) ] We came home to find (that) the cat had had kittens. I found (that) I could easily swim a mile. be found\nB2 to exist or be present somewhere: Many plant and animal species are found only in the rainforests.\nSee more find your way\nto get somewhere you are trying to reach: I had a map but I still couldn't find my way back to the hotel.\nSee more find fault with\nto criticize someone or something: She's always finding fault with the way he works.\nSee more find yourself\nB2 to realize that you are in a particular situation or place, or doing a particular thing, when you did not intend to: He'll find himself with no friends at all if he carries on behaving this way.find yourself in something We fell asleep on the train and woke up to find ourselves in Calais. I found myself in a crowd outside the town hall. Call me if you ever find yourself in need of a lawyer. They might find themselves doubting the wisdom of their actions.\noften humorous If you go somewhere or do something to find yourself, you go there or do it to discover your true character: Simon spent a year in an ashram in India to find himself. They are here to support the local community, not to find themselves. I was a successful artist, but I still needed to find myself. He set out on a road trip in order to find himself. You won't find anyone to share your life with until you have found yourself.\nMore examplesFewer examplesWhen the guard came to clip my train ticket , I couldn't find it.I couldn't find the station, so I asked someone if they could direct me.She moved to London in the hope of finding work as a model, but failed.I found these photos while I was cleaning out my cupboards.They couldn't find what they wanted and decided to look elsewhere.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExisting and being\nUnderstanding and comprehending\nfind verb\n(EXPERIENCE A FEELING)\nB1 [ T ] to think or feel a particular way about someone or something: [ + obj + noun/adj ] Do you find John difficult to talk to? I don't find him an easy person to get on with. She doesn't find it easy to talk about her problems. [ + -ing verb ] I find living in the city very stressful.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nguess\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nsuspect\nSee more results »\nfind verb\n(JUDGE)\nB2 [ I or T ] to make a judgment in a law court: [ + obj + adj ] In a unanimous verdict, the jury found him guilty/not guilty of the murder.\nSMART Vocabulary: related words and phrases\nJudges & juries\nbench\nchief justice\ncourt of inquiry\ndismiss\nempanel\nfederal bench\njudge\njurist\njuror\njury nullification\njury service\njustice\nrecuse\nresentence\nrule\nset something aside\nsheriff\nsum\nsum (something/someone) up\nworship\nSee more results »\nIdioms\nfind your feet\nfind it in your heart to do something\nfind your voicePhrasal verbs\nfind (something) out\nfind someone out\na good or valuable thing or a special person that has been discovered but was not known about before: This café's quite a find - I had no idea there was anywhere like it around here.find of A recent find of ancient artefacts is on display at the local museum.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nsniff\nsuss\nuncover\nSee more results »\nfind verb\n(DISCOVER)\nAdd to word list\nAdd to word list\n[ T ] to see where a thing or person is, either unexpectedly or by searching; discover: I found a ten-dollar bill in my pocket. I hope I can find a place to live near work. Many plant and animal species are found (= exist) only in the rain forests.\n[ T ] Someone who finds information begins to understand something: [ + that clause ] The study found that men who took an aspirin a day have fewer heart attacks. Some insects have been found to live several years without water.\n[ T ] If you find a quality within yourself, you suddenly develop it or learn that you have it: She found the courage to leave the town where she was born.\n[ T ] To find someone means to meet someone you can have a close, loving relationship with: Ellen found Sascha, married him, and soon after they had twins.\nfind verb\n(JUDGE)\n[ I/T ] law to make a judgment in a law court: [ T ] to be found guilty/innocent Idioms\nfind yourself somewhere\nfind (the) timePhrasal verb\nfind out (something)\nfind noun [C]\n(THING DISCOVERED)\na good or valuable thing or a special person that has been discovered: She’s a real find – singers like her don’t grow on trees.\nAdd to word list\nAdd to word list\nto be successful in getting something: find work/employment/a job, etc. I have only managed to find part-time work which doesn't pay anything like what I was earning before. It's very difficult to find good sales people.find an answer As yet we haven't found an answer to the question of what to do when he retires. The company needs to find £5 million by the end of the month to avoid going into administration. Somehow they managed to find £10,000 for a deposit on the apartment.\nto discover where something is: It isn't easy to find their contact details on their website. I can't find the file I created yesterday.\n(also find (sth) out) to discover information or a fact: find that The study found that 60% of small and mid-sized firms in and around Paris reported a drop in sales since the strikes began. We found out that our competitors were selling a similar product at a much higher price. See also\nfinding\nLAW to decide on a particular judgment in a court of law: find sb guilty/innocent All three men were found guilty of conspiracy to defraud.\nfind (the) time (for sth/to do sth)\nif you find the time for something, you have enough time for it: You need to find the time to check the figures before you send out the report.\nfind against sb\nLAW to decide in a court of law that someone is wrong: The Advertising Standards Authority has found against the multinational in a case that could prove to be significant.\nfind for sb (also find in sb's favour); (US find in sb's favor)\nLAW to decide in a court of law that someone is right: The employment tribunal found in my favour, and I received compensation for losing my job."}