{"id":153186,"name":"finding","type":"noun","us_sound":"ˈfaɪn.dɪŋ","us_link":"../audio/f/finding.mp3","uk_sound":"ˈfaɪn.dɪŋ","uk_link":"../audio/f/ukfinan010.mp3","content":"finding noun\n(DISCOVERY)\nAdd to word list\nAdd to word list\n[ C ] a piece of information that is discovered during an official examination of a problem, situation, or object: The report's finding on the decrease in violent crime supports the police chief's claims.\nMore examplesFewer examplesThese new findings turn the accepted theories on their head.The findings of the survey puzzle me - they're not at all what I would have expected.The methodology and findings of the research team have been criticized.These findings are inconsistent with those of previous studies.The survey's finding is likely to increase the pressure on the local authorities.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nfossick\nfound\ngeocache\ngeocaching\nget hold of idiom\npinpoint\nrake\nrediscover\nrediscovery\nrefind\nrefound\nretrievable\nrumble\nsniff\nuncover\nSee more results »\nfinding noun\n(JUDGMENT)\n[ C usually singular ] a judgment made at the end of an official legal inquiry (= a process to discover the answer to something)\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nflight risk\npower of attorney\nprecedent\npretrial\nprobate\nprovide\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nAdd to word list\nAdd to word list\ninformation that has been discovered esp. by detailed study\nAdd to word list\nAdd to word list\n[ often plural ] information or a fact that is discovered by studying something: findings on sth The inquiry has published its findings on the gender pay gap. According to the report's findings, year-on-year new car prices have fallen by 1.3 per cent.the key/main/major finding(s) One of the key findings of the survey is that British firms exporting to Europe for the first time find it difficult to make overseas customers pay on time.findings show/suggest Our findings show that people would work more efficiently if they were allowed to work flexibly.present/publish/announce findings She and the other researchers presented their findings at a conference this summer in Toronto.initial/preliminary findings Last week, the committee handed the preliminary findings of its investigation to the United States' Securities and Exchange Commission.\nLAW a decision in a court of law: We disagree with the court's finding, as we believe that there was more than sufficient evidence that Mr. Brown failed to file his tax returns. finding against/in favour of sb A finding against him could cost him the right to work as a financial adviser.make/reach a finding They reached a finding of gross negligence."}