{"id":153307,"name":"finish","type":"verb","us_sound":"ˈfɪn.ɪʃ","us_link":"../audio/f/finish.mp3","uk_sound":"ˈfɪn.ɪʃ","uk_link":"../audio/f/ukfinan026.mp3","content":"finish verb\n(COMPLETE/END)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to complete something or come to the end of an activity: I'll call you when I've finished my homework. Please place your questionnaire in the box when you're finished.finish (something) with something She finished (the concert) with a song from her first album. She finished second (= in second place) in the finals. [ + -ing verb ] Have you finished reading that magazine?be half-finished They've already run out of money and the building isn't even half-finished (= half of it has not been completed).\nThesaurus: synonyms, antonyms, and examples\nto finish somethingfinishDid you finish your homework?endWhat time does the concert end?completeHave you completed the questionnaire?concludeShe concluded her speech by thanking everyone who had helped her.polish offHe's just polished off two huge bowls of pasta.wind upIt's time to wind up the game now.\nSee more results »\nA1 [ I ] to end: The meeting should finish around four o'clock. The play finishes with a wedding.\nB1 [ T ] to eat, drink, or use something completely so that none remains: Make sure she finishes her dinner. He finished his drink and left. We finished (= ate all of) the pie last night.\nMore examplesFewer examplesWe've got two clear weeks in which to finish the decorating.Did you finish your essay in the allotted time?School starts at 9 a.m. and finishes at 3.30 p.m.I'll be with you directly I've finished this letter.When do you envisage finishing the project?\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhang\njack something in\nkill something stone-dead idiom\nknock\nknock off (something)\nlay\nlid\nsnap\nstamp on something\nstamp something out\nstanch\nstaunch\nstem\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing and misusing\nfinish verb\n(WOOD)\n[ T ] If you finish something made of wood, you give it a last covering of paint, polish, or varnish so that it is ready to be used.\nSMART Vocabulary: related words and phrases\nBuilding: carpentry & joinery\nbeading\nbevel\nbevelled\ncabinetmaker\ncarpenter\ngimlet\nintarsia\njigsaw\njoinery\nmitre\nmortice\npanel\nplane\nsand\nsandpaper\nsawdust\nseasoned\nshelve\ntenon\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolishing & polishes\nGrammar\nEnd or finish?We use the verbs end and finish in similar ways, to mean ‘come to a stop’: …\nIdiom\nput the finishing touches toPhrasal verbs\nfinish something off\nfinish someone/something off\nfinish someone off\nfinish up\nfinish (something) up\nfinish with something\nfinish with someone\nfinish noun [C]\n(COMPLETE/END)\nB1 the end of a race, or the last part of something: a close finish They replayed the finish in slow motion.\nThesaurus: synonyms, antonyms, and examples\nthe final part of somethingendThis mammal roamed the steppes during the end of the last Ice Age.closeStock prices were up 6 percent at the close of the trading day.culminationThis starring role in a West End musical is the culmination of her years of hard work in local theatres. completionAt the completion of the exam, please return the materials to the proctor's desk and exit the room quietly.endpointBoth parties agree that they have reached a suitable endpoint to the negotiations.\nSee more results »\nMore examplesFewer examplesThe runner collapsed just a few paces from the finish.I'm a realist - I knew there was no way I could win, so I swam for a good finish, for points.John left early, but we stayed until the finish.It was one of the most exciting finishes I've ever seen.There was a very close finish in the men's 100 metres.\nSMART Vocabulary: related words and phrases\nEnds and endings\nabrupt end\naccomplishment\nbreak\nbreak something up\ncessation\ncompletion\nconclusion\ndeath\nend\nending\nexpiration\nexpiry\nfag\nfinalization\nfinitude\nshowstopper\nterminable\nterminative\nthe fag end of something idiom\nthe tail end\nSee more results »\nfinish noun [C]\n(WOOD)\nthe condition of the surface of a material such as wood: Look at the beautiful shiny finish on that piano.\nthe last covering of varnish, polish, or paint, that is put onto something: Even a clear finish will alter the colour of wood slightly.\nSMART Vocabulary: related words and phrases\nPolishing & polishes\nbeeswax\nbuff\nburnish\nburnished\ndubbin\nfrench-polish\npolish\npolish something up\npolished\nrepolish\nrosin\nrub\nrub something down\nshine\nAdd to word list\nAdd to word list\nto come to an end: [ I ] The meeting should finish at four o’clock. [ T ] If you’ll let me finish my sentence, I’ll explain it to you.\nTo finish can also mean to complete something: [ I ] She didn’t win but she did finish second. [ T ] Have you finished that magazine?\nTo finish can also mean to use completely: [ T ] We may as well finish the rest of this pasta. Phrasal verbs\nfinish someone/something off\nfinish off something\nfinish up something\nthe end of a race, or the last part of something: Both candidates are predicting a close finish in this election.\nA finish is the appearance of the surface of something or the last covering, as of paint, put onto it: a glossy finish\nAdd to word list\nAdd to word list\nSTOCK MARKET to end at a particular level or price at the end of a period of trading on a financial market: finish down/up The FTSE 100 finished down 4.1 at 4,468.7.finish above/below sth The Dow Jones industrial average finished below 13,000 for the first time since April.finish at sth Its stock finished at $39.08, up 25 percent from a 52-week low of $31.15. Headline shares finished the day higher after a positive start to the week. See also\nclose verb\nto be in a particular position at the end of a period of time: The company finished the financial year £56 million in deficit.\n[ S ]\n&#160; STOCK MARKET the end of a period of trading on a financial market: The markets ended the week with a strong finish.\n[ S ] the fact of being in a particular position at the end of a period of time: There were signs of a positive finish to the year for the tourist industry.\n[ C ] the way that something looks when it is complete: The use of good-quality paper and an attractive folder will add a professional finish to your printed presentation.\n[ C ] the last covering of paint, etc. that is put onto a surface: All these items are available in a range of finishes."}