{"id":153393,"name":"fire","type":"noun","us_sound":"faɪr","us_link":"../audio/f/fire.mp3","uk_sound":"faɪər","uk_link":"../audio/f/ukfink_006.mp3","content":"fire noun\n(FLAMES)\nAdd to word list\nAdd to word list\nA2 [ C or U ] (material that is in) the state of burning that produces flames that send out heat and light, and might produce smoke: Animals are usually afraid of fire.start a fire The fire was started by children playing with matches.put out a fire 40 people helped to put out (= stop) the fire.in a fire The library was badly damaged in the fire.by fire How many historic buildings are damaged by fire each year?catch fire She had to be rescued when her house caught (US caught on) fire (= started to burn).\nSouth Sky Photography, Elizabeth Barnes/Moment/GettyImages\nB1 [ C ] a small controlled fire that is used for heating or cooking: light a fire It's very cold in here - should I light a fire?build a fire We built a fire on the beach.make a fire We put up our tents and made a small fire.\nElena Levchenko/EyeEm/GettyImages\n[ C ] UK a gas or electric heater that is used to warm up a room: a gas/electric fire If you're cold just put the fire on.\nDeyan Georgiev/500Px Plus/GettyImages\nMore examplesFewer examplesBoth buildings were badly affected by the fire.My cat likes dozing in front of the fire.The fire was thought to have been caused by a gas explosion.The dry weather has increased the risk of brush fires.The flames grew larger as the fire spread.\nSMART Vocabulary: related words and phrases\nFire & flame\nbeacon\nblaze\nbonfire\nbrand\nbushfire\ncampfire\nconflagration\ndumpster fire\nfireball\nfirebrand\nfirepit\nfirestorm\ninferno\nopen fire\nopen fireplace\npilot\nspark\nwildfire\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHeaters & burners\nfire noun\n(SHOOT)\nC2 [ U ] the shooting of guns or other weapons: open fire on The police opened fire on (= started shooting at) the protesters.cease fire The command was given to cease fire (= stop shooting).come under fire from The city came under fire from anti-government forces last night.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\nfire noun\n(EMOTION)\n[ U ] strong emotion: The fire in her speech inspired everyone. See also\nfiery (RED)\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nIdioms\ncome under fire\nfire and brimstone\nfire in your belly\ngo through fire and water\nhang/hold fire\non fire\nplay with fire\nput out fires\nset something/someone on fire\nset fire to something/someone\nfire verb\n(SHOOT)\nB2 [ I or T ] to cause a weapon to shoot bullets, arrows, or missiles: He fired his gun into the air.fire at Someone started firing at us.fire into Without warning he started firing into the crowd. I just prayed that he would stop firing. The ambassador denied that any missiles had been fired across the border.\n[ T or I ] to direct a series of questions or criticisms at someone: The journalists were firing questions at me for two whole hours.fire away \"I'd like to ask you some questions about your childhood.\" \"Fire away!\" (= You can start asking them now.)\nMore examplesFewer examplesThe soldiers were ordered to fire only as a last resort.The initial cloud of tear gas had hardly cleared before shots were fired.He fired six shots at the target, but his aim was terrible, and he missed all of them.The rebels were firing anti-tank rockets.The soldiers have been ordered to desist from firing their guns.\nSMART Vocabulary: related words and phrases\nDetonation & bombardment\naerial bombardment\naerial photograph\nair raid\nairstrike\nblanket bombing\ndetonate\ndetonation\ndetonator\ndirect hit\ndive-bomb\ngo off\nguidance\nloose\npepper something with something\npetrol bomb\nprime\nrefire\nsaturation bombing\nshell\nshoot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuns\nDisapproving & criticizing\nQuestioning people & asking questions in general\nfire verb\n(REMOVE FROM A JOB)\nB2 [ T ] to remove someone from their job, either because they have done something wrong or badly, or as a way of saving the cost of employing them: She was fired after she was caught stealing from her employer.be fired from something for something He was fired from his $165,000 job for poor performance. She has just been fired as editor of the newspaper. The company is reducing its workforce by firing 500 employees. Synonyms\ndismiss (END JOB)\nsack (JOB) mainly UK\nMore examplesFewer examplesHe started feeling paranoid and was convinced his boss was going to fire him.They have the power to hire and fire managers.They fired him when they found out he had a criminal record.He's lucky that he wasn't fired.After years of loyal service, his boss gave him the shaft by firing him just before he would have qualified for a pension.\nSMART Vocabulary: related words and phrases\nFiring staff\narse\naxe\nbe out on your ear idiom\ncast someone adrift idiom\nconstructive dismissal\ndecertification\nfiring\nget the push idiom\ngive someone the heave-ho idiom\nheave-ho\ninvalid someone out\npasture\nrefire\nrelieve\nrelieve someone of something\nremoval\nremove\nrightsize\nterminate\ntermination\nSee more results »\nfire verb\n(EXCITE)\nC2 [ T ] to cause a strong emotion in someone: fire someone with something I had a brilliant English teacher who fired me with enthusiasm for literature at an early age.fire someone’s imagination Talk of treasure and lost cities had fired their imaginations.\nSMART Vocabulary: related words and phrases\nInspiring feelings in others\namuse\narousal\narouse\nemotive\nfill\nfreak\ninspirational\ninspirationally\ninspire\ninspirer\ninvocation\ninvoke\nkindle\nmove\nresonate\nstirring\nstirringly\ntouching\ntouchingly\nunmoving\nSee more results »\nfire verb\n(HEAT)\n[ T ] to heat objects made of clay in a kiln (= a special oven) so that they become hard\nSMART Vocabulary: related words and phrases\nCeramics & pottery\namphora\nbiscuit ware\nbisque\nbisqueware\nbone china\nchina\nchinoiserie\nearthen\nearthenware\nglaze\nkaolin\nkiln\nporcelain\npotter\npotter's wheel\nstoneware\nterracotta\nthrow\nware\nSee more results »\nIdioms\nbe firing on all cylinders\nin the firing linePhrasal verbs\nfire something off\nfire someone up\nfire something up\nfire noun\n(FLAMES)\nAdd to word list\nAdd to word list\n[ C/U ] the state of burning, or a burning mass of material: [ U ] The factory had to be closed because the risk of fire was too great. [ C ] There have been a lot of forest fires because of the drought. [ C ] The library was badly damaged in the fire. [ U ] The theater was destroyed by fire. [ C ] Over a hundred volunteers were needed to put out the fire (= stop it).\n[ C/U ] A fire is also a small controlled mass of burning material that is used for heating or cooking: [ C ] Light a fire in the fireplace. on fire\nIf something is on fire, it is burning, esp. when it is not meant to be: By the time the firefighters arrived, the whole house was on fire.\nfire noun\n(SHOOTING)\n[ U ] the act of shooting bullets or other explosives from a weapon: The troops were ordered to cease fire (= stop shooting). The soldiers opened fire (= started shooting).\nfire noun\n(EMOTION)\n[ U ] strong emotion: The fire in her speech inspired everyone to carry on in spite of recent setbacks.\nIdiom\nfire in your belly\nfire verb\n(SHOOT)\n[ I/T ] to shoot bullets or other explosives from a weapon: [ T ] He fired his gun into the air. [ I ] The soldiers began firing. [ T ] fig. The journalists kept firing questions at the president (= asking him questions quickly one after the other). [ I ] fig. \"I’d like to ask you some personal questions.\" \"Fire away (= You can start immediately)!\"\nfire verb\n(LOSE JOB)\n[ T ] to order someone to give up his or her job: She was fired for stealing from her employer.\nfire verb\n(EXCITE)\n[ T ] to cause a strong emotion in someone: She’s all fired up (= excited) about going to college.\nIdiom\non the firing linePhrasal verb\nfire off something\nAdd to word list\nAdd to word list\nHR to make someone leave their job, especially because they have done something wrong: fire sb for sth He was told that he was being fired for revealing confidential information.be fired from sth She was fired from her job because of poor attendance. The problem for City Council is that we do not have the authority to hire and fire employees. See also\ndischarge verb\ndismiss Phrasal verbs\nfire away\nfire back\nfire sth off\nfire sb up\nfire sth up"}