{"id":153541,"name":"firm","type":"adjective","us_sound":"fɝːm","us_link":"../audio/f/firm.mp3","uk_sound":"fɜːm","uk_link":"../audio/f/ukfirew004.mp3","content":"firm adjective\n(HARD)\nAdd to word list\nAdd to word list\nB2 not soft but not completely hard: I'd rather sleep on a firm mattress than a soft one. These pears are still too firm to eat.\nThesaurus: synonyms, antonyms, and examples\nnot bending or changing shape easilyhardIf you hit your head on a hard surface, see a doctor.stiffPost the picture in a stiff cardboard envelope so it doesn't get crumpled.rigidThe sculpture was a rigid steel and concrete structure.solidDry the clay until it's solid.firmI prefer a firm mattress.\nSee more results »\nMore examplesFewer examplesThe ground was not firm enough to build on.The mixture should be firm to the touch after it has been baked.The going is described as good to firm.Place the template on a firm surface.The bed in the hotel was not firm enough.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatancy\ndilatant\nerect\nfirmness\nfossilized\nharden\nramrod\nrigid\nrigidity\nrock-hard\nrock-solid\nsolidly\ntense\nunyielding\nSee more results »\nfirm adjective\n(FIXED)\nwell fixed in place or position: The bridge provided a firm platform for the bungee jumpers.\nfixed at the same level or opinion and not changing: The government remains firm in its opposition to tax reform. Synonyms\ncommitted\ndedicated\ndevoted\nfaithful (LOYAL)\nloyal\nstalwart (LOYAL)\nstaunch\nsteadfast approving\nsteady\ntrue (SINCERE)\nunfaltering\nunshakeable mainlyUK\nunswerving\nunwavering\nThesaurus: synonyms, antonyms, and examples\nstaying the sameconstantCheck to make sure your oven maintains a constant temperature.the sameYou look exactly the same as you did ten years ago!same old same oldThe Italian restaurant is under new management, but it's just the same old same old.unchangingHis novel is about the unchanging nature of humanity.unchangeableThe company's position on the matter is absolute and unchangeable.\nSee more results »\nMore examplesFewer examplesOn the foreign-exchange markets the pound remained firm.After weeks at sea, it was wonderful to feel firm ground beneath our feet once more.Make sure you've got a firm foothold on the rock before you climb up.Place the device on a firm, dry surface and make sure it is level.The house could collapse if it hasn't got firm foundations.\nSMART Vocabulary: related words and phrases\nImmobility\nanti-jamming\nbe locked in something\nboxed in\nbudge\ncataleptic\nfrozen\njam\njammed\nlifelessly\nlock\nmotionless\nmotionlessly\nmoveless\nstanding\nstatic\nstatically\nstationary\nstock-still\ntime stands still idiom\ntransfixed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\nfirm adjective\n(STRONG)\nC2 strong and tight: a firm handshake Keep a firm hold of the handrail as you go down.firm grip on figurative No one seems to have a firm grip on the company at the moment.firm grasp of figurative You need a firm grasp of mathematics to become an astronaut.\nMore examplesFewer examplesShe held the child's hand in a firm clasp as they crossed the road.Make sure that the soil around the base of the plant is firm, so that it is supported.When the glue has set, the bond will be firm and watertight.The nail holding this picture up isn't at all firm.Twist the pipe into position until the connection is completely firm.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nindestructible\nindestructibly\nindustrial-strength\nintensely\ninvincible\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nstoutly\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nfirm adjective\n(CERTAIN)\nB2 certain and not likely to change: He is a firm believer in traditional family values. Some people still claim that there is no firm evidence linking smoking with lung cancer.\nMore examplesFewer examplesShe had a firm conviction that they would meet again in the hereafter.It is my firm belief that nuclear weapons are immoral.He made a firm commitment to stop smoking.Make sure you have a firm understanding of the system before attempting any repairs.A firm decision has not yet been made over the club's future.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nnatch\nsolidity\nsolidly\nsquarely\nwould\nyou can bet your life idiom\nSee more results »\nfirm adjective\n(FORCEFUL)\nC2 forceful and making people do what you want: I was always very firm with my children - they knew the rules and I made sure they followed them.\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngrittily\ngutsily\ngutsy\ngutty\nhard-boiled\npersistently\npertinacious\npertinaciously\npigheaded\npigheadedly\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nunbending\nSee more results »\nIdioms\na firm hand\nhold/stand firm\nfirm noun [C]\n(COMPANY)\nB1 a company offering a professional service, for example a company of lawyers: law firm He works for a law firm called Neil and Vigliano. She's just started working for an accounting firm.firm of a firm of solicitors/accountants/architects\nmainly UK a company or business, especially a small one: She works for a local firm that makes medical equipment. This new tax will put a lot of small firms out of business. the Firm informal UK\na way of referring to the UK Royal Family as an organization: The Firm is an unofficial nickname that dates back to the time of Queen Elizabeth II’s father, King George VI. The Firm refers to the business side of the Royal Family and is generally used to describe the institution of Buckingham Palace, which includes senior courtiers and advisers.\nMore examplesFewer examplesShe is represented by the firm of Kelley, Day, and Arnold.Mr Black has been a client of this firm for many years.She runs a consulting firm in West Chester. Our firm stands to lose a lot of money if the deal is unsuccessful.He works for a firm of painters and decorators.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfranchise\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLawyers & legal officials\nRoyalty, aristocracy & titles\nfirm noun [C]\n(FOOTBALL)\nUK a group of violent supporters of a football team who organize or try to start fights with supporters of other teams: Millwall and West Ham had had firms for 30 years, so it's hardly surprising there was violence.\nMore examplesFewer examplesWe don't want to go back to the highly organized football hooligan \"firms\" of the 1980s.There are football firms all over Europe, from Belgium to Ukraine.Football firms often have \"firm\" within their name, for example \"West Ham ICF\" - the \"Inter City Firm\".\nSMART Vocabulary: related words and phrases\nGangsters, thugs & criminal organizations\nboot boy\nbully boy\ngangster\ngodfather\ngoon\nhenchman\nhoodlum\nhooligan\nintergang\nmob\nmobster\nmoll\norganized crime\nthug\ntong\ntriad\nunderworld\nvice ring\nYardie\nYou can also find related words, phrases, and synonyms in the topics:\nFootball/soccer\nfirm verb\n(MAKE HARD)\n[ T ] UK to make soil harder by pressing on it: Firm the soil around the cuttings and water them in.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmill\nnoncompressible\npinch\npound\npresser\npulp\npulverization\nscrunch\nsnap\nsquash\nsquish\ntamp\nunmilled\nSee more results »\nfirm verb\n(STOP CHANGING)\n[ I ]\n&#160; finance &amp; economics\n&#160; specialized to stop changing or to remain at the same level, amount, etc.: After a turbulent week on the markets, share prices firmed today.\nSMART Vocabulary: related words and phrases\nNot able to be changed\na leopard can't/doesn't change its spots idiom\nbe no hard and fast rules idiom\nburn your boats/bridges idiom\ncongenital\ncontinuity\ndeep-seated\nincurably\ninelastic\ninelasticity\ninflexible\ninflexibly\nirreversibly\nirrevocable\nirrevocably\nleopard\nsb's way or the highway idiom\nunchangeable\nuncompromising\nuncompromisingly\nunredeemable\nSee more results »\nPhrasal verbs\nfirm something up\nfirm (something) up\nfirm adjective, adverb [-er/-est only]\n(FIXED)\nAdd to word list\nAdd to word list\nset in place and unable or unlikely to move, come loose, or fall over: The rocks were wet, and we couldn’t get a firm footing. fig. Sometimes it takes more courage to admit you’re wrong than to stand firm (= continue to defend an opinion). fig. The dean is holding firm and refusing to give in to student demands.\nfirm adjective [-er/-est only]\n(HARD)\nnot soft when pressed; solid or strong: a firm mattress a firm body fig. No one seems to have a firm grip on (= be in control of) the situation at the moment.\nfirm adjective [-er/-est only]\n(CERTAIN)\ncertain or fixed in a belief, opinion, etc., and unlikely to change, or so certain as to be beyond doubt or question: a firm believer in the Constitution They made a firm commitment to complete the job this week. The decision is firm – there will be a strike.\nFirm can also mean showing control and making sure you will be obeyed: A new teacher has to be firm with her students.\nfirm noun [C]\n(BUSINESS)\na company or business: a law firm\nAdd to word list\nAdd to word list\nWORKPLACE a company or business: The firm's share price has been rising steadily. The firm remains heavily dependent on North America, its biggest market.big/medium-sized/small firm Small and medium-sized firms accounted for 69.8% of the UK business population.leading/major/top firm He hired a top firm of architects and re-mortgaged the family home to finance the project.accounting/law/manufacturing, etc. firm Local manufacturing firms are under heavy competitive pressure, often from off-shore production.set up/start (up)/establish a firm Her grandfather had set up the firm soon after the war.run/manage a firm The firm was run from an office in Bolton. She joined the family firm soon after leaving school. See also\nconsulting\nsearch firm\nagreed or decided and not likely to change: firm date/deadline I was given a firm deadline of April 30.firm bid/commitment The group said it has a firm commitment to sell two radio stations in Chicago to minority partners.firm order/offer They already have firm orders for much of the new stock.firm decision We haven't made a firm decision as yet.\nFINANCE used to describe a price or level that is high and is likely to rise or stay high: Home prices are edging higher as builders pay record prices for lumber, and tight supplies should keep prices firm next year. See also\nsteady\nhold firm\nto remain at a high level: Top share prices held firm through to the close, with the main index up 27.8. firmness noun [ U ]\nthe firmness of the bond market\nFINANCE to remain at the same level, amount, etc. or to rise slightly: In industries such as paper, chemicals, and steel, prices have firmed.firm to sth Copper firmed 1.8 cents to 142.1 cents a pound.firm against sth The dollar, meanwhile, firmed against the euro in the wake of the interest rate rise. Bank shares firmed on expectations that the Reserve Bank would leave interest rates untouched. Phrasal verb\nfirm sth up"}