{"id":153594,"name":"fiscal","type":"adjective","us_sound":"ˈfɪs.kəl","us_link":"../audio/f/fiscal.mp3","uk_sound":"ˈfɪs.kəl","uk_link":"../audio/f/ukfirew011.mp3","content":"Add to word list\nAdd to word list\nconnected with (public) money: fiscal policy Compare\nfinancial\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nrecession\nretrench\nstagflation\nthe public purse\nSee more results »\nRelated word\nfiscally\nAdd to word list\nAdd to word list\nrelating to public money or other financial matters: a sound fiscal policy\nAdd to word list\nAdd to word list\nECONOMICS, GOVERNMENT, TAX relating to government finance and taxes: fiscal challenges/ issues/problems With the serious fiscal challenges facing the federal government, agencies must maximize their ability to manage and safeguard valuable taxpayers' dollars.fiscal deficit/surplus Overall, the situation looks favourable in terms of the fiscal surplus he has projected. The governor said the fiscal crisis couldn't be solved by spending cuts alone, insisting the state needs additional revenue.\nFINANCE\n&#160; mainly US relating to money and finances: Analysts said yesterday's settlement was unlikely to affect the company's fiscal health.\nACCOUNTING\n&#160; mainly US relating to a period of 12 months, or a part of that period, used by a company to calculate and report its financial information: The software company's fiscal third-quarter net income of $1.06 million, or 10 cents a share, fell short of Wall Street's expectations.\nfiscal 2010/2011 etc. US\nACCOUNTING, TAX the financial year 2010, etc.: Our fiscal 2009 results were challenged by the world economic downturn. fiscally adverb /ˈfɪskəli/\nIt is fiscally irresponsible for us to spend money that we do not have."}