{"id":153810,"name":"fit","type":"verb","us_sound":"fɪt","us_link":"../audio/f/fit.mp3","uk_sound":"fɪt","uk_link":"../audio/f/ukfistf003.mp3","content":"fit verb\n(CORRECT SIZE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to be the right size or shape for someone or something: That jacket fits you perfectly.fit like a glove The dress fits like a glove (= very well).fit through Our new sofa doesn't fit through the door.fit into I don't think another desk will fit into this classroom.fit in My car's too big to fit in this space.\nMore examplesFewer examplesThose trousers fit you nicely.This tiny device fits into the palm of your hand.Their new car barely fitted into the garage.If you can't fit all the cases in your car, I can take a few in mine.One size fits all.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoluminously\nvoop neck\nwaisted\nwashable\nwasp waist\nSee more results »\nfit verb\n(BE SUITABLE)\nC1 [ T ] to be suitable for something: With her qualifications, she should fit the job perfectly. Let the punishment fit the crime. I'm sure we'll have something to fit your requirements.\nMore examplesFewer examplesHe doesn't fit my image of how an actor should look.He doesn't conform fit the national stereotype of a Frenchman.We had to adapt our plans to fit Jack's schedule.The soundtrack really fits the era in which the film is set.I don't have anything that really fits the occasion.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nanswer\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ncompatibly\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nlevel\nmisdirection\norder\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nSee more results »\nfit verb\n(PUT IN POSITION)\nB2 [ T ] to provide something and put it in the correct position: All the carpets we sell are fitted free. She's been fitted with an artificial leg.\nMore examplesFewer examplesWe're having a new bathroom suite fitted at the weekend.He was recently fitted with a brace for his bad back.Do you know anyone who can fit windows?He was messing with his bike and then he couldn't fit the parts back together.My car is having new tyres fitted.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nfit verb\n(ILLNESS)\n[ I ] UK to have a fit (= sudden attack of uncontrolled movements)\nSMART Vocabulary: related words and phrases\nDisorders of muscles & the nervous system\nacoustic neuroma\nageusia\nakinetic-rigid HD\nALS\nAlzheimer's\ncomatose\ncrick\ndyspraxia\ndystonia\nEA\nepileptic\nfibromyalgia\nGBS\nleprosy\nneuralgia\npost-encephalitic\nprogressive supranuclear palsy\nprosopagnosia\nquadriplegia\nretrograde\nSee more results »\nGrammar\nFit or suit?If something fits you or fits into a place, it is the right size or shape for you or for that place: …\nIdioms\nfit the bill\nfit to burst\nfit to drop\nif the cap fits (wear it)Phrasal verbs\nfit in\nfit someone/something in\nfit in with something\nfit something out\nfit something up\nfit someone up\nfit adjective\n(HEALTHY)\nA2 healthy and strong, especially as a result of exercise: keep fit I jog to keep fit. You need to be very fit to hike the Inca Trail. Opposite\nunfit\nMore examplesFewer examplesHe's jogging round the park every morning in an effort to get fit for the football season.At 73, she's still fighting fit, walking five miles a day.Her hearing is going, but otherwise she's remarkably fit for a 95-year-old.\"What do you do to keep fit?\" \"I jog and go swimming.\"Most exercise classes start gently, lulling you into thinking that you're fit.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nfit adjective\n(SUITABLE)\nC1 suitable for a particular purpose or activity: fit for She's not fit for the level of responsibility she's been given. Opposite\nunfit be in no fit state to do something\nto not be able to do something because you are upset, ill, drunk, etc.: He's very upset and is in no fit state to drive.\nSee more fit for human consumption\nsafe for people to eat: The oils need to be processed before they are fit for human consumption.\nSee more fit for purpose\nUK Something that is fit for purpose does what it is meant to do: The theatre is crumbling and is no longer fit for purpose.\nSee more see/think fit\nC1 to consider an action or decision to be correct for the situation: Just do whatever you think fit - I'm sure you'll make the right decision.\nSee more\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nSee more results »\nfit adjective\n(ATTRACTIVE)\nUK slang sexually attractive: I met this really fit bloke in a club last night. Idioms\nbe (as) fit as a fiddle\nfit to be tied\nfit noun\n(ILLNESS)\n[ C ] a sudden attack of illness when someone cannot control their movements and becomes unconscious: an epileptic fithave a fit He had a fit at work and collapsed.\nSMART Vocabulary: related words and phrases\nDisorders of muscles & the nervous system\nacoustic neuroma\nageusia\nakinetic-rigid HD\nALS\nAlzheimer's\ncomatose\ncrick\ndyspraxia\ndystonia\nEA\nepileptic\nfibromyalgia\nGBS\nleprosy\nneuralgia\npost-encephalitic\nprogressive supranuclear palsy\nprosopagnosia\nquadriplegia\nretrograde\nSee more results »\nfit noun\n(SHORT PERIOD)\n[ C ] a sudden, uncontrolled period of doing something or feeling something: a coughing/sneezing fitin a fit of She hit him in a fit of anger.\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\nindustrial disease\ninfantile\nseizure\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShort in time\nfit noun\n(CORRECT SIZE)\n[ S ] the way that something fits: These shoes are a perfect fit. The trousers were a good fit but the jacket was too small.fit of Check the fit of the pieces before gluing them in place.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoluminously\nvoop neck\nwaisted\nwashable\nwasp waist\nSee more results »\nIdioms\nhave/throw a fit\nin fits of laughter\nin/by fits and starts\nfit verb\n(CORRECT SIZE)\nAdd to word list\nAdd to word list\n[ I/T ] to be the right size or shape for someone or something: [ T ] The jacket fits you perfectly. [ I ] The refrigerator won’t fit in our kitchen.\nfit verb\n(SUIT)\n[ T ] to be suitable for someone or something: The job fits him well. Idioms\nfit like a glove\nfit the bill\nfit to be tiedPhrasal verbs\nfit in\nfit in something/someone\nfit adjective [-er/-est only]\n(HEALTHY)\nin good health, esp. as a result of exercise; strong: You look fit.\nfit adjective [-er/-est only]\n(SUIT)\nsuitable for someone or something: She’s not fit to be treasurer.\nfit noun\n(BRIEF PERIOD)\n[ C ] a sudden, brief period when something happens that is beyond your control: a coughing/sneezing fit Epilepsy can cause severe fits (= sudden muscle movements that you cannot control).\nfit noun\n(EMOTIONAL EXPERIENCE)\n[ C ] an experience of a strong emotion or reaction: a fit of laughter/jealousy\n[ C ] A fit can be a feeling or expression of great anger: Your mother will have/throw a fit when she sees this mess.\nfit noun\n(CORRECT SIZE)\n[ U ] the right size or shape for someone or something: These shoes are a perfect/terrible fit. Idioms\nfits and starts\nhave a fit\nAdd to word list\nAdd to word list\n[ I or T ] to be the right size or shape for someone or something: Their trained staff can take one look at your figure and tell you which brand of jeans is most likely to fit you.fit in/into The device is small enough to fit into a shirt pocket.\n[ T ] to add a piece of equipment to something else: Some insurance firms offer lower premiums to people who fit security locks and alarms.fit sth on/onto/to sth You can claim money for having solar cells fitted on your home.fit sth with sth The vehicle may be fitted with a satellite tracking system.\n[ T ] to be suitable for someone or something: You adjust your strategy to fit the business realities. Her new role fits her well. What alternatives fit the needs of the corporation and provide the best solution?\n[ I + adv/prep ] if two or more things fit, or if one thing fits with another, they suit each other well: fit together The organization and the people must fit together.fit with sth We select individuals who are most likely to fit with the firm's culture.\n[ T ] mainly UK to make someone or something suitable for something: fit sb/sth for sth How do you think your career to date has fitted you for this particular job?fit sb/sth to do sth Academic qualifications alone do not fit a person to become a good manager.\nfit the bill\nto be suitable for a particular purpose: Some travel policies don't fit the bill, because they limit the amount of time you can spend abroad.\nPhrasal verbs\nfit in\nfit sb/sth out\nthe way in which two or more things suit each other or work together: The two banks are a perfect fit.a fit with sth This role is a great fit with my experience in Asia.a fit between sth and sth There must be a fit between the environment and the organization.a fit for sth A financial product must be a good fit for the client's particular needs and aspirations.\nthe way that something such as a piece of clothing fits: Testers loved the comfortable fit of the armholes. See also\nstrategic fit\nsuitable for a particular purpose or activity: be fit for sth The Seller gives no undertaking that the goods are fit for any particular purpose.\nfit for human consumption\nof a good enough quality to be eaten by people: Companies and consumers bought the poultry, believing it fit for human consumption.\nfit for purpose\nif something is fit for purpose, it does what it is intended to do: I have spent a lot of my time making this organization fit for purpose."}