{"id":153832,"name":"fitness","type":"noun","us_sound":"ˈfɪt.nəs","us_link":"../audio/f/fitness.mp3","uk_sound":"ˈfɪt.nəs","uk_link":"../audio/f/ukfistf007.mp3","content":"fitness noun [U]\n(HEALTH)\nAdd to word list\nAdd to word list\nB1 the condition of being physically strong and healthy: I'm trying to improve my fitness by cycling to work.\nMore examplesFewer examplesHis interest in personal fitness borders on the monomaniacal.We saw a victory by an athlete at the very peak of her fitness and career.His dancing technique is good, but he needs to work on his fitness.We're in an era of fitness and health worship.She has her own personal fitness instructor.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nfitness noun [U]\n(SUITABLE QUALITY)\nhow suitable someone or something is: fitness for His fitness for the new position is not in question. [ + to infinitive ] Many people are concerned about her fitness to govern.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\njust what the doctor ordered idiom\nlegitimate\npractical\nre-eligibility\nre-eligible\nrelevance\nrelevant\nrelevantly\nSee more results »\nAdd to word list\nAdd to word list\nthe quality of being suitable for someone or something: No one questioned her fitness for the job.\nthe condition of being physically strong and healthy: physical fitness\nAdd to word list\nAdd to word list\nactivities relating to keeping healthy and strong, especially through exercise: The increase of interest in health and fitness means that most hotels now have gyms and pools. the fitness industry/sector a fitness centre/club fitness trainers/instructors\nthe quality of being suitable for a particular job or of being good enough for something: sb's fitness for sth They have to pass exams to test their fitness for the job.sb's fitness to do sth Doctors will remain on the medical register only if they can demonstrate their fitness to continue practising."}