{"id":153997,"name":"flag","type":"noun","us_sound":"flæɡ","us_link":"../audio/f/flag.mp3","uk_sound":"flæɡ","uk_link":"../audio/f/ukflacc003.mp3","content":"flag noun [C]\n(SYMBOL)\nAdd to word list\nAdd to word list\nB1 a piece of cloth, usually rectangular and attached to a pole at one edge, that has a pattern that shows it represents a country or a group, or has a particular meaning: fly a flag Flags of all the participating countries are flying outside the stadium. Flags were flapping/fluttering in the breeze.wave a flag The guard waved his flag and the train pulled away from the station.\nMarvin Hedderich/EyeEm/GettyImages\nin American football, a yellow piece of cloth thrown on to the playing area by one of the officials when a player has broken the rules: A flag was down but it was unclear why. The coach was furious that no flag had been thrown on the play.\nMore examplesFewer examplesIt's a crime to desecrate the country's flag.You're not allowed to swim when the red flag is flying.The palace flags were all flying at half-mast.There were flags on the tops of many of the buildings.A flag fluttered from a 40-foot pole.\nSMART Vocabulary: related words and phrases\nFlags\ncolour\ncrossbones\nensign\nflag bearer\nflag of convenience\nhalf-mast\nhalf-staff\npennant\nred flag\nsaltire\nskull and crossbones\nstandard\nStar-Spangled Banner\nStars and Stripes\nthe Jolly Roger\ntifo\ntricolour\nUnion Jack\nwindsock\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nflag noun [C]\n(STONE)\nUK a\nflagstone\nRichard Newstead/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\ndrywall\nfibro\nflagged\nflagstone\nflitch\nparticle board\npaving\nprestressed\nputty\nrazor wire\ntwo-by-four\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\nflag noun [C]\n(PLANT)\na flower that is a type of large iris\nDavid Q. Cavagnaro/Photolibrary/GettyImages\nSMART Vocabulary: related words and phrases\nFlowers & flowering plants\naconite\nadam-and-eve\naeonium\nAfrican daisy\nagapanthus\neglantine\nelderflower\nelephant ear\nerythronium\neuphorbia\nloosestrife\nlords-and-ladies\nlotus\nlove-in-a-mist\nlupin\nsego lily\nself-heal\nsenecio\nsensitive plant\nShasta daisy\nSee more results »\nIdioms\nkeep the flag flying\nput the flags out!\nwave/show/fly the flag\nflag verb\n(MARK)\n[ T ] to put a mark on something so it can be found easily among other similar things: Flag any files that might be useful later.\n[ T ]\n&#160; computing\n&#160; specialized to mark computer information with one of two possible values so that you can deal with it later: We'll flag the records of interest in the database and then we can give you a print-out.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\nstamp\ntagging\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nflag verb\n(WARN)\n[ T ] (also flag up) to warn or tell people about something that is important or is a problem: I'd just like to flag a couple of issues with the project. The inspection team flagged a potential groundwater pollution problem. A laboratory test might have flagged up the potential dangers at a much earlier stage.\nMore examplesFewer examplesWe will use new technology and real-time monitoring systems to flag potential problems. I wanted to flag something I think is wrong with that report.He criticized the slow pace at which the crime has been pursued since he first flagged it up. Serious weather warnings are being flagged up for the next few days.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThreats & warnings\nflag verb\n(BECOME TIRED)\n[ I ] to become tired, weaker, or less effective: I was starting to flag after the ninth mile. The conversation was flagging.\nSMART Vocabulary: related words and phrases\nTired and making tired\nall in\nanti-fatigue\nat your worst idiom\nbe dead on your feet idiom\nbe fit/ready to drop idiom\nfinish something off\nfit to drop idiom\nfragile\ngassed\nhaggard\nshattered\nsleep deprivation\nsleep-deprived\nsleepily\nsleepiness\nstrung out\nworst\nwrecked\nyawningly\nzonked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making less strong\nflag verb\n(SPORT SIGNAL)\n[ I or T ] If a sports official flags, or flags a player, they lift a flag to signal that a player has broken one of the rules: flag for The referee's assistant flagged for a free kick on the edge of the area. The striker had already been flagged offside before the shot had left his boot.\nMore examplesFewer examplesThe linesman flagged for offside.The assistant referee had already flagged for an infringement.The linesman controversially flagged Drogba offside.\nSMART Vocabulary: related words and phrases\nRefereeing & judging in sport\nadjudicate\nadjudication\nadjudicator\nassistant referee\nbooking\ncooler\nfair play\nfourth official\njury\nref\nreferee\nregulation time\nscore\nscorekeeper\nscorer\nsending off\nsin-binning\nsplit decision\numpire\nyellow card\nSee more results »\nPhrasal verb\nflag something/someone down\nflag noun [C]\n(SYMBOL)\nAdd to word list\nAdd to word list\na piece of cloth with a special color and pattern, used as a symbol esp. to represent a particular country or group: the American flag The man waved a red warning flag.\nflag verb\n(MARK)\n[ T ] to mark something so it can be found easily among other similar things: She asked me to flag the names that appear on both lists.\nflag verb\n(BECOME TIRED)\n[ I ] to become tired or less strong: My interest in the story flagged.\nPhrasal verb\nflag down something/someone\nAdd to word list\nAdd to word list\n[ T ] to put a mark on something or against something so it can be found easily among other similar things: Flag any files which might be useful later.\n[ T ]\n&#160; IT to mark computer information with one of two possible values so that you can process it later: We'll flag the records of interest in the database and then we can give you a printout.\n[ I ] to become tired, weaker, or less effective: We had been working on the presentation for six hours and I was beginning to flag. They denied that demand for the new product was flagging.\nPhrasal verb\nflag sth up\na piece of cloth, usually rectangular and fixed to a pole at one edge, that has a pattern that shows it represents a country or a group, or has a particular meaning: a container ship sailing under the Indonesian flag\na mark that you put on or against something to show that it is important: You can put a flag on any email message that you know you will need to go back to and read again.\nfly the flag\nto show support for the country, group, or organization that you belong to: The government was accused of failing to fly the flag for British farmers at the negotiations."}