{"id":154110,"name":"flake","type":"noun","us_sound":"fleɪk","us_link":"../audio/f/flake.mp3","uk_sound":"fleɪk","uk_link":"../audio/f/ukflacc017.mp3","content":"flake noun [C]\n(SMALL PIECE)\nAdd to word list\nAdd to word list\na small, thin piece of something, especially if it has come from a surface covered with a layer of something: flakes of snow soap flakes This room needs decorating - flakes of paint keep coming off the walls.\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\ntrace\nSee more results »\nflake noun [C]\n(PERSON)\nmainly US informal sometimes offensive a person you cannot trust to remember things or to do what they promise, or someone who behaves in a strange way: As the story begins, she seems a bit of a flake, and we're not sure how strong her judgment is.\nMore examplesFewer examplesThese judges don't have any respect for you anymore. They think you're a tremendously talented boy, but they also think you're a flake.Everyone thought Tony was a phoney and a flake who was incapable of holding a position for more than three seconds.I had an idea of him as a flake but I started realising he was a fantastic comedian.\nSMART Vocabulary: related words and phrases\nStupid and silly people\nairhead\nberk\nbirdbrain\nblithering idiot\nblockhead\ndullard\ndumb-ass\ndummy\ndunce\ndunderhead\nmuppet\nmutt\nneed\nneed your head examined idiom\nnimrod\nsimpleton\nstupid\nthicko\ntosser\ntroglodyte\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrange, suspicious and unnatural things and people\nto come off a surface in small, thin pieces: flake off Patches of skin are starting to flake off. The paint was flaking, revealing bricks underneath.\nSMART Vocabulary: related words and phrases\nTearing and breaking into pieces\napart\nasunder\nbobble\nbobbly\nbreak into pieces\ncatch\ncrack\ndismantle\nfall apart\nfall to pieces idiom\nfragment\nfragmentation\nfragmented\nrip\nsnag\nsplinter\nsplit\nsunder\ntear something apart\ntear something up\nSee more results »\nPhrasal verb\nflake out\nflake noun [C]\n(THIN PIECE)\nAdd to word list\nAdd to word list\na small, thin piece, esp. of a layer on a surface: Flakes of paint fell from the ceiling.\nflake noun [C]\n(PERSON)\ninfml a person who does not seem to pay attention and is sometimes silly: That guy is a real flake.\nflake verb [I]\n(COME OFF IN PIECES)\nto come off easily in small, thin, flat pieces: Plaster is flaking off the walls."}