{"id":154401,"name":"flattening","type":"verb","us_sound":"ˈflæt̬.ən","us_link":"../audio/f/eus71841.mp3","uk_sound":"ˈflæt.ən","uk_link":"../audio/f/ukflato003.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nflatten\nflatten verb [I or T]\n(BECOME LEVEL)\nC2 to become level or cause something to become level: Several trees were flattened (= knocked down) by the storm. The path flattens (out) (= does not go up so much) as it reaches the top of the hill.\nto stop rising, falling, or changing so quickly, or to make the rate of change slower: Television ad rates have flattened, if not declined slightly. In the last decade we saw smoking rates flatten out and decline. The use of a retardant coating on the surface of the powder slows the initial burn rate and flattens out the rate of change. flatten the curve\nto make the rate of change slower for something that might be shown as a line on a graph, especially to make the increase in the rate of infections slower when a disease is spreading: These public health measures are designed to flatten the curve in the spread of the disease. Preventing a health care system from being overwhelmed in an epidemic requires a society to \"flatten the curve\" - that is, slow the rate of infection so there aren't too many cases that need hospitalization at one time. This sort of banking lowers long-term interest rates; it flattens the curve.\nMore examplesFewer examplesHe was immediately flattened by a single punch to the head.The whole area was flattened in the bombing raid - not a building was left standing.After a few hundred yards, you come to an area where the ground flattens out.That tent is not secure, you know. The first gust of wind will flatten it.A fight broke out and we had to grab Kevin to stop him flattening the other guy.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and staying the same\nChange and changes\nflatten verb [I or T]\n(MAKE THINNER)\nC2 to become level and thinner or to cause something to become level and thinner: Flatten the pastry into a thin disc with your hands. The biscuits will flatten out as they cook.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »"}