{"id":154403,"name":"flatter","type":"verb","us_sound":"ˈflæt̬.ɚ","us_link":"../audio/f/flatter.mp3","uk_sound":"ˈflæt.ər","uk_link":"../audio/f/ukflato004.mp3","content":"Add to word list\nAdd to word list\nto praise someone in order to make them feel attractive or important, sometimes in a way that is not sincere: I knew he was only flattering me because he wanted to borrow some money.\nThesaurus: synonyms, antonyms, and examples\nto praise someone or somethingpraiseLawmakers praised the bipartisan deal.congratulateI congratulated him on passing his driving test.complimentI was just complimenting Robert on the wonderful meal he has cooked.commendThe judge commended her for her bravery.pay tribute toHe paid tribute to the firefighters who had saved his daughter's life.flatterI knew he was only flattering me because he wanted to borrow some money.\nSee more results »\nflatter yourself\nto believe something good about yourself although it might not be true: [ + that ] Steve flatters himself that he's an excellent speaker. He flatters himself that, where Sara is concerned, he has the magic touch. I had thought I was quite good with tricky people but perhaps I flatter myself. I was under the impression he found me rather funny but maybe I flatter myself. Don't flatter yourself, Peter. She's like that with everyone. flatter to deceive UK\nto give the appearance of being better than the true situation: I suspect these statistics flatter to deceive.\nSee more be/feel flattered\nto feel very pleased and proud because someone has said good things about you or has made you feel important: She was flattered by his attention.\nSee more\nto make someone look more attractive than usual: That new hairstyle really flatters her. Short skirts don't flatter me at all.\nSMART Vocabulary: related words and phrases\nPraising insincerely or too eagerly\nbackhanded compliment\nbootlicker\nbow and scrape idiom\ncrawler\ncreep\nglad-handing\ngrovel\ngrovelling\ngrovellingly\nhagiographic\nmassage someone's ego idiom\nobsequious\nobsequiously\npeople pleaser\nplay up to someone\nsycophant\nsycophantic\nsycophantically\ntoady\ntoadying\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing arrogance and conceit\nDecorating or making something attractive\nAdd to word list\nAdd to word list\nto make someone feel important or attractive, or to praise someone in order to please him or her: They were flattered by the invitation from the mayor. flattery noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈflæt̬·ə·ri/\nSaying I was the best ever was too obvious an attempt at flattery."}