{"id":154644,"name":"fleece","type":"noun","us_sound":"fliːs","us_link":"../audio/f/fleece.mp3","uk_sound":"fliːs","uk_link":"../audio/f/ukfleab010.mp3","content":"fleece noun\n(WOOL)\nAdd to word list\nAdd to word list\n[ C or U ] the thick covering of wool on an animal, especially a sheep, or this covering used to make a piece of clothing: Many farmers identify their sheep by painting their fleeces. The Leicester Longwool was bred to provide long fleece for the wool trade. We were kitted out for the Arctic climate with fleece-lined bonnets and lightweight boots made from boiled sheep’s wool.\nChrisMattison/naturepl.com/NaturePictureLibrary/GettyImages\nSMART Vocabulary: related words and phrases\nThe skin, hair & bone of non-human animals\nbaleen\nbristly\nbushy\ncoated\ndander\ndowny\neiderdown\nfeather\nfurry\ngoatskin\nhackles\nhorsehair\nlambswool\nmane\nmother-of-pearl\nsable\nsealskin\nseashell\nspine\nwishbone\nSee more results »\nfleece noun\n(ARTIFICIAL)\n[ U ] a type of cloth, usually made of polyester (= artificial material), that is thick and soft on one or both sides, and that is often used for making warm clothes: Fleece is warm and durable, and dries faster than natural fibres.\n[ C ] a jacket made from artificial fleece material: He was wearing a green fleece and hiking boots.\nHemeraTechnologies/PhotoObjects.net/GettyImagesPlus/GettyImages\n[ U ] (also horticultural fleece) a very thin artificial material that allows some light to pass through, and that is used by gardeners to protect plants during cold weather: Place some fleece over the bulbs to help them get established more quickly. In severe weather, cover the plants with a sheet of horticultural fleece.\nSMART Vocabulary: related words and phrases\nTextiles made from man-made fibres\nacetate\nborg\nCrimplene\nDacron\nfaille\nfun fur\nlame\nLycra\nmemory foam\nmicrofibre\nMinky\nneoprene\npolyester\nPUL\nrayon\nsharkskin\nsherpa\nTerylene\nvelour\nviscose\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCoats, jackets & cloaks\nImproving fertility & pest control\nto take someone's money dishonestly, by charging too much money or by cheating them: That restaurant really fleeced us!\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfeint\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nfleece noun [C/U]\n(SHEEP)\nAdd to word list\nAdd to word list\nthe wool of a sheep, or a soft, artificial material that looks like wool: [ C ] Polyester fleeces are especially popular to provide warmth in coats.\nfleece verb [T]\n(CHEAT)\nto charge too much money or cheat someone: He was fleecing investors by setting up bogus companies and then manipulating the price of their stocks.\nAdd to word list\nAdd to word list\nto take someone's money dishonestly, by charging too much money or by cheating them: They are fleecing their customers with poor value products.fleece sb out of sth A man was convicted for using bogus web pages to fleece Americans out of $500,000."}