{"id":154786,"name":"flexible","type":"adjective","us_sound":"ˈflek.sə.bəl","us_link":"../audio/f/flexible.mp3","uk_sound":"ˈflek.sə.bəl","uk_link":"../audio/f/ukfleab025.mp3","content":"flexible adjective\n(ABLE TO CHANGE)\nAdd to word list\nAdd to word list\nB2 able to change or be changed easily according to the situation: My schedule is flexible - I could arrange to meet with you any day next week.\nMore examplesFewer examplesThe European Union should remain flexible enough to assimilate more countries quickly.\"If they're flexible, we're flexible\", the official was quoted as saying.Warships are flexible in operation and can travel the seas freely.Computer generated models are more flexible and less expensive to build than physical models.The constitution is flexible enough to change as the organization develops.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nflexible adjective\n(ABLE TO BEND)\nC2 able to bend or to be bent easily without breaking: Rubber is a flexible substance. Dancers and gymnasts need to be very flexible (= able to bend their bodies easily).\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nflowing\nfullness\njointed\nlimply\nlimpness\nloose-fitting\npliantly\nrelax\nrubbery\nsemi-flexible\nslacken\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nRelated words\nflexibility\nflexibly\nflexible adjective\n(CHANGEABLE)\nAdd to word list\nAdd to word list\nable to change or be changed easily according to the situation: I’m fortunate because my job has flexible hours, and I can come and go pretty much as I want.\nflexible adjective\n(ABLE TO BEND)\nable to bend or be bent easily without breaking: The wire has to be flexible enough to go around corners of the room.\nAdd to word list\nAdd to word list\na flexible person or company can work in different ways, at different times, or in different places when it is necessary: How can we encourage employees to be more flexible?be flexible about sth Companies can now be more flexible about where they site their operations. a flexible approach/attitude\nsomething that is flexible can change or be changed according to the situation: The pay and benefits are good, and the hours are flexible.a flexible mortgage/loan With a flexible mortgage you can pay more or less than your agreed monthly payment. flexible work/jobs a flexible pension flexibility noun [ U ] uk/ˌfleksɪˈbɪlɪti/ us/-ətIi/\nThe job requires flexibility, but is very rewarding."}