{"id":154779,"name":"flex","type":"verb","us_sound":"fleks","us_link":"../audio/f/flex.mp3","uk_sound":"fleks","uk_link":"../audio/f/ukfleab023.mp3","content":"flex verb\n(bend)\nAdd to word list\nAdd to word list\n[ T ] to bend an arm, leg, etc. or tighten a muscle: First, straighten your legs, then flex your feet. He tried to impress me by flexing his huge muscles.\n[ I or T ] (of a material) to bend without breaking, or to make a material do this: Sheets of brittle lava broke under their own weight as they flexed. Metal fatigue occurs when steel is flexed.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflexion\nflexure\nfluted\nintertwine\nrewind\nsinuous\nswoopy\ntangle\ntangled\ntangly\ntorsion\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlexible, loose and yielding\nflex verb\n(change)\n[ I or T ] to change something slightly to make it more suitable for a particular situation; to be changed like this: There may be a need to suspend or flex established laws. In keeping the description of the job as general as possible, a manager can flex the boundaries of that job to meet the dynamic challenges of the world around them. The space can flex to suit various uses.\nSMART Vocabulary: related words and phrases\nAdapting and modifying\nacclimate\nacclimation\nacclimatization\nacclimatize\nacclimatize to something\nambidextrous\namend\namendment\nchameleon\nchange with/keep up with/move with the times idiom\nconfigure\ncounter-adaptation\npreadaptation\npreadaptive\nput something back\nput something/someone forward\nreacclimatize\nunamended\nwrite someone out of something\nZelig\nSee more results »\nflex verb\n(behave proudly)\n[ I ] slang to show that you are very proud or happy about something you have done or something you own, usually in a way that annoys people: \"I beat you!\" \"Hey, no flexing.\" No need to flex about all the cash you've got.\nSMART Vocabulary: related words and phrases\nBoasting\nbighead\nblow\nblow your own trumpet/horn idiom\nblowhard\nboast\nboastful\nboastfully\nboastfulness\nbrag\nbraggadocio\nbraggadocious\nbraggart\nbragging rights\nchest-beating\nchest-thumping\ncrow\nhumblebrag\noutbrag\nrodomontade\nswaggerer\nIdiom\nflex your muscles\nflex noun\n(WIRE)\n[ C or U ] (a length of) wire with a plastic cover used for connecting a piece of electrical equipment to a supply of electricity: The flex on this iron isn't long enough to reach the socket.\nYamada Taro/Photodisc/GettyImages\nMore examplesFewer examplesThe appliance comes with a flex and a plug.Take particular care not to leave electrical flexes trailing where people can trip on them.He tried to strangle her with a length of flex.\nSMART Vocabulary: related words and phrases\nCords, ropes, cables & string\nbell pull\nbowline\nbungee\ncable\ncatgut\ncord\nfibre\nhalter\nhalyard\nharness\nlandline\nlanyard\nlariat\nlasso\nrein\nshackles\nshock cord\nstringed\nstringy\ntether\nSee more results »\nflex noun\n(BEND)\n[ C usually singular ] the act of bending an arm, leg, etc. or tightening a muscle: He expresses more with a flex of his eyebrow than most actors do with their whole body.\n[ U ] the ability of a material to bend without breaking: The taper in the handle allows flex on impact.\nMore examplesFewer examplesWith a flex of his knees he takes a swing at the golf ball. With a flex of his biceps he bends a steel bar into a curve.Shock absorption is handled by the tires and the flex of the frame.\nSMART Vocabulary: related words and phrases\nBending, twisting and curving\narch your back\nball up\nbendy\nbent\nbowed\ndescribe\nentwine\nflexion\nflexure\nfluted\nintertwine\nrewind\nsinuous\nswoopy\ntangle\ntangled\ntangly\ntorsion\nwrithe\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlexible, loose and yielding\nflex noun\n(HOME)\n[ C ] US (also flex apartment) a flat with a temporary wall put in to create an extra room: This convertible apartment or flex has had a temporary wall placed in the living room to create a third bedroom. On the second floor will be a flex unit which can be rented in various configurations.\nMore examplesFewer examplesIf you and your roommate are set on living downtown but you can't find a two-bedroom in your price range, a flex apartment may be the answer.\nSMART Vocabulary: related words and phrases\nHouses & homes\nA-frame\nADU\naffordable housing\nalmshouse\napartment\ndorm\ndormitory\ndosshouse\nduplex\nefficiency\nmultifamily\nNissen hut\nnon-housing\nold people's home\npalace\ntower block\ntown house\ntownhouse\ntract house\ntrap house\nSee more results »\nAdd to word list\nAdd to word list\nto bend a part of the body, esp. an arm or leg, or to tighten a muscle: Keep your knees flexed at all times. Idiom\nflex your muscle\nAdd to word list\nAdd to word list\nabbreviation for flexible: used to describe arrangements that allow you to choose the hours that you work, whether you work in the office or at home, etc.: Before a flex arrangement can be implemented, both supervisor and employee must fully understand the arrangement. flex work\nto work in a way that allows you to choose the times that you work, whether you work in the office or at home, etc.: I wanted to develop my network at the firm before flexing. With the help of my company, I was able to flex my hours."}