{"id":154884,"name":"flight","type":"noun","us_sound":"flaɪt","us_link":"../audio/f/flight.mp3","uk_sound":"flaɪt","uk_link":"../audio/f/ukflick007.mp3","content":"flight noun\n(JOURNEY)\nAdd to word list\nAdd to word list\nA2 [ C ] a journey in an aircraft: I'll never forget my first flight. How was your flight? All flights to New York today are delayed because of bad weather. My flight was cancelled.\nMore examplesFewer examplesPassengers are requested to check in two hours before the flight.If the flight is late, we'll miss our connection.Welcome aboard flight BA345 to Tokyo.I wonder if you could help me - I'd like some information about flights to New Zealand.Have you had any luck with booking your flight?\nSMART Vocabulary: related words and phrases\nJourneys\nadventure\nbreak-journey\ncarpool\ncarpooling\ncircumnavigation\ncommuting\nexpedition\nfield trip\ngrand tour\nhaul\njaunt\njunket\nlayover\nmove\nodyssey\nride\nsail\nseafaring\ntrip\nwanderings\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: aviation\nflight noun\n(AIRCRAFT)\n[ C ] an aircraft that is making a particular journey: Flight 474 to Buenos Aires is now boarding at Gate 9.\nMore examplesFewer examplesWelcome aboard flight BA345 to Tokyo.All passengers for flight LH103 please proceed to gate 16.\"This is flight 595X. Do you read me? Over.\"Flight BA498 has been delayed by 30 minutes.British Airways regret to announce the cancellation of flight BA205 to Madrid.\nSMART Vocabulary: related words and phrases\nAir travel: aviation\naerial bombardment\naerobatic\naerodynamically\naeronautic\naeronautical\nair traffic control\naircraft\nairlift\nairspace\nairspeed\naviation\nbaggage allowance\nflight path\nhypersonic\noutfly\noverflight\npost-flight\nput something/someone down\nslipstream\nstack\nSee more results »\nflight noun\n(MOVEMENT)\n[ U ] an occasion when something flies or moves through the air: in flight an eagle in flighttake flight Suddenly the whole flock of geese took flight (= started flying). Modern missiles are so accurate because their flight is controlled by computer.\n[ C ] UK a group of birds, aircraft, etc. flying together: a flight of geese/swans\nBouillante/E+/GettyImages\n[ U ]\n&#160; sports\n&#160; specialized in cricket, the movement of the ball through the air when bowled (= thrown to the batter) by a slow bowler: He deceived the batsman with flight and dip and had him stumped.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nlift\nmid-air\nnon-flying\nskim\nsoar\nsoaring\nsomersault\nswishy\nswoop\nwaft\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal groupings\nAir travel: aviation\nCricket\nflight noun\n(ESCAPE)\n[ U ] (an act or example of) escape, running away, or avoiding something: flight from They lost all their possessions during their flight from the invading army. put someone to flight UK old-fashioned\nto defeat someone and force them to run away: The rebels were put to flight by the small regiment.\nSee more take flight\n(of a bird or an aircraft) to leave the ground and begin to fly: He was flapping his arms like a bird taking flight.\nto run away or leave a place: The burglars took flight when the alarm sounded.\nSee more\nMore examplesFewer examplesMany residents of the town took flight when they heard news of the approaching hurricane.The book gives an account of his flight from political persecution in 1956.He confronted the danger and never considered taking flight.The villagers took flight from the advancing troops.While others defended the town, he took flight to the mountains.\nSMART Vocabulary: related words and phrases\nRunning away and escaping\nabscond\nabscond from somewhere\nabscond with someone/something\nback away\nback off\nelopement\nelude\nescapology\nextrication\nflee\nheel\nloose\nrun away\nrunaway\nscarce\nscarper\nscram\nshake\nthrow\nunderground\nSee more results »\nflight noun\n(SET)\nC2 [ C ] a set of steps or stairs, usually between two floors of a building: We live up three flights of stairs.\ntimltv/iStock/Getty Images Plus/GettyImages\n[ C ]\n&#160; food &amp; drink\n&#160; specialized a number of different types of wine, beer, etc. for tasting: Wine bar patrons can sample flights of wine. A wine flight is available to accompany the tasting menu at £ 35 per person.\nSMART Vocabulary: related words and phrases\nParts of buildings: stairs & lifts\nchairlift\ndoorstep\ndrag lift\ndumb waiter\nelevator\nescalator\nfire escape\nladder\nlift\nrope ladder\nrung\nstair\nstaircase\nstairlift\nstep\nstep-free\nstepladder\nstoep\nstoop\ntread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinks - general words\nIdioms\nflight of fancy\nthe top flight\nflight noun\n(FLYING)\nAdd to word list\nAdd to word list\n[ C/U ] an aircraft trip, or the occasion of being a passenger in an aircraft: [ C ] We’ll be arriving home on Tuesday on flight 147. [ C ] All flights out of Midway have been canceled because of bad weather. [ C ] We had a smooth flight all the way.\n[ C/U ] Flight is also the act or process of flying: [ C ] We watched a flight of geese (= a group flying together). [ U ] Some people think that too much money is spent on space flight.\nflight noun\n(ESCAPE)\n[ U ] escape from a particular situation, or the act of leaving: their flight from poverty The flight of manufacturers to the South stripped Massachusetts of its factories.\nflight noun\n(STAIRS)\n[ C ] a set of stairs connecting one floor and the next in a building or other structure: We had to climb three flights of stairs.\nAdd to word list\nAdd to word list\nTRANSPORT a journey in an aircraft: You should leave now or you'll miss your flight.a flight to/from sth She is booked on the 8 a.m. flight to New York.domestic/international flights The company operates eight domestic flights in Finland. scheduled/charter flights The price includes accommodation and return scheduled flights. long-haul/short-haul flights\nECONOMICS a situation in which people or goods move quickly away from a place to escape a bad situation: He added that he didn't think there was a risk of flight of city employees. A return of financial calm to the country should reduce capital flight.\nthe top flight\npeople who are at the highest level in a job or business activity: With this movie he joined the top flight of Hollywood directors.\nFINANCE companies whose shares are worth the most money: Corporate news was dominated by firms outside the top flight."}