{"id":154921,"name":"flimsiness","type":"noun","us_sound":"ˈflɪm.zi.nəs","us_link":"../audio/f/usfleet017.mp3","uk_sound":"ˈflɪm.zi.nəs","uk_link":"../audio/f/ukflick014.mp3","content":"flimsiness noun [U]\n(THIN OR EASILY BROKEN)\nAdd to word list\nAdd to word list\nthe quality of being very thin, or easily broken or destroyed: The flimsiness of the outer packaging means that the product is frequently damaged by the time it gets to the customer. the frilly flimsiness of lace\nMore examplesFewer examplesThe flimsiness of the fabric was enough to bring on a chill.The furniture has a chipboard flimsiness about it.I was all too aware of the flimsiness of my conveyance.\nSMART Vocabulary: related words and phrases\nFragile and breakable\nbreakable\nbrittle\ncobwebby\ncrumbly\ndelicacy\ndelicate\ndodgy\nfissile\nflaky\nflimsily\nflimsy\nfragile\nfragility\nfrail\nfriable\nramshackle\nrickety\ntenuous\ntenuously\nflimsiness noun [U]\n(WEAK AND DIFFICULT TO BELIEVE)\nthe fact of being weak and difficult to believe: The flimsiness of the company's argument was instantly clear. The flimsiness of the case means that there is little chance of getting a conviction.\nMore examplesFewer examplesThe Washington Post published a front-page article about the flimsiness of the intelligence on weapons of mass destruction.Despite the flimsiness of some of the magician's tricks, it was a good show.Like many truisms, its flimsiness reveals itself under the slightest scrutiny.\nSMART Vocabulary: related words and phrases\nImpossible and improbable\napt\naptness\nbe out of the question idiom\nbe pissing in the wind idiom\nbeggar\ndoubt\nfat chance idiom\nflimsily\ngoodbye\ngoodbye to something idiom\nimpenetrably\nimplausibility\nnail\nnailing jelly to the wall idiom\nnohow\nnot have a snowball's chance in hell idiom\none in a million idiom\npig\nsnowball\nunicorn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeakness and vulnerability\nNot believable"}