{"id":154970,"name":"flip","type":"verb","us_sound":"flɪp","us_link":"../audio/f/flip.mp3","uk_sound":"flɪp","uk_link":"../audio/f/ukflick020.mp3","content":"flip verb\n(TURN)\nAdd to word list\nAdd to word list\n[ I or T, usually + adv/prep ] If you flip something, you turn it over quickly one or more times, and if something flips, it turns over quickly: I flipped the book (over) to look at the back cover. I lost my place in my book when the pages flipped over in the wind.flip someone/something over Carefully flip the cake over, so that it's right-side-up. Eventually a wave flipped him over, and he was able to call for help. flip a switch You turn the machine on by flipping (= operating) the switch on the side.\n[ T ] to cook something by turning it over several times over heat: I don't want to spend the rest of my life flipping burgers.\nSMART Vocabulary: related words and phrases\nTurning upside down\nass\ncapsize\ngo ass over (tea)kettle idiom\ninvert\ninverted\ninvertible\noverturn\nsupinate\nupend\nupset\nupside down\nupturned\nYou can also find related words, phrases, and synonyms in the topics:\nPreparing food\nflip verb\n(IMPROVE AND SELL)\n[ T ] mainly US to buy something, such as a house, that is not in very good condition, improve it, then sell it quickly for more money: I am going to take three weeks' vacation and flip this house. She makes money flipping old and tired furniture pieces.\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nfound\nglazier\ngo up\njoiner\nrefurb\nrefurbish\nrefurbished\nrefurbishment\nrenovate\ntiler\nwell built\nworkman\nwright\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\nRestoring and reviving\nflip verb\n(CHANGE SIDES)\n[ I or T ] to change sides, or make someone change sides, and start to give secret information about an organization, country, etc.: Counterintelligence was dependent on spies who had been flipped. FBI agents started the process of trying to get him to flip.\n[ I or T ] mainly US informal to make a statement in a court of law against someone when you are both accused of a crime; to persuade someone to do this: There are cases in which prosecutors have threatened to seek the death penalty unless a witness flips against a co-defendant. He is a Federal prosecutor who specializes in flipping witnesses.\n[ I or T ] mainly US informal to change from supporting one political party to supporting a different one; to make people in a particular place do this: They produced a list of the districts that are considered most likely to flip in the upcoming elections. The Democrats are expected to flip at least two Republican-held congressional districts in Texas.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\nmove the goalposts idiom\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElections\nInternational relations: United States politics & government\nIdioms\nflip a coin\nflip (your lid)Phrasal verbs\nflip someone off\nflip out\nflip through something\nan occasion when something turns over quickly or repeatedly: a flip of a coin The acrobats were doing somersaults and flips (= jumping and turning their bodies over in the air). Compare\nsomersault noun\nSMART Vocabulary: related words and phrases\nTurning upside down\nass\ncapsize\ngo ass over (tea)kettle idiom\ninvert\ninverted\ninvertible\noverturn\nsupinate\nupend\nupset\nupside down\nupturned\nUK informal for\nflippant Synonyms\nimpudent\ninsolent\nSMART Vocabulary: related words and phrases\nNot showing careful thought\nairily\nairiness\nairy\nbang something out\nbash\nbash something out\nfrivolously\nill-conceived\nincaution\nincautious\nincautiously\noff the cuff idiom\npat\npreconceived\nshallow\nshallowly\nshallowness\nshoot from the hip idiom\nunreflective\nunthinking\nSee more results »\nused when you are slightly annoyed: Oh, flip, I've missed the bus.\nSMART Vocabulary: related words and phrases\nExpressions of anger\nay\nbally\nbeg\nbiscuit\nblast\nblasted\nbloody\ndickens\ndoggone\ndrat\ndratted\negad\nfie\nflaming\nla\nmarry\nneed\nprecious\nput/stick that in your pipe and smoke it! idiom\nrats\nSee more results »\nAdd to word list\nAdd to word list\nto cause something to turn over quickly one or more times, or to cause something to move by making a short, quick motion: [ I/T ] I flipped (through) the pages of the dictionary to look up a word. [ T ] You just flip a switch to turn on the computer. [ T ] At the beginning of a football game, the referee flips a coin (= throws it into the air so that it spins in falling) to see which team gets the ball first. Phrasal verb\nflip out\nthe act of turning something over quickly one or more times: They settled the issue by a flip of the coin.\nA flip is also a jump in which you swing your legs over your head as your whole body turns around, so that you come down on your feet in the position you started from.\nAdd to word list\nAdd to word list\nSTOCK MARKET, PROPERTY to sell shares or property immediately after you have bought them in order to make a quick profit: Big institutional clients of investment banks buy and then flip the shares. They are looking to flip the property: they buy at the first stage of development, and aim to sell before they have to pay the final instalment."}