{"id":155224,"name":"floor","type":"noun","us_sound":"flɔːr","us_link":"../audio/f/floor.mp3","uk_sound":"flɔːr","uk_link":"../audio/f/ukflirt018.mp3","content":"floor noun\n(SURFACE)\nAdd to word list\nAdd to word list\nA1 [ C usually singular ] the flat surface of a room on which you walk: The floor was partly covered with a dirty old rug. The bathroom floor needs cleaning.on the floor The children sat playing on the floor.floor space There's barely enough floor space to fit a bed in this room.\nMore examplesFewer examplesThe contents of his bag spilled all over the floor.The child crawled across the floor.There were little drops of paint on the kitchen floor.Careful - I've just polished the floor and it's a bit slippy.Don't sit on the floor - you might dirty your dress.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nupstairs\nwoodblock\nSee more results »\nfloor noun\n(LEVEL OF BUILDING)\nA2 [ C ] a level of a building: This building has five floors. Take the elevator to the 51st floor.on the third floor We live on the third floor. He took the stairs two at a time to the second floor. a ground floor apartment\nMore examplesFewer examplesThere are great views from the fifth floor of the building.The office block's upper floors were being repainted.Women's hosiery you'll find on the second floor, Madam.They've got a whole suite of offices on the 34th floor.I'll meet you by the down escalator on the second floor.\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nupstairs\nwoodblock\nSee more results »\nfloor noun\n(OPEN SPACE)\nB1 [ C usually singular ] a public space for activities such as dancing and having formal discussions: a dance flooron the floor of The new proposal will be discussed on the floor of the senate tomorrow.factory floor He spent several years working on the factory floor (= in the factory) before becoming a manager.from the floor The chairman said that he would now take questions from the floor (= from the audience). have the floor\nto have the right to speak: Silence, please, the prime minister has the floor.\nSee more take (to) the floor\nto stand and begin to dance: The newlyweds were the first to take the floor.\nSee more take the floor\nto start speaking: The Majority Leader again took the floor.\nSee more\nMore examplesFewer examplesI have an exhibitionist streak that comes out on the dance floor.The dance floor was full of middle-aged couples smooching to slushy ballads.The panel spoke for an hour before opening the discussion up to the floor.He started on the factory floor and worked his way up to the boardroom.The other dancers cleared as the bride and groom took to the floor.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nelbow room\nexpanse\nfootprint\nheadroom\nnon-spatial\nroom\nspace\nspacial\nspacing\nspacious\nspatialize\nspatially\nstanding room\nsubzone\nvoid\nway\nzone\nSee more results »\nfloor noun\n(BOTTOM)\nthe floor\nthe bottom surface of the sea, a forest, a cave, etc.: the floor of the floor of the ocean The reef rises 100 m from the ocean floor. The cave floor was perpetually damp. Ferns populate the forest floor under the densest part of the canopy. Flounder and other scavengers live along the floor of the sea. The floor of the rainforest was covered with an impenetrable tangle of vines.\nReinhard Dirscherl/WaterFrame/GettyImages\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nback\nbase\nbases\nbed\ncrust\nescutcheon\nface\nfront\nmeniscus\nmulti-sided\nnap\nobverse\noverlay\nplate\nrear\nside\nsubstrate\nsuperficialis\nsurface area\nSee more results »\nIdiom\ngo through the floor\nfloor verb\n(HIT)\n[ T ] to hit someone and cause them to fall: He was floored with a single punch to the head.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nfloor verb\n(SURPRISE/CONFUSE)\n[ T often passive ] informal to surprise or confuse someone so much that they are unable to think what to say or do next: I didn't know what to say - I was completely floored.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namaze\namazing\namazingly\nastonish\ndumbfounding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\npull\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nstagger\nunbelievable\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\nIdiom\nfloor it\nfloor noun\n(SURFACE)\nAdd to word list\nAdd to word list\n[ C ] the flat surface that you walk on when you are inside a building: a tile floor hardwood floors The children sat on the floor.\nfloor noun\n(LEVEL OF BUILDING)\n[ C ] a level of a building; a story : They rented office space on the second floor. Note: In the US, the first floor of a building is usually at ground level.\nfloor noun\n(BOTTOM)\n[ C usually sing ] the bottom surface of the sea, a forest, a valley, etc.: Submarines were exploring the ocean floor for signs of the wreck.\nfloor noun\n(OPEN SPACE)\n[ C usually sing ] a public space for having formal discussions: The proposition was discussed on the Senate floor. The chairman said that he would now take questions from the floor (= from the ordinary people at the meeting).\nfloor verb [T]\n(SURPRISE)\nto surprise or shock someone: She was completely floored when she heard that he was leaving the country.\nfloor verb [T]\n(GO FAST)\nto drive a car as fast as it will go: His buddy started the car and floored it.\nAdd to word list\nAdd to word list\nECONOMICS the lowest level, number, or amount something is allowed to reach: provide/keep/put a floor under sth Theoretically, buybacks put a floor under stock prices and raise earnings per share.find/reach a floor Analysts believe the market has found a floor at about 2,560 points.raise the floor on sth Another rule would raise the floor on the amount of assets a company must have to register with the SEC. Many of these fixed-price contracts were signed when the price of coal was on the floor. Compare\nceiling\nFINANCE, MONEY the lowest rate a country's government will allow its currency to reach in relation to other currencies: The euro finally seems to have hit the floor against the dollar.\nthe floor\nMEETINGS the place where a formal or public meeting is held, or the people at the meeting: On the floor yesterday, House members voted down an amendment to allow fines to be waived. In response to a question from the floor the CEO confirmed the agency would be continuing its mentor scheme.the Senate/House/Security Council floor In his remarks on the Security Council floor today, the Commissioner called on all parties to act responsibly. floor debate/vote During floor debate, conservatives argued that the bill violated First Amendment rights.\nSTOCK MARKET the part of a stock exchange where shares are traded: Traders erupted into boisterous cheers on the floor today as the market soared.\ndrop/fall/go through the floor\nto decrease in price or value, usually in a short period of time: Sales and profits are falling through the floor, with no prospect of a recovery in sight.\nhave/take the floor\nMEETINGS to have the right to speak or to start to speak in a meeting: Excuse me, I have the floor and have the right to be listened to.\nget in on the ground floor UK informal ( US also get in on the first floor)\nto become involved from the beginning in a business activity that you think will be successful: This is our chance to get in on the first floor of an industry that's going to be big. See also\ndealing floor\nfactory floor\nthe shop floor\ntrading floor"}