{"id":155189,"name":"flood","type":"verb","us_sound":"flʌd","us_link":"../audio/f/flood.mp3","uk_sound":"flʌd","uk_link":"../audio/f/ukflirt011.mp3","content":"flood verb\n(COVER WITH WATER)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to cause to fill or become covered with water, especially in a way that causes problems: Our washing machine broke down yesterday and flooded the kitchen. The whole town flooded when the river burst its banks.be flooded out Several families living by the river were flooded out (= forced to leave their houses because they became covered with water).\nMore examplesFewer examplesWhen the river flooded, the footbridge was swept away.The river burst its banks and flooded the surrounding fields.He left the bath running and flooded the bathroom.The severe cold caused a water main to burst and flood the street.This coastal area floods every year, so the local people build their houses on stilts.\nSMART Vocabulary: related words and phrases\nFloods, tides & currents\natmospheric river\ndeluge\neddy\nflash flood\nflood tide\nfloodplain\ngyre\nhigh tide\nhigh water mark\ninundation\nlow tide\noverwhelm\nsea level\nswash\ntidally\ntide table\nturbulence\nturbulent\nwaterline\nwhelm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnclosing, surrounding and immersing\nflood verb\n(ARRIVE)\nB2 [ I usually + adv/prep, T ] to fill or enter a place in large numbers or amounts: flood into Donations are flooding into the homeless shelter.flood in She drew back the curtains and the sunlight came flooding in.be flooded with He was flooded with (= suddenly felt a lot of) joy when his first child was born.flood back For Proust, the taste of a madeleine brought childhood memories flooding back (= made him suddenly remember a lot of things). flood the market\nto make goods available in such large numbers that the price falls, or other goods cannot compete: Japanese cars have flooded the market (= a lot of them are on sale). They have flooded the market with low-cost imports.\nMore examplesFewer examplesThe market is flooded with thousands of new titles each month.Cheap food from neighbouring countries is flooding the market.Central banks around the world flooded the markets with money.\nMore examplesFewer examplesWearing scarves and hats which proclaimed their allegiance, the football fans flooded into the bar.There are few jobs for the peasants who have flooded into the cities from the poverty-stricken countryside in search of work.Offers of help have been flooding in since news of the disaster first emerged.Messages of support have been flooding in since she announced her decision to stand for president.Memories of childhood flooded back as she looked through the photographs.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nround\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying & selling - general words\nPhrasal verb\nflood something with something\nflood noun\n(WATER)\nB1 [ C or U ] a large amount of water covering an area that is usually dry: After the flood it took weeks for the water level to go down.in flood The river is in flood (= water has flowed over its banks) again.\nAshleyCooper/CorbisDocumentary/GettyImages in floods of tears UK\ncrying a lot: I found her in floods of tears in the toilets.\nSee more the Flood\n(in the Bible) a flood sent by God that covered the whole earth as a punishment\nMore examplesFewer examplesThe recent flood has swept away the footbridge.You should check your policy to see if you're covered for flood damage.After the flood, nothing remained of the village.The floods left thousands of people destitute.People living in low-lying areas were evacuated because of the floods.\nSMART Vocabulary: related words and phrases\nFloods, tides & currents\natmospheric river\ndeluge\neddy\nflash flood\nflood tide\nfloodplain\ngyre\nhigh tide\nhigh water mark\ninundation\nlow tide\noverwhelm\nsea level\nswash\ntidally\ntide table\nturbulence\nturbulent\nwaterline\nwhelm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe Bible - people, events & places\nflood noun\n(LARGE AMOUNT)\nC2 [ C ] a large amount or number of something: flood of A flood of cheap imports has come into the country.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nstack\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nIdiom\nbefore the Flood\nflood verb [I/T]\n(COVER WITH WATER)\nAdd to word list\nAdd to word list\nto fill or become covered with water or to cause this to happen to something: [ T ] A burst pipe flooded the bathroom. [ I ] The basements of many downtown buildings would flood whenever it rained.\nflood verb [I/T]\n(FILL)\nto fill or be filled with a large amount or too much of something: [ I always + adv/prep ] Sunlight floods in through a skylight in the ceiling. [ I always + adv/prep ] In the 1960s, Cuban immigrants began to flood into Florida. [ T ] We don’t want them to flood the market with cheap imports.\nIf you flood an engine, you fill it with so much fuel that it will not start.\nflood noun [C]\n(LARGE AMOUNT OF WATER)\na large amount of water covering an area that is usually dry: Kingston was heavily damaged by a flood.\nflood noun [C]\n(LARGE AMOUNT OF SOMETHING)\na large amount or number of something: Planners are hoping for a flood of visitors when the center opens. He was filled with a flood of new emotions.\nAdd to word list\nAdd to word list\nto enter or leave a place in large numbers or amounts: Record public spending, fueled by high oil prices, is flooding the country's flourishing economy with cash. Electronic gadgets have flooded the market in recent years.flood in from somewhere Turnover continues to increase as orders flood in from around the world.flood into/out of sth Foreign money has been flooding into the London property market for several years now.\n[ T, usually passive ] to send something such as letters, emails, or requests in large numbers to a person or organization: Unwanted email – or spam – is flooding inboxes at an unprecedented rate.be flooded with orders/requests/calls The phone lines were flooded with calls from worried and angry consumers.flood sth with sth Overseas students continue to flood colleges with applications for courses.\na large number or amount of people or things: Fund managers are surprised how quickly the trickle of money leaving the country has become a flood.a flood of sth A bumper harvest coupled with a flood of imports have pushed the price of sugar lower."}