{"id":155293,"name":"florentine","type":"adjective","us_sound":"ˈflɔːr.ən.tiːn","us_link":"../audio/f/cdo0123usflor0863.mp3","uk_sound":"ˈflɒr.ən.taɪn","uk_link":"../audio/f/cdo0319ukflor0640.mp3","content":"Florentine adjective\n(FROM FLORENCE)\nAdd to word list\nAdd to word list\nfrom, in, or relating to the Italian city of Florence: The basis of the modern Italian language was established by the Florentine poet Dante Alighieri. She recommended several Florentine restaurants.\nMore examplesFewer examplesIn the period from 1515 to 1524 the Florentine painters Rosso Fiorentino and Jacopo da Pontormo broke away from Renaissance classicism.The menu is based on authentic Florentine cooking. Among the Florentine sculpture in the museum is a bust of Lorenzo de Medici by Andrea del Verrocchio.We serve a classic Tuscan meal that includes a Florentine terrine made with duck and chicken livers.The meeting took place at a Florentine villa.\nSMART Vocabulary: related words and phrases\nTowns & regions: city names & their inhabitants\nAberdeen\nAberdonian\nAbidjan\nAbu Dhabi\nAbuja\nBratislava\nBrazzaville\nBridgetown\nBrisbane\nBristol\nDushanbe\nEdinburgh\nEl Paso\nEton\nFaisalabad\nMelbourne\nMemphis\nMiami\nMontreal\nMoscow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: towns, cities & villages (general)\nFlorentine adjective\n(IN COOKING)\n[ after noun ] (also florentine) (also à la florentine) cooked with spinach or served on a layer of spinach (= a dark green leaf eaten as a vegetable): For breakfast I had eggs florentine. The Chicken Florentine is stuffed with ricotta and spinach.\nMore examplesFewer examplesThe Tilapia Florentine was very good - the sauce was delicious and light, made with fresh spinach.In classic cuisine the name of the dish, such as Sole à la florentine or Sole florentine, designates its particular garnish.Dishes span the globe--mushroom Florentine, American-style pork spare ribs.My favourite dish was crawfish florentine stuffed into a small French bread.\nSMART Vocabulary: related words and phrases\nCookery terms\namandine\nau gratin\ncuisine\ncurdle\ndessertspoonful\nextra-rare\nfarci\nflambé\nmise en place\nniçoise\nNormande\nnose to tail idiom\nnouvelle\ntemper\ntsp.\nuncooked\nunstrained\nà la grecque\nà la king\nà la mode\nSee more results »\nFlorentine noun [C]\n(PERSON)\nsomeone who comes from or lives in the Italian city of Florence: Filippo Strozzi the Elder (1428-1491) was one of the richest Florentines of his day. She married an Italian and became an adopted Florentine.\nMore examplesFewer examples \"The Decameron\" is Boccaccio's bawdy tale of 14th-century Florentines who flee to the countryside to escape the plague and spend 10 days spinning stories to one another. This is Deborah, the prophetess, as painted by the Florentine, Del Fonca.The church is revered by Florentines as the last resting place of many great Italians.\nSMART Vocabulary: related words and phrases\nTowns & regions: city names & their inhabitants\nAberdeen\nAberdonian\nAbidjan\nAbu Dhabi\nAbuja\nBratislava\nBrazzaville\nBridgetown\nBrisbane\nBristol\nDushanbe\nEdinburgh\nEl Paso\nEton\nFaisalabad\nMelbourne\nMemphis\nMiami\nMontreal\nMoscow\nSee more results »\nFlorentine noun [C]\n(BISCUIT)\n(also florentine) a biscuit made from nuts and dried fruit held together with melted butter, sugar, and honey, baked then covered with a layer of chocolate: She came in with a plate of florentines.\nMore examplesFewer examplesUse a spoon to spread melted chocolate over the flat base of each florentine.They sell delicious handmade truffles and florentines.Bake the florentines for 10 minutes until they are a deep golden colour. Cooking monkfish for 10 and making orange Florentines is a displacement activity to stop me worrying.\nSMART Vocabulary: related words and phrases\nBiscuits\namaretto\nanimal cracker\nAnzac biscuit\nbaked goods\nbannock\ncream cracker\ncrispbread\ncrumb\ncustard cream\ndigestive\nmillionaire's shortbread\nmisshape\noatcake\noyster cracker\npastry\nshortbread\nshortcake\nsnickerdoodle\nsoda cracker\nsponge finger\nSee more results »"}