{"id":155276,"name":"floral","type":"adjective","us_sound":"ˈflɔːr.əl","us_link":"../audio/f/floral.mp3","uk_sound":"ˈflɔː.rəl","uk_link":"../audio/f/ukflirt028.mp3","content":"Add to word list\nAdd to word list\nmade of flowers, or decorated with pictures of flowers: floral curtains/print/wallpaper a floral display/tribute\nSMART Vocabulary: related words and phrases\nFlowers - general words\nabscission\nanther\nblossom\ncatkin\nchasmogamous\ncleistogamous\ndouble\nefflorescence\nfemale\ngrow\nhead\nin flower idiom\nmulti-headed\npalynological\npetal\npollen\nsepal\nstalk\nstamen\nstigma\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nspecialized a smell or perfume that is like flowers: The candle has a sweet but not cloying scent of white florals. Their signature women's fragrance is a floral with woody undertones.\nfabrics\n&#160; specialized a pattern of flowers, or cloth, paper, etc. that is decorated with flowers: They were prettily dressed in florals and pastels. High-collar blouses come in bright polka dots and eccentric florals. Her advice when choosing the right mix of prints for a room is to start with a floral.\nart\n&#160; specialized a painting or picture of flowers: Georgia O'Keeffe's bold florals have a vital place in American modernism. The photographs in the exhibition include figures, still lifes, florals, and landscapes.\nMore examplesFewer examplesWe love the fresh florals in their new eau de parfum.For autumn, he suggests classic, full-bodied florals such as Chanel No. 5.Because the wallpaper has a tropical feel, you can pair it with florals, shells, and bamboo or wicker furnishings.I avoid large, loud florals when choosing work wear.\nSMART Vocabulary: related words and phrases\nToiletry & perfumes\naftershave\nagarbatti\nair freshener\nbath bomb\nbath salts\nbinturong\ncarbolic soap\nemery board\nmusk\npowder puff\nsanitary\nshave\nshower gel\nSPF\nswab\ntoilet soap\ntoothpick\ntowelette\nwax melt\nylang-ylang\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSmells & smelling\nStyle & appearance of clothes\nBuilding: interior decoration\nPatterns and shapes\nPictures\nAdd to word list\nAdd to word list\nmade of flowers, or decorated with images of flowers: a floral display floral curtains/wallpaper"}