{"id":155442,"name":"flourish","type":"verb","us_sound":"ˈflɝː.ɪʃ","us_link":"../audio/f/eus71848.mp3","uk_sound":"ˈflʌr.ɪʃ","uk_link":"../audio/f/ukflori017.mp3","content":"flourish verb\n(SUCCEED)\nAdd to word list\nAdd to word list\nC2 [ I ] to grow or develop successfully: My tomatoes are flourishing this summer - it must be the warm weather. Watercolour painting began to flourish in Britain around 1750.\nThesaurus: synonyms, antonyms, and examples\nto achieve something aimed forsucceedIf you work hard, you'll succeed.thriveUniversity is a place where she will thrive.flourishHe tried journalism, but flourished as a novelist. triumphThe Labour Party triumphed in the election.bring something offShe's one of the few singers who can bring off such a difficult piece of music.\nSee more results »\nSMART Vocabulary: related words and phrases\nMaking progress and advancing\nadvance the cause\nadvancement\nage\nahead\nahead of\ncarry\nevolve\nevolved\nflower\nformatively\nfrom A to B idiom\nfurtherance\njourney\nmature\npunctuated equilibrium\nrebuild\nregenerate\nripen\nripeness\nspread\nSee more results »\nflourish verb\n(WAVE)\n[ T ] mainly UK to move something in your hand in order to make people look at it: She came in smiling, flourishing her exam results.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nfluff\nfluff something up\njitter\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nshimmy\nsway\nthrash\nvibrate\nvibration\nvibratory\nwaggle\nwiggle\nSee more results »\nwith a flourish\nIf you do something with a flourish, you do it with one big, noticeable movement: The waiter handed me the menu with a flourish.\nSee more\nflourish verb\n(SUCCEED)\nAdd to word list\nAdd to word list\n[ I ] to grow or develop successfully: Parts of the city continue to flourish. This is the perfect environment for our company to flourish and expand in.\nflourish verb\n(WAVE)\n[ T ] to move something in your hand in order to make people look at it: She ran up to her father, flourishing her diploma.\nflourish noun [C]\n(WAVE)\na big, noticeable movement: I pulled into the driveway with a flourish .\nAdd to word list\nAdd to word list\nto be successful, for example, by making a lot of money or developing quickly: Thanks to a lot of effort and the support of local people, the business flourished. flourishing adjective\nA flourishing market requires competition, proper prices and proper incentives."}