{"id":155436,"name":"flour","type":"noun","us_sound":"ˈflaʊ.ɚ","us_link":"../audio/f/flour.mp3","uk_sound":"flaʊər","uk_link":"../audio/f/ukflori016.mp3","content":"Add to word list\nAdd to word list\nB1 powder made from grain, especially wheat, used for making bread, cakes, pasta, pastry, etc.: Thicken the sauce with a little flour. Do you prefer flour or corn tortillas? See also\nall-purpose flour\nplain flour\nself-raising flour\nself-rising flour\nRogerDixon/DorlingKindersley/GettyImages\nsoft powder made from the seeds or roots of a plant that often contains a lot of starch (= a substance found in potatoes, rice, etc.), used in cooking : These Vietnamese pancakes are made of rice flour, and so thin you can read a newspaper through them. You can substitute wheat flour with almond flour in cakes, cookies and muffins. coconut/chickpea/tapioca flour See also\ncornflour UK\ngram flour\nMore examplesFewer examplesIn a large bowl, mix together the flour, sugar and raisins in a bowl.To make the pastry, sieve the flour and salt into a mixing bowl.I buy unbleached flour from the local health food store.Gently work the butter into the flour until there are no lumps left.High in protein and healthy fat, almond flour is a good substitute for wheat flour.Potato flour makes light and airy dinner rolls.\nSMART Vocabulary: related words and phrases\nFlour & yeast\nall-purpose flour\nbaker's yeast\nbesan\nblue corn\ncassava\nfarinha\nfloury\ngluten\ngraham flour\ngram flour\nmother\nnooch\nnutritional yeast\noatmeal\npatent flour\nsemolina\nsourdough\nstoneground\nunbolted\nwheatmeal\nSee more results »\nto put flour on a surface to prevent food from sticking: Grease and flour the tins thoroughly.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nbind\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglazed\ngrate\ningredient\njerk\njulienne\nrecipe\nrehydrate\nrestuff\nrice\nrustle something up\ntoss\nzap\nSee more results »\nAdd to word list\nAdd to word list\npowder made from grain, esp. wheat, used for making bread, cakes, pasta, pastry, etc.: wheat/rye flour three cups of flour\nto put a thin layer of flour on something: Flour the board, then roll out the dough."}