{"id":155463,"name":"flow","type":"verb","us_sound":"floʊ","us_link":"../audio/f/flow.mp3","uk_sound":"fləʊ","uk_link":"../audio/f/ukflirt008.mp3","content":"flow verb [I]\n(MOVE)\nAdd to word list\nAdd to word list\nB1 (especially of liquids, gases, or electricity) to move in one direction, especially continuously and easily: flow down Lava from the volcano was flowing down the hillside.flow into Many short rivers flow into the Pacific Ocean.flow through The river flows through three counties before flowing into the sea just south of here.traffic flows With fewer cars on the roads, traffic is flowing (= moving forward) more smoothly than usual. Synonyms\ndribble (FLOW SLOWLY)\ndrip\nspill\ntrickle down, from, out of, etc. something\nMore examplesFewer examplesEvery day, 30 million gallons of untreated human waste flow from Ciudad Juarez into the Rio Grande.The teacher drew a diagram showing how the blood flows through the heart.There's a lovely stream that flows through their garden.The road was blocked for two hours after the accident, but traffic is now flowing smoothly again.The pipes creaked as water flowed through the system.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nElectricity & electronics\nflow verb [I]\n(CONTINUE)\nto continue to arrive or be produced: flow in Please keep the money flowing in!flow into Offers of help are flowing into the disaster area from all over the country.thoughts flow My thoughts flow more easily if I work on a computer.wine flows By eleven o'clock, the wine was starting to flow.conversation flows After they'd all had a drink or two, the conversation began to flow.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nsoldier\nspan\nspin\nSee more results »\nflow verb [I]\n(HANG DOWN)\nto hang down loosely and often attractively: Her long red hair flowed down over her shoulders.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHanging and suspending\nflow noun\n(MOVEMENT)\nB2 [ C usually singular ] the movement of something in one direction: flow of the flow of a river the flow of traffic the flow of blood Synonyms\ndribble (SLOW FLOW)\ndrip (LIQUID)\nrivulet literary\nstream (CONTINUOUS FLOW)\ntrickle (LIQUID)\nMore examplesFewer examplesLigatures are used in surgery to stop the flow of a bleeding artery.The country's asylum laws were amended to staunch the flow of economic migrants.They are broadening the bridge to speed up the flow of traffic.She tied a handkerchief around the wound to stem the flow of blood.Diets that are high in saturated fat and cholesterol tend to clog up our arteries, thereby reducing the flow of blood.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nflow noun\n(CONTINUOUS NUMBER)\n[ C usually singular ] a regular and quite large number of something: steady flow of There's been a steady flow of visitors.\n[ S ] a situation in which something is produced or moved continuously: flow of the flow of ideas/information\nMore examplesFewer examplesThe country's asylum laws were amended to staunch the flow of economic migrants.The current structure does not facilitate efficient work flow.They are worried that the flow of tourists could swell into an unmanageable torrent if there are no controls.He's currently experiencing problems with his cash flow.There is a stimulating flow of ideas between the departments.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\nflow noun\n(HAIR)\n[ U ] US informal a man's long hair, especially that of an athlete : His blond locks give him some incredible flow, making him one of the most recognizable players in the league.\nSMART Vocabulary: related words and phrases\nHair\nanti-dandruff\nas bald as a coot phrase\nbaldness\nbedhead\ncoily\nfuzzy\nkink\nshaggy\nsideburns\ntash\ntextured\ntousle\ntousled\ntress\ntuft\nunkempt\nunshorn\nwavy\nwig\nwiry\nSee more results »\nIdioms\ngo against the flow\ngo with the flow\nAdd to word list\nAdd to word list\n(esp. of liquids, gases, or electricity) to move in one direction, esp. continuously and easily: Air flows over an aircraft’s wing faster than it flows under it. Lava from the volcano was flowing down the hillside. An electrical current flows from positive to negative. Many rivers flow into the Pacific Ocean. With fewer cars on the roads, traffic is flowing (= moving forward) more smoothly than usual. fig. My thoughts flow more easily (= I can think more easily) if I work on a word processor.\nSomething can be said to flow if it hangs down loosely and attractively: Her long, red hair flowed down over shoulders.\nmovement of a liquid: This drug increases the flow of blood to the heart. fig. Music interrupted the flow of the conversation (= the regular exchange between speakers).\nearth science A flow is also large mass of material, such as lava (= melted rock from a volcano), that is flowing or has flowed in the past.\nAdd to word list\nAdd to word list\nif money, goods, etc. flow, they move from one company, organization, or place to another in large amounts: Capital must flow freely around the world in order to ensure international prosperity.flow in/out/back As revenue comes in it will flow back to investors.flow into/through/out of sth The money flowing into online advertising today is largely from direct marketing companies.\nif discussions or ideas flow, people talk and exchange information in a relaxed way: Ideas flow more easily in an atmosphere of trust. Phrasal verbs\nflow from sth\nflow through to sb/sth\na situation in which a large amount of money or goods moves from one company, organization, or place to another: Portfolio investment flows generally equate to high interest rates.a steady/constant flow of sth The company is in the enviable position of having no debt and a steady flow of revenue.the flow of money/goods/resources State authorities welcome the flow of money from those seeking city contracts.\na situation in which information and ideas are exchanged between companies or organizations: Improving the flow of information between buyers and sellers makes markets more efficient.a flow of sth A shared sense of commitment to a project leads to a free flow of ideas and information. See also\naudience flow\ncapital flow\ncash flow\ninvestment flow"}