{"id":155622,"name":"fluke","type":"noun","us_sound":"fluːk","us_link":"../audio/f/fluke.mp3","uk_sound":"fluːk","uk_link":"../audio/f/ukfluct011.mp3","content":"fluke noun\n(LUCK)\nAdd to word list\nAdd to word list\n[ C or U ] informal something that happens, usually something good, that is the result of chance instead of skill or planning: The first goal was just a fluke.sheer fluke I heard about the sale by sheer fluke.fluke of nature If you got rich by some fluke of nature that doesn't make you brilliant. Related word\nfluky\nMore examplesFewer examplesThe discovery was a fluke.I don't think it's a fluke that the numbers add up the way that they do.I went there almost by fluke.The fact that I beat him was no fluke.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\ncrapshoot\neven-money\nfluky\nfortuitous\nfortuitously\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nnoncausal\nserendipitous\nserendipitously\nsortition\nstumble into something\nunsystematic\nSee more results »\nfluke noun\n(OF WHALE)\n[ C ] one of the two parts that a whale's tail is divided into: Individual humpback whales can be identified by their tail flukes.\nMore examplesFewer examplesThe whales gracefully arced out of the water before disappearing again with a flick of their flukes.I have seen whales swimming in a circle around a school of herrings, forcing them together in a whirlpool created by their flukes.\nSMART Vocabulary: related words and phrases\nMiscellaneous animal body parts\nback end\nbobtail\ncollar\ndorsal\nfetlock\nfinny\nflipper\ngiblets\ngill\nnipple\npouch\npouched\nprehensile\npseudopod\nsting\nteat\ntentacle\nunderpart\nvesicle\nwithers\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarine mammals\nfluke noun\n(WORM)\n[ C or U ] a small flatworm (= a creature with a flat body) that lives as a parasite inside or on the body of another animal, and can cause disease: liver fluke Parasites such as liver flukes can quickly make a sheep lose condition.\nMore examplesFewer examplesThe cause of the disease is a blood fluke.The crab hosts a parasitic lung fluke that can infect mammals including humans.Inspect your fish carefully to see if there are any external parasites, such as flukes. The ant's brain has been invaded by a fluke.\nSMART Vocabulary: related words and phrases\nWorms, snails, slugs & similar animals\nannelid\ncentipede\nearthworm\nechinococcus\nescargot\ngastropod\nleech\nlimacine\nmillepede\nmillipede\nnematode\npill bug\nroly-poly\nroundworm\nslug\nsnail\ntapeworm\nworm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nZoology: veterinary medicine\nAdd to word list\nAdd to word list\nsomething, usually a good thing, that has happened as result of chance instead of skill or planning: He’s trying to prove that his last victory wasn’t a fluke."}