{"id":155715,"name":"fluorescent","type":"adjective","us_sound":"flɔːˈres.ənt","us_link":"../audio/f/fluorescent.mp3","uk_sound":"flɔːˈres.ənt","uk_link":"../audio/f/epd31874.mp3","content":"fluorescent adjective\n(LIGHT)\nAdd to word list\nAdd to word list\nproducing light by fluorescence (= absorbing light of a short wavelength and producing light of a longer wavelength): fluorescent lighting Fluorescent bulbs use less electricity than incandescent bulbs. Many biological substances are fluorescent under UV light. See also\nfluorescent light\nMore examplesFewer examplesThe harsh fluorescent bulbs have been removed, replaced by ceiling lights with warm tungsten bulbs.The firm processes computers, televisions, and fluorescent lamps for recycling.They had injected the stem cells with a fluorescent dye so they could track them as they replicated.The lights are fluorescent, to save energy.\nSMART Vocabulary: related words and phrases\nThe qualities of light\nbacklit\nbrightly\nbrilliantly\ncoruscating\ndazzlingly\ndullness\nflickering\nfloodlit\nglittering\nincandescent\nlambent\nluminescence\nluminosity\nlustrously\nnon-fluorescent\nnon-solar\nopalescent\novercast\nspangly\nunshaded\nSee more results »\nfluorescent adjective\n(COLOUR)\nFluorescent colours are very bright, especially when light is shining on them: fluorescent green/yellow/orange/pink I bought some highlighter pens in fluorescent colours.\nMore examplesFewer examplesWorkers in fluorescent orange vests were working on the bridge. This is not a subtle film: the colours are fluorescent, the acting is over the top and the soundtrack is loud.\nSMART Vocabulary: related words and phrases\nThe qualities of colour\nanalogous\nbrightly\nbrightness\ncolourful\ncolourfully\ndarkness\nharsh\nneutrally\nnon-complementary\nnon-fluorescent\nnon-yellowing\nover-bright\npastel\npsychedelic\nvibrancy\nvibrantly\nviolent\nvivid\nvividly\nvividness\nSee more results »\nRelated word\nfluorescence\nAdd to word list\nAdd to word list\n(of a substance) giving off a very bright light when electricity or other waves go through it: The map was marked with a thin, fluorescent-green line."}