{"id":155979,"name":"focus","type":"noun","us_sound":"ˈfoʊ.kəs","us_link":"../audio/f/focus.mp3","uk_sound":"ˈfəʊ.kəs","uk_link":"../audio/f/ukfob__004.mp3","content":"focus noun\n(OF ATTENTION)\nAdd to word list\nAdd to word list\nC1 [ C or U ] the main or central point of something, especially of attention or interest: focus of attention I think Dave likes to be the focus of attention.focus of interest The main focus of interest at the fashion show was Christian Lacroix's outrageous evening wear.focus on The media focus on politicians' private lives inevitably switches the attention away from the real issues. There was a lot of focus on exam results at my school.\n[ U ] careful attention that is given to something such as a task, or the ability to give your full attention to something: lose focus In my over-confidence I lost focus and conceded a point. Performing such a long piece, it's a challenge just to keep your focus.mental focus Yoga is less about fitness and more about mental focus.\nMore examplesFewer examplesEducation is the current focus of public debate.They have narrowed the focus of the investigation, to concentrate on younger adults.What is the focus of your report?The baby had become the focus of all her energies.The focus of the inquiry was on faults in the company's safety procedures.We need more focus on innovation in business.\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nweight\nworth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying attention and being careful\nfocus noun\n(SCIENCE)\n(in physics) the point where waves of light or sound that are moving towards each other meet: the focus of a lens be in/out of focus\nused to say that a photograph or video is clear/not clear: Make sure the image is in focus.\nSee more\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nSee more results »\nfocus verb\n(CAMERA, EYES, LIGHT, ETC.)\n[ I or T ] If you focus a device such as a camera or microscope, or if it focuses, a device on the lens moves so that you can see a clear picture: focus something on something She focused her camera on a tiny insect. The camera is slow to focus in low light.\n[ I or T ] If you focus your eyes, or if your eyes focus, you try to look directly at an object so that you can see it more clearly: When they first took the bandages off, she/her eyes couldn't focus properly (= she couldn't see clearly).\n[ T ] to direct light waves, sound waves, etc. at a particular point: focus something on something The human eye has a lens to focus light on the retina. He designed a transmitter that could focus radio waves of different frequencies on tumours.be focused on During an ultrasound scan, sound waves are focused on the body and scanned by a computer.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysics: optics, microscopy & lasers\nUsing the eyes\nGiving out light\nfocus verb\n(CONCENTRATE)\n[ I ] to give your full attention to what you are doing or to what is happening: I'm finding it hard to focus today. I know it's noisy in here, but try to focus. Synonym\nconcentrate\nMore examplesFewer examplesDepression or anxiety can make it hard to focus.Some of the kids in the class have difficulty focusing.\nSMART Vocabulary: related words and phrases\nPaying attention and being careful\nattention span\nattentiveness\nbe good, and if you can't be good, be careful idiom\nbe on (your) guard idiom\ncared-for\negg\nguard\nhandle/treat someone with kid gloves idiom\nhang\nhang on/upon something\nhave a care idiom\nprudently\nreligion\nrevolve\nrevolve around someone/something\nsafety\nsafety first idiom\nsit\nthe/a glare of something idiom\nzero\nSee more results »\nPhrasal verb\nfocus (something) on someone/something\nfocus noun\n(MAIN OBJECT)\nAdd to word list\nAdd to word list\n[ C ] (also focal point) the main object or interest, or the attention given something: The focus of attention has shifted from the economy to improving the public schools. State officials urge continued focus on mosquito control.\nfocus noun\n(POSITION)\n[ C/U ]\n&#160; physics the exact place or position where beams of light, heat, or sound meet after moving toward each other; focal point\n[ C/U ]\n&#160; earth science A focus is also the exact position inside the earth where an earthquake begins. in focus (also out of focus)\nA photograph or an image seen through a device with a lens, such as a microscope, telescope, or camera, that is in focus is clear and one that is out of focus is not clear.\nfocus verb [I/T]\n(DIRECT ATTENTION)\nto direct attention toward something or someone: [ I ] Tonight’s program focuses on homelessness.\nfocus verb [I/T]\n(ADJUST)\nto adjust something in order to see more clearly: [ T ] I focused the binoculars on the bird on a branch of the tree.\nAdd to word list\nAdd to word list\n[ C ] the central or most important thing for a company or organization: the main/primary/principal focus of sb/sth The primary focus of a manager is on efficiency.turn/switch/shift the focus from sth to sth A bonus-based incentive system shifts the focus from the behavior of sales people to the results they deliver.focus on sth The company's Five-Year Plan continues the dual focus on use and production.\n[ U ] the act of giving attention to a particular group of customers or a particular activity: The restructuring was aimed at establishing real customer focus throughout the organization.\n[ U ] the ability to give all your attention, time, and energy to a particular activity: The enquiry concluded that the failure to address the issue beforehand was the result of a lack of focus and drive by the board.\nto give a lot of attention, time, energy, etc. to one particular group of customers or a particular activity: focus on sth The company's chief executive is moving to a new corporate headquarters in Dubai to focus on business in the Middle East, Africa, Europe, and Asia.focus attention/efforts/resources on sth We shall continue to focus our efforts on cutting costs.focus entirely/exclusively/mainly on sth By the age of 30, he had decided to focus almost exclusively on corporate work."}