{"id":156038,"name":"fog","type":"noun","us_sound":"fɑːɡ","us_link":"../audio/f/eus75754.mp3","uk_sound":"fɒɡ","uk_link":"../audio/f/ukfob__011.mp3","content":"fog noun\n(WEATHER)\nAdd to word list\nAdd to word list\nA2 [ U ] a weather condition in which very small drops of water come together to form a thick cloud close to the land or sea, making it difficult to see: thick fog Thick fog has made driving conditions dangerous.heavy fog Their flight was cancelled because of heavy fog.dense fog As the storm cleared, dense fog came down. Mist, fog, and snow are common in this area.fog lifts It took several hours for the fog to lift. Compare\nmist noun\nJoost Lagerweij/EyeEm/GettyImages\nMore examplesFewer examplesThe fog is expected to have cleared away by midday.We could see a dim shape in the fog.Freezing fog and icy patches are expected to cause problems for motorists tonight.Outside the fields were blanketed in fog.The fog swirled thickly around us.\nSMART Vocabulary: related words and phrases\nPrecipitation: clouds, dew, fog & steam\nbillow\nbrume\nchemtrail\ncirrus\ncloud-capped\ncloudily\ncloudlessly\nhaze\nhaze over\nlowering\nmisty\nmoisture\novercast\npall\nScotch mist\nsteam (something) up\nsteamily\nsub-visible\nvapour trail\nvog\nSee more results »\nfog noun\n(CONFUSION)\n[ S ] informal a confused or uncertain state, usually mentally or emotionally: in a fog of I went home in a fog of disbelief. The government's statement failed to lift the fog surrounding the strange announcement. the fog of war\na state of confusion or of being uncertain, caused by a war: The \"fog of war\" no doubt explains some of the conflicting accounts of what happened. Things don't always go according to plan in the fog of war.\nMore examplesFewer examplesYou sometimes have to make choices in a fog of uncertainty.It is a confusing subject for the consumer, so I shall try to clear the fog.In the fog of war, it is easy for the truth to become lost.\nSMART Vocabulary: related words and phrases\nConfusion, confusing and feeling confused\naddled\nall of a doodah idiom\nall over the place idiom\nalphabet soup\nat sea idiom\ndazedly\nDelphic\ndisarray\ndiscombobulation\ndisordered\nmuddily\nmuddle\nmuddle something up\nmuddle-headed\nmuddled\ntopsy-turvy\nturmoil\nunaccountable\nunaccountably\nunexplained\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWar\nto make something or someone confused or uncertain: Alcohol fogs the brain. The president's speech had simply fogged the issue. Synonyms\ncloud\nobscure\nSMART Vocabulary: related words and phrases\nPuzzle and confuse\naddle\nbaffle\nbedazzle\nbefuddle\nbemuse\ncloud\nconfuse\ndiscombobulate\ndisorientate\ndo someone's head in idiom\nflummox\nfox\npuzzle\nravel\nsearch\nthrow\nthrow (someone) a curve (ball)/curveball idiom\nthrow someone off balance idiom\ntie\ntie someone (up) in knots idiom\nSee more results »\nPhrasal verb\nfog up\nAdd to word list\nAdd to word list\na mass of cloud consisting of small drops of water near the surface of the earth: [ U ] Heavy fog made driving conditions dangerous. foggy adjective us\nYour browser doesn't support HTML5 audio\n/ˈfɔ·ɡi, ˈfɑɡ·i/\na cold, foggy day\nto cover or be covered with fog : The airport is fogged over. Phrasal verb\nfog up (something)"}