{"id":156148,"name":"folded","type":"verb","us_sound":"foʊld","us_link":"../audio/f/fold.mp3","uk_sound":"fəʊld","uk_link":"../audio/f/ukfob__020.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nfold\nfold verb\n(BEND)\nB1 [ I or T ] to bend something, especially paper or cloth, so that one part of it lies on the other part, or to be able to be bent in this way: I folded the letter (in half) and put it in an envelope. He had a neatly folded handkerchief in his jacket pocket. Will you help me to fold (up) the sheets? The table folds up when not in use.\n[ T ] literary to wrap: She folded her baby in a blanket. He folded his arms around her. fold your arms\nto bring your arms close to your chest and hold them together\n[ T ] to move a part of your body into a position where it is close to your body: She sat with her legs folded under her.\nMore examplesFewer examplesJust fold this piece of paper back, so, and make a crease here.With a sorrowful sigh she folded the letter and put it away.The back seat of the car folds down.The photographer asked me to fold my arms.Fold the top of the carton back, and tear along the dotted line.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nwrinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnclosing, surrounding and immersing\nfold verb\n(FAIL)\n[ I ] (of a business) to close because of failure: Many small businesses fold within the first year.\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfloat\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nPhrasal verb\nfold something in/fold something into something"}