{"id":156211,"name":"folk","type":"noun","us_sound":"foʊk","us_link":"../audio/f/folk.mp3","uk_sound":"fəʊk","uk_link":"../audio/f/ukfob__028.mp3","content":"folk noun\n(PEOPLE)\nAdd to word list\nAdd to word list\nB2 [ plural ] mainly UK (US usually folks) people, especially those of a particular group or type: old folk There are a lot of old folk living in this town.ordinary folk Ordinary folk can't afford cars like that. folks [ plural ]\n[ as form of address ] informal used when speaking informally to a group of people: All right, folks, dinner's ready!\nB2 someone's parents: I'm going home to see my folks.\nSee more\nMore examplesFewer examplesCan I get you folks some drinks?The folk around here are unhappy about the proposed motorway.The law is designed to protect folk like us.Can the folks at the back hear me?There are a lot of old folk in the village.\nSMART Vocabulary: related words and phrases\nPeople in general\nbeggar\nbird\nbod\nbody\ncoot\ncreature\ndevil\nfellow man/men\nlubber\nman\nmankind\nnumber\nparty\npeeps\nperson\nperson of interest\npersonhood\nrogue\nsod\nstiff\nSee more results »\nfolk noun\n(MUSIC)\nB1 [ U ] (also folk music) modern music and songs that are written in a style similar to that of traditional music: folk (music) I enjoy listening to folk (music).folk singer She achieved her greatest success as a folk singer.folk club She began singing in folk clubs around the country.folk festival The city hosts the largest free folk festival in the country.\nSMART Vocabulary: related words and phrases\nFolk & ethnic music\nbandura\nbluegrass\ncountry\ncountry and western\ncountry music\nfolk rock\nfolk song\nhornpipe\nmahonia\nraga\nsession\nskiffle\nskirl\nthroat singing\ntraditional to or typical of a particular group or country, especially one where people mainly live in the countryside, and usually passed on from parents to their children over a long period of time: folk culture\nB1 Folk art expresses something about the lives and feelings of ordinary people in a particular group or country, especially those living in the countryside: folk art folk dancing\nSMART Vocabulary: related words and phrases\nCustom, tradition & conformity\nAmericanization\nanti-classical\nanti-conventional\nanti-institutional\nanti-traditional\nconventionalized\nconventionally\ncounter-tradition\ncrowd\ncustom\nmulticultural\nmulticulturalism\nmulticulturally\nnon-classical\nnon-conservative\ntraditionally\nultra-conservatism\nultra-conservative\nultra-traditional\nunconventional\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrdinary people\nThe visual arts in general\nAdd to word list\nAdd to word list\ntraditional to or typical of the people of a particular group or country: folk art/dance"}