{"id":156282,"name":"follow","type":"verb","us_sound":"ˈfɑː.loʊ","us_link":"../audio/f/follow.mp3","uk_sound":"ˈfɒl.əʊ","uk_link":"../audio/f/ukfolks003.mp3","content":"follow verb\n(GO)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to move behind someone or something and go where he, she, or it goes: A dog followed us home. She followed me into the kitchen. He had the feeling he was being followed (= someone was going after him to catch him or see where he was going). I could feel them following me with their eyes (= watching my movements closely).follow the crowd Do your own thing, don't just follow the crowd (= do what everyone else does).\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\n[ T ] to go in the same direction as a road, path, etc.: Follow the road for two miles, then turn left. follow suit\nC2 to do the same thing as someone else: When one airline reduces its prices, the rest soon follow suit. If one company tries to gain the competitive edge with a new product, other companies tend to follow suit. One chain started offering vegan options and the others quickly followed suit. France led the way, hoping that other countries would swiftly follow suit. It's thought that other states may soon follow suit.\nMore examplesFewer examplesHe made no answer but walked on, gesturing for me to follow.If you lead in the jeep, we'll follow behind on the horses.The dogs are specially trained to follow the trail left by the fox.The path follows the river closely, occasionally deviating round a clump of trees.In the silence that followed, a lone voice piped up from the back of the room.\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nflight\nhound\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\nshadow\nstick\ntailgating\ntargetable\ntrack and trace\ntrail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOccurring and happening\nDirection of motion\nTravelling\nRepeating an action\nfollow verb\n(HAPPEN)\nB1 [ I or T ] to happen or come after something: We were not prepared for the events that followed (= happened next). The book was delivered yesterday with a note saying the bill for it would follow in a day or two. The meal consisted of spinach salad, followed by roast chicken (= with this as the next part).follow something (up) with something She published a book of poems and followed it (up) with (= next produced) a novel. as follows\nB2 said to introduce a list of things: The winners are as follows - Woods, Smith, and Cassidy.\nSee more\nMore examplesFewer examplesThe women's 200 metre event will be followed by the men's 100 metres.I'd like a steak and fries with chocolate mousse to follow.The initial earthquake was followed by a series of aftershocks.This announcement follows months of inaction and delay.The war was followed by a long period of peace and prosperity.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nfollow verb\n(OBEY)\nB1 [ T ] to obey or to act as ordered by someone: follow instructions Follow the instructions on the back of the packet carefully.follow someone's advice I decided to follow her advice and go to bed early.follow teachings Muslims follow the teachings of the Koran.\nThesaurus: synonyms, antonyms, and examples\nto obey someone or somethingobeyChildren must obey their parents.followAll religions guide youths to follow the teachings of elders and parents.complyThere are serious penalties for failure to comply with the regulations.observePeople must observe the law.adhere toThey failed to adhere to the terms of the agreement.abide byPlayers must abide by the referee's decision.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the law, rules, etc.according toIf we do not act according to the rules laid down for such cases, there will be chaos.in line withWhat she did was not always completely in line with the law.in accordance withThe council has not acted in accordance with its obligations.obeyIf they don't obey the rules, they will be asked to leave.followWe are obliged to follow the law in this matter.\nSee more results »\nMore examplesFewer examplesI always follow the instructions on medicine bottles faithfully.He follows the orders of his boss without question.He followed the famous American dictum, 'Don't get mad, get even'.I followed the instructions to the letter and it still went wrong.Baking a cake isn't difficult - it's just a matter of following the recipe.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\nshalt\nviolation\nSee more results »\nfollow verb\n(HAVE INTEREST IN)\nC1 [ T ] to have a great interest in something or watch something closely: He follows most sports avidly. They followed her academic progress closely.\nMore examplesFewer examplesWhich team do you follow?She followed the trial with interest.They were able to follow the day's events on their portable radio.Analysts have been following the events with interest.Have you been following recent political events?\nSMART Vocabulary: related words and phrases\nExcited, interested and enthusiastic\nabubble\naflutter\nagog\nall of a flutter idiom\namped\nentranced\nevangelical\nevangelistic\nevangelistically\nexcited\nfevered\ngo ahead\nmake (all) the right, correct, etc. noises idiom\nmood\nnuts\nomnivorous\nomnivorously\nzealously\nzestful\nzestfully\nSee more results »\nfollow verb\n(BE RESULT)\nC2 [ not continuous ] to happen as a result, or to be a likely result: [ + that ] Just because I agreed last time, it doesn't necessarily follow that I will again.\nMore examplesFewer examplesIf we posit that wage rises cause inflation, it follows that we should try to minimize them.How can they claim to reduce taxes and increase spending? It doesn't follow.Just because the last forecast was correct, it doesn't necessarily follow that the next one will be.Just because one of the suspects has been eliminated from their enquiries, it doesn't follow that the remaining suspect is guilty.Because ladybirds eat greenfly, it follows that a decrease in the numbers of ladybirds will lead to a rise in the population of greenfly.\nSMART Vocabulary: related words and phrases\nOccurring and happening\nafoot\nasynchronous\nasynchronously\nattend\nattendant\nbe at work idiom\neventuate\nfall into place idiom\nfollow on\ngo hand in hand with something idiom\ngo off\ngo on\ngone\npass\nresynchronize\nroll\nroll around\nshake out\nsucceed\nsupervene\nSee more results »\nfollow verb\n(UNDERSTAND)\nB1 [ I or T ] to understand something as it is being said or done: I'm sorry, I don't quite follow (you). His lecture was complicated and difficult to follow.\nThesaurus: synonyms, antonyms, and examples\nto understand somethingunderstandI understand why he did that.comprehendHe doesn't seem to comprehend the scale of the problem.get the pictureOK. Don't say any more. I get the picture.followIt was so complicated I couldn't follow what he was saying.graspI think I grasped the main points of the lecture.digestThis chapter is so difficult to digest. I'll have to read it again later.\nSee more results »\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nfollow verb\n(READ)\n[ T ] to read the notes or words of a piece of music or writing at the same time as they are being played or said\nSMART Vocabulary: related words and phrases\nWriting, reading & studying music\nanti-musical\nbar\ncanonical\ncomposition\ncompositional\nmusic-making\nmusically\nmusicologist\nmusicology\nnon-musical\nreorchestrate\nreorchestration\nrescore\nself-composed\nsheet music\ntone-deaf\ntranspose\ntransposition\nuncanonical\nunmusical\nSee more results »\nfollow verb\n(SOCIAL MEDIA)\n[ T ] If you follow a particular person on a social media website (= a website where people can publish their thoughts, photographs, information about themselves etc.), you choose to see everything that person posts (= publishes) on the website. Idioms\nfollow your nose\nfollow in someone's footstepsPhrasal verbs\nfollow on\nfollow (something) through\nfollow through\nfollow something up\nfollow verb\n(MOVE AFTER)\nAdd to word list\nAdd to word list\n[ I/T ] to move along after someone or something, or to move along a route or path: [ T ] The dog followed us home. [ I ] He drove ahead and we followed in our own car. [ T ] Follow this road for the next two miles.\n[ I/T ] To follow someone is also to move along after a person in order to watch where that person is going: [ T ] She had the feeling she was being followed.\nfollow verb\n(HAPPEN AFTER)\n[ I/T ] to happen after something else in order or time: [ I ] We were not prepared for what followed. [ T ] A reception will follow the meeting, so please stay.\nfollow verb\n(OBEY)\n[ T ] to obey someone, or to act according to something: Follow the instructions in taking the medicine. I decided to follow her advice. If you follow the signs, you will have no trouble finding the airport.\nfollow verb\n(UNDERSTAND)\n[ T ] to understand: He spoke so rapidly we could hardly follow what he said.\nfollow verb\n(INTERESTED IN)\n[ T ] to be actively interested in something, or to give your attention to something: Do you follow football? We’ve followed her political career for many years.\nfollow verb\n(BE RESULT)\n[ I ] to happen as a result, or to be a likely result: [ + that clause ] Fuel prices for transporting goods have increased, so it would follow that those prices are getting passed on to customers.\nIdioms\nfollow in someone’s footsteps\nfollow your nose\nfollow suitPhrasal verbs\nfollow through\nfollow something up\nAdd to word list\nAdd to word list\n[ I or T ] to happen or come after something: More mergers are likely to follow. October's increase followed a 1.6% rise in output in September. The bonds recovered after some initial selling following news of the proposed merger. Government macro-economic policy encouraged a consumer boom followed by a deep recession.\n[ T ] to obey instructions or to do something according to a plan or someone's advice: The shelves are easy to assemble if you follow the instructions carefully.follow orders/advice By following our advice, clients should save at least £770 a year.follow a policy/a procedure/guidelines At the enquiry into the crash, the airline said that normal procedure had been followed.\n[ T ] to watch something closely to see how it develops: He works for a group of Wall Street analysts who follow internet stocks closely.\n[ I or T ] to do the same thing as someone: They were the first to introduce online ordering, but other companies have been quick to follow.follow sb's example/lead When the company announces its price increases, many of its competitors are expected to follow its lead.\n[ I ] (also follow on) to be sent or paid at a later date: Your bank card will arrive first, and the PIN number will follow, in a separate envelope.\nas follows\nused to introduce a list of things: Our main aims are as follows: 1. efficiency 2. value for money 3. quality.\nfollow a career, occupation, trade, etc.\nto do a particular job: The company has an open door policy to mature entrants who have followed alternative career paths.\nfollow suit\nto do the same as someone else: We expect that fund managers will take a lead by coming out in favour of one of the banks, at which point undecided investors will follow suit. Phrasal verbs\nfollow through (on/with sth)\nfollow sth up\nfollow sth up with sth"}