{"id":156289,"name":"following","type":"preposition","us_sound":"ˈfɑː.loʊ.ɪŋ","us_link":"../audio/f/following.mp3","uk_sound":"ˈfɒl.əʊ.ɪŋ","uk_link":"../audio/f/ukfolks005.mp3","content":"Add to word list\nAdd to word list\nB2 after: The weeks following the riots were extremely tense. Following the dinner, there will be a dance.\nThesaurus: synonyms, antonyms, and examples\nafter somethingafterAfter the show we were invited back to the dressing room.followingThe years following the war were hard. subsequent toSubsequent to her appearance on TV she received many bookings.post-I’m doing post-doctoral research.nextWhat is the next step in your treatment?\nSee more results »\nMore examplesFewer examplesOil prices are certain to rise following the agreement to limit production.Major changes are expected in the England team following their 3-0 defeat last Saturday.The footballer is likely to receive a three-match suspension following an incident in yesterday's game.There have been calls for the drug to be withdrawn, following reports that it has dangerous side effects.The hospital said she was in a stable condition following the operation.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nB1 [ before noun ] The following day, morning, etc. is the next one.\nExamples\nThe following programme contains scenes that may be disturbing to some viewers.The full extent of the damage only became evident the following morning.Fair weather was forecast for the following day.They arranged to have dinner the following month.We arrive in Paris on the Sunday, and leave the following Wednesday.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nfollowing wind UK\na wind that is blowing in the same direction as the one in which you are going: Thanks to a following wind, we arrived in Madrid fifteen minutes early.\nSee more\nGrammar\nFollowing or the following?We use following without the + noun phrase to mean ‘after’, ‘in response to’ or ‘as a result of’: …\nfollowing noun [S]\n(NEXT)\nthe following\nB2 (often used to introduce a list, report, etc.) of what comes next: The following is an extract from her diary.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nfollowing noun [S]\n(PEOPLE)\na group of people who admire something or someone: attract a following She has attracted a large following among the rich and famous.loyal following The shop has a small but loyal following.devoted following She has built a devoted following for her country music.\na group of people who support, admire, or believe in a particular person, group, or idea\nSMART Vocabulary: related words and phrases\nAdmirers\nadmirer\nclaqueur\ndevotee\nfan\nfan club\nfan favourite\nfan service\nfanboy\nfandom\nfangirl\nfansite\nflatterer\nfollower\nfollowership\nparty faithful\nsecret admirer\nsimp\nstan\nsuperfan\nSee more results »\nGrammar\nFollowing or the following?We use following without the + noun phrase to mean ‘after’, ‘in response to’ or ‘as a result of’: …\nfollowing adjective [not gradable]\n(NEXT)\nAdd to word list\nAdd to word list\ncoming or happening after something else in order or time: I’m busy on Thursday, but I’m free the following day. The following items were found – a ring, a wallet, and a watch.\nfollowing noun\n(GROUP OF PEOPLE)\n[ C ] a group of people who support, admire, or believe in a particular person, group, or idea: The candidate has a large following among young people.\nfollowing noun\n(WHAT COMES NEXT)\n[ pl ] what comes next; the following one or ones in a list, report, etc.: Will the following please stand – Neal, Crisonino, Druback, Thompson.\nfollowing preposition\n(AFTER)\nafter: Following the ballgame, there will be a fireworks display."}