{"id":156309,"name":"fond","type":"adjective","us_sound":"fɑːnd","us_link":"../audio/f/fond.mp3","uk_sound":"fɒnd","uk_link":"../audio/f/ukfolks008.mp3","content":"fond adjective\n(LIKING)\nbe fond of someone/something\nAdd to word list\nAdd to word list\nB1 to like someone or something very much: \"I'm very fond of you, you know,\" he said.\nto like doing something; to do something often: My brother is fond of pointing out my mistakes.\nSee more\n[ before noun ] happy and loving: fond memory Many of us have fond memories of our childhoods.fond farewell We said a fond farewell to each other (= we said goodbye in a loving way) and promised to write.\nMore examplesFewer examplesI like to travel but, then again, I'm very fond of my home.Many people in Britain are fond of gardening .I didn't like him at first, but in the end I actually got quite fond of him.The children are not particularly fond of apples any more.I have fond memories of my college days.\nSMART Vocabulary: related words and phrases\nFeeling pleasure and happiness\n(as) pleased as Punch idiom\nASMR\nbe dancing in the streets idiom\nbe floating on air idiom\nbe full of the joys of spring idiom\nchipper\nchirpily\nchirpy\nchuffed\ncontented\nhappily\nhappy camper\nhappy place idiom\njaunty\njocund\nshining\nsunnily\nswooning\nswooningly\nswoony\nSee more results »\nfond adjective\n(FOOLISH)\na fond belief/hope UK\nsomething that you would like to be true but that is probably not: I waited at home all evening in the fond hope that he might call.\nSee more\nsmall pieces of brown food that are left in a pan after cooking, often used for making sauces: The fonds that have cooked with the meat are flavoured with wine to make a gravy. When a layer of brown fond has developed in the pan, deglaze it with some stock.\nMore examplesFewer examplesDarker fonds are usually richer and tastier.There are three main fonds in classic French cuisine.The chicken that sticks on the bottom of the pan becomes the fonds that you can use to make gravy.\nSMART Vocabulary: related words and phrases\nSauces, dressings, dips & pickles\naioli\naji\nAlfredo\napple sauce\narrowroot\nCumberland sauce\ncustard\ncustard powder\ndashi\ndeglaze\nmint sauce\nmirin\nmiso\nmolasses\nMornay\nsalsa\nsambal\nscalloped\nsecret sauce\nshoyu\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCookery terms\nAdd to word list\nAdd to word list\nhaving feelings of affection for someone or something, or having a liking for an activity: I’m really fond of my aunt and enjoy seeing her. She had fond memories of her childhood. Charles is fond of driving, so I’m happy just to be a passenger. fondly adverb us\nYour browser doesn't support HTML5 audio\n/ˈfɑnd·li/\nHe smiled fondly at his wife."}