{"id":156371,"name":"food","type":"noun","us_sound":"fuːd","us_link":"../audio/f/food.mp3","uk_sound":"fuːd","uk_link":"../audio/f/ukfolks015.mp3","content":"Add to word list\nAdd to word list\nA1 something that people and animals eat, or plants absorb, to keep them alive: baby food cat food plant foodfood and drink There was a lot of food and drink at the party. I'm allergic to certain foods.\nMore examplesFewer examplesAll the shops were closed, so we couldn't buy any food.The fridge keeps food at a constant temperature.We have only a small amount of food and clothing to deal out to each refugee.I'll bring some food along and we can have a picnic.Many snack foods are high in salt, sugar and fat.\nSMART Vocabulary: related words and phrases\nFood - general words\naliment\nbed\nbowl of something\nbox scheme\ncarb\ncarbohydrate\ndelicacy\nfarm box\nfast casual\nfast food\nfayre\nfoodstuff\ngrub\nmouthful\nnosh\nperishables\nportion\nproduce box\nquenelle\nsustenance\nSee more results »\nIdioms\nbe off your food\ngive someone food for thought\nAdd to word list\nAdd to word list\nsomething that can be taken in by an animal and used to keep it alive and allow it to grow or develop, or such things considered as a whole: [ U ] baby/cat food [ C ] There were a lot of frozen foods in the refrigerator.\nSometimes food means only the solid material eaten by animals, and not liquids: [ U ] He has had no food or drink for 24 hours. Idiom\nfood for thought\nAdd to word list\nAdd to word list\n[ U ] something that people eat to keep them alive: The country has become a huge importer of raw materials such as cotton, steel, and food products. The problem is that many small companies don't register their products as food additives, thus avoiding supervision. the food business/industry a food company/distributor/retailer food labelling/manufacturing/packaging\n[ C or U ] a particular type of food: Sales of organic food are growing rapidly. chilled/frozen/convenience foods baby/cat/dog food See also\nfast food\nspider food"}