{"id":156407,"name":"foolish","type":"adjective","us_sound":"ˈfuː.lɪʃ","us_link":"../audio/f/foolish.mp3","uk_sound":"ˈfuː.lɪʃ","uk_link":"../audio/f/ukfolks021.mp3","content":"Add to word list\nAdd to word list\nB2 unwise, stupid, or not showing good judgment: That was a rather foolish thing to do. She was afraid that she would look foolish if she refused. It was foolish of them to pay so much.\nThesaurus: synonyms, antonyms, and examples\nstupidstupidSome people are too stupid to realize what's bad for them.foolishShe was really foolish to quit her job like that.sillyIt was silly of you to go out in the sun without a hat.crazyYou'd be absolutely crazy to marry that man.dumbUS She was terrified of asking dumb questions.\nSee more results »\nMore examplesFewer examplesI felt very foolish standing there with only one shoe on.You were very foolish to go out in a boat in weather like this.It would be foolish to give up your job when you haven't got any other source of income.I was foolish to buy such an expensive piece of equipment without checking that we really needed it.He made a foolish bet with his brother and now he has to pay up.\nSMART Vocabulary: related words and phrases\nStupid and silly\nabsurd\nabsurdity\nabsurdly\nadolescent\nagainst your better judgment idiom\ndopily\ndorky\ndottiness\ndotty\ndozily\nin his/her/their wisdom idiom\ninadvisable\ninjudicious\ninjudiciously\ninsanely\nundiscriminating\nunintelligent\nunreasonable\nunreasonably\nunsmart\nSee more results »\nRelated words\nfoolishly\nfoolishness\nAdd to word list\nAdd to word list\nstupid or unwise: She was afraid that she would look foolish if she refused to go along with her friends. It would be foolish of us to assume that everything will work out fine. foolishly adverb us\nYour browser doesn't support HTML5 audio\n/ˈfu·lɪʃ·li/\nI would just like to know that my taxes are not being foolishly spent. foolishness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈfu·lɪʃ·nəs/\nMy father was not one to tolerate foolishness."}