{"id":156385,"name":"fool","type":"noun","us_sound":"fuːl","us_link":"../audio/f/fool.mp3","uk_sound":"fuːl","uk_link":"../audio/f/ukfolks018.mp3","content":"fool noun\n(PERSON)\nAdd to word list\nAdd to word list\nB1 [ C ] a person who behaves in a silly way without thinking: [ as form of address ] You fool, you missed your chance! He's a fool if he thinks she still loves him.like a fool He said he would pay me back and like a fool, I believed him.feel like a fool I felt like a fool when I dropped my phone in the toilet. [ + to infinitive ] He's a fool to think she still loves him. make a fool of someone\nB2 to trick someone or make someone appear stupid in some way: You made a fool of me in front of all those people!\nSee more make a fool of yourself\nB2 to do something that makes other people think you are silly or not to be respected: I got a little drunk and made a fool of myself.\nSee more any fool\nanyone: Any fool could tell that she was joking.\nSee more be no fool (also be nobody's fool)\nto not be stupid or easily deceived: I notice Ed didn't offer to pay for her - he's no fool.\nSee more more fool someone UK\nsaid to mean that you think someone is being unwise: \"I lent Rhoda £100 and she hasn't paid me back.\" \"More fool you - you know what she's like!\"\nSee more\nMore examplesFewer examplesThe man's a complete fool!Any fool can teach himself to type.You must think I'm a bloody fool.He's given me the keys to his car - the fool!I think it amuses him to see people make fools of themselves.\nSMART Vocabulary: related words and phrases\nStupid and silly people\nairhead\nberk\nbirdbrain\nblithering idiot\nblockhead\ndullard\ndumb-ass\ndummy\ndunce\ndunderhead\nmutt\nneed\nneed your head examined idiom\nnimrod\nnincompoop\nstupid\nthicko\ntosser\ntroglodyte\nturkey\nSee more results »\n[ C ] in the past, a person who was employed in the court of a king or queen to make the court laugh by telling jokes and doing funny things act/play the fool\nto behave in a silly way, often intentionally to make people laugh: Stop acting the fool, I'm trying to talk to you.\nSee more\nSMART Vocabulary: related words and phrases\nEntertainers in general\nacrobat\naerialist\nartiste\nbalancing act\nbullfighter\nclown\ndouble threat\ndrum majorette\nemcee\nfire-eater\njuggler\nmajorette\nperformer\nshowman\nstripper\ntriple threat\ntroubadour\ntwirler\nventriloquist\nwarm (someone/something) up\nSee more results »\nfool noun\n(SWEET DISH)\n[ C or U ] UK a sweet, soft food made of crushed fruit, cream, and sugar: gooseberry fool If you are serving gooseberry fool on its own, add a little extra sugar.\nDrool Ltd William Lingwood/GettyImages\nSMART Vocabulary: related words and phrases\nPuddings, desserts & ices\nbaked Alaska\nbaklava\nbanana split\nbananas Foster\nbanoffee pie\ncrumble\ncrème caramel\ndessert\ndulce de leche\ndumpling\nkugel\nlolly\nmochi\nmousseline\nNeapolitan ice cream\nsorbet\nsoufflé\nspotted dick\nspumoni\nsummer pudding\nSee more results »\nB2 [ I or T ] to trick someone: Don't be fooled by his appearance. She said she was doing it to help me, but I wasn't fooled.be fooled into Tim was fooled into believing that he'd won a lot of money.\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\nyou could have fooled me! informal\nused to tell someone that you do not believe what they have just said: \"Really, I'm very happy.\" \"You could have fooled me.\"\nSee more\nMore examplesFewer examplesDon't be fooled by his pleasant manner - he's pretty ruthless beneath that nice exterior.I'm not easily fooled.You can't fool me!She was fooled into handing over the money.He fooled a lot of people.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfiddle\nflannel\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\nhocus-pocus\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nput something across/over someone\nracket\nSee more results »\nPhrasal verbs\nfool around\nfool with something\nsilly: You've done some fool things in your time, but this beats everything.\nSMART Vocabulary: related words and phrases\nStupid and silly\nabsurd\nabsurdity\nabsurdly\nadolescent\nagainst your better judgment idiom\ndopily\ndorky\ndottiness\ndotty\ndozily\nin his/her/their wisdom idiom\ninadvisable\ninjudicious\ninjudiciously\ninsanely\nundiscriminating\nunintelligent\nunreasonable\nunreasonably\nunsmart\nSee more results »\nAdd to word list\nAdd to word list\na person who behaves in a silly way, or someone who lacks judgment: Crazy I may be, but I try not to be a fool. I know I’m making a fool of myself, but I can’t help it. They were dressed up like a bunch of fools.\nsilly or stupid: I made a damn fool mistake, but I’ll never do it again.\nto trick or deceive someone: [ T ] She tries to fool people about her age by wearing heavy makeup and coloring her hair. [ I ] You don’t owe me a penny, I was only fooling (= joking).\nPhrasal verbs\nfool around\nfool around\nfool with something"}