{"id":156424,"name":"foot","type":"noun","us_sound":"fʊt","us_link":"../audio/f/foot.mp3","uk_sound":"fʊt","uk_link":"../audio/f/ukfolks026.mp3","content":"foot noun\n(BODY PART)\nAdd to word list\nAdd to word list\nA1 [ C ] plural feet uk/fiːt/ us/fiːt/ the part of the body at the bottom of the leg on which a person or animal stands: I've got a blister on my left foot.on your feet I've been on my feet (= standing) all day and I'm exhausted.put your feet up informal You look tired. Why don't you put your feet up (= sit or lie down with your feet resting on something)? Please wipe your feet (= clean the bottom of your shoes) before you come into the house.\nPhotoAlto/Jana Hernette/Brand X Pictures/GettyImages get/rise to your feet\nC2 to stand up after you have been sitting: He rose to his feet when she walked in.\nSee more on foot\nA2 walking: Are you going by bicycle or on foot?\nSee more\nMore examplesFewer examplesHe tapped his foot to the beat of the music.It really hurt when Mark trod on my foot.My feet are so cold.She stood squarely, with her feet apart.I felt a sharp pain in my foot.\nSMART Vocabulary: related words and phrases\nThe legs & feet of non-human animals\nbipedal\nclawed\ncloven\nforefoot\nhooves\nleg\nlimb\nmember\npad\npaw\nsemipalmated\nshank\ntalon\ntoe\ntrotter\nweb\nweb-footed\nwebbed\nwebby\nzygodactyl\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe foot\nfoot noun\n(MEASUREMENT)\nB1 [ C ] plural feet uk/fiːt/ us/fiːt/ foot (written abbreviation ft) a unit of measurement, equal to twelve inches or 0.3048 metres, sometimes shown by the symbol ′: The man was standing only a few feet away. She is five feet/foot three inches tall. She is 5′ 3″ tall.\nMore examplesFewer examplesTwelve inches are equal to one foot.The plane climbed quickly to a height of 30,000 feet.The pond is six feet in diameter.The cliffs are eroding several feet a year.He's six feet tall.\nSMART Vocabulary: related words and phrases\nMeasurements of length & distance\nbreadth\ncm\ndecimetre\nfathom\nft\nin\nkilometre\nkm\nlinear\nmicron\nmile\nmm\nmpg\nnautical mile\nscalar\nsq.\nsquare\nthick\nwidth\nyard\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMathematical symbols\nfoot noun\n(BOTTOM)\nC1 [ S ] the bottom or lower end of a space or object: foot of They built a house at the foot of a cliff. She dreamed she saw someone standing at the foot of her bed. There's a note explaining the quotation at the foot of the page.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\ntip\nSee more results »\nfoot noun\n(POETRY)\n[ C ]\n&#160; literature\n&#160; specialized plural feet uk/fiːt/ us/fiːt/ a unit of division of a line of poetry containing one strong beat and one or two weaker ones\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nsuperheroine\nswashbuckler\nsympathetically\ntanka\ntartan noir\nSee more results »\nIdioms\nbe back on your feet\nland on your feet\nget your feet wet\nget a/your foot in the door\nget off on the right/wrong foot\nhave a foot in both camps\nhave feet of clay\nhave one foot in the grave\nhave/keep your feet on the ground\nmy foot\nMore idioms\nnot put a foot wrong\nput your foot down\nput your foot in it\nhardly/barely put one foot in front of the other\nrush/run someone off their feet\nset foot in somewhere\nunder your feet\nto pay an amount of money: foot the bill His parents footed the bill for his college tuition.foot the cost They refused to foot the cost of the wedding.foot someone's expenses The company will foot her expenses.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nfoot noun\n(BODY PART)\nAdd to word list\nAdd to word list\n[ C ] plural feet us/fit/ the part of the body at the bottom of the leg on which a person or animal stands: I’ve got a blister on my left foot. He got to/jumped to/rose to his feet (= stood up) to get a better look at the parade passing by. I’ve been on my feet (= standing) all day serving customers. The driver of the stolen car fled the scene on foot (= walking).\nfoot noun\n(MEASUREMENT)\n[ C ] plural foot or feet us/fit/ (abbreviation ft.); (symbol ') a unit of measurement of length equal to 12 inches or 0.3048 meters\nfoot noun\n(BOTTOM)\n[ U ] the bottom or end of a space or object: She dreamed she saw someone standing at the foot of her bed.\nIdiom\n(back) on your feet\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MEASURES\n&#160; plural feet | foot (written abbreviation ft) a unit of measurement equal to 12 inches or 0.3048 metres, sometimes shown by the symbol ′: His brief was to provide 10 million square feet of office space on a 16-acre site.\n[ S ] the bottom or lower end of something: the foot of sth Additional notes are added at the foot of the page.\nbe run/rushed off your feet\nto be extremely busy: Business was booming, and everyone in the office was rushed off their feet.\ndrag your feet\nto be very slow in doing sth, for example taking a decision: Reformers claim that the FSA is dragging its feet on banking reform.\nfall/land on your feet\nto be successful or lucky, especially after a period of not having success or luck: After the redundancies, about a fifth of the workers immediately landed on their feet, getting jobs at a local start-up company.\nget back on your feet (also get sb/sth back on their feet)\nto start experiencing an improved situation after a time of trouble or difficulty or to help a person, company, etc. to do this: There is enormous support for quick, low-interest loans to help companies get back on their feet after a disaster.\nget a/your foot in the door\nto enter a business or an organization at a low level, but with a chance of being more successful in the future: Graduate Careers Opportunities will help you get a foot in the door of your chosen career.\nget your feet wet\nto start doing something new: The company got its feet wet by taking a stand at the trader's exhibition.\nfoot the bill\nto pay the cost of something: Senior managers might be able to get employers to foot the bill for a weekend executive-MBA program."}