{"id":156428,"name":"football","type":"noun","us_sound":"ˈfʊt.bɑːl","us_link":"../audio/f/football.mp3","uk_sound":"ˈfʊt.bɔːl","uk_link":"../audio/f/ukfolks028.mp3","content":"Add to word list\nAdd to word list\nA1 [ U ] UK (also mainly US soccer) a game played between two teams of eleven people, where each team tries to win by kicking a ball into the other team's goal: a football player/team He's playing football.football match Are you coming to the football match? I'm not a big football fan.\nDan Porges/Photolibrary/GettyImages\n[ U ] US (UK American football) a game for two teams of eleven players in which an oval ball is moved along the field by running with it or throwing it: a football game\nskynesher/E+/GettyImages\nA1 [ C ] a large ball made of leather or plastic and filled with air, used in games of football\nDan Thornberg/EyeEm/GettyImages\n[ C ] US a large ball made of leather or plastic and filled with air, used in games of American football\ndigpro/E+/GettyImages\nMore examplesFewer examplesMy father took me to watch the football every Saturday.The national anthems of the teams are played at the beginning of a big international football match.He is arguably the world's best football player.After retiring as a football manager, he worked as a commentator.The crowd were chanting the name of their football team.\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmerican football\nAdd to word list\nAdd to word list\n(the oval ball used in) a game played by two teams in which each team tries to kick, run with, or throw the ball across the opposing team’s goal line to score points. American and Canadian football differ in the number of players, the size of the field, and some rules of play: [ C ] Mom bought me a football. [ U ] Let’s play football after lunch.\nFootball also means soccer in most of the world."}