{"id":156478,"name":"footing","type":"noun","us_sound":"ˈfʊt̬.ɪŋ","us_link":"../audio/f/eus75756.mp3","uk_sound":"ˈfʊt.ɪŋ","uk_link":"../audio/f/ukfootf004.mp3","content":"footing noun [S]\n(FEET)\nAdd to word list\nAdd to word list\nthe fact of standing firmly on a slope or other dangerous surface: lose your footing I lost my footing and fell.miss your footing Very near the top of the tree she missed her footing and slipped.keep your footing It was a struggle just to keep my footing.\nSMART Vocabulary: related words and phrases\nSitting and standing\nakimbo\nastride\nbestride\ncross-legged\ncrouch\nfoot\npew\nplump (someone/something) down\nrampant\nreseat\nscooch\nseat\nsit\nstand around\nstand aside\nstand round\nstand up\nstrike\nsurface\ntake a pew! idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMountaineering & rock climbing\nfooting noun [S]\n(SITUATION)\nthe way in which something operates and the set of conditions that influences it: New leadership is needed to return the company to a better financial footing. be on (an) equal, firm, etc. footing\nto be in an equal, safe, etc. situation: Men and women should be able to compete for jobs on an equal footing.\nSee more be on a war footing\nto be ready or preparing to fight a war: The country was on a war footing last night after the most devastating terrorist attack in history.\nSee more\nSMART Vocabulary: related words and phrases\nSituations and circumstances\naffair\nbackdrop\nbackground\nbusyness\ncase\ncircumstance\nclimate\ncomedy of errors\ncondition\nfinancial affairs\ngoing\nperfect storm\nposition\nscheme\nsituation\nsituational\nsituationally\nstake\nthe scheme of things idiom\nthing\nSee more results »\nfooting noun [S]\n(TRACK)\nthe condition of the surface of a racing track, sports field, path, etc. that makes it easy or difficult to run on: They will try to keep the field dry and ensure players have better footing. With beach running, the footing isn't solid like it is on a track, so it forces your leg muscles to work harder.\nMore examplesFewer examplesThe footing in the woods is softer than that on most running tracks.A track offers stable footing and an accurate measure of distance.As for footing, that obviously depends on the path you choose.The footing will be a bit more solid as one of the most prestigious indoor athletics events gets underway.\nSMART Vocabulary: related words and phrases\nSurfaces on which sports take place\n18-yard box\nastroturf\nbound\nbowling green\ncanvas\nclimbing wall\ncourt\ngoal line\nground staff\nhalf\nplayability\nplayable\nplaying field\npump track\nraceway\nrecreation center\nrink\nsideline\nsin bin\nupright\nSee more results »\nfooting noun [U]\n(FEET)\nAdd to word list\nAdd to word list\na firm position of the feet: He lost his footing and tumbled into the water.\nfooting noun [U]\n(CONDITION)\na position or condition on which something exists: Both sides need to begin negotiations on equal footing.\nAdd to word list\nAdd to word list\n[ S or U ] the way in which a business operates, and the set of conditions that influences it: on a firm/solid/sound footing Officials said they were moving quickly to correct any deficiencies and get the fund back on solid financial footing.on a commercial/legal/competitive footing Virtually all key state-owned enterprises have been placed on a commercial footing.\non an equal footing/on the same footing\nhaving the same position or status as another person, company, etc.: on an equal footing with sb/sth Women should be able to compete in the job market on an equal footing with men.on the same footing as sb/sth The increased use of restricted stock puts management on the same footing as shareholders.\n[ C, usually singular ] a first position that a company achieves in a particular market, industry, etc., that they hope to improve in the future: gain/get/find a footing (in sth) The company has struggled to find a footing in an industry suffering from overcapacity. See also\nbeachhead"}