{"id":156594,"name":"for","type":"preposition","us_sound":"fɔːr","us_link":"../audio/f/for.mp3","uk_sound":"fɔːr","uk_link":"../audio/f/ukfootf026.mp3","content":"for preposition\n(INTENDED FOR)\nAdd to word list\nAdd to word list\nA1 intended to be given to: There's a phone message for you. I'd better buy something for the new baby. There's a prize for the fastest three runners in each category.\nMore examplesFewer examplesWe're having a collection for Tom's retirement present.Your shoes will be repaired and ready for you to collect on Thursday.A young girl came up to me and asked for money.There's a letter for you on the table.There'll be a prize for the best entry.\nSMART Vocabulary: related words and phrases\nBelongings and possessions\naccoutrements\nasset\nbelongings\ncapital assets\nchattel\neffect\nestate\nin the name of something idiom\nlost property\nlost property office\nlost-and-found\nmaterially\npersonal property\npersonalty\npossession\nproperty\nresource\nstuff\nswag\nthing\nSee more results »\nfor preposition\n(PURPOSE)\nA2 having the purpose of: There's a sign there saying \"boats for hire\". This pool is for the use of hotel guests only. I'm sorry, the books are not for sale. They've invited us for dinner on Saturday. Everyone in the office is contributing money for his leaving present. I need some money for tonight. Which vitamins should you take for (= in order to cure) skin problems? Put those clothes in a pile for washing (= so that they can be washed).\nMore examplesFewer examplesI need some money for tonight.There are several plots of land for sale.We had some friends round for lunch yesterday.The polish is not for use on wooden surfaces.Don't take the game too seriously, it's just for fun.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nfor preposition\n(BECAUSE OF)\nA2 because of or as a result of something: I'm feeling all the better for my holiday. \"How are you?\" \"Fine, and all the better for seeing you!\" She did 15 years in prison for murder. I don't eat meat for various reasons. I couldn't see for the tears in my eyes. The things you do for love! He's widely disliked in the company for his arrogance. She couldn't talk for coughing (= she was coughing too much to talk). Scotland is famous for its spectacular countryside. He's best remembered for his novels. I didn't say anything for fear of (= because I was frightened of) offending him. if it wasn't/weren't for (also if it hadn't been for)\nwithout: If it wasn't for the life jacket, I would have drowned.\nSee more\nMore examplesFewer examplesThe pitcher is famous for the speed of his delivery.He decided to forsake politics for journalism.Coppola garnered several Oscar awards for 'The Godfather'.I think he's trying to get back at her for those remarks she made in the meeting.She was publicly acclaimed for her contribution to the discovery.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nfor preposition\n(TIME/DISTANCE)\nA1 used to show an amount of time or distance: We walked for miles. She's out of the office for a few days next week. I'm just going to lie down for an hour or so. I haven't played tennis for years.\nMore examplesFewer examplesWe get cut-rate electricity for six hours each night.Mr Black has been a client of this firm for many years.The network will be down for an hour for routine maintenance.I feel like I've been cooped up in this flat for days.It feels like we've been walking for miles.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\nfor preposition\n(OCCASION)\nA2 on the occasion of or at the time of: What did you buy him for Christmas? I'd like an appointment with the doctor for some time this week. We're having a party for Jim's 60th birthday. I've booked a table at the restaurant for nine o'clock.\nMore examplesFewer examplesThey planned a special celebration for her homecoming.They're making the most elaborate preparations for the wedding.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\ntime\ntime signature\nup\nzero hour\nSee more results »\nfor preposition\n(COMPARING)\nC1 used for comparing one thing with others of the same type: She's very mature for her age. For every two people in favour of the law there are three against. The winter has been unusually cold for Florida. It was a difficult decision, especially for a child. For a man of his wealth he's not exactly generous.\nMore examplesFewer examplesShe's rather immature for her age, don't you think?For every two people in favour of the law there are three against.For a man of his wealth he's not exactly generous.He plays very well for a beginner.Can I swap this t-shirt for another one?\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\nfor preposition\n(RESPONSIBILITY)\nC1 used to say whose responsibility something is: She knew the driver of the other car was not responsible for her son's death.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nfor preposition\n(SUPPORT)\nB2 in support of or in agreement with: I voted for the Greens at the last election. Those voting for the motion, 96, and those voting against, 54. Most of the Republicans voted for the measure. So let's hear some applause for these talented young performers. Who's for (= who wants to play) tennis? be all for something\nto approve of or support something very much: I've got nothing against change - I'm all for it.\nSee more\nMore examplesFewer examplesI'm all for making changes to the system.Are you for or against the new proposals?Who will you be voting for at the next election?Three cheers for the winner!Anyone for coffee?\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nfor preposition\n(HELP)\nB1 in order to help someone: Let me carry those bags for you. Hello, what can I do for you? My sister will take care of the dog for us while we're away.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsponsor\nstart (something) off\nSee more results »\nfor preposition\n(IN RELATION TO)\nin relation to someone or something: Her feelings for him had changed. He felt nothing but contempt for her. I've got a lot of admiration for people who do that sort of work. He's quite good-looking but he's too short for me. The ice-cream was a little bit sweet for me. That jacket looks a little big for you.as for Jackie's already left and, as for me, I'm going at the end of the month. Luckily for me (= I was lucky), I already had another job. How are you doing for money/time (= do you have enough money/time)? for all\nC2 despite: For all her qualifications, she's still useless at the job.\nSee more\nMore examplesFewer examplesThe children had a lot of respect for their teacher.Her feelings for him had changed.Police are still looking for clues in their search for the missing girl.He had a deep affection for his aunt.She was afraid for her children.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\nfor preposition\n(PAYMENT)\nA2 (getting) in exchange: How much did you pay for your glasses? I've sponsored her £1 for every mile that she runs. She sold the house for a lot of money. The mechanic said he'd repair my car for £300.\nMore examplesFewer examplesHow much did you pay for the tickets?I've got £20 000 worth of cover for the contents of my house.£4 for an orange juice? That's just daylight robbery!A collector would pay $500 for a mint copy.The company pays £220 a week for people to act as couriers.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nfor preposition\n(REPRESENTING)\nB1 being employed by or representing a company, country, etc.: She works for a charity. He swam for the United States in the 2000 Olympics.\nMore examplesFewer examplesHe plays for Manchester United.Many people in the town used to work for the steel company.She's been capped for Scotland nine times.I've been out canvassing for the Labour Party every evening this week.Do you still work for the government?\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nfor preposition\n(TOWARDS)\nA2 towards; in the direction of: They looked as if they were heading for the train station. Just follow signs for the museum. This time tomorrow we'll be setting off for the States. It says this train is for (= going to stop at) Birmingham and Coventry only.\nMore examplesFewer examplesFollow the signs for the train station.They were running for the bus.The roads were busy with people heading for the coast.The team was on course for victory.The alarm sent people scrambling for the exits.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nto\nup\nward\nway\nwise\nSee more results »\nfor preposition\n(MEANING)\nA2 showing meaning: What's the Spanish word for \"vegetarian\"?stand for What does the \"M.J.\" stand for? Maria José?\nMore examplesFewer examplesWhat's that symbol for?LCD stands for liquid crystal display.We had to learn chemical formulae at school, but I can only remember H2O for water.The green light is for go.Alpha is used for the letter A.\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbadge\nbe a badge of something idiom\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nsignificant\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nfor preposition\n(TO GET)\nA2 in order to get or achieve: I hate waiting for public transport. I had to run for the bus. Did you send off for details of the competition? I've applied for a job with another computer company.\nMore examplesFewer examplesHe wrote off for more information.The film was nominated for an Academy Award.I've applied for several jobs since leaving university.You have to get there early for the best seats.50 percent is needed for a pass.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nfor preposition\n(DUTY)\nthe duty or responsibility of: As to whether you should marry him - that's for you to decide. It's not for me to tell her what she should do with her life. \"How many people should I invite to the party?\" \"It's not really for me to say.\"\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nfor preposition\n(IN TROUBLE)\nfor it UK informal (mainly US in for it)\nin trouble: You'll be for it when she finds out!\nSee more Grammar\nForFor is usually a preposition and sometimes a conjunction. …\nFor: purposeWe use for to talk about a purpose or a reason for something: …\nFor someoneWe often use for to introduce the person or people receiving something: …\nFor: durationWe use for with a period of time to refer to duration (how long something lasts): …\nFor: exchangeWe use for to refer to an exchange: …\nFor meaning becauseWe sometimes use for as a conjunction meaning ‘because’. We use it in very formal, and often literary, contexts: …\nFor in multi-word verbsWe often combine for with a verb to form a multi-word verb: …\nFor + -ingWe use for + the -ing form of a verb to talk about the function of something or how something is used: …\nFor + -ing: functionWe use for + the -ing form of a verb to talk about the function of something or how something is used: …\nFor + -ing: reasonWe use for + the -ing form of a verb to refer to the reason for something: …\nFor + -ing or to + infinitive?We don’t use for + -ing to express our purpose or intention. We use to + infinitive: …\nDuring or for?We use during to say when something happens, if it happens in or over a period of time. We use for to talk about the length of time something lasts. …\nFor or since?We use for with a period of time in the past, present or future. …\nIdioms\nfor all someone cares/knows\nthat/there's ... for you\nwhat ... for?\nfor conjunction\n(BECAUSE)\nbecause; as: She remained silent, for her heart was heavy and her spirits low.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nGrammar\nForFor is usually a preposition and sometimes a conjunction. …\nFor: purposeWe use for to talk about a purpose or a reason for something: …\nFor someoneWe often use for to introduce the person or people receiving something: …\nFor: durationWe use for with a period of time to refer to duration (how long something lasts): …\nFor: exchangeWe use for to refer to an exchange: …\nFor meaning becauseWe sometimes use for as a conjunction meaning ‘because’. We use it in very formal, and often literary, contexts: …\nFor in multi-word verbsWe often combine for with a verb to form a multi-word verb: …\nfor preposition\n(TO BE GIVEN)\nAdd to word list\nAdd to word list\nintended to be given to: There’s a phone message for you on your desk. There will be a prize for the best costume at the party.\nfor preposition\n(PURPOSE)\nhaving the purpose of: What do you imagine he uses this old thing for? Why don’t you take an aspirin for your headache (= to stop it)?\nfor preposition\n(BECAUSE OF)\nbecause of; as a result of (doing something): She was stopped for speeding. The things we do for love! For some reason, she isn’t interested in going out at all tonight. Certain Chicago restaurants are famous for their deep-dish pizza.\nfor preposition\n(INSTEAD OF)\ninstead of; to help: Let me carry those groceries to the car for you.\nfor preposition\n(TIME/DISTANCE)\nshowing amount of time or distance: We drove for miles. She’s out of town for a few days on business.\nfor preposition\n(OCCASION)\non the occasion of or at the time of: What are you getting Mom and Dad for their anniversary? We’re planning a party for Stephen’s birthday. The neighbors invited us for dinner (= to eat with them). What’s for lunch (= what will we eat)?\nfor preposition\n(CONSIDERING)\nconsidering (something or someone with reference to things or people as they usually are): This winter has been mild for Canada. I think Kristy is very mature for her age.\nfor preposition\n(SUPPORT)\nin support of or agreement with: I voted for her in the last election. We thought about moving, and I was all for it, but my wife didn’t want to.\nfor preposition\n(IN RELATION TO)\nin relation to (someone or something): Her feelings for him were obvious. That jacket is a bit big for you.\nfor preposition\n(PAYMENT)\n(getting) in exchange: If I take the car in, it’ll be $45 for a tuneup.\nfor preposition\n(REPRESENTING)\nrepresenting (an organization or country): Michael works for a Washington-based foundation. She carried the flag for the US at the opening ceremonies.\nfor preposition\n(TOWARD)\ntoward; in the direction of: Just follow signs for the airport once you’re on the highway.\nfor preposition\n(MEANING)\nmeaning; representing: What’s another word for \"happy\"?\nfor preposition\n(TO GET)\nin order to get or have: I had to wait half an hour for the bus. Call the phone number below for more information.\nfor preposition\n(DUTY)\nthe duty or responsibility of: It’s not for her to say whether I should cut my hair. Idioms\nfor a price\nfor a song\nfor crying out loud\nfor dear life\nfor effect\nfor good\nfor goodness’ sake\nfor keeps\nfor old times’ sake\nfor one thing\nMore idioms\nfor real\nfor short\nfor starters\nfor sure\nfor the asking\nfor the better\nfor the heck of it\nfor the time being\nfor the worse\nfor what it’s worth\nnot (do something) for anything (in the world)\nfor conjunction\n(BECAUSE)\nbecause; as: She told the truth, for she had nothing to lose."}