{"id":156697,"name":"force","type":"noun","us_sound":"fɔːrs","us_link":"../audio/f/force.mp3","uk_sound":"fɔːs","uk_link":"../audio/f/ukforbe011.mp3","content":"force noun\n(PHYSICAL)\nAdd to word list\nAdd to word list\nB2 [ U ] physical, especially violent, strength, or power: The force of the wind had brought down a great many trees in the area. She slapped his face with unexpected force. Teachers aren't allowed to use force in the classroom.force of numbers The police were able to control the crowd by sheer force of numbers (= because there were more police than there were people in the crowd). in force\nin large numbers: Photographers were out in force at the White House today.\nSee more\n[ C or U ] specialized in scientific use, (a measure of) the influence that changes movement: the force of gravity join/combine forces\nC2 to work with someone else in order to achieve something that you both want: Britain and France were both working on developing a supersonic aircraft when they decided to join forces in 1962.\nSee more\nMore examplesFewer examplesIn the end she used brute force to push him out.The rocket has to work against the force of gravity.The police were out in force at the football match.The acceleration of a body equals the force exerted on it divided by its mass.The force of the waves was eroding the cliff face.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower and intensity\nforce noun\n(INFLUENCE)\nC2 [ C or U ] (a person or thing with a lot of) influence and energy: He was a powerful force in politics.the forces of nature Fishermen are always at the mercy of the forces of nature (= bad weather conditions). a force to be reckoned with\nC2 If an organization or a person is described as a force to be reckoned with, it means that they are powerful and have a lot of influence: The United Nations is now a force to be reckoned with.\nSee more a force of nature\na thing that has a strong natural power that cannot be controlled by humans, or the power itself: We are still learning how rivers cut through rock and about the forces of nature involved. Earthquakes, floods, and volcanic eruptions serve to remind us of the awful force of nature.\nsomeone who has a very strong personality, with a lot of energy: At the age of 87, she is still a force of nature. With 12 goals in 4 games, it seems that nothing can stop this elemental force of nature. force of habit\nIf you do something out of force of habit, you do it without thinking because you have done it so many times before: I just locked the door through force of habit, not thinking that Julia wouldn't be able to get in.\nSee more\nMore examplesFewer examplesAmbition can sometimes be a force for good.Since the government limited their powers, the unions are no longer a force to be reckoned with.In Britain and the USA in the 1970s, the underground was a powerful subversive force.The club used to be a significant force in European football.It seems as though forces of destruction are increasingly at work throughout society.\nSMART Vocabulary: related words and phrases\nPeople in charge of or controlling other people\nacephalous\nadministrator\nanti-management\nauthority\nbureaucrat\ncontroller\ncouncil\ncounter-power\ndean\ndeputy\nmanipulator\nmistress\nmovers and shakers\nmulti-headed\nofficer\ntsar\nvice presidency\nvice president\nvicegerency\nvicegerent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHaving a powerful effect\nEnergetic and lively\nStubborn and determined people\nforce noun\n(GROUP)\nB2 [ C ] a group of people organized and trained, especially for a particular purpose: the security forces the work forcepolice force He joined the police force right after graduating. the forces [ plural ] mainly UK\nthe military organizations for air, land, and sea: The forces are moving towards the country's capital.\nSee more\nMore examplesFewer examplesIn their efforts to reduce crime the government expanded the police force.Security forces halted the demonstrators by blocking the road.The reduction in armed forces will be phased over the next ten years.Government troops swept aside the rebel forces.60 percent of the work force voted for strike action.\nSMART Vocabulary: related words and phrases\nParts of armies & groups of servicemen\nbaggage train\nbattalion\nbomb disposal\nbomb squad\ncadre\ncavalry\nCoast Guardsman\ncorps\ndetachment\nGuards\nmilitia\nparatroops\npatrol\nsquad\nsquadron\ntask force\nthe Coast Guard\nthe Marine Corps\nthe tip of the spear idiom\nWRAC\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmergency services in general\nforce noun\n(IN OPERATION)\nin/into force\nC2 (of laws, rules, or systems) existing and being used: come into force New driving regulations are going to come into force this year.\nSee more\nforce noun\n(BASEBALL)\n[ C ] in baseball, an occasion when a player is put out when they have to run to the next base (= one of the four positions on a square that a player must reach to score a point) because another player on their team is running to the base where they are standing: There was a chance to get a force at second base.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nIdiom\nthe forces of evil\nforce verb [T]\n(GIVE NO CHOICE)\nB2 to make something happen or make someone do something difficult, unpleasant, or unusual, especially by threatening or not offering the possibility of choice: [ + to infinitive ] I really have to force myself to be nice to him. [ + to infinitive ] You can't force her to make a decision.be forced to Hospitals are being forced to close departments because of lack of money.force something back You could tell he was having to force back the tears (= stop himself from crying).force something on someone I didn't actually want any more dessert, but Julia forced it on me (= made me accept it). I couldn't stay at their flat - I'd feel as if I was forcing myself on them (= making them allow me to stay).force something out of someone You never tell me how you're feeling - I have to force it out of you (= make you tell me)!\nbiology, food &amp; drink\n&#160; specialized If plants or vegetables are forced, they are made to grow faster by artificially controlling growing conditions such as the amount of heat and light: forced strawberries force a laugh/smile\nto manage, with difficulty, to laugh or smile: I managed to force a smile as they were leaving.\nSee more force an/the issue\nto take action to make certain that an urgent problem or matter is dealt with now: If the management wouldn't listen to their demands, they would have to force the issue by striking.\nSee more\nMore examplesFewer examplesThe new tax would force companies to adopt energy-saving measures.Hospitals are being forced to close departments because of lack of money.The recession is forcing the company to rationalize.Doctors are being forced to work impossibly long hours.It's only a matter of time before he's forced to resign.\nSMART Vocabulary: related words and phrases\nCausing somebody to act\narm-twisting\nbludgeon\nbounce someone into something\nbulldoze\nbully\ncoercion\nforcible\nforcibly\nhold someone to ransom idiom\nimpel\nimpose\nput/tighten the screws on someone idiom\nram something down someone's throat idiom\nram something into someone\nransom\nreduce\nreduce someone to something\nslap\nsqueeze\nwring\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nforce verb [T]\n(USE PHYSICAL POWER)\nC2 to use physical strength or effort to make something move or open: Move your leg up gently when you're doing this exercise, but don't force it. If you force the zip, it'll break. She forced her way through the crowd.\nto break a lock, door, window, etc. in order to allow someone to get in: I forgot my key, so I had to force a window. [ + adj ] The police had forced open the door because nobody had answered.force an entry The burglar forced an entry (= broke a window, door, etc. to get into the house).\nMore examplesFewer examplesThe crowd managed to force its way in by sheer weight of numbers.The thieves forced one of the shop windows open with a crowbar.Helmeted, baton-wielding police forced back the crowd.Pieces of stone can be split off by forcing wedges between the layers.The water pressure forces the piston into the chamber.\nSMART Vocabulary: related words and phrases\nPushing and shoving\nbat\nbat something/someone away\nbring\nbring someone down\nbundle\ncounter-thrust\ndig\nelbow\ngoad\npoke\npoke/dig someone in the ribs idiom\nprod\npropel\npush off\nrib\nshoulder\nthrust\nupend\nupset\nwrangle\nSee more results »\nIdiom\nforce someone's hand\nforce noun\n(PHYSICAL POWER)\nAdd to word list\nAdd to word list\n[ C/U ] physical, often violent, strength or power: [ U ] The force of the wind knocked down many trees during the hurricane. [ U ] She had to use force to get the old window open.\n[ C/U ]\n&#160; physics A force is a power that causes an object to move or that changes movement.\nforce noun\n(INFLUENCE)\n[ C/U ] strong influence and energy, or a person with strong influence and energy: [ U ] The sheer force of her words kept the audience glued to their seats. [ C ] He was a powerful force in national politics for 30 years.\nforce noun\n(POWER TO CONTROL)\n[ C/U ] power to make someone do something, or to make something happen, esp. without offering the possibility of choice: social forces at school\nforce noun\n(MILITARY)\n[ C ] an organized and trained military group: the armed forces the Air Force UN forces continue to provide relief in the war-torn region.\n[ C ] Force is also military strength.\nforce noun\n(GROUP)\n[ C ] a group of people who do the same job: a sales force the police force\n[ C ] If a person or group joins or combines forces with another person or group, they agree to work together. Idioms\na force to be reckoned with\nby force of habit\nin force\nforce verb [T]\n(USE PHYSICAL POWER)\nto use physical strength or effort to make something move or open: If the piece won’t fit in the hole, don’t force it. He forced his way through the crowd to reach the exit.\nTo force a lock, door, window, etc., is to break it in order to get in: I forgot my house key, so I had to force a window.\nforce verb [T]\n(MAKE DO UNWILLINGLY)\nto make someone do something, or make something happen, esp. by threatening or not offering the possibility of choice: I hate string beans, so I had to force myself to eat them. [ + to infinitive ] Anderson was forced to leave the game with a bruised knee. I didn’t actually want any more dessert, but Julia forced it on me. If callers have information about the crime and would like to give their names that is fine, but we’re not going to force the issue (= make them give their names).\nAdd to word list\nAdd to word list\n[ C, usually singular ] a person or thing with a lot of influence, power, or energy: a dominant/major/powerful force The takeover will create a powerful new force in Britain's food retail industry.commercial/competitive/economic forces Potent commercial forces are bringing the hydrogen economy along faster than anyone thought possible.a force for change/good The movement of work to developing economies must be a force for good.\n[ C ] a group of people organized and trained for a particular purpose: The company soon had a sales force distributed across Europe.\n[ U ] the influence or authority of something: They made sure the minister felt the full force of business resentment at the government's new workplace laws. It was not until the summer that the advertising campaign gained force. These building codes do not have the force of law. See also\ndriving force\nlabour force\nmarket forces\nsales force\ntask force\nworkforce\nin force\nif laws, rules, or systems are in force, they are being used: The notice lists the import duties and taxes currently in force.\na force to be reckoned with\na powerful person or organization with a lot of influence: The company is fast becoming a force to be reckoned with on the global telecom scene.\ncombine/join forces\nto work with someone in order to achieve something you both want: The two companies, one Dutch the other French, have just joined forces to exploit the European market for petfood.\ncome into/enter into force\nwhen laws, rules, or systems come into force, they start being used: The final stage of measures to improve access to work for disabled employees comes into force tomorrow.\nto make a person or an organization do something that they do not want to do: force sb/sth to do sth The arrival of the new supermarket has forced local businesses to raise their wages to compete.force sb/sth into sth Heavy law school debt frequently forces graduates into high-paying jobs at private firms, where intense deadlines and grinding hours are routine.force sb/sth into doing sth Customers are being forced into banking by phone or over the internet.\nto make something happen, especially something that people do not want to happen: The economic slowdown has forced a second week of temporary closure. The government threatened to force an agreement between banks and retailers for a new system.\nforce sb's hand\nto make someone do something they do not want to do or do something sooner than they had intended: The changing dynamics of the diamond business are beginning to force the company's hand. Phrasal verbs\nforce sth down\nforce sth up\nforce sb out\nforce sth out (of sth)"}