{"id":156726,"name":"forcibly","type":"adverb","us_sound":"ˈfɔːr.sə.bli","us_link":"../audio/f/forcibly.mp3","uk_sound":"ˈfɔː.sə.bli","uk_link":"../audio/f/ukforbe018.mp3","content":"forcibly adverb\n(BY FORCE)\nAdd to word list\nAdd to word list\nin a way that uses physical power or violence: Several rioters were forcibly removed from the town square. They have plans to seize the island forcibly before its military can develop further.\nin a way that happens or is done against someone's wishes, especially with the use of physical force: No one is likely to be forcibly vaccinated against their will. She was soon to be forcibly married.\nMore examplesFewer examplesI wouldn't accept having the army and police descending on farms to forcibly evict owners.He forcibly tried to keep her from leaving the room.Police forcibly entered the home and did not knock or inform the residents.Their parents are of the generation that was forcibly sent away to boarding schools.He was forcibly retired in 1994, when the company was bought out.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noutrage\nproactive aggression\npugnacious\npugnaciously\npugnacity\nuntameable\nvicious\nviciously\nviciousness\nviolence\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing somebody to act\nforcibly adverb\n(POWERFULLY)\nin a way that has a strong effect: They will all argue forcibly that poor people need more money. There is one thing that has struck me forcibly since I came to Ireland. See\nforcible\nMore examplesFewer examplesGina was forcibly reminded of their first meeting.The subject has been brought forcibly to my mind.\nSMART Vocabulary: related words and phrases\nHaving a powerful effect\nblazing\ncompelling\ncompellingly\ndevastating\ndevastatingly\nelementally\nfullness\nhyperintense\nimpactful\nlife-altering\nlife-changing\npenetratingly\npungent\nscalding\ntake (something) over\ntenaciously\nunconquerable\nunfailing\nunfailingly\nvivid\nSee more results »\nAdd to word list\nAdd to word list\nwith physical power or violence: The Ponca Indians were forcibly removed from their lands in 1877."}