{"id":157016,"name":"foreign","type":"adjective","us_sound":"ˈfɔːr.ən","us_link":"../audio/f/foreign.mp3","uk_sound":"ˈfɒr.ən","uk_link":"../audio/f/ukforef013.mp3","content":"Add to word list\nAdd to word list\nA2 belonging or connected to a country that is not your own: Spain was the first foreign country she had visited. foreign languages His work provided him with the opportunity for a lot of foreign travel. foreign to formal\nC2 Something can be described as foreign to a particular person if they do not know about it or it is not within their experience: The whole concept of democracy, she claimed, was utterly foreign to the present government.\nSee more\nA foreign object or substance has entered something else, possibly by accident, and does not belong there: a foreign object/substance foreign matter\nMore examplesFewer examplesAs a leader, he's been criticized for his inexperience in foreign affairs.He is trying to persuade local and foreign businesses to invest in the project.The government wanted an inflow of foreign investment.The foreign invaders were finally defeated by allied forces.My grandfather has a profound mistrust of anything new or foreign.\nSMART Vocabulary: related words and phrases\nUnknown and unfamiliar\nalien\nalienly\nalienness\nanti-foreign\nanti-foreigner\nnot be in someone's vocabulary idiom\nobscure\nobscurely\nobscurity\npig\nshadowy\nterra incognita\nthe outside world idiom\nuncharted\nunchartered\nuncommon\nundefined\nunsung\nuntried\nunused\nSee more results »\nAdd to word list\nAdd to word list\nbelonging or connected to a country that is not your own or is not the one you are in: a foreign country a foreign language\nAdd to word list\nAdd to word list\nin or from a country that is not your own: a foreign brand/company/firm The company represents some foreign brands as their agents or distributors.foreign capital/debt/investment The country needs to attract foreign investment into manufacturing. foreign competition/markets/trade"}