{"id":157417,"name":"forever","type":"adverb","us_sound":"fɔːˈrev.ɚ","us_link":"../audio/f/forever.mp3","uk_sound":"fəˈre.vər","uk_link":"../audio/f/ukfores013.mp3","content":"Add to word list\nAdd to word list\nB1 for all time: I like the house but I don't imagine I'll live there forever.\nThesaurus: synonyms, antonyms, and examples\nevery timealwaysHe always leaves the lights on.constantlyHe's constantly losing his keys.continuallyShe is continually late to class.for everI am for ever misplacing my bag!time after timeTime after time he comes back and pretends like nothing has happened.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nfor a very long timealwaysThe power plant is always running. for everI will love you for ever.permanentlyHis reputation was permanently ruined by the scandal.eternallyEvildoers shall be eternally condemned.uninterruptedlyStocks have risen uninterruptedly for the last three months.\nSee more results »\nB2 for an extremely long time or too much time: take forever We'd better walk a bit quicker - it's going to take forever if we go at this pace.\nvery often: She's forever telling him she's going to leave him but she never actually does.\nMore examplesFewer examplesEach transaction at the foreign exchange counter seems to take forever.I know she's gone forever, but I just can't put her out of my mind.That look of pure grief would be imprinted on her mind forever.The awful sound of the crash will be stamped on her memory forever.The city has a timeless quality as if it had existed forever.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nimmanence\nimmanent\nimmanently\nimperishable\nimperishably\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\npermanence\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinually & repeatedly\nGrammar\nAlways: meaningAlways can mean ‘on every occasion’, ‘forever’ or ‘very frequently’. In these meanings we use it with simple tense forms: …\nAlways with continuous verb formsWe can use always with continuous verb forms to refer to regular events or states, especially ones which are problematic or which we do not like or want: …\nAlways: positionWe most commonly use always in mid position, between the subject and main verb, after the modal verb or first auxiliary verb, or after main verb be: …\nAlways with can and couldWe often use always with can and could to talk about possible solutions to problems: …\nAs alwaysWe use as always to talk about one event which is seen as typical: …\nAlways, for good or for ever?When we talk about things which will be permanent, we normally use for good, or, more formally, for ever (sometimes written as forever). We do not normally say for always: …\nIdiom\nforever and a day\nexisting or happening for all time in the future: forever home Today, more than 500,000 US children wait in foster care for a forever home.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nimmanence\nimmanent\nimmanently\nimperishable\nimperishably\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\npermanence\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\nAdd to word list\nAdd to word list\nfor all time, without end: Nobody lives forever.\nForever can also mean always or frequently: She was forever late for appointments. He was forever saying that he’d pay me back, but he never did."}