{"id":156834,"name":"forecast","type":"noun","us_sound":"ˈfɔːr.kæst","us_link":"../audio/f/eus71870.mp3","uk_sound":"ˈfɔː.kɑːst","uk_link":"../audio/f/ukforbe024.mp3","content":"Add to word list\nAdd to word list\nB1 a statement of what is judged likely to happen in the future, especially in connection with a particular situation, or the expected weather conditions: economic forecast There will be some good news in today's economic forecast.weather forecast The weather forecast said it was going to rain later today. Synonym\nprognosis\nMore examplesFewer examplesThe forecast said it was going to be hot and sunny tomorrow.The forecast said that there's a possibility of snow tonight.Experts have given a gloomy economic forecast.The sales forecast is predicated on the assumption that the economy will grow by four percent this year.I think these sales forecasts are unrealistic, considering how slow sales are at present.\nSMART Vocabulary: related words and phrases\nPredicting things and intuition\naugur\naugury\nbellwether\nbetcha\nbode\nhunch\ninkling\ninstinct\nintuit\nintuition\npremonitory\npresage\nprescience\nprescient\npresciently\nthe writing is on the wall idiom\nthere's no knowing/telling/saying idiom\nunforeseeable\nunintuitively\nunreasoning\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeather & climate - general words\nto say what you expect to happen in the future: They forecast a large drop in unemployment over the next two years.be forecast for Snow has been forecast for tonight. [ + to infinitive ] Oil prices are forecast to increase by less than two percent this year. Synonyms\nportend formal\npresage formal\nSMART Vocabulary: related words and phrases\nPredicting things and intuition\naugur\naugury\nbellwether\nbetcha\nbode\nhunch\ninkling\ninstinct\nintuit\nintuition\npremonitory\npresage\nprescience\nprescient\npresciently\nthe writing is on the wall idiom\nthere's no knowing/telling/saying idiom\nunforeseeable\nunintuitively\nunreasoning\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeather & climate - general words\nAdd to word list\nAdd to word list\na statement of what is likely to happen in the future: The forecast is heavy rain for tomorrow. forecast verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔr·kæst, ˈfoʊr-/ past tense and past participle forecast or forecasted\nThe government is forecasting that unemployment will continue to fall. forecaster noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔrˌkæs·tər, ˈfoʊr-/\na weather forecaster\nAdd to word list\nAdd to word list\na statement of what is judged likely to happen in the future, based on information you have now: give/make/provide a forecast on sth He refused to give a forecast on when 365 is likely to make money for shareholders.cut/downgrade/reduce a forecast The CBI also cut its growth forecast for the economy next year from 2.7% to 2.4%.meet a forecast The company hopes to meet its forecast of 4% growth this year.a budget/deficit/profit/revenue forecast As for housing and jobs, the budget forecast predicts little improvement any time soon. The Treasury's summer economic forecast warned of a rise in underlying inflation by the end of the year. a bleak/gloomy forecast See also\ncash flow forecast\nfinancial forecast\nmarket forecast\nto judge what is likely to happen in the future, based on information you have now: forecast a drop/growth/rise in sth The company still forecasts a 2% growth in house prices next year.forecast profits/revenue/sales Analysts forecast profits of €8.8m this year.be forecast to be sth Operating profits are forecast to be below previous expectations at $3m.forecast that The Chancellor is forecasting that inflation will remain on target at 2.5% in each of the next three years."}