{"id":156858,"name":"foreclose","type":"verb","us_sound":"fɔːrˈkloʊz","us_link":"../audio/f/eus71871.mp3","uk_sound":"fɔːˈkləʊz","uk_link":"../audio/f/ukforbe027.mp3","content":"foreclose verb\n(TAKE POSSESSION)\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; finance &amp; economics, law\n&#160; specialized (especially of banks) to take back property that was bought with borrowed money because the money was not being paid back as formally agreed: foreclose on The bank is threatening to foreclose on the family's house.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbad debt\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nhole\nliquidate\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\nforeclose verb\n(PREVENT)\n[ T ] formal to prevent something from being considered as a possibility in the future: The leader's aggressive stance seems to have foreclosed any chance of diplomatic compromise.\nSMART Vocabulary: related words and phrases\nRefusing & rejecting\nabjuration\nabnegate\nabnegation\nbar\nbat something/someone away\nbrush\ndemur\njettison\nmiss a chance/opportunity idiom\nopt out\npass something up\npunt on something\nquit\nquit on someone\nreact\nrebuff\nresistant\nspurn\nturn your nose up idiom\nwild horses wouldn't drag me idiom\nSee more results »\nRelated word\nforeclosure\nAdd to word list\nAdd to word list\n(esp. of banks) to take control of the property of owners because they did not pay back the bank’s money borrowed to pay for it\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; FINANCE, PROPERTY if a company, especially a bank, forecloses, it takes back property that was bought with borrowed money because the money was not being paid back as agreed: Without written proof of defaults on payments, the bank has no right to foreclose.foreclose on a home/loan/property The building society will foreclose on a loan if the payment is four to five months late.\n[ T ] to prevent something from being considered as a possibility in the future: foreclose competition/a market/options There was evidence of suspected market sharing agreements aimed at foreclosing competition and preventing access to the market.be foreclosed from (doing) sth EC operators are foreclosed from bidding in Massachusetts on non-trade grounds."}