{"id":157466,"name":"forfeit","type":"verb","us_sound":"ˈfɔːr.fɪt","us_link":"../audio/f/forfeit.mp3","uk_sound":"ˈfɔː.fɪt","uk_link":"../audio/f/ukfores017.mp3","content":"forfeit verb\n(LOSE)\nAdd to word list\nAdd to word list\n[ T ] to lose the right to do or have something because you have broken a rule: If you cancel now, you forfeit your deposit. These people have forfeited the right to live in society. Synonym\nforgoCompare\nwaive\nSMART Vocabulary: related words and phrases\nStop having or doing something\nabdicate\nabdication\nbail out\nbandh\nbomb out\nbreak with something\nforfeitable\nforgo\nforsake\nforswear\nghost\ngive up\ngive up the ghost idiom\nlay\nself-denying\nself-denyingly\nself-sacrifice\nself-sacrificing\nself-sacrificingly\nthrow\nSee more results »\nforfeit verb\n(NOT PLAY)\n[ T or I ] to decide not to play a sports game or part of a game, or to let the other side win: England's players forfeited the match because of safety concerns. She developed her skill by wrestling boys, though some forfeited rather than face losing to a girl.\nMore examplesFewer examplesWhen she refused to calm down, the umpire ordered the game forfeited in favour of her opponent.If you don't have enough players, you'll have to forfeit or postpone the match.Both sides forfeited an innings in order to try and get a result.\nSMART Vocabulary: related words and phrases\nStop having or doing something\nabdicate\nabdication\nbail out\nbandh\nbomb out\nbreak with something\nforfeitable\nforgo\nforsake\nforswear\nghost\ngive up\ngive up the ghost idiom\nlay\nself-denying\nself-denyingly\nself-sacrifice\nself-sacrificing\nself-sacrificingly\nthrow\nSee more results »\n[ C ] something that you have lost the right to do or have because you have broken a rule: The team might have avoided the forfeits if it had handled the situation differently.\n[ U ] the action of losing the right to do or have something because you have broken a rule: by forfeit The home team could end up winning by forfeit. pay a forfeit mainly UK\nto give up something, especially in a game: If you lose, you'll have to pay a forfeit. What will you give up?\nSee more\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nget to\ngo walkabout idiom\nkiss\nlose\nloss\nmislay\nmisplace\nmisroute\nmiss\nproximately\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nwave/say goodbye to something idiom\nSee more results »\ntaken away from someone as a punishment\nSMART Vocabulary: related words and phrases\nStop having or doing something\nabdicate\nabdication\nbail out\nbandh\nbomb out\nbreak with something\nforfeitable\nforgo\nforsake\nforswear\nghost\ngive up\ngive up the ghost idiom\nlay\nself-denying\nself-denyingly\nself-sacrifice\nself-sacrificing\nself-sacrificingly\nthrow\nSee more results »\nAdd to word list\nAdd to word list\nto give up or lose something because you cannot do something that the rules or the law says you must do: She had to forfeit the tennis match after she fell and hurt her wrist. forfeit noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔr·fət, -fɪt/\n[ C ] Throwing objects on the field, the umpire said, would result in the forfeit of the game by the home team.\nAdd to word list\nAdd to word list\nLAW to lose the right to have or do something because you have not obeyed a rule or law: Over several years, the district forfeited $51 million by failing to spend the money within the deadlines set by the government.forfeit a claim/right (to sth/to do sth) She forfeited her right to benefits because she did not notify the authorities of her change in circumstances.forfeit sth to sb/sth Illegally shipped cigarettes will be seized and forfeited to the state.\nto agree to give away the right to have or do something: A culture of long hours and time forfeited in favour of money is now becoming routine.\nsomething that you lose the right to have or do because you have failed to obey a rule or law: Schools and their employees found in violation of the policy are subject to penalties, including fines or forfeits."}