{"id":157499,"name":"forge","type":"verb","us_sound":"fɔːrdʒ","us_link":"../audio/f/forge.mp3","uk_sound":"fɔːdʒ","uk_link":"../audio/f/ukfores020.mp3","content":"forge verb\n(COPY)\nAdd to word list\nAdd to word list\n[ T ] to make an illegal copy of something in order to deceive: a forged passport a forged signature A number of forged works of art have been sold as genuine.\nSMART Vocabulary: related words and phrases\nForgery\nanti-counterfeiting\nanti-piracy\nbootleg\ncounterfeit\nfake\nfaker\nforgery\nhijack\nhijacking\nknock off (something)\npiracy\npirate\npirated\nplagiarism\nplagiarize\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nforge verb\n(CREATE)\n[ T ] to make or produce something, especially with some difficulty: forge a bond The accident forged a close bond between the two families. She forged a new career for herself as a singer.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerativity\ngrind something out\nhandmade\nknock\nknock off (something)\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nforge verb\n(MOVE)\n[ I + adv/prep ] formal to suddenly and quickly move forward: forge ahead Just 100 metres from the finishing line Jackson forged ahead. She forged through the snow.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscud\nshoot\nstampede\nton\ntrot\nSee more results »\nforge verb\n(MAKE IN FIRE)\n[ T ] to make things out of metal by heating it until it is soft and then bending and hitting it with a hammer to create the right shape: He taught them to forge iron swords and spears. A spade with a forged blade is best.\nMore examplesFewer examplesThe smiths had forged a metal climbing axe for him.The statue is made out of nuts, bolts, and forged steel.\nPhrasal verb\nforge ahead\na working area with a fire for heating metal until it is soft enough to be beaten into different shapes: a blacksmith's forge Compare\nsmithy\nSMART Vocabulary: related words and phrases\nFactories\nassembly line\nbrewery\ncannery\nchemical park\nconveyor belt\nmill\nmiller\nmint\nmulti-plant\non the factory floor idiom\npacking house\npallet\npower station\nrolling mill\nslaughterhouse\nsmithy\nsolar plant\nsteel mill\nsweatshop\ntannery\nSee more results »\nforge verb\n(COPY ILLEGALLY)\nAdd to word list\nAdd to word list\n[ T ] to make an illegal copy of something in order to deceive: He was accused of forging his father’s signature on the check.\nforge verb\n(MAKE)\n[ T ] to make or produce, esp. with difficulty: Baker had worked for months to forge a peace plan that both sides could accept.\nforge verb\n(MOVE)\n[ I always + adv/prep ] to move forward in a determined way although progress is difficult: She forged ahead with her plans to stage a protest in Washington.\nforge noun [C]\n(WORK AREA)\na working area with a fire for heating metal until it is soft enough to be beaten into different shapes: a blacksmith’s forge\nAdd to word list\nAdd to word list\nLAW to illegally copy something in order to deceive someone: forge a contract/document/signature Tax fraud involving forging documents and making false statements is a criminal offence. He admitted he had forged the signature of the lawyer on the check. Compare\ncounterfeit\nto make an effort to develop a successful relationship with a person, organization, or country: forge a relationship/a bond/an alliance The company is forging partnerships with a number of local companies.\nto make an agreement with a person, organization, or country: forge an agreement/a compromise/a consensus Lawmakers are debating how to finally forge a compromise.\nPhrasal verb\nforge ahead"}