{"id":157536,"name":"forgive","type":"verb","us_sound":"fɚˈɡɪv","us_link":"../audio/f/forgive.mp3","uk_sound":"fəˈɡɪv","uk_link":"../audio/f/ukforgi002.mp3","content":"Add to word list\nAdd to word list\nB1 to stop blaming or being angry with someone for something that person has done, or not punish them for something: forgive someone for something/doing something I don't think she's ever quite forgiven me for getting her name wrong that time. I'd never forgive myself if anything happened to the kids. forgive and forget\nto completely stop blaming or being angry with someone for something they have done, and to stop thinking about it: A quarrel is only over when both sides can forgive and forget.\nSee more forgive me B2 formal\nused before you ask or say something that might seem rude: Forgive me for asking, but how much did you pay for your bag?\nSee more\nMore examplesFewer examples\"Please, please forgive me!\" she begged him.Don't worry. He forgives people very easily.She could not forgive his many infidelities.He still hasn't forgiven me for what I did.He forgave his brother for breaking the window.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbeg\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\npenance\nrepentance\nshred\nsink\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nforgive a loan/debt\nto say that money does not have to be paid back: The new program would forgive state loans to new graduates who teach in Nebraska.\nSee more\nAdd to word list\nAdd to word list\nto stop being angry with someone who has done something wrong: She apologized and he forgave her. I can’t forgive someone who has treated me so badly. forgiveness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/fərˈɡɪv·nəs, fɔr-/\nTo my family and friends, I beg your forgiveness for the lies I’ve told.\nAdd to word list\nAdd to word list\nto allow someone to not have to pay a debt: Japan agreed to forgive up to 100% of the debts owed to it by the world's poorest countries. forgiveness noun [ U ]\ndebt/loan forgiveness The legislation also includes special loan forgiveness for public servants such as teachers and firefighters."}