{"id":157512,"name":"forget","type":"verb","us_sound":"fɚˈɡet","us_link":"../audio/f/eus71877.mp3","uk_sound":"fəˈɡet","uk_link":"../audio/f/ukfores023.mp3","content":"forget verb\n(NOT REMEMBER)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to be unable to remember a fact, something that happened, or how to do something: I'm sorry, I've forgotten your name. Let me write down that date before I forget it.forget about I completely forgot about Jenny's party. [ + (that) ] We had forgotten (that) she doesn't come on Thursdays. I'm sorry, I was forgetting (= I had forgotten) you would be away in August. [ + -ing verb ] She would never forget seeing the Himalayas for the first time. [ + question word ] I've forgotten what you do next/how to do it.forget a face I never forget a face (= I'm good at remembering people).\nThesaurus: synonyms, antonyms, and examples\nto forget somethingforgetI can't believe I've forgotten her birthday!slip your mindI meant to tell you that he'd phoned, but it completely slipped my mind.be on the tip of your tongueOh, what was that movie called? It's on the tip of my tongue.escape youThe name of her book escapes me at the moment.blank outThe dinner where he admitted the affair was so painful that I must have blanked it out.\nSee more results »\nnot forgetting\nUK including: This is where we keep all the books, not forgetting the magazines and newspapers.\nSee more\nMore examplesFewer examplesI'll write it down now so I won't forget.We left in such a hurry that we forgot our tickets.I feel so guilty about forgetting her birthday.I want to forget the whole thing.It's either Spanish or Portuguese that she speaks, but I've forgotten which.\nSMART Vocabulary: related words and phrases\nForgetting and forgetfulness\nabsent-minded\nabsent-mindedly\nabsent-mindedness\namnesia\namnesiac\nanterograde\nblur\nbury\nerase\nforget it idiom\nforgetful\nforgetfully\nforgetfulness\nget something out of your mind idiom\nrustily\nrusty\nscatterbrained\nscatty\nsenior moment\nslip\nSee more results »\nforget verb\n(NOT DO)\nA1 [ I + to infinitive, T ] to not remember to do something: Don't forget to lock the door. Dad's always forgetting (to take) his pills.\nMore examplesFewer examplesDon't forget to claim (for) your travelling expenses after the interview.Don't forget to feed the tomatoes.Some prize idiot forgot to lock the door.He had forgotten to plug the television into the mains socket.He raged at us for forgetting to order a replacement.\nSMART Vocabulary: related words and phrases\nForgetting and forgetfulness\nabsent-minded\nabsent-mindedly\nabsent-mindedness\namnesia\namnesiac\nanterograde\nblur\nbury\nerase\nforget it idiom\nforgetful\nforgetfully\nforgetfulness\nget something out of your mind idiom\nrustily\nrusty\nscatterbrained\nscatty\nsenior moment\nslip\nSee more results »\nforget verb\n(NOT BRING)\nA2 [ T ] to not bring something with you because you did not remember it: I forgot my keys.non-standard I forgot (= left) my wallet at home.\nMore examplesFewer examplesWhen he got to the airport he found he'd forgotten his passport.I then realized, to my absolute horror, that I had forgotten the present.I've forgotten my umbrella - what a nuisance!I realized too late that I'd forgotten the tickets.I've forgotten my door-keys - we'd better try the window.\nSMART Vocabulary: related words and phrases\nForgetting and forgetfulness\nabsent-minded\nabsent-mindedly\nabsent-mindedness\namnesia\namnesiac\nanterograde\nblur\nbury\nerase\nforget it idiom\nforgetful\nforgetfully\nforgetfulness\nget something out of your mind idiom\nrustily\nrusty\nscatterbrained\nscatty\nsenior moment\nslip\nSee more results »\nforget verb\n(STOP THINKING)\nB1 [ I or T ] to stop thinking about someone or something: He tried to forget her.forget about It seemed unlikely that the debt would ever be paid off so we just forgot about it.\nSMART Vocabulary: related words and phrases\nForgetting and forgetfulness\nabsent-minded\nabsent-mindedly\nabsent-mindedness\namnesia\namnesiac\nanterograde\nblur\nbury\nerase\nforget it idiom\nforgetful\nforgetfully\nforgetfulness\nget something out of your mind idiom\nrustily\nrusty\nscatterbrained\nscatty\nsenior moment\nslip\nSee more results »\nforget verb\n(BEHAVE BADLY)\nforget yourself\nto act in a socially unacceptable way because you have lost control of your emotions: He was so angry he forgot himself and swore loudly. I do apologize - I forgot myself! I simply forgot myself for a moment - blame it on the wine. In all the excitement, I forgot myself and threw my arms around him. In his enthusiasm he was apt to forget himself, and he frequently had to apologize later. John, forgetting himself, suddenly burst into song.\nSMART Vocabulary: related words and phrases\nHumiliating and degrading\nabase\nabasement\nbe under a cloud idiom\nbring/take someone down a peg (or two) idiom\nbruise someone's ego idiom\ndisgraced\ndishonour\ndishonourable\ndishonourably\ndoghouse\nignobly\nignominious\nignominiously\nignominy\nin the doghouse idiom\nshoddiness\nshoddy\nstoop\nstoop to something\nundignified\nSee more results »\nGrammar\nForget or leave?We sometimes use forget when we don’t remember to bring something with us: …\nIdioms\nand don't you forget it\nforget it\nAdd to word list\nAdd to word list\nto be unable to remember; fail to remember: [ T ] You’d better not forget your mother’s birthday. [ + (that) clause ] She forgot (that) she had a dental appointment. [ + to infinitive ] Don’t forget to lock the car.\nTo forget (about) is to stop thinking about someone or something, or to stop thinking about doing something: [ T ] I wish I could forget him but I can’t. [ I ] I’m afraid we’ll have to forget about going to the beach – it’s raining. Idiom\nforget (about) it"}