{"id":157638,"name":"formal","type":"adjective","us_sound":"ˈfɔːr.məl","us_link":"../audio/f/formal.mp3","uk_sound":"ˈfɔː.məl","uk_link":"../audio/f/ukforgi017.mp3","content":"formal adjective\n(OFFICIAL)\nAdd to word list\nAdd to word list\nC1 public or official: formal procedures a formal announcement\nin appearance or by name only: I am the formal leader of the project but the everyday management is in the hands of my assistant.\nMore examplesFewer examplesThey wanted to make a formal complaint about their doctor.The US lodged a formal protest against the arrest of the foreign reporters.My client accepts the formal apology without prejudice to any further legal action she may decide to take.A formal protest was made by the German team about their disqualification from the relay final.Most modern kings and queens rule their countries only in a formal way, without real power.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeeming and purporting to be\nformal adjective\n(SERIOUS)\nB2 Formal language, clothes, and behaviour are suitable for serious or official occasions: a formal dinner party\nMore examplesFewer examplesIs it considered improper to wear such a short skirt to a formal occasion?It's incorrect to address people by their first names at these formal events.His casual behaviour was wholly inappropriate for such a formal occasion.He writes in a formal and rather stilted style.My clothes for work tend to be quite formal.\nSMART Vocabulary: related words and phrases\nManners & levels of formality\nbutton-down\nbuttoned-up\ncasualization\nceremonious\nceremoniously\nformality\ngenteel\ngenteelly\ngenteelness\ngentility\nmannerly\nmind your p's and q's idiom\nnon-formal\nnon-U\nnot the done thing idiom\nU, u\nunbuttoned\nunstuffy\nvalediction\nvaledictory\nSee more results »\nformal adjective\n(EDUCATION)\nC1 Formal education or training is received in a school or college: formal education Tom had little formal education.\nSMART Vocabulary: related words and phrases\nTypes of education\nabstinence education\nabstinence programme\nabstinence-only\nacademically\nadaptive learning\nCAL\nclassroom\nhigher\nhomeschool\nhomeschooler\nhomeschooling\nhothouse\nintersession\nnursery\nscholarship\nspecial educational needs\nunacademic\nvirtual learning environment\nVLE\nvocationally\nSee more results »\nformal adjective\n(GARDEN)\nA formal garden is carefully designed and kept according to a plan, and it is not allowed to grow naturally.\nSMART Vocabulary: related words and phrases\nGardens & yards\nallotment\narboretum\nbackyard\nbarnyard\nboatyard\ncloister\ncompound\ncourt\ncourtyard\nfarmyard\nforecourt\ngarden\nground\njunkyard\nphysic garden\nprecinct\nreclamation yard\nroof garden\nyard\nSee more results »\nGrammar\nFormal and informal languageWe use formal language in situations that are serious or that involve people we don’t know well. Informal language is more commonly used in situations that are more relaxed and involve people we know well. …\nRegisterWe use the term ‘register’ to refer to particular varieties or styles of speaking and writing. Registers vary because the language is used for different purposes, in different contexts and for different audiences. For example, there is a legal register, a register of advertising, registers of banking and a register of weather forecasting. We commonly recognise registers because of their specialised vocabulary but also because of particular uses of grammar. We also use the term register to refer to whether language is being used formally or informally: …\na dance at which women wear fashionable, expensive dresses and men wear tuxedos or similar clothes\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmasquerade\nmela\nstreet party\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nSee more results »\nAdd to word list\nAdd to word list\nusing an agreed and often official or traditional way of doing things: There are formal procedures for applying to become a US citizen.\nIf a social occasion is formal, you wear traditional or very good clothes: It was a formal affair, and men were supposed to wear dark suits or tuxedos.\nFormal language is the language used esp. in writing in situations that are official and which is often more difficult than the language used in ordinary conversation.\nFormal education/training is the learning of a subject or skill from courses in a school: His formal education ended at the sixth grade, but he became a millionaire at the age of thirty.\na dance at which women wear fashionable, expensive dresses and men wear tuxedos or similar clothes\nAdd to word list\nAdd to word list\nstated or agreed in writing: a formal agreement/contract/offer They are required to make a binding formal offer and then publish an offer document within 28 days.\ndone publicly or officially: a formal announcement/discussion/investigation The two companies began formal discussions to renegotiate the $2.8 billion power project.\nused to describe clothing that is suitable for important or official occasions: Please note that formal dress is not required at the dinner.\nused to describe education or training that is received in a school or college: Lacking formal education, he worked as a sharecropper and journeyman laborer to support his family.\nECONOMICS used to describe businesses that are officially recognized, pay taxes, etc.: In Mexico small and medium-sized enterprises generate six out of ten jobs in the formal sector. formally adverb\nThe bid for the company could be formally accepted early next week."}