{"id":157685,"name":"formation","type":"noun","us_sound":"fɔːrˈmeɪ.ʃən","us_link":"../audio/f/formation.mp3","uk_sound":"fɔːˈmeɪ.ʃən","uk_link":"../audio/f/ukforgi023.mp3","content":"Add to word list\nAdd to word list\nC2 [ C ] the way something is naturally made or the way it has been arranged: a rock formation cloud formations\nC2 [ U ] the development of something into a particular thing or shape: the formation of a crystal in formation\nActivities that are done in formation are done in a pattern by a number of people, vehicles, etc. moving together: marching in close formation\nSee more\n[ C ] an arrangement of a team's players on an American football or association football field: There is a time for trying new formations and asking players to do slightly different things. a 4-4-2 formation The team was lined up in a punting formation.\nMore examplesFewer examplesHis decision to change the team's formation for the final match was a masterstroke.One motorbike peeled away from the formation and circled round behind the rest.He played a seminal role in the formation of the association.The manager had been experimenting with different formations.Coral is a limestone formation formed in the sea by millions of tiny animals.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ngenerativity\ngrind something out\nhandmade\nknock\nknock off (something)\nmint\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nrush something out\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nFootball/soccer\nAmerican football\nformation noun [C/U]\n(ROCK)\nAdd to word list\nAdd to word list\nearth science a large area of rock that has characteristics different from the land surrounding it\nformation noun [C/U]\n(COMING TOGETHER)\nthe process by which something comes into existence or begins to have a particular order or shape: [ U ] They called for the formation of a committee to investigate corruption.\nA formation is the particular form that something has taken, or the things or people having this form: [ C ] unusual cloud formations [ U ] The soldiers marched in formation (= in an orderly arrangement).\nAdd to word list\nAdd to word list\nthe development or creation of a company, organization, etc.: His company has made excellent progress since its formation three years ago. The arts center is completing the formation of a search committee for a new chief executive officer. See also\ncapital formation"}