{"id":157631,"name":"form","type":"verb","us_sound":"fɔːrm","us_link":"../audio/f/form.mp3","uk_sound":"fɔːm","uk_link":"../audio/f/ukforgi016.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to begin to exist or to make something begin to exist: A crowd formed around the accident. A solution began to form in her mind.form an impression I formed the impression (= the way she behaved suggested to me) that she didn't really want to come.\n[ T ] to make something into a particular shape: form something into something She formed the clay into a small bowl.\nB1 [ L only + noun ] to make or be something: The lorries formed a barricade across the road. Together they would form the next government. This information formed the basis of the report.\n[ I ] formal If separate things form, they come together to make a whole: The children formed into lines.\nMore examplesFewer examplesResearch forms the predominant part of my job.By forming a coalition, the rebels and the opposition parties defeated the government.The prisoners formed a line against the wall.A long queue had formed, snaking its way downstairs and out into the street.A thick sheet of ice had formed over the water.\nSMART Vocabulary: related words and phrases\nCreating and producing\nanti-creative\nartefact\nattribute\nattribute something to someone\nbang something out\nbash\ncrank\ngenerative\ngenerativity\ngrind something out\nhandmade\nknock\nremake\nrig\nrig something up\nroll (something) out\nrollout\nrun something up\nspin\nyield\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nComprising and consisting of\nCollecting and amassing\nForming groups (of people)\nGrammar\nNot only … but alsoWe use not only X but also Y in formal contexts: …\nform noun\n(DOCUMENT)\nA2 [ C ] a paper or set of papers printed with spaces in which answers to questions can be written or information can be recorded in an organized way: entry form Children are being asked to send in their entry forms (= documents used to enter a competition) by next week. fill in a form Please fill in the form with black ink.fill out a form They gave him a long form to fill out.complete a form When you have completed the form, hand it in at the desk. See also\napplication form\nclaim form\nconsent form\norder form\nMore examplesFewer examplesHave you completed your application form yet?I had to fill in this really complicated form.On his form he lists his interests as cycling, the cinema and cooking.Please write your credit card number on this form.Take the forms into your local branch office.\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPublishing: paper & stationery\nform noun\n(TYPE)\nB2 [ C ] a type of something: form of Swimming is the best form of exercise.\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nMore examplesFewer examplesAerobics is one of the most stimulating forms of exercise.Body language is a potent form of non-verbal communication.Emma's only form of recreation seems to be shopping.Bicycles are a cheap and efficient form of transport.Simple forms of life have only one cell.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbrand\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nhue\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nform noun\n(SHAPE)\nC1 [ C ] the shape or appearance of something: I could just about make out his sleeping form on the bed. The moon highlighted the shadowy forms of the hills.in the form of The lawn was laid out in the form of the figure eight. take form\nto gradually be seen or gradually develop: Trees and hedges started to take form as the fog cleared.\nSee more\nMore examplesFewer examplesShe looked at Timothy's recumbent form beside her.The song achieved a perfect unity between form and content.The sculpture was inspired by natural forms.He could see the form of a vehicle approaching in the distance.The chairs were arranged in the form of circle.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nform noun\n(ABILITY)\n[ U ] A competitor's form is their ability to be successful over a period of time: Both horses have shown good form over the last season. After a bad year, she has regained her form. be on good, great, etc. form C2 UK (US be in good, great, etc. form)\nto be feeling or performing well: Paul was on good form at the wedding and kept everyone entertained.\nSee more\nMore examplesFewer examplesAfter the humiliation of last week's defeat, the Mets were back on form.She's currently experiencing a dip in form.The team are in unbeatable form.Ashia Hansen rediscovered her best form with a morale-boosting win in the triple jump.He has been struggling to regain his form after a series of defeats.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nwhat someone is (really) made of idiom\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nform noun\n(GRAMMAR)\nB1 [ C ]\n&#160; language\n&#160; specialized one part of a verb or other word that has a special use or meaning: The continuous form of \"stand\" is \"standing\". \"Stood\" is the irregular past tense form of \"stand\". \"Hers\" is the possessive form of \"her\". \"Isn't\" is the short form of \"is not\".\nMore examplesFewer examplesthe genitive form of a nounthe imperative form of the verb\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nform noun\n(SCHOOL GROUP)\nB1 [ C ] in the UK, a class of school children or a group of classes of children of a similar age\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\nform noun\n(BEHAVIOUR)\nbad form old-fashioned\nrude behaviour: Was that bad form then, leaving so early?\nSee more\nform noun\n(SEAT)\n[ C ] old-fashioned a long, thin seat, usually without a back\nSMART Vocabulary: related words and phrases\nChairs & seats\n-seater\narmchair\narmrest\nbanquette\nbar stool\nbeach chair\nbeanbag\nbooster seat\nfront seat\ngallery\nhigh chair\nliving room suite\nlounger\nperch\nsag bag\nseating\nsettee\nshooting stick\nstall\nstool\nSee more results »\nGrammar\nNot only … but alsoWe use not only X but also Y in formal contexts: …\nform verb\n(COME TOGETHER)\nAdd to word list\nAdd to word list\n[ I/T ] to come together and make a particular order or shape: [ + to infinitive ] A crowd formed to watch the fire. [ T ] Please form a single line. [ T ] The geese flying overhead formed a V-shaped pattern.\nform verb\n(BEGIN HAVING)\n[ T ] to begin to have: I formed the opinion that I was not really welcome there any more.\nform verb\n(BEGIN)\n[ T ] to begin something, esp. organizing people or things: We formed a community group to help people who are sick or disabled. They formed a new publishing company.\nform noun\n(TYPE)\n[ C ] us\nYour browser doesn't support HTML5 audio\n/fɔrm/ a type or kind of something, or the particular way in which something exists: I was always more interested in poetry than in other forms of literature. She has a mild form of the flu and should be OK in a few days. The medicine comes in the form of a liquid or pills.\nform noun\n(SHAPE/APPEARANCE)\n[ C ] us\nYour browser doesn't support HTML5 audio\n/fɔrm/ the shape or appearance of something: The stadium was in the form of a circle.\nform noun\n(DOCUMENT)\n[ C ] us\nYour browser doesn't support HTML5 audio\n/fɔrm/ something, usually paper, that has spaces marked where you fill in information: Fill out an application form and we will let you know if a job opens up.\nform noun\n(ART/MUSIC)\n[ C ]\n&#160; literature us/fɔrm/ the organization, shape, and structure of a written work\n[ C ]\n&#160; art, music us/fɔrm/ Form in a work of art or piece of music is the design or arrangement of it that it shares with other works of the same type\nform noun\n(BEHAVIOR)\n[ U ] us\nYour browser doesn't support HTML5 audio\n/fɔrm/ the way in which someone does something: He was in great form and won the golf tournament by 7 strokes.\nAdd to word list\nAdd to word list\n(also US blank) a document printed with spaces in which to write answers or information: fill in/out a form You will need to fill in form FW 20, available from your Social Security office. You will be required to sign several forms. See also\napplication form\nclaim form\nI-9 form\norder form\nsubstance over form\ntax form\n[ I or T ] to create a company, organization, etc.: form a business/company/firm They joined together to form their own garment company.form a committee/agency/task force The council President formed the committee when the number of complaints jumped from around 50 per month to nearly 1,200.\n[ T ] to develop a successful relationship with a person, organization, or country, especially for a particular purpose: form a coalition/partnership/alliance A regional Latino business coalition was formed to seek ways to fight the measures."}