{"id":157680,"name":"format","type":"noun","us_sound":"ˈfɔːr.mæt","us_link":"../audio/f/format.mp3","uk_sound":"ˈfɔː.mæt","uk_link":"../audio/f/ukforgi022.mp3","content":"Add to word list\nAdd to word list\nC1 a pattern, plan, or arrangement: The meeting will have the usual format - introductory session, group work and then a time for reporting back.\nC1 the way in which information is arranged and stored on a computer\nMore examplesFewer examplesYou can use the device to scan the image and reproduce it on-screen in an electronic format.The new format has unanimous support and could be introduced next season.The document should be saved in ASCII format.The original format of the show has not changed much over the years.The software can support files in a variety of formats.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\nOperating computers\nto organize or arrange text, especially on a computer, according to a chosen pattern\nto prepare a computer disk for use with a particular type of computer\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nAdd to word list\nAdd to word list\nthe way in which something is shown or arranged: The two candidates could not agree on the format of the TV debate.\nIf you format a text or a disk on a computer, you organize it according to chosen patterns.\nAdd to word list\nAdd to word list\nthe size, design, materials, etc. used for a document, book, photo, etc.: The report should provide clear and concise information in a format designed to communicate the information effectively. Documents must be submitted in paper format.audio/digital/electronic format Once the photos are in a digital format, they can be edited.\nIT the arrangement of information in a computer file: The program supports all of the major image file formats. To view reports in PDF format, Adobe Acrobat Reader is required.\nthe way in which an activity, event, etc. is arranged or presented: Whatever form the conference takes next year, it is likely to be different to the format used this year.\nto prepare a computer disk for use in a particular type of computer\nto organize the way text, pictures, etc. will appear, especially on a computer: Here are some tips on how to format the document."}