{"id":157660,"name":"formality","type":"noun","us_sound":"fɔːˈmæl.ə.t̬i","us_link":"../audio/f/eus71882.mp3","uk_sound":"fɔːˈmæl.ə.ti","uk_link":"../audio/f/ukforgi019.mp3","content":"formality noun\n(ACTION)\nAdd to word list\nAdd to word list\n[ C ] something that has to be done but has no real importance: be just a formality You'll have to sign the visitors' book, but it's just a formality. formalities [ plural ]\nsomething that the law or an official process says must be done: observe the formalities We'll have to observe the formalities (= do what is expected).\nSee more\nSMART Vocabulary: related words and phrases\nThings of little importance\nbagatelle\nfactoid\nfootnote\nperiphery\npoor\npoor relation idiom\nslush\nsmall beer\nsmall fry\nsmall potatoes\nsop\nsundries\ntechnicality\ntrifle\ntrivia\ntriviality\nvacuity\nformality noun\n(SERIOUSNESS)\n[ U ] the quality of being suitable for serious or official occasions: She found the formality of the occasion rather daunting. A note of formality in his voice alerted her to the fact that others were listening.\nSMART Vocabulary: related words and phrases\nManners & levels of formality\nbutton-down\nbuttoned-up\ncasualization\nceremonious\nceremoniously\ngenteel\ngenteelly\ngenteelness\ngentility\ngrace\nmind your p's and q's idiom\nnon-formal\nnon-U\nnot the done thing idiom\nover-familiar\nsolemnity\nunbuttoned\nunstuffy\nvalediction\nvaledictory\nSee more results »\nAdd to word list\nAdd to word list\nsomething done because it follows the usual or accepted way of doing things, although it may not be important: [ C ] There were only a few legal formalities to be finished, and he would be free to leave the country. [ C ] It was just a mere formality.\nFormality is also formal behavior or appearance.\nAdd to word list\nAdd to word list\n[ C ] something official that must be done before something else can happen or be done: It is essential to observe all the formalities when setting up a business.complete/go through the formalities (of sth) This should be a means of injecting share capital into a company without going through the formalities of a share issue. Approval of the documents is a legal formality.\n[ C, usually singular ] something that must be done but that is unlikely to affect an agreement that has already been made: little more than/only/merely a formality There are still some details to be sorted out, but I believe it's only a formality. Background checks often are a mere formality in the hiring process.\n[ U ] formal writing, behaviour, etc. that is suitable in important or official situations: The bank says its business overdrafts are arranged with a minimum of formality and fuss."}