{"id":157710,"name":"former","type":"adjective","us_sound":"ˈfɔːr.mɚ","us_link":"../audio/f/former.mp3","uk_sound":"ˈfɔː.mər","uk_link":"../audio/f/ukforgi025.mp3","content":"Add to word list\nAdd to word list\nB1 of or in an earlier time; before the present time or in the past: his former wife a former employer the former president of the United States The luxury apartments are in a former factory.former glory The painting was then restored to its former glory (= returned to its original good condition).former self It was a long time after the accident before he seemed like his former self (= behaved in the way he had before). Synonyms\nerstwhile formal\none-time\nsometime formal\nThesaurus: synonyms, antonyms, and examples\ncoming from a time in the pastoldBe careful - that clock is very old.formerHe's a former coworker of mine.ancientWe need to protect ancient monuments.archaic\"Thee\" is an archaic word for \"you\".\nSee more results »\nMore examplesFewer examplesWe need a reference from your former employer.Australia and New Zealand are former British colonies.A large majority of the population is demanding the restoration of the former government.She stiffened when her former husband walked into the room.He's a former world heavyweight boxing champion.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmemory\nmoon\nmore\nno longer idiom\nnon-current\nof late idiom\nsometime\nstep\nstep back (in time) idiom\nthe status quo ante\nuse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBefore, after and already\nthe former\nB2 the first of two people, things, or groups previously mentioned: Of the two suggestions, I prefer the former. Compare\nlatter noun\nMore examplesFewer examplesI agree with the latter point, but not with the former.Of the two proposals, they accepted the former.Of the two options, we've gone for the former.The former was rejected in favour of the latter.The heavyweight contest between Smith and Walker was decided when the former was knocked out in the second round.\nSMART Vocabulary: related words and phrases\nFirst and firstly\nat first blush idiom\nat first idiom\nbegin\nblush\nfirst come, first served idiom\nfront end\nin the first/second place idiom\ninaugural\ninitial\ninitially\nintroduction\nplace\nprimary\nproto-\nprototypical\nstart\nstarter\nto begin with idiom\ntrailblazing\nword\nSee more results »\na student of the stated class group: sixth-formers (= students usually aged 16–18)\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nfrosh\ngraduate\nhomeschooler\nhouse officer\nhouseman\npupil\nscholar\nschool-leaver\nschoolboy\nschoolchild\nschoolgirl\ntheologian\nSee more results »\nformer adjective [not gradable]\n(EARLIER)\nAdd to word list\nAdd to word list\nof an earlier time, but not now: The former president lives on his ranch.\nformer noun [U]\n(FIRST)\nthe first of two people, things, or groups previously mentioned: Of the two suggestions, I prefer the former.\nAdd to word list\nAdd to word list\nused to describe something that existed or happened in the past\nHR used to describe someone who had a particular position or job in the past: former chairman/director/president He's a Washington-based health policy consultant and former insurance executive.former colleague/employee/employer She was under investigation for allegedly defrauding her former employer out of $600,000."}