{"id":157782,"name":"formula","type":"noun","us_sound":"ˈfɔːr.mjə.lə","us_link":"../audio/f/formula.mp3","uk_sound":"ˈfɔː.mjə.lə","uk_link":"../audio/f/ukforgi030.mp3","content":"formula noun\n(METHOD/RULE)\nAdd to word list\nAdd to word list\nC1 [ C ] a standard or accepted way of doing or making something : formula of We have changed the formula of the washing powder.formula for There's no magic formula for success.\n[ C ] a mathematical rule expressed in a set of numbers and letters: formula for He developed a formula for calculating the area of a triangle.\nMore examplesFewer examplesWhat's the formula for converting pounds into kilos?The director has found a winning formula with this film.The formula for calculating the cost of each carpet can be found at the back of the catalogue.The song-writing duo have stuck rigidly to the successful formula they established with their first hit.Different formulae are used to work out the efficiency of these machines.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\napproach\navenue\nbases\nbasis\ndevice\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalculations & calculating\nformula noun\n(IN CHEMISTRY)\na series of letters and symbols that show what substances make up a particular chemical element or compound : We had to learn chemical formulas at school, but I can only remember H2O for water.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nbalanced equation\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nformula noun\n(MILK FOR BABIES)\n[ U ] (UK also babymilk ); (infant formula); (US also baby formula) a type of milk that can be given to babies instead of milk from their mother\nSMART Vocabulary: related words and phrases\nChildren & babies\nankle-biter\narrival\nbabe\nbabe in arms\nbaby\ncomfort blanket\ncrawler\ndesigner baby\ndevil\ndiddums\nnipper\nonly child\noops-a-daisy\npacifier\npapoose\ntike\ntoddler\ntoilet-trained\ntomboy\ntot\nSee more results »\n(usually followed by a number) used to refer to or relating to a particular type of extremely fast and powerful racing car, or the competitions in which these cars race: As an indication of Monterey's rising reputation as a centre for sports, the new A1 Formula racing cars competed there earlier this year. In Formula One, the car can make a difference in a way that a driver cannot. He lost his life in an accident during a Formula Two race at Germany's Hockenheim circuit. Compare\nIndycar\nMore examplesFewer examplesSome fans don't approve of his move from Formula One.Before the opening of the Formula 1 racing season, there was a test session for eligible teams at the track.The current Formula Three champion has won a record nine races in a row.\nSMART Vocabulary: related words and phrases\nMotor racing\nautocross\ncockpit\nDNF\ndrag racing\ndrag strip\ngo-karting\ngrand prix\ngrid\nhill climb\nmotocross\nrace car\nrace car driver\nracing car driver\nrally\nscramble\nslingshot\nspeedway\nspin out\nstarter\nstock car\nSee more results »\nAdd to word list\nAdd to word list\nthe exact chemical parts that a mixture consists of: [ C ] The company announced that it was changing its soft-drink formula to make it sweeter.\nFormula is a liquid food mixture that is fed to babies instead of mother’s milk.\nA formula is also any plan or method for doing something well: [ C usually sing ] The formula for success in business, he said, is a willingness to take risks.\nmathematics A formula is an equation (= set of numbers and letters representing two equal amounts) that shows how one amount depends on one or more other amounts.\nAdd to word list\nAdd to word list\na standard or accepted way of doing something: a formula for sth/for doing sth Tandy had a simple formula for locating his stores: Put them where the customers are.funding/pricing formula The unions fought off another attempt to scrap the current pension formula. The combination of convenience stores and online shops has proven to be a winning formula for the company. I'm afraid there is no magic formula.\nPRODUCTION a list of the substances used to make something: The formula consists largely of sugar."}