{"id":158013,"name":"fortunate","type":"adjective","us_sound":"ˈfɔːr.tʃən.ət","us_link":"../audio/f/fortunate.mp3","uk_sound":"ˈfɔː.tʃən.ət","uk_link":"../audio/f/ukfortn006.mp3","content":"Add to word list\nAdd to word list\nB2 lucky: [ + to infinitive ] You're very fortunate to have found such a nice house.fortunate in He was fortunate in his choice of assistant. [ + that ] It was fortunate that they had set out early because the traffic was terrible. Opposite\nunfortunate\nThesaurus: synonyms, antonyms, and examples\nhaving good things happen by chanceluckyTwo lucky winners will be treated to an all-expenses paid trip to the Bahamas!fortunateIt was fortunate that he wasn't injured in the accident.it's a good thingIt's a good thing we bought travel insurance for our trip since it was cancelled.it's a good jobUK It's a good job they didn't go camping this weekend - the weather's been awful.luck outUS The Giants really lucked out in last night's game.\nSee more results »\nMore examplesFewer examplesLet us pray for those who are not so fortunate as ourselves - the sick, the old and the needy.I consider myself fortunate to have had such a good education.She was fortunate to escape with only minor injuries.We certainly were fortunate to get a fine day for the fete, considering how wet it's been lately.\"My husband arrived home just at that moment, which scared the intruder away.\" \"Gosh, that was fortunate.\"\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nhapless\nmercifully\nmercy\nmiracle\nmisadventure\nmischance\nstreak\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nAdd to word list\nAdd to word list\nreceiving or bringing a good thing that was uncertain or unexpected: a fortunate choice [ + to infinitive ] You’re fortunate to have found such a pleasant house. [ + that clause ] It was fortunate that you left in time. fortunately adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈfɔr·tʃə·nət·li/\nFortunately we were already home when it started to snow."}