{"id":158017,"name":"fortune","type":"noun","us_sound":"ˈfɔːr.tʃuːn","us_link":"../audio/f/fortune.mp3","uk_sound":"ˈfɔː.tʃuːn","uk_link":"../audio/f/ukfortn008.mp3","content":"fortune noun\n(WEALTH)\nAdd to word list\nAdd to word list\nB2 [ C ] a large amount of money, goods, property, etc.: She inherited a fortune from her grandmother. He lost a fortune gambling.make a fortune You can make a fortune out of junk if you call it antiques.cost a fortune This dress cost a fortune.a small fortune You don't need to spend a small fortune to be prepared.worth a fortune Any painting by Van Gogh is worth a fortune.\nMore examplesFewer examplesShe has amassed a huge fortune from her novels.With a personal fortune of six million pounds, she certainly doesn't work out of necessity.She netted herself a fortune when she sold her company.They made a fortune through some sham property deal.She inherited a substantial fortune from her grandmother.\nSMART Vocabulary: related words and phrases\nLarge amounts of money\na king's ransom idiom\narm\nbig bucks\nblank cheque\nboxcar\nbundle\ncost someone a pretty penny idiom\ncost, charge, etc. the earth idiom\nearth\ngratuity\nhandsome\nking\nmake a bundle idiom\nmegabucks\nnot to be sneezed at idiom\npacket\npile\npot\nriches\ntreasure\nSee more results »\nfortune noun\n(CHANCE)\nB2 [ C or U ] chance and the way it affects your life: have the fortune to He had the fortune to train with some of the world's top athletes.good fortune They couldn't believe their good fortune. The family's fortunes changed overnight. tell someone's fortune\nto discover what will happen to someone in the future, for example by looking at the lines on their hands or using a special set of cards: Cast out by her parents and with nowhere to go, she meets an old woman who tells her fortune.\nSee more\nMore examplesFewer examplesShe rejoiced in her good fortune.But for a cruel twist of fortune, he could now be running his own business.At the fair, there was a lady who told your fortune.The chairman, Tony Bramall, was responsible for the turnaround in the company's fortunes.His commitment to democracy and free markets has waxed and waned with his political fortunes.\nSMART Vocabulary: related words and phrases\nChance and randomness\naccident\naccident of birth\naleatory\narbitrarily\narbitrariness\ncrapshoot\neven-money\nfluke\nfluky\nfortuitous\nluck\nluck into something\nmore by accident than design idiom\nmore by luck than judgment idiom\nnon-purposive\nrandomness\nserendipitous\nserendipitously\nsortition\nstumble into something\nSee more results »\nIdiom\nfortune smiles on someone\nfortune noun\n(WEALTH)\nAdd to word list\nAdd to word list\n[ C ] a very large amount of money or property: They made a fortune in real estate. This dress cost a (small) fortune (= a lot of money).\nfortune noun\n(CHANCE)\n[ C/U ] the set of good or bad events that happen to you and have an effect on your life: [ U ] He had the good fortune to be awarded a scholarship.\n[ C/U ] If someone tells your fortune, that person tries to discover what will happen to you in the future, for example by looking at the lines on your hands or by using a special set of cards.\nAdd to word list\nAdd to word list\n[ C ] an extremely large amount of money: pay/spend a fortune The company needs to spend a fortune to bring all of its stores up to scratch.make/lose a fortune Businesses will lose a fortune after the peak tourist season disaster. The cars on this list won't cost a fortune to insure. They had spent a small fortune on television advertising.\n[ C ] a large amount of valuable property or money that someone has collected or inherited: Her personal fortune was estimated at £24 million. He is heir to a $3billion oil fortune, the latest generation of the 31st richest family in the US.\nfortunes [ plural ]\nthe successes or failures that a person, company, or industry has at a particular time: the fortunes of sb/sth Political and financial factors will also affect the fortunes of these companies.sb's/sth's fortunes He proved himself highly effective in turning around the car manufacturer's fortunes.a change/decline/improvement in the fortunes of sth/sb The rapid improvement in the fortunes of the paper industry shows clearly how difficult it is to predict the future at any time."}