{"id":158220,"name":"founder","type":"noun","us_sound":"ˈfaʊn.dɚ","us_link":"../audio/f/founder.mp3","uk_sound":"ˈfaʊn.dər","uk_link":"../audio/f/ukfortn026.mp3","content":"Add to word list\nAdd to word list\nC2 someone who establishes an organization: She is the founder and managing director of the company.\nMore examplesFewer examplesShe was the founder of the company, and for 40 years its guiding spirit.The first safety razor was invented by company founder King C. Gillette in 1903.René Descartes is regarded as the founder of modern philosophy.The statue commemorates the founder of the college.He is recognized as one of the founders of computer technology.\nSMART Vocabulary: related words and phrases\nBosses & managers\nadministration\nanti-management\nbranch manager\nC-suite\nCAO\nco-partner\nco-president\ncomptroller\ncoo\ncoordinator\nhierarchy\nindustrialist\nlayer\nline manager\nmajordomo\nsilent partner\nslave driver\nsleeping partner\nsuperboard\nsuperintendency\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\n(especially of a boat) to fill with water and sink: The ferry foundered in a heavy storm, taking many of the passengers and crew with it.\nto be unsuccessful: founder on Teaching computers to read and write has always foundered on the unpredictable human element in language.\nSMART Vocabulary: related words and phrases\nStaying afloat, capsizing & sinking\nbail out\nbuoy\nbuoyancy\nbuoyant\nbuoyantly\ncapsize\nducking\nfloatation\nflotation\nground\nkeel over\nkickboard\noutrigger\nrefloat\nride\nright\nrun\nscupper\nsunken\nwaterlogged\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailing and doing badly\nfounder verb [I]\n(SINK)\nAdd to word list\nAdd to word list\nto fill with water and sink, or fig. to fail: The ship foundered in a heavy storm. fig. Plans for a new airport have foundered because of budget cuts.\nfounder noun [C]\n(PERSON)\nsomeone who establishes an organization: She is the founder and managing director of the company.\nAdd to word list\nAdd to word list\nsomeone who starts a new business, organization, etc.: As the founder of a petrochemicals business empire, he once ranked among Asia's wealthiest men.\nto fail or be unsuccessful, because of problems: In recent years her career has been foundering. The deal foundered on price, with the owners wanting more than $150m for the five-star hotel."}