{"id":158210,"name":"foundation","type":"noun","us_sound":"faʊnˈdeɪ.ʃən","us_link":"../audio/f/foundation.mp3","uk_sound":"faʊnˈdeɪ.ʃən","uk_link":"../audio/f/ukfortn024.mp3","content":"foundation noun\n(BEGIN)\nAdd to word list\nAdd to word list\nC1 [ U ] an occasion when an organization, state, etc. is established: the foundation of a new state\nC1 [ C ] an organization that has been created in order to provide money for a particular group of people in need of help or for a particular type of study: the British Heart Foundation the Environmental Research Foundation\n[ U ] UK the first year of infant school, previously known as reception: a foundation class/teacher Her youngest child starts (in) foundation in September.\nMore examplesFewer examplesI stand corrected - the date of foundation was 1411, and not 1412 as I had written.The foundation of the company marks an exciting time in information technology.He applied for a grant from the Rowntree Foundation.The ceremony will mark the anniversary of the foundation of the hospital.The foundation was promised a 7% increase to bring its appropriations to $2.07 billion.\nSMART Vocabulary: related words and phrases\nSuccess & failure in business\nadministration\naxe\nbankrupt\nbankruptcy\nbe running on fumes idiom\nbelly\ncharter\ndying\nfloat\ngo dark idiom\ngo into administration\ngo to the wall idiom\ngrowth hacker\ngrowth hacking\nreceiver\nshut up shop idiom\nsinking ship idiom\nsoft launch\nspin something off\nstart (something) up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nOrganizations - charities\nSchools in general\nClasses & courses\nfoundation noun\n(BUILDING)\nfoundations [ plural ]\nthe structures below the surface of the ground that support a building: The foundations will have to be reinforced to prevent the house from sinking further into the ground.\nSee more\nfoundation noun\n(BASIC FACT)\n[ C ] an idea or fact that something is based on Synonyms\nbasics\nessential\nfirst principles UK\nfundamentals\nprinciple (IDEA)\nthe rudiments be without foundation [ U ] (also have no foundation)\nC2 to be untrue: These allegations are completely without foundation.\nSee more\nfoundation noun\n(MAKE-UP)\n[ U ] a type of make-up that is spread over the skin of the face, usually before other make-up is put on, giving it a better and more even colour and hiding unwanted marks\nSMART Vocabulary: related words and phrases\nMake-up & skin care\naha\nalpha-hydroxy acid\nanti-wrinkle\nargan oil\nau naturel\nbarefaced\ngreasepaint\nliner\nlipsalve\nlipstick\nmade up\nmascara\nmascaraed\nmask\nmattify\nmudpack\nsuntan lotion\ntoner\nwand\nwarpaint\nSee more results »\nIdioms\nlay the foundation(s) of/for\nshake/rock something to its foundations\nfoundation noun\n(BASE)\nAdd to word list\nAdd to word list\n[ C ] the base that is built below the surface of the ground to support a building: a concrete foundation fig. The two leaders have laid the foundations of a new era of cooperation between their countries.\nfoundation noun\n(ACT OF ESTABLISHING)\n[ U ] the act of establishing an organization, state, etc.: The foundation of the children’s home was made possible by a generous contributor.\nfoundation noun\n(SUPPORT)\n[ U ] a fact, idea, etc. that provides support for something: These charges are completely without foundation (= false).\nfoundation noun\n(ORGANIZATION)\n[ C ] an organization that has been established to provide financial support for activities and groups that are useful or helpful: the Ford Foundation\nAdd to word list\nAdd to word list\n[ C ] an organization that has been started in order to provide money for a particular group of people or for a particular type of research: He gave £1m to set up a charitable foundation to help vulnerable young people.\n[ U ] the act of starting a new business, organization, etc.: He helped lead the company out of its worst crisis since its foundation over a hundred years ago.\nfoundations [ plural ]\nPROPERTY the structures below the surface of the ground which support a building: The foundations will have to be reinforced to prevent the house from sinking further into the ground.\nthe basic ideas or structures from which something important develops: the foundations of sth One of the foundations of democracy is a fair trial.lay/establish/build the foundations for sth The company says it is 'laying the foundations for future success'. firm/solid/strong foundations From firm foundations we will continue to grow the business."}