{"id":158241,"name":"fountainhead","type":"noun","us_sound":"ˈfaʊn.tən.hed","us_link":"../audio/f/cdo1121usfoun1752.mp3","uk_sound":"ˈfaʊn.tɪn.hed","uk_link":"../audio/f/cdo1121ukfoun1614.mp3","content":"fountainhead noun\n(CAUSE)\nAdd to word list\nAdd to word list\n[ C usually singular ] formal a thing, person, or place where something comes from or begins, or that is the cause of something: fountainhead of The weekly journal National Review is recognized as the intellectual fountainhead of modern conservatism. Together, these writers transformed the small village into a fountainhead of creative and intellectual achievement. He was the creative fountainhead at the agency for 14 years. Synonym\nsource\nMore examplesFewer examplesThe incident confirmed the museum's reputation as a fountainhead of artistic liberalism in the era's \"culture wars.\"He is a fountainhead of innovation and new ideas.One of the fountainheads of the modern travel documentary was Robert Flaherty.It has been suggested that Longfellow aspired to be the poetic fountainhead for America that Chaucer had been for England.She agrees that racism is widespread in modern society and sets out what she believes to be its main fountainheads.\nSMART Vocabulary: related words and phrases\nOrigins and sources\nat source phrase\nbases\nbe a recipe for disaster, trouble, success, etc. idiom\nbeginning\nbirth\nbirthplace\ncradle\nemanate\nemanate from/through something/someone\nfount\ngateway drug\ngenesis\nhail\noriginate\npaternity\nprovenance\nrecipe\nroot\nseed\nson\nSee more results »\nfountainhead noun\n(STATUE)\n[ C ] a decorative object made of stone, metal, etc. with a small opening that water comes out of as part of a fountain (= a decorative stream of water in a garden, lake, etc.): The yard is full of huge blue and green glazed pots, tiles, plaques and decorative fountainheads.\nMore examplesFewer examplesThe works exhibited include a bronze putto fountainhead by Donatello. The cockerel is thought to have been one of 12 fountainheads around a marble basin at the palace of Madina al-Zahra, near Cordoba. At the far end of the hall, surrounded by garlanded attendants, a plump woman sat on her throne, like a fountainhead.\nSMART Vocabulary: related words and phrases\nSculpture\nbas-relief\ncarve\ncarving\ncherub\ncupid\nhew\ninstallation\nkore\nmaquette\nmould\nmouldable\nsculpt\nsculptor\nsculptural\nsculpturally\nsculpture\nsphinx\ntiki\ntorso\nwaxwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement of liquids"}