{"id":158438,"name":"fraction","type":"noun","us_sound":"ˈfræk.ʃən","us_link":"../audio/f/fraction.mp3","uk_sound":"ˈfræk.ʃən","uk_link":"../audio/f/ukfours019.mp3","content":"Add to word list\nAdd to word list\nC2 a number that results from dividing one whole number by another: ¼ and 0.25 are different ways of representing the same fraction.\na small part of something, or a small amount: only a tiny/small fraction of Although sexual and violent crimes have increased by 13 percent, they remain only a tiny/small fraction of the total number of crimes committed each year.at a fraction of They can produce it at a fraction of the cost of (= much more cheaply than) traditional methods. Could you just move a fraction to the right, so I can get by?\nMore examplesFewer examplesReputable charities spend most of the donated money on aid and a tiny fraction on administration.For his maths homework, he's got to convert various fractions to decimals and decimals to fractions.How would you express 25% as a fraction, children?\nSMART Vocabulary: related words and phrases\nFractions\ncomplex fraction\ncompound fraction\ndeci-\ndenominator\neighteenth\neighth\nfifth\nfortieth\nin\nmillionth\nmixed fraction\nninth\nproper fraction\nseventh\nseventieth\nsixteenth\nsixth\nsixtieth\nthirteenth\nthirtieth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning small pieces and amounts\nAdd to word list\nAdd to word list\nmathematics a number that results from dividing one whole number (= a number with no part of a number after it) by another: 1/4 and 0.25 are different ways of representing the same fraction.\nA fraction is also a very small part or amount of something: Counterfeits are sold at a fraction of the cost of the genuine articles. Juries often hear only a fraction of the story. fractional adjective\n&#160; mathematics\nAdd to word list\nAdd to word list\na small part or amount of something: The company's computers only represent a fraction of the market."}