{"id":158475,"name":"fracture","type":"verb","us_sound":"ˈfræk.tʃɚ","us_link":"../audio/f/fracture.mp3","uk_sound":"ˈfræk.tʃər","uk_link":"../audio/f/ukfours024.mp3","content":"Add to word list\nAdd to word list\nIf something hard, such as a bone, fractures, or is fractured, it breaks or cracks: fracture someone's skull She fractured her skull in the accident. Two of her ribs fractured when she was thrown from her horse. A fractured pipe at a steelworks has leaked 20 tons of oil into the Severn estuary.\nThesaurus: synonyms, antonyms, and examples\nto breakbreakI didn't mean to break your phone.fractureLast year he fractured his skull.bustOne of the children has bust the computer.shatterThe ball hit the window and shattered it.smashI dropped the vase and it smashed.snapShe bent the ruler and it snapped.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nformal to divide an organization or society, or (of an organization or society) to be divided: Intense disagreement over economic policy risks fracturing the coalition government.\nSMART Vocabulary: related words and phrases\nProblems with bones, joints & teeth\nanti-plaque\nanti-rachitic\nanticaries\narthrosis\nbruxism\ncaries\ncarpal tunnel syndrome\ndislocate\nfissure\ngrowing pains\nhousemaid's knee\nkyphosis\nlordosis\nmaxillofacial\nmyelomeningocele\nossification\nossify\ntartar\ntennis elbow\ntrigger finger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeparating and dividing\na break or crack in something hard, especially a bone: multiple fractures He suffered/sustained multiple fractures in a motorcycle accident.hairline fracture He has a hairline fracture (= a thin broken line in the bone) of the wrist.\nThesaurus: synonyms, antonyms, and examples\ndamage to the bodyinjuryHe was treated for minor injuries.woundMost of the casualties had gunshot wounds.cutHe walked away from the car crash with only cuts and bruises. gashHe was bleeding profusely from a deep gash in his leg.scratchShe had little scratches all over her arms. lacerationA doctor's report said the laceration had cut the jugular vein.\nSee more results »\nSMART Vocabulary: related words and phrases\nProblems with bones, joints & teeth\nanti-plaque\nanti-rachitic\nanticaries\narthrosis\nbruxism\ncaries\ncarpal tunnel syndrome\ndislocate\nfissure\ngrowing pains\nhousemaid's knee\nkyphosis\nlordosis\nmaxillofacial\nmyelomeningocele\nossification\nossify\ntartar\ntennis elbow\ntrigger finger\nSee more results »\nAdd to word list\nAdd to word list\nto crack or break something, esp. a bone: [ T ] She fractured her skull in the accident. [ I ] This mineral fractures along straight lines.\na crack or break, esp. in a bone: He had a hairline fracture (= a thin crack in the bone) of the toe.\nearth science Fracture is also the way that a particular kind of rock usually breaks, or the shape of broken pieces."}