{"id":158499,"name":"fragile","type":"adjective","us_sound":"ˈfrædʒ.əl","us_link":"../audio/f/fragile.mp3","uk_sound":"ˈfrædʒ.aɪl","uk_link":"../audio/f/ukfours025.mp3","content":"Add to word list\nAdd to word list\nC2 A fragile object is easily damaged or broken: Be careful with that vase - it's very fragile. Some of the more fragile items are kept in a locked case. Synonyms\nbreakable\nbrittle (EASILY DAMAGED)\ndelicate (EASILY DAMAGED)\nThesaurus: synonyms, antonyms, and examples\neasily brokenbreakablePut breakable ornaments on a high shelf when young children come to visit.fragileSmall mammal bones are extremely fragile.delicateThe plant has delicate white flowers.brittleThe ground was a carpet of dried leaves and brittle twigs.weakThe floors were uneven and too weak to support the heavy equipment.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nbreaking easilyweakIf trees do not get enough water they become weak.strongSteel is a very strong material.flimsyThere was only a flimsy inflatable raft between him and the raging riverricketyWe climbed up the rickety wooden stairs.fragileSome objects are too fragile to be moved between the museums.delicateShe carefully wrapped up the delicate glass ornaments.\nSee more results »\neasily destroyed, ended, or made to fail: The assassination could end the fragile peace agreement that was signed last month. Seasonal illnesses expose how fragile the region's healthcare infrastructure is. Synonyms\nprecarious\nvulnerable\nweak or in poor health, physically or mentally: He looked rather fragile after his operation. The hospital wing provides a safer environment for medically fragile children. Synonyms\nfrail\nvulnerable\nThesaurus: synonyms, antonyms, and examples\nnot physically strongweakShe was too tired and weak to finish the race. feebleMany of the pensioners were so feeble they had to be stretchered onto the ship.punyHe was puny as a child.weedyUK I was just this weedy guy who always had his head in a book.frailA frail, grey-haired lady walked slowly down the street.\nSee more results »\nUK feeling slightly ill, upset, or tired, especially because of having drunk too much alcohol the night before: No breakfast for me, thanks - I'm feeling a little fragile after last night's party.\nMore examplesFewer examplesAll that was left of the bones were a few fragile fragments.Digital copies are used because the original documents are too fragile.Our vaccine supply system is fragile.This is one of the world's most fragile ecosystems.He suddenly looked old and fragile.She was in a fragile condition and needed a lot of emotional support.A cup of tea is just the thing when you're feeling fragile.\nSMART Vocabulary: related words and phrases\nFragile and breakable\nbreakable\nbrittle\ncobwebby\ncrumbly\ndelicacy\ndelicate\ndodgy\nfissile\nflaky\nflimsily\nflimsiness\nflimsy\nfragility\nfrail\nfriable\nramshackle\nrickety\ntenuous\ntenuously\nYou can also find related words, phrases, and synonyms in the topics:\nWeakness and vulnerability\nDangers and threats\nNot fit & healthy\nTired and making tired\nHeadaches & dizziness\nRelated word\nfragility\nAdd to word list\nAdd to word list\neasily damaged, broken, or harmed: a fragile piece of metal Their argument showed us just how fragile the teammate relationship can be. I feel fragile, as if a breath of wind could knock me over. fragility noun [ U ] us\nYour browser doesn't support HTML5 audio\n/frəˈdʒɪl·ɪ·t̬i/\nShe was a strong woman, with no hint of fragility about her.\nAdd to word list\nAdd to word list\neasily harmed, damaged, or broken: The fragile economy is under the pressure of floods at home and rising oil prices abroad. The changes would be disastrous for the fragile recovery of the UK's oil and gas industry."}