{"id":158595,"name":"framing","type":"noun","us_sound":"ˈfreɪ.mɪŋ","us_link":"../audio/f/cdo0623usfram1554.mp3","uk_sound":"ˈfreɪ.mɪŋ","uk_link":"../audio/f/cdo0623ukfram1548.mp3","content":"framing noun\n(STRUCTURE)\nAdd to word list\nAdd to word list\n[ U ] the basic structure that surrounds and supports something such as a building, vehicle, or piece of furniture: The framing around the church entrance was still standing, but everything else was reduced to rubble. A decorative lattice conceals the framing underneath. Synonym\nframe\n[ U ] the process of putting a wood, metal, etc. border around a picture, etc., or the border itself: A selection of photographs from the wedding have gone to the shop for framing. Having decided on the type and style of framing for your picture, you must make sure that you buy the right materials.\nMore examplesFewer examplesYou can see by the gaps in the ceiling where the framing of the closets was.The basement floor was finished in a week, and the framing work got under way the following week.If you are proud of your painting, visit the framing shop to give your work the setting it deserves.\nSMART Vocabulary: related words and phrases\nFrames & structures\nanatomy\narmature\nassembly\nbezel\nclothes hanger\nclothes horse\ncoat hanger\nframework\ngantry\nhanger\nhomeschool\nhoneycomb\nmatrix\npicture frame\nrack\nreframe\nsafety gate\nskeleton\nstair gate\nstructural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nframing noun\n(IN ART, LITERATURE, ETC.)\n[ C or U ] the way that the parts of something such as a photograph or scene in a film are arranged so that the objects, colours, etc. around the edges draw attention to the main feature of the image: He uses framing, composition, and lighting to create unforgettable images. The camerawork is good, and the framing shows real imagination. I like to film what is in front of me, rather than go into elaborate framings or effects.\n[ C or U ] the process of putting something such as a story, scene, or explanation at the beginning and end of a book, film, etc., as a way of explaining something about the main story: The modern framing of the story creates a shift in perspective. Hannah is the voice of the film's framing narrative. See also\nframing device\nMore examplesFewer examplesThe light and the composition in the photograph are very strong, and the framing is really very good.The film features apparently random camera movements and bizarrely beautiful framings.The framing of the story is a little too neat and may seem rather trite.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngrainy\nhalation\nhappy slapping\nhi-res\nhigh-resolution\npap\nphotoshoot\npic\npicture\nPillCam\npin-up\nprojection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: production, direction & recording\nLiterature\nCinema & theatre: parts of plays, shows & films\nframing noun\n(EXPRESSION)\n[ C or U ] the way that something is expressed, and the words that are chosen to do this: In any opinion poll, the framing of the questions is an important consideration. The results of the research could be used in the framing of policy.\n[ C or U ] the ideas and meanings that are connected with something when it is described or discussed, so that people understand it in a particular way: I disagree with the framing of these problems as inevitable. These negative framings aimed to represent the employees as people who had already been excessively rewarded.\nMore examplesFewer examplesHis ideas had a great impact on the framing of codes of criminal law.I think the situation we are in has something to do with the framing of the Constitution.As citizens we need to apply serious thought to the framing of a contemporary national identity.He argues that through decades of deliberate negative framing by conservatives, the word \"liberal\" has become virtually an insult.This is an iconoclastic attack on traditional framings of the subject of architecture.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\ndemythologize\ndescribe\ndisabuse\nextenuate\njustificatory\nlay something out\nlimn\nmansplaining\nmischaracterization\noutline\nsketch\nspell\ntrace\nundefinable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDescribing & telling stories\nRepresentation in art & in general\nframing noun\n(FOR CRIME)\n[ C or U ] the action of making a person seem to be guilty of a crime when they are not, by giving information that is not true: At the heart of the show is his framing for the murder of his brother. They say their goal is to represent the victims of police framings.\nMore examplesFewer examplesThis was a case of deliberate framing on false charges of assault.This was part of a vast scandal that included killings, beatings, framings and drug dealing by law enforcement officers.\nSMART Vocabulary: related words and phrases\nBlaming & accusing\naccusatory\naccuse someone of something\naccuser\naccusingly\nalleged\nallegedly\nblame\ncontributory negligence\nfinger\nincriminate\nincrimination\nindict\nindictable\nlay\nlay something at someone's door idiom\nlevel something against/at someone\nlightning conductor\nnail\nopprobrium\nsacrificial lamb\nSee more results »"}