{"id":158593,"name":"framework","type":"noun","us_sound":"ˈfreɪm.wɝːk","us_link":"../audio/f/usfragm005.mp3","uk_sound":"ˈfreɪm.wɜːk","uk_link":"../audio/f/ukfragm011.mp3","content":"Add to word list\nAdd to word list\n[ C ] a supporting structure around which something can be built\nC2 a system of rules, ideas, or beliefs that is used to plan or decide something: a legal framework for resolving disputes\nMore examplesFewer examplesThe steel framework supports the copper covering.The building has a flexible framework so that it can survive an earthquake.The U.S. Constitution established a broad framework of government.Many people accept the principles of evolution within the framework of their religious beliefs.Most biologists use the same basic framework for classification.\nSMART Vocabulary: related words and phrases\nFrames & structures\nanatomy\narmature\nassembly\nbezel\nclothes hanger\nclothes horse\ncoat hanger\nframing\ngantry\nhanger\nhomeschool\nhoneycomb\nmatrix\npicture frame\nrack\nreframe\nsafety gate\nskeleton\nstair gate\nstructural\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things\nframework noun [C]\n(STRUCTURE)\nAdd to word list\nAdd to word list\na structure around or over which something is built: the steel framework of a bridge\nframework noun [C]\n(ORGANIZATION)\nthe ideas, information, and principles that form the structure of an organization or plan: They’re operating within the framework of a military bureaucracy. The agreement outlines a framework and schedule for resolving the issues.\nAdd to word list\nAdd to word list\na system of rules, ideas, or beliefs that is used to plan or decide something: a framework for sth The future trade agenda can provide an important framework for restoring sustainable growth.within the framework of sth Our best chance of preventing such devastating acts of terror is to act within the framework of international law.\na supporting structure around which something can be built: a framework for sth The foundations are ready and the steel framework for the tower has been built."}