{"id":158605,"name":"franchise","type":"noun","us_sound":"ˈfræn.tʃaɪz","us_link":"../audio/f/franchise.mp3","uk_sound":"ˈfræn.tʃaɪz","uk_link":"../audio/f/ukfragm014.mp3","content":"franchise noun\n(BUSINESS)\nAdd to word list\nAdd to word list\n[ C ] a right to sell a company's products in a particular area using the company's name: a fast-food franchise a franchise holder\nMore examplesFewer examplesThe Commission felt the company were overbidding and gave the franchise to their competitors instead.The company expanded rapidly during the 1980s by means of franchises.Each store is owned by an individual who pays a fee for the franchise.The franchise has proved to be extremely lucrative.He lost the franchise after failing to meet the specified standards.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchisee\nfranchiser\nGmbH\npacker\nparent company\npartner up\npartnership\nplc\nprivate company\nSee more results »\nfranchise noun\n(VOTE)\nthe franchise [ S ]\nthe right to vote in an election, especially in order to elect a parliament or similar law-making organization: American women worked for decades to win the franchise.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\ngeneral election\nproportional representation\nproxy\nproxy vote\nproxy voter\nproxy voting\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nfranchise noun\n(FILMS)\n[ C ] a series of films that have the same or similar titles and are about the same characters: The next instalment in the Star Wars franchise is out soon. the \"Spiderman\" movie franchise\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nprojection\nremake\nrerelease\nrescreen\nreshoot\nreshow\nsting\ntheatrical\nSee more results »\nto give or sell a franchise to someone\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\npoint of sale\nPOS\nsell out\nsellout\nshift\nsoft sell\nsold\nspecial offer\nsting\nsupersize\nSee more results »\nRelated word\nfranchising\nfranchise noun\n(BUSINESS)\nAdd to word list\nAdd to word list\n[ C ] a right to sell a company’s products in a particular area using the company’s name\nfranchise noun\n(VOTE)\n[ U ]\n&#160; politics &amp; government the right to vote: Women in the US won the franchise in 1920.\nAdd to word list\nAdd to word list\nan arrangement in which a company sells another business the right to sell its products or services in return for payment: The bank is trying a scheme to let local managers work under franchise. Do buy a franchise with a strong brand.hold/own/have a franchise I don't believe they are a fit company to hold a franchise.win/lose a franchise The company won the franchise to sell and service the luxury car in the west of Scotland area.award/give/grant a franchise The company announced that it was not yet ready to award the franchise to either party. a franchise agreement/holder/fee a franchise company/business/operation\na business that has bought the right to sell the products and services of another company: She returned to London where she now owns a Body Shop franchise.a rail/fast food/television franchise The most significant piece of news for the company was being declared preferred bidder for the rail franchise.\nto sell a person or company the right to sell the products and services of your company: They made the decision to franchise the stores."}