{"id":158777,"name":"fraud","type":"noun","us_sound":"frɑːd","us_link":"../audio/f/eus75759.mp3","uk_sound":"frɔːd","uk_link":"../audio/f/ukfrate006.mp3","content":"fraud noun\n(CRIME)\nAdd to word list\nAdd to word list\nC2 [ C or U ] the crime of getting money by deceiving people: credit card fraudfraud charge He is fighting extradition to Hong Kong to face trial on fraud charges.\nMore examplesFewer examplesShe is suspected of complicity in the fraud.This latest episode in the fraud scandal has shocked a lot of people.They spent ten years in jail for fraud.The fraud depended on hundreds of bank accounts being opened on behalf of straw men.His accountant had aided and abetted him in the fraud.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nmatch-fixing\nnobble\npyramid scheme\nsiphon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCheating & tricking\nfraud noun\n(FALSE)\nC2 [ C ] someone who deceives people by saying that they are someone or something that they are not: She was a psychic who was later revealed to be a fraud.\nThesaurus: synonyms, antonyms, and examples\na dishonest personcheatShe's a liar and a cheat!cheaterUS I wouldn't play a game with him - he's a cheater.crookMy dad says that used car salesmen are just a bunch of crooks.cowboyUK The private security firm are just a bunch of cowboys looking to rough up anyone who crosses their path.fraudHe claims to be a doctor, but he's just a fraud without a medical licence.sharkThe landlord was a real shark, jacking up rents without relief.\nSee more results »\nSMART Vocabulary: related words and phrases\nFaking & pretending\naffect\nair guitar\nassume\nbelieve\nbluff someone into something/doing something\nchangeling\ncry\nfaker\nfalse\nfalse modesty\nfalsifiable\nfalsify\nout-bluff\npass something off as something\nphoney\nphony-baloney\nplay-act\nprofessed\npurport\nquack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCheating & tricking\nfraud noun\n(CRIME)\nAdd to word list\nAdd to word list\n[ U ] the crime of obtaining money or property by deceiving people: Convicted of tax fraud, he was sentenced to two years in prison.\nfraud noun\n(FALSE PERSON/THING)\n[ C ] a person or thing that is not what it claims or pretends to be: He says he’s been everywhere and done everything, but I think he’s a fraud.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW the crime of getting money by tricking or deceiving people, or a crime of this type: serious/massive fraud We only investigate when there are sufficient grounds for believing serious fraud has taken place. The US Sentencing Commission has raised penalties for corporate fraud twice.credit card/tax fraud He was charged for federal tax fraud.bank/accounting fraud She pleaded guilty to conspiracy and bank fraud.engage in/commit/perpetrate fraud It is said that they knowingly helped corporate executives commit fraud. a fraud investigation/case/trial\n[ C ] something that is not what it appears to be and is deliberately used to deceive people, especially to get money: What happens if the investment turns out to be a fraud?\n[ C ] someone who deceives people, often to get money, by saying they are something they are not: She believes her lawyer was a fraud. See also\ninvestment fraud"}