{"id":158884,"name":"freedom","type":"noun","us_sound":"ˈfriː.dəm","us_link":"../audio/f/freedom.mp3","uk_sound":"ˈfriː.dəm","uk_link":"../audio/f/ukfrate029.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the condition or right of being able or allowed to do, say, think, etc. whatever you want to, without being controlled or limited: I felt such a sense of freedom, up in the hills alone. Children are allowed much more freedom these days. [ + to infinitive ] In college, you have the freedom to do what you want.freedom of choice Everyone should be allowed freedom of choice (= the ability to make their own choices).freedom of speech The Scandinavian countries have a long tradition of protecting the freedom of speech (= the ability to say whatever you want).freedom of thought Freedom of thought (= the ability to think whatever you want) was denied under the dictatorship.freedom of information They are campaigning for freedom of information (= for any information to be allowed to be given to anyone who wants it).freedom from We demand freedom from injustice/persecution (= the condition of not having to suffer these things). Synonym\nliberty (FREEDOM)\n[ C ] a right to act in the way you think you should: Being able to vote as you want to is an important political/democratic freedom.\n[ U ] the state of not being in prison: They regained their freedom after ten years of unjust imprisonment. give someone the freedom of\nUK to honour someone by giving them special rights in a particular city: The pensioner will be given the freedom of Chester today at the age of 93.\nSee more\nMore examplesFewer examplesThis party stands for low taxes and individual freedom.He wants greater freedom to develop his own ideas.During his speech, he laid particular stress on the freedom of the press.\"We are not terrorists, \" he said evenly. \"We are freedom fighters.\"For most citizens, liberty means the freedom to practise their religious or political beliefs.\nSMART Vocabulary: related words and phrases\nHuman rights\naffirmative action\nageism\nageist\nanti-discrimination\nanti-feminism\ndesegregation\ndiscriminate\ndiscrimination\ndistributive justice\ndiversity and inclusion\nfeminism\nfeminist\nfree speech\ngay liberation\ngay rights\nsexism\nsexist\nsister under the skin idiom\nsisterhood\nsuffragette\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nAdd to word list\nAdd to word list\nthe condition or right of being able or allowed to do whatever you want to, without being controlled or limited: freedom of speech If children aren’t allowed some freedom, they won’t learn to be independent. [ U ] We were promised freedom from persecution.\nFreedom is also the state of not being in prison or in the condition of slavery (= condition of being legally owned by someone else).\nUS history Freedoms are rights given by the constitution and the Bill of Rights, such as the freedom of speech (= the right to say and write what you believe or think, with some limitations) and freedom of religion (= the right to worship or to take part in a religion)."}