{"id":158975,"name":"freeze","type":"verb","us_sound":"friːz","us_link":"../audio/f/freeze.mp3","uk_sound":"friːz","uk_link":"../audio/f/ukfreeh022.mp3","content":"freeze verb\n(COLD)\nAdd to word list\nAdd to word list\nB1 [ I or T ] If you freeze something, you lower its temperature below 0°C, causing it to become cold and often hard, and if something freezes, its temperature goes below 0°C: Water freezes to ice at a temperature of 0°C.freeze hard The ground had frozen hard.freeze solid The river used to freeze solid every winter. We had to play the game in driving rain, but at least the pitch wasn't frozen.freeze over When the lake freezes over (= turns into ice on the surface), we can go skating on it.freeze up Our pipes froze up (= the water in them turned to ice) several times last winter. The weather forecast says that it is going to freeze tonight (= that the temperature will be at or below 0°C).freeze to death Without a sleeping bag, you would freeze to death (= become so cold that you die) out there on the mountainside.\nThesaurus: synonyms, antonyms, and examples\nto become or make something cold or coldercoolWait until the mixture cools before adding the eggs.cool downLet the pan cool down a bit before you touch it.chillChill the wine in the fridge. freezeYou have to wait until the pond freezes before you can skate safely on it.\nSee more results »\nB1 [ I or T ] to make food last a long time by storing it at a very low temperature so that it becomes hard: I'll freeze any food that's left over. Most soups freeze (= can be preserved by being stored at a very low temperature) well.\nMore examplesFewer examplesShe'll prepare the food ahead of time and freeze it.If required, freeze on day of purchase.The river froze to a depth of over a metre.It was so cold that the clothes on the washing line had frozen.The river freezes every winter.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nglacially\nglacier\nhail\nhailstorm\niceberg\nicicle\nicy\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nspindrift\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreserving & storing food\nfreeze verb\n(STOP WORKING)\n[ I ] US (also freeze up) If an engine or lock freezes, it stops working because its parts have become stuck and can no longer move: My old bicycle was so rusty that the gears had frozen. If the lock has frozen up, try lubricating it with oil.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak\nbreak down\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nfreeze verb\n(STOP MOVING)\nB2 [ I ] If a person or animal that is moving freezes, it stops suddenly and becomes completely still, especially because of fear: She saw someone outside the window and froze. \"Freeze (= don't move) or I'll shoot!\" screamed the gunman.\nThesaurus: synonyms, antonyms, and examples\nnot movingstillCan't you just sit still for a moment?motionlessHe stood motionless when he saw the snake.not move a muscleHe sat there the whole time and didn't move a muscle.stock-stillShe stood stock-still as soon as she saw the bear.immobileShe sat immobile, wondering what to do next.\nSee more results »\n[ I ] in ice hockey, to stop the puck with a stick, or with your hand if you are a goaltender (= the player who guards the goal), and prevent it from moving or being moved by another player, which causes play to stop: Taylor froze the puck against the boards and the referee called for a faceoff.\nSMART Vocabulary: related words and phrases\nImmobility\nanti-jamming\nbe locked in something\nboxed in\nbudge\ncataleptic\nfrozen\nimmovably\njam\njammed\nlifelessly\nlock\nmotionless\nmotionlessly\nstanding\nstandstill\nstatic\nstatically\nstationary\nstock-still\ntime stands still idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHockey\nfreeze verb\n(MONEY/PROPERTY)\n[ T ] To freeze something such as pay or prices is to fix it at a particular level and not allow any increases: The government has frozen pensions until the end of next year.\n[ T ] to officially and legally prevent money or property from being used or moved: When it was obvious the company was going bankrupt, the government ordered all their assets to be frozen.\nSMART Vocabulary: related words and phrases\nPrice decreases\nbargain\nbear market\nbearish\nbearishly\ncloseout\nconcessional\ncouponer\ncouponing\ndeflate\ndeflation\ndepreciate\ndevalue\ndiscount\ndrop off\nknock off (something)\nmark something down\noverdiscount\npost-devaluation\nprojected value\nspiral\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot able to be changed\nIdiom\nbe cold enough to freeze the balls off a brass monkeyPhrasal verb\nfreeze someone out\nfreeze noun\n(COLD WEATHER)\n[ S ] a period of extremely cold weather\nSMART Vocabulary: related words and phrases\nCold\nBaltic\nbitingly\nbitter\nbone-chilling\nbrass\nchilled\ncooling\ndank\nfrigid\nfrostbite\nfrozen\nisothermal\nisothermally\nkeenness\nminus\noccluded front\nparky\nperished\npiercingly\nwintry\nSee more results »\nfreeze noun\n(STOP)\n[ C ] a temporary stopping of something: freeze on The government has imposed a wage freeze/a freeze on wage increases.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlay\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nAdd to word list\nAdd to word list\nto become cold enough to become solid: [ I ] The rainwater froze overnight, leaving the roads icy.\nIf you freeze food, you preserve it by storing it at a very low temperature.\nSomeone such as a police officer who says freeze is ordering you not to move except as the person tells you: [ I ] Freeze! Keep your hands up!\nTo freeze something such as pay or prices is to fix them at a particular level and not allow any increases: [ T ] The company has frozen salaries.\nTo freeze money or property is to officially and legally prevent it from being used or moved: [ T ] The government froze his assets. Phrasal verbs\nfreeze out someone\nfreeze over\na period when the air temperature is low enough so that water will freeze: The first freeze didn’t come until mid-December.\nA freeze is a temporary stopping of something: The company has imposed a wage/hiring freeze.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; ECONOMICS, FINANCE to fix prices, income levels, interest rates, etc. at a particular level and not allow any increases: freeze wages/rates/taxes Mortgage lenders have agreed to freeze adjustable interest rates for some of the state's highest-risk borrowers.\n[ T ]\n&#160; LAW, BANKING if a government or court freezes someone's bank account, money, assets etc. it legally prevents them from using any of it: Some of the prisoners' assets were frozen by order of the government. Officials said they will freeze 120 local bank accounts and place racketeering liens on numerous homes and businesses.\n[ I ]\n&#160; IT if a computer freezes or a computer screen is frozen, it suddenly stops working and the screen will not change even when you use the keyboard or mouse: If your computer freezes, you may have to shut it down manually by holding the power button for several seconds.\n[ T ] to officially stop an activity or process for a period of time: freeze production/sales/recruitment The world's biggest automaker announced that it will temporarily freeze production due to low demand. Phrasal verb\nfreeze sb out\nECONOMICS a decision to fix prices, income levels, interest rates, etc. at a particular level and not allow any increases: a pay/price/interest rate/tax freeze To deal with the pension crisis, a two-year salary freeze has been imposed on the city's 11,000 employees.\nan official decision to stop an activity from continuing for a period of time: They promised to halve the deficit through a domestic spending freeze and improving government efficiency. The temporary nuclear freeze has not impressed Washington hardliners.a hiring/recruitment freeze Hiring freezes and layoffs are likely to continue into the new year. a freeze on sth The organization was set up to campaign for a freeze on the growing of GM crops and animals.\nLAW an official order, for example, from a judge or government, that prevents money or property from being used or moved: impose/put/place a freeze on sth A High Court judge placed a freeze on her worldwide assets. See also\ncredit freeze"}