{"id":158981,"name":"freezing","type":"adjective","us_sound":"ˈfriː.zɪŋ","us_link":"../audio/f/freezing.mp3","uk_sound":"ˈfriː.zɪŋ","uk_link":"../audio/f/ukfreeh024.mp3","content":"Add to word list\nAdd to word list\nB1 extremely cold: it is freezing It's freezing in here - can I close the window? They survived for four hours in the freezing water. After walking through the snow, my feet were freezing.freezing cold I had to wait for hours on the freezing cold station platform. Synonyms\nArctic figurative\nbiting (COLD)\nbitter (COLD)\nglacial (ICE/COLD)\nThesaurus: synonyms, antonyms, and examples\nfeeling coldcoldYour hands are cold!feel the coldShe's someone who feels the cold, that's why she's always bundled up.chillyThe sun's gone down and now I feel quite chilly.freezingShut the windows, I'm freezing!frozenMy nose is frozen after that walk - I should have worn a scarf.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving temperature lower than what is comfortablecoldBrr, it's cold outside!bitterWrap up warmly - it's bitter outside!freezingIt's absolutely freezing in here!bitingA biting wind blew in her face as she opened the door.icyAn icy wind whistled across the plain.\nSee more results »\nMore examplesFewer examplesIt's freezing cold today.So Roger spent the night in a freezing garage, did he? That'll teach him to go out without his house keys!Come in - you must be freezing out there!I haven't got my coat and I'm freezing.It was freezing as we walked home last night.\nSMART Vocabulary: related words and phrases\nCold\nBaltic\nbitingly\nbitter\nbone-chilling\nbrass\nchilled\ncooling\ndank\nfrigid\nfrostbite\nfrozen\nisothermal\nisothermally\nkeenness\nminus\noccluded front\nparky\nperished\npiercingly\nwintry\nSee more results »\nturning to ice: Freezing fog and icy patches are expected to cause problems for motorists tonight.\nMore examplesFewer examplesMists, freezing fogs and snow are common in this area.Most of the country is experiencing unseasonal freezing temperatures and strong winds.A fierce, freezing wind whipped torrential rain into their faces.In these freezing conditions, the birds rely on householders for their food and water every day.Our faces were stung by the icy wind and freezing rain.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nglacially\nglacier\nhail\nhailstorm\niceberg\nicicle\nicy\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nspindrift\nSee more results »\nthe temperature (0°C) at which water becomes ice: The temperature was below freezing for most of the day.\nSMART Vocabulary: related words and phrases\nMiscellaneous units of measurement\nacre\nacreage\ncaloric\ndioptre\nfarad\nfathom\nfirkin\nflashpoint\nhectare\nHz\njoule\nMHz\nmolar\nnewton\nradian\nrefractive index\nScoville scale\nsievert\ntorr\nwatt\nSee more results »\nAdd to word list\nAdd to word list\nchemistry the change or process of changing from a liquid to a solid substance\ncold enough for liquids to turn to ice: We can expect freezing temperatures all week.\nfig. Freezing also means very cold: It’s freezing in here – turn off the air conditioner!"}