{"id":158899,"name":"freehold","type":"noun","us_sound":"ˈfriː.hoʊld","us_link":"../audio/f/usfreeb003.mp3","uk_sound":"ˈfriː.həʊld","uk_link":"../audio/f/ukfreeh002.mp3","content":"Add to word list\nAdd to word list\nthe legal right to own and use a building or piece of land for an unlimited time: freehold of Who owns the freehold of the property?freehold on She needs to raise 10,000 pounds to buy the freehold on her house. Compare\nleasehold noun\nSMART Vocabulary: related words and phrases\nMortgages & real estate\nblockbusting\nbrick\nbricks and mortar idiom\nBTL\nbuy-to-let\nchain\nequity\nfirst-time buyer\nlandlady\nletting\nmortgagee\nplanning blight\nreal estate broker\nreal estate office\nRealtor\nrealty\nrealty office\nrefinance\nremortgage\nrepo\nSee more results »\nowned in a way that means you can own and use a building or piece of land for an unlimited time: Are those flats freehold or leasehold?\nMore examplesFewer examples Apart from charities, only a maximum of four people can hold the legal title to freehold or leasehold property in England.Most houses have balconies overlooking the marina or North Harbour and all are freehold.Magnificent five-storey freehold house in an elegant Georgian terrace, built circa 1830. Today freehold tenure signifies that land is held without any person interposed between the Crown and the holder.\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nlodger\nrent strike\nrental\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMortgages & real estate\nAdd to word list\nAdd to word list\nthe right to own a building or piece of land without time limit: freehold of/on sth Trustees accepted an offer of £30 million for the freehold of the business.buy/sell/own the freehold Instead of selling the freehold, the Commissioners are selling a 200-year lease.\n(also mainly UK freehold estate) a building or piece of land that is owned by someone without time limit: Their stores do add a bit of solidity to their balance sheet as they are all freeholds. Compare\nleaseholdSee also\nfee simple\nlife estate\nfreehold property is owned by someone without time limit: Almost all of its properties are freehold, giving the group a net asset value per share of about 345p. freehold buildings/land/possession"}