{"id":158864,"name":"free","type":"adjective","us_sound":"friː","us_link":"../audio/f/free.mp3","uk_sound":"friː","uk_link":"../audio/f/ukfrate025.mp3","content":"free adjective, adverb\n(NOT LIMITED)\nAdd to word list\nAdd to word list\nB2 not limited or controlled: [ + to infinitive ] Am I free (= do I have permission) to leave now?free to I'll give you a key, so you'll be free to come and go as you like.feel free to Please feel free to interrupt me if you don't understand anything.free access The agreement gives companies free access to the markets of member countries.free election A great deal has been achieved, most notably free elections (= elections in which people can vote as they wish). free and easy\nrelaxed and informal: The atmosphere in the office is fairly free and easy.\nSee more\nMore examplesFewer examplesFeel free to help yourself to coffee.I do a lot of reading in my free time.We like to get the marketing done on Thursdays so we can have the weekend free.The recent free elections mark the next step in the country's progress towards democracy.The very concept of free speech is unknown to them.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nfree adjective, adverb\n(NO CHARGE)\nA2 costing nothing, or not needing to be paid for: I got some free cinema tickets. Members all receive a free copy of the monthly newsletter. The elderly travel free on public transport.free of charge We will install your washing machine free of charge (= without charge).for free You can download the app for free.\nThesaurus: synonyms, antonyms, and examples\nget something for freeget something for freeReaders of her blog get advice for free.get something for nothingYou don't get anything for nothing these days.freeloadThen he went off to freeload some more drinks. bumHe bums the occasional cigarette from his older brother.cadgeShe's always cadging drinks from the people she is with. scroungeCan I scrounge a lift with you?\nSee more results »\nMore examplesFewer examplesAdults pay an admission charge but children get in free.The books will be distributed free to local schools.All the carpets we sell are fitted free.They fixed my watch free of charge.Adults pay an admission charge but children get in free.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nsmall change\nsomething for nothing idiom\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\nfree adjective, adverb\n(NOT IN PRISON)\nB2 not a prisoner any longer, or having unlimited movement: She left the court a free woman after the case against her collapsed because of a legal technicality.set someone free The new government has decided to set all political prisoners free.go free She went free after the charges against her were dropped.walk free I could not believe that the court would allow someone who was obviously guilty to walk free. I let the dogs run free in the park.\nMore examplesFewer examplesDon't you think that allowing a criminal to go free is perhaps better than imprisoning an innocent person?He went free because the jury decided there was a reasonable doubt about his guilt.The police reasoned with the hijackers to at least let the children go free.The Court of Appeal reversed the earlier judgment and set him free.After years in prison, the men who had wrongfully been found guilty of the bombing were finally set free.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nfree adjective, adverb\n(LOOSE)\nnot in a fixed position or not joined to anything: free of Both bookcases stand free of the wall. The bolts have worked themselves free because of the vibrations.free from Rescuers took several hours to cut the survivors free from the wreckage.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nunattached\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nIdiom\nfree and clear\nfree adjective\n(NOT BUSY)\nA2 not doing anything planned or important, or available to be used: free time I do a lot of reading in my free time.free to She's in a meeting at the moment, but she should be free to see you in ten minutes. I'm working in the café all this week, but I've got a free evening next Monday. Excuse me, is this seat free (= is anyone intending to sit in this seat)? We queued for half an hour waiting for a free space in the car park. If you take these bags, that will give me a free hand to open the door.\nMore examplesFewer examplesI've got something on this Tuesday, but I'm free on Wednesday.I just wanted to ask you if you're free this afternoon.We like to get the marketing done on Thursdays so we can have the weekend free.Are you free at lunchtime?She's never at home because she spends all her free time at hockey practices.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nfree adjective\n(WITHOUT)\nC1 [ after verb ] not having something that is unwanted or unpleasant: free from The organization is a charitable enterprise, so it is free from tax worldwide.free of She'll never be completely free of the disease. Ensure the wound is free from/of dirt before applying the bandage.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\nstarved\ntaken\nunaccompanied\nSee more results »\nfree adjective\n(GIVING/USING OFTEN)\nfree with\ngiving or using often or in large amounts: He's rather free with his wife's money.\nSee more make free with UK disapproving\nto use something that belongs to someone else a lot: Don't her parents mind her making free with their house while they're on holiday?\nSee more\nfree adjective\n(CHEMICAL)\nchemistry\n&#160; specialized If an element is free, it is not combined with anything else or attached to anything else: free oxygen/nitrogen\nSMART Vocabulary: related words and phrases\nChemical elements\nactinium\nalkali metal\namericium\nastatine\nberkelium\nbrimstone\nbromine\ncalcium\nfluorine\ngermanium\niodine\nlithium\nmanganese\nnickel\nplutonium\nquicksilver\nselenium\nsodium\ntransition metal\nzinc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSeparateness and isolation in space\nIdioms\na free ride\nthere's no such thing as a free lunch\nfree verb\n(NOT IN PRISON)\nB2 [ T ] to allow someone to leave a prison or place where they have been kept: After a ten-hour siege the gunman agreed to free the hostages.free someone/something from something Anti-vivisectionists last night freed a number of animals from a laboratory.\nMore examplesFewer examplesThe government pursued every official channel to free the hostages.She was freed from prison through the agency of her doctor.She never gave up the struggle to have her son freed from prison.Most political prisoners were freed under the terms of the amnesty.The campaigners appealed to the government to free the prisoners.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nfree verb\n(MAKE LOOSE)\n[ T ] to move or make loose someone or something that is caught or held somewhere: Both men were freed from the wreckage after a four-hour operation. In vain he tried to free the rope around his hands.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nfree verb\n(REMOVE LIMITS)\n[ T + obj + to infinitive ] to remove the limits or controls on someone or something: free someone to do something Her retirement from politics will free her (= provide her with enough time) to write her memoirs.\nSMART Vocabulary: related words and phrases\nLiberating, relaxing and releasing\nbreathe\nbreathe easier idiom\ncathartic\ncathartically\nchillax\ndecontrol\ndischarge\nlet someone loose idiom\nlet/set something loose idiom\nliberalization\nliberate\nliberated\nloose\nrelax\nrelax your grip/hold idiom\nturn someone/something loose idiom\nunbeholden\nunbind\nwalk\nwalk free idiom\nSee more results »\nfree verb\n(MAKE AVAILABLE)\n[ T ] to make something available for someone to use: They planned to extend the car park, freeing existing parking spaces for visitors.free something up Can you cancel my meetings – I need to free up the afternoon to write this report.\nSMART Vocabulary: related words and phrases\nAvailable and accessible\naccessibility\naccessible\naccessibly\nat your command idiom\navailability\ndrop\nnon-restricted\nnothing\nobtainable\non call idiom\non demand idiom\non/about your person idiom\nrelease\nseason\nstream\nunfreeze\nunfrozen\nunlock\nunobtainable\nup for grabs idiom\nSee more results »\nPhrasal verb\nfree someone from/of something\n-free suffix\n(NO CHARGE)\nused at the end of words to mean \"without having to pay\": They agreed to let us live there rent-free. Many banks are now offering interest-free overdrafts to students.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nsmall change\nsomething for nothing idiom\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\n-free suffix\n(WITHOUT)\nused at the end of words to mean \"without\": lead-free fuel No working environment is entirely stress-free. The journey was surprisingly hassle-free.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\nstarved\ntaken\nunaccompanied\nSee more results »\nfree adjective, adverb\n(NOT LIMITED)\nAdd to word list\nAdd to word list\n[ -er/-est only ] not limited or controlled: [ + to infinitive ] You are free to come and go as you please. [ + to infinitive ] Please feel free to ask questions. Free elections will be held in two months.\nfree adjective, adverb\n(NOT IN PRISON)\nnot or no longer a prisoner or an enslaved person: She left the court a free woman. In the 1700s, Mamaroneck was home to a free black community.\nfree adjective, adverb\n(NO CHARGE)\n[ not gradable ] costing nothing; not needing to be paid for: When you buy a dinner for over $10, you get a soda free. We will install your washing machine free of charge (= without cost).\nfree adjective, adverb\n(NOT HELD)\n[ -er/-est only ] not held in a fixed position or not joined to anything: He grabbed the free end of the rope. Mechanics checked the plane to see if any of the bolts had worked themselves free. Idioms\nfree and clear\nfree lunch\nfree ride\nfree adjective\n(NOT BUSY)\n[ not gradable ] not doing anything planned or important, or not being used: We have plans for Friday night but we’re free the rest of the weekend. I do a lot of reading in my free time.\nfree adjective\n(WITHOUT)\n[ -er/-est only ] not having something that is unwanted or unpleasant: After many months of treatment, she was declared free of disease.\nfree verb\n(RELEASE FROM PRISON)\n[ T ] to allow someone to leave a prison or place where they have been kept: The hostages were all freed.\nfree verb\n(RELEASE FROM LIMITS)\n[ T ] to release someone or something from limits or controls: [ + to infinitive ] The inheritance freed him to travel.\nfree verb\n(RELEASE FROM DUTY)\n[ T always + adv/prep ] to release someone from something that is unwanted or unpleasant: He longed to be freed of all his obligations.\nfree verb\n(MAKE LOOSE)\n[ T ] to release someone or something that is physically held or trapped: They worked to free the man trapped in the wreckage of his car. Phrasal verb\nfree up something\nwithout: tax-free toll-free The superintendent lives here rent-free.\nAdd to word list\nAdd to word list\ncosting nothing: They received two free return air-tickets every year. Tomorrow, shoppers will receive free samples of the store's famous chocolate chip cookies.free to/for sb The Bank's 3,030 ATMs would continue to be free to everyone.\nnot limited or controlled: We know that freedom and opportunity can truly thrive in a free society that is also a responsible society. The website spokesperson said that its opinions are protected as free speech.be free to do sth Members of the public buying direct from an insurer are free to inquire about its security rating.\nsomething that is free is available to be used because no one else is using it: Is this desk free?\nnot in a fixed position or not joined to anything: free to do sth With the autocue, your hands and head are free to communicate body language more powerfully.\nnot doing anything planned or important: free to do sth Are you free to attend tomorrow's board meeting?\nnot having something that is unwanted: free from sth Members must be free from politics and outside influences when making decisions.free of sth They proved through testing that their products were free of contamination.\nthere's no such thing as a free lunch\nused to say that nothing is free even if it appears to be, for example, if someone gives you something they probably want something back from you in return See also\nfree ride noun\nwithout having to pay for something: They are then given a business account free of charge by the bank. You can access the online database for free.\nto make something available for someone to use: free (up) sth The chairman has promised tough action to cut costs and free up funds to grow core businesses.\nto remove the limits or controls on someone or something: free sth from sth The basic aim is to free the housing market from council control.\nused at the end of words to mean 'without': It is supposed to be virtually pollution-free and produce both electricity and hydrogen. The returns are not risk-free.tax-/interest-/duty-free Your husband could put the money in a tax-free cash ISA."}