{"id":158994,"name":"freight","type":"noun","us_sound":"freɪt","us_link":"../audio/f/freight.mp3","uk_sound":"freɪt","uk_link":"../audio/f/ukfreeh025.mp3","content":"Add to word list\nAdd to word list\ngoods, but not passengers, that are carried from one place to another, by ship, aircraft, train, or truck, or the system of transporting these goods: carry freight The ship carries both freight and passengers. a freight companyair freight Kenyan farmers rely on air freight to sell their goods abroad.sea freight Will the goods be sent by air or sea freight?freight train Hundreds of freight trains come down these tracks each day.US The escaped prisoner made his getaway in a freight car on a train. Synonyms\nboatload\ncargo\nconsignment\ndelivery (OF PACKAGE ETC.)\nload\npayload\nshipment\ntruckload\nthe money paid for transporting goods\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosts & expenses\nto send goods by air, sea, or train: Grapes from this region are freighted all over the world.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\ntransported as part of a large group of things, by ship, aircraft, train, or truck: It would be much cheaper to send the goods freight.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nship\nshipment\nshipper\nshoot\nshoot something off\ntruck\nSee more results »\nAdd to word list\nAdd to word list\ngoods that are transported from one place to another by ship, aircraft, train, or truck: Most planes carry both freight and passengers.\nA freight train is a train that carries only goods.\nAdd to word list\nAdd to word list\ngoods that are transported by ship, aircraft, train, or truck, or the method of transporting these goods: The ship carries both freight and passengers. a freight company Will the goods be sent by air or sea freight? freight trains Everything was loaded into a freight car/wagon on the train. a freight carrier/hauler/operator\nthe money paid for transporting goods: If you buy the full three-piece set, we will pay the freight. See also\nairfreight noun\nbulk freight\ncarriage and freight\ncost and freight\ncost, insurance and freight\nto transport goods by aircraft, ship, train, or truck: Grapes from this region are freighted all over the world.\nSee also\nairfreight verb\nby ship, aircraft, train, or truck as part of a large group of things being transported: It would be much cheaper to send the goods freight."}