{"id":159072,"name":"frequency","type":"noun","us_sound":"ˈfriː.kwən.si","us_link":"../audio/f/frequency.mp3","uk_sound":"ˈfriː.kwən.si","uk_link":"../audio/f/ukfrene004.mp3","content":"frequency noun\n(HAPPENING)\nAdd to word list\nAdd to word list\n[ C or U ] the number of times something happens within a particular period, or the fact of something happening often or a large number or times: frequency of Complaints about the frequency of buses rose in the last year. the increasing frequency of terrorist attacks It's not the duration of his absences from work so much as the frequency that worries me.\nSMART Vocabulary: related words and phrases\nFrequency & regularity - general words\n(as) regular as clockwork idiom\n-ly\nclockwork\nendemically\nerratic\nerratically\nfitful\nirregularity\nirregularly\nlike clockwork idiom\nmany\non and off idiom\non-off\nperiodic\nperiodically\nprevalence\nreligiously\nstatedly\nunsynchronized\nwould\nSee more results »\nfrequency noun\n(LIGHT/SOUND/RADIO)\n[ U ]\n&#160; physics\n&#160; specialized the number of times that a wave, especially a light, sound, or radio wave, is produced within a particular period, especially one second: the frequency of light low frequency radiation The human ear cannot hear very high-frequency sounds.\n[ C ]\n&#160; media\n&#160; specialized a particular number of radio waves produced in a second at which a radio signal is broadcast: Do you know what frequency the BBC World Service is on?\nSMART Vocabulary: related words and phrases\nPhysics in general\naccelerator\nacoustics\nArchimedes\ncathode ray\ndynamics\nferromagnetism\nfundamental frequency\nharmonic\nmultifrequency\nphotometry\nphysical\nphysicist\nphysics\npost-Einsteinian\nquantum mechanics\nsine curve\nsinusoid\nsinusoidal\nspectroscopy\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: radio\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nAdd to word list\nAdd to word list\n[ C ]\n&#160; physics the number of times that a wave is produced within a particular period, esp. within one second: Dogs can hear very high frequencies.\nfrequency noun\n(COMMON)\n[ U ] the number of times something is repeated, or the fact of something happening often: Houses are sold here with greater frequency than in most other parts of the country.\nAdd to word list\nAdd to word list\nthe number of times something happens within a particular period, or the fact of something happening often or a large number of times: Once a week is a good frequency to back up all the data.the frequency of sth Cost-conscious retailers are reducing the frequency of cash collections. We can surely do better in reducing the frequency and intensity of emerging market financial crises.with greater/increasing frequency Skirmishes between privacy advocates and those collecting information are occurring with increasing frequency. Some trusts limit the frequency with which a loan can be modified.\nCOMMUNICATIONS the number of times that a wave, especially a sound or radio wave, is produced within a particular period, especially one second: The transmitter sends out a pulse of sound at a frequency of 6 kilohertz."}