{"id":159251,"name":"friendliness","type":"noun","us_sound":"ˈfrend.li.nəs","us_link":"../audio/f/usfrict003.mp3","uk_sound":"ˈfrend.li.nəs","uk_link":"../audio/f/ukfrica009.mp3","content":"friendliness noun [U]\n(PERSONAL QUALITY)\nAdd to word list\nAdd to word list\nB2 the quality of behaving in a pleasant, kind way towards someone: She showed great friendliness towards me. The city has a reputation for friendliness.\nthe fact of being friends with someone: Their friendliness did not in any way lessen their rivalry.\nMore examplesFewer examplesI can vouch for his friendliness and amenability.Some breeds of dog are known for their friendliness and ability to interact well with humans.We were so impressed by the friendliness of everyone we met on our travels.The media questioned him about his friendliness with Ms Clarke.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing friends & getting to know them\nfriendliness noun [U]\n(SUPPORT)\nthe quality of not harming someone or something, or of being good, helpful, or suitable for them or it: We rate all the routes for safety and child friendliness. Other aspects of the bid will be considered as well as cost, such as environmental friendliness.\nthe fact of supporting or wanting to help someone or something: The president is known for his friendliness towards oil companies.\nMore examplesFewer examplesThe hotel scored well for family friendliness.The government has been keen to emphasize its business friendliness.He is a Democrat known for his friendliness towards many parts of the Republican agenda.\nSMART Vocabulary: related words and phrases\nSuitable and acceptable\nable\nacceptability\nacceptable\nacceptably\naccepted\nconvenience\nconveniently\ncorrectly\ncorrectness\ndecent\ndecently\nfelicity\nlegitimate\npractical\nre-eligible\nrelevance\nrelevant\nrelevantly\nrespectability\nticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nSee\nfriendly"}