{"id":159245,"name":"friendly","type":"adjective","us_sound":"ˈfrend.li","us_link":"../audio/f/friendly.mp3","uk_sound":"ˈfrend.li","uk_link":"../audio/f/ukfrica010.mp3","content":"Add to word list\nAdd to word list\nA2 behaving in a pleasant, kind way towards someone: a friendly face/smilefriendly to/towards Our neighbours have always been very friendly to/towards us.friendly terms I'm on friendly terms with my daughter's teacher.friendly with Are you friendly with (= a friend of) Graham? Opposite\nunfriendly\nThesaurus: synonyms, antonyms, and examples\nbehaving in a kind and pleasant wayfriendlyI like his sister - she's so friendly.niceHer boyfriend is really nice.amiableShe was perfectly amiable.genialOur genial host led us to our room.congenialHe's very congenial and so quite likeable.\nSee more results »\nA friendly place is pleasant and makes you feel happy and comfortable: It's a friendly little restaurant.\nThesaurus: synonyms, antonyms, and examples\nmaking you feel happy and comfortablefriendlyThe pub has such a friendly atmosphere.congenialThere are many congenial places to stop on your way through the Lake District.convivialThese seaside inns have a convivial atmosphere.warmThe hostess gave us a warm welcome.\nSee more results »\nA friendly game or argument is one that you play or have for pleasure and in order to practise your skills, rather than playing or arguing seriously with the aim of winning: We were having a friendly argument about politics. The teams are playing a friendly match on Sunday.\nFriendly countries and friendly soldiers are ones who are not your enemies and who are working or fighting with you.\nMore examplesFewer examplesThe teacher greeted each child with a friendly 'Hello!'It's a very friendly bar with a nice relaxed atmosphere.We had a friendly exchange of views .There's no need to be frightened - he's a very friendly dog.They've always been very friendly towards me.\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitably\nhospitality\ninseparable\nintimacy\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing pleasure\nCompeting in sport\nInternational relations: international politics & government\nRelated word\nfriendliness\na game that is played for enjoyment and in order to practise, not with the aim of winning points as part of a serious competition: The rugby club has a friendly next week against the Giants.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ncontest\ndebate\nhead-to-head\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npostseason\npre-meeting\npro-am\nquiz\nspelling bee\nthe Premier League\nunder starter's orders idiom\nSee more results »\nused at the end of words to mean \"not harmful\": ozone-friendly aerosols dolphin-friendly tuna (= fish caught without harming dolphins) .\nused at the end of words to mean \"suitable for particular people to use\": a family-friendly restaurant\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\ninnocent\nprotected\nroadworthy\nsafe\nsafe space\nsafeguard\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEasiness and simplicity\nAdd to word list\nAdd to word list\nhaving an attitude or acting in a way that shows that you like people and want them to like and trust you: They were friendly people. She had a bright, friendly smile.\nIf you describe a place as friendly, you mean that it is pleasant and comfortable: It’s a very friendly city.\nIf countries or organizations are friendly, they are willing to help each other: Sometimes an ambassador will get too friendly with the local dictator.\nFriendly is also used as a combining form to mean easy to be comfortable with or not damaging: user-friendly technology a family-friendly film\nAdd to word list\nAdd to word list\nWORKPLACE, FINANCE relating to situations in which the owners or directors of a company are willing to sell it to another company that wants to buy it: a friendly merger/offer/takeover The board is seeking a higher price in exchange for entering into a friendly merger agreement. The friendly takeover will instantly force competitors to bring down their prices. Compare\nhostile\n(often used in compounds) easy to use or suitable for members of a particular group to use: Their website is particularly friendly to use. a customer-friendly bank a child-friendly working environment We need to continue to make the shopping area more pedestrian-friendly. See also\nfamily-friendly\nenvironmentally-friendly\nuser-friendly"}