{"id":159240,"name":"friend","type":"noun","us_sound":"frend","us_link":"../audio/f/friend.mp3","uk_sound":"frend","uk_link":"../audio/f/ukfrica007.mp3","content":"friend noun [C]\n(PERSON YOU LIKE)\nAdd to word list\nAdd to word list\nA1 a person who you know well and who you like a lot, but who is usually not a member of your family: best friend She used to spend hours chatting on the phone to her best friend.close friend Mira is one of my closest friends.oldest friend She's my oldest friend - we've known each other since we were five.family friend He's a family friend/friend of the family.friend of This restaurant was recommended to me by a friend of mine. We've been friends for years.good friend of José and Pilar are good friends of ours.good friends with We're good friends with José and Pilar.friends with She said that she did not want to be friends with me any more.just a good friend She said that she and Peter were just good friends (= they were not having a sexual relationship).just a friend He told his parents that Erin was just a friend.make a friend I've made a lot of friends in this job. He finds it difficult to make friends. Synonyms\nbuddy informal\nchum (FRIEND) old-fashioned informal\ncompanion (PERSON)\ncrony informal disapproving\nmate (FRIEND) UK informal\nmucker UK informal\npal informalCompare\nacquaintanceSee also\nbefriend\nThesaurus: synonyms, antonyms, and examples\na person you know well and likefriendWe've been friends for years. buddyHe's one of my dad's old war buddies.palThe heartthrob was spotted hanging with his Hollywood pals in L.A. mateUK He's out with his mates.\nSee more results »\nsomeone who is not an enemy and who you can trust: You don't have to pretend any more - you're among friends now.\nMore examplesFewer examplesIs he a friend of yours ?Come and meet my friend Laura.Is it okay if I bring a friend to the party?I got a call from an old college friend last night.He's not my boyfriend - we're just good friends!\nSMART Vocabulary: related words and phrases\nFriends, acquaintances & contemporaries\na friend in need is a friend indeed idiom\nacquaintance\nacquaintanceship\nacquainted\nacquainted with someone\namigo\ncompatriot\ncomrade\ncrony\ncrowd\nfair-weather friend\nfam\nflatmate\nintimate\nneighbour\noppo\npal\npeeps\npeer group\npen pal\nSee more results »\nfriend noun [C]\n(PERSON GIVING MONEY)\nsomeone who gives money to an arts organization or charity in order to support it: The Friends of the Royal Academy raised £10,000 towards the cost of the exhibition.\nSMART Vocabulary: related words and phrases\nOrganizations - charities\naid\nalms\nbenevolence\nbenevolent\nbenevolent society\nbutton day\ncharity\ncharity begins at home idiom\ncharity box\ndebt relief\nfood pantry\ngoodwill\nnon-profit\nnon-profit-making\nnot-for-profit\nOxfam\nthe Red Crescent\nthe Red Cross\nvolunteer\nwalkathon\nSee more results »\nIdioms\na friend in need is a friend indeed\nhave friends in high places\nwhat are friends for?\nwith friends like you, who needs enemies?\nto invite someone to be your friend on a social networking website: I friended her and sent her a message.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall\ncall (something) out\ncall someone in\nconvene\nconvoke\ninvite\ninvite someone over\ninvitee\nplus one\nrecall\nresummon\nsave\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\na\nQuaker\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\ndruid\nEpiscopalian\nevangelist\nfakir\nFranciscan\nmissionary\nMohammedan\nMoonie\nmoral majority\nMormon\nsectarianism\nSeventh-Day Adventist\nShia\nShiite\nSikh\nSee more results »\nAdd to word list\nAdd to word list\na person you know well and like a lot, but who is usually not a member of your family: I dreamed my school friends were being chased by a whale. Today I got a call from a friend of mine. Chloë was her best friend. I moved to California, made friends (= became friends with people), and started dating.\nFriend can also be used when you are speaking to someone: Well, friends, I think it’s time to go.\nA person or organization that is a friend to/of a group or organization helps and supports it: The president has been no friend to small business. The Senator was a friend of business interests."}