{"id":159283,"name":"fright","type":"noun","us_sound":"fraɪt","us_link":"../audio/f/fright.mp3","uk_sound":"fraɪt","uk_link":"../audio/f/ukfrica018.mp3","content":"Add to word list\nAdd to word list\nC1 the feeling of fear, especially if felt suddenly, or an experience of fear that happens suddenly: I lay in bed shaking with fright.give someone a fright You gave her such a fright turning the lights out like that.the fright of someone’s life You gave me the fright of my life (= a very severe fright), jumping out of the shadows like that!\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\ntake fright\nUK to feel fear or anxiety: Our dog took fright at the noise of the fireworks and ran indoors.\nSee more\nMore examplesFewer examplesThe sheep ran off in fright, bleating loudly.She let out a squeak of fright at the sight of the spider.I got such a fright when he flung open the door that I dropped my glass.With my bad heart, I should avoid nasty frights like that.We had an awful fright, I can tell you, but thank goodness we're safe now.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\nchill\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nIdiom\nlook a fright\nAdd to word list\nAdd to word list\nthe feeling of fear, esp. if felt suddenly, or an experience of fear which happens suddenly: [ U ] When the rescue team reached him, he was shaking with fright. [ C usually sing ] You gave her a fright turning the lights out like that."}