{"id":159311,"name":"frigidity","type":"noun","us_sound":"frɪˈdʒɪd.ə.t̬i","us_link":"../audio/f/usfrict007.mp3","uk_sound":"frɪˈdʒɪd.ə.ti","uk_link":"../audio/f/ukfrica027.mp3","content":"frigidity noun [U]\n(DISLIKING SEX)\nAdd to word list\nAdd to word list\n(used especially of women) the condition of not becoming sexually excited or not enjoying sex: Her mother went to see a psychiatrist for frigidity. Fear of another miscarriage had led to her frigidity.\nMore examplesFewer examplesHis aggressive sexuality did not help to overcome his wife's apparent frigidity. She counseled women widely on menopause, frigidity, and sexual relations in marriage. The psychologist believes sexual frigidity is rooted in childhood trauma.\nfrigidity noun [U]\n(UNFRIENDLINESS)\nthe fact of being unfriendly or very formal: He is doomed to repeat the frigidity of his father's life. The film's main theme is emotional frigidity.\nMore examplesFewer examplesMany actresses have a frigidity about them.She pushed people away with her meanness and frigidity.\nSMART Vocabulary: related words and phrases\nNot being friendly\nabrasive\nabrasively\nabrasiveness\nabruptly\nabruptness\naloof\nantagonistic\nestranged\nestrangement\nflintily\nforbidding\nforbiddingly\nfrigid\ngruff\nremoteness\nreserved\nreservedly\nself-contained\nself-containment\nwintry\nSee more results »\nfrigidity noun [U]\n(COLD)\nthe state of being extremely cold: We needed wet suits to protect ourselves from the frigidity of the ocean. They were exposed to a frigidity so intense that it seemed to burn. See\nfrigid\nMore examplesFewer examplesThe frigidity of the water made failure inevitable.It is better to err on the side of frigidity rather than allow wine to become too warm.\nSMART Vocabulary: related words and phrases\nCold\nBaltic\nbitingly\nbitter\nbitterly\nbone-chilling\nbrass\nchilled\ncooling\ndank\nfrigid\nfrostbite\nfrozen\nisothermally\nkeenness\nminus\noccluded front\nperished\npiercingly\npolar vortex\nwintry\nSee more results »"}