{"id":159355,"name":"fringe","type":"noun","us_sound":"frɪndʒ","us_link":"../audio/f/fringe.mp3","uk_sound":"frɪndʒ","uk_link":"../audio/f/ukfrill002.mp3","content":"fringe noun [C]\n(EDGE)\nAdd to word list\nAdd to word list\nC2 the outer part of an area: the southern fringe of the city the outer fringes of the prairie\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\ntip\nSee more results »\nfringe noun [C]\n(MINORITY)\na part of a group that is not very powerful, or is more extreme than the main group, and does not include many of its members : the radical fringes of the partylunatic fringe The pamphlet was generally dismissed as the work of a small lunatic fringe.fringe meeting He attended several of the fringe meetings at the conference.fringe candidate She's a fringe candidate who has no real chance of getting elected.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\npicayune\npicture\npiddling\npiddly\npiffling\nunserious\nunseriousness\nvenial\nvestigial\nvestigially\nSee more results »\nfringe noun [C]\n(DECORATION)\na decorative edge of hanging narrow strips of material or threads on a piece of clothing or material: a fringe around the edge of a tablecloth\nJannHuizenga/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDecorations for clothes\nbadged\nbadging\nbemedalled\nepaulette\neyelet\nflash\nfob\nfrill\nfrou-frou\nnacre\npiping\npussy bow\nshoulder pad\nspangle\nstud\nstudded\ntassel\ntrain\ntrim\ntrimming\nSee more results »\nfringe noun [C]\n(HAIR)\nC2 UK (US bangs) an area of hair hanging over the forehead (= part of the face above the eyes) that is cut shorter than the rest of the hair: a short fringe\nAlexandra Jursova/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nbowl cut\nchignon\nfade\nhair extension\nhaircut\nhairdo\nkiss curl\nplait\npompadour\npony\npudding basin\nrelaxed\nshake out\nsidelock\nundercut\nSee more results »\nfringe noun [C]\n(GOLF)\nin golf, an area surrounding the green where the grass is longer than the grass on the green but shorter than the grass on the fairway : As she walked up to the green to survey her next shot, the ball began to roll down to the fringe. Fans loudly applauded his 30-foot putt across the green from the fringe.\nMore examplesFewer examplesHe came up well short on his third shot, the ball stopping on the front fringe.Only the putting surfaces on the greens and the fringe remain green, while the fairways are brown.He needed to hit the ball hard enough to cross the fringe and yet softly enough for it not to roll miles past the pin.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfade\nfore\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nbe fringed with something\nIf a place is fringed with something, that thing forms a border along the edge: The river is fringed with wildflowers.\nSee more\nfringe noun [C]\n(EDGE)\nAdd to word list\nAdd to word list\nthe outer or less important part of an area, group, or activity: There is some industry on the fringes of the city. His organization is a fringe group (= one that represents the views of a small number of people).\nfringe noun [C]\n(DECORATION)\na decorative edge of narrow strips of material or threads on a piece of clothing or material\nfringe verb [T]\n(FORM EDGE)\nto form a border around the edge of something: The coast is fringed with islands and beaches.\nAdd to word list\nAdd to word list\nthe outer or less important part of an area, group, or activity: the northern/eastern/southwestern, etc. fringe The courthouse - on the northeastern fringe of downtown - will house district and bankruptcy courts.the fringe of sth The share price soared and took the company to the fringe of the FTSE 100. These activities are very much on the fringe of their global operation. the extremist/radical/political fringe"}