{"id":159476,"name":"frivolous","type":"adjective","us_sound":"ˈfrɪv.əl.əs","us_link":"../audio/f/frivolous.mp3","uk_sound":"ˈfrɪv.əl.əs","uk_link":"../audio/f/ukfrill014.mp3","content":"Add to word list\nAdd to word list\nbehaving in a silly way and not taking anything seriously: I think he sees her as a frivolous young woman. I'm sorry to be so frivolous. Opposite\nunfrivolous (SERIOUS)\nA frivolous activity or object is silly or not important rather than useful or serious: I feel like doing something completely frivolous today. They waste their time and money on frivolous things. Opposite\nunfrivolous (PLAIN)\nlaw\n&#160; specialized A frivolous claim is not based on fact or good reasons, or relates to something that is not at all important, so that it is obviously not likely to succeed or not worth taking to court: frivolous suit What steps can we take to reduce frivolous suits that overwhelm our judicial system?frivolous claim The proposal would impose penalties against lawyers who file frivolous claims. frivolous lawsuits Some business groups worry that the bill could invite frivolous lawsuits.frivolous litigation The new law led to a flurry of frivolous litigation.frivolous complaints The measure was introduced to protect police officers from frivolous complaints. It is for the court to decide whether the appeal is frivolous. Compare\nvexatiousOpposites\nnon-frivolous\nunfrivolous (LAW) specialized\nMore examplesFewer examplesI find him delightfully frivolous.It's frivolous to be planning a party at a time like this!You need to make time for a bit of frivolous fun.He saw their art as frivolous, too obsessed with beauty and pleasure.I'm not going to spend my money on something so frivolous. He called the legal action \"utterly frivolous\".\nSMART Vocabulary: related words and phrases\nNot showing careful thought\nairily\nairiness\nairy\nbang something out\nbash\nbash something out\nfrivolously\nill-conceived\nincaution\nincautious\nincautiously\noff the cuff idiom\npat\npreconceived\nshallow\nshallowly\nshallowness\nshoot from the hip idiom\nunreflective\nunthinking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseless and futile\nTaking legal action\nRelated words\nfrivolously\nfrivolousness\nAdd to word list\nAdd to word list\n(of people) behaving in a silly and foolish way, or (of activities or objects) silly or unimportant: I’m very frivolous – I just like to have fun. With our justice system there are a lot of frivolous cases that go to court. frivolously adverb us\nYour browser doesn't support HTML5 audio\n/ˈfrɪv·ə·lə·sli/\nWe don’t have a monthly budget, but we don’t spend frivolously either."}