{"id":159505,"name":"frizzle","type":"verb","us_sound":"ˈfrɪz.əl","us_link":"../audio/f/cdo0123usfriz0883.mp3","uk_sound":"ˈfrɪz.əl","uk_link":"../audio/f/cdo0123ukfriz1052.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to become or make something crisp (= pleasantly dry and hard) or slightly burned by frying or grilling: Put in the meat to frizzle and keep turning it until it is brown all over. Frizzle the vegetables in hot oil until crisp and slightly curly.\n[ I ] to make a sound like food cooking in hot fat: The leaves frizzled audibly in the pan. I could hear the bacon frizzling. Synonym\nsizzle\n[ I or T ] (also frizzle up) to become very dry and smaller or burned because of too much heat, or to make something do this: Cyclamen don't mind dry soil but they frizzle in full sun. Seedlings will frizzle up in harsh, direct sunshine. The sun was hot enough to frizzle your skin.\n[ I or T ] (of hair) to become very dry, curly, and not smooth or shiny, or to make hair do this: Her long red hair had frizzled in the hot sun. I tried to curl my hair with the tongs but they just frizzled it. Synonym\nfrizz\nMore examplesFewer examplesHeat some oil in a frying pan to frizzle the onions.The sun was hot enough to frizzle bacon.The fat should be hot enough to frizzle the chicken skin.Use the frying pan to frizzle some bacon.Frizzle the chicken pieces in a large casserole.\nSMART Vocabulary: related words and phrases\nPreparing food using heat\nair fryer\nbain-marie\nbaking\nbaking parchment\nbarbecue\nblanch\nboil\ncooking\ndeep fat fryer\ndeep-fried\ndeep-fry\ndone\npan-fry\nparboil\npoach\npoaching\nprecook\nsear\nwarm (someone/something) up\nwood-fired\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nDry weather, arid conditions & dryness\nBurning, burnt & on fire\nHair\nhair that is very dry, curly, and not smooth or shiny: Hairdressers use this serum to tame frizzles. The king wore a wig of majestic frizzle. Synonym\nfrizz\nSMART Vocabulary: related words and phrases\nHair\nanti-dandruff\nas bald as a coot phrase\nbaldness\nbedhead\ncoily\nfive o'clock shadow\nfuzzy\nmane\nshaggy\nsideburns\ntextured\ntousle\ntousled\ntress\ntuft\nunshorn\nwavily\nwavy\nwig\nwiry\nSee more results »"}