{"id":159591,"name":"from","type":"preposition","us_sound":"frɑːm","us_link":"../audio/f/from.mp3","uk_sound":"frɒm","uk_link":"../audio/f/ukfrom_001.mp3","content":"from preposition\n(PLACE)\nAdd to word list\nAdd to word list\nA1 used to show the place where someone or something starts: What time does the flight from Amsterdam arrive? The wind is coming from the north. She sent me a postcard from Bermuda. He took a handkerchief from his pocket. She took her hairbrush from her handbag and began to brush her hair. So did you really walk all the way from Smith Street?\nMore examplesFewer examplesI've just come from work.She took a letter out from her bag.We've walked all the way from Cheylesmore.She rang me from home.He sent me a card from Spain.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nfrom preposition\n(TIME)\nA1 used to show the time when something starts or the time when it was made or first existed: Drinks will be served from seven o'clock. The price of petrol will rise by 5p a gallon from tomorrow. Most of the tapestries in this room date from the 17th century.from something to something The museum is open from 9.30am to 6.00pm Tuesday to Sunday. from that day/time on C1 literary (also from that day/time onwards, US from that day/time onward)\nstarting at that time and then continuing: From that day on, she vowed never to trust him again.\nSee more\nMore examplesFewer examplesI'll be at home from four o'clock onwards.We'll be there from the beginning of March to the end of May.The oldest part of the church dates from the 13th century.Most of the shops are open from nine o'clock onwards.From tomorrow every expense form that you submit must first be signed by Roger.\nSMART Vocabulary: related words and phrases\nStarting from a particular time\nall along the line idiom\nas of/from idiom\ncount\ncut\ncut in\ndate\ndate back\ndate from something\nforth\nforward\nhenceforth\nhereafter\nhereinafter\nin future phrase\nline\nlive\nonward\nsince\nthen\nthereafter\nSee more results »\nfrom preposition\n(DISTANCE)\nA1 used to show the distance between two places: from something to something It's about two kilometres from the airport to your hotel. We're about a mile from home.\nMore examplesFewer examplesMy office is about a mile from here.I have shops two minutes from my front door.It's about half a kilometre from your hotel to the town centre.He lives five minutes from here.We're still over 50 miles from Cambridge.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nfrom preposition\n(ORIGIN)\nA1 used to show the origin of something or someone: \"Where are you from?\" \"I'm from Italy.\" I wonder who this card is from. Could I speak to someone from the sales department? She keeps in touch with her friends from college. What sort of reaction did you get from him?\nMore examplesFewer examplesHe's from Portugal.I'm from Brighton originally.I spoke to someone from the marketing department.I thought she was from Albania.Most of their furniture is from Italy.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nfrom preposition\n(MATERIAL)\nA2 used to show the material of which something is made: The desk is made from pine. Meringues are made from sugar and egg whites.\nMore examplesFewer examplesEarly pottery was made from earth and animal waste.French law allows only wine made from grapes in the Champagne region to be labelled champagne.They sell clothes made from hemp.Even the shoe box is made from recycled paper.They were the first British firm to start selling fleecy jackets made from recycled polyester.\nSMART Vocabulary: related words and phrases\nComprising and consisting of\nbe\ncompose\ncomposition\ncompositional\ncompositionally\ncomprise\nconsist in something\nconsist of something\nconstituent\nconstitute\nconstitution\nconstitutive\nform\nmake\nmake something up\nmulti-component\nof\nfrom preposition\n(LEVEL)\nused to show the level at which a range of things begins, such as numbers or prices: Prices start from £2.99.from something to something Tickets will cost from $10 to $45. The number of people employed by the company has risen from 25 to 200 in three years.\nMore examplesFewer examplesPrices range from £8000 to £10,000 depending on the model.Flights cost from $300 to $400.Replacements can cost anything from a hundred pounds to three hundred pounds.The population has fallen from three million to just under two and a half million in the last 30 years.Prices start from £4,500.\nSMART Vocabulary: related words and phrases\nBeginnings and starts\na baptism of/by fire idiom\nadvent\nbaptism\nbeginning\nbirth\ncommencement\ninception\ninitiation\ninstitution\nintroduction\njumping-off point\nonset\nsquare\nstarter\nstarting point\nstarting time\nthe thin end of the wedge idiom\nthin\ntrigger\nzero hour\nSee more results »\nfrom preposition\n(CHANGE)\nB2 used to show a change in the state of someone or something: from something to something Things went from bad to worse. The story was translated from Turish to English. Since the success of her first play, she has gone from strength to strength (= her success has continued to increase).\nMore examplesFewer examplesShe went from a size 18 to a size 12 in six months.He went from 15 stone to 13 stone.Pretty much overnight she went from being an office worker to an international star.She went from being an ordinary looking woman to being a great sex symbol.He was promoted from sales rep to area sales manager within the space of eight months.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nfrom preposition\n(CAUSE)\nB2 used to show the cause of something or the reason why something happens: He was rushed to hospital but died from his injuries. She made her money from investing in property. You could tell she wasn't lying from the fear in her voice. Wearing the correct type of clothing will reduce the risk from radiation.\nMore examplesFewer examplesDeaths from heart disease continue to rise every year.He was rushed to hospital suffering from severe burns.The number of deaths from road accidents continues to rise.She made a lot of money from property.He made a fortune from sales of the book.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nfrom preposition\n(CONSIDERING)\nused to show the facts or opinions you consider before making a judgment or decision: Just from looking at the clouds, I would say it's going to rain. It's difficult to guess what they will conclude from the evidence.\nMore examplesFewer examplesFrom her face this morning I'd say she's fairly unhappy.From what he said this morning I'd say there's little hope.Judging from last last week's performance I don't think they stand a chance.From looking at these figures, I'd say we're in trouble.What did they deduce from the evidence?\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nfrom preposition\n(REMOVE)\nused to show that someone has left a place, or that something has been removed or taken away: They were exiled from their homes during the war. Her handbag was snatched from her in the street. A refining process is used to extract usable fuel from crude oil.\nIf you take a smaller amount from a larger amount, you reduce the larger amount by the smaller one: When you subtract 3 from 16 you get 13.\nMore examplesFewer examplesI've brought this in from home.He took a knife from the drawer.Her baby was taken from her.We borrowed some money from my father.Two from ten equals eight.\nSMART Vocabulary: related words and phrases\nBackwards, sideways and back and forth\nanticlockwise\naside\nback and forth idiom\nback to front phrase\nbackward\nbackwardly\nhither and thither idiom\nlateral\nlaterally\nlibration\npull\nreverse\nround\nsaw\nstand\nstep\nstep aside\nswept-back\nthere and back idiom\nto and fro\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\nfrom preposition\n(DIFFERENCE)\nB1 used to show a difference between two people or things: His opinion could hardly be more different from mine. The two sisters are so similar that it's almost impossible to tell one from the other.\nMore examplesFewer examplesUniversity is very different from school.She's very different from her brother.In what ways is your jacket different from mine?Somehow the experience was different from how I'd imagined it.Her attitude is very different from mine.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nfrom preposition\n(POSITION)\nB2 used to show the position of something in comparison with other things, or the point of view of someone when considering a matter or problem: From the restaurant there is a beautiful view of the ocean. She was talking from her own experience of the problem. From our point of view, we do not see how these changes will be beneficial to the company.\nMore examplesFewer examplesYou can see the school from our bedroom window.I can see her back from where I sit.The view from the top was spectacular.From my point of view of course it would be extremely advantageous.From his perspective I dare say it sounds like a good idea.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nfrom preposition\n(PROTECTION)\nused to show what someone is being protected against: They found shelter from the storm under a large oak tree.\nMore examplesFewer examplesIt gives you immunity from all three diseases.This sort of clothing provides better protection from the elements.Those trees are better protected from the wind.We tried to find shelter from the rain.Vitamins are supposed to boost your immunity from infections.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nfrom preposition\n(PREVENTING)\nB2 used to show what someone is not allowed to do or know, or what has been stopped happening: He's been banned from driving for six months. For many years, the truth was kept from the public. The bank loan saved her company from bankruptcy.\nMore examplesFewer examplesMy mother stopped me from going out.It stops you from getting too drunk.It's preventing us from making progress.He's been banned from the area.It was a little secret that I kept from him all those years.\nSMART Vocabulary: related words and phrases\nFrom, out and outside\nal fresco\nbreath\ndoor\nexogenous\nexterior\nexteriority\nextrinsic\nextrinsically\nforth\nindigenous\nnon-indigenous\noutdoorsman\noutdoorswoman\noutdoorsy\nouter\noutermost\noutside\noutwith\nthence\ntherefrom\nSee more results »\nGrammar\nFromFrom is a preposition. …\nStarting pointWe use from to show the time or point in time when something starts: …\nOriginWe use from to refer to the place where someone or something starts or originates: …\nFrom … toWe use from … to to talk about ranges of different things: …\nfrom preposition\n(PLACE)\nAdd to word list\nAdd to word list\nused to show the place where someone or something starts moving or traveling: He took a handkerchief from his pocket. She ran away from home. The boy cried and cried, rocking from side to side (= to the left and right).\nfrom preposition\n(TIME)\nused to show the time when something starts or the time when it was made or first existed: Here’s a song from the 60s. I’m leaving a week from Thursday (= one week after Thursday). The class ends at 2:30 and from then on (= starting at that time and then continuing) I’ll be at the library.\nfrom preposition\n(DISTANCE)\nused to show the distance between two places: We’re about a mile from home.\nfrom preposition\n(ORIGIN)\nused to show the origin of something or someone: I heard music coming from my room. Someone from the bank just called. Where are you from? US Route 1 runs from Maine to Florida.\nfrom preposition\n(MATERIAL)\nused to show the material of which something is made: The desk is made from pine.\nfrom preposition\n(RANGE)\nused to show where a range of numbers, prices, or items begins: Tickets will cost from $10 to $45. Everyone from the oldest to the youngest had a good time.\nfrom preposition\n(CHANGE)\nused to show the original state of someone or something that is changing or has changed: She has been promoted from manager to vice president. Things went from bad to worse.\nfrom preposition\n(CAUSE)\nused to show the cause of something or the reason why something happens: Your child will benefit from piano lessons.\nfrom preposition\n(CONSIDER)\nused to show the facts or opinions you consider before making a judgment or decision: From looking at the clouds, I would say it’s going to rain later. It’s cheap, but not very good from a quality standpoint.\nfrom preposition\n(REDUCE)\nused to show that a larger amount is being reduced by a smaller amount: Three from sixteen is thirteen.\nfrom preposition\n(DIFFERENCE)\nused to show a difference between two people or things: It’s hard to tell one sister from the other.\nfrom preposition\n(PROTECTION)\nused to show what someone is being protected against: They found shelter from the storm under a large oak tree.\nfrom preposition\n(PREVENTION)\nused to show what someone cannot do or know, or what cannot happen: High rents keep us from moving to a larger apartment. Idioms\ncome from the heart\nfrom A to Z\nfrom far and wide\nfrom head to toe\nfrom one day to the next\nfrom scratch\nfrom the bottom of your heart\n(straight) from the horse’s mouth\nfrom time to time\nfrom top to bottom"}