{"id":159623,"name":"front","type":"noun","us_sound":"frʌnt","us_link":"../audio/f/front.mp3","uk_sound":"frʌnt","uk_link":"../audio/f/ukfrom_004.mp3","content":"front noun [C usually singular]\n(PLACE)\nAdd to word list\nAdd to word list\nA2 the part of a building, object, or person's body that faces forward or is most often seen or used: The front of the museum is very impressive. He spilled soup all down the front of his shirt. He was lying on his front. The actor walked out to the front of the stage.shop front The shop front occupies a very prominent position on the main street.\nA2 the part of a vehicle that is nearest to its direction of movement: in the front Do you want to sit in the front (= next to the driver)? If we sit near the front of the bus, we'll have a better view.\nthe outside part or cover of a book, newspaper, or magazine: on the front There was a picture of the Trevi fountain on the front of the book.\none of the first pages in a book: in the front There's an inscription in the front of the book. in front\nB1 further forward than someone or something else: The car in front suddenly stopped and I slammed on the brakes.\nUK winning a game or competition: By half time the Italians were well in front.\nSee more in front of\nA2 close to the front part of something: There's parking space in front of the hotel.\nA2 where someone can see or hear you: Please don't swear in front of the children.\nSee more up front\nIf you give someone an amount of money up front, you pay that person before they do something for you: He wants all the money up front or he won't do the job.\nSee more\nMore examplesFewer examplesHe elbowed his way to the front of the crowd.There are two entrances - one at the front and one round the back.When the doors opened she barged her way to the front of the queue.This plan shows the front, side and back elevations of the new supermarket.Her name was emblazoned across the front of the theatre.\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nback\nbase\nbases\nbed\ncrust\nescutcheon\nface\nmeniscus\nmulti-sided\nnap\nobverse\noutside\noverlay\nplate\nrear\nside\nsubstrate\nsuperficialis\nsurface area\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEdges & extremities of objects\nRoad vehicles in general\nBooks & parts of books\nfront noun [C usually singular]\n(AREA OF ACTIVITY)\na particular area of activity: How are things on the work front? (= Is the situation at work satisfactory?) She's very creative on the design front (= she is very good at design).\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nfront noun [C usually singular]\n(APPEARANCE)\n[ C usually singular ] the character or qualities that a person or organization appears to have in public that are different from their real character or qualities, and whose purpose is often to deceive people or hide an illegal activity: Don't be fooled by his kindness and sensitivity - it's just a front. She presents such a cheerful front that you'd never guess she's ill. The machinery company was a front operation for arms smuggling.front for Several trading companies were set up in the early 1960s to act as fronts for money-laundering operations.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nstudiedly\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFaking & pretending\nfront noun [C usually singular]\n(LAND)\n[ C usually singular ] UK land near the sea or a lake, or the part of a town near the beach that often has a wide road or path along it: Let's go for a stroll along the front. The company specializes in building lake-front property.\nSMART Vocabulary: related words and phrases\nCoasts & beaches\nbarrier reef\nbeachcomb\nbeachcomber\nbeachcombing\nbeachfront\ncoastal\nesplanade\nfrontage\ngroin\nprom\nriviera\nseafront\nshore\nstrand\nswash\nthe Amalfi Coast\nthe seashore\nthe seaside\ntide pool\ntombolo\nSee more results »\nfront noun [C usually singular]\n(WEATHER)\n[ C ]\n&#160; environment\n&#160; specialized the place where two masses of air that have different temperatures meet: cold front A cold front is expected to bring showers and thunderstorms this weekend.warm front A warm front is approaching from the west.\nSMART Vocabulary: related words and phrases\nWeather & climate - general words\naneroid barometer\nanthelion\natmospherics\naurora\naurora australis\naurora borealis\nclimate\necozone\nequatorial\nforecast\nglaciology\ninterglacial\nisotherm\nlow-pressure\nmercury\nmeteorologically\nmicroclimate\npollen count\nrarefied\nspell\nSee more results »\nfront noun [C usually singular]\n(AREA OF FIGHTING)\nthe place where fighting takes place in a war: He was a soldier on the Western front in World War I.\nSMART Vocabulary: related words and phrases\nPlaces involved in military activity\nair bridge\nair corridor\nbases\nBastille\nbattlefield\nbattleground\ncamp\nemplacement\nenceinte\nfort\nfront-line\ngarrison\nMartello tower\nmulti-front\nobservation post\nobstacle course\nparade ground\nPX\ntheatre\nunmanned\nSee more results »\nGrammar\nIn front ofThe prepositional expression in front of means ‘close to the front of something or someone’. It is the opposite of behind: …\nOpposite or in front of?Opposite as a preposition means ‘in a position facing someone or something but on the other side’: …\nIdiom\nout front\nB1 in or at the front of something: One of his front teeth is missing. I'd like seats on the front row. a dog's front paws Synonyms\nanterior specialized\nfore\nforward (DIRECTION)\nSMART Vocabulary: related words and phrases\nGeneral location and orientation\nabout\nalong\nanterior\naround\nback onto something\nfix\nforward\nin situ\nleft\nleft-hand\nnearside\nnoncentral\noffside\non-site\nposition\nright-hand\nright/wrong way round idiom\nround\nside-on\nspot\nSee more results »\nIdiom\non the front burner\n[ I or T ] (also front onto) If a building or area fronts (onto) a particular place, it is near it and faces it: All the apartments front onto the sea.\n[ T ] to lead an organization or group of musicians: She fronts a large IT company. be fronted with\nIf a building is fronted with something, its surface is covered with it: The kitchen has oak cabinets fronted with glass.\nSee more\n[ T ] In basketball, if a player fronts an opposing player, they stand in front of them, between the opposing player and another opposing player who has the ball, rather than between the player and the basket: The forwards played man-to-man, fronting the post players. The Wildcats often defend the low post by fronting players.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\ngive\nkitty-corner\non\nopposite\nother\noverland\nthrough\nthru\nto\ntrans\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nManaging and organizing\nBasketball, netball & volleyball\nPhrasal verb\nfront for something\na group of people sharing a political belief who perform actions in public to achieve their aims: The National Front is an extremely right-wing political party in Britain. The Animal Liberation Front has claimed responsibility for releasing the monkeys from the laboratory.\nSMART Vocabulary: related words and phrases\nPolitical movements & groups\nalt-right\nANC\nanti-Bolshevik\nanti-Bolshevism\nanti-capitalism\nbig tent\nblack bloc\nBlairite\nBlue Dog\nleft-winger\nleftism\nleftist\nleftward\nlefty\nsectarian\nsectarianism\nsegregationist\nSinn Fein\nthe awkward gang idiom\nthe SDLP\nSee more results »\nfront noun\n(PLACE)\nAdd to word list\nAdd to word list\n[ C ] the most forward position or most important side of an object or surface: The front of the house faces Peach Street. My little boy can’t eat ice cream without most of it dripping down the front of his shirt. You’ll find the date of publication in the front of the book. I like to sit near the front of the plane so that I can be among the first to get off. Do you want me to lie on my front (= the side of my body that faces forward) or on my back? Would you like me to sit in the front (= most forward seat) or the back of the car? Dad pushed Matthew in the stroller while David and Stephen walked in front (= farther forward than the others) .\n[ C ] in a position close to the most forward or most important part: They chatted for a while in front of the apartment house. in front of\nSomeone who is in front of someone else is in a position directly forward of that person: Carla and Bob were sitting in front of me at the movie.\nfront noun\n(AREA OF ACTIVITY)\n[ C usually sing ] a particular area of activity: Now let’s take a look at news on the health front. I’m not having much luck on the job front.\n[ C usually sing ] During a war, a front is a particular place of directed military activity.\nfront noun\n(APPEARANCE)\n[ U ] an appearance that a person chooses to show to others instead of showing his or her true feelings: Even though he doesn’t like his in-laws, he always puts on a cheerful front when they come to visit.\n[ U ] A front can also be a person, group, or thing used to hide the real character of a secret or illegal activity: The society was a front for making illegal political contributions.\nfront noun\n(WEATHER)\n[ C ]\n&#160; earth science the advancing edge of a mass of cold or warm air: a cold/warm front\nfront noun\n(POLITICAL GROUP)\n[ C usually sing ] an organization of political groups united to put forward ideas or programs that they share: The Animal Liberation Front promised to continue targeting the company until all animal testing stops. Idiom\nin front of\nfront verb [I/T]\n(PLACE)\nto face or be next to something: [ I/T ] Houses fronting (on) the ocean are the most expensive.\nfront adjective [not gradable]\n(PLACE)\nin or at the front of something: I’d like seats in the front row of the balcony. Alice designed the front cover of the book. I always go in through the front door instead of going around to the back. Idiom\non the front burner\nAdd to word list\nAdd to word list\n[ C ] the part of a building that faces or is nearest to the street or that is most often seen or used: shop/store front The shop front occupies a very prominent position on the main street.at the front of sth The new styles were displayed at the front of the store.\n[ S ] used to refer to a particular area of activity: How are things on the work front? She's very creative on the design front.\n[ S ] behaviour that a person shows in public and that is different from their real character: Don't be fooled by his apparent sympathy - it's just a front.\n[ C, usually singular ] a person or organization that is used to deceive people or to hide an illegal activity: The trading company was set up in 2001 to act as a front for money-laundering operations.\nin front (of sb/sth)\nmore successful than other people or companies doing the same job or in the same industry: Major brand leaders got out in front first and have set the pace for other companies.\nup front\nif you give someone an amount of money up front, you pay them before they do something for you: He wants all the money up front or he won't do the job.\nfront of mind (also top of mind)\nMARKETING if a brand, product, or company is front of mind, it is the first one that people think of when they are considering buying something: We need advertising that will keep the brand front of mind and help reinforce brand values.\nconsidered very important and usually thought of first by people: Food safety issues affect everyone and are becoming increasingly front of mind with consumers today. See also\nupfront adjective\non the front burner\nconsidered very important and to be dealt with or given attention before other things: keep/put sth on the front burner We need to put this project on the front burner and finish it as soon as possible.\n[ I or T ]\n&#160; PROPERTY\n&#160; (also front on/onto) if a building or area fronts or fronts on or onto a particular place, it is near it and faces it: The store fronts the central square at the mall.\n[ T ] to lead an organization, or be the person with the main responsibility for a particular project, etc.: She fronts a large IT company in Germany. They appointed him to front the takeover bid. Phrasal verb\nfront for sth"}