{"id":159783,"name":"frown","type":"verb","us_sound":"fraʊn","us_link":"../audio/f/frown.mp3","uk_sound":"fraʊn","uk_link":"../audio/f/ukfrom_025.mp3","content":"Add to word list\nAdd to word list\nC2 to bring your eyebrows together so that there are lines on your face above your eyes, often while turning the corners of your mouth downwards, showing that you are annoyed, worried, sad, or thinking hard: frown at She frowned at me, clearly annoyed. He frowned as he read the instructions, as if puzzled.\nMore examplesFewer examplesDon't frown so - it spoils your pretty face.Frowning, she started to search in her bag for the lost ticket.People who frown a lot or have very expressive faces usually develop deep lines as they get older.What are you frowning about now? What have I done?The teacher frowned and drew her red pen firmly across the page.\nSMART Vocabulary: related words and phrases\nGrimacing and frowning\nbitchy resting face\ncloud\ncurl\ndeath stare\nevil\neye\neye-roll\neye-rolling\nif looks could kill... idiom\nknit\nknit your brow/brows idiom\nlook daggers at someone idiom\npout\npurse\nroll\nscowlingly\nscrew\nscrunch\nsneer\nwitheringly\nSee more results »\nPhrasal verb\nfrown on/upon something\nan expression in which you bring your eyebrows together so that there are lines on your face above your eyes, often while turning the corners of your mouth downwards, showing that you are annoyed, worried, sad, or thinking hard: \"Leave me alone!\" she said with a frown.\nMore examplesFewer examplesHe cocked his head on one side with a slight frown.The boy gave a frown and scratched his head thoughtfully.The frown on his face showed that he was struggling with a difficult problem.His brows were drawn together in a deep frown.Seeing the headmistress's frown, the girl quickly sat down again.\nSMART Vocabulary: related words and phrases\nGrimacing and frowning\nbitchy resting face\ncloud\ncurl\ndeath stare\nevil\neye\neye-roll\neye-rolling\nif looks could kill... idiom\nknit\nknit your brow/brows idiom\nlook daggers at someone idiom\npout\npurse\nroll\nscowlingly\nscrew\nscrunch\nsneer\nwitheringly\nSee more results »\nAdd to word list\nAdd to word list\nto bring your eyebrows together so that lines appear on your face above your eyes, in an expression of anger, disapproval, or worry: For a moment he had frowned and looked annoyed. frown noun [ C ] us\nYour browser doesn't support HTML5 audio\n/frɑʊn/\nPierre’s mouth tightened with a small frown. Phrasal verb\nfrown on something/someone"}