{"id":159814,"name":"frozen","type":"verb","us_sound":"ˈfroʊ.zən","us_link":"../audio/f/frozen.mp3","uk_sound":"ˈfrəʊ.zən","uk_link":"../audio/f/ukfrom_028.mp3","content":"Add to word list\nAdd to word list\npast participle of\nfreeze\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nglacially\nglacier\nhail\nhailstorm\niceberg\nicicle\nicy\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nspindrift\nSee more results »\nB1 (of liquid) turned into ice: They skated over the frozen lake.frozen solid The river is frozen solid for weeks in winter.\nFrozen food has been preserved by freezing: We don't have any fresh vegetables, only frozen peas. Dinner was a frozen pizza.\nFrozen ground is very hard because the liquid in it has turned to ice: Winter is a good time to plant trees, but make sure the ground is not frozen.\nB1 If a person, or a part of their body is frozen, they are, or it is, very cold: I'm frozen - could you close the window?frozen stiff After walking through the snow, my feet were frozen stiff. Synonym\nfreezing\nThesaurus: synonyms, antonyms, and examples\nfeeling coldcoldYour hands are cold!feel the coldShe's someone who feels the cold, that's why she's always bundled up.chillyThe sun's gone down and now I feel quite chilly.freezingShut the windows, I'm freezing!frozenMy nose is frozen after that walk - I should have worn a scarf.\nSee more results »\nnot moving at all or feeling unable to move, usually because of fear: He was too frozen with fear to do anything. She felt frozen, unable to decide which way to go. Their mouths were frozen in expressions of shock.\nMore examplesFewer examplesThere was a frost last night and the puddles are frozen.It was so cold in the tent my orange juice was completely frozen in the morning.It's usually cheaper to buy frozen meat.She pulled a ready-made frozen meal from the freezer.Defrost previously frozen chicken thoroughly before cooking.Frozen vegetables can be cooked quickly and don't generally need any preparation.Construction work is easier when the ground is frozen and heavy equipment can move across the iced-over bogs.\nSMART Vocabulary: related words and phrases\nPrecipitation: snow & ice\nanti-icing\navalanche\nbe snowed in idiom\nbe snowed up idiom\ndrifting\nglacially\nglacier\nhail\nhailstorm\niceberg\nicicle\nicy\npermafrost\nsleet\nslushy\nsnow line\nsnowfall\nsnowflake generation\nsnowpack\nspindrift\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreserving & storing food\nSoil\nCold\nImmobility\nAdd to word list\nAdd to word list\npast participle of freeze\nAdd to word list\nAdd to word list\nwhen food is frozen, it is stored at a very low temperature in order to keep it fresh: He started a business that supplied frozen food to caterers.\nFINANCE when a bank account, etc. is frozen, it is not able to be used because of a government or court order: Court bailiffs have ordered that the company's bank accounts be frozen while the fraud charge is investigated."}