{"id":159876,"name":"fruit","type":"noun","us_sound":"fruːt","us_link":"../audio/f/fruit.mp3","uk_sound":"fruːt","uk_link":"../audio/f/ukfruga004.mp3","content":"fruit noun\n(PLANT PART)\nAdd to word list\nAdd to word list\nA1 [ C or U ] the soft part containing seeds that is produced by a plant. Many types of fruit are sweet and can be eaten: Apricots are the one fruit I don't like. Oranges, apples, pears, and bananas are all types of fruit. Would you like some fruit for dessert?in fruit The cherry tree in our garden is in fruit (= it has fruit growing on it).exotic fruit I like exotic fruit, like mangoes and papayas.fresh fruit How many pieces of fresh fruit do you eat in a day? fruit treesfruit and vegetable He runs a fruit and vegetable stall in the market. Compare\nvegetable\ndcdr/E+/GettyImages\n[ C ]\n&#160; biology\n&#160; specialized the part of any plant that holds the seeds\nMore examplesFewer examplesYour fruit and vegetables will be weighed at the checkout.Vitamin C is found in oranges and other citrus fruit.The pear tree they planted has never borne fruit .Bananas and other soft fruits bruise easily.Soak the fruit in brandy for a few hours before you add it to the mixture.\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nfruit noun\n(RESULT)\nthe fruit/fruits of something\nC2 the pleasant or successful result of work or actions: This book is the fruit of 15 years' research.\nSee more\nfruit noun\n(PERSON)\n[ C ] slang a gay man. Many people consider this word offensive.\nIdiom\nfruits of the earth\nWhen a plant fruits, it produces fruit: Over the last few years, our apple trees have been fruiting much earlier than usual.\nSMART Vocabulary: related words and phrases\nPlant reproduction\nanther\nasexual reproduction\nasexuality\nasexually\nbarrenness\nbreeder\nchasmogamous\ngerminate\npalynology\npistillate\npollinate\npollination\npollinator\npropagate\nself-incompatible\nself-pollination\nsexlessly\nsiltation\nsporangium\nstamen\nSee more results »\nfruit noun\n(PLANT PART)\nAdd to word list\nAdd to word list\n[ C/U ] an edible and usually sweet product of a plant or tree that contains seeds or a pit (= large hard seed): [ C ] We eat a lot of fruits and vegetables at our house. [ U ] I usually eat a piece of fresh fruit with my lunch.\n[ C/U ]\n&#160; biology Fruit is also the part of a plant that contains the seed from which a new plant can grow.\nfruit noun\n(RESULT)\n[ C usually pl ] the result of work or actions, esp. if pleasant or successful: The fruits of economic growth are starting to make a difference in the lives of many workers."}