{"id":159965,"name":"frustration","type":"noun","us_sound":"frʌsˈtreɪ.ʃən","us_link":"../audio/f/frustration.mp3","uk_sound":"frʌsˈtreɪ.ʃən","uk_link":"../audio/f/ukfruga022.mp3","content":"frustration noun\n(FEELING)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the feeling of being annoyed or less confident because you cannot achieve what you want, or something that makes you feel like this: frustration at I could sense his frustration at not being able to help. This job has more than its fair share of frustrations.\nThesaurus: synonyms, antonyms, and examples\nangerangerHe vented his anger by kicking the door.annoyanceSmoke can cause annoyance by making clothes and hair smell unpleasant.irritationShe expressed irritation with her son's attitude.frustrationA lot of children's behaviour problems are caused by sheer frustration.furyThe speech provoked fury in some parts of the world.rageHe was filled with jealous rage when he saw his girlfriend talking to another man.\nSee more results »\nMore examplesFewer examplesPlease don't shout - there's no need to vent your frustration on me.There is a sense of frustration among the players.Try not to let your frustration spoil the event.His failure to get the right job has a been a great frustration to him.Their frustration was evident to all.\nSMART Vocabulary: related words and phrases\nBoredom, tedium and boring things\nbanality\nblandness\nboredom\nbromide\ncabin fever\ncommonplace\ndullsville\nennui\nflatness\ninsipidness\njejune\nrestlessness\nsame\nscreed\nsnooze\nsnoozefest\nsterility\nthe same old thing idiom\ntorpor\nturgid\nSee more results »\nfrustration noun\n(PREVENTING)\n[ U ] the fact that something prevents plans or efforts from being successful\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nbottleneck\nderail\nfireproof\nhead off\nhinder\nhogtie\nhold back\nhold/keep someone/something at bay idiom\nprevent\npreventable\npreventative\nprevention\nprevention is better than cure idiom\nscuttle\nsmother\nSee more results »\nfrustration noun\n(ANNOYING SITUATION)\nAdd to word list\nAdd to word list\n[ C/U ] disappointment or discouragement, or a discouraging situation: [ U ] He finally quit in frustration. [ U ] The teacher confirmed widespread frustration with the lack of up-to-date textbooks. [ C ] You have to learn to cope with these frustrations.\nfrustration noun\n(PREVENTING SUCCESS)\n[ U ] the act of preventing something from being achieved: Our efforts to get funding to save the lighthouse met with frustration."}