{"id":159959,"name":"frustrated","type":"adjective","us_sound":"ˈfrʌs.treɪ.t̬ɪd","us_link":"../audio/f/frustrated.mp3","uk_sound":"frʌsˈtreɪ.tɪd","uk_link":"../audio/f/ukfruga020.mp3","content":"Add to word list\nAdd to word list\nC1 feeling annoyed or less confident because you cannot achieve what you want: Are you feeling frustrated in your present job?\nThesaurus: synonyms, antonyms, and examples\nangryangryIt does no good to get angry at him - it won't change the situation at all.soreUS He's still sore about the way things turned out.annoyedHe was annoyed with her for being late.irritatedI was irritated that he didn't thank me.\nSee more results »\n[ before noun ] used to say that a person who has not succeeded in a particular type of job: Frustrated writers often end up in publishing.\nThesaurus: synonyms, antonyms, and examples\nnot achieving wealth, popularity, or successunsuccessfulHe tried for years to get his work published before accepting he was a commercially unsuccessful writer.failedShe was a failed singer.frustratedHe was a legendary actor, but a frustrated director.strugglingThe struggling actor was cut from yet another film.on the ropesAfter that scandal, the MP is really on the ropes.\nSee more results »\n[ before noun ] A frustrated emotion is one that you are not able to express: her frustrated love for him\n[ before noun ] unhappy because you are not having as much sex as you want\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nlugubriously\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nwoeful\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnsuccessful (people and things)\nControlling emotions\nfrustrated adjective\n(ANNOYED)\nAdd to word list\nAdd to word list\nannoyed, disappointed, or discouraged: You just get so frustrated when everything in your vegetable garden is ripe and then the bugs get at them. Frustrated residents protested the situation.\nfrustrated adjective\n(UNSUCCESSFUL)\n[ not gradable ] desiring something but not able to achieve it: I’m a frustrated songwriter at heart."}