{"id":160076,"name":"fuel","type":"noun","us_sound":"ˈfjuː.əl","us_link":"../audio/f/fuel.mp3","uk_sound":"ˈfjuː.əl","uk_link":"../audio/f/ukfucke008.mp3","content":"Add to word list\nAdd to word list\nB1 [ C or U ] a substance that is used to provide heat or power, usually by being burned: Wood, coal, oil, petrol, and gas are all different kinds of fuel. Plutonium is a fuel used to produce nuclear energy.nuclear fuel The spent nuclear fuel is being stored on site at the nuclear plant.unleaded fuel Will unleaded fuel affect the performance of my car?fuel consumption The new exhaust system, it is claimed, will lower fuel consumption.\n[ U ] anything that keeps people's ideas or feelings active, or makes them stronger: add fuel to Reports in today's newspapers have added fuel to the controversy (= made it worse).\nMore examplesFewer examplesToday's vehicles use two kinds of fuel - petrol and diesel.The new tax will put 8% on fuel prices.Lead is added to fuel to make car engines run more smoothly.The car blew up when flames reached its fuel tank.We'll have to stop for fuel on the way to the airport.\nSMART Vocabulary: related words and phrases\nFuels\nbioethanol\nbiofuelled\nbiomaterial\nbriquette\ncharcoal\nCHP\ncoal\ncoalification\ncogeneration\ngasometer\nguzzle\nhickory chips\nmesquite\nnon-fuel\nnon-petroleum\nnuclear\nnuclear power\noil-fired\npropellant\nsolar panel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing things to happen\nIdiom\nadd fuel to the fire\nto supply a system with a substance that can be burned to provide heat or power: be fueled by Our heating is fuelled by gas. We have a gas-fuelled heating system. petrol/hydrogen-fuelled cars\nSomething that fuels a feeling or a type of behaviour increases it or makes it stronger: The rapid promotion of the director's son has itself fuelled resentment within the company.fuel speculation The president's speech fuelled speculation that she is about to resign.\nMore examplesFewer examplesA huge amount of hydrogen is needed to fuel to rocket.The rumours have been fuelled by speculation in the press.The diesel in this tank fuels both of the ship's motors.The engine had been converted so that it could be fuelled by unleaded petrol.Her ambition was fuelled by her older sister's achievements.\nSMART Vocabulary: related words and phrases\nFuels\nbioethanol\nbiofuelled\nbiomaterial\nbriquette\ncharcoal\nCHP\ncoal\ncoalification\ncogeneration\ngasometer\nguzzle\nhickory chips\nmesquite\nnon-fuel\nnon-petroleum\nnuclear\nnuclear power\noil-fired\npropellant\nsolar panel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making stronger\nAdd to word list\nAdd to word list\na substance such as oil or gas that is used to provide heat or power, usually by being burned\nto provide power to something: The heating system is fueled by natural gas.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; NATURAL RESOURCES a substance which is used to provide heat or power, usually by being burned: oil, gas and other kinds of fuel nuclear fuel fossil fuelsfuel costs/prices Domestic fuel costs have risen sharply over the past few months. The new exhaust system, it is claimed, will lower fuel consumption.\n[ U ] anything that keeps people's ideas or feelings active, or makes them stronger: The news reports were designed to add fuel to the debate over interest rates.\nto supply a system with a substance that can be burned to provide heat or power: fuelled by sth Our heating system is fuelled by gas. The company is working on the development of methane-fuelled vehicles.\nto increase a feeling or a type of behaviour or make it stronger: The rapid promotion of the director's son has itself fuelled resentment within the company. The press release fuelled speculation that interest rates were about to rise."}