{"id":160168,"name":"fulfil","type":"verb","us_sound":"fʊlˈfɪl","us_link":"../audio/f/fulfill.mp3","uk_sound":"fʊlˈfɪl","uk_link":"../audio/f/ukfucke016.mp3","content":"fulfil verb [T]\n(MAKE HAPPEN)\nAdd to word list\nAdd to word list\nC1 to do something that is expected, hoped for, or promised, or to cause it to happen: fulfil a need/requirement A school fails if it does not fulfil the needs/requirements of its pupils.fulfil someone's ambition At the age of 45, she finally fulfilled her ambition to run a marathon.fulfil a function Zoos fulfil an important function in the protection of rare species.fulfil someone’s duty He has failed to fulfil his duties as a father.fulfil criteria We're looking for a very specific sort of person and this woman seems to fulfil all of our criteria.fulfil an expectation So did the course fulfil all your expectations? We're suing our suppliers for failing to fulfil their contract.\nThesaurus: synonyms, antonyms, and examples\nto achieve somethingachieveAfter years of rejection, she finally achieved success on the big screen.fulfilI fulfilled my dreams of becoming a marine biologist.realizeUK There was nothing to prevent her from realising her ambitions.come trueI worked so hard to be a doctor, and now my dream has come true.accomplishThese goals will be extremely hard to accomplish.attainAfter years of struggle, the nation attained independence.\nSee more results »\nMore examplesFewer examplesShe doubts whether she'll ever be able to fulfil her ambition.The captain was demoted to sergeant for failing to fulfil his duties.As a child I was quite a good dancer, but I didn't fulfil my early promise.Traditional ways of life fulfilled both economic and spiritual needs.As a partner he fulfils all my main criteria.\nSMART Vocabulary: related words and phrases\nCausing things to happen\n-induced\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplementation\nin\ninaugurate\ninauguration\npioneer\nreactivate\nrealization\nrealize\nreattribute\nreawaken\nrender\nseed\nspark\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSucceeding, achieving and fulfilling\nfulfil verb [T]\n(SATISFY)\nC2 to satisfy someone or to make someone feel happy: I don't feel that my present way of life really fulfils me. I've finally found a job in which I can fulfil myself (= completely develop my abilities and interests).\nMore examplesFewer examplesMotherhood fulfilled me.The job pays well but it doesn't fulfil me.I'm looking for work that will fulfil me.Spiritually, my way of life didn't fulfil me.Fame and fortune was all well and good but it didn't fulfil me.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomey\nindulgent\nindulgently\njovial\njovially\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\nAdd to word list\nAdd to word list\nto do something that is necessary, or to cause it to happen: fulfil a contract We're suing our suppliers for failing to fulfil their contract.fulfil a duty/an obligation/a promise It is vital that we fulfil our obligations to creditors.fulfil the terms/conditions/requirements They claimed that the goods did not fulfil the terms of the agreement.fulfil a need The new product has been thoroughly researched and will definitely fulfil a need that customers have expressed.\nto do something that is expected, hoped for, or promised, or to cause it to happen: fulfil your potential/promise He enjoys seeing his staff fulfil their potential. Some of my shares have yet to fulfil their promise.fulfil an aim/objective She felt that she had failed to fulfil her objectives for the year.\nCOMMERCE to supply what has been ordered: fulfil an order Orders are fulfilled on a first-come-first-served basis.\nto have a particular purpose: fulfil a role/function Outsourcing primarily fulfils the function of lowering cost levels.\nto satisfy someone or make them happy: I'm looking for work that will fulfil me.fulfil yourself He felt that he had been able to fulfil himself in his career."}