{"id":160226,"name":"full","type":"adjective","us_sound":"fʊl","us_link":"../audio/f/full.mp3","uk_sound":"fʊl","uk_link":"../audio/f/ukfucke020.mp3","content":"full adjective\n(CONTAINING A LOT)\nAdd to word list\nAdd to word list\nA2 (of a container or a space) holding or containing as much as possible or a lot: This cup is very full so be careful with it. My plate was already full. I tried to get in the cinema last night but it was full.mouth full Don't talk with your mouth full!full of The shelves were full of books. When she looked at him her eyes were full of tears. I tried to get on the 8.45 train but it was full.fill something full Don't fill your glass too full or you'll spill it.half full The stadium was only half full.\nA2 containing a lot of things or people or a lot of something: full of This sweater is full of holes. His essay was full of spelling errors. I'm full of admiration for you. You're always so full of energy.\ninvolving a lot of activities: I've got a full week next week - could we postpone our meeting? She has a very full life.\nThesaurus: synonyms, antonyms, and examples\nfull of activitybusyThe pub is always busy on a Friday.fullShe leads a rich, full life.hecticThey tried to fit a holiday into their hectic schedules.freneticThe frenetic pace of city life is exhausting.bustlingThey moved to the bustling city centre.\nSee more results »\nbe full of something\nUK to be talking or thinking a lot about something that you have enjoyed or found exciting: \"Did the kids enjoy their trip to the zoo?\" \"Oh, yes, they were full of it when they got back this afternoon.\"\nSee more be full of your own importance UK disapproving\nto think and act as if you are very important: Since he got his new job, he's been very full of his own importance.\nSee more be full of yourself C2 disapproving\nto think that you are very important in a way that annoys other people: I can't stand her - she's so full of herself.\nSee more\nMore examplesFewer examplesHer book is full of long convoluted sentences.We've brought a cooler full of beer with us.He's got a whole drawer full of odd socks.The museum is full of rare and precious treasures.It was a rough mountain road, full of stones and huge holes.\nSMART Vocabulary: related words and phrases\nFull\nalive\nalive with something idiom\nawash\nbe a rich seam to mine idiom\nbe riddled with something idiom\nbristle\ncongested\ncrowded\ncrowdedness\nflat chat\nfully booked\ngunwale\nheaped\nheaping\nrammed\nreplete\nrepletion\nridden\nriddled\nteem\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusy and active\nfull adjective\n(COMPLETE)\nA2 [ before noun ] complete, whole, or containing a lot of detail: Please give your full name and address. We do not yet have full details of the story. Few journalists have managed to convey the full horror of the situation. Scientists have not yet determined the full impact of the oil spill. Today's my last full day in Paris. He unwound the rope to its full extent.full member Are you a full member (= do you have all the membership rights) of the club? Some plants need to be in full sun (= to have the sun shining on them) all the time.\nIn baseball, if the count is full, the pitcher (= the player who throws the ball) has thrown two strikes (= balls inside the hitting area) and three balls (= balls outside the hitting area): Martinez worked the count full. in full\nB1 completely: The bill must be paid in full by the end of the month.\nSee more in full flow\nUK If an activity is in full flow, it is happening fast and with energy: Preparations for the event are now in full flow.\nSee more be in full swing\nIf an event is in full swing, it has already been happening for a period of time and there is a lot of activity: The party was in full swing by the time we arrived.\nSee more in full view\nable to be seen by other people: in full view of Andy kissed Vicki full on the lips in full view of her friends.\nSee more\nMore examplesFewer examplesThe board concurred that the editor should have full control over editorial matters.He made a full confession to the police.When the newspapers published the full story, all his earlier deceits were revealed.The prognosis after the operation was for a full recovery.The minister accepted full responsibility for the disaster and resigned.\nSMART Vocabulary: related words and phrases\nComplete and whole\n(all) in one piece idiom\nabsolute\naggregate\nall or nothing idiom\nall told idiom\nall-in-one\nall-inclusive\nfell\nfibre\nfull strength\nfull-fledged\nfull-length\nfully\nfully fledged\nthorough\nthoroughgoingly\nthoroughly\nthrough and through idiom\nto the last idiom\ntotality\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nfull adjective\n(GREATEST POSSIBLE)\nB1 [ before noun ] the greatest possible: James is very bright, but he doesn't make full use of his abilities.full marks Nobody got full marks (= all the answers right) in the spelling test. It doesn't seem likely that we will see a return to full employment (= that all the people in the country will have a job) in the near future.\nMore examplesFewer examplesThe opposition was in full cry in Parliament last night over the proposed changes to the education bill.When we arrived, the party was in full swing and the room was abuzz.You need it on full lock .The move from stage to films allowed Gildit to give full play to his sense of the fantastic.I don't feel I'm achieving my full potential in my present job.\nSMART Vocabulary: related words and phrases\nMaximum and minimum\n(at) full steam idiom\n(at) full stretch idiom\nat least idiom\nbare\ncredit limit\nflat chat\nflat out phrase\ngive a hundred percent idiom\nleast\nmax\nmax out\nmaximal\nmaximally\nmaximum\nnadir\npeak\npercent\nthe bare minimum phrase\nthe full monty\nutmost\nSee more results »\nfull adjective\n(FOOD)\nB2 (also full up) having eaten so much food that you cannot eat any more: No more cake for me, thanks, I'm full. on a full stomach\nhaving recently eaten: Never go swimming on a full stomach.\nSee more\nMore examplesFewer examplesI've only eaten one course and I'm already full.The children were too full to eat their pudding, and they asked to get down from the table.\nSMART Vocabulary: related words and phrases\nFull\nalive\nalive with something idiom\nawash\nbe a rich seam to mine idiom\nbe riddled with something idiom\nbristle\ncongested\ncrowded\ncrowdedness\nflat chat\nfully booked\ngunwale\nheaped\nheaping\nrammed\nreplete\nrepletion\nridden\nriddled\nteem\nSee more results »\nfull adjective\n(LARGE)\n(of clothing) loose or containing a lot of material, or (of parts of the body) quite large and rounded: a full skirtfull in the face Women often have full faces/become full in the face when they're pregnant. Her full lips curved into a smile.\nused to avoid saying \"fat\": full figure They advertise clothes \"for the fuller figure\".\nSMART Vocabulary: related words and phrases\nBig and quite big\nappreciable\nbaronial\nbigly\nbloated\nboxcar\nbulky\nfullness\ngrandly\ngrowthy\nheaping\nhearty\nheftily\nhefty\npalatially\npumped\nrambling\nroomy\nroyal\nroyally\nthe bigger the better idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlexible, loose and yielding\nfull adjective\n(STRONG)\n(of a flavour, sound, smell, etc.) strong or deep: This wine has a full fruity flavour. A cello has a fuller sound than a violin.\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsalty\nsavory\nsavoury\numami\nunseasoned\nunsweetened\nvelvety\nvinous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSmells & smelling\nDescribing qualities of sound\nHaving a powerful effect\nGrammar\nFull or filled?Full is an adjective, and means ‘containing a lot’: …\nIdioms\n(at) full blast\n(at) full speed/tilt/pelt\n(at) full steam\n(at) full stretch\nbe full of beans\nbe full of the joys of spring\nbe in full cry\ncome/go/turn full circle\nfull marks to someone\nfull steam ahead\nfull adverb\n(COMPLETE)\nknow full well\nto understand a situation completely: You know full well that you're not supposed to go there without asking me!\nSee more\nfull adverb\n(STRAIGHT)\nstraight; directly: full in He was kicked full in the stomach.full on The intruders turned and ran as the police shone their torches full on them.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\nSee more results »\nto the full/to the fullest\nas much or as well as possible: She certainly lives life to the full.\nSee more\nfull adjective\n(CONTAINING A LOT)\nAdd to word list\nAdd to word list\nhaving or containing a lot: The glass is full, so be careful not to spill it. This sweater is full of holes. You’re always so full of energy. Don’t talk with your mouth full (= with food in your mouth)! I have a full schedule (= a lot of activities planned) next week.\nfull adjective\n(ATE ENOUGH)\nhaving eaten so much that you do not want to eat any more: I’m so full I couldn’t eat another bite.\nfull adjective\n(WHOLE)\n[ not gradable ] including all of something or everything; whole: What should we do on our last full day in New York?\nfull adjective\n(GREATEST POSSIBLE)\n[ not gradable ] the greatest possible; maximum: We don’t make full use of our basement. My roommate’s stereo was on full blast (= as loudly as possible).\nfull adjective\n(LARGE)\n[ -er/-est only ] (of clothing) loose or containing a lot of material, or (of the body) large and rounded: full face/lips/mouth The dress was tight at the waist with a very full skirt and puffy sleeves.\nfull adjective\n(STRONG)\n[ -er/-est only ] (of a flavor, sound, or smell) strong or deep: A cello has a fuller sound than a violin.\nIdioms\nfull circle\nfull of yourself\n(at) full throttle\nsomeone is full of it\nin full swing\non a full stomach\nfull adverb [not gradable]\n(DIRECTLY )\ndirectly: The biting wind was blowing full in his face. Idiom\nknow full well\nAdd to word list\nAdd to word list\ncomplete or whole: the full amount/cost Only people without health insurance are charged the full amount.the full benefit/impact It is still not known what the full impact of the economic sanctions will be on the domestic economy. Officials said the airline was operating at full capacity yesterday. If the customer kept the items for the full 90 days that many stores allow for a return, the season for a particular fashion might have passed.\ncontaining a lot of detail or all the necessary details: Please include your full name and address with your order. For full details, please visit our website.\nfull price [ C or U ]\na price that has not been reduced: Customers who do not have a proof of age card have to pay full price.\nat full stretch\nworking as hard as possible, or using all available money, materials, time, etc.: be/work at full stretch Plants are continuing to work at full stretch to meet both domestic and export demand. They claimed they were operating at full stretch and could not afford to lower rates as margins were already pared to the bone .\nin full\ncompletely: The bill must be paid in full by the end of the month."}