{"id":160403,"name":"fun","type":"noun","us_sound":"fʌn","us_link":"../audio/f/fun.mp3","uk_sound":"fʌn","uk_link":"../audio/f/ukfumes005.mp3","content":"fun noun [U]\n(PLEASURE)\nAdd to word list\nAdd to word list\nA1 pleasure, enjoyment, or entertainment: have fun! Invite a friend to the party, and have fun (= enjoy yourself)! Having fun (= are you enjoying yourself)?great fun We had great fun at the beach.good fun I really enjoyed your party - it was such good fun.a lot of fun She's a lot of fun to be with.take the fun out of Mark was ill for most of the holiday so that took all the fun out of it.no fun/not much fun It's no fun/not much fun (= not enjoyable) having to work on Saturdays.fun-loving I will always remember her as a fun-loving girl.what fun \"We're going on a picnic this weekend.\" \"What fun (= how enjoyable)!\" The relationship was never going to work, but it was fun while it lasted. for fun (also for the fun of it)\nB1 for pleasure: I ran but just for fun.\nSee more make fun of someone/something\nB2 to make a joke about someone or something in a way that is not kind: The other children were always making fun of him because he was fat and wore glasses.\nSee more\nMore examplesFewer examplesIt's all good clean fun.Playing card games is not my idea of fun.She's only having a bit of fun - leave her be.Don't be angry - it was just a joke - where's your sense of fun?Time flies when you're having fun.\nSMART Vocabulary: related words and phrases\nGeneral words for fun\namusement\ncrack\ncraic\nfling\ngas\ngiggle\nhoopla\nhorseplay\njollification\njollity\nlaugh\nlolz\nmerriment\nplay\nriot\nrough\nrough and tumble idiom\nsesh\nsport\nwhimsy\nfun noun [U]\n(GAME/JOKE)\nbehaviour or activities that are not serious; games or jokes: full of fun The children are always full of fun.a bit of fun UK I didn't mean to upset her - it was just a bit of fun.in fun I didn't mean what I said, it was only in fun (= a joke).\nMore examplesFewer examplesWhat's wrong with having a bit of fun?She's only having a bit of fun - leave her alone.Don't be angry - it was just a joke - where's your sense of fun?There were those who found the joke offensive, but Johnson insisted it was just a bit of harmless fun.We had a lot of fun preparing for the Halloween party.\nSMART Vocabulary: related words and phrases\nGeneral words for fun\namusement\ncrack\ncraic\nfling\ngas\ngiggle\nhoopla\nhorseplay\njollification\njollity\nlaugh\nlolz\nmerriment\nplay\nriot\nrough\nrough and tumble idiom\nsesh\nsport\nwhimsy\nGrammar\nFun or funny?Fun is an uncountable noun meaning ‘pleasure and enjoyment’: …\nIdioms\nhave fun and games\nnot be all fun and games\nA2 giving pleasure, especially because of being not at all serious: There are lots of fun things to do here. Did you have a fun evening? These feather accessories are so fun and unusual. This is not a very fun topic of discussion.\n(of a person) enjoyable to be with, especially because of not being serious: He's a really fun person. I love my friends as they are so fun and creative.\nMore examplesFewer examplesI remember my college days as really fun.It was such a fun summer.Can we do something more fun?This is not a fun situation to be in.They're a fun bunch of people.You're not very fun to be around when you're like this.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomey\nindulgent\nindulgently\njovial\njovially\nsensuous\nsensuously\nserendipitous\nsweeten\nswooning\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who enjoy pleasure\nGrammar\nFun or funny?Fun is an uncountable noun meaning ‘pleasure and enjoyment’: …\nAdd to word list\nAdd to word list\npleasure, enjoyment, amusement, or someone or something that causes this: Everybody had a lot of fun at the party. It’s no fun having to work on Saturdays. He studies French just for fun/for the fun of it. I only said it in fun (= as a joke). Idiom\nfun and games\nenjoyable: Going camping would be a really fun thing to do. Cindy is a fun person (= enjoyable to be with)."}