{"id":160421,"name":"function","type":"noun","us_sound":"ˈfʌŋk.ʃən","us_link":"../audio/f/function.mp3","uk_sound":"ˈfʌŋk.ʃən","uk_link":"../audio/f/ukfumes006.mp3","content":"function noun\n(PURPOSE)\nAdd to word list\nAdd to word list\nB2 [ C ] the natural purpose (of something) or the duty (of a person): function of The function of the veins is to carry blood to the heart. I'm not quite sure what my function is within the company.perform the function of A thermostat performs the function of controlling temperature.\nMore examplesFewer examplesShould the function of children's television be to entertain or to enlighten?Surely the function of the law is to protect everyone's rights.Do the lights on this cassette deck have any useful function or are they just for show?Zoos fulfil an important function in the protection of rare species.He performs several important functions within the organization.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nfunction noun\n(CEREMONY)\nC1 [ C ] an official ceremony or a formal social event, such as a party or a special meal, at which a lot of people are usually present: attend an official function As a mayor, he has a lot of official functions to attend.social function I see her two or three times a year, usually at social functions.\nSMART Vocabulary: related words and phrases\nCeremonies\nanti-ritualism\ncavalcade\nceremonial\nceremonially\nceremony\nflyby\nguard of honour\nhara-kiri\ninitiation ceremony\ninitiatory\ninstallation\ninvestiture\nknight\nmaster of ceremonies\nremember\nrequiem\nribbon cutting\nrite of passage\nritual\ntroop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCelebrations, parties & special occasions\nfunction noun\n(WORK)\n[ U ] the way in which something works or operates: function of It's a disease that affects the function of the nervous system. Studies suggest that regular intake of the vitamin significantly improves brain function.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\ntake\nwork\nwork a treat idiom\nSee more results »\nfunction noun\n(COMPUTER)\n[ C ]\n&#160; computing\n&#160; specialized a process that a computer or a computer program uses to complete a task: a search/save/sort function\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nfunction noun\n(RESULT)\na function of something formal\nsomething that results from something else, or is the way it is because of something else: His success is a function of his having worked so hard.\nSee more\nfunction noun\n(VALUE)\n[ C ]\n&#160; mathematics\n&#160; specialized (in mathematics) a quantity whose value depends on another value and changes with that value: function of x is a function of y.\nSMART Vocabulary: related words and phrases\nNumerical relationships\nabsolute maximum\nabsolute minimum\narithmetic progression\ncardinality\ncommensurable\ndifferential\nharmonic progression\nintersect\ninverse function\ninverse proportion\nlinear\nlinearly\nproportion\nproportional\nprorate\nprorated\nquantile\nrank correlation\nratable\nsubset\nSee more results »\nto work or operate: You'll soon learn how the office functions. The television was functioning normally until yesterday. I'm so tired today, I can barely function. Synonym\nwork (OPERATE)Compare\nmalfunction verb formal\nMore examplesFewer examplesYou can't function properly when you're deprived of sleep.Obviously the school cannot function without teachers.The theatre continued to function throughout the war.The washing machine wasn't functioning properly.I don't know how you functioned under those conditions.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\ntake\nwork\nwork a treat idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning\nPhrasal verb\nfunction as something/someone\nfunction noun\n(PURPOSE)\nAdd to word list\nAdd to word list\n[ C/U ] a purpose or duty, or the way something or someone works: [ U ] The function of the veins is to carry blood to the heart. [ C ] One of your functions as receptionist is to answer the phone.\nfunction noun\n(MATHEMATICAL RELATIONSHIP)\n[ C ]\n&#160; mathematics a relationship between two sets in which each part of the first set is connected with just one member of the second set in number pairs\nfunction noun\n(CEREMONY)\n[ C ] a social event or official ceremony: Morse went to the White House for a ceremonial function.\nfunction verb [I]\n(PERFORM PURPOSE)\nto perform the purpose of a particular thing, or to perform the duties of a particular person: She quickly learned how the office functions. I’m so tired today, I can barely function. Our spare bedroom also functions as a study (= is also used for that purpose).\nAdd to word list\nAdd to word list\n[ C or U ] the purpose that something has: The perfect marriage between product design and function account for the company’s success in the computer market. A fundamental function of the Bank of England is the responsibility of carrying out monetary policy operations.\n[ C or U ] a job or task that someone or something does: My function is to help coordinate efficient communication between the departments. carry out/perform a function\n[ C ]\n&#160; HR a particular area of responsibility of a company: a sales/marketing/business functioncore/corporate functions Of all the core functions of most companies, innovation has arguably the most competitive value.\n[ C ]\n&#160; IT a process which a computer or a software program uses to complete a task: a search/save/sort function The website benefits from a highly-efficient search function.\n[ C ] an official occasion or event attended by many people: a charity/social/work function\nbe a function of sth\nif something is a function of something else, it is produced as the result of that thing or process: The increased availability of part-time jobs is a function of the structural changes in the labour market.\nSee also\nconsumption function\nto work correctly and as expected: function effectively/properly/well Flights were delayed because the airport computer system was not functioning. Phrasal verb\nfunction as sth"}