{"id":160441,"name":"functioning","type":"noun","us_sound":"ˈfʌŋk.ʃən.ɪŋ","us_link":"../audio/f/cdo0123usfunc0891.mp3","uk_sound":"ˈfʌŋk.ʃən.ɪŋ","uk_link":"../audio/f/cdo0123ukfunc1060.mp3","content":"Add to word list\nAdd to word list\nthe fact of working or operating, or the way that something operates: functioning of Extreme weather conditions are affecting the functioning of the railway service. Researchers studied how the vitamin supports the healthy functioning of cells.\nthe normal way that someone's body or mind works and their ability to do things: If sadness is getting in the way of your everyday functioning, you should see a doctor. The special needs assessment helps us to determine the child's current level of functioning and to set learning goals.\nMore examplesFewer examplesCertain rules are essential to the smooth functioning of the hospital.Across the world we are seeing a lot of instability in the political functioning of states.Restrictions impede the efficient functioning of the market, he claims.Bladder and bowel control are severely impaired and the patient needs constant assistance for daily functioning.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperate\noperative\npeg\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\nself-driving\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealth in general\nSkill, talent and ability\nable to work or operate normally: People with the disorder lack a functioning immune system to fight off infection. The country has been without a functioning government since the 1990s. a functioning alcoholic/addict, etc.\nsomeone who can behave, work, and live in a way that seems normal although they are addicted to (= unable to stop using too much) alcohol, drugs, etc.: She was a highly successful athlete and a functioning alcoholic.\nSee more Synonym\nfunctionalSee also\nhigh-functioning\nhyperfunctioning\nlow-functioning\nnon-functioning\nMore examplesFewer examplesThere are almost no functioning lights in the entire building.We don't even have a functioning team at the moment.The aim of the conglomerate is to come together as a functioning whole.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfire someone up\nfunction as something/someone\nin commission idiom\nlight\noperate\noperative\npeg\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\nself-driving\ntick\nSee more results »"}