{"id":160455,"name":"fundamental","type":"adjective","us_sound":"ˌfʌn.dəˈmen.t̬əl","us_link":"../audio/f/eus71948.mp3","uk_sound":"ˌfʌn.dəˈmen.təl","uk_link":"../audio/f/ukfumes013.mp3","content":"fundamental adjective\n(BASIC)\nAdd to word list\nAdd to word list\nC2 forming the base, from which everything else develops: fundamental change We need to make fundamental changes to the way in which we treat our environment.fundamental difference It's one of the fundamental differences between men and women.fundamental principle The school is based on the fundamental principle that all children should reach their full potential.of fundamental importance Diversity is of fundamental importance to all ecosystems and all economies. Synonyms\nbasic\nfoundational formal\nThesaurus: synonyms, antonyms, and examples\nbasic knowledge, understanding, etc.basicI just need some basic information.elementaryI started an elementary-level art history course.fundamentalOne of the most fundamental principles of the rule of law is that one person cannot be punished for the actions of another.rudimentaryThey have only the most rudimentary grasp of the language.essentialWe have been able to determine the essential nature of a healthy diet.underlyingThe underlying idea is that having freedom is valuable.\nSee more results »\nC2 more important than anything else: fundamental to Some understanding of grammar is fundamental to learning a language.\nThesaurus: synonyms, antonyms, and examples\nnecessarynecessaryDo you have the necessary skills for the job?needDoes she have the skills needed for work of that sort?requireWill you require a wake-up call in the morning?mustThe meat must be cooked thoroughly.essentialClean water is essential for a society's health.fundamentalSome understanding of grammar is fundamental to learning a language.\nSee more results »\nMore examplesFewer examplesA fair justice system is a fundamental part of a civilized society.Peaceful demonstrations that do not cause a public nuisance are a fundamental right in any truly democratic country.He'd like to see a fundamental reappraisal of the way unions operate.Trial by jury is a fundamental right.The new management will make fundamental changes.\nSMART Vocabulary: related words and phrases\nEssential or necessary\nbasically\nbasis\nbe a question of doing something idiom\nbox ticking\nbusiness-critical\ndependence\nelemental\nif/when push comes to shove idiom\nincumbent\nindispensable\nindispensably\ninhere in something\nnecessitate\nnecessity\nneed\nneeded\nneedful\nowe\nsymbiotically\nwarrant\nSee more results »\nfundamental adjective\n(IN MUSIC)\nmusic\n&#160; specialized In a fundamental chord (= a group of notes played together), the basic note that identifies the chord (= tells you which one it is) is its lowest note: The value of each chord is determined by its relationship to one, unchangeable fundamental chord. The fall of a semitone is accompanied by the fundamental chord, held for two bars.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nthe basic note of a chord (= a group of notes played together), which identifies it (= tells you which chord it is): There is a feeling that chords are built up from, or reach down towards, a fundamental. The harmonic series derived from a given note is a set tone consisting of its fundamental tone and upper harmonic tones. Harmonics may be sounded independently of the fundamental note.\nMore examplesFewer examplesThere will be inevitable differences of intonation between notes produced as a first overtone, second overtone, or as a fundamental. The musical tones that we commonly hear are constituted of a number of tones - the fundamental and its overtones.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nkey signature\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nCompare\nharmonic\novertone\nAdd to word list\nAdd to word list\nbeing the most basic or most important thing on which other things depend: fundamental beliefs/principles We need to make fundamental changes in the way we treat our environment. fundamentally adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌfʌn·dəˈmen·təl·i/\nTheir economy was fundamentally (= basically) in good shape. fundamentals plural noun us\nYour browser doesn't support HTML5 audio\n/ˌfʌn·dəˈmen·təlz/\nIn the early grades, children learn the fundamentals of reading.\nAdd to word list\nAdd to word list\nFINANCE, ECONOMICS used to describe the basic causes of changes in the value of shares, etc. that relate to the condition of companies and the economy: Fundamental factors will have the most impact on currency. Compare\ntechnical adjective\nvery important and basic: fundamental in/to sth The multilateral trading system has been fundamental in economic success. There is no need to change anything fundamental about the way the business works."}