{"id":160451,"name":"fund","type":"noun","us_sound":"fʌnd","us_link":"../audio/f/fund.mp3","uk_sound":"fʌnd","uk_link":"../audio/f/ukfumes012.mp3","content":"Add to word list\nAdd to word list\nC1 [ C ] an amount of money saved, collected, or provided for a particular purpose: pension/trust fund Several financial advisers help manage the pension/trust fund.set up a fund The hospital has set up a special fund to buy new equipment. Contributions are being sought for the disaster fund. funds C1 [ plural ]\nmoney needed or available to spend on something: Following the repairs to the roof, church funds are now seriously depleted.\nSee more a fund of something UK\na lot of something: She has a fund of knowledge on the subject.\nSee more\nMore examplesFewer examplesThe fund provides money to clean up chemically polluted industrial sites.Her family have contributed £50,000 to the fund.To ensure security the investment fund has holdings in many companies.They've set up a fund for victims of the earthquake.This national fund pays for welfare benefits such as unemployment and sickness pay.\nSMART Vocabulary: related words and phrases\nTrusts & funds\nannuity\nblind trust\nescrow\nfiduciary\nholding company\ninheritance\nkitty\nmutual fund\nnon-discretionary\npension fund\npension plan\nslush fund\nsuper\nsyndic\nthe Consolidated Fund\ntrust\ntrust fund\ntrustee\ntrusteeship\nunit trust\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\nC1 to provide the money to pay for an event, activity, or organization: The company has agreed to fund my trip to Australia. The new college is being privately funded (= money for it is not being provided from taxes).\nMore examplesFewer examplesWe'll need accurate costings before we can agree to fund the scheme.Chissano said Western governments should stump up the cash to fund land redistribution.The Channel Tunnel was jointly funded by the French and British.The project is being held in abeyance until agreement is reached on funding it.He funds his extravagant lifestyle by developing property.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nlash out (something)\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nRelated word\nfunder\nAdd to word list\nAdd to word list\na sum of money saved and made available for a particular purpose: a scholarship fund for college students the company’s pension fund\nto provide the money to pay for an event, activity, or organization: He plans to donate money to fund health centers. funder noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈfʌn·dər/\nIt’s the world’s largest funder of education.\nAdd to word list\nAdd to word list\nmoney invested in a range of shares, bonds, etc. often along with other investors' money: The proposed performance table requires disclosure of a fund's returns for fiscal year periods. The fund's performance is linked to swings in gas prices, which are difficult to predict. fund shares/shareholders See also\ninvestment fund\nan amount of money saved or collected for a particular purpose: set up/establish a fund The government set up an emergency fund to help disaster victims.\nan organization that collects and manages an amount of money for investing in a particular purpose: the European Regional Development Fund\nfunds [ plural ]\nthe financial resources that a business, organization, or project has available: raise/provide/generate funds A new shares issue was launched to raise funds for the acquisition.sufficient/insufficient funds Experts have criticized the Government for committing insufficient funds to the state pension. obtain/receive/secure funds be short of/run out of/need funds See also\naccumulated fund\nauthorized investment fund\nbalanced fund\nbank guarantee fund\nbond fund\nbroker-dealer fund\nclosed-end fund\ncommodity fund\ncontingency fund\ndeposit protection fund\nView all\ndepreciation fund\ndiscretionary fund\ndual-purpose fund\nequity fund\nethical fund\nfed funds\ngeneral-purpose fund\ngo-go fund\ngrowth fund\nguarantee fund\nhedge fund\ninvestment fund\nincome fund\nindex fund\ninstitutional fund\nlife fund\nlong-term funds\nmanaged fund\nmoney fund\nmoney market fund\nmutual fund\nno-load fund\npension fund\nperformance fund\nprovident fund\nreserve fund\nrevolving fund\nshareholders' funds\nshort-term funds\nsinking fund\nslush fund\nstate funds\nstock fund\nstrike fund\ntracker fund\ntrust fund\numbrella fund\nvalue fund\nvulture fund\nto provide the money for a particular purpose or activity: Fears continue to grow that the Government's bailout will not be enough to fund the industry's recovery.partially/wholly/fully funded The research was partially funded by Roche Applied Science. government/privately funded The regeneration program is funded by EU money. See also\noverfunded\nunderfunded"}