{"id":160728,"name":"furlough","type":"noun","us_sound":"ˈfɝː.loʊ","us_link":"../audio/f/usb02471.mp3","uk_sound":"ˈfɜː.ləʊ","uk_link":"../audio/f/cald4uk0623.mp3","content":"Add to word list\nAdd to word list\nmainly US a period of time that a soldier, worker, or prisoner is allowed to be absent, especially to return temporarily to their own home: on furlough He was an Army Sergeant home on furlough. It is a crime for a person who has been given a furlough to fail to return to the jail or prison at the required time.\na period of time when a company stops employing someone, usually temporarily, because the company does not have enough money or enough work: Employees of the company were told to prepare themselves for a round of furloughs.on furlough The union represents about 9,000 active pilots, with nearly 2,000 more pilots currently on furlough. Synonym\nlayoff\nMore examplesFewer examplesHer husband was posted overseas at the time, and when he came home on furlough and found out, he was angry.More than 3,000 workers at United took a voluntary three-month furlough from the company.\nSMART Vocabulary: related words and phrases\nTime off\nabsenteeism\nadministrative leave\nBoxing Day\ncareer break\ncomp time\nescape\nhartal\nholiday\nhols\nlegal holiday\nmaternity leave\nnon-work\noff-hours\nparental leave\nsick\nsick day\nsick leave\nsickie\nskive\ntake something off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot punishing & reducing punishment\nTypes of employment\nmainly US to give someone permission to be absent from the armed services, work, or prison for a period of time, especially to return temporarily to their own home: Furloughed servicemen must be given preference over civilian travel.\nnot going to your job, usually temporarily, because your employer does not have work for you or money to pay you: After safety concerns, the company furloughed all 4,000 of its employees.\nMore examplesFewer examplesHe was a furloughed prisoner at the time he committed the crime.She is furloughed from rehab to attend her sister's wedding.Delta furloughed hundreds of pilots.2,300 workers were involuntarily furloughed to help the company reach its goal of reducing the workforce by 20 percent.As of January, full-timers at the museum will be furloughed 1 day a month.\nSMART Vocabulary: related words and phrases\nTime off\nabsenteeism\nadministrative leave\nBoxing Day\ncareer break\ncomp time\nescape\nhartal\nholiday\nhols\nlegal holiday\nmaternity leave\nnon-work\noff-hours\nparental leave\nsick\nsick day\nsick leave\nsickie\nskive\ntake something off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot punishing & reducing punishment\nTypes of employment\nAdd to word list\nAdd to word list\na time allowed for a person to be absent, esp. from the army or a prison: I’m home on furlough."}