{"id":160822,"name":"furthest","type":"adverb","us_sound":"ˈfɝː.ðɪst","us_link":"../audio/f/furthest.mp3","uk_sound":"ˈfɜː.ðɪst","uk_link":"../audio/f/ukfunk_028.mp3","content":"Add to word list\nAdd to word list\nB1 superlative of\nfar : That's the furthest I can see without glasses. I wanted to be an actress but the furthest I ever got was selling popcorn in a cinema.\nMore examplesFewer examplesI wonder which of us can run the furthest?That big cloud looks the furthest away, but maybe it isn't.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nGrammar\nFarther, farthest or further, furthest?Farther and further are comparative adverbs or adjectives. They are the irregular comparative forms of far. We use them to talk about distance. There is no difference in meaning between them. Further is more common: …\nsuperlative of\nfar : The novel explores the furthest extremes of human experience.\nMore examplesFewer examplesThe accomplishment marks the furthest point that scientists have yet reached in cloning a nonhuman primate.Peace was the furthest thing from the administration's agenda. At its furthest reaches the city gradually gives way to trees. The machair is the rich blanket of wild plant and animal life unique to the furthest fringes of Scotland and Ireland.\nSMART Vocabulary: related words and phrases\nDistant in space and time\n(in) the middle of nowhere idiom\nafar\nafield\nall/the four corners of the world/earth idiom\nanywhere\nas far as the eye can/could see idiom\ndistance\neye\nfarthest\nfrom afar\nfurther\nfurthermost\nlight years away idiom\nmiddle\nremote\nremotely\nremoteness\nultra\nultra-distant\nwide\nSee more results »\nfurthest adjective, adverb\n(DISTANCE)\nAdd to word list\nAdd to word list\nsuperlative offar : The furthest west I’ve ever gotten is the Grand Canyon. Note: Both furthest and farthest are used as adverbs and adjectives. Farthest is more commonly used when referring to distances. Furthest is more often used when the intended meaning is figurative.\nfurthest adjective, adverb\n(AMOUNT)\nsuperlative offar : At that time, the countries furthest along in terms of economic development were Chile, Mexico, and Venezuela.\nfurthest pronoun\n(GREATEST AMOUNT)\nthe greatest amount: This is the furthest our soccer team has advanced in the playoffs."}