{"id":160859,"name":"fuse","type":"noun","us_sound":"fjuːz","us_link":"../audio/f/fuse.mp3","uk_sound":"fjuːz","uk_link":"../audio/f/ukfurti004.mp3","content":"fuse noun [C]\n(SAFETY PART)\nAdd to word list\nAdd to word list\na small safety part in an electrical device or piece of machinery that causes it to stop working if the electric current is too high, and so prevents fires or other dangers: blow a fuse My hairdryer's stopped working - I think the fuse has blown (= broken).change a fuse Have you tried changing the fuse?\nJiradelta/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nElectrical components & circuitry\nAGM battery\nanode\narmature\nbandpass filter\nbaseband chip\ncathode\ncathode ray\ncircuit breaker\ncoil\nLED display\nmulticelled\nmulticonductor\nneutral\nnumber pad\nphotoresist\nphotovoltaic cell\npotentiometer\nprinted circuit (board)\nrelay\ntransformer\nSee more results »\nfuse noun [C]\n(DEVICE ON EXPLOSIVE)\na string or piece of paper connected to a firework or other explosive product by which it is lit, or a device inside a bomb that causes it to explode after a fixed length of time or when it hits or is near something: light a fuse He lit the fuse and ran.\nSteve Cicero/Corbis Documentary/GettyImages\nSMART Vocabulary: related words and phrases\nFireworks\nbanger\ncatherine wheel\ncracker\nfirecracker\nfirework\nfuze\npyrotechnic\npyrotechnician\npyrotechnics\nrocket\nRoman candle\nsparkler\nsquib\ntouchpaper\nYou can also find related words, phrases, and synonyms in the topics:\nBombs & missiles\nIdiom\nhave a short fuse\nfuse verb [I or T]\n(JOIN)\n[ I or T ] to join together physically, or to join things together physically: Genes determine how we develop from the moment the sperm fuses with the egg. The bones of the skull are not properly fused at birth. Fusing the vertebrae together seemed to be her only option.\n[ I or T ] (of ideas, cultures, musical styles, etc.) to combine or be combined together : In Istanbul, East and West fuse together in a way that is fascinating to observe. He developed a sound that fuses jazz, funk, disco, and soul.\nMore examplesFewer examplesa disorder whereby the vertebrae of the spine become fused in a fixed, rigid bamboo-like structure The two cells fuse into a single cell.What's remarkable about her film is the way she succeeds in fusing the real and the dreamlike.He has a gift for fusing pragmatism and idealism.Anti-intellectualism and anti-rationalism have fused in a particularly insidious way.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunified\nunify\nunion\nunseparated\nwad\nSee more results »\nfuse verb [I or T]\n(MELT)\n[ I or T ] to melt or make two things melt together, especially at a high temperature: The heat of the fire fused many of the machine's parts together.\nMore examplesFewer examplesThe inspectors have testing equipment to check on the welds that fuse the pipes together. Encaustic art is a painting method that features colors in wax that are fused to a surface with hot irons.The coloured glass is heated until it fuses together.\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConnecting and combining\nfuse verb [I or T]\n(STOP WORKING)\n[ I or T ] UK When an electrical device or piece of machinery fuses, or when someone or something fuses it, it stops working because the electric current is too high: Either my headlights have fused or the bulbs have gone. The kids were messing around with the switches and they fused the lights.\nSMART Vocabulary: related words and phrases\nElectrical components & circuitry\nAGM battery\nanode\narmature\nbandpass filter\nbaseband chip\ncathode\ncathode ray\ncircuit breaker\ncoil\nLED display\nmulticelled\nmulticonductor\nneutral\nnumber pad\nphotoresist\nphotovoltaic cell\npotentiometer\nprinted circuit (board)\nrelay\ntransformer\nSee more results »\nfuse verb [I or T]\n(EXPLOSIVE)\n[ T usually passive ] to put a device inside a bomb that causes it to explode after a fixed length of time or when it hits or is near something: The submarine carries an explosive charge fused to detonate on impact with its target. They discovered a World War II 250-pound fused bomb.\nMore examplesFewer examples stocks of incendiary and explosive devices that were fused and ready for useA bomb is a projectile or other device carrying an explosive charge fused to detonate under certain conditions.\nSMART Vocabulary: related words and phrases\nBombs & missiles\nanti-mine\nanti-missile\nanti-radar\nanti-satellite\nanti-ship\ndirty bomb\nenrich\nenrichment\nExocet\nfirebomb\nMolotov cocktail\nmortar\nmushroom cloud\nnapalm\nneutron bomb\nsubmunition\nsuicide belt\nsuicide vest\nsuperbomb\nsurface-to-air missile\nSee more results »\nfuse noun [C]\n(SAFETY DEVICE)\nAdd to word list\nAdd to word list\na safety device for protecting an electrical system which contains a material that will melt if too much electricity passes through the system\nfuse noun [C]\n(EXPLOSIVE DEVICE)\na cord or tube along which a flame moves to light fireworks or bomb, or a device inside a bomb that causes it to explode at a particular time or when it hits something\nfuse verb [I/T]\n(JOIN)\nto join or become combined, or to cause things to join: [ I ] The two cells are fused with a jolt of electricity. [ T ] The heat of the fire fused many of the machine’s parts together.\nAdd to word list\nAdd to word list\nto join together to form one thing, or to make something do this: The merger would fuse three companies that together employ 3,500 people. fuse into sth The municipalities may even, in the future, fuse into a single city."}