{"id":160927,"name":"fussiness","type":"noun","us_sound":"ˈfʌs.i.nəs","us_link":"../audio/f/usfurth007.mp3","uk_sound":"ˈfʌs.i.nəs","uk_link":"../audio/f/ukfurti013.mp3","content":"fussiness noun [U]\n(TOO MUCH CARE)\nAdd to word list\nAdd to word list\nthe quality of being difficult to please or showing an unnecessary amount of care or worry about something that is not important: The waiter was attentive to the point of fussiness.\nMore examplesFewer examplesIn her role as Juliet's nurse she swings wildly from comic impatience to maternal fussiness.He is a Virgo, whose traits include fussiness, perfectionism and a tendency to worry. He complained about their officiousness, their fussiness and their inability to let well alone.\nSMART Vocabulary: related words and phrases\nWanting everything to be right\nanally\nanally retentive\nchoosy\ncover all the bases idiom\ndot the i's and cross the t's idiom\nfuss\nfussbudget\nfussily\nfusspot\nfussy\npedantic\npedantically\npedantry\nperfectionism\nperfectionist\npurism\npurist\npuristically\nstickler\nultra-fastidious\nSee more results »\nfussiness noun [U]\n(TOO MUCH DETAIL)\nthe quality of having too much decoration and too many small details: I dislike the fussiness of the collar, with its decorative bows.\nMore examplesFewer examplesIt's incredible how so much lush detail can be included without a trace of fussiness.The songs are sung with requisite nuance yet never descend into fussiness. The fussiness of the decor gave the room a dated air.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngracelessly\nhatchet-faced\nhave a face like the back end of a bus idiom\nhideous\nhideousness\nhomeliness\npretty-pretty\nputridly\nreptilian\nscrappily\nscrappy\nunsightly\nvulgarity\nvulgarly\nSee more results »\nfussiness noun [U]\n(OF BABY)\nUS the quality in a baby of crying a lot and being difficult to calm: Keep an eye out for symptoms such as fussiness, unusual sleepiness, or difficulty feeding.\nMore examplesFewer examplesOne of their biggest challenges has been Sylvia's unexpected fussiness, refusal to nap during the day and need to be held all the time. When you introduce a new food watch for such reactions as rashes, diarrhea, vomiting, and fussiness.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nlugubriously\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nwoeful\nSee more results »\nSee\nfussy"}