{"id":160926,"name":"fussily","type":"adverb","us_sound":"ˈfʌs.əl.i","us_link":"../audio/f/usfurth006.mp3","uk_sound":"ˈfʌs.əl.i","uk_link":"../audio/f/ukfurti012.mp3","content":"fussily adverb\n(TOO MUCH CARE)\nAdd to word list\nAdd to word list\nin a way that shows an unnecessary amount of care or worry about something that is not important: He lay back on the bed, tucking the dressing gown fussily round his legs. The service is too fussily attentive - we're asked six times if we've enjoyed our food.\nMore examplesFewer examplesHer coat fell to the floor, and Bunny fussily swooped to retrieve it.He fussily gave instructions the whole time. He fiddled fussily with the clasp on his briefcase.He preferred to be treated less fussily than in the more expensive hotels.\nSMART Vocabulary: related words and phrases\nWanting everything to be right\nanally\nanally retentive\nchoosy\ncover all the bases idiom\ndot the i's and cross the t's idiom\nfuss\nfussbudget\nfussiness\nfusspot\nfussy\npedantic\npedantically\npedantry\nperfectionism\nperfectionist\npurism\npurist\npuristically\nstickler\nultra-fastidious\nSee more results »\nfussily adverb\n(TOO MUCH DECORATION)\nin a way that includes too much decoration and too many small details: fussily decorated See\nfussy\nMore examplesFewer examplesHer clothes have to be very carefully chosen because anything fussily frilled, checked or highly patterned tends to look too busy on the small screen.She is fussily over-dressed, laced and beribboned.The car has a fussily styled and poorly fitted glovebox.The 1950s era had fussily constructed garments, cumbersome skirts, cinched waists, and rigid hairstyles.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngracelessly\nhatchet-faced\nhave a face like the back end of a bus idiom\nhideous\nhideousness\nhomeliness\npretty-pretty\nputridly\nreptilian\nscrappily\nscrappy\nunsightly\nvulgarity\nvulgarly\nSee more results »"}