{"id":160913,"name":"fuss","type":"noun","us_sound":"fʌs","us_link":"../audio/f/fuss.mp3","uk_sound":"fʌs","uk_link":"../audio/f/ukfurti010.mp3","content":"fuss noun\n(TOO MUCH OF A FEELING)\nAdd to word list\nAdd to word list\nC1 [ S or U ] a show of anger, worry, or excitement that is unnecessary or greater than the situation deserves: make such a fuss She made such a fuss when Richard spilled a drop of wine on her blouse!fuss about nothing It's all a fuss about nothing.what the fuss is about I don't see what the fuss is about - he seems like a fairly ordinary-looking guy to me. We tried to arrange a ceremony with as little fuss as possible.\nThesaurus: synonyms, antonyms, and examples\nto say something is not right or satisfactorycomplainI hate to complain, but the film was terrible.grumbleShe's always grumbling about something.whineI hope you don't think I'm just whining.kvetchStop kvetching about it!make a fussIf the food doesn't come soon, I'm going to make a fuss.file a complaintI've filed a complaint with the police about the noise.\nSee more results »\nmake a fuss of someone\n(mainly US make a fuss over sb) to give someone a lot of attention and treat them well: She doesn't see her grandchildren very often so she makes a real fuss of them when she does.\nSee more\nMore examplesFewer examplesI felt so ashamed of myself for making such a fuss.He kicked up a tremendous fuss about having to wait.I can't think what's got into him. He doesn't usually make such a fuss.God, he's such a drama queen! I've never seen such a fuss.I grant that it must have been upsetting but even so I think she made a bit of a fuss.\nSMART Vocabulary: related words and phrases\nAnger and displeasure\nacrimony\nanger\nanimus\nannoyance\nbad feeling\nflap\nget the hump idiom\ngorge\ngrit\ngrit your teeth idiom\ngrudge\nhard feelings idiom\nhave a face like thunder idiom\nirritation\nred mist\nreprehension\nresentfulness\nresentment\nroad rage\nslow burn\nSee more results »\nfuss noun\n(ATTENTION)\n[ U ] attention given to small matters that are not important: The article was entitled \"Making up with the minimum of fuss: a five-minute beauty routine that every busy woman should know\".\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\ndrag\nfag\nimposition\ninconvenience\ninconvenient\ninconveniently\ninopportune\npisser\nput something out\nrigamarole\nrigmarole\nsnag\ntempest\nSee more results »\nfuss verb\n(GIVE ATTENTION TO)\n[ I ] to give too much attention to small matters that are not important, usually in a way that shows that you are worried and not relaxed: Please, stop fussing - the food's cooking and there's nothing more to do until the guests arrive.fuss with It irritates me the way she's always fussing with her hair!\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nget in a sweat idiom\ngoosey\ngrim\ngrimly\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nqueasiness\nworried\nworriedly\nworrier\nworrywart\nwound up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWanting everything to be right\nPhrasal verb\nfuss over someone/something\nAdd to word list\nAdd to word list\nthe condition of being excited, annoyed, or not satisfied about something, esp. about something that is not very important: [ U ] Let’s see what all the fuss is about. [ U ] She learned to make good food without too much fuss. [ C ] Why are they suddenly making a fuss about this (= becoming excited about it)?\nto become upset or excited: She was never one to fuss about insignificant things. Some people like to be fussed over (= receive a lot of attention). She sat there fussing with her bright red dress (= touching and moving it nervously)."}