{"id":161005,"name":"future","type":"noun","us_sound":"ˈfjuː.tʃɚ","us_link":"../audio/f/future.mp3","uk_sound":"ˈfjuː.tʃər","uk_link":"../audio/f/ukfurti021.mp3","content":"future noun\n(TIME TO COME)\nthe future [ S ]\nAdd to word list\nAdd to word list\nB1 a period of time that is to come: Sometimes I worry about the future.the future holds I wonder what the future holds for (= what will happen to) you and me.in the future I'm sure at some point in the future I'll want a baby. We need to plan for the future. Do you plan to leave New York in the distant future or the near future? I can see those two getting married in the not too distant future (= quite soon).\nA2 language the form of a verb that you use when talking about something that will happen or exist: in the future In the sentence \"He will study\" the verb phrase \"will study\" is in the future.\nMore examplesFewer examplesSimon has a clear-sighted vision of the company's future.They don't sound confident about the future of the industry.The whole future of the project is still up in the air.The exploration for new sources of energy is vital for the future of our planet.New arrivals face an uncertain future.\nC2 [ C ] what will happen to someone or something in the time that is to come: uncertain future Torn apart by war, its economy virtually destroyed, this country now faces a very uncertain future.great future She's a very talented young singer, Mike, and I personally think she's got a great future ahead of her! The future isn't looking too rosy for these companies.\nB1 [ S or U ] the chance of continuing success or existence for something: With falling audiences, the future of this theatre is in doubt. in future mainly UK (US usually in the future)\nB1 used at the beginning or end of a sentence in which there is a decision about a plan of action or a warning: Could you be more careful in future?\nSee more\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nyet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: verb forms, tenses & types of verbs\nSuccess and achievements\nfuture noun\n(MONEY)\nfutures [ plural ]\n&#160; finance &amp; economics\nagreements for the buying and selling of goods, in which the price is agreed before a particular future time at which the goods will be provided: the futures market\nSee more Grammar\nFutureThere is no future tense in English. We use several different ways to talk about the future. The most common are: …\nFuture: be going to (I am going to work)We use be going to + the base form of the verb: …\nBe going to: formWe use be going to + the base form of the verb: …\nBe going to: usesBe going to is commonly used in informal styles. …\nGonna (informal contexts)We use gonna /gənə/ instead of going to in informal contexts, especially in speaking and in song lyrics. We write gonna to show how to pronounce it: …\nBe going to or will?Will is often used in a similar way to be going to. Will is used when we are talking about something with absolute certainty. Be going to is used when we want to emphasise our decision or the evidence in the present: …\nFuture: present continuous to talk about the future (I’m working tomorrow)The present continuous can refer to the future. It shows that we have already decided something and usually that we have already made a plan or arrangements: …\nFuture: present simple to talk about the future (I work tomorrow)The present simple is used to refer to events in the future which are certain because they are facts, or because there is a clear or fixed schedule or timetable: …\nFuture: will and shallWill and shall are modal verbs. They are used with the base form of the main verb (They will go; I shall ask her). Shall is only used for future time reference with I and we, and is more formal than will. …\nFuture continuous (I will be working)We use will/shall + be + the -ing form of the verb. …\nFuture continuous: formWe use will/shall + be + the -ing form of the verb. …\nFuture continuous: useWe use the future continuous to refer to temporary actions and events that will be in progress at a particular time in the future: …\nFuture in the pastWhen we talk about the past, we sometimes want to refer to something which was in the future at the time we were speaking. We use past verb forms to do this: …\nFuture: other expressions to talk about the futureWe use a number of expressions with main verb be when we refer to the future, especially the immediate future. …\nBe about toWe use be about to + base form of the verb to refer to things that we expect to happen very soon. We often use it with just, for emphasis: …\nBe on the point ofWe can also use be on the point of + -ing form to refer to things that we expect to happen very soon. Be on the point of is similar to be just about to: …\nBe due toWe use be due to + base form of the verb to talk about things that are scheduled: …\nBe toBe to + base form of the verb has a number of meanings. It is rather formal. …\nFuture: typical errorsWe don’t use the present continuous when we predict something: …\nB1 happening or existing in the future: Of course we'll keep you up to date about any future developments. There's an old superstition that young girls going to bed on this night dream of their future husbands.\nlanguage The future form of a verb is used when talking about something that will happen or exist: future tense How do you say that in the future tense? for future reference\nused when you tell someone something so that it will be known about and can be used in the future: For future reference, could you use the headed paper for any correspondence that leaves this office?\nin order to be used or looked at some time in the future: I filed the documents away for future reference.\nSee more\nMore examplesFewer examplesOver the year we have had several debates about future policy.He detailed the future president's extracurricular activities while governor.She has been tipped as a future member of the Welsh Assembly.Speculation about his future plans is rife.Her technique became a standard against which all future methods were compared.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nyet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: verb forms, tenses & types of verbs\nGrammar\nFutureThere is no future tense in English. We use several different ways to talk about the future. The most common are: …\nFuture: be going to (I am going to work)We use be going to + the base form of the verb: …\nBe going to: formWe use be going to + the base form of the verb: …\nBe going to: usesBe going to is commonly used in informal styles. …\nGonna (informal contexts)We use gonna /gənə/ instead of going to in informal contexts, especially in speaking and in song lyrics. We write gonna to show how to pronounce it: …\nBe going to or will?Will is often used in a similar way to be going to. Will is used when we are talking about something with absolute certainty. Be going to is used when we want to emphasise our decision or the evidence in the present: …\nFuture: present continuous to talk about the future (I’m working tomorrow)The present continuous can refer to the future. It shows that we have already decided something and usually that we have already made a plan or arrangements: …\nFuture: present simple to talk about the future (I work tomorrow)The present simple is used to refer to events in the future which are certain because they are facts, or because there is a clear or fixed schedule or timetable: …\nFuture: will and shallWill and shall are modal verbs. They are used with the base form of the main verb (They will go; I shall ask her). Shall is only used for future time reference with I and we, and is more formal than will. …\nFuture continuous (I will be working)We use will/shall + be + the -ing form of the verb. …\nFuture continuous: formWe use will/shall + be + the -ing form of the verb. …\nFuture continuous: useWe use the future continuous to refer to temporary actions and events that will be in progress at a particular time in the future: …\nFuture in the pastWhen we talk about the past, we sometimes want to refer to something which was in the future at the time we were speaking. We use past verb forms to do this: …\nFuture: other expressions to talk about the futureWe use a number of expressions with main verb be when we refer to the future, especially the immediate future. …\nBe about toWe use be about to + base form of the verb to refer to things that we expect to happen very soon. We often use it with just, for emphasis: …\nBe on the point ofWe can also use be on the point of + -ing form to refer to things that we expect to happen very soon. Be on the point of is similar to be just about to: …\nBe due toWe use be due to + base form of the verb to talk about things that are scheduled: …\nBe toBe to + base form of the verb has a number of meanings. It is rather formal. …\nFuture: typical errorsWe don’t use the present continuous when we predict something: …\nfuture noun [C/U]\n(TIME)\nAdd to word list\nAdd to word list\ntime which is to come, or something that will happen or exist later: [ U ] What are your plans for the future? [ U ] We hope to buy a house in the foreseeable future. [ C ] He faces an uncertain future. [ U ] I really don’t expect any change in the near future. I’ll be sure to observe the speed limit in the future (= the next time).\nfuture noun [C/U]\n(CONDITION)\nthe conditions for success: [ U ] In 1903, Ford realized that the future of automobiles lay in making them faster and cheaper. [ C usually sing ] Candidates always promise a brighter future for Americans.\nfuture adjective [not gradable]\n(GRAMMAR)\ngrammar having the tense of the verb used to describe actions, events, or states that will happen or exist later: In the sentence, \"Who will look after the dog?\", the phrase \"will look\" is in the future tense.\nfuture adjective [not gradable]\n(TIME)\nhappening or existing later or in the future: She was aware that her writings might speak to future generations of African Americans."}