{"id":161013,"name":"futurist","type":"adjective","us_sound":"ˈfjuː.tʃɚ.ɪst","us_link":"../audio/f/usfurth013.mp3","uk_sound":"ˈfjuː.tʃər.ɪst","uk_link":"../audio/f/ukfurti024.mp3","content":"Add to word list\nAdd to word list\n(also Futurist) belonging or relating to futurism, a way of thinking in the arts that started in the early 20th century and tried to express through a range of art forms the characteristics and images of the modern age, such as machines, speed, movement, and power: a futurist painter Leading artists of the Russian avant-garde conveyed their messages in bold Futurist and Cubist designs. See\nfuturism\nMore examplesFewer examplesHe built his reputation in the art market by buying Futurist and Surrealist paintings shortly after the end of World War II.I came across Marinetti's more extended version of the Futurist creed.I forced myself to wade through the reams of Futurist manifestos.\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nessentialism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nnon-philosophical\nnotional\nontological\nontologically\nontology\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nsyllogism\nSee more results »\nfuturist noun [C]\n(EXPERT)\na person who makes statements about what will happen in the future based on their studies and knowledge: The Wall Street Journal had named me one of America's five leading business futurists.\nMore examplesFewer examples Some futurists even argue that utter data transparency - everyone knowing everything about everyone else - offers citizens their only defense against increasingly data-rich institutions.It hardly takes a futurist to see that design has emerged as a major force in American consumers' lives. Kurzweil is an inventor and futurist.Futurists use rational or scientific methods of anticipating future events.\nSMART Vocabulary: related words and phrases\nPeople who make predictions\nclairvoyant\ndiviner\ndoomsayer\nforecaster\nfortune teller\nfuturologist\nharbinger\npalmist\nprophet\nprophetess\npsychic\nseer\nsibyl\nsoothsayer\nvisionary\nfuturist noun [C]\n(ARTIST)\n(also Futurist) a supporter of futurism or an artist who uses a futurist style: the Italian Futurist Filippo Marinetti\nMore examplesFewer examplesShe loves Bauhaus, the Italian futurists, and British pop art.In 1910, five young Italian painters issued \"The Manifesto of the Futurists.\"\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nessentialism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nnon-philosophical\nnotional\nontological\nontologically\nontology\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nsyllogism\nSee more results »\nAdd to word list\nAdd to word list\nsomeone who studies social, political, and technical developments to understand what may happen in the future: Futurists see a time when shares of international corporations will be traded 24 hours a day in one electronic marketplace."}