{"id":316392,"name":"sabotage","type":"verb","us_sound":"ˈsæb.ə.tɑːʒ","us_link":"../audio/s/sabotage.mp3","uk_sound":"ˈsæb.ə.tɑːʒ","uk_link":"../audio/s/ukrutte015.mp3","content":"Add to word list\nAdd to word list\nto damage or destroy equipment, weapons, or buildings in order to prevent the success of an enemy or competitor: The rebels had tried to sabotage the oil pipeline.\nto intentionally prevent the success of a plan or action: This was a deliberate attempt to sabotage the ceasefire.\nMore examplesFewer examplesThe four Germans were convicted of planning to sabotage New York's water system after landing on Long Island in 1942.The insurgents had attempted to sabotage power and gas lines hundreds of miles outside the capital. She feared that her hot temper would sabotage her relationship with Bob and decided to see a therapist.She blamed him for trying to sabotage her career even though she was no longer signed to the company.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nthe act of damaging or destroying equipment, weapons, or buildings in order to prevent the success of an enemy or competitor: a campaign of industrial sabotage The sabotage of 20 oil pipelines threatens a new surge in fuel prices.\nthe act of intentionally preventing the success of a plan or action: They moved quickly to prevent further sabotage of their investigation. He could face sabotage from officials who fear they might suffer redundancy.\nMore examplesFewer examplesCities had been on alert for possible terrorist sabotage of water supplies since January.The group focuses on economic sabotage, such as blowing up power installations.He believed the explosion was sabotage.This almost looked like deliberate sabotage of his own success.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nshred\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nAdd to word list\nAdd to word list\nto intentionally damage or destroy property: Enemy agents had sabotaged the bridge. fig. The bombing was meant to sabotage the peace talks. sabotage noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈsæb·əˌtɑʒ/\nThe explosion was not an accident, it was sabotage.\nAdd to word list\nAdd to word list\nto intentionally damage or destroy something, for example equipment or a system, that belongs to someone else, so that it cannot be used: He claims the animal rights group sabotaged their vehicles and trailers.\nto intentionally do something that stops someone from achieving what they want or stops something from developing as it should: At that time the western aid programs were believed to be attempts to sabotage the Russian economy.\ndamage done intentionally to something, for example equipment or a system, that belongs to someone else, so that it cannot be used: The oil giant said it averaged 221 oil spills in recent years, because of aging equipment and sabotage. industrial/economic sabotage\nthe act of intentionally trying to stop someone from achieving something or to stop something from developing: To prevent further sabotage of their fraud investigation, FBI agents moved quickly."}