{"id":316816,"name":"sadness","type":"noun","us_sound":"ˈsæd.nəs","us_link":"../audio/s/sadness.mp3","uk_sound":"ˈsæd.nəs","uk_link":"../audio/s/uksacri021.mp3","content":"sadness noun [C or U]\n(FEELING)\nAdd to word list\nAdd to word list\nB2 the feeling of being unhappy, especially because something bad has happened: Her sadness at her grandfather's death was obvious.\nMore examplesFewer examplesShe spoke of her sadness over her father's death.It is with great sadness that we have learned of the passing of Joan Walsh.I knew that behind her smile was sadness.Her eyes expressed deep sadness.What comes across in his later poetry is a great sense of sadness.Her face emanated sadness.They shared each other's sadnesses as well as joys.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nmelancholia\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwretchedness\nSee more results »\nsadness noun [C or U]\n(BAD THING)\nsomething that is not satisfactory or pleasant and makes you feel shocked or angry: One of the sadnesses of the current situation is the number of young people growing up without hope. See\nsad\nMore examplesFewer examples\"That is the sadness of it all,\" he added. \"There are many residents of the city who are unaware - or, if aware, are not that concerned.\"One of the sadnesses about the current crisis is that we seem to be jettisoning the wonderful inclusivity that is a characteristic of our church.That would not only be a terrible sadness, it would be an educational disaster.That he would commit such a shameless and blatant act is the ultimate sporting sadness.\nSMART Vocabulary: related words and phrases\nNot good enough\nbe not on idiom\nbeneath\ncop\ndeficient\ndissatisfactory\nintolerably\nlame\nlamely\nlameness\nleave a lot to be desired idiom\nmedevac\nsecond-rate\nsuboptimal\nsubstandard\nthat will never do idiom\ntried and found wanting idiom\nunworthily\nunworthy\nwant\nweak\nSee more results »\nAdd to word list\nAdd to word list\nthe feeling of being sad or unhappy: There was a look of great sadness in his eyes."}