{"id":316869,"name":"safety","type":"noun","us_sound":"ˈseɪf.ti","us_link":"../audio/s/safety.mp3","uk_sound":"ˈseɪf.ti","uk_link":"../audio/s/uksafek004.mp3","content":"Add to word list\nAdd to word list\nB2 a state in which or a place where you are safe and not in danger or at risk: For your (comfort and) safety, we recommend you keep your seat belt loosely fastened during the flight. Reporters may enter the danger zone but unfortunately we cannot guarantee/assure their safety. The crew of the ship were winched to safety by a rescue helicopter. As the gunman opened fire, they all ran/dived for safety behind the trees. Police are concerned for the safety of (= think that something bad might have happened to) the five-year-old. He was led to a place of safety (= somewhere he would not be in danger, especially of being found and harmed).\nMore examplesFewer examplesConcern for the safety of the two missing teenagers is growing.The report is highly critical of safety standards at the factory.The airline is taking steps to ensure safety on its aircraft.Her parents fear for her safety.These measures were designed to improve car safety.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe\nsafe space\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nIdioms\nsafety first\nthere's safety in numbers\nAdd to word list\nAdd to word list\nthe condition of not being in danger or of not being dangerous: For your safety, keep your seat belt securely fastened. Fire officials worry about the safety of those heaters.\nAdd to word list\nAdd to word list\nthe state of being protected from danger or harm: You have a right to be protected against anything that can affect your safety. public/passenger/consumer safety\nthe condition of not being likely to cause damage or harm: the safety of sth Many people are wondering about the safety of some food imports. food/drug/product safety fire safety Apart from this one incident, the company has an excellent safety record.\nused before a noun to describe equipment, rules, etc. that are designed to keep people from being harmed: safety glasses The company is now a world leader in car safety seats. The iron's best safety feature is that it shuts off automatically. The building is not compliant with the new safety standards. The law requires a certificate showing that the latest safety tests have been carried out. safety procedures.\nair/workplace/mine, etc. safety\nthe fact of keeping people safe in a particular place: Fletcher is an independent mine safety consultant in New Zealand. We always make air safety our first priority. See also\nhealth and safety\nmargin of safety"}