{"id":316842,"name":"safe","type":"adjective","us_sound":"seɪf","us_link":"../audio/s/safe.mp3","uk_sound":"seɪf","uk_link":"../audio/s/uksacri027.mp3","content":"safe adjective\n(NOT IN DANGER)\nAdd to word list\nAdd to word list\nA1 not in danger or likely to be harmed: In some cities you don't feel safe going out alone at night.\nB1 not harmed or damaged: She said that all the hostages were safe. safe and sound\nC2 completely safe and without injury or damage: After three days lost in the mountains, all the climbers arrived home safe and sound.\nSee more\nMore examplesFewer examplesExperts seem unable to agree whether the drug is safe or not.It isn't safe to leave the house after dark.I never feel safe when I'm being driven by Richard.Don't go any closer - it might not be safe.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe space\nsafeguard\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUndamaged, unbroken or in good condition\nsafe adjective\n(NOT CAUSING HARM)\nA2 not dangerous or likely to cause harm: a safe play area for children a safe driver That ladder doesn't look safe. She wished us a safe journey. Is this medicine safe for children? It's safe to cross the road now.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe space\nsafeguard\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nsafe adjective\n(PLACE)\nC1 (of a place) where something is not likely to be lost or stolen: Keep your passport in a safe place.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe space\nsafeguard\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nsafe adjective\n(NO RISK)\nC1 used to refer to things that do not involve any risk: I think we should go for the safest option (= the one that involves the least risks). He never remembers my birthday, so it's a safe bet (= I am certain) he'll forget again this time!\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe space\nsafeguard\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nsafe adjective\n(PARLIAMENT)\nIf an official elected position in is safe, it is likely to be won by the political party that has won it at previous elections: a safe Conservative seat\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nsafe adjective\n(IN BASEBALL)\nIn baseball, if a player is safe, they have reached one of the bases (= positions that a player must reach to score a point) successfully before they have been tagged (= touched with the ball to end their turn) by an opponent or before the ball has been thrown to a player defending the base: The umpire called the runner safe. The throw was too late and Perez was safe at second base.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nfoul\nglove\nhomer\nliner\nsecond base\nshag\nshortstop\nslider\nslogger\nthe World Series\nSee more results »\nsafe adjective\n(GOOD)\nUK slang used to say that you like and approve of someone or something: He was a safe guy. He was decent, kind and caring, he put others before himself.\nUK slang used to show that you agree or are happy with something: \"You OK?\" \"Safe, man,\" Shaun muttered.\nMore examplesFewer examplesTyrone was safe, a top guy.He patted his pockets for money but Cory said \"Safe, man, I got a little change, I'll cover it.\"\"Who wants chicken?\" \"Yeah, safe.\"\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njim-dandy\njuicy\nkiller\nknock\nknock spots off something idiom\nlike a boss idiom\nout of sight idiom\nroyally\nrule OK idiom\nshabby\nshit hot\nsight\nsmashing\nsteal\nSee more results »\nRelated word\nsafenessIdioms\nas safe as houses\nin safe hands\nit's safe to say (that)\n(just) to be on the safe side\na strong box or cupboard with special locks where valuable things, especially money or jewels (= precious stones), are kept: Thieves broke into/cracked (= opened by force) the safe and stole everything in it.\njaroon/E+/GettyImages\nSMART Vocabulary: related words and phrases\nGeneral and miscellaneous containers\nBall jar\nbin\nbindle\nbiscuit tin\ncaddy\ndrum\nflowerpot\ngeocache\ngift box\ngunnysack\npacking case\npaintbox\npallet\npiggy bank\nplanter\nurn\nvivarium\nworkbasket\nworkbox\nwormery\nSee more results »\nsafe adjective\n(FREE FROM DANGER)\nAdd to word list\nAdd to word list\nfree from danger or harm, or not causing danger or harm: Have a safe trip. Is this medicine safe for children? I feel safe here.\nSafe also means not involving any risk or disagreement: She’s looking for some safer investments. [ + to infinitive ] With most of the votes counted now, I think it’s safe to say that we won.\nsafe adjective\n(BASEBALL)\n[ not gradable ] (of a player in the game of baseball) having successfully reached a base Idioms\nsafe and sound\nto be on the safe side\nsafe noun [C]\n(BOX)\na strong box, usually made of steel, with a door and lock, where valuable things, esp. money or jewels, can be kept\nAdd to word list\nAdd to word list\nSTOCK MARKET, FINANCE not involving much risk: His clients were told their money was being invested in safe Government bonds. This is a relatively safe investment when markets are uncertain.be safe to do sth For a while it was considered safe to invest in these \"alternative\" telecoms stocks.\nnot causing harm to people: safe working conditions Around 44% of men and 27% of women drank more than the recommended safe level of alcohol. It was important to have a safe place for children to play while their parents shopped.safe for sb The public must have access to the building, but it must also be safe for those who work in it.safe to buy/eat/use People are worried that the meat is not safe to eat.\nprotected from problems or harm: My manager assured me my job was safe.keep sb safe from sth The operators of the rides must keep customers safe from personal injury.\na safe bet\nsomething that involves little risk: Any investment in energy stock looks like a safe bet.\nsomething that will probably happen or is probably true: It is a safe bet that if the video game industry had not come along, some of those billions of dollars would have been put into more traditional forms of entertainment.\nbe on the safe side\nto be careful and to make a choice that involves little risk: Broadline Bank's spokesperson said that it would not be advertising on the controversial website \"just to be on the safe side\".\nin safe hands\nbeing cared for or dealt with by someone who is skilled and has a lot of experience: The shareholders were reassured that, with the new CEO in place, the company was in safe hands.\nit's safe to say (that)\nused to say that you are confident about what you are going to say: I think it's safe to say we expect the same kind of growth in the next quarter. See also\nplay verb\na strong box or room that can be locked, used for storing money or valuable things: Was the safe locked? a fireproof safe with a secure combination lockput/keep sth in a safe The café manager put the money in the safe. See also\nnight safe"}