{"id":316850,"name":"safeguard","type":"verb","us_sound":"ˈseɪf.ɡɑːrd","us_link":"../audio/s/safeguard.mp3","uk_sound":"ˈseɪf.ɡɑːd","uk_link":"../audio/s/uksacri030.mp3","content":"Add to word list\nAdd to word list\nto protect something from harm: The union safeguards the interests of all its members.\nto protect children or adults who could be hurt emotionally or physically: Extensive background checks on staff are carried out to safeguard children in schools.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nPhrasal verb\nsafeguard against something\na law, rule, or something that is done to protect someone or something from harm or damage: The disk has built-in safeguards to prevent certain errors. The industry has been criticised for not providing adequate safeguards against poisoning.\nMore examplesFewer examplesThe company did not have appropriate safeguards in place to manufacture drugs safely.Sufficient safeguards were not in place to double-check the results.The commission imposed strict environmental safeguards on the project.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe\nsafe space\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunthreatening\nuntouchable\nwell kept\nworthy\nSee more results »\nAdd to word list\nAdd to word list\nto protect someone or something from harm or destruction: Judges have an obligation to safeguard our right to free speech and a free press. safeguard noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈseɪf·ɡɑrd/\nThe best safeguard against someone stealing your car is to lock it.\nAdd to word list\nAdd to word list\nto protect someone or something so that they are not harmed, damaged, or lost: New steps are being taken to safeguard medical workers in the war zone.safeguard (sb/sth) against sth The agency did not consistently install protections to safeguard against unauthorized computer access.\nsomething that you do or provide in order to protect someone or something from harm, damage, or loss: safeguard for sth/sb The new laws contain important safeguards for credit card customers.safeguard against sth Keeping a large cash reserve is, for some airlines, the best safeguard against another bankruptcy."}