{"id":317248,"name":"salary","type":"noun","us_sound":"ˈsæl.ɚ.i","us_link":"../audio/s/salary.mp3","uk_sound":"ˈsæl.ər.i","uk_link":"../audio/s/uksalaa010.mp3","content":"Add to word list\nAdd to word list\nB1 a fixed amount of money agreed every year as pay for an employee, usually paid directly into his or her bank account every month: an annual salary of £40,000 His net monthly salary is €2,500. She's on quite a good/decent salary in her present job. He took a drop in (= accepted a lower) salary when he changed jobs. a ten percent salary increase Compare\nearnings\npay noun\nwage noun\nremuneration formal\nstipend\nMore examplesFewer examplesShe retired at 50 on a full salary.It's not by any means a brilliant salary but it's adequate for our needs.Your salary will be paid on the third week of each calendar month.They're raising three kids on one small salary so money is very tight.I wouldn't work for them if they paid me twice my current salary.\nSMART Vocabulary: related words and phrases\nEarning money\nassessable\nbank\nbase pay\nbasic\nbasic income\ndisposable income\nhand over fist idiom\nin arrears idiom\nline your pocket(s) idiom\nmake an honest living idiom\npro rata\nprofit from something\nprorate\npull\npull something down\nraise\nrake something in\nretainer\nrevenue\nsick pay\nSee more results »\nAdd to word list\nAdd to word list\naa fixed amount of money paid to someone for the work the person is employed to do, esp. the amount paid every year: a meager/generous salary Teachers’ salaries would rise an average of $1000 under the proposal. salaried adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈsæl·ə·rid/\nAll our salaried employees have agreed to take a pay cut.\nAdd to word list\nAdd to word list\nHR, WORKPLACE the total amount of money that an employee is paid every year to do their job, or one of the payments they receive each month as part of this: an annual/a monthly salary Her annual salary exceeds €100,000.be on a salary of sth He must be on a salary of at least $90,000.pay sb a salary of sth I was being paid a salary of around $75,000. earn/get a salary high/low salarysalary increase/cut Employees say they expect salary cuts of 13% or more. Your starting salary will be in line with your previous experience.on (a) salary I have six more months on salary after I step down. He earns about $1.2 million in salary and benefits at the bank. a competitive salary See also\naverage salary\nbase salary\nbasic salary\nfinal-salary\nnet salary\nstarting salary"}