{"id":317260,"name":"sale","type":"noun","us_sound":"seɪl","us_link":"../audio/s/sail.mp3","uk_sound":"seɪl","uk_link":"../audio/s/uksafek020.mp3","content":"sale noun\n(SELL)\nAdd to word list\nAdd to word list\nB2 [ C or U ] an act of exchanging something for money: The sale of cigarettes/alcohol is forbidden. The building company gets commission on each house sale. I haven't made a sale all morning. They'll drop the price rather than lose the sale. for sale\nA2 available to buy: Is this painting for sale? Our neighbours put their house up for sale (= started to advertise that they want to sell it) last week. sales [ U, + sing/pl verb ]\nthe department of a company that organizes and does the selling of the company's products or services: He works in Sales. the sales department/manager sales [ plural ]\nB2 the number of products sold: Sales this year exceeded the total for the two previous years. See also\ntelesales\n[ C ] an occasion when things are sold in order to make money: a charity/Christmas/book saleUS a garage/yard sale\n[ C ] an auction (= public sale): a sale of antique furniture a cattle sale on sale B1\navailable to buy in a shop: On sale at record stores now. sale or return\na system by which goods are supplied to shopsand can be returned if they are not sold within a particular period of time: We can supply goods on a sale or return basis.\nMore examplesFewer examplesThe government passed a law to restrict the sale of guns.Eleven million bottles of water had to be withdrawn from sale due to a health scare.Proceeds from the sale of the cards go to local charities.We'll split the proceeds from the sale.We found a buyer for our house, but then the sale fell through.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who sell things\nShops & auctions\nsale noun\n(CHEAP PRICE)\nA2 [ C ] an occasion when goods are sold at a lower price than usual: a mid-season/end-of-season sale a clearance/closing-down sale I bought this in the January sales. sale goods/prices on sale A2 mainly US (UK usually in the sale)\nreduced in price: Can you tell me if this dress is in the sale?\nMore examplesFewer examplesI got some shoes cheap in the sale.Don't miss out on the fantastic bargains in our summer sale.She picked up some real bargains in the sale.The summer sales are now on.I went sale shopping.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice decreases\nsale noun\n(ACT OF SELLING)\nAdd to word list\nAdd to word list\n[ C/U ] an act of exchanging something for money: [ U ] You pay tax on the profits from the sale of buildings. [ C ] The school raised money from book sales, bake sales, and individual contributors. [ U ] When I bought this house, there were many, many homes for sale (= available to be bought).\nsale noun\n(GOODS AT LOWER PRICE)\n[ C ] an occasion when goods are sold at a lower price than usual: a clearance sale Are these dresses on sale (= reduced in price)?\nAdd to word list\nAdd to word list\nCOMMERCE the act or process of selling something: make a sale The salesman was eager to make a quick sale. agree a salecomplete/close a sale When the time came to close the sale, another page had been added to the contract.sale of sth The sale of tobacco items to minors is prohibited. car/house/ticket sales online/internet sales\nCOMMERCE a period when a store is selling things at lower prices than usual: have a sale a mid-season sale the January/July salesin the sale(s) I got a new coat for $50 in the sales.\nan occasion when a particular type of product is being sold: The library has a book sale every year. a sale of Oriental carpets\nsales\n[ plural ]\n&#160; FINANCE, COMMERCE the number of products sold and the amount of money a company receives from selling its products and services: The South African fruit company has annual sales of $750 million.sales rise/increase/go up Last year sales rose by 14% to €8.4 million. sales fall/decline/go downdecline/fall/reduction in sales Management is worried about the decline in sales. The department achieved its monthly sales target.\nsales\n[ U ]\n&#160; WORKPLACE the business of selling products or services, or the department in a company that is responsible for selling them: sales staff/department/officesales call/brochure These techniques can increase the effectiveness of your sales calls.work/be in sales My father worked in sales for forty years. She used to be an administrator in the production department, but now she is in sales.\nfor sale\nbeing sold by the person or organization that owns it, and available to buy: The building has been for sale for thirteen months.put sth up for sale We have decided to put the company up for sale.\non sale\navailable to buy: Tickets are on sale now! Everything goes on sale as soon as the doors open.\nbeing sold for a lower price than usual: All their men's clothing is on sale this week.\nsale as seen UK\nused to say that the person selling a product or possession does not promise that what they are selling is in good condition or suitable for a particular purpose: The house is being sold sale as seen. Secondhand fitted kitchen for sale as seen. See also\nagreement of sale\nbill of sale\ncash sale\nclearance sale\nclosing-down sale\ncomparable-store sales\nconditional sale\nconditions of sale\ncost of sales\ncredit sale\nView all\ndirect sale\nend-of-season sale\nfield sales\nfire sale\nfirm sale\nforward sale\ngross sales\nindirect sale\nlast sale\nnet sales\npoint of sale\nprivate sale\npublic sale\nretail sales\nsame-store sales\nsheriff's sale\nshort sale\ntax sale\ntrade sale\nunit sales\nwash sale\nwhite sale"}