{"id":317592,"name":"salty","type":"adjective","us_sound":"ˈsɑːl.t̬i","us_link":"../audio/s/salty.mp3","uk_sound":"ˈsɒl.ti","uk_link":"../audio/s/uksalti003.mp3","content":"salty adjective\n(CONTAINING SALT)\nAdd to word list\nAdd to word list\nB2 tasting of salt or containing a lot of salt: This bacon is too salty for me. I love peanuts and other salty snacks.\nMore examplesFewer examplesBabies are not used to sweet or salty tastes. The salty flavour of the fish combines well with the sweeter flavor of tomato sauce.The lake's salty waters don't freeze over.\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsavory\nsavoury\nseasoned\nunseasoned\nunsweetened\nvelvety\nvinous\nwiney\nSee more results »\nsalty adjective\n(ANGRY/NOT POLITE)\ninformal, informal annoyed or upset, especially when this is unreasonable: I don't know why she's acting salty. He got salty with me because I wouldn't go out with him.\ninformal critical in a slightly funny way: She shocks students and colleagues with her salty wit.\ninformal not polite and using swear words (= rude and offensive words): He admits that there's more public swearing now but maintains that salty language is nothing new. My advice would be not to tell salty jokes in a wedding speech.\nMore examplesFewer examplesHe's the only person I got salty with because I overheard him saying he didn't like my girlfriend.Promoters would get salty because you have to miss a show to bury your father. His language became saltier and he started shouting.\nSMART Vocabulary: related words and phrases\nAngry and displeased\nacridly\nacrimonious\nacrimoniously\naggrieved\namused\nexasperatedly\nfed up\nfed up to the back teeth idiom\nfit to be tied idiom\nfractiously\nmurder\nnot be a happy camper idiom\noutraged\npeeved\npiqued\nvenomous\nwarpath\nwound up\nwrathful\nwrathfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnkind, cruel & unfeeling\nSwearing and blasphemy\nRelated word\nsaltiness\nAdd to word list\nAdd to word list\ntasting or smelling like salt: salty popcorn salty sea air"}