{"id":317881,"name":"sample","type":"noun","us_sound":"ˈsæm.pəl","us_link":"../audio/s/sample.mp3","uk_sound":"ˈsɑːm.pəl","uk_link":"../audio/s/uksalti030.mp3","content":"sample noun [C]\n(SMALL AMOUNT)\nAdd to word list\nAdd to word list\nB2 a small amount of something that shows you what the rest is or should be like: a free sample of shampoo samples of carpet/curtain material Please bring some samples of your work to the interview.\nC2 a small amount of a substance that a doctor or scientist collects in order to examine it: a blood/urine sample\nB2 a group of people or things that is chosen out of a larger number and is asked questions or tested in order to get information about the larger group: a random sample of voters a nationally representative sample of 200 schools\nMore examplesFewer examplesWe asked a random sample of people what they thought.The study was carried out with such a small sample that its results are invalidWater samples taken from streams were analysed for contamination by chemicals.They looked at the blood samples under the microscope.The samples varied in quality but were generally acceptable.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nshowpiece\nspecimen\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nsample noun [C]\n(MUSIC)\na small part of a song that has been recorded and used to make a new piece of music\nSMART Vocabulary: related words and phrases\nSound and image recordings\naudiobook\nautotune\nB-side\nBlu-ray\nbox set\ncompact disc\nconcept album\njewel case\nLP\nMD\nMiniDisc\nmix\nmultitrack\nreissue\nsharpness\ntagging\ntalking head\nvideo clip\nVOD\nVR\nSee more results »\nsample verb [T]\n(SMALL AMOUNT)\nto taste a small amount of food or drink to decide if you like it: As the food looked so good, he decided to sample a little from each dish.\nC2 to experience a place or an activity, often for the first time: So you're going to sample the delights/pleasures of the new restaurant?\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking\nExperiencing and suffering\nsample verb [T]\n(MUSIC)\nmusic\n&#160; specialized to record part of a song and use the recording to make a new piece of music: This song has been heavily sampled.\nSMART Vocabulary: related words and phrases\nPop, rock & soul\nagit-pop\nanti-rock\nbacking dancer\nbacking singer\nbackspin\ndisc jockey\nDJ\ndrum and bass\nelectronica\nemo\nhooky\njukebox\nK-pop\nlyrically\nmod\nMotown\nTin Pan Alley\ntop ten\ntrap music\ntrip-hop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nAdd to word list\nAdd to word list\na small amount of something which shows what the rest is or should be like: a free sample a blood/tissue sample The booklet contains sample questions and answers.\nA sample of people is a small group that is tested to obtain information about the larger group: The poll is based on a random sample of Montgomery voters.\nto take or try a small amount of something: He sampled a little of each dish. Buma sampled opinions from people in both countries.\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING a small amount of a substance, product, etc. that shows someone thinking of buying it what it is like: a carpet/fabric/product sample Write to us and we will send you a free sample.\nMARKETING a group of people chosen from a larger group, who give their opinions, answer questions, etc. in order to provide information about the whole group: a sample of sth A sample of three HR Managers and 30 employees was selected and interviewed. The marketing poll was conducted by telephone among a representative sample of 1,136 adults. a large/small sample\na small amount of a substance or product that is tested to find out whether it is good, whether it contains a particular substance, etc.: The investigation into tainted pet food has grown to include tests of 700 samples. The next step will be to build a few dozen samples of each device and send them out for testing in both urban and rural settings.\nSee also\njudgment sample\nquota sample\nrandom sample\nsale by sample\nCOMMERCE, MARKETING to try a small amount of a product, or try a service for a short time, in order to see whether you want to buy it: On a typical overseas tour, a buyer could sample 120 wines in a day. They are recruiting 2,500 telephone customers to sample the service for 12 months.\nMARKETING to ask for the opinions of a number of people chosen from a group, in order to get information about the whole group: The survey sampled 150 chief executives from both large and small companies.\nto test a small amount of a substance or product to find out whether it is good, whether it contains a particular substance, etc.: sample sth for sth Before the food can be sold to markets and stores, the FDA samples goods for defects."}