{"id":317966,"name":"sanction","type":"noun","us_sound":"ˈsæŋk.ʃən","us_link":"../audio/s/sanction.mp3","uk_sound":"ˈsæŋk.ʃən","uk_link":"../audio/s/uksampl012.mp3","content":"sanction noun\n(ORDER)\nAdd to word list\nAdd to word list\n[ C usually plural ] an official order, such as the stopping of trade, that is taken against a country in order to make it obey international law: Many nations have imposed sanctions on the country because of its attacks on its own people. Trade/economic sanctions will only be lifted (= stopped) when the aggressor nation withdraws its troops.\nC2 [ C ] a strong action taken in order to make people obey a law or rule, or a punishment given when they do not obey: Without realistic sanctions, some teachers have difficulty keeping order in the classroom.\nMore examplesFewer examplesA package of economic sanctions is to be enacted against the country.The UN has imposed punitive sanctions on the invading country.The UN announced its intentions to toughen sanctions still further.She is in favour of a relaxation of the sanctions.People were surprised at the time by the severity of the sanctions.\nSMART Vocabulary: related words and phrases\nUK politics: legislation & law-making\nabolish\nabrogate\nabrogation\namend\namendment\nassemblyman\nconstitutionally\nenact\nenforce\nGreen Paper\nguillotine\nhard Brexit idiom\nirrepealable\njurisprudence\nPMQs\npocket veto\npresiding officer\nPrime Minister's Questions\nprivate member's bill\nwrit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nsanction noun\n(APPROVAL)\n[ U ] approval or permission, especially formal or legal: They tried to get official sanction for the plans.\nThesaurus: synonyms, antonyms, and examples\nthe state of agreeing with someone or somethingagreementThere's widespread agreement that something must be done.acceptanceHis views never gained acceptance among the broader community.concordanceThe study shows strong concordance between patient health and patient happiness. assentThe bill received royal assent.consentI give my consent to the marriage.sanctionShe gave official state sanction to the drilling company for their proposed pipeline.\nSee more results »\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmit of something\nallow of something\nallowable\napproval\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nsanction verb [T]\n(ALLOW)\nto formally give permission for something: The government was reluctant to sanction intervention in the crisis.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nsanction verb [T]\n(PUNISH)\nto punish someone for something, especially officially: Prospective jurors can be sanctioned for attempting to avoid jury duty.\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nsentence\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nsanction noun\n(APPROVAL)\nAdd to word list\nAdd to word list\n[ U ] fml approval or permission: To be just, a government must have the sanction of the governed. Note: usually describes formal or legal approval\nsanction noun\n(PUNISHMENT)\n[ C usually pl ] an official action taken against a government to force it to behave in a particular way or as punishment for not doing so: trade/economic sanctions\nsanction verb [T]\n(PERMIT)\nto formally permit something: The UN sanctioned intervention in the crisis.\nAdd to word list\nAdd to word list\n[ C, usually plural ]\n&#160; POLITICS an official order to stop or limit trade or communication with a country in order to make it obey international law: sanctions on sth This averted the threat of American sanctions on Japanese car exports.impose sanctions against/on sb The UN Security Council imposed sanctions on the country to curb its nuclear program. economic/financial/trade sanctions drop/ease/lift sanctions apply/enforce sanctions international sanctions\n[ C ]\n&#160; LAW a punishment given when someone does not obey a rule or a law: criminal/legal sanctions The State Department needs to determine how it will apply sanctions. He could face sanctions if a judge concludes he violated the terms of his probation.\n[ U ]\n&#160; LAW formal or legal approval or permission: sanction for sth Agricultural companies in the area cannot get official sanction for logging.\nto formally give permission for something: sanction a bid/deal The directors would only sanction an €18 million bid. The government has sanctioned 20% income tax relief .\nLAW to punish someone for not obeying a law or rule: sanction sb for (doing) sth The state is threatening to sanction employers for hiring illegal workers."}