{"id":318274,"name":"sanitization","type":"noun","us_sound":"ˌsæn.ə.təˈzeɪ.ʃən","us_link":"../audio/s/eus74062.mp3","uk_sound":"ˌsæn.ɪ.taɪˈzeɪ.ʃən","uk_link":"../audio/s/uksands018.mp3","content":"sanitization noun [U]\n(CLEANING)\nAdd to word list\nAdd to word list\nmainly US the act or process of making something completely clean and free from bacteria: For more thorough sanitization, put the feeding tray in the dishwasher after use. Officials posted at airports are requiring sanitization of shoes of travellers who have been around livestock in affected countries.\nMore examplesFewer examplesThe factory was forced to close for weeks for sanitization and testing. He wrote some guidelines on food safety and santization in restaurants. After just two weeks, nurses using the milder soap and alcohol method of hand sanitization reported healthier skin.\nSMART Vocabulary: related words and phrases\nCleaning generally\nbrush someone/something off\ncleaner\ncleaning\ncleanse\ncleansing\ngroom\nhoovering\nmop\npick\npick someone/something up\npurification\npurifier\nrinse\nscrub\nspring-cleaning\nsqueegee\nsteam-clean\nsterilization\nsterilizing\nswill\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nsanitization noun [U]\n(CHANGING)\nthe act of changing something in order to make it less strongly expressed, less harmful, or less offensive: This sanitization of death is comparatively recent. He says something must be done to stop the sanitization of literature.\nMore examplesFewer examplesThere's no sanitization of history in this film.The sanitization and romanticization of the military and warfare are hardly ever challenged. You can't make a programme about the Holocaust without conveying some of the awful reality that took place, otherwise that's meaningless sanitization.\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nrewrite\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nsteepness\nSee more results »\nSee\nsanitize"}