{"id":318976,"name":"satellite","type":"noun","us_sound":"ˈsæt̬.əl.aɪt","us_link":"../audio/s/satellite.mp3","uk_sound":"ˈsæt.əl.aɪt","uk_link":"../audio/s/uksatan005.mp3","content":"satellite noun [C]\n(IN SPACE)\nAdd to word list\nAdd to word list\nB2 a device sent up into space to travel around the earth, used for collecting information or communicating by radio, television, etc.: The World Cup was transmitted around the world by satellite. a spy/weather satellite satellite television/TV\nErik Simonsen/Photographer's Choice/GettyImages\na natural object moving around a larger object in space: The moon is Earth's satellite.\nMore examplesFewer examplesThe satellite will fragment and burn up as it falls through the earth's atmosphere.We hope to bring you a live report from Ouagadougou via our satellite hook-up.The concert was beamed by satellite all over the world.The satellite will observe objects that are particularly interesting astronomically.The arrival of satellite television changed the face of broadcasting.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nsatellite noun [C]\n(COUNTRY)\n(also satellite state) a country controlled by or depending on a more powerful country Compare\nclient state\nSMART Vocabulary: related words and phrases\nColonization & self-government\nacknowledgement of country\nannex\nannexation\nanti-colonial\nanti-colonialism\ncolony\ncommonwealth\ncondominium\ncrown colony\ndecolonization\nindependence\nIndependence Day\nintercolonial\nland acknowledgment\nNat\nsecede\nsecession\nself-determination\nself-governing\nself-government\nSee more results »\nAdd to word list\nAdd to word list\nphysics a natural object moving around a larger object in space, or an artificial object sent up into space to travel around the earth: a spy/weather satellite The moon is a satellite of the earth.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMUNICATIONS a piece of equipment that is sent up into space to travel round the Earth, used for collecting information or communicating by radio, television, etc.: The cost of launching a satellite into orbit is vast.by satellite He will address the Trade Convention by satellite on Friday. satellite radio/phone/communications a satellite photograph/map/image\n[ U ]\n&#160; COMMUNICATIONS →\nsatellite television : on satellite The match will only be shown on satellite. Their satellite and cable division sells programme sponsorship. a satellite broadcaster/provider/company a satellite channel/show/service\n[ C ] an organization or place that is controlled by or depends on a bigger or more powerful place: a satellite of sth The company is an overseas satellite of South Africa's Anglo American Corporation. a satellite state/city"}