{"id":319088,"name":"satisfy","type":"verb","us_sound":"ˈsæt̬.ɪs.faɪ","us_link":"../audio/s/eus74070.mp3","uk_sound":"ˈsæt.ɪs.faɪ","uk_link":"../audio/s/uksatan018.mp3","content":"satisfy verb [T]\n(WANTING)\nAdd to word list\nAdd to word list\nB2 to please someone by giving them what they want or need: They have 31 flavours of ice cream - enough to satisfy everyone! Come on, satisfy my curiosity (= tell me what I want to know) - what happened last night? satisfy conditions/needs/requirements\nC1 to have or provide something that is needed or wanted: She satisfies all the requirements for the job.\nSee more\nMore examplesFewer examplesThe dispute was settled by an agreement that satisfied both sides.She satisfies all the requirements for the job.The candidates listed below have failed to satisfy the examiners.Nothing, it seemed, would satisfy his insatiable curiosity.We hope to reach an agreement which will satisfy the interests of both parties concerned.\nSMART Vocabulary: related words and phrases\nCausing pleasure\nagreeable\nagreeableness\nagreeably\nall things to all people idiom\nattractive\ndelightful\ndelightfully\ndistraction\ndiverting\ndivertingly\nhomely\nhomey\nindulgent\nindulgently\njovial\nsensually\nsensuous\nsensuously\nserendipitous\nsweeten\nSee more results »\nsatisfy verb [T]\n(BELIEVING)\nto make someone believe that something is true: His explanation satisfied the court. [ + (that) ] I satisfied myself (that) I had locked the door.formal The authorities were satisfied of (= they accepted) the seriousness of his situation.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReassuring\nAdd to word list\nAdd to word list\nto please someone by giving the person something that is wanted or needed, or to make someone feel pleased because a particular desired result has happened: Giving the baby her bottle seemed to satisfy her, and she stopped crying. I am not really satisfied with the job you did.\nTo satisfy a standard is to show that you are qualified for it: I’d like to go to that college if I can satisfy the entrance requirements.\nTo be satisfied is also to be sure, with all your doubts removed: [ + that clause ] I’m satisfied that the doctors did all they could to save her."}