{"id":319084,"name":"satisfactory","type":"adjective","us_sound":"ˌsæt̬.ɪsˈfæk.tɚ.i","us_link":"../audio/s/satisfactory.mp3","uk_sound":"ˌsæt.ɪsˈfæk.tər.i","uk_link":"../audio/s/uksatan016.mp3","content":"Add to word list\nAdd to word list\nB2 good or good enough for a particular need or purpose: The teachers seem to think his work is satisfactory. We hope very much to find a satisfactory solution to the problem. The outcome of the discussion was highly satisfactory (= very pleasing). Synonym\nacceptableOpposite\nunsatisfactory\nThesaurus: synonyms, antonyms, and examples\ngood enough but not excellentacceptableYour essay was acceptable, but I think you could have done better.reasonableThey have a reasonable chance of winning.adequateThe law provides adequate compensation for robbery victims.passableI speak passable Spanish. will doIt's not perfect, but it'll do.\nSee more results »\nMore examplesFewer examplesI still haven't received a satisfactory explanation.The meeting failed to produce a satisfactory outcome.He was at the time making satisfactory progress at school.I am convinced that in time we will find a satisfactory solution to the problem.Can we now be sure that schools are providing education of a satisfactory standard?\nSMART Vocabulary: related words and phrases\nQuite good, or not very good\nacceptable\nacceptably\nadequacy\nadequate\nadequately\nhalf decent\niffy\nimpure\nindifferent\nindifferently\npassably\npatchily\npatchiness\npatchy\npresentably\nscratch\nspotty\nthe/your average bear idiom\nup to scratch idiom\nweedy\nSee more results »\nRelated word\nsatisfactorily\nAdd to word list\nAdd to word list\ngood or good enough, esp. for a particular need or purpose: We did not feel the response was satisfactory and asked for more information. Her progress so far has been satisfactory, and we expect a full recovery. satisfactorily adverb us\nYour browser doesn't support HTML5 audio\n/ˌsæt̬·əsˈfæk·tər·ə·li/\nThe heating system is working satisfactorily now.\nAdd to word list\nAdd to word list\ngood or good enough for a particular need or purpose: a satisfactory outcome/result/solution a satisfactory performance/progressdo a satisfactory job The task of the customer's representative is to get a satisfactory job done as economically as possible. The rules allow for the development of television advertising and sponsorship while providing a satisfactory level of consumer protection."}