{"id":319078,"name":"satisfaction","type":"noun","us_sound":"ˌsæt̬.ɪsˈfæk.ʃən","us_link":"../audio/s/satisfaction.mp3","uk_sound":"ˌsæt.ɪsˈfæk.ʃən","uk_link":"../audio/s/uksatan014.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a pleasant feeling that you get when you receive something you wanted, or when you have done something you wanted to do: She looked at the finished painting with satisfaction. She derived/obtained great satisfaction from/out of helping other people. For me, job satisfaction is more important than the money. She had the satisfaction of knowing that she'd done everything she could.\n[ U ] formal a way of dealing with a complaint or problem that makes the person who complained feel happy: You've sold me a defective product and I demand satisfaction (= you must return my money or give me a new product).\n[ U ] the act of fulfilling (= achieving) a need or wish: the satisfaction of one's sexual desires to someone's satisfaction\nC2 in a way that a particular person can believe or accept: The boy explained to the satisfaction of the court why he had lied.\nC2 in a way that a particular person feels pleased or satisfied with: He won't get paid until he completes the job to my satisfaction.\nMore examplesFewer examplesShe felt a warm glow of satisfaction.The Finance Minister's fall from grace gave the tabloid press great satisfaction.I get a lot of satisfaction from cooking.It gave me great satisfaction to learn that he'd been sacked.She smiled with satisfaction.\nSMART Vocabulary: related words and phrases\nSatisfied and complacent\nat one with the world idiom\nbe on to a good thing idiom\nbuoyant\ncomplacency\ncomplacent\ncomplacently\nnicely\npride\nrest on your laurels idiom\nrewardingly\nsate\nself-content\nself-contented\nself-contentedly\nself-fulfilled\nself-fulfilment\nthis is the life! idiom\ntriumphalism\nundiscouraged\nvirtuously\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuitable and acceptable\nAdd to word list\nAdd to word list\nthe pleasant feeling you get when you receive something you wanted, or when you have done or are doing something you wanted to do: [ U ] She looked at the finished painting with satisfaction. [ U ] He had the satisfaction of knowing he had done the right thing. [ U ] The job had to be done to our satisfaction (= to a standard that we approved).\nSatisfaction is also the condition of having a desire or need fulfilled.\nAdd to word list\nAdd to word list\na pleasant feeling that you get when you receive something you wanted, or when you have done something you wanted to do: have the satisfaction of (doing) sth In our job, we have the satisfaction of knowing we are making a difference. What career values are central to an individual's career satisfaction? client/consumer/employee satisfaction\na situation in which your complaint or problem is dealt with in a way you consider acceptable: You've sold me a faulty product, and I demand satisfaction.\nto the satisfaction of sb (also to sb's satisfaction)\nif something is done to someone's satisfaction, they are happy with the result: Was the work successfully completed to the client's satisfaction?\nSee also\ncustomer satisfaction\njob satisfaction"}