{"id":319359,"name":"save","type":"verb","us_sound":"seɪv","us_link":"../audio/s/save.mp3","uk_sound":"seɪv","uk_link":"../audio/s/uksauce016.mp3","content":"save verb\n(MAKE SAFE)\nAdd to word list\nAdd to word list\nB1 [ T ] to stop someone or something from being killed, injured, or destroyed: Wearing seat belts has saved many lives.save someone from something He fell in the river but his friend saved him from drowning. He had to borrow money to save his business. He was desperately trying to save their failing marriage.save the planet We all need to do our part to save the planet.save a match The former tennis champion was now serving to save the match (= to win the next point so that the other player did not win this part of the competition). save someone's life\nB1 to keep someone from dying: He knocked the gun out of the guy's hand and in so doing saved her life.\ninformal to help someone escape from a difficult or unpleasant situation: Thanks for helping me with that report - you saved my life!\nSee more\nMore examplesFewer examplesConservationists are fighting to save our hedgerows.The doctors made one last desperate attempt to save the boy's life.Many brave men fell in the fight to save the city.Drastic measures must be taken if we are to save the planet.We did everything we could to save her but she died.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nlifeguard\nreclaim\nrecycled\nrenewal\nreprieve\nrescue\nrescuer\nreusable\nsustain\nunadopted\nunappropriated\nunassigned\nundesignated\nupcycle\nSee more results »\nsave verb\n(KEEP)\nA2 [ I or T ] to keep something, especially money, for use in the future: Tom's been saving his pocket money every week.save (up) for We're saving (up) for a new car. I save all my old letters in case I want to read them again. Save me a place at your table, OK?\nThesaurus: synonyms, antonyms, and examples\nto keep somethingkeepI've kept all my grandmother's jewellery.storeI've stored all Helen's books in the attic.stashHis money was stashed in a cupboard.saveI have some really good chocolates that I've been saving for a special occasion.hang ontoYou should hang onto that picture - it might be worth something.\nSee more results »\nA2 [ I or T ] to put information into a computer's memory or onto a computer disk: Don't forget to save your work regularly. To save, press Control S.\nMore examplesFewer examplesI've never been very good at saving money.Try to save some money for your holiday.I thought I'd save the champagne for a special occasion.I saved a couple of chocolates to give to Ben.He'd saved the email to show me.\nSMART Vocabulary: related words and phrases\nSaving money\nbank\ndeposit\ndeposit account\ndepositor\ndirect deposit\nISA\non deposit idiom\npension plan\nput\nput something aside\nput something by\nredeposit\nretirement plan\nsalt\nsalt something away\nsquirrel\nsquirrel something away\nTESSA\nundersaver\nwar chest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nsave the date\nto record or remember the date of a future event and not arrange anything else on that date, so that you are free to go to it: Be sure to save the date and join us for a fun-filled day in the country! Appointment cards help patients save the date and remember their appointments. See also\nsave the date\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInviting & summoning\nsave verb\n(NOT WASTE)\nB1 [ I or T ] to prevent time, money, or effort being wasted or spent: You'll save time if you take the car. [ + two objects ] Thanks for your help - it saved me a lot of work. [ + -ing verb ] I'll lend you a bag for your trip - it'll save you buying one.save it for later informal Can you save it for later (= tell me your news later when I am less busy)?\nMore examplesFewer examplesIf we cut across the field, it'll save time.We'd save time on our journey if we went by train.It would save time if we did the two tasks together.I'll pick up your book while I'm there and it will save you the bother.I could speak on your behalf and it would save you from going.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nsave verb\n(SPORT)\nB2 [ T ] in football and similar games, to stop the ball from going into the goal when a player on the other team has kicked or hit it\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdioms\ncan't do something to save your life\nsave someone's bacon/neck\nsave your breath\nsave your own skin/hide\nsave the day\nsaved by the bellPhrasal verbs\nsave on something\nsave (something) up\nin football or similar games, when a player stops the ball from going into the goal when it is hit or kicked by a player from the other team: make a save The goalkeeper made a great save in the last minute of the game.\nin baseball, an occasion when a pitcher (= a player who throws the ball) comes into a game that their team is only just winning, plays until the end, and prevents the other team from winning: get a save Franco retired the last three hitters to get the save.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nbut or except for: They found all the lost documents save one.\nSMART Vocabulary: related words and phrases\nExcluding\nacid-free\napart\naside\nbar\nbar none idiom\nbarring\ncount\ndiscount\nexclude\nexcluding\nexclusion\nexclusionist\nexclusively\nnegative\non/from the sidelines idiom\nostracism\nostracize\notherwise\nout of it idiom\nstand-alone\nSee more results »\nsave verb\n(MAKE SAFE)\nAdd to word list\nAdd to word list\n[ T ] to make or keep someone or something safe from danger or harm, or to bring something back to a satisfactory condition: She jumped into the pool and saved the child from drowning. His leg was partly crushed in the accident but the surgeon was able to save it. Smoke detectors can save lives.\nsave verb\n(KEEP)\n[ I/T ] to keep money or something else for use in the future: [ I ] I’m saving (up) for a new bike and I’ve got almost $100. [ T ] If you save the receipts from your business trip, the company will reimburse you. [ T ] I forgot to get milk – will you save my place in line while I get it?\n[ I/T ] technology To save information on a computer is to store it in a computer file.\nsave verb\n(NOT WASTE)\n[ I/T ] to prevent time, money, or effort from being lost or spent, or to help someone by taking an action to prevent time, money, etc., from being lost: [ T ] You’ll save time if you take the car. [ T ] The governor claims he can save the taxpayers $10 million a year. [ T ] If you’d stop and pick up the kids on your way home, it will save me from having to do it later.\nIdioms\nsave your breath\nsave facePhrasal verb\nsave on something\nsave noun [C]\n(SPORTS)\n(in some sports) the stopping of the ball or other object from going into the goal you are defending: We watched a soccer game on TV, and the goalie made several spectacular saves.\nsave preposition\n(EXCEPT)\nbut or except (for): They found all the lost documents save one. The walls were bare save for a poster.\nAdd to word list\nAdd to word list\nFINANCE to keep money so that you can use it in the future: save (up) for sth They are saving for a deposit on a house.save (sth) to do sth His father saved enough money to open a grocery store.\nto avoid using or wasting something such as time, money, or effort: save energy/money/time By combining those operations, the organizations will save $1.5 million annually.save sb sth Thanks for your help - it saved me a lot of work. The upgraded bond ratings could save the city $10 million.save on sth If people do not want paper billing, we save on mailing costs.\nIT to put information on a computer onto a computer disk: save sth to sth Save the file to the hard disk.save sth as sth The plug-in lets you save files as MP3s. When you are working on the computer, make sure that you save regularly.\nsave (sb's) face\nto avoid or help someone avoid seeming stupid or being embarrassed: The industry is simply trying to save face by dropping a lawsuit they realize is a loser. Compare\nface-saving"}