{"id":319362,"name":"saved","type":"verb","us_sound":"seɪv","us_link":"../audio/s/save.mp3","uk_sound":"seɪv","uk_link":"../audio/s/uksauce016.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nsave\nsave verb\n(MAKE SAFE)\nB1 [ T ] to stop someone or something from being killed, injured, or destroyed: Wearing seat belts has saved many lives. He fell in the river but his friend saved him from drowning. He had to borrow money to save his business. He was desperately trying to save their failing marriage. We all need to do our part to save the planet. The former tennis champion was now serving to save the match (= to win the next point so that the other player did not win this part of the competition). save someone's life\nB1 to stop someone from being killed\ninformal to help someone escape from a difficult or unpleasant situation: Thanks for helping me with that report - you saved my life!\nMore examplesFewer examplesConservationists are fighting to save our hedgerows.The doctors made one last desperate attempt to save the boy's life.Many brave men fell in the fight to save the city.Drastic measures must be taken if we are to save the planet.We did everything we could to save her but she died.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nlifeguard\nreclaim\nrecycled\nrenewal\nreprieve\nrescue\nrescuer\nreusable\nsustain\nunadopted\nunappropriated\nunassigned\nundesignated\nupcycle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHelping and co-operating\nsave verb\n(KEEP)\nA2 [ I or T ] to keep something, especially money, for use in the future: Tom's been saving his pocket money every week. We're saving (up) for a new car. I save all my old letters in case I want to read them again. Save me a place at your table, OK?\nThesaurus: synonyms, antonyms, and examples\nto keep somethingkeepI've kept all my grandmother's jewellery.storeI've stored all Helen's books in the attic.stashHis money was stashed in a cupboard.saveI have some really good chocolates that I've been saving for a special occasion.hang ontoYou should hang onto that picture - it might be worth something.\nSee more results »\nA2 [ I or T ] to put information into a computer's memory or onto a computer disk: Don't forget to save your work regularly. To save, press Control S.\nMore examplesFewer examplesI've never been very good at saving money.Try to save some money for your holiday.I thought I'd save the champagne for a special occasion.I saved a couple of chocolates to give to Ben.He'd saved the email to show me.\nSMART Vocabulary: related words and phrases\nSaving money\nbank\ndeposit\ndeposit account\ndepositor\ndirect deposit\nISA\non deposit idiom\npension plan\nput\nput something aside\nput something by\nredeposit\nretirement plan\nsalt\nsalt something away\nsquirrel\nsquirrel something away\nTESSA\nundersaver\nwar chest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nsave verb\n(NOT WASTE)\nB1 [ I or T ] to prevent time, money, or effort being wasted or spent: You'll save time if you take the car. [ + two objects ] Thanks for your help - it saved me a lot of work. [ + -ing verb ] I'll lend you a bag for your trip - it'll save you buying one.informal Can you save it for later (= tell me your news later when I am less busy)?\nMore examplesFewer examplesIf we cut across the field, it'll save time.We'd save time on our journey if we went by train.It would save time if we did the two tasks together.I'll pick up your book while I'm there and it will save you the bother.I could speak on your behalf and it would save you from going.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nsave verb\n(SPORT)\nB2 [ T ] in football and similar games, to stop the ball from going into the goal when a player on the other team has kicked or hit it\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdioms\ncan't do something to save your life\nsave someone's bacon/neck\nsave your breath\nsave your own skin/hide\nsave the day\nsaved by the bellPhrasal verbs\nsave on something\nsave (something) up"}