{"id":319376,"name":"saving","type":"noun","us_sound":"ˈseɪ.vɪŋ","us_link":"../audio/s/ussatch018.mp3","uk_sound":"ˈseɪ.vɪŋ","uk_link":"../audio/s/uksauce018.mp3","content":"savings [ plural ]\nAdd to word list\nAdd to word list\nB2 the money that you keep in an account in a bank or similar financial organization: He spent all his savings on an expensive car.\nMore examplesFewer examplesWe've made huge savings this year with our staffing budget.I'm sure there are other areas where we could make savings.That could mean a saving of up to five hundred pounds a year.At £270, this represents a significant saving on the usual charge.We've cut back our operating expenses at a saving of over £25,000.\nC1 [ C ] an amount of money that you do not need to spend: You can make huge savings (= save a lot of money) by buying food in bulk.\nSMART Vocabulary: related words and phrases\nInterest & capital\nannualized\nAPR\nbank rate\ncapital intensive\ncoffer\ncompound\nconcessional\nfinance\ninterest\ninterest-bearing\nlending rate\nnon-derivative\nPremium Bond\nprincipal\nsimple interest\nsinking fund\nstock\nthe purse strings idiom\nvested interest\nworking capital\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaving money\nBudgeting money\nmaking it possible to use less of the stated thing: a time-saving recipe a money-saving offer a labour-saving device\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\nbuffer\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nAdd to word list\nAdd to word list\nused to describe something that allows you to use less of a particular thing: The card comes complete with two money-saving offers. energy-saving features/materials/technologies a time-saving device See also\nface-saving\nlabour-saving\ntimesaving\n[ C ] an amount of something that you do not use or spend: Their intention is to keep costs down and this saving can be passed on to customers.a saving/savings on sth The company claims to be able to deliver savings on cars of as much as 50%.make a saving/make savings Young drivers can make considerable savings on their car insurance by taking a few simple steps.\nsavings\n[ plural ]\n&#160; BANKING, FINANCE money that you keep, usually in a bank account, instead of spending it: Savers should ask branches if they could make more money by moving their savings into newer accounts.\n[ U ]\n&#160; BANKING, FINANCE the activity of keeping money so that you can use it in the future: We try to teach children the importance of regular saving. The current voluntary system is unlikely to deliver a solution to the problem of inadequate pension saving.\n[ U ]\n&#160; ECONOMICS a situation in which total income is greater than money spent: domestic/household saving The resulting decline in economic growth should of course be blamed on the low rate of domestic saving and not on the falling dollar. National saving would be unaffected by the reform. Compare\ndissaving See also\ncost saving\nforced saving\npersonal saving"}