{"id":319424,"name":"savoury","type":"adjective","us_sound":"ˈseɪ.vɚ.i","us_link":"../audio/s/cdo0319ussavo1509.mp3","uk_sound":"ˈseɪ.vər.i","uk_link":"../audio/s/uksauce022.mp3","content":"Add to word list\nAdd to word list\nSavoury food is salty or spicy and not sweet in taste: a savoury dish/sauce/flavour savoury dumplings/pancakes A pie can be sweet or savoury.\nIf you say that something is not savoury, you mean that it is not pleasant or socially acceptable: savoury reputation That hotel doesn't have a very savoury reputation.\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsalty\nsavory\nseasoned\nunseasoned\nunsweetened\nvelvety\nvinous\nwiney\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorality and rules of behaviour\na food or dish that is salty or spicy and not sweet in taste: There was a selection of sandwiches and other small savouries.\nfood &amp; drink\n&#160; specialized (also savoury course) an extra course (= part of a meal) served at the end of a meal, especially in formal meals in the past: I could do the dessert and you could do the savoury. The savoury course used to be extremely popular. Here are the dishes for the roast course, the cheese, the savouries and the desserts.\nMore examplesFewer examplesEveryone was then treated to an array of traditional savouries and desserts.He indicated a bowl of savouries on a low table.Savouries are often served on toast, fried bread or some kind of biscuit or cracker.The gentlemen used to eat their savouries and go off to drink brandy, and the ladies had their sweets and went off to play cards.\nSMART Vocabulary: related words and phrases\nSavoury dishes\nAlfredo\nAmerican chop suey\narancini\narroz con pollo\nbaba ghanoush\ndumpling\nduxelles\nedamame\negg foo yong\neggs Benedict\nmatelote\nmatzo ball\nmixed grill\nmochi\nmomo\nscrambled eggs\nscrapple\nshabu-shabu\nshakshuka\nshashlik\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals"}