{"id":319692,"name":"scale","type":"noun","us_sound":"skeɪl","us_link":"../audio/s/scale.mp3","uk_sound":"skeɪl","uk_link":"../audio/s/uksax__019.mp3","content":"scale noun\n(MEASURE)\nAdd to word list\nAdd to word list\nB2 [ C ] a set of numbers, amounts, etc., used to measure or compare the level of something: the Centigrade/Fahrenheit scale How would you rate his work on a scale of 1 to 5?\nB2 [ C or U ] the relation between the real size of something and its size on a map, model, or diagram: a scale of 1:50,000 This map is large scale (= things are shown in detail). Is the bridge drawn to scale (= so that it shows the exact shape of the bridge, but much smaller)? He was building a scale model of the Empire State Building.\nMore examplesFewer examplesFilms are rated on a scale of poor, fair, good and excellent.Like all reading book schemes, these books are on a graduated scale of difficulty.On a scale of one to ten, I'd rate his latest book a five.The new salary scale only refers to company managers and directors.Management have offered an extra 2% to staff on the lowest end of the pay scale.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nModels & moulds\nMeasurements in general\nscale noun\n(SIZE)\nB2 [ S or U ] the size or level of something, especially when this is large: We don't yet know the scale of the problem. Nuclear weapons cause destruction on a massive scale (= cause a lot of destruction). My parents used to entertain friends on a large/small scale (= they had large/small parties).\nMore examplesFewer examplesHe doesn't seem to comprehend the scale of the problemThis is a story about theft, fraud and deceit on an incredible scale.If the drought continues, deaths will occur on a massive scale.They enjoyed success on a scale unparalleled by any previous pop group.This century has witnessed environmental destruction on an unprecedented scale.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nscale noun\n(MACHINE)\nscales [ plural ] UK (US scale)\nB2 a device for weighing things or people: kitchen/bathroom scales\nPeter Dazeley/Photographer's Choice/GettyImages\nMore examplesFewer examplesShe weighs herself every week on the scales in the bathroom.Step on the scales.Are your scales accurate?Her last baby tipped the scales at ten pounds.According to your scales I'm half a stone lighter.\na pair of scales mainly UK\na weighing device with two containers connected to a metal bar that is free to move up and down about its fixed central point. An object of known weight is put in one container and the thing to be weighed is put in the other.\noceane2508/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nMeasuring, weighing, & counting devices\ndial\ndipstick\nfitness tracker\ngage\ngamma counter\ngamma meter\ngauge\ngradation\nhydrograph\nindicator\nmicrometer\nplumb line\nprobe\nsensor\nsmart meter\nstraight edge\ntracker\nvoltmeter\nwand\nweather balloon\nSee more results »\nscale noun\n(MUSIC)\n[ C ] a set of notes played or sung in order, going up or down: the scale of G major You should practise your scales every day.\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nregister\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nscale noun\n(SKIN)\n[ C usually plural ] one of the many very small, flat pieces that cover the skin of fish, snakes, etc.\nSMART Vocabulary: related words and phrases\nThe skin, hair & bone of non-human animals\nbaleen\nbristly\nbushy\ncoated\ndander\ndowny\neiderdown\nfleece\nfurry\ngoatskin\nhackles\nhorsehair\nlambswool\nmane\nmother-of-pearl\nsable\nsealskin\nseashell\nspine\nwishbone\nSee more results »\nscale noun\n(COVERING)\n[ U ] (UK also limescale) a hard, white or grey layer of material that forms on the inside of pipes or containers that heat water\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsubstratum\nsuperstratum\ntar paper\nuncover\nvarnish\nSee more results »\nIdioms\nlarge/small-scale\noff the scale\nthe scales fall from someone's eyes\nscale verb [T]\n(CLIMB)\nto climb up a steep surface, such as a wall or the side of a mountain, often using special equipment: The prisoner scaled the high prison wall and ran off.\nThesaurus: synonyms, antonyms, and examples\nto move onto or towards the top of somethingclimbIt was an effort to climb the stairs.ascendShe ascended the podium and began to speak.scaleHe claims to have scaled every peak of the Himalayas.mountThe cowboy mounted his horse and rode off into the sunset.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nrise\nshin\nshinny\nunscalable\nupwardly\nSee more results »\nscale verb [T]\n(CLEAN TEETH)\nmedical\n&#160; specialized to remove tartar (= hard white substance) and plaque (= soft substance in which bacteria breed) from teeth: The dentist scaled and polished my teeth last week.\nSMART Vocabulary: related words and phrases\nDentistry\nbrace\ncavity\ncentral giant cell granuloma\ndam\ndental floss\ndental hygienist\ndental practitioner\ndental surgeon\ndentigerous cyst\ndentistry\nextraction\ngrind\nhygienist\nodontologist\nodontology\noral irrigator\noral surgeon\northodontic\northodontist\ntoothpick\nSee more results »\nIdiom\nscale the heightsPhrasal verbs\nscale something down\nscale something up\nscale noun\n(MEASURING SYSTEM)\nAdd to word list\nAdd to word list\n[ C ] a range of numbers used as a system to measure or compare things: Restaurant ratings are on a scale of zero to five stars.\nscale noun\n(SERIES OF MARKS)\n[ C ] a series of marks in a line with regular spaces between them for measuring, or an object for measuring marked in this way: The two scales show inches and centimeters.\nscale noun\n(SIZE/LEVEL)\n[ U ]\n&#160; art the size or level of something in comparison to what is average: Our problems are like those in the city, just on a smaller scale.\nscale noun\n(WEIGHING DEVICE)\n[ C ] a device for weighing people or things: a baby scale a postal scale\nscale noun\n(SIZE RELATIONSHIP)\n[ C/U ] the relationship of the size of a map, drawing, or model of something to the size of the actual thing: [ C ] The model was built at a 1-inch-to-1-foot scale.\nscale noun\n(MUSIC)\n[ C ]\n&#160; music a set of musical notes in which each note is higher or lower than the previous one by a particular amount: Tyler practices scales on the piano every day.\nscale noun\n(SKIN)\n[ C usually pl ] any of the thin pieces of hard skin covering the bodies of fish, snakes, and lizards\nscale verb [T]\n(CLIMB)\nto climb up something steep, such as a cliff or wall: He scaled a steep cliff beside the river. Phrasal verbs\nscale back/down (something)\nscale up (something)\nAdd to word list\nAdd to word list\n[ S or U ] the size or level of something, especially when this is large: the scale of sth We failed to recognize the scale of the problem. on a large/small scale. on a global/national/international scale\n[ C ]\n&#160; MEASURES a set of numbers, amounts, etc. used to measure or compare the level of something: on a scale of 1 to 10/zero to 100, etc. How would you rate his work on a scale of 1 to 5? at the top/bottom of the scale\n[ C or U ]\n&#160; GRAPHS &amp; CHARTS the relation between the real size of something and its size on a map, model, or diagram: to scale The map is drawn to scale. a scale drawing/model\n(also UK scales) a piece of equipment for weighing things or people: The mail is weighed on a scale. See also\ndiseconomies of scale\neconomies of scale\nlarge-scale\npay scale\nsalary scale\nsliding scale\nsmall-scale\ntimescale\nwage scale"}