{"id":319790,"name":"scam","type":"noun","us_sound":"skæm","us_link":"../audio/s/scam.mp3","uk_sound":"skæm","uk_link":"../audio/s/uksax__029.mp3","content":"Add to word list\nAdd to word list\na dishonest plan for making money or getting an advantage, especially one that involves tricking people: Banks often carry information about email scams on their websites. To avoid scams, never sign things in a hurry. an insurance scam\nMore examplesFewer examplesThere was an investigation to see who was behind the scam.Many travellers have fallen victim to the scam.There are a lot of online stores, and some of them are scam sites.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfiddle\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrafficking & racketeering\nto trick someone into giving you money or giving you some advantage, in a dishonest and often illegal way: He was scammed out of $500 in what he thought was a legitimate way to get US immigration papers. They totally scammed us! Related word\nscammer\nMore examplesFewer examplesPolice say the men scammed as many as 30 elderly victims.A lot of people don't realize they're being scammed until it's too late.Even the most tech-savvy consumer can be scammed.\nSMART Vocabulary: related words and phrases\nCheating & tricking\nanti-fraud\nbad faith\nbamboozle\nbilk\nblackmail\ndeceive\ndiddle\nfiddle\nflannel\ngrifter\ngull\nhave an eye to/for the main chance idiom\nhave someone on\nhoax\npretextual\npull\npull a fast one idiom\npull the wool over someone's eyes idiom\npunk\nracket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrafficking & racketeering\nAdd to word list\nAdd to word list\na dishonest or illegal plan or activity, esp. one for making money: She was involved in an insurance scam, collecting on false accident claims.\nAdd to word list\nAdd to word list\nan illegal way of making money, usually by tricking people: The police are warning of a repeated phone scam that targets tax payers. an internet scam"}