{"id":319828,"name":"scandal","type":"noun","us_sound":"ˈskæn.dəl","us_link":"../audio/s/scandal.mp3","uk_sound":"ˈskæn.dəl","uk_link":"../audio/s/ukscamp004.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] (an action or event that causes) a public feeling of shock and strong moral disapproval: a financial/political/sex scandal Their affair caused/created a scandal in the office. The scandal broke (= became public knowledge) right at the beginning of the Conservative Party Conference. If there is the slightest suggestion/hint of scandal, the public will no longer trust us.\n[ U ] reports about actions or events that cause shock and disapproval: Some magazines contain nothing but scandal and gossip. to spread scandal\n[ S ] a situation that is extremely bad: [ + (that) ] It's a scandal (that) children are treated in this way.\nMore examplesFewer examplesIt was a political scandal which damaged a lot of reputations.This latest scandal has raised doubts about his suitability for the post.This latest episode in the fraud scandal has shocked a lot of people.So could this scandal bring down the government?A drugs scandal could end her career overnight.\nSMART Vocabulary: related words and phrases\nMorally wrong and evil\nabhorrent\nabhorrently\namoral\namorality\nanomie\ndissipated\ndissolute\ndissolutely\ndissoluteness\nenormity\nnefariousness\nno good idiom\nno more Mr Nice Guy idiom\nnon-ethical\nobscene\nturpitude\nunconscionable\nunconscionably\nunethical\nunprincipled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGossip and rumour\nAdd to word list\nAdd to word list\nan action or event that is considered immoral, causing the public to react with shock or anger: [ C ] People withdrew their money from banks caught up in the scandal. scandalous adjective us\nYour browser doesn't support HTML5 audio\n/ˈskæn·dəl·əs/\nShe has a reputation for spreading scandalous gossip.\nAdd to word list\nAdd to word list\n[ C or U ] an action or event that shocks people and makes them feel disapproval: cause/create (a) scandal The politician's behaviour caused a scandal.a scandal breaks/erupts When the subprime loan scandal broke, the value of houses fell. He still gets paid, despite leaving under a cloud of scandal. be caught up/involved in a scandal a financial/mis-selling/corruption scandal\n[ U ] reports about actions or events that cause shock and disapproval: There was gossip and scandal, but it never affected his business dealings.\nit's a scandal\nused for saying that you think a situation is very bad and should not be allowed or accepted: It's a scandal that employees could be treated in this way."}