{"id":319826,"name":"scan","type":"verb","us_sound":"skæn","us_link":"../audio/s/scan.mp3","uk_sound":"skæn","uk_link":"../audio/s/ukscamp003.mp3","content":"scan verb\n(LOOK)\nAdd to word list\nAdd to word list\nC2 [ T ] to look at something carefully, with the eyes or with a machine, in order to get information: She anxiously scanned the faces of the men leaving the train. Doug scanned the horizon for any sign of the boat. Synonyms\ncheck (EXAMINE)\ncheck something out (EXAMINE) informal\nexamine (LOOK AT CAREFULLY)\ninspect\nperuse formal\nstudy (EXAMINE)\nsurvey (LOOK AT) formal\nC1 [ I + adv/prep, T ] to look through a text quickly in order to find a piece of information that you want or to get a general idea of what the text contains: I scanned through the booklet but couldn't find the address. Scan the newspaper article quickly and make a note of the main points.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReading\nscan verb\n(MAKE PICTURE)\nC1 [ I or T ] to use a machine to put a picture of a document into a computer, or to take a picture of the inside of something: I'll just scan the article into the computer. Volunteers' brains were scanned while they looked at the pictures. All hand luggage has to be scanned.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCopying and copies\nscan verb\n(POEM)\n[ I ]\n&#160; literature\n&#160; specialized If a poem or part of a poem scans, it follows a pattern of regular beats: This line doesn't scan - it has too many syllables.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nsuperheroine\nswashbuckler\nsympathetically\ntanka\ntartan noir\nSee more results »\n[ S ] a careful or quick look through something: I gave the book a quick scan, and decided not to buy it.\nC2 [ C ] a medical examination in which an image of the inside of the body is made using a special machine: to do a brain scan to have an ultrasound scan\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nAdd to word list\nAdd to word list\nto examine something carefully: [ I ] This technique is used to scan for defective genes.\nIf an image or text on paper is scanned into a computer, it is changed into electronic information by a special device: [ T ] A little hand-held device beeps as soon as it has scanned a bar code.\nIf you scan a text you read it quickly: [ T ] I scanned a few pages of the book and thought it looked interesting.\nthe act of looking at or through something carefully or quickly: A quick scan of my calendar shows that I’m pretty busy this week. a security scan of passengers’ bags\nA scan is an examination of the inside of something, such as part of the body or a package, using a computerized device to produce an image of what cannot be seen with the eyes: a medical scan of the head\nAdd to word list\nAdd to word list\nIT, COMMERCE to use a piece of electronic equipment to get information from something such as a bank card or a product's barcode: The barcode is scanned to get the price of the product.\nIT to use a machine to make a copy of a document or picture and put it into a computer: He scanned the document and emailed it to the head office.\nto look through a text quickly in order to find a piece of information that you want or to get a general idea of what it is about: I scanned the article looking for details, but didn't find anything.\n[ C ]\n&#160; IT a picture of a document that has been put into a computer: The machine received a good score for its color scans.\n[ S ] a quick look through something, especially in order to check that it is good enough: Can you give this letter a quick scan?"}