{"id":319988,"name":"scar","type":"noun","us_sound":"skɑːr","us_link":"../audio/s/scar.mp3","uk_sound":"skɑːr","uk_link":"../audio/s/ukscamp016.mp3","content":"Add to word list\nAdd to word list\nB2 a mark left on part of the body after an injury, such as a cut, has healed: a prominent/a noticeable/an ugly scar That burn will leave a bad scar. scar tissue Compare\nscab noun (SKIN)\nThesaurus: synonyms, antonyms, and examples\ndamage to the bodyinjuryHe was treated for minor injuries.woundMost of the casualties had gunshot wounds.cutHe walked away from the car crash with only cuts and bruises. gashHe was bleeding profusely from a deep gash in his leg.scratchShe had little scratches all over her arms. lacerationA doctor's report said the laceration had cut the jugular vein.\nSee more results »\nsasirin pamai/iStock/Getty Images Plus/GettyImages\nC1 a sign of damage to a person's mental state: His early years in the refugee camp left a deep psychological scar.\na sign of physical destruction in a place: Every village bears the scars of war .\nMore examplesFewer examplesHe had a long scar across his cheek.Her scar healed, but the redness remained for a long time.His face is covered with scar tissue where he was badly burned.\"Just look at this scar!\" said Aaron proudly, rolling up his trouser leg.They did a very neat job stitching up your knee - there's hardly a scar there.\nSMART Vocabulary: related words and phrases\nSkin complaints & blemishes\nabscess\nage spot\nanti-crack\nanti-dandruff\nanti-leprosy\nanti-ulcer\nblotch\ncarbuncle\ncold sore\ndermatitis\nmelanoma\npocky\nport wine stain\npruritic\npruritus\npyoderma gangrenosum\nscald\nshingle\nulcer\nweal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMental illnesses\nDestroying and demolishing\nC2 to leave a scar: He was scarred as a result of the fire.figurative His experiences in the army left him scarred for life (= had a serious mental effect on him for the rest of his life). Synonym\nmark\nSMART Vocabulary: related words and phrases\nSkin complaints & blemishes\nabscess\nage spot\nanti-crack\nanti-dandruff\nanti-leprosy\nanti-ulcer\nblotch\ncarbuncle\ncold sore\ndermatitis\nmelanoma\npocky\nport wine stain\npruritic\npruritus\npyoderma gangrenosum\nscald\nshingle\nulcer\nweal\nSee more results »\nAdd to word list\nAdd to word list\na mark left on the skin by a cut or burn that has healed: fig. The loss of a parent causes permanent scars for many children. scar verb [ T ] us\nYour browser doesn't support HTML5 audio\n/skɑr/ -rr-\nShe was badly scarred by the fire."}