{"id":320007,"name":"scarcely","type":"adverb","us_sound":"ˈskers.li","us_link":"../audio/s/scarcely.mp3","uk_sound":"ˈskeəs.li","uk_link":"../audio/s/ukscamp018.mp3","content":"scarcely adverb\n(ONLY JUST)\nAdd to word list\nAdd to word list\nC2 almost not: I was scarcely able to move my arm after the accident. I could scarcely believe it when she said she wanted to marry me.\nused to say that something happened immediately after something else happened: I had scarcely sat down/Scarcely had I sat down to eat when the phone rang. Synonyms\nbarely\nhardly\nMore examplesFewer examplesI scarcely registered the fact that he was there.I scarcely heard him laugh all night.The city centre has scarcely changed in over a century.She spoke so quietly that I could scarcely hear her.By this time he was so drunk he could scarcely stand up.\nSMART Vocabulary: related words and phrases\nMerely and barely\nall\nall of something idiom\nat a pinch idiom\nbarely\nbut\nby a whisker idiom\nby inches idiom\nhardly\nill\ninch\njust\nlittle\nmere\nmerely\nmerest\nnarrowly\nnothing more than idiom\nonly\nscarce\nwhisker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBefore, after and already\nCloseness in distance and time\nscarcely adverb\n(NOT)\ncertainly not: I'd scarcely have done it if I didn't think it was absolutely necessary! He's only two - you can scarcely blame him for behaving badly. Synonym\nhardly\nSMART Vocabulary: related words and phrases\nYes, no & not\na sure thing idiom\naffirmation\naffirmatively\nain't\nbetcha\nbit\ndidn't\ndis\ndoes a bear/do bears shit in the woods? idiom\nfar\nhardly\nno way idiom\nnot that idiom\nslight\nsure\nwasn't\nweren't\nwon't\nwouldn't be seen dead idiom\nyes\nSee more results »\nGrammar\nScarcelyScarcely means ‘almost not at all’. It is quite formal. It usually comes in the normal mid position for adverbs (between the subject and the main verb, or after the modal verb or first auxiliary verb, or after be as a main verb): …\nscarcely adverb [not gradable]\n(ONLY JUST)\nAdd to word list\nAdd to word list\nonly just or almost not: I could scarcely move my arm after the accident.\nscarcely adverb [not gradable]\n(NOT)\nfml certainly not: He would scarcely have broken it on purpose."}