{"id":320258,"name":"scene","type":"noun","us_sound":"siːn","us_link":"../audio/s/scene.mp3","uk_sound":"siːn","uk_link":"../audio/s/ukscarl019.mp3","content":"scene noun\n(THEATRE/FILM)\nAdd to word list\nAdd to word list\nB1 [ C ] a part of a play or film in which the action stays in one place for a continuous period of time: the funeral/wedding scene nude/sex scenes Juliet dies in Act IV, Scene iii.\nMore examplesFewer examplesThe whole of the banquet scene is mimed.In the first scene, the camera moves slowly across the room.It took seven retakes to get the scene exactly right.a steamy love sceneThe love scenes were very tender.\nSMART Vocabulary: related words and phrases\nCinema & theatre: parts of plays, shows & films\nact\nbeat\nblooper reel\nbyplay\ncurtain call\ndream sequence\nexeunt\nexit\nfinale\nflashback\nfourth wall\nframing\nintermission\nmeet-cute\nplot hole\nset piece\nshowstopper\nstage direction\nwrap party\nSee more results »\nscene noun\n(VIEW)\nB2 [ C ] a view or picture of a place, event, or activity: Lowry painted street scenes. scenes of everyday lifefigurative There were scenes of great joy as the hostages were reunited with their families.\nMore examplesFewer examplesa scene of desolationOur window looked out on a beautiful alpine scene.The painting depicts an idyllic pastoral scene of shepherds watching over their grazing sheep.Picture the scene - the crowds of people and animals, the noise, the dirt.There is a battle scene on the front cover.\nSMART Vocabulary: related words and phrases\nPictures\n-scape\nabstract\naquatint\nautostereogram\nballoon\ncanvas\ncaricature\ngraphic arts\ngraphic novel\nhalo\nhellscape\nidentikit\npastel\npencil\nposter\nraster\nrehang\nscreen print\nshade\nsketch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: scenery & views\nscene noun\n(PLACE)\nB2 [ C usually singular ] a place where an unpleasant event has happened: The police arrived to find a scene of horrifying destruction. Evidence was found at the scene of the crime.\nMore examplesFewer examplesDoctors pronounced him clinically dead at the scene of the accident.Ambulances, police cars and fire engines all converged on the scene.Bloodstained clothing was found near the scene.A knife was found at the scene of the crime.The car had been abandoned two kilometres away from the scene of the robbery.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nscene noun\n(AREA)\nB2 [ S ] a particular area of activity and all the people or things connected with it: the pop/political/drugs/gay scene Rap music arrived/came/appeared on the scene in the early 1980s.informal I'd rather go to a jazz concert - I'm afraid opera isn't really my scene (= is not the type of thing I like).\nMore examplesFewer examplesthe club scenethe British contemporary dance sceneShe's the most exciting British singer to emerge on the pop scene for a decade.He broke onto the music scene with his first single.The newcomer on the radio scene is a commercial station devoted to classical music.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nscene noun\n(ARGUMENT)\nC2 [ C ] an expression of great anger or similar feelings, often between two people, or an occasion when this happens: There was a terrible scene and Jayne ended up in tears. The other visitors in the room look on in stunned silence: They've never witnessed such a scene before.\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\ncontentiousness\ncontretemps\nding-dong\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npile\nrhubarb\nspat\nsquabble\nSee more results »\nIdioms\nbe on the scene\nbehind the scenes\nmake a scene\nset the scene\nscene noun\n(PLAY/MOVIE)\nAdd to word list\nAdd to word list\n[ C ] a part of a play or movie in which the action stays in one place for a continuous period: The opening scene of the movie was filmed in New York City.\nscene noun\n(VIEW)\n[ C ] a view or picture of a place: The scene from the mountaintop was breathtaking. He painted a street scene.\nscene noun\n(PLACE)\n[ C usually sing ] a place where an actual or imagined event happens: He was convicted of leaving the scene of an accident. Dozens of firefighters converged on the scene (= they arrived at the place quickly).\nscene noun\n(EVENT)\n[ C ] an event, actual or imaginary: The novel recalls scenes from an era that's vanished.\nscene noun\n(AREA)\n[ U ] a particular area of activity or way of life: the fashion/music scene He disappeared from the political scene after failing to win reelection.\nscene noun\n(SHOW)\n[ C ] a show of emotion or anger: She made a scene at the checkout when I wouldn’t buy her any candy."}