{"id":320281,"name":"scent","type":"noun","us_sound":"sent","us_link":"../audio/s/cent.mp3","uk_sound":"sent","uk_link":"../audio/s/ukcensu002.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] a pleasant natural smell: the scent of roses\nThesaurus: synonyms, antonyms, and examples\na smellsmellWhat's that terrible smell?aromaThe delicious aroma of fresh bread wafted out of the bakery.fragranceI adore the delicate fragrance of roses.perfumeThe perfume of the flowers filled the room.scentShe smelled the sweet scent of the lilies.odourUK There was the unmistakable odour of sweaty feet.\nSee more results »\n[ C ] a smell produced by an animal that acts as a signal to other animals: The hounds had lost the scent of the fox near the river.\n[ C or U ] a pleasant-smelling liquid that people put on their skin: a bottle of scent Synonym\nperfume\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nToiletry & perfumes\nIdioms\non the scent\nthrow/put someone off the scent\nIf an animal scents something or someone, it knows that person or thing is there because it can smell it, him, or her.\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nIf a person scents something, they have a feeling that they are about to experience it: Halfway through the game, the team could already scent victory.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmigrate\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPredicting things and intuition\nIdiom\nscent blood\nscent noun [C/U]\n(SMELL)\nAdd to word list\nAdd to word list\na smell, esp. when pleasant, or a smell left behind by an animal or person: [ C ] The scent of lilacs permeated the air. [ C ] The dogs were onto the lost boy’s scent (= were following his smell).\nScent is also perfume (= liquid with a pleasant smell).\nscent verb [T]\n(FILL WITH SMELL)\nto fill an area or place with a smell, esp. a pleasant smell: Perfume scented the air.\nscent verb [T]\n(DISCOVER)\nto discover someone or something by smelling: The dogs eventually scented the fox.\nIf you scent something, you have a feeling that something exists or is present: We could scent danger/trouble/success."}