{"id":320398,"name":"scheme","type":"noun","us_sound":"skiːm","us_link":"../audio/s/scheme.mp3","uk_sound":"skiːm","uk_link":"../audio/s/uksched006.mp3","content":"Add to word list\nAdd to word list\nan organized plan for doing something, especially something dishonest or illegal that will bring a good result for you: He has a hare-brained/crazy scheme for getting rich before he's 20.\nB2 mainly UK an officially organized plan or system: Under the current marking/mark scheme, you need 90 percent to get an A. a training/housing/play scheme a pension/savings scheme There's a new scheme in our town for recycling plastic bottles. Class sizes will increase under the new scheme.\nMore examplesFewer examplesThe scheme is simple and cheap to operate.She's come up with some amazing scheme to double her income.The scheme was launched a year ago.a management training schemeThe scheme is devised for young people in the 15 - 20 age band.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theorist\nconspiracy theory\nconspirator\nconspire\nentrap\nhatch\nplotter\nploy\npretext\npretextual\nput-up job\nset something up\nsting\ntrap\nwheeze\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nIdiom\nthe scheme of things\nto make clever, secret plans that often deceive others: All her assistants were scheming against her. [ + to infinitive ] For months he had been scheming to prevent her from getting the top job.\nSMART Vocabulary: related words and phrases\nPlotting & trapping\nbe in league with someone idiom\ncahoots\ncatch someone out\nchemtrail\nchicanery\nconspiracy theorist\nconspiracy theory\nconspirator\nconspire\nentrap\nhatch\nplotter\nploy\npretext\npretextual\nput-up job\nset something up\nsting\ntrap\nwheeze\nSee more results »\nRelated words\nschemer\nscheming\nAdd to word list\nAdd to word list\na plan for doing or organizing something: The committee came up with a creative fundraising scheme. The yellow and white color scheme brightened up the kitchen.\nA scheme is also a secret and dishonest plan: [ + to infinitive ] They devised a scheme to defraud the government of millions of dollars. Idiom\nin the (grand) scheme of things\nto make a plan, esp. a secret and dishonest one: [ + to infinitive ] He was scheming to get the top job from the moment he joined the company. schemer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈski·mər/\nAdd to word list\nAdd to word list\nGOVERNMENT, MANAGEMENT, FINANCE\n&#160; UK an officially organized plan or system: a scheme to do sth The firm is lead developer on a scheme to construct 800 homes.devise/come up with a scheme They have devised a scheme that allows entrepreneurs to benefit from each other's success. introduce/launch/set up a schemerun/operate a scheme Tesco runs a scheme to help managers spot talent. a job-creation/training scheme a government/management scheme an incentive/mentoring scheme investment/savings schemes\ndisapproving a plan for getting an advantage for yourself, especially by deceiving others: a scheme to do sth He was planning a scheme to rob people of their savings. participate in/be involved in a scheme See also\nadvance fee scheme\nbuddy scheme\ncontributory pension scheme\nenterprise investment scheme\noccupational pension scheme\npension scheme\nPonzi scheme\npyramid scheme\nreward scheme\nsmall self-administered scheme\nView all\nsuggestion scheme\ndisapproving to make clever secret plans which are intended to deceive people: scheme against sb His staff were scheming against him."}