{"id":320355,"name":"schedule","type":"noun","us_sound":"ˈskedʒ.uːl","us_link":"../audio/s/schedule.mp3","uk_sound":"ˈʃedʒ.uːl","uk_link":"../audio/s/uksched001.mp3","content":"Add to word list\nAdd to word list\nB2 a list of planned activities or things to be done showing the times or dates when they are intended to happen or be done: a production schedule a hectic/tight (= very busy) schedule Everything went according to schedule (= as had been planned).\nB1 US (UK timetable) a list of the times when events are planned to happen, for example the times when classes happen or when buses, etc. leave and arrive: The class schedule is available on the website. a bus schedule a schedule of talks at the convention\nformal an official list of things: a schedule of business expenses ahead of schedule\nB2 early: We expect the building work to be completed ahead of schedule.\nSee more on schedule\nB2 not early or late: Managers need to know whether work is proceeding on schedule.\nSee more fall behind schedule\nto do less work than you planned to do by a particular point in time: I'm afraid we've fallen behind schedule in recent weeks.\nSee more\nMore examplesFewer examplesa punishing training scheduleWhat's our schedule for this morning?The training schedule wasn't very well thought out.We are already two months behind schedule.If our schedules coincide, we'll go to Spain together.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\njournal\npack\nprogramme\nscheduled\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nstagger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTravelling\nLists and catalogues\nB2 to arrange that an event or activity will happen at a particular time: The meeting has been scheduled for tomorrow afternoon. [ + to infinitive ] The flight is scheduled to arrive at 8.45, but it's running 20 minutes late.\nMore examplesFewer examplesThe orchestra has scheduled two major tours next season.The elections are scheduled for late November.Among those scheduled to attend are sculptor James West and painter Phoebe Watson..The world's largest casino is scheduled to open in New Orleans later this year.Open to under 14s, the competition is scheduled for July 3 and 5.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\njournal\npack\nprogramme\nscheduled\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nstagger\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nRelated word\nscheduled\nAdd to word list\nAdd to word list\na list of planned activities or things to be done at or during a particular time: [ C ] Amid her hectic schedule, she found time to stop by. [ C ] The work schedule for this month is posted on the staff bulletin board. [ U ] The construction was completed ahead of/on/behind schedule (= early/on time/late). [ U ] Everything went according to schedule (= as planned).\nAn airline/bus/train schedule (also (also timetable)) is a list of days and times that aircraft/buses/trains leave and arrive at particular places.\nto plan something for a particular time: The meeting has been scheduled for tomorrow afternoon. The film is scheduled to begin production in August.\nAdd to word list\nAdd to word list\n[ C ] a plan of activities or tasks together with the times or dates when they are intended to happen or be done: a hectic/tight/busy schedule The company will cut its first-quarter production schedule by 4%. It's important that we have a flexible work schedule.design/plan a schedule First and foremost you should plan a schedule for the project. keep to/work to/have a schedule a schedule of activities/events/meetings Compare\ntimetable noun\n[ C ]\n&#160; TRANSPORT\n&#160; US a list of the times when buses, trains, and planes leave and arrive: a bus/train schedule Compare\ntimetable noun\n[ C ]\n&#160; COMMUNICATIONS a list of television or radio programmes that are broadcast at particular times: television schedules We are looking at ways to improve the daytime schedule.\n[ C ] a formal list: a schedule of prices/rates\n[ C ]\n&#160; LAW, INSURANCE an official list of things that are affected by a legal or insurance agreement: The paintings were added to the insurance schedule.\nahead of schedule\nearly: The meeting finished ahead of schedule. If things continue to run ahead of schedule, construction could be finished two months early.\non schedule\nat the right time, not early or late: The group remains on schedule to open six new outlets in the second half.\nfall behind schedule\nto do less work than you planned to do by a particular point in time: The project started six months late and continued to fall behind schedule.\naccording to schedule\nat the time or in the way that was planned: If everything goes according to schedule, work will be complete in December.\nSee also\naging schedule\nearnings schedule\nemployee schedule\ntax schedule\nto arrange for an event or activity to happen at a particular time: The appeals court may rule after receiving a government response or may schedule a hearing.be scheduled to do sth $227 million was scheduled to be paid to assorted hospitals and clinics.schedule sth for Monday/May/next year, etc. The meeting is scheduled for 10 a.m. be scheduled for release/completion/publication"}