{"id":320924,"name":"science","type":"noun","us_sound":"ˈsaɪ.əns","us_link":"../audio/s/science.mp3","uk_sound":"ˈsaɪ.əns","uk_link":"../audio/s/ukschol021.mp3","content":"Add to word list\nAdd to word list\nA2 [ U ] (knowledge from) the careful study of the structure and behaviour of the physical world, especially by watching, measuring, and doing experiments, and the development of theories to describe the results of these activities: pure/applied science recent developments in science and technology Space travel is one of the marvels/wonders of modern science. the science\nthe facts and opinions that are provided by scientists who have studied a particular subject or situation: We spoke with a few dietitians to help us understand what the science tells us about celery juice and your health. The government insisted that it would follow the science with regard to the wearing of face masks.\nB1 [ C or U ] a particular subject that is studied using scientific methods: physical sciences Economics is not an exact science. advances in medical science\nA2 [ U ] the study of science: a science graduate/teacherteacher a science course/lesson\nMore examplesFewer examplesforensic sciencethe frontiers of science and technologya science labone of the pioneers of modern scienceWe need to invest more as a country in science and technology.\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\n-ological\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfunctional skills\nfuturology\nGermanist\nglaciology\nhard science\nology\nontology\noology\norientalist\nstem\nsubscience\nsuicidology\ntechnical\ntechnically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nAdd to word list\nAdd to word list\nthe systematic study of the structure and behavior of the natural and physical world, or knowledge obtained about the world by watching it carefully and experimenting: [ U ] Advances in medical science mean that people are living longer. [ U ] She shows a talent for math and science.\nSciences are also particular areas of science, such as biology, chemistry, and physics.\nScience also refers to subjects which are studied like a science: [ U ] political/computer science\nAdd to word list\nAdd to word list\n[ U ] the careful study of the structure and behaviour of the world, especially by doing experiments: pure/applied science Space travel is one of the wonders of modern science. Advances in science and technology are opening the way for new treatments. a science teacher/degree\n[ U ] a subject that is studied using scientific methods: medical/forensic science\n[ C ] a subject such as physics, chemistry, or biology: He studied sciences at California Institute of Technology."}