{"id":321470,"name":"scooter","type":"noun","us_sound":"ˈskuː.t̬ɚ","us_link":"../audio/s/eus74105.mp3","uk_sound":"ˈskuː.tər","uk_link":"../audio/s/uksciro015.mp3","content":"Add to word list\nAdd to word list\nA2 a child's vehicle with two or three small wheels joined to the bottom of a narrow board and a long vertical handle attached to the front wheel. It is ridden by standing with one foot on the board and pushing against the ground with the other foot: Her favourite toy is a little red scooter. Parents should be evaluating whether their children's bicycles, scooters, and skateboards are safe for their age and ability.\nSteve Gorton/Dorling Kindersley/GettyImages\n(also electric scooter) a vehicle similar to a child's scooter but with an electric motor attached, used by adults and children: Some police say that because the scooters are tiny motor vehicles, state statutes regarding vehicles should apply. Today's child rides an electric scooter and plays computer games.\nMarioGuti/iStock/Getty Images Plus/GettyImages\na\nmotor scooter : He rides his 50cc scooter to work every day. I wanted to ride around Rome on the back of a scooter.\nROMAOSLO/E+/GettyImages\nSMART Vocabulary: related words and phrases\nToys & dolls\nballoon\nbeach ball\nchew toy\ncuddly toy\ndoll's house\ndolly\nfidget\nfidget spinner\nfinger puppet\ngacha\nmarionette\nmud pie\nrag doll\nRussian doll\nslap bracelet\nslime\nsnow globe\nsock puppet\nSoft Stuff\nstuffed animal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkates & skateboards\nRoad vehicles in general\nMotorbikes\nscooter noun [C]\n(TOY)\nAdd to word list\nAdd to word list\na child’s vehicle with two or three small wheels joined to the bottom of a narrow board and a long vertical handle fixed to the front wheel. The rider stands with one foot on the board and pushes against the ground with the other foot, while turning the handle to direct movement.\nscooter noun [C]\n(MOTOR VEHICLE)\na motor vehicle with two wheels, that is similar to, but smaller than, a motorcycle"}