{"id":321556,"name":"score","type":"verb","us_sound":"skɔːr","us_link":"../audio/s/score.mp3","uk_sound":"skɔːr","uk_link":"../audio/s/uksciro021.mp3","content":"score verb\n(WIN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to win or get a point, goal, etc. in a competition, sport, or game: Tennant scored in the last minute of the game. She has scored over twenty goals for her team this season. In American football, a touchdown scores (= is worth) six points. She scored 18 out of 20 in the spelling test.\n[ T ] mainly US to get a particular number of points on a test or in an examination: She did well in her exam, scoring 85, well above the necessary 60. All the youngsters scored well in intelligence tests.\n[ T ] mainly US to count or decide on the number of points someone gets on a test or in an examination: Thousands of teachers are involved in preparing questions for state tests and in scoring the exams. Safeguards are built in to ensure that the tests are scored correctly.\n[ I ] UK (US keep score) to record the number of points won by competitors: We need someone to score for tomorrow's match.\n[ I or T ] to succeed in an activity or to achieve something: She has certainly scored a success with her latest novel. His 2018 teen comedy scored with audiences, if not with critics. Nearly every bomb scored a hit.UK You have a lot of patience - that's where you score over (= are better than) your opponents.\nMore examplesFewer examplesGlennon scored the deciding goal in the final minute of the match.They scored twice early on in the game.He scored an equalizer during the closing minutes of the match.You scored full marks in the test - ten out of ten!She has certainly scored a success with her latest novel.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nshutout\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nRefereeing & judging in sport\nSucceeding, achieving and fulfilling\nscore verb\n(GET)\n[ T ] US informal to get something: I managed to score a couple of tickets to the World Cup final.\n[ I or T ] slang to get illegal drugs: She tried to score some dope in a nightclub.\n[ I ] slang to have sex with someone that you have usually just met: Did you score last night, then?\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrugs - general words\nscore verb\n(MARK)\n[ T ] to make a mark or cut on the surface of something hard with a pointed tool, or to draw a line through writing: If you score the tile first, it will be easier to break. See also\nunderscore verb\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeleting writing\nscore verb\n(MUSICAL TEXT)\n[ T ] to write or change a piece of music for particular instruments or voices: This piece is scored for strings and woodwind.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nIdioms\nscore points off someone\nscore points (with sb)Phrasal verb\nscore something out/through\nscore noun\n(WIN)\nB1 [ C ] plural scores the number of points, goals, etc. achieved in a game or competition: a high/low score Have you heard the latest cricket score? At half time, the score stood at (= was) two all. The final score was 3–0. Could you keep (= record) the score at this afternoon's game?\n[ C ] mainly US plural scores (UK usually mark) the number of points someone gets on a test or in an examination: The test scores of hundreds of students were compared. Only 939 out of approximately 1.4 million high school seniors achieved the perfect score.\nMore examplesFewer examplesMy score was depressingly low.You throw the dice and whoever gets the highest score goes first.What was the half-time score?The score now stands at 40–love.The final score was a respectable 2–1.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarks & results\nscore noun\n(MUSIC)\n[ C ] plural scores a piece of written music showing the parts for all the instruments and voices: an orchestral score\nPhilippe Lissac/Photononstop/GettyImages\n[ C ] plural scores the music written for a film, play, etc.: a film score Rodgers wrote the score for/of/to \"Oklahoma!\".\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nscore noun\n(TWENTY)\n[ C usually singular ] formal plural score 20 or approximately 20: He lived to be three score years and ten (= until he was 70 years old). by the score formal\nin large numbers: People are leaving the organization by the score.\nSee more scores [ plural ]\na lot of things or people: scores of Sean received cards from scores of local well-wishers.\nSee more\nSMART Vocabulary: related words and phrases\nNumbers: groups of things according to number\nbaker's dozen\nbrace\ncompanion\ncouple\ndozen\ndyad\ndyadic\ngross\nnull\npair\nquaternity\ntriad\ntrinity\ntrio\ntwosome\nscore noun\n(SUBJECT JUST MENTIONED)\non this/that score\nC2 about the thing or subject that has just been mentioned: I'll let you have the money, so there's nothing to worry about on that score.\nSee more Idioms\nsettle a score\nwhat's the score?\nscore verb [I/T]\n(WIN)\nAdd to word list\nAdd to word list\nto win or obtain a point or something else that gives you an advantage in a competitive activity, such as a sport, game, or test: [ I ] Has either team scored yet? [ T ] The Packers scored a touchdown with two minutes to go in the football game. [ T ] A student from Gettysburg scored a perfect 1600 points on the college entrance exam. [ T ] fig. He scored (= obtained) a deal with a recording label two years ago. Idiom\nscore points (with someone)\nscore noun\n(MUSICAL TEXT)\n[ C ]\n&#160; music a piece of written music showing the parts for all the different instruments and voices, or the music written for a movie or other entertainment\nscore noun\n(MATTER)\n[ C usually sing ] a particular matter among others related to it: I’ll let you have the money, so there’s nothing to worry about on that score.\nscore noun\n(NUMBER)\n[ C ] (a set or group of) 20: Brandon received cards from scores of (= many) local well-wishers.\nscore noun\n(POINTS)\n[ C ] the number of points achieved or obtained in a game or other competition: The final score was 103–90. Who’s going to keep score when we play bridge? infml So what’s the score (= what are the facts of this situation), doctor? Is it serious?\nAdd to word list\nAdd to word list\nabbreviation for Service Corps of Retired Executives: an organization in the US that provides free help and advice to small businesses Compare\nACE"}