{"id":321878,"name":"scraping","type":"noun","us_sound":"ˈskreɪ.pɪŋ","us_link":"../audio/s/cdo1121usscra3783.mp3","uk_sound":"ˈskreɪ.pɪŋ","uk_link":"../audio/s/cdo1121ukscra3784.mp3","content":"scraping noun\n(RUBBING)\nAdd to word list\nAdd to word list\n[ U ] the act of removing the surface from something using a sharp edge or something rough : Use techniques that generate less dust, such as wet sanding or scraping. I do all the chopping, scraping and pressing the garlic.\n[ U ] the act of rubbing against a surface so that slight damage or an unpleasant noise is produced: I heard the scraping of a chair and then footsteps. There was a scraping noise as the train derailed.\n[ C usually plural ] a small part that has been removed from the surface of something with a sharp edge or something rough : The pathologist collected fingernail scrapings from Craig's hands. The roads are so narrow that trucks leave scrapings of paint on the mountain walls.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHealth in general\nWords meaning small pieces and amounts\nscraping noun\n(COLLECTING INFORMATION)\n[ U ]\n&#160; computing\n&#160; specialized (also data scraping, web scraping) the activity of taking information from a website or computer screen and putting it into spreadsheet (= an electronic document in which information is arranged in rows and columns and can be used in calculations) on a computer: The law on scraping is still not fully developed, so the push for more and more online data moves forward on uncertain ground.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »"}