{"id":321904,"name":"scratch","type":"verb","us_sound":"skrætʃ","us_link":"../audio/s/scratch.mp3","uk_sound":"skrætʃ","uk_link":"../audio/s/ukscrap011.mp3","content":"scratch verb\n(CUT)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to cut or damage a surface or your skin slightly with or on something sharp or rough: We scratched the wall trying to get the bed into Martha's room. Be careful not to scratch yourself on the roses.scratch about/around for A few chickens were scratching about/around (= searching with their beaks) in the yard for grain.\nB2 [ T ] If you scratch something on or off a surface, you add it or remove it by scratching: scratch something on something People have been scratching their names on this rock for years.scratch something off something I scratched some paint off the door as I was getting out of the car.\nB2 [ I ] If an animal scratches, it rubs something with its claws (= sharp nails): scratch at The dog's scratching at the door – he wants to be let in.\nB2 [ I or T ] to rub your skin with your nails: scratch (at) He was scratching (at) his mosquito bites. Hannah scratched her head thoughtfully.\nMore examplesFewer examplesThe top of the desk was badly scratched.The car's paintwork has been scratched.Paintwork on the corner of a stairway tends to get scratched.I accidentally scratched her with my long nails.I scraped the car against a post and scratched the paintwork.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal (non-human) behaviour\nScratching and rubbing\nscratch verb\n(REMOVE)\n[ I or T ] to remove yourself or another person or an animal from a competition before the start: scratch from The world champion scratched from the 800 metres after injuring herself the day before.scratch someone/something from something They scratched the horse from the race because she had become lame.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nscratch verb\n(STOP)\n[ T ] informal (UK usually scrub) to decide not to do something you had planned to do: We had to scratch our plans when I lost my job. Synonym\ncancel\nSMART Vocabulary: related words and phrases\nCancelling and interrupting\nadjourn\nadjourn to somewhere\narrest\nbreak\ncall someone/something off\ncancellable\ndiversion\nhalt\nin midstream idiom\ninterrupt\nkick\nkick something into touch idiom\nrain\nscrub\nshut\nshut (something) off\nsuspend\nsuspensive\ntake a break\nuncancelled\nSee more results »\nscratch that\nused for saying you take back something you have just said, especially in order to say it in a better way or to say something different: Everything I did was in the cause of safety. No, scratch that – not safety but survival. It would have been better to say your brother wasn’t driving the car at all. Scratch that – telling the truth is usually best in the end.\nSMART Vocabulary: related words and phrases\nCancelling and interrupting\nadjourn\nadjourn to somewhere\narrest\nbreak\ncall someone/something off\ncancellable\ndiversion\nhalt\nin midstream idiom\ninterrupt\nkick\nkick something into touch idiom\nrain\nscrub\nshut\nshut (something) off\nsuspend\nsuspensive\ntake a break\nuncancelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCorrecting and mending\nIdioms\nscratch your head\nscratch beneath the surface\nyou scratch my back and I'll scratch yoursPhrasal verb\nscratch around for something\nscratch noun\n(MARK/ACT)\nB2 [ C ] a mark made by scratching: Her legs were covered in scratches and bruises after her walk through the forest. There was a scratch on the CD.without a scratch Amazingly, he survived the accident without a scratch (= without suffering any injuries at all).\nThesaurus: synonyms, antonyms, and examples\ndamage to the bodyinjuryHe was treated for minor injuries.woundMost of the casualties had gunshot wounds.cutHe walked away from the car crash with only cuts and bruises. gashHe was bleeding profusely from a deep gash in his leg.scratchShe had little scratches all over her arms. lacerationA doctor's report said the laceration had cut the jugular vein.\nSee more results »\n[ S ] UK an act of scratching: have a scratch That dog is having a good scratch. It must have fleas.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nScratching and rubbing\nscratch noun\n(FROM COMPETITION)\na person or animal that leaves a competition before it starts: The Australian Open winner was a late scratch. He was a last-minute scratch from Sunday's game because of inflammation in his right knee.\nSMART Vocabulary: related words and phrases\nCompetitors & participants in sports & games\nback four\nballer\nballplayer\nbase jumper\nbenchwarmer\nchallenger\njumper\nkeeper\nlogroller\nlong-jumper\nlongboarder\nmajor league\nmid-table\nracer\nretire\ntrampolinist\ntrialist\ntriathlete\ntriple jumper\ntriple threat\nSee more results »\nIdioms\nfrom scratch\nup to scratch\nscratch team/side/orchestra\na group of people brought together in a hurry in order to play together on a particular occasion: He knew that any shortcomings of what was essentially a scratch side would be exposed by the opposition.\nSee more\nscratch verb [I/T]\n(CUT)\nAdd to word list\nAdd to word list\nto cut or damage a surface with something sharp or rough, or to rub a part of your body with something sharp or rough: [ T ] He used a penknife to scratch his initials into the bark of the tree. [ I ] You can hold the cat – she won’t scratch.\nIf you scratch your skin, you rub it with the nails of your fingers: [ T ] I know they itch, but don’t scratch your mosquito bites.\nscratch verb [I/T]\n(REMOVE)\nto remove yourself or another person or an animal from a competition before the start: [ I ] Mary Slaney scratched from the 1500-meter run because of an Achilles tendon problem.\nTo scratch is also to decide not to do something that you had planned to do; to cancel: [ T ] We were going to remodel our kitchen, but we had to scratch that when I lost my job. Idioms\nscratch your head\nscratch the surface\na cut or mark that is made in a surface with something sharp or rough: Tiny particles of car wax fill in the little scratches on the car."}