{"id":321861,"name":"scrap","type":"verb","us_sound":"skræp","us_link":"../audio/s/scrap.mp3","uk_sound":"skræp","uk_link":"../audio/s/ukscrap001.mp3","content":"scrap verb\n(THROW AWAY)\nAdd to word list\nAdd to word list\nC2 [ T ] to not continue with a system or plan: They're considering scrapping the tax and raising the money in other ways. We scrapped our plans for a trip to France.\nThesaurus: synonyms, antonyms, and examples\nto cancel somethingcancelSorry, I have to cancel our plans tonight.call offThe game has been called off because of the weather.offThe meeting's off because James is ill.scrapWe've scrapped our plans for a trip to France.suspendThe ferry service has been suspended for the day because of bad weather.postponeWe've postponed the wedding until next year.\nSee more results »\nC2 [ T ] to get rid of something that is no longer useful or wanted, often using its parts in new ways: Hundreds of nuclear weapons have been scrapped.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlay\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\nscrap verb\n(ARGUMENT)\n[ I ] to have a fight or an argument\nThesaurus: synonyms, antonyms, and examples\nto fightfightAll this is really not worth fighting over.scrapTwo boys were scrapping in the playground.brawlThe football hooligans are out brawling again.clashStudents clashed with police during demonstrations at five universities.struggleSome of the customers struggled with the robbers, but to no avail. come to blowsSupporters nearly came to blows with each other before the match.\nSee more results »\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nscrap noun\n(METAL)\nC2 [ U ] old cars and machines or pieces of metal, etc. that are not now needed but have parts that can be used to make other things: scrap iron/metal We sold our old car for scrap.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnet\nmagnetism\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRubbish and waste\nscrap noun\n(SMALL PIECE)\nC2 [ C ] a small piece of something or a small amount of information: Do you have a scrap of paper I could write on? I've read every scrap of information I can find on the subject. There's not a scrap of (= no) evidence to suggest that he committed the crime. scraps [ plural ]\nsmall pieces of food that have not been eaten and are usually thrown away: We give all our scraps to our cat.\nSee more\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\ntrace\nSee more results »\nscrap noun\n(ARGUMENT)\n[ C ] a fight or argument, especially a quick, noisy one about something not important: A couple of kids were having a scrap in the street.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncombat\ncome close to blows idiom\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArguments & disagreements\nscrap verb [T]\n(THROW AWAY)\nAdd to word list\nAdd to word list\nto get rid of something no longer useful or wanted: Over 60% of all Georgians want to keep the present flag and only 29% want to scrap it.\nscrap noun\n(MATERIALS)\n[ U ] old or used material, esp. metal, that has been collected in one place, often in order to be treated so that it can be used again: He was charged with stealing copper tubing, which he then sold as scrap metal.\nscrap noun\n(SMALL PIECE)\n[ C ] a small and often irregular piece of something, or a small amount of something: He jotted it down on a scrap of paper. [ pl ] She picked up scraps of information about her husband’s whereabouts, but nothing definite.\nAdd to word list\nAdd to word list\nto decide not to continue with an activity or plan: The bank has scrapped its plans for a property division.\nto get rid of something that is no longer useful or wanted, especially so that its parts can be used: The car would have cost so much to repair that I decided to scrap it.\nold material, especially metal, that can be sold and used again: scrap metalsend/use sth for scrap The building materials were sent for scrap. a scrap dealer"}