{"id":321964,"name":"scream","type":"verb","us_sound":"skriːm","us_link":"../audio/s/scream.mp3","uk_sound":"skriːm","uk_link":"../audio/s/ukscrap016.mp3","content":"scream verb\n(MAKE NOISE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to cry or say something loudly and usually on a high note, especially because of strong emotions such as fear, excitement, or anger: A spider landed on her pillow and she screamed. Through the smoke, the rescuers could hear people screaming for help. He was screaming in/with pain and begging for anaesthetic. They screamed with laughter at her jokes. Ken screamed (out) a warning telling people to get out of the way. Mrs Brown screamed (= shouted angrily) at Joel for dropping the test-tube. I've never found screaming (and shouting) (= shouting angrily) at my staff to be very effective. [ + speech ] \"I wish you were dead!\" she screamed (= shouted angrily). I tried to apologize, but he just screamed abuse/obscenities at me.\nThesaurus: synonyms, antonyms, and examples\nto shoutshoutThere's no need to shout, I can hear you just fine.yell\"What are you doing?\" he yelled.bellow\"Listen to me!\" he bellowed.hollerUS She came running inside, hollering about being chased by a bear.call\"I'm up here,\" he called.\nSee more results »\n[ I + adv/prep ] If a vehicle screams, it moves very quickly making a loud high sound: The cars screamed round the bend/past the spectators.\n[ I ] to make a loud, high sound: The ambulance raced round the corner with its tyres screaming.\nMore examplesFewer examples\"Freeze or I'll shoot!\" screamed the gunman.He showed us a snake and Milly screamed.He was greeted by an army of screaming teenagers.I heard a woman in the house opposite screaming for help.The audience screamed their appreciation.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nraise\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by objects, movement or impact\nscream verb\n(GET ATTENTION)\n[ I ] (also scream out) If a word or image screams (out), it gets attention because it is very big or easy to notice: \"Latest Plane Disaster!\" screamed the newspaper headlines the next day.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwonder\nwritten all over someone's face idiom\nSee more results »\nIdioms\nscream (out) for something\nscream your head off\nscream noun [C]\n(NOISE)\nB1 a loud, high sound you make when very frightened, excited, or angry: a scream of pain/rage/joy/laughter No one heard their screams. She let out a piercing/shrill scream.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nraise\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nwhoop\nSee more results »\nscream noun [C]\n(FUN)\ninformal a person, thing, or situation that is very funny: Jane's such a scream - her jokes have me in stitches.\nThesaurus: synonyms, antonyms, and examples\ncausing laughterfunnyShe told me a funny story about Max.amusingI gave her an article that I thought she would find amusing.humorousShe wrote a humorous account of her teenage years.hilariousIt's the most hilarious comedy on television.hystericalI've just read his autobiography - it's absolutely hysterical.\nSee more results »\nSMART Vocabulary: related words and phrases\nHumour & humorous\namusingly\nbitingly\nblackly\nbone dry idiom\nbring\ndrily\ngag\ngeddit?\nGSOH\njocose\nlightly\nmordancy\nnon-serious\npawky\nphotobomb\nphotobombing\nrib\nstanding joke\nwag\nwisecrack\nSee more results »\nAdd to word list\nAdd to word list\nto cry or say something loudly and usually on a high note, esp. because of strong emotions such as fear, excitement, or anger: [ I ] The children screamed in delight as they sledded down the hill. [ I ] Some people still trapped in the wreckage screamed for help.\na loud high sound you make when you are frightened, excited, or angry: screams of joy/laughter/pain\nslang A scream is someone or something that is very entertaining: Josie’s a real scream – she’s never serious."}