{"id":321995,"name":"screen","type":"noun","us_sound":"skriːn","us_link":"../audio/s/screen.mp3","uk_sound":"skriːn","uk_link":"../audio/s/ukscrap021.mp3","content":"screen noun [C]\n(PICTURE)\nAdd to word list\nAdd to word list\nA2 a flat surface in a cinema, on a television, or as part of a computer, on which pictures or words are shown: Our television has a 19-inch screen. Coming to your screens (= cinemas) shortly, \"The Adventures of Robin Hood\". Her ambition is to write for the screen (= for television and films). Write the letter on the computer, then you can make changes easily on screen.\nAliraza Khatri's Photography/Moment/GettyImages the small screen\ntelevision: He's made several films for the small screen.\nSee more the big screen\ncinema: So this is your first appearance on the big screen?\nSee more\nMore examplesFewer examplesIf you press this key, the computer screen will clear.Click the icon in the bottom right-hand corner of the screen.Laser images were projected onto a screen.On screen he had more charisma than any actor of his generation.The television also comes in a compact 36 cm screen size, ideal for bedroom or kitchen use.\nSMART Vocabulary: related words and phrases\nMachines - parts\nair compressor\nair filter\naxle\ncogwheel\ncompressor\nconsole\ncontrol panel\ncontroller\ncowl\nguard\ninstrumentation\njet\nmechanism\npivot\nslide\nspline\nsplit pin\nstepney\nuniversal joint\nvee belt\nSee more results »\nscreen noun [C]\n(SEPARATING)\na vertical structure that is used to separate one area from another, especially to hide something or to protect you from something unpleasant or dangerous: The nurse pulled a screen around the bed so that the doctor could examine the patient in private. A screen of trees at the bottom of the garden hid the ugly factory walls.\nEerik/iStock/Getty Images Plus/GettyImages\nmainly US an activity that is not dangerous or illegal but is used to hide something that is: That café's just a screen for their criminal activities.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nremove\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nsuper-insulated\nthose\nuncouple\nwrench\nwrenching\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHiding and disguising\nscreen noun [C]\n(SPORT )\n(also screen pass, uk us) in American football, an occasion when the ball is thrown to a player behind the line of scrimmage (= the line on which the ball is positioned at the beginning of a period of action) who runs behind a line of other players who try to stop the defence from tackling that player: They set up a screen to the wide receiver, who ran for 14 yards and a first down. The running back caught a screen pass, but was tackled before he could advance the ball.\nin sports such as basketball and ice hockey, an occasion when a player is blocked by one opponent from approaching and stopping another opponent who has the ball or puck: They set up a screen for the forward, who advanced to the basket to score.\nSMART Vocabulary: related words and phrases\nAmerican football\nattempt\nblitz\nblocker\nblocking\ncarry\ncarry the ball idiom\nconversion\nfullback\nguard\nhuddle\nlinebacker\nnonconference\noffence\noutgain\noutkick\npick\nrush\nscrimmage\nSuper Bowl\ntouchdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nscreen verb [T]\n(EXAMINE)\nto test or examine someone or something to discover if there is anything wrong with him, her, or it: Women over 50 should be screened for breast cancer. Completely unsuitable candidates were screened out (= tested and refused) at the first interview. screen your calls\nto delay your decision to answer the phone until you know who is calling you: I always screen my calls while I'm eating dinner.\nSee more\nSMART Vocabulary: related words and phrases\nMedical examination\n-scopy\nanechoic\naudiological\nbiopsic\nblood work\nCAT scan\nEKG\nendoscopy\nGillet test\nhistological\nhistologically\nhysteroscopy\nimmunohistochemical\nmammography\nradiography\nsigmoidoscopy\nsonography\nSPECT\nsperm count\nstress test\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTesting, checking and experimenting\nscreen verb [T]\n(PICTURE)\nto show or broadcast a film or television programme: The programme was not screened on British television.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: television\nscreen verb [T]\n(PROTECT)\nto protect or hide: She raised her hand to screen her eyes from the bright light.\nmainly US to protect someone by taking the blame yourself: The husband says he's the murderer but we think it was his wife - he's just screening her.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nPhrasal verb\nscreen something off\nscreen noun [C]\n(PICTURE)\nAdd to word list\nAdd to word list\na flat surface in a theater, on a television, or on a computer system on which pictures or words are shown: I spend most of the day working in front of a computer screen.\nThe screen sometimes means the movies: Her ambition is to write for the screen. a screen actor/actress\nscreen noun [C]\n(THING THAT SEPARATES)\nsomething that blocks you from seeing what is behind it, esp. a stiff piece of material that you can stand up like part of a wall and move around: Jennifer has a beautiful screen decorated with Japanese art.\nA screen is also a stiff, wire net that has very small holes and is fixed within a frame, put in windows esp. in warm weather to let in air and keep insects out.\nscreen verb [T]\n(EXAMINE)\nto test or examine someone or something to discover if there is anything wrong with the person or thing: Airport security staff have to screen and check millions of bags a year. The company president’s secretary screens all his calls (= answers them first to prevent some from getting through).\nscreen verb [T]\n(SHOW MOVIE)\nto show or broadcast a movie or television program: His new movie got rave reviews when it was screened at Cannes.\nscreen verb [T]\n(BLOCK)\nto block, protect, or hide someone or something with a screen: She raised her hand to screen her eyes from the sun. Phrasal verb\nscreen out something/someone\nAdd to word list\nAdd to word list\na flat surface on a television or computer, or in a cinema, on which pictures or words are shown: a computer screen a television/cinema screen come up on/appear on a screenscroll up/down a screen Scroll down to the bottom of the screen. See also\nflat-screen\nonscreen\nsmokescreen\ntouch screen\nHR to check that someone is suitable and able to do a job by getting information about their previous jobs, personal activities, etc.: screen sb for sth The short-listed candidates were screened for the job.\nPRODUCTION to test or examine something to discover if there is anything wrong with it: screen sth for sth The car parts were screened for defects.\nCOMMUNICATIONS to show something on television or at a cinema: The 30-second ad was screened last night. Phrasal verbs\nscreen sb out\nscreen sth out"}