{"id":322433,"name":"scuff","type":"verb","us_sound":"skʌf","us_link":"../audio/s/scuff.mp3","uk_sound":"skʌf","uk_link":"../audio/s/ukscrum012.mp3","content":"Add to word list\nAdd to word list\nto make a rough mark on a smooth surface, especially on a shoe or floor: Please wear trainers in the gym, to avoid scuffing the floor. If you scuff your feet (= pull your shoes along the ground as you walk) like that, you'll ruin your shoes.\nto kick a ball badly, especially by touching the ground as well as the ball with your foot : She scuffed her first penalty attempt. Burke then wasted a rare opportunity when he scuffed the ball wide.\nto spoil or harm something slightly, especially the reputation of something or someone: A host of local controversies have scuffed the Republican brand name in Ohio. The image she has built as a selfless champion of her district has been scuffed by the revelation that she made a fast $119,000 in a land deal with a developer she has repeatedly aided.\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\ngrind\nrasp\nregrind\nrub\nrub something down\nrubdown\nscour\nscrape\nscratch\nscratching\nsmooth\ntowel\nwear (something) away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting against objects accidentally and colliding\nDamaging and spoiling\nRelated word\nscuffed\na rough mark made on a smooth surface, especially on a shoe or floor: They wear soft overshoes to protect the floor from scuffs. Do you have anything for getting rid of scuff marks on shoes?\nSMART Vocabulary: related words and phrases\nScratching and rubbing\nabrade\nabrasion\nbuff\nchafe\nchaff\nerode\nerosive\ngrind\nrasp\nregrind\nrub\nrub something down\nrubdown\nscour\nscrape\nscratch\nscratching\nsmooth\ntowel\nwear (something) away\nSee more results »\nAdd to word list\nAdd to word list\nto make a mark on a smooth surface, esp. on a shoe or floor: Always wear sneakers in the gym to avoid scuffing the floor.\nIf you scuff your feet, you do not lift them as you walk."}