{"id":322568,"name":"scurry","type":"verb","us_sound":"ˈskɝː.i","us_link":"../audio/s/scurry.mp3","uk_sound":"ˈskʌr.i","uk_link":"../audio/s/ukscrum029.mp3","content":"Add to word list\nAdd to word list\nto move quickly, with small, short steps: The mouse scurried across the floor. The noise of the explosion sent everyone scurrying back into their homes. Synonyms\nscamper\nskitter\nThesaurus: synonyms, antonyms, and examples\nto runrunShe saw him running down the street.sprintI had to sprint to catch the bus.jog\"What do you do to keep fit?\" \"I jog and go swimming.\"raceHe raced up the stairs to answer the phone.rushEveryone rushed to the door when the alarm went off.dashHe dashed out the door after the dog.\nSee more results »\nMore examplesFewer examplesA small rodent followed, scurrying beneath a wall before I could even jump to my feet and scream. News of his imminent arrival sent the support crew scurrying to buy pizza and nonalcoholic cider.All of the players who came off the field scurried to the warmest places they could find.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nshoot\nstampede\nton\ntrot\nSee more results »\nthe act of moving with short, quick steps: We paused between showers to listen for the flap of wings or the scurry of creatures.\na period or situation of busy activity: The next few weeks were the usual scurry of activity. That remark went unnoticed in the scurry of the radio studio.\nMore examplesFewer examplesSuddenly there was a scurry around the bed, screens were put up, and the parents were summoned.The action moves between the scurry and chatter of life on Earth and the weightlessness of life in orbit.When does the festive season start for you? Christmas Eve, with a scurry round the shops?\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nshoot\nstampede\nton\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBusy and active\nAdd to word list\nAdd to word list\nto move quickly, esp. with small running steps: Mice scurried around the attic."}