{"id":322679,"name":"sea","type":"noun","us_sound":"siː","us_link":"../audio/s/c.mp3","uk_sound":"siː","uk_link":"../audio/s/ukbysta005.mp3","content":"Add to word list\nAdd to word list\nA1 [ C or U ] the salty water that covers a large part of the surface of the earth, or a large area of salty water, smaller than an ocean, that is partly or completely surrounded by land: the Mediterranean Sea We went swimming in the sea. The sea was calm/smooth/choppy/rough when we crossed the Channel. The refugees were at sea (= in a boat on the sea a long way from land) for 40 days before reaching land. When we moved to the US, we sent our things by sea (= in a ship). We spent a week by the sea (= on the coast) this year. Soon we had left the marina and were heading towards the open sea (= the part of the sea a long way from land).\nManuela Durson/EyeEm/GettyImages a sea of something\na large amount or number of something: The teacher looked down and saw a sea of smiling faces.\nSee more put (out) to sea\n(of a ship) to leave a port and start a journey: The boats will put (out) to sea on this evening's high tide.\nSee more\n[ C ] one of the large, flat areas on the moon that in the past were thought to be seas\nMore examplesFewer examplesI can see the sea from my window.He was swept out to sea by the strong current.I could hear the sound of the sea.She emerged from the sea, blue with cold.They stripped naked and ran into the sea.\nSMART Vocabulary: related words and phrases\nSeas & oceans\nAegean\nbathypelagic\nbriny\nCaribbean\nEnglish Channel\nguyot\ninterocean\ninteroceanic\nMediterranean\noceanic\nsubmarine\nsubsea\ntablemount\nthe Adriatic Sea\nthe Arabian Sea\nthe Baltic Sea\nthe doldrums\nthe high seas\nthe Irish Sea\nunderwater\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nGrammar\nGeographical placesWe use the before the names of rivers. We usually write the without a capital letter. If we use the word river, we usually write it without a capital letter: the river Thames, the river Severn, the Yangtze river. …\nIdioms\nat sea\nrun away to sea\nAdd to word list\nAdd to word list\na large area of salt water that is partly or completely surrounded by land, or the salt water that covers most of the surface of the earth: [ C ] the Caribbean/Mediterranean Sea [ C ] The seas are filled with creatures we know nothing about.\nIf you travel by sea, you go in a ship. Idioms\nat sea\nsea of something"}