{"id":322747,"name":"seal","type":"noun","us_sound":"siːl","us_link":"../audio/s/seal.mp3","uk_sound":"siːl","uk_link":"../audio/s/ukscutt017.mp3","content":"seal noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\nB2 a large mammal that eats fish and lives partly in the sea and partly on land or ice\nPixelda Picture License/Moment/GettyImages\nExamples\na seal pupThe plan to cull large numbers of baby seals has angered environmental groups.We could see seals on the rocks, basking in the sun.We spied a seal from the shore.We sailed past a group of seals.\nSMART Vocabulary: related words and phrases\nMarine mammals\nbeluga\ncetacean\ndolphin\ndugong\nelephant seal\nfur seal\ngrey seal\nharp seal\nhumpback whale\nkiller whale\nmegalodon\nminke whale\nmonk seal\nnarwhal\norca\nringed seal\nsea cow\nsea lion\nsperm whale\nwalrus\nSee more results »\nseal noun [C]\n(COVERING)\nsomething fixed around the edge of an opening to prevent liquid or gas flowing through it: Clean the seal on/around the fridge door regularly so that it remains airtight.\na thin piece of material such as paper or plastic that covers the opening of a container and has to be broken in order to open the container and use the contents\nDouglas Sacha/Moment/GettyImages\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsubstratum\nsuperstratum\ntar paper\nuncover\nvarnish\nSee more results »\nseal noun [C]\n(MARK)\nan official mark on a document, sometimes made with wax, that shows that it is legal or has been officially approved: The lawyer stamped the certificate with her seal.\ndjedzura/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nOfficial documents\naccounts\naffidavit\naleatory\nannal\napostille\nengrossment\nfiling\nfree pass\nget-out clause\nGreen Paper\nprenuptial agreement\nproceedings\npt\nPTO\nrecertification\nrecertify\nrenewable\ntitle deed\nwarrant\nwrit\nSee more results »\nIdioms\nseal of approval\nset/put the seal on something\nseal verb [T]\n(COVERING)\nC2 to close an entrance or container so that nothing can enter or leave it\nThesaurus: synonyms, antonyms, and examples\nto close closeCan you close the door behind you?shutI shut the door so the cat couldn't get out.snap shutHe snapped his briefcase shut and walked out of the office.click shutThe door clicked shut. slamPlease don't slam the door.\nSee more results »\nto cover a surface with a special liquid to protect it: This floor has just been sealed (with varnish), so don't walk on it!\nC2 to close a letter or parcel by sticking the edges together: Seal the package (up) with tape. He sealed (down) the envelope and put a stamp on it.\nMore examplesFewer examplesThe top of the bottle is then sealed with green wax.To ensure that the bottles of ink are not tampered with, the lids will be sealed with plastic.Make sure that any gaps around the edge of the bath are sealed.Seal the bags before they go in the freezer.Food sealed in foil pouches lasts for a long time.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncongest\ncork\ndam\ndam something up\nensconce\nfur\nsandbag\nseal something in\nseal something off\nself-seal\nself-sealing\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCovering and adding layers\nseal verb [T]\n(MARK)\nto make an agreement more certain or to approve it formally: The two leaders sealed their agreement with a handshake.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nIdiom\nseal someone's fatePhrasal verbs\nseal something in\nseal something off\nin the US and some other countries, a member of an elite (= especially good and highly trained) force within the navy that deals with special operations that involve water. SEAL is an abbreviation for Sea, Air, and Land Team: The 23-year-old from Massachusetts wants to become a Navy SEAL. Tributes were paid to the Thai Navy Seal who died during the cave rescue.\nMore examplesFewer examplesCaptain Shepherd was a former astronaut and a former Seal.He was a former Navy SEAL commander who headed the Naval Special Warfare Task Unit in the Pacific. I'm not a tough guy, I'm not a commando, I'm not strong, I'm not intensely trained, I'm not a SWAT guy, I'm not a Navy Seal. The company was run mainly by former SEALs, men highly trained in military operations.\nSMART Vocabulary: related words and phrases\nThe Navy\nadmiralty\naircraft carrier\narmada\nbattleship\nbroadside\ncruiser\ndestroyer\ngunboat\nHMS\nminesweeper\nnaval\npocket battleship\nRFA\nRN\nseaborne\nthe Navy Seals\nthe USN\ntransport ship\ntroopship\nU-boat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of armies & groups of servicemen\nseal noun [C]\n(ANIMAL)\nAdd to word list\nAdd to word list\na large, fish-eating mammal that has very thick fur and lives in the sea: Seals are sometimes hunted for their valuable fur.\nseal noun [C]\n(OFFICIAL MARK)\nan official mark on a document which shows that it is legal or actually what it claims to be: Diplomas are stamped with the state seal.\nA seal of approval means that something has been proven to be good or is very pleasing: My brother’s girlfriend got my mom’s seal of approval.\nseal noun [C]\n(COVERING)\nanything that prevents the escape of liquid or gas from a container or pipe: The oil seal broke, and all the oil leaked from the engine. Don’t use that jar of baby food if the seal is broken.\nseal verb [T]\n(CLOSE)\nto close a container or opening, or to prevent the escape of a liquid or gas from something: Rubber seals jars tightly. He sealed the envelope and put a stamp on it. [ M ] Broiling with high heat seals in the flavor of the meat. [ M ] The police sealed off the area (= prevented people from entering it).\nIf official documents are sealed, they cannot be seen or are not available to the public.\nseal verb [T]\n(APPROVE)\nto formally approve an agreement: They sealed the agreement with their signatures.\nAdd to word list\nAdd to word list\nan official mark on a document, sometimes made with wax, that shows that it is legal or has been officially approved: The documents were marked with the official seal.\na thin piece of paper or plastic that covers the opening of a container and has to be broken before the contents can be used: The seal on the bottle was broken.\nsomething fixed around the edge of an opening to prevent liquid or gas flowing through it: A video showed cracked seals and leaking water inside the coal mine.\nunder seal\nLAW if something is under seal, it cannot be seen, copied, or taken away: His file is currently under seal. See also\ncompany seal\nto make an agreement more certain or to approve it formally: seal sth with sth The loans are typically sealed with handshakes.\nto close an entrance or container so that nothing can enter or leave it: The doors are sealed.\nto cover a surface with a special liquid in order to protect it: seal sth with sth The office floors were sealed with varnish.\nto close a letter or parcel by sticking the edges together: seal down sth Seal down the envelope."}