{"id":322880,"name":"season","type":"noun","us_sound":"ˈsiː.zən","us_link":"../audio/s/season.mp3","uk_sound":"ˈsiː.zən","uk_link":"../audio/s/uksear_014.mp3","content":"Add to word list\nAdd to word list\nB1 one of the four periods of the year; spring, summer, autumn, or winter\nB1 the period of the year when something that happens every year happens: How long does the dry/hurricane/monsoon season last?\nB1 the period of the year during which a particular sport is played: The British football season begins in August. the holiday, summer, tourist, etc. season\nthe period when most people take their holidays, spend time with their families, go to visit places, or take part in an activity outside work: Air fares are more expensive during the holiday season.\nSee more\nmainly US (UK usually series) one of several series of television programmes with the same title and the same characters: the third season of Homeland\nUK a period when a set of programmes, plays, or musical events are broadcast or performed: There will be more documentaries and fewer quiz shows in the autumn season on TV. There's a season (US festival) of 1960s French films at the Arts Cinema next month. in season\nB2 If fruit and vegetables are in season, they are being produced in the area and are available and ready to eat: Fruit is cheaper when it's in season.\nat the time of year when many people want to travel or have a holiday: Hotel rooms are more expensive in season.\nA female animal that is in season is ready to have sex and able to become pregnant.\nAn animal that is in season can be hunted legally during a particular period of time.\nSee more out of season\nC1 If fruit and vegetables are out of season, they do not grow in the area during that time: In Europe, tomatoes are out of season in winter.\nC2 during the period when fewer people want to travel or have a holiday\nduring the period when it is not legal to hunt animals\nSee more\nMore examplesFewer examplesAutumn is my favourite season.Vegetable prices fluctuate according to the season.We could always go later in the season.The island is very busy during the tourist season.April sees the start of the football season.\nSMART Vocabulary: related words and phrases\nThe seasons\nautumn\nautumnal\nautumnally\ndead\nestival\nfall\nin the dead of night/winter idiom\nmidsummer\nmonsoon\nrain\nseasonal\nseasonality\nseasonally\nspring\nspring fever\nsummer\nturn the clocks forward phrase\nvernal\nwinter\nwintertime\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelating to regular periods of time\nCompetitions, & parts of competitions\nBroadcasting: programmes & other broadcasts\nSpectacles & performances\nBroadcasting in general\nIdiom\nthe season of goodwill\nseason verb [T]\n(FLAVOUR)\nto improve the flavour of savoury food by adding salt, herbs, or spices when cooking or preparing it: Drain the rice, stir in the salmon and season to taste (= so that it has the taste you like).\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nseason verb [T]\n(WOOD)\nto make wood hard by drying it gradually, in order to make it ready for use\nSMART Vocabulary: related words and phrases\nBuilding: carpentry & joinery\nbeading\nbevel\nbevelled\ncabinetmaker\ncarpenter\nfretsaw\ngimlet\nintarsia\njigsaw\njoiner\njoinery\nmitre\nplane\nprime\nsand\nsandpaper\nsawdust\nseasoned\nshelve\nwoodwork\nSee more results »\nseason verb [T]\n(PAN)\nto put oil or fat onto a pan and then bake it in order to create a good surface for cooking and to prevent rust: Cast iron pans need to be seasoned before the first use.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nseason noun [C]\n(PART OF YEAR)\nAdd to word list\nAdd to word list\none of the four parts a year is divided into; spring, summer, fall, or winter\nseason noun [C]\n(PERIOD)\na period of time during the year, esp. a period that happens every year at the same time: flu season the holiday season The baseball season lasts from April to October. in season\nA fruit or vegetable that is in season is available fresh locally at that time: Strawberries are in season.\nseason verb [T]\n(FLAVOR)\nto improve the flavor of food by adding small amounts of salt, herbs, or spices: Season the soup with fresh tarragon, salt, and pepper.\nAdd to word list\nAdd to word list\na period of the year when a particular activity or event happens: the autumn/spring/summer/winter season Travel agents are offering tempting discounts to persuade holidaymakers to book early for the 2013 season. the holiday/tourist season Stores are hoping for a strong Holiday buying season. Cotton farmers have prospered from a long growing season.\nFINANCE one of the times during the year when companies announce their financial results: The bank started the half-year reporting season for UK retail banks on Friday with its announcement of increased profits.\nthe time in each year when new styles of clothes, hair, etc. become fashionable: The fashion business moves so quickly that nobody can remember last season's look.\nin season\nif fruit and vegetables are in season, they are being produced in the area, and are available and ready to eat: It is unacceptable for carrots to be imported when they are in season in the UK.\nat the time of the year when many people want to travel or have a holiday: The bar is open daily in season.\nout of season\nif fruit and vegetables are out of season, they do not grow in the area at that time of the year: out-of-season vegetables Some produce travels halfway across the world so that we can eat fruits and vegetables out of season.\nduring the period of the year when fewer people want to travel or have a holiday: There has been an increase in the number of retired people taking holidays out of season. See also\ndead season\nhigh season\nlow season\noff season"}