{"id":322888,"name":"seasoned","type":"adjective","us_sound":"ˈsiː.zənd","us_link":"../audio/s/seasoned.mp3","uk_sound":"ˈsiː.zənd","uk_link":"../audio/s/uksear_019.mp3","content":"seasoned adjective\n(EXPERIENCED)\nAdd to word list\nAdd to word list\nhaving a lot of experience of doing something and therefore knowing how to do it well: a seasoned traveller a seasoned campaigner for human rights Synonym\nexperienced approvingOpposites\ngreen (NOT EXPERIENCED) informal\ninexperienced\nunseasoned\nMore examplesFewer examplesNobody, not even the most seasoned professional, can observe a child the way a parent can.She is a seasoned observer of the state's political scene.\nSMART Vocabulary: related words and phrases\nExperienced\ncosmopolitan\nduck\nexperienced\ngrandmother\nhave been around the ridges idiom\npedigreed\npractised\npseudo-sophistication\nridge\nsea dog\nsenior\nsophisticate\nsophisticated\ntake to something like a duck to water idiom\nteach your grandmother to suck eggs idiom\nultra-sophisticated\nurbane\nurbanely\nveteran\nwarhorse\nSee more results »\nseasoned adjective\n(FOOD)\nSeasoned food has had salt, pepper, herbs, or spices added to it: Some people find that highly seasoned foods or raw fruits and vegetables make their symptoms worse. If you like mildly seasoned food then you will like this recipe. Opposite\nunseasoned\nMore examplesFewer examplesKebabs are a simple grilled meal that consists of alternating seasoned meat and vegetables on a wooden skewer.For jerky, hang seasoned meat strips in the oven and dry overnight at 175 degrees.The food was barely seasoned and was very bland.\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsalty\nsavory\nsavoury\nunseasoned\nunsweetened\nvelvety\nvinous\nwiney\nSee more results »\nseasoned adjective\n(WOOD)\nSeasoned wood has been left to dry before being used: Seasoned wood, or wood that has been dried naturally for about eight or nine months, is in short supply. Make sure you burn dry, seasoned wood that has been stored under cover for at least a year. Opposites\ngreen (NOT READY)\nunseasoned\nMore examplesFewer examplesDry wood or seasoned wood is difficult to find, and expensive, too, if you can find it.The door was made of tough, seasoned wood and a good inch thick.\nSMART Vocabulary: related words and phrases\nTypes of wood\nAmerican elm\nAtlantic white cedar\nbalk\nbalsa wood\nbark\nbasswood\nblack locust\nboxwood\ncork\nelm\nknotty\nMDF\nmulga\noaken\npaulownia\npiny\npitch pine\nponderosa pine\nsoftwood\nthree-ply\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuilding: carpentry & joinery\nseasoned adjective\n(PAN)\nA seasoned iron pan has been protected with oil before it is used: Seasoned pans should never be washed in the dishwasher. When it comes to cleaning cast iron, most manufacturers advise against the use of soap or detergent on a seasoned pan. Opposite\nunseasoned\nMore examplesFewer examplesIf you season the pan well and use it a lot you will always have a well-seasoned pan. Why should I bother with nonstick when a nicely seasoned pan performs just as well?\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nslap\nslap something on\nsmother something in/with something\nspeckle\nstudded\ntent\nwax\nSee more results »\nAdd to word list\nAdd to word list\nhaving much experience and knowledge of a particular activity: seasoned travelers/journalists"}