{"id":322900,"name":"seat","type":"noun","us_sound":"siːt","us_link":"../audio/s/seat.mp3","uk_sound":"siːt","uk_link":"../audio/s/uksear_021.mp3","content":"seat noun\n(FURNITURE)\nAdd to word list\nAdd to word list\nA2 [ C ] a piece of furniture or part of a train, plane, etc. that has been designed for someone to sit on: Chairs, sofas and benches are different types of seat. Please have/take a seat (= sit down). A car usually has a driver's seat, a front/passenger seat and back/rear seats. My ticket says 22D but there's already someone in (= sitting on) that seat. Is this seat free/taken (= is anyone using it)? Would you keep (= stop anyone else from sitting in) my seat (for me) while I go get some food?formal Please stay in/keep your seats (= stay sitting down) until asked to leave. Could I book/reserve two seats (= arrange for them to be officially kept for me) for tomorrow evening's performance?\nTsvi Braverman/EyeEm/GettyImages\nMore examplesFewer examplesDid I take your seat? Do excuse me.If you'd like to take a seat, Mr Chang will be with you in a moment.The back seat of the car folds down.He leaned back in his seat with a sigh.Please remain in your seat until the plane comes to a complete stop.\nSMART Vocabulary: related words and phrases\nChairs & seats\n-seater\narmchair\narmrest\nbanquette\nbar stool\nbeach chair\nbeanbag\nbooster seat\nfront seat\ngallery\nhigh chair\nliving room suite\nlounger\nperch\nsag bag\nseating\nsettee\nshooting stick\nstall\nstool\nSee more results »\nseat noun\n(BOTTOM PART)\n[ C usually singular ] the part of a piece of furniture or clothing on which a person sits: I've spilled some coffee on the seat of the armchair. The seat of those trousers looks a little tight. Do you want to try a larger size?\nSMART Vocabulary: related words and phrases\nFurniture & fittings - general words\nappointed\nbamboo\nbuilt-in\ncaning\ncastor\nfitted\nfitting\nflatpack\nfoldable\nfolding\nionizer\noverequipped\npullout\nradiogram\nrattan\nself-assembly\nspace-saving\nsprung\nsunshade\nunder-counter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of clothes\nseat noun\n(PART OF BODY)\n[ C ] a person's bottom (= the part of the body that you sit on): When trying out the bike, I had to stop often because my seat was sore.\nSMART Vocabulary: related words and phrases\nThe buttocks\narse\nass\nback end\nbackside\nbot\nbottom\nbum\nbun\nbutt\nbuttock\nduff\nfanny\nfundament\ngluteal\nposterior\nprat\nrear\nrump\ntail\ntush\nSee more results »\nseat noun\n(POSITION)\nC2 [ C ] an official position as a politician or member of a group of people who control something: She has a seat on the board of directors. He is expected to lose his seat on the city council in next month's elections. She won her seat in Parliament in 2004. He has a very safe seat (= a position that is very unlikely to be lost in an election).\n[ C ] Indian English the place in an office where a particular person sits: I'm sorry - he's not in his seat right now.\n[ C ] Indian English a place on a course to study something: On receipt of the tuition fees, the college will issue a letter confirming your seat on the course.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlaces and locations\nClasses & courses\nseat noun\n(BASE)\n[ C ] a place that acts as a base or centre for an important activity: The seat of government in the US is in Washington, DC. St Petersburg was the seat of the Russian Revolution.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nseat noun\n(ON HORSE)\n[ C usually singular ] the way that a person sits when riding a horse: Your security and your control of the horse depend greatly on having a good seat.\nSMART Vocabulary: related words and phrases\nHorse riding\nbridle\ncanter\ncinch\ncurry\nendurance rider\nendurance riding\nequestrianism\neventer\ngirth\nhigh-spirited\nhorseman\njib\njodhpurs\nmounted\npony trekking\nrein\nsaddle-sore\nsidesaddle\nsnaffle\nwhip\nSee more results »\nRelated word\nseat-of-the-pantsIdioms\nbums on seats\nseat of learning\nby the seat of your pants\n[ T + adv/prep ] to arrange for someone to have a particular seat: The waiter greeted me with a big smile and seated us by the window. seat yourself [ usually + adv/prep ]\nto sit somewhere: \"I'm so glad to see you!\" she said, seating herself between Eleanor and Marianne. She seemed restless but eventually seated herself beside him. Tom seated himself opposite her and tried not to stare. She had already seated herself behind her desk. After some deliberation, Sara seated herself by the window. Having looked out of the window, he returned to his desk and seated himself again.\nC2 [ T not continuous ] (of a building, room, table, or vehicle) to have enough seats for the stated number of people: The new concert hall seats 1,500 people.\nSMART Vocabulary: related words and phrases\nSitting and standing\nakimbo\nastride\nbestride\ncross-legged\ncrouch\nfoot\non all fours idiom\npew\nplump (someone/something) down\npose\nrampant\nreseat\nsit\nstance\nstand around\nstand aside\nstand round\nstand up\nstrike\nsurface\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccommodating people\nwith enough seats for the particular number of people: a 2,000-seat theatre\nSMART Vocabulary: related words and phrases\nChairs & seats\n-seater\narmchair\narmrest\nbanquette\nbar stool\nbeach chair\nbeanbag\nbooster seat\nfront seat\ngallery\nhigh chair\nliving room suite\nlounger\nperch\nsag bag\nseating\nsettee\nshooting stick\nstall\nstool\nSee more results »\nseat noun [C]\n(PLACE TO SIT)\nAdd to word list\nAdd to word list\na piece of furniture or other place for someone to sit: She left her jacket on the back of her seat. I got a seat on the flight to New York. Please take a seat (= sit down).\nA seat is a part of something on which a person sits: a bicycle seat There’s a piece of gum stuck under the seat of the chair. He stood up and brushed the sand off the seat of his pants.\nseat noun [C]\n(OFFICIAL POSITION)\nan official position as a member of a legislature or group of people who control an organization: She decided to run for a seat on the school board.\nseat noun [C]\n(PLACE)\na place that is a center for an important activity, esp. government: Pittsburgh is the county seat of Alleghany County.\nIdiom\nby the seat of your pants\nseat verb [T]\n(HAVE PLACE TO SIT)\nto have or be given a place to sit: I was seated between Jasmine and Emily. The concert hall seats 350. Our group is still waiting to be seated for dinner. Please be seated (= sit down).\nAdd to word list\nAdd to word list\nPOLITICS an official position as a politician: a seat in sth a seat in Parliament/the House of Representatives She is expected to lose her seat at the next election.\nWORKPLACE, MANAGEMENT an official position as a member of a group of people who control a company or organization: a seat on sth The investors demanded several seats on the board.\nSTOCK MARKET, FINANCE a position as a member of a particular stock exchange, commodities exchange, etc. who has the right to trade there: a seat on sth A seat on the New York Exchange confers membership in the exchange.\nCOMMERCE, TRANSPORT one of the places on a plane, etc. or in a theatre, etc. where the passengers or audience sit: We managed to find a seat on a later flight. The best seats at the concert had been reserved for corporate sponsors. See also\nback adjective\nbe in the driving seat\nthe hot seat"}