{"id":323020,"name":"secessionist","type":"adjective","us_sound":"sɪsˈeʃ.ən.ɪst","us_link":"../audio/s/usseals023.mp3","uk_sound":"sɪsˈeʃ.ən.ɪst","uk_link":"../audio/s/ukseces002.mp3","content":"Add to word list\nAdd to word list\nrelating to or supporting secession (= the act of becoming independent and no longer part of a country, area, organization, etc.): secessionist movements See\nsecede\nMore examplesFewer examplesthe Yugoslav secessionist wars of the 1990s It did not affect those crossing the border from the secessionist regions of Abkhazia and South Ossetia. The letter sought to prohibit the secessionist parishes from using the church buildings.Other countries face their own secessionist movements - Spain with the Basques, Romania with ethnic Hungarians, and Russia with Chechens. For years, about a dozen Indian secessionist rebel groups have maintained bases in Burma's jungles.\nSMART Vocabulary: related words and phrases\nTaking action against people in power\nanarchist\nangry young man\nanti-apartheid\nanti-state\nbring\ninsurgency\ninsurrection\nlevel up\nmutineer\nmutinous\nred flag\nrevolt\nrevolution\nrevolutionarily\nrevolutionary\nsubversiveness\ntopple\ntroublemaker\nungovernable\nuprising\nSee more results »\nsomeone who supports the idea of independence and no longer being part of a country, area, organization, etc.: He was an ardent secessionist before the American Civil War. See\nsecede\nMore examplesFewer examplesThe mayor believes the city should negotiate with secessionists so that a clear proposal is placed before voters.Secessionists don't yet have anyone to head their campaign and fund-raising efforts. An ardent secessionist, he resigned from the U. S. Navy even before his home state of Alabama seceded.Secessionists in Aceh, Indonesia, are battling the government.He denounced \"tribal secessionists and traitors\".\nSMART Vocabulary: related words and phrases\nTaking action against people in power\nanarchist\nangry young man\nanti-apartheid\nanti-state\nbring\ninsurgency\ninsurrection\nlevel up\nmutineer\nmutinous\nred flag\nrevolt\nrevolution\nrevolutionarily\nrevolutionary\nsubversiveness\ntopple\ntroublemaker\nungovernable\nuprising\nSee more results »"}