{"id":323049,"name":"secondary","type":"adjective","us_sound":"ˈsek.ən.der.i","us_link":"../audio/s/secondary.mp3","uk_sound":"ˈsek.ən.dri","uk_link":"../audio/s/ukseces008.mp3","content":"secondary adjective\n(LESS IMPORTANT)\nAdd to word list\nAdd to word list\nless important than related things: Her health is what matters - the cost of the treatment is of secondary importance. The need for secrecy is secondary to the need to take immediate action.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\npicayune\npicture\npiddling\npiddly\npiffling\nunserious\nunseriousness\nvenial\nvestigial\nvestigially\nSee more results »\nsecondary adjective\n(COMING AFTER)\ndeveloping from something similar that existed earlier: The drug is not very effective against AIDS, though it may be used to treat secondary viral infections. You can't just rely on secondary sources for your research into her life history - you ought to look at primary sources such as her letters and diaries.\nSMART Vocabulary: related words and phrases\nBefore, after and already\nafore\nafterwards\nalready\nante\nas it is idiom\nbefore\nheel\nimmediate\nin advance idiom\nin advance of something/someone idiom\nin the wake of something idiom\nnext\nposterior\nprevious\nprior\npriorly\nprologue\nquondam\nupstream\nwake\nSee more results »\nsecondary adjective\n(EDUCATION)\nB1 [ before noun ] mainly UK relating to the education of children approximately between the ages of 11 and 18 years old: secondary education They receive state money to train secondary teachers. See also\nsecondary school\nMore examplesFewer examplesIn some countries secondary education is not universally available.The last ten years have seen a transformation in secondary education.Maths and science secondary teachers are in high demand.He attended Puerto Rico's prestigious Jesuit Seminary, at that time the island's only secondary institution.\nSMART Vocabulary: related words and phrases\nTypes of education\nabstinence education\nabstinence programme\nabstinence-only\nacademically\nadaptive learning\nCAL\nclassroom\nhigher\nhomeschool\nhomeschooler\nhomeschooling\nhothouse\nintersession\nnursery\nscholarship\nspecial educational needs\nunacademic\nvirtual learning environment\nVLE\nvocationally\nSee more results »\nRelated word\nsecondarily\nsecondary adjective [not gradable]\n(LESS IMPORTANT)\nAdd to word list\nAdd to word list\nless important than related things: A coach’s first responsibility is to the team – everything else is secondary.\nsecondary adjective [not gradable]\n(EDUCATION)\nrelating to the education of children approximately between the ages of 12 and 18: The secondary curriculum will have to be drastically improved.\nsecondary adjective [not gradable]\n(COMING AFTER)\ndeveloping from something similar that existed earlier: Someone who’s been treated for cancer can get a secondary tumor 20 years later.\nAdd to word list\nAdd to word list\nless important than related things: a secondary consideration/factor/objective Annual reported earnings are often seen as being of only secondary importance.\nPRODUCTION developed from something similar that existed earlier: They are the single largest provider of aluminium and its secondary products.\nFINANCE, STOCK MARKET used to describe the trading of existing bonds, shares, etc. rather than new ones: Mortgage securities were mixed in secondary trading. Compare\nprimary"}