{"id":323083,"name":"secret","type":"noun","us_sound":"ˈsiː.krət","us_link":"../audio/s/secret.mp3","uk_sound":"ˈsiː.krət","uk_link":"../audio/s/ukseces014.mp3","content":"Add to word list\nAdd to word list\nB1 [ C ] a piece of information that is only known by one person or a few people and should not be told to others: Why did you have to go and tell Bob about my illness? You just can't keep a secret, can you? A close couple should have no secrets from each other. Aren't you going to let me in on (= tell me) the secret? There's no secret (= everyone knows) about his homosexuality. She makes no secret of (= makes very clear) her dislike of her father. That restaurant is one of the best-kept secrets in Rome.\n[ C ] a fact about a subject that is not known: the secrets of the universe\nB2 [ S ] the particular knowledge and skills needed to do something very well: So what's the secret of being a good cook?\nMore examplesFewer examplesa closely guarded secretIt's a secret, so don't give the game away, will you?A secret report incriminating the company was leaked last week.Shall I let you in on a little secret?He revealed the secret under torture.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivate\nprivately\nprivileged\npseudonym\npseudonymization\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKnowledge and awareness\nIdioms\nin secret\nyour secret's safe with me\nB1 If something is secret, other people are not allowed to know about it: The president escaped through a secret passage underneath the parliament building. We ought to keep these proposals secret from the chairman for the time being. This is top (= extremely) secret information. Do you think we'll manage to keep the surprise party secret from Mum until her birthday?\nThesaurus: synonyms, antonyms, and examples\nkept hidden from other peoplesecretThe spies had a secret meeting.covertThe government was accused of covert military operations.clandestineHe arranged a clandestine meeting between his client and the candidate.confidentialAll the information you give us will be treated as strictly confidential.classifiedThese documents contain classified information.\nSee more results »\n[ before noun ] used to refer to someone who has a particular habit, hobby, or feeling but does not tell or show other people that they do: a secret drinker a secret admirer\nMore examplesFewer examplesA secret buyer is understood to have paid £1 million for the three pictures .She's got a secret admirer who keeps sending her gifts.The amazing thing is that it was kept secret for so long.The man's identity was being kept secret while he was helping police with enquiries.The trial was kept secret because of the risk of public disorder.\nSMART Vocabulary: related words and phrases\nSecrecy and privacy\nanonymity\nanonymization\nanonymize\nanonymous\nanonymously\ndead men tell no tales idiom\ndissimulate\ndissimulation\ndown-low\nentre nous\nprivate\nprivately\nprivileged\npseudonym\npseudonymization\nunsourced\nunstated\nuntraceable\nwhitewashing\nwrap\nSee more results »\nRelated word\nsecretly\nAdd to word list\nAdd to word list\na piece of information that is not generally known or is not known by someone else and should not be told to others: We don’t keep secrets from each other. Don’t tell anyone – it’s a secret. What’s the secret of your success (= How was it achieved)?\nknown, done, or kept without others knowing: secret information The peace process began with secret talks in Norway. secrecy noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈsi·krə·si/\nWhat’s the reason for all this secrecy? secretly adverb us\nYour browser doesn't support HTML5 audio\n/ˈsi·krɪt·li/\nThey secretly took photographs of Jack.\nAdd to word list\nAdd to word list\nif something is secret, only particular people are allowed to know about it: secret deal/meeting/talks Staff were informed to keep the company's plans secret. a secret document/operation/proposal See also\ntop-secret\nan important piece of information that only a few people know and that should not be told to anyone else: The ingredients of the drink are a closely-guarded secret. a national/military/state secret See also\ntrade secret"}