{"id":323145,"name":"section","type":"noun","us_sound":"ˈsek.ʃən","us_link":"../audio/s/section.mp3","uk_sound":"ˈsek.ʃən","uk_link":"../audio/s/ukseces027.mp3","content":"section noun\n(PART)\nAdd to word list\nAdd to word list\nB1 [ C ] one of the parts that something is divided into: the sports section of the newspaper the tail section of an aircraft Does the restaurant have a non-smoking section? The poorest sections of the community have much worse health. He was charged under section 17 of the Firearms Act (= according to that part of the law).\n[ C ] one of the parts of an orchestra (= a group of musicians who play many different instruments together) or band, consisting of people who play the same kind of instruments: With the string sections sitting at the front of the stage, they can sometimes overwhelm the woodwind section. The piece gave the horn section a chance to shine.\nMore examplesFewer examplesMost news magazines have a section devoted to external affairs .Every week in the books section of the paper they profile a different author.This section of motorway will be under repair until January.He plays in the brass section of the orchestra.I found the article buried away in the business section of the newspaper.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of musicians\nsection noun\n(CUT)\n[ C or U ]\n&#160; medical\n&#160; specialized a cut made in part of the body in an operation\n[ C ]\n&#160; medical\n&#160; specialized an operation in which a woman's uterus is cut open to allow a baby to be born Synonym\nCaesarean\n[ C ]\n&#160; biology\n&#160; specialized a very thin slice of a part of an animal, plant, or other object made in order to see its structure: Each section is mounted on a slide and examined under the microscope.\n[ C ]\n&#160; architecture, geology, engineering\n&#160; specialized a drawing or model that shows the structure of something by cutting part of it away: This vertical section of the soil shows four basic soil layers.\n[ C ] the shape of a flat surface that is produced when an object is cut into separate pieces in section\nshowing what something would look like if the surface was cut away and you could see inside: The first diagram is a view of the building from the street, and the second shows it in section.\nSee more\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nhysterectomy\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nreplacement\nresected\nresection\nrhino\nrhinoplasty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObstetrics: birth\nWords meaning small pieces and amounts\nPainting, drawing & printing\nModels & moulds\nGeometry: parts of geometrical shapes\nto officially force someone who has mental health problems to stay in a hospital and receive treatment because they might harm themselves or other people: He was sectioned under section 4 of the Mental Health Act.\nSMART Vocabulary: related words and phrases\nMedical treatment: treating & caring for people\naggressively\nbed blocker\nbed-blocking\nbring\nbring someone around\nclinic\nhealth tourism\nkeep your/an eye on something/someone idiom\nlogroll\nlogrolling\nlook after someone/something\nnurse\npatch\nprep\nrehospitalization\nrehospitalize\nrespite care\nself-care\nset something up\ntend\nSee more results »\nPhrasal verb\nsection something off\nAdd to word list\nAdd to word list\na part of something: Dad always reads the sports section of the newspaper. He lived in a poor section of town. You’ll find ice cream in the frozen food section of the supermarket.\nto divide something into parts: If the tooth is sectioned lengthwise, ridges of alternating dark and light rings can be seen. Phrasal verb\nsection off something\nAdd to word list\nAdd to word list\nCOMMUNICATIONS one of the parts of a book, newspaper, website, etc. that deals with a particular subject: The article appeared in the business section of the Sunday Times.a section on sth The website has a useful section on business law.\nLAW one of the parts that a document or law is divided into, each of which has its own number: under section 2/20, etc. of sth The purchaser could have brought an action against the vendor under section 12 of the Sale of Goods Act.\nMANAGEMENT, WORKPLACE one of the parts of an organization: His section was due to be audited. the Accounting and Finance Section\nSee also\ndepartment\nfirst section\nsecond section\nthird section"}