{"id":323129,"name":"sectarian","type":"adjective","us_sound":"sekˈter.i.ən","us_link":"../audio/s/sectarian.mp3","uk_sound":"sekˈteə.ri.ən","uk_link":"../audio/s/ukseces025.mp3","content":"Add to word list\nAdd to word list\ncaused by or feeling very strong support for the religious or political group that you are a member of, in a way that can cause problems with other groups: a sectarian murder He called on terrorists on both sides of the sectarian divide to end the cycle of violence.\nMore examplesFewer examplesIn Uganda and elsewhere in Africa, this anger has spawned sectarian violence.He said his players had been subjected to sectarian abuse.The country is plagued by sectarian movements and groups defined by ethnicity pitted against one another.The attack was thought to be sectarian. Americans do not want their tax dollars going to schools which discriminate in admissions and hiring and are pervasively sectarian.\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\ndruid\nEpiscopalian\nevangelist\nfakir\nFranciscan\nmissionary\nMohammedan\nMoonie\nmoral majority\nMormon\nSeventh-Day Adventist\nShia\nShiite\nSikh\nsisterhood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nRelated word\nsectarianism\na person who very strongly supports the religious or political group that they are a member of, in a way that may cause problems with people from other groups: We have to stand up for the moderates against the extremists and the sectarians.\nMore examplesFewer examplesHe remains a sectarian who is full of hatred.He called his opponent \"a madman and a sectarian.\"He has been wrongly characterized as a tool of Republican sectarians.People on the far left and right of politics are enthusiastic sectarians.\nSMART Vocabulary: related words and phrases\nReligious people: followers of religious groups\nAdventist\nAnglican\nanimist\nanti-cult\nanti-papal\ndruid\nEpiscopalian\nevangelist\nfakir\nFranciscan\nmissionary\nMohammedan\nMoonie\nmoral majority\nMormon\nSeventh-Day Adventist\nShia\nShiite\nSikh\nsisterhood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolitical movements & groups\nAdd to word list\nAdd to word list\nrelating to a sect, or happening between sects: sectarian fighting"}