{"id":323244,"name":"security","type":"noun","us_sound":"səˈkjʊr.ə.t̬i","us_link":"../audio/s/security.mp3","uk_sound":"sɪˈkjʊə.rə.ti","uk_link":"../audio/s/uksecul006.mp3","content":"security noun\n(PROTECTION)\nAdd to word list\nAdd to word list\nB1 [ U ] protection of a person, building, organization, or country against threats such as crime or attacks by foreign countries: The station was closed for two hours because of a security alert. 30 demonstrators were killed in clashes with the security forces over the weekend. The tighter security measures/precautions include video cameras throughout the city centre. The students were deported because they posed a threat to national security. The banks must tighten security against fraud. The most dangerous criminals are held in maximum-security prisons (= prisons that are as difficult as possible to escape from).\n[ U, + sing/pl verb ] the group of people responsible for protecting a building: You'll need to notify security if you want to work late in the office.\nMore examplesFewer examplesWhy would a tenant agree to swap life-time security for a short-term lease?You need some financial security when you have children.Government bonds are a sound investment because they combine good profits and high security.In this age of short-term contracts, job security often seems like a thing of the past.If it's a choice between higher pay and job security, I'd prefer to keep my job.\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\npreservationist\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nSee more results »\nsecurity noun\n(CERTAINTY)\nC1 [ U ] the fact that something is not likely to fail or be lost: If it's a choice between higher pay and job security, I'd prefer to keep my job. I'm on a temporary contract and have little financial security (= cannot be sure of having enough money to live on).\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe\nsafe space\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunbruised\nunthreatening\nuntouchable\nwell kept\nSee more results »\nsecurity noun\n(FINANCE)\n[ U ] property or goods that you promise to give to someone if you cannot pay what you owe them: She used her shares in the company as security against a $23 million bank loan. The hotel held onto our suitcases as security while we went to the bank to get money to pay the bill. securities [ plural ]\n&#160; finance &amp; economics\n&#160; specialized\ninvestment in a company or in government debt that can be traded on the financial markets and produces an income for the investor: He pleaded guilty to three counts of securities fraud.\nSee more\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nsecurity noun\n(CONFIDENCE)\nC2 [ U ] the feeling of being confident in one's family and relationships: Most children need the security of a stable family life.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatically\ndogmatism\ndogmatist\nempowered\nfierce\nrakishness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nswag\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nSee more results »\nsecurity noun\n(FREEDOM FROM RISK)\nAdd to word list\nAdd to word list\n[ U ] freedom from risk and the threat of change for the worse : financial/job security\nsecurity noun\n(FREE FROM DANGER)\n[ U ]\n&#160; social studies freedom from danger; safety: For security reasons, for the protection of the White House and the president, they felt it necessary to close the avenue. A convicted spy, he sold information that may have damaged our national security.\n[ U ]\n&#160; social studies Security is also the group of people responsible for keeping buildings or other areas safe: If anyone gives you trouble, just call security.\nsecurity noun\n(INVESTMENT)\n[ C usually pl ] an investment in a company or in government debt that can be traded on the financial markets\nsecurity noun\n(MONEY)\n[ U ] money you pay someone that can be legally used by that person if your actions cause the person to lose money, but that will be returned to you if it is not used: You have give the landlord an extra month’s rent as security when you sign the lease.\nAdd to word list\nAdd to word list\n[ U ] the protection of people, organizations, countries, etc. against a possible attack or other crime: border/homeland/national securityboost/improve/tighten security Airport security has been tightened since the terrorist threat. lax/strict/tight security He was head of security at the Federal Aviation Administration. security firm/contractor/companysecurity system/check/measure Anyone entering the building has to undergo a series of security checks. The airport was temporarily closed due to a security alert. security cameras/lights/doors\n[ U ]\n&#160; IT, BANKING, INTERNET the protection of information against being stolen or used wrongly or illegally: data/information/IT securitysecurity measures/checks/controls The bank has taken additional security measures to ensure accounts are protected.\n[ U ] the fact or feeling that your job, money, etc. is safe and you will not lose it: He left the relative security of a corporate job to set up on his own.give/offer sb security His 15-year career in investment banking has given him the financial security to transfer his skills to the voluntary sector. economic/financial security They are concerned about the security of their investments.\n[ C, usually plural ]\n&#160; FINANCE, STOCK MARKET\n&#160; plural securities a financial investment such as a bond or share that is traded on a financial market: buy/hold/sell securities Investors who bought securities made up of subprime loans suffered the biggest losses. deal in/invest in/issue securities a securities agreement/audit/dealer a securities business/company/house\n[ U ]\n&#160; FINANCE property or goods that you promise to give someone if you cannot pay them what you owe them: give/offer/pledge sth as security She signed papers pledging their home as security against the loan. See also\nasset-backed\nbearer security\ncontinuing security\nconvertible security\ndated security\nemployment security\nfood security\nfixed-interest security\ngilts\ngovernment security\nView all\njob security\nlisted security\nlong-term security\nmarketable security\nmedium-term security\nmortgage-backed\nnegotiable\nshort-term security\nundated security\nunlisted security"}