{"id":323189,"name":"secularist","type":"noun","us_sound":"ˈsek.jə.lər.ɪst","us_link":"../audio/s/ussecul002.mp3","uk_sound":"ˈsek.jə.lər.ɪst","uk_link":"../audio/s/uksecul002.mp3","content":"Add to word list\nAdd to word list\nsomeone who believes that religion should not be involved with the ordinary social and political activities of a country: Secularists condemn Christian influence in the public sphere.\nMore examplesFewer examplesSecularists worry that with the AKP running the government, religious conservatism will grow.the nation's culture wars, pitting evangelical Christians against secularistsThe European participants were mainly secularists and had little understanding of Islam. Secularists aren't atheists. They just believe in the separation of church and state.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nmystic\nsecular humanist\nthe laity\ntheist\ntheistic\nunbelief\nunbeliever\nSee more results »\nbelieving that religion should not be involved with the ordinary social and political activities of a country: secularist ideology See\nsecularism\nMore examplesFewer examplesVery often the people who have been able to adopt a secularist or liberal ideology are the privileged, who've had the chance of some kind of education.The greatest opposition momentum lies with the secularist parties. The nation holds affectionately to its secularist individuality.Despite many schools being run by religious organisations, a secularist trend is occurring among younger generations. This group is secularist and their program tends to be technological.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nmystic\nsecular humanist\nthe laity\ntheist\ntheistic\nunbelief\nunbeliever\nSee more results »"}