{"id":323241,"name":"securing","type":"verb","us_sound":"səˈkjʊr","us_link":"../audio/s/eus75931.mp3","uk_sound":"sɪˈkjʊər","uk_link":"../audio/s/uksecul004.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsecure\nsecure verb\n(GET)\n[ T ] formal to get something, sometimes with difficulty: He was disappointed by his failure to secure the top job with the bank. The change in the law will make it harder for the police to secure convictions.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nMore examplesFewer examplesThe company managed to beat off the competition and secure the contract.The directors have managed to secure a good deal for the company.The commander-in-chief was given 36 hours to secure a withdrawal of his troops from the combat zone.The president said it was imperative that the release of all hostages be secured.Now that the finance has been secured, the production of the film is assured.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nsecure verb\n(PROTECT)\n[ I or T ] to make certain something is protected from danger or risk: The building has only one main entrance and would be easy to secure (against/from intruders). This form of investment is an excellent way of securing your children's financial future.\nMore examplesFewer examplesCare was taken to secure the crash site as a crime scene to preserve evidence.It's less easy to secure an area that is away from public view.Strenuous efforts were made to secure the area before the Prince's arrival.We must, as a matter of priority, secure the building in the light of recent developments.He was hoping to raise enough cash to secure his family's future.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ndefence\ndefend\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\ninoculation\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nundefended\nwing\nSee more results »\nsecure verb\n(FINANCE)\n[ T ] to make certain that money that has been lent will be paid back, by giving the person who lends the money the right to own property belonging to the person who borrows it, if the money is not paid back: a secured loan Her bank loan is secured against/by/on her house.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nsecure verb\n(FIX)\n[ T ] to fasten one object firmly to another: The gate won't stay open, so we'll have to secure it to that post.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »"}