{"id":323224,"name":"secure","type":"adjective","us_sound":"səˈkjʊr","us_link":"../audio/s/eus75931.mp3","uk_sound":"sɪˈkjʊər","uk_link":"../audio/s/uksecul004.mp3","content":"secure adjective\n(FIXED)\nAdd to word list\nAdd to word list\nB2 positioned or fixed firmly and correctly and therefore not likely to move, fall, or break: That ladder doesn't look very secure to me. Check that all windows and doors are secure.\nSMART Vocabulary: related words and phrases\nSafe and secure\nairworthiness\nas safe as houses idiom\nbiosafety\nbite\nhave/lead a sheltered life idiom\nhealth and safety\nimpregnable\nimpregnably\nin safe hands idiom\npotable\nprotected\nroadworthy\nsafe\nsafe space\nsomeone/something won't bite idiom\nthe coast is clear idiom\nunbruised\nunthreatening\nuntouchable\nwell kept\nSee more results »\nsecure adjective\n(PROTECTED)\nlikely to continue and not fail or be lost: Her promotion has made her position in the company more secure. The museum has been promised $22 million by the government, so its future is relatively secure. She's just left a secure job to start her own company.\n(especially of objects, situations, etc.) able to avoid being harmed by any risk, danger, or threat: Car manufacturers ought to produce vehicles that are more secure against theft. Endangered species need to be kept secure from poachers. We've done everything we can to make the house as secure as possible.\n(of a computer or phone connection, etc.) safe or protected, for example against someone stealing information: He spoke to the president on a secure phone line. The data sent and received is encrypted to ensure secure communications.\nA secure place is one that it is difficult to get out of or escape from: He killed the man just a month after his release from a secure psychiatric hospital. At the age of 14 he was placed in secure accommodation.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nsoldier\nspan\nspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSafe and secure\nsecure adjective\n(CONFIDENT)\nB2 not doubting or being worried about yourself and your personal relationships: Children need to feel secure in order to do well at school.\nSMART Vocabulary: related words and phrases\nConfidence & self-assurance\namour propre\naplomb\nassertive\nassertively\nassertiveness\ndogmatically\ndogmatism\ndogmatist\nempowered\nfierce\nrakishness\nrest assured\nsafe\nsafety blanket\nsecurity blanket\nswag\nswash\ntall\nto be sure idiom\ntoo cool for school idiom\nSee more results »\nsecure verb\n(GET)\n[ T ] formal to get something, sometimes with difficulty: He was disappointed by his failure to secure the top job with the bank. The change in the law will make it harder for the police to secure convictions.\nThesaurus: synonyms, antonyms, and examples\nto receive or be given somethinggetI got a new bike for my birthday.receiveYou will receive your tickets by email.obtainAfter many years of trying, she finally obtained Brazilian citizenship.gainYou will improve at the job as you gain experience.earnEventually, you will earn the dog's trust.achieveShe achieved top marks in the physics exam.\nSee more results »\nMore examplesFewer examplesThe company managed to beat off the competition and secure the contract.The directors have managed to secure a good deal for the company.The commander-in-chief was given 36 hours to secure a withdrawal of his troops from the combat zone.The president said it was imperative that the release of all hostages be secured.Now that the finance has been secured, the production of the film is assured.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nfill\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nseize\nseize on/upon something\nsnap something up\nSee more results »\nsecure verb\n(PROTECT)\n[ I or T ] to make certain something is protected from danger or risk: The building has only one main entrance and would be easy to secure (against/from intruders). This form of investment is an excellent way of securing your children's financial future.\nMore examplesFewer examplesCare was taken to secure the crash site as a crime scene to preserve evidence.It's less easy to secure an area that is away from public view.Strenuous efforts were made to secure the area before the Prince's arrival.We must, as a matter of priority, secure the building in the light of recent developments.He was hoping to raise enough cash to secure his family's future.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\npoisonous\nshelter\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\nSee more results »\nsecure verb\n(FINANCE)\n[ T ] to make certain that money that has been lent will be paid back, by giving the person who lends the money the right to own property belonging to the person who borrows it, if the money is not paid back: a secured loan Her bank loan is secured against/by/on her house.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nsecure verb\n(FIX)\n[ T ] to fasten one object firmly to another: The gate won't stay open, so we'll have to secure it to that post.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nsecure adjective\n(FREE FROM RISK)\nAdd to word list\nAdd to word list\nfree from risk and the threat of change for the worse: a secure job People want to feel secure economically. The museum has a large endowment, so its future is relatively secure.\nSecure can also mean confident and free from worry: Children need to feel secure in order to do well at school.\nsecure adjective\n(FREE FROM DANGER)\nfree from danger or the threat of harm or unwanted access; safe: Troops were sent to make the border secure. He questioned whether the government’s computer database was secure from hackers. For some time after the robbery we could not feel secure, even in our own home.\nsecure adjective\n(FIXED)\nfixed, fastened, or locked into a position that prevents movement: That ladder doesn’t look very secure to me. Just check that the door is secure – the lock doesn’t always work.\nsecure verb [T]\n(OBTAIN)\nto obtain something, sometimes with difficulty: She managed to secure a loan from the bank.\nsecure verb [T]\n(FASTEN)\nto fasten something firmly: Secure the boat to the dock.\nsecure verb [T]\n(MAKE SAFE)\nto make sure something is protected from danger or threat: The wall was originally built to secure the town from attack.\nAdd to word list\nAdd to word list\nto manage to get money or achieve something, often something difficult: secure financing/a loan/a grant They hope to secure a $500,000 federal grant to cover some of the development costs. secure a deal/contract/commitment secure a win/victory The Chinese bank secured $3.5 billion in offers within the first few days of its flotation.\nFINANCE to borrow money from a person or organization by agreeing that they can have your property or assets if you cannot pay it back: secure sth against/on sth The extra debt will be raised by selling bonds secured on the hotel and restaurant assets. He had used the boat as collateral to secure a $10,000 loan.\nto protect something from risk or threat: This investment is a good way of securing your family's financial future. Cost savings will help secure jobs by improving competitiveness. Police were quick to secure the area when they received the warning of a terrorist attack.\nif someone's future, investment, or job is secure, they feel confident that it will continue and not fail or be lost: Although the high returns of recent years cannot continue indefinitely, many still see property as a secure investment. Executives reassured existing employees that their jobs are secure.\nsafe and protected from the risk of an attack or crime: The latest technology allows customers to make secure online transactions. a secure line/network/site a secure area/building"}