{"id":323348,"name":"see","type":"verb","us_sound":"siː","us_link":"../audio/s/c.mp3","uk_sound":"siː","uk_link":"../audio/s/ukbysta005.mp3","content":"see verb\n(USE EYES)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to be conscious of what is around you by using your eyes: Turn the light on so I can see. I can see you! [ + (that) ] The teacher could see (that) the children had been fighting. [ + infinitive without to ] Jacqui saw the car drive up outside the police station. [ + -ing verb ] From the window we could see the children playing in the yard. [ + past participle ] His parents saw him awarded the winner's medal. See (= look at) p. 23 for prices and flight details.UK See over (= look at the next page) for further information.\nThesaurus: synonyms, antonyms, and examples\nto see somethingseeI can see for miles from up here.noticeI noticed a crack in the ceiling.perceiveBill perceived a tiny figure in the distance.observeA teacher observed her climbing over the gate.spotWe managed to spot a leopard.catch sight ofWe looked for the bird and caught sight of it just as it flew off.\nSee more results »\nA2 [ T ] to watch a film, television programme, etc.: Did you see that documentary on Channel 4 last night?\nC1 [ T often passive ] to be the time or place when something happens: This summer has seen the end of water restrictions in the area thanks to a new reservoir. you ain't seen nothing yet humorous\nsaid to mean that more surprising or exciting things are likely to happen: If you thought that show was amazing, just you wait. You ain't seen nothing yet!\nSee more\nMore examplesFewer examplesI saw him this morning.Have you seen Angela?If you see Nicky say hello from me.I've seen a few houses but none that I've really liked.I haven't seen any shoes that I've wanted to buy.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nsee verb\n(UNDERSTAND)\nB1 [ T ] to understand, know, or realize: [ + (that) ] I see (that) the club is organizing a theatre trip next month. [ + question word ] He can't see what difference it makes to come (= he doesn't think it is important if he comes) on Thursday instead of Friday. They didn't see the need/any need (= understand that it was important) to notify their members of the changes in writing. They refused to help because they're too busy, but he seems to see more in it than that. \"I'm tired.\" \"So I see - you've been yawning all afternoon.\" I was surprised that they couldn't see my point of view. The government didn't want to be seen to be making concessions to terrorists. After she read his book she started to see the issue in another/a different/a new light (= differently).\nMore examplesFewer examplesI see he's left that report on my desk.I see Bill's on another of his trips.I don't see why she's more important than anyone else.Why can't you see things from my point of view?I see what you're saying.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\nsee verb\n(MEET)\nA1 [ I or T ] to meet or visit someone, or to visit a place: We're seeing friends this weekend. I haven't seen Jerry around (= in the places I usually meet him) in the last few weeks. No one has seen much of Daryl since he got married. They see a lot of each other (= are often together). My mother is seeing the doctor again next week. The children wanted to see the circus. The agent said they could see the house (UK also see round the house) at 3 p.m.\n[ T ] to have a romantic relationship with someone: How long has she been seeing him?\nMore examplesFewer examplesI'm seeing Peter tonight.I saw her last week - we went out for dinner together.I've arranged to see John at the weekend.He's been seeing a woman that I work with.She told me her husband had been seeing someone.\nSMART Vocabulary: related words and phrases\nMeeting people\nacquaintance\nayup\nbump into someone\ncounter-rally\ncross someone's path/cross paths with someone idiom\nfarewell\nfish\nmass\nmeeting\nmuster point\nopen house\npaths cross idiom\npay your respects idiom\npower lunch\nre-encounter\nre-meet\nreconvene\nrecross\nrendezvous\nrespect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVisiting\nMarriage, cohabitation & other relationships\nsee verb\n(CONSIDER)\nB2 [ T ] to consider or think about, especially to think about someone or something in a particular way, or to imagine someone doing a particular activity: She didn't see herself as brave. It was easy to see the gift as a kind of bribe. [ + obj + -ing verb ] I can't see her accepting (= I don't think she will accept) the job in the present circumstances. As I see it/things/the situation, we'll have to get extra help. Try and see it my way - I'll be left without any help if you go.\nThesaurus: synonyms, antonyms, and examples\nto imagine somethingimagineYou can just imagine her storing up these anecdotes for her dinner parties.think ofI want you to think of a time when you felt happy.pictureCan you picture yourself at the age of 60 doing what you do now?pictureWhen I say 'your car' you have a picture of that in your head.in your mind's eyeIn my mind's eye, I'm still a uni student and not a middle-aged worker.conceiveI can't conceive why anyone would want to hurt her.\nSee more results »\nMore examplesFewer examplesWhere do you see yourself in five years' time?I can't see Annie on a horse somehow.I can't see him coming back home for any length of time.I don't see myself as a mother figure.I think he sees himself very much as a leader.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImagining and conceiving\nsee verb\n(GO WITH)\n[ T usually + adv/prep ] to take someone somewhere by going there with them: He saw his visitors to the door. Her friends saw her home. The security guard saw the protesters off the premises.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nsee verb\n(TRY TO DISCOVER)\nB2 [ I + question word ] to try to discover: Will you see if you can get anyone to help? I'll see what I can do.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nsee verb\n(MAKE CERTAIN)\nC2 [ + (that) ] to make certain that something happens: The receptionist said he'd see (that) she got the message.UK See (that) you're ready by five, or there'll be trouble.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nGrammar\nHear, see, etc. + object + infinitive or -ingWe can use either the infinitive without to or the -ing form after the object of verbs such as hear, see, notice, watch. The infinitive without to often emphasises the whole action or event which someone hears or sees. The -ing form usually emphasises an action or event which is in progress or not yet completed. …\nLook at, see or watch?When we look at something, we direct our eyes in its direction and pay attention to it: …\nLook atWhen we look at something, we direct our eyes in its direction and pay attention to it: …\nSeeSee means noticing something using our eyes. The past simple form is saw and the -ed form is seen: …\nWatch as a verbWatch is similar to look at, but it usually means that we look at something for a period of time, especially something that is changing or moving: …\nLook at, see or watch: typical errorsWhen there is an object, we use at after look: …\nSeeWe use the verb see to talk about using our eyes to be aware of what is around us: …\nHear that, see thatWe use hear that and see that to introduce new pieces of information. When we do this, the verbs hear and see mean ‘understand’ or ‘notice’. We normally use hear when we are thinking of something someone told us, and see when we are thinking about something we read about or saw. We often use the verbs in the present simple and sometimes leave out that: …\nYou seeWe commonly use you see in speaking when we want to share knowledge with our listener or listeners. When we use you see, we assume that the listener or listeners do not have the knowledge that we want them to have: …\nIdioms\ncan't see it (myself)\ncan't see the wood for the trees\nhave seen better days\nsth has to be seen to be believed\n(if you've) seen one, you've seen them all\nI/we'll (have to) see\nlet me see/let's see\nnot see beyond something\nnot see someone for dust\nnot see hide nor hair of someone\nMore idioms\nsee something coming\nsee someone in hell before ...\nsee someone right\nsee your way (clear) to doing something\nsee a man about a dog\nsee eye to eye\nsee fit\nsee in the New Year\nsee life\nsee red\nsee sense/reason\nsee stars\nsee the back of someone/something\nsee the colour of someone's money\nsee the joke\nsee the last of something/someone\nsee the light\nsee the light of day\nsee the point of something\nsee something with your own eyes\nsee you (later)\nseeing is believing\nseeing things\nwe'll (soon) see about that\nwhat you see is what you get\nwouldn't be seen dead\nyou see\nPhrasal verbs\nsee about something\nsee something in someone/something\nsee someone off\nsee someone/something off\nsee something out\nsee someone out\nsee yourself out\nsee past something\nsee someone through something\nsee something through\nMore phrasal verbs\nsee through someone/something\nsee to something/someone\n[ C ] a place where there is a cathedral and where a bishop or archbishop has authority: the See of York/Exeter/Lincoln bishops and their sees\nSMART Vocabulary: related words and phrases\nReligious buildings & places\nabbey\nashram\ncaliphate\ncathedral\nchapel\ngurdwara\nhermitage\nholy city\nhouse of God\nmonastery\nmosque\nnunnery\npagoda\npantheon\nsynagogue\ntabernacle\nthe Holy See\nUnited Church of Canada\nvicarage\nwat\nSee more results »\nIdiom\nthe Holy See\nsee verb\n(USE EYES)\nAdd to word list\nAdd to word list\n[ I/T ] to be aware of what is around you by using your eyes; look at something: [ T ] From the kitchen window, I can see the kids playing in the backyard. [ + question word ] Can you see what is happening? [ T ] The agent said they could see the house at 3 p.m. [ T ] Did you see that documentary about homelessness on TV last night?\nsee verb\n(UNDERSTAND)\n[ I/T ] to understand, know, or be aware: [ I ] \"It’s easier if you hold it this way.\" \"Oh, I see.\" [ T ] I can’t see any reason why they would object. [ + question word ] I can see why you didn’t want to go out with him.\nsee verb\n(CONSIDER)\n[ I/T ] to consider someone or something in a particular way, or to imagine someone doing a particular activity: [ T ] Under the circumstances, I can’t see her accepting the job (= I do not think she will accept it). [ T ] I can’t see my brother as a businessman. [ T ] As I see it/the situation, we’ll have to get extra help. [ I ] \"Do you think there’ll be time to stop for lunch?\" \"We’ll see (= I will consider it).\" [ + question word ] I’ll see how I feel tomorrow.\nsee verb\n(MEET)\n[ T ] to meet, visit, or spend time with someone: I saw Darlene last week. Mom is seeing the doctor tomorrow. They see each other on weekends (= they are often together then). How long have they been seeing each other (= having a romantic relationship)?\nsee verb\n(TRY TO DISCOVER)\n[ + question word ] to try to discover: Will you see who is at the door?\nsee verb\n(MAKE CERTAIN)\n[ + that clause ] to make certain (that something happens): She said she’d see that her boss gets the message.\nsee verb\n(EXPERIENCE)\n[ T ] to experience something: This coat has seen a lot of wear. She’s seen a lot of changes in this office over the years.\n[ T ] If a time or place has seen something, it happened or existed there or then: This summer has seen unusually high temperatures. Idioms\nsee eye to eye (with someone)\nsee fit (to do something)\nseeing is believing\nseeing that\nseeing things\nsee red\nsee stars\nsee the light\nsee the point of something\nsee you (later)Phrasal verbs\nsee about something\nsee off someone\nsee someone through something\nsee something through\nsee through someone/something\nsee to something"}