{"id":323358,"name":"seed","type":"noun","us_sound":"siːd","us_link":"../audio/s/cede.mp3","uk_sound":"siːd","uk_link":"../audio/s/ukcaval025.mp3","content":"seed noun\n(PLANT)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a small, round or oval object produced by a plant and from which, when it is planted, a new plant can grow: Sow the seeds (= put them in the ground) about three centimetres deep. The chemical will stop all seeds from sprouting (= starting to grow). The farmers grow these crops for seed (= for planting to grow more crops, rather than for eating). Compare\npip\nMaximilian Stock Ltd/Photolibrary/GettyImages\n[ U ] literary →\nsemen go/run to seed\nIf a food plant goes or runs to seed, it produces flowers and seeds because it has not been picked early enough: In hot weather lettuces can suddenly run to seed.\nIf people or places go or run to seed, their physical appearance becomes worse because no one is taking care of them: After he retired, he really went to seed.\nMore examplesFewer examplesSow the seeds in pots.It takes about three days for the seeds to sprout.caraway seedsIt's rather early to be sowing carrot seeds, isn't it?How many seeds are there in a packet?\nSMART Vocabulary: related words and phrases\nFruits & seeds & their parts\nackee\naronia\nbarberry\nbergamot\nbur\ncaryopsis\nchaff\ncone\nflesh\npeel\npine nut\npip\npith\npoppy seed\nseed coat\nseed pod\nseedless\nsesame seed\nshea nut\nwindfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: bodily fluids & their production\nDecaying and staying fresh\nDeteriorating and making worse\nseed noun\n(BEGINNING)\nC2 [ C usually plural ] the cause of a feeling or situation, or the early stages of it: From these early seeds of their friendship, they grew into lifelong companions. He may be sowing the seeds of his own destruction in the long term by using violence against his own people.\nSMART Vocabulary: related words and phrases\nOrigins and sources\nat source phrase\nbases\nbe a recipe for disaster, trouble, success, etc. idiom\nbeginning\nbirth\nbirthplace\ncradle\nemanate\nemanate from/through something/someone\nfount\nfountainhead\ngateway drug\nhail\norigin\noriginate\npaternity\nprovenance\nrecipe\nroot\nseed corn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeginnings and starts\nseed noun\n(SPORT)\n[ C ] especially in tennis, a good player who is given a place on the list of those expected to win games in a particular competition because of the way they have played in the past: Turner's opponent in the quarter-finals is the number one seed.\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\nunreturnable\nunseeded\nvolley\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nseed verb\n(PLANT)\n[ I or T ] to produce seeds: The plants have seeded themselves (= their seeds have fallen) into the cracks between the paving stones.\n[ T ] (also deseed) to remove the seeds from a fruit or vegetable: Wash, seed, and cut the pepper into small pieces.\n[ T ] to sow (= plant) seeds somewhere: Winter wheat can be seeded into open plots. Spring is a great time to seed the bare patches in your lawn.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGardening - general words\nRemoving the skin or seed from fruit & vegetables\nseed verb\n(CAUSE)\n[ T usually + adv/prep ] to cause something to exist and develop: This was the article that seeded his book. The main strategy was getting others to buy into a vision, seeding ideas at different levels in the organization.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nseed verb\n(SPORT)\n[ T usually passive ] to make a player a seed: [ + adj ] Jones, seeded second, has won her last ten matches.\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\nunreturnable\nunseeded\nvolley\nSee more results »\nseed verb\n(CLOUD)\n[ T ]\n&#160; environment\n&#160; specialized to spread substances such as certain chemicals in clouds, in order to try to make them produce rain, or more rain: Scientists have experimented with cloud control, including seeding clouds to promote the shedding of rain. He seeds clouds in west Texas.\nMore examplesFewer examplesThey claimed to produce on average 30 percent more rain from the individual clouds they seeded.The city of Shanghai is even considering seeding clouds on the summer's hottest days to induce cooling rain showers. Policy-makers believe there will be more pressure to seed the clouds, but they want proof that it works and that there won't be harmful results.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndeluge\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\nrain gauge\nrainbow\nshower\nsun shower\ntorrentially\nwash\nwash (something) out\nwet\nSee more results »\nseed noun\n(PLANT)\nAdd to word list\nAdd to word list\n[ C/U ]\n&#160; biology a small, usually hard part of a plant from which a new plant can grow\nseed noun\n(BEGINNING)\n[ C usually pl ] the beginning or cause of something: A good defense lawyer knows how to plant these little seeds of doubt in the minds of jurors.\nseed noun\n(SPORTS)\n[ C ] any of the players or teams ranked among the best in a particular competition\nseed verb [T]\n(PLANT)\nto plant seeds in the ground: We seeded the lawn with a different grass this year.\nAdd to word list\nAdd to word list\n(UK also seedcorn) money used to start a new company, business, activity, etc. as an investment: seed capital/funding/money The conference is aimed at entrepreneurs looking for seed capital for new business ventures.\nto provide money to start a new company, business, etc. as an investment: The venture capital fund of $250 million will seed Chinese high-tech and biotechnology startup ventures."}