{"id":323408,"name":"seek","type":"verb","us_sound":"siːk","us_link":"../audio/s/seek.mp3","uk_sound":"siːk","uk_link":"../audio/s/ukseek_001.mp3","content":"seek verb\n(SEARCH)\nAdd to word list\nAdd to word list\nB2 [ T ] to try to find or get something, especially something that is not a physical object: \"Are you actively seeking jobs?\" she asked. Hundreds of dissidents are seeking refuge/asylum in the US embassy. Synonyms\nhunt (SEARCH)\nlook (SEARCH)\nsearch\nB2 [ T ] to ask for advice, help, approval, permission, etc.: Legal advice should be sought before you take any further action.\nMore examplesFewer examplesI was expelled from school and forced to seek work.You should seek compensation.If symptoms persist seek medical attention .Contributions are being sought for the disaster fund.He had actively sought a pardon from the president.\nSMART Vocabulary: related words and phrases\nSearching\n-seeking\nbeachcomb\nbeachcomber\nbeachcombing\nbody search\nbounty hunter\ndivine\nhunting ground\nkeep your/an eye out for someone/something idiom\nleave no stone unturned idiom\nmanhunt\nmudlark\nneedle\nscout\nscratch\nsearch\nseek someone/something out\nseeker\nshake someone down\ntroll\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking appeals & requests\nseek verb\n(TRY)\nC2 [ I + to infinitive ] to try or attempt: They sought to reassure the public.\nThesaurus: synonyms, antonyms, and examples\nto try to do somethingtryI'll try to call her again.attemptI have never attempted to run a marathon.endeavourUK Engineers are endeavouring to locate the source of the problem.seekThey sought to reassure the public.battleHe was battling to fix the roof in the rain.striveWith limited resources, they are striving to make the school a better one.\nSee more results »\nMore examplesFewer examplesThe country's president is seeking to mend relations with the United States.Six journalists sought to challenge in court the legality of the ban on broadcasting.They are seeking to change the rules.People seeking to end the crisis must have our full support.I find it abhorrent that people should seek to gain financially from this tragic situation.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nshoot\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nRelated word\n-seekingPhrasal verb\nseek someone/something out\nseek verb\n(SEARCH)\nAdd to word list\nAdd to word list\n[ T ] to search for something or try to find or obtain something: She is actively seeking work. The government is seeking ways to reduce the cost of health care.\n[ T ] If you seek advice/approval/help/permission, you ask for it: They suggested she seek advice from the legal department.\nseek verb\n(TRY)\n[ + to infinitive ] to try or attempt: They sought to reassure people that their homes would be safe from the flood.\nAdd to word list\nAdd to word list\nto try to find or get something: seek advice/helpseek to do sth The investment objective of the fund is to seek to achieve long-term growth. The unemployment rate among disabled people seeking work stands at 19%."}