{"id":323422,"name":"seem","type":"verb","us_sound":"siːm","us_link":"../audio/s/seam.mp3","uk_sound":"siːm","uk_link":"../audio/s/ukscutt021.mp3","content":"Add to word list\nAdd to word list\nB1 to give the effect of being; to be judged to be: He's 16, but he often seems (to be) younger. The children seemed (as if/as though/like they were) tired. I suspect his claims are not all they seem - he tends to exaggerate. Things are seldom as/how/what they seem. [ + to infinitive ] I seem to know more about him than anyone else. They seem to be taking a long time to decide. [ + (that) ] It seems (that) she can't come. It seems to me (that) (= I think that) he isn't the right person for the job.formal It would seem (that) no action need be taken. There seems to have been a mistake - my name isn't on the list. [ after so ] \"There's no reply - they've all gone home.\" \"So it seems.\" \"Was a decision made?\" \"It seems not/so.\"\nMore examplesFewer examplesShe seemed happy enough this morning.The plan seemed quite simple.He seemed a bit depressed about his work situation.She seemed a bit detached, as if her mind were on other things.She seemed slightly embarrassed to see us there.\nSMART Vocabulary: related words and phrases\nSeeming and purporting to be\napparent\nappear\nappearance\nas if/though idiom\nby the look(s) of things idiom\ncome across\ncome off\nformal\noutward\noutwardly\noutwardness\nparallax\npass\npass for sb/sth\nsemblance\nsuperficial\nsuperficiality\nsuperficially\nsupposably\nsurface\nSee more results »\nGrammar\nAppear or seem?We mostly use appear to talk about facts and events. We use seem to talk about facts, but also to talk about personal feelings and ideas. Seem is often used with a noun: …\nSeem + to-infinitiveWe can use seem with a to-infinitive: …\nSeemSeem means ‘appear in a particular way’. We can use it as a linking verb (like be) or with a to-infinitive. We do not normally use seem in the continuous form: …\nSeem as a linking verbSeem as a linking verb is followed by an adjective or, less commonly, a noun: …\nAdd to word list\nAdd to word list\nto appear to be: [ L ] You seem very quiet today. [ L ] He’s 16, but he seems younger. [ L ] The news seemed too good to be true. [ L ] She didn’t seem (to be) particularly happy. [ I always + adv/prep ] They seemed like such a nice couple. [ + to infinitive ] I can’t seem to stay awake."}