{"id":323500,"name":"segment","type":"noun","us_sound":"ˈseɡ.mənt","us_link":"../audio/s/segment.mp3","uk_sound":"ˈseɡ.mənt","uk_link":"../audio/s/ukseek_012.mp3","content":"Add to word list\nAdd to word list\none of the smaller groups or amounts that a larger group or amount can be divided into: People over the age of 85 make up the fastest-growing segment of the population. Each of these products is aimed at a specific market segment.\nmathematics part of a circle that is divided from the rest by a line, or part of a sphere that is divided from the rest by two planes\none of the small parts that a fruit such as an orange is naturally divided into: The salad was decorated with segments of orange.\nChee Siong Teh/EyeEm/GettyImages\na short piece of film that forms part of a television or radio programme, or that is broadcast on the internet: CNN last week broadcast a segment on homicides in the city.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsub\nsub-sector\nsubscale\nsubscience\nsubsection\nsubsegment\nSee more results »\nto divide something into different parts: The market is segmented by price into three general categories.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nRelated word\nsegmentation\nAdd to word list\nAdd to word list\nany of the parts into which something can be divided: The news program contained a brief segment on white-collar crime.\nA segment is also one of several parts of an orange, lemon, or similarly divided fruits.\nbiology A segment is also one of the parts of the body of an insect.\nmathematics A segment is also one part of a line that has two end points.\nAdd to word list\nAdd to word list\nMARKETING a group of customers for a product or service, who have similar characteristics or needs: Private contractors are having success in certain segments of the market. consumer/customer segments\nECONOMICS a part into which something such as the economy or a company's work can be divided: a growing/large/narrow segment of sb/sth Technology includes the fastest-growing segments of the world economy. an industry segment There are a number of acquisition opportunities on the horizon for each of the company's business segments.\nGRAPHS &amp; CHARTS a part or section into which a chart, etc. is divided: You can see the size of the profit margin in the overlaps between the three segments of Figure 1.1.\nSee also\nmarket segment\n[ I or T ]\n&#160; MARKETING to divide a market into different groups of customers who have similar characteristics or needs: By segmenting customers and products, technology has given banks the kind of data they need to pursue niche strategies. The toy industry segments the market by age and gender.segment (sth) into sth He argues that the car market is segmenting more and more into smaller groups of critical consumers.\n[ T ] to divide something into different parts: That is one of the reasons why we are segmenting the company further.segment sth into sth The store was segmented into different areas for different customers. segmented adjective\nThere is a carefully segmented market in the making, with different designs carefully nuanced for every socioeconomic stratum."}