{"id":323531,"name":"segregation","type":"noun","us_sound":"ˌseɡ.rəˈɡeɪ.ʃən","us_link":"../audio/s/segregation.mp3","uk_sound":"ˌseɡ.rɪˈɡeɪ.ʃən","uk_link":"../audio/s/ukseek_017.mp3","content":"segregation noun [U]\n(OF RACES, SEXES)\nAdd to word list\nAdd to word list\nthe policy of keeping one group of people apart from another and treating them differently, especially because of race, sex, or religion: The system of racial segregation that used to exist in South Africa was called apartheid. The community fought to end segregation in schools and housing. the segregation of employment by gender\nMore examplesFewer examplesAs in the rest of the American South, segregation was entrenched in Louisiana at the turn of the twentieth century.The athletes were forbidden by segregation to compete in the same races.Cross-town busing was tried as a remedy for school segregation. They objected to the college's strict segregation of men and women. There was a suggestion that segregation of boys and girls for subjects such as English may enable teachers to tailor lessons to boys' interests.\nsegregation noun [U]\n(KEEPING APART)\nthe act of keeping one person or thing separate from another person or thing: the segregation of the healthy from the sick\nMore examplesFewer examplesRegulations could require segregation of GM soybeans from conventional varieties.the segregation of waste paper for separate collection\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\nloose\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nsegregation noun [U]\n(BIOLOGY)\nbiology\n&#160; specialized the separation of pairs of alleles (= different forms of the same gene) during meiosis (= the cell division that happens as part of the process of producing young animals or plants) so that they pass separately to separate gametes (= reproductive cells): Mendel's first law states that genes do not blend, but pass intact from one generation to the next, after segregation. Fertilization triggers segregation of chromosomes.\nMore examplesFewer examples Alcohol appears to interfere with the segregation of chromosomes during egg maturation.Segregation of a particular allele linked with disease can be tested in the fetus.Abnormal segregation of chromosomes was evident in the embryo.\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\noncogene\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\nSee\nsegregate"}