{"id":323524,"name":"segregate","type":"verb","us_sound":"ˈseɡ.rə.ɡeɪt","us_link":"../audio/s/segregate.mp3","uk_sound":"ˈseɡ.rɪ.ɡeɪt","uk_link":"../audio/s/ukseek_015.mp3","content":"segregate verb [T]\n(KEEP SEPARATE)\nAdd to word list\nAdd to word list\nto keep one thing separate from another: The psychiatric section is segregated from the rest of the prison. The systems will have to be able to segregate clients' money from the firm's own cash.\nMore examplesFewer examplesAbout 82,000 homes were given color-coded plastic tubs for cans, glass and paper and asked to segregate recyclables.We will be creating a special fund segregated from our other operations.A Senate investigation of illegal domestic spying led to changes designed to segregate the operations of the FBI and the CIA.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nremove\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nthose\nuncouple\nwrench\nwrenching\nzonal\nSee more results »\nsegregate verb [T]\n(BY RACE, SEX ETC)\nto keep one group of people apart from another and treat them differently, especially because of race, sex, or religion: a segregated school/society Black residents were segregated from white residents in the area. an urban culture segregated by sex where boys \"learned\" how to be men\nMore examplesFewer examplesThe Population Registration Act of 1950 categorized and segregated the people of South Africa.The class-action lawsuit alleged the hotel charged black customers higher prices than white customers and segregated them in less desirable rooms.They passed laws prohibiting mixed marriage and segregating schools.Although the group is mixed, they have segregated themselves into boys at one end of the table, girls at the other.\nsegregate verb [T]\n(BIOLOGY)\nbiology\n&#160; specialized (of pairs of alleles (= different forms of the same gene)) to separate during meiosis (= the cell division that happens as part of the process of producing young animals or plants) and pass separately to separate gametes (= reproductive cells): Disruption of the spindle can cause chromosomes to segregate abnormally at either of the two meiotic divisions.\nMore examplesFewer examples Multiple nuclei could arise if one or more chromosomes dispersed and segregated into discrete packages. At a marker locus, a randomly selected parent does not necessarily segregate for four distinguished alleles. Identical twins share 100% of their genes, and fraternal twins share 50% of their segregating genes, on average.\nSMART Vocabulary: related words and phrases\nGenetics\nadenine\nanaphase\nautosomal\nautosomally\nautosome\ngenomic\ngenomics\ngermline\ngermplasm\nhalf-breed\nheredity\nheterozygous\nhomozygous\noncogene\npanmictic\npanmixia\nparthenogenetic\nPatau syndrome\npaternally\nrecessive\nSee more results »\nRelated words\nsegregated\nsegregation\nAdd to word list\nAdd to word list\nsocial studies to keep one group of people apart from others because of race, religion, sex, etc.: Most people wouldn’t remember that some ballparks were segregated (= black people were kept apart) in the early years. The boys and girls were segregated into different classes. segregation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌseɡ·rɪˈɡeɪ·ʃən/\nracial segregation Almost every community has laws prohibiting segregation in housing."}