{"id":323663,"name":"seizing","type":"verb","us_sound":"siːz","us_link":"../audio/s/seize.mp3","uk_sound":"siːz","uk_link":"../audio/s/ukseek_023.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nseize\nB2 [ T ] to take something quickly and keep or hold it: I seized his arm and made him turn to look at me. He seized the chance/opportunity of a free flight with both hands (= with eagerness or enthusiasm).\nC2 [ T ] to take using sudden force: The rebels have seized ten soldiers to use as hostages. Political instability helped the army to seize power. Troops yesterday seized control of the broadcasting station.\n[ T ] If the police or other officials seize something, they take possession of it with legal authority: Customs officers at Heathrow have seized 60 kilos of heroin.\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\n[ usually passive ] If a strong emotion or pain seizes you, you feel it suddenly: I was suddenly seized by/with a feeling of great insecurity and loneliness.\nMore examplesFewer examplesShe seized the gun and ran at him.Seizing the book in both hands, she threw it across the room.Heroin worth about $5 million was seized.The soldiers fell on the villagers and seized all their weapons.The terrorists have seized 20 hostages and are threatening to kill one a day unless their demands are met.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCapturing or taking possession of things\nAttacking & invading\nTaking things away from someone or somewhere\nKnowledge and awareness\nPhrasal verbs\nseize on/upon something\nseize up"}