{"id":323657,"name":"seize","type":"verb","us_sound":"siːz","us_link":"../audio/s/seize.mp3","uk_sound":"siːz","uk_link":"../audio/s/ukseek_023.mp3","content":"Add to word list\nAdd to word list\nB2 [ T ] to take something quickly and keep or hold it: I seized his arm and made him turn to look at me. He seized the chance/opportunity of a free flight with both hands (= with eagerness or enthusiasm).\nC2 [ T ] to take using sudden force: The rebels have seized ten soldiers to use as hostages. Political instability helped the army to seize power. Troops yesterday seized control of the broadcasting station.\n[ T ] If the police or other officials seize something, they take possession of it with legal authority: Customs officers at Heathrow have seized 60 kilos of heroin.\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\n[ usually passive ] If a strong emotion or pain seizes you, you feel it suddenly: I was suddenly seized by/with a feeling of great insecurity and loneliness.\nMore examplesFewer examplesShe seized the gun and ran at him.Seizing the book in both hands, she threw it across the room.Heroin worth about $5 million was seized.The soldiers fell on the villagers and seized all their weapons.The terrorists have seized 20 hostages and are threatening to kill one a day unless their demands are met.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nhold\nonto\npinion\npurchase\ntaken\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCapturing or taking possession of things\nAttacking & invading\nTaking things away from someone or somewhere\nKnowledge and awareness\nPhrasal verbs\nseize on/upon something\nseize up\nAdd to word list\nAdd to word list\nto take something quickly and hold it: He seized her arm to lead her through the crowd. fig. While she was distracted, I seized the opportunity to take a cookie.\nSeize can also mean to take by force: Rebel forces seized control of six towns.\nIf police or other officials seize something, they take possession of it by legal authority: The goods that were seized had been hidden in a shipment of paint. Phrasal verb\nseize on/upon something\nAdd to word list\nAdd to word list\nLAW if the police or government seizes property or assets, they take possession of them because they are illegal, or because the owner owes money: Customs agents last year seized $14 million in counterfeit electronics goods at the nation's ports. seize assets/property\nLAW, GOVERNMENT\n&#160; US if the government or other official authority seizes a company, they stop it from trading because of illegal activity or debts: The government has threatened to seize any business that does not sell goods at the advertised price.\nto take advantage of something that is available: seize a challenge/opportunity A Malaysian tycoon seized the chance to bid for the company, and won. By having a contract already prepared, you may be able to seize the initiative in negotiations.\nto take control of something, especially when others are trying to stop you: seize control/power Disgruntled shareholders tried to oust the board and seize control of the company. In finance, telecoms, media, and technology, there is thought to be a rare opportunity to seize global market share."}