{"id":323668,"name":"seizure","type":"noun","us_sound":"ˈsiː.ʒɚ","us_link":"../audio/s/seizure.mp3","uk_sound":"ˈsiː.ʒər","uk_link":"../audio/s/ukseek_024.mp3","content":"seizure noun\n(TAKING)\nAdd to word list\nAdd to word list\n[ C or U ] the action of taking something by force or with legal authority: seizure of power/property/control Seizures of illicit drugs have increased by 30 percent this year.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextract\nextractive\nget off\nimpound\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nseizure noun\n(MEDICAL)\n[ C ] a very sudden attack of an illness in which someone becomes unconscious or develops violent movements: an epileptic seizure\n[ C ] old use a sudden failure of the heart: His aunt died of a seizure.figurative humorous When I told her how much it cost she nearly had a seizure (= she was very shocked).\nSMART Vocabulary: related words and phrases\nDisease & illness - general words\naggressiveness\nautoimmune disease\nbilharzia\nbluetongue\ncalculus\nCFS\ncomplication\niatrogenic\nill health\nimpairment\nincurably\nindustrial disease\ninfantile\noutbreak\nserial interval\nsubvariant\nsystemically\nteratoma\nterminally\nuntreated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisorders & diseases of the heart & blood\nAdd to word list\nAdd to word list\nthe act of taking hold or possession of something: [ U ] Violators of the fishing regulations face seizure of the boat's catch.\nA seizure is also a medical condition that can cause you to lose control of your muscles and, often, cause you to become unconscious: [ C ] The cat suffered several seizures after eating some poison.\nAdd to word list\nAdd to word list\n[ C or U ] the act of taking possession of property or assets because they are illegal, or because the owner owes money: the seizure of sth More severe penalties, including the seizure of assets will be introduced for the non-payment of taxes. In 2005, there were about 70 seizures of goods worth $20.6 million. asset/land/property seizure\n[ C ] property or assets that are taken away because they are illegal, or because the owner owes money: Border seizures were worth $538.8 million in 2010."}