{"id":323740,"name":"selective","type":"adjective","us_sound":"səˈlek.t̬ɪv","us_link":"../audio/s/cdo0123ussele2220.mp3","uk_sound":"sɪˈlek.tɪv","uk_link":"../audio/s/ukseek_028.mp3","content":"Add to word list\nAdd to word list\nC1 intentionally choosing some things and not others: As a teacher she was very selective, accepting only a small number of exceptionally gifted pupils. He seemed to have a very selective recall of past events.\nUK A selective school is one that children can only go to if they pass an examination: The majority of children get into selective schools by being coached after school. Many politicians benefited from a selective education.\nMore examplesFewer examplesNowadays he can afford to be much more selective about the roles he accepts.I'm more selective about the programmes I watch than I used to be.Parents have a selective memory when they recall their children's early years.selective educationthe selective and non-selective school sectors\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nRobin Hood\nselect\nselection\nselectively\nselectivity\nskim\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of school\nRelated words\nselectively\nselectivity\nAdd to word list\nAdd to word list\ncareful in choosing: The school is very selective and accepts only those students who are extremely motivated. selectively adverb us/səˈlek·tɪv·li/\nPurebred dogs have been selectively bred for thousands of years in some cases.\nAdd to word list\nAdd to word list\nintentionally choosing certain things or people, and not others: be selective about sth We need to be more selective about the people we hire.be selective in sth/doing sth Banks have become more selective in granting new loans.\naffecting or relating to some things or people, and not others: Higher costs will be offset by higher sales volumes and selective price increases. We aim to provide selective access to suppliers and customers through extranets. a selective approach\ninvolving the choice of the most suitable or best: We want to open more branches, make selective acquisitions, and extend our product range. Investments will be selective and disciplined.\nselectively adverb\nThe company has selectively cut back production of denim. selectivity noun [ U ]\nThe benefit to investors of venture capitalists derives from extreme selectivity in their choice of investments."}