{"id":323734,"name":"selection","type":"noun","us_sound":"səˈlek.ʃən","us_link":"../audio/s/selection.mp3","uk_sound":"sɪˈlek.ʃən","uk_link":"../audio/s/ukseek_027.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] the act of choosing someone or something: the selection process Success is achieved by the careful selection of projects. The coach made her selection (= chose who she wanted) for the team.\nB2 [ C ] a choice or range of different types of something: Most schools would have a good selection of these books in their libraries. The larger stores are able to stock a wider selection of goods.\n[ C ] a person or thing that has been or will be chosen: Their music was a mix of old stuff and selections from the new album.\nMore examplesFewer examplesYou will be expected to assist the editor with the selection of illustrations for the book.Which bookshop has the largest selection of EFL materials?I asked for a mixed selection of chocolates.We were offered a selection of cakes and pastries with our tea.The shop has a good selection of bikinis and swimming costumes.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nRobin Hood\nselect\nselective\nselectively\nselectivity\nskim\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVariety and mixtures\nGroups and collections of things\nAdd to word list\nAdd to word list\nthe act of choosing, or the person or thing chosen: [ C ] They performed a mix of old hits and selections from their new CD.\nA selection can also be a range and variety of something from which to choose: [ C ] That bookstore has a wide selection of mystery novels. [ U ] Shop early for the best selection.\nAdd to word list\nAdd to word list\n[ U ] the process of choosing someone or something from a group of people or things after careful thought: the selection of sth/sb It is alleged that he tried to improperly influence the selection of a particular firm for a state engineering contract. The selection of Jobson as chairman has caused controversy amongst board members. personnel/product/site selection a selection method/procedure/process\n[ C, usually singular ]\n&#160; COMMERCE a choice or range of different types of something: a selection of sth The new range features a selection of ceramics and tableware. a good/large/wide selection\n[ C ] a person or thing which has been or will be chosen: make a selection He made similar selections of securities for each fund. Who would be your selection for the job?\nSee also\nchoice noun"}