{"id":323726,"name":"select","type":"verb","us_sound":"səˈlekt","us_link":"../audio/s/select.mp3","uk_sound":"sɪˈlekt","uk_link":"../audio/s/ukseek_026.mp3","content":"Add to word list\nAdd to word list\nB1 to choose a small number of things, or to choose by making careful decisions: There was a choice of four prizes, and the winner could select one of them. A mouse is a device which makes it easier to select different options from computer menus. How do you select people for promotion? [ + obj + to infinitive ] He was selected to play for Australia at the age of only 18. Synonyms\nchoose\nelect\npick (CHOOSE)\nThesaurus: synonyms, antonyms, and examples\nto choose or choose to do somethingchooseThere are thirty-one flavours of ice cream to choose from.pickHe's been picked for the school football team.selectWe've selected three candidates.opt (for)Mike's opted for early retirement.decide (on)I've decided on blue walls for the bathroom.go forUK I think I'll go for the chocolate cake.\nSee more results »\nMore examplesFewer examplesHe was selected to play for Australia at the age of only 18.I selected the best staff available.The judges will select the best from this year's crop of first novels.When you have selected the file you want, click the 'Open' box.Click 'Tools', then select 'Options' from the pull-down menu.\nSMART Vocabulary: related words and phrases\nTaking and choosing\nadopt\nadopted\nadoption\nappoint\nbags I... idiom\nbe your best bet idiom\ncull\nempanel\nfaute de mieux\nfavoured\nfilterable\ngo for someone\npicker\nplump\nRobin Hood\nselection\nselective\nselectively\nselectivity\nskim\nSee more results »\nof only the best type or highest quality, and usually small in size or amount: It's a very select club - I've been trying unsuccessfully to join it for years. These activities should be available to all students, not just a select few. Hamilton lives in a very select part of Boston. Synonyms\nchoice\nexclusive (ONLY FOR SOME)\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nshining\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nselect verb [I/T]\n(CHOOSE)\nAdd to word list\nAdd to word list\nto choose something, or to make a choice: [ T ] They have the option of selecting the school that they want their kids to go to. [ I ] You can select from among the offerings shown on this screen.\nselect adjective [not gradable]\n(BEST QUALITY)\nthe best of its type or highest in quality: select fruit/school a select group of people\nAdd to word list\nAdd to word list\n[ I or T ] to choose someone or something from a group of people or things after careful thought: The role of marketing is to select the target markets.select sth/sb as sth The bank has just been selected as the preferred bidder for Brussels International Airport.select sth/sb for sth The application form will be used to select candidates for interview.select (sth) from sth We were able to select from a large pool of applicants and to recruit people of a high standard.\n[ T ]\n&#160; IT to choose something from a computer menu (= list), or to mark something that you have chosen on a computer screen: Open Outlook on the first machine and select File Import and Export to launch the program. Select the text you want to copy and press Control-C.\nof only the best type or highest quality, and usually small in amount: Historically, stamp duty has been paid by fund managers and a select few private investors. The products will be sold at a select group of specialist stores."}