{"id":323817,"name":"self","type":"noun","us_sound":"self","us_link":"../audio/s/self.mp3","uk_sound":"self","uk_link":"../audio/s/ukselec003.mp3","content":"self noun\n(PERSONALITY)\nAdd to word list\nAdd to word list\nC1 [ C or U ] plural selves the set of someone's characteristics, such as personality and ability, that are not physical and make that person different from other people: The hero of the movie finally finds his true self (= discovers what his true personality and feelings are). When I saw them this afternoon they were more like their old/normal selves (= as they were in the past). a sense of self\nMore examplesFewer examplesShe's not her customary cheerful self today.The Minister was her usual evasive self, skilfully dodging reporters' questions about her possible resignation.He seemed ill at ease and not his usual self.It was a long time after the accident before he seemed like his former self.He wasn't his usual ebullient self.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\njib\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nSee more results »\nself noun\n(PERSONAL ADVANTAGE)\n[ U ] formal disapproving interest only in your own advantage: Her reply was typical of her constant regard for self.\nSMART Vocabulary: related words and phrases\nSelfishness\negocentric\negocentrically\negocentricity\negoism\negoistic\negotistically\nhoggish\nhoggishly\ninconsiderate\ninconsiderately\nself-absorbed\nself-absorption\nself-centred\nself-centredly\nself-interest\nselfish\nselfishly\nselfishness\nselves\nvanity\nSee more results »\nIdiom\nunto thine own self be true\nof or by yourself or itself: self-educated a self-winding watch\nSMART Vocabulary: related words and phrases\nLinguistics: reflexive forms\nauto\nherself\nhimself\nitself\nmyself\nnot be/seem herself phrase\nnot be/seem himself phrase\noneself\nourselves\nper se\nreflexive\nthemself\nthemselves\nthyself\nyourself\nAdd to word list\nAdd to word list\nwho a person is, including the qualities such as personality and ability that make one person different from another: [ C ] Now I’m feeling better, and I’m back to my old self again. [ U ] I still assert the validity of self over social convention.\nAdd to word list\nAdd to word list\nused to form words that describe something or someone as doing something themselves: a self-winding watch a self-catering holiday self-build homes\nwritten on cheques, official documents, business letters, etc. to refer to yourself: a cheque written to self Most health plans have a three-tier system of coverage: self only, self and one other person, or self and family."}