{"id":323866,"name":"sell","type":"verb","us_sound":"sel","us_link":"../audio/s/sell.mp3","uk_sound":"sel","uk_link":"../audio/s/ukselfs006.mp3","content":"sell verb\n(MONEY)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to give something to someone else in return for money: [ + two objects ] I sold him my car/I sold my car to him for $600. We'll be selling the tickets at/for £50 each. The stall sells drinks and snacks.\nThesaurus: synonyms, antonyms, and examples\nto sell somethingsellAre you selling your car?retailThe company makes and retails moderately priced sportswear.deal inThey mainly deal in rare books.divestUS The investors divested themselves of the company's stock.sell offThe company is selling off the less profitable parts of its business.\nSee more results »\nA2 [ I or T ] to be bought in the way or quantities that are mentioned; to be sold at the price mentioned : These baskets sell well (= a lot of them are bought). Their last album sold over a hundred thousand copies. How much does the phone sell for?\nThesaurus: synonyms, antonyms, and examples\nto have a certain monetary valuecostHiring a car for the week will cost close to £300!beThe cakes were £1.50 each or two for £2.sell forThe tickets sell for £100 each. fetchThe medieval manuscript fetched a record-breaking £1.2 million at auction. go for somethingHouses around here usually go for about £500,000. set someone back (something)Phew, that ring looks like it set you back.\nSee more results »\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nsell verb\n(PERSUADE)\nC2 [ T ] to persuade someone that an idea or plan is a good one and likely to be successful: My boss is very old-fashioned and I'm having a lot of trouble selling the idea of working at home occasionally. The filmmakers sold me on the idea that my book would work on the screen. [ + two objects ] The chance of greater access to European markets would help sell the president the plan/sell the plan to the president. In an interview, you have to sell yourself to the employer.\nSMART Vocabulary: related words and phrases\nUrging & persuading\nambulance-chasing\nargumentation\nbe/go on at someone idiom\nblag\nblagger\nfob\ninduce\ninfluencer\njockey\njockey someone into something\njolly\nlean\nlean on someone/something\nlove bomb\nsucker\nunsellable\nurging\nwell argued\nwheedling\nwin someone over\nSee more results »\nIdioms\nsell someone a bill of goods\nsell someone down the river\nsell someone/yourself/something short\nsell your soul (to the devil)Phrasal verbs\nsell something off\nsell out\nsell (someone) out\nsell up\nsell verb [I/T]\n(EXCHANGE FOR MONEY)\nAdd to word list\nAdd to word list\nto give a thing or perform a service in exchange for money: [ T ] The children sold lemonade. [ I ] These baskets sell well (= people buy a lot of them).\nsell verb [I/T]\n(PERSUADE)\nto persuade someone to accept an idea or plan, or to cause something to be accepted: [ T ] That is a plan we can easily sell to the school board. Idiom\nsell someone shortPhrasal verbs\nsell off something\nsell someone on something\nsell out (something)\nsell out (something)\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; COMMERCE, FINANCE to give something to someone else in return for money: sell securities/shares/stock sell a car/company/house The 43% owner of the company indicated that it was ready to sell.sell sth to sb/sth The partners plan to sell 40% of the company to investors.sell sb sth We are going to sell him our car.sell to sb/sth The site could be built on if the owners decided to sell to private developers.sell sth at $10/$100, etc. It raised $180 million Monday by selling 7.2 million shares at $25 apiece.sell sth at a loss/markup/profit The business was sold at an enormous profit.sell sth for $10/$100, etc. How much did you sell your house for?\n[ I or T ]\n&#160; COMMERCE to have something available for people to buy: sell goods/products/services On either bank of the river are specialist shops selling designer clothes, books, music and art. Its products are sold in 150 countries. We sell directly via a contact sales force. sell online/over the internet\n[ I or T ]\n&#160; COMMERCE, FINANCE to be bought in the quantities or the way specified: sell fast/well The watches are selling well through the group's retail outlets.sell at $10/$100, etc. The stock is currently selling at 11 times earnings estimates.sell for $10/$100, etc. The games console will sell for $349. The company had problems with overstocking and products that didn't sell. The magazine is now selling 225,000 copies a week.\n[ I or T ]\n&#160; MARKETING to make people want to buy something: Price and delivery are only two elements of the marketing mix that sells products. It's a cliche of advertising to say that \"sex sells\".\n[ T ] to persuade someone that an idea or plan is a good one, and likely to be successful: He is trying to sell an idea for a TV comedy.sell sth to sb The government sold spending cuts to the public as a way to get the economy growing again.\nsell yourself\nto persuade people that you have the right qualities or abilities for a particular job or in a particular situation: The phone interview is your one chance to sell yourself.\nsell like hot cakes informal\nto be bought quickly and in large numbers: With-profits bonds have sold like hot cakes to older people looking for a low-risk, high return for their money. Phrasal verbs\nsell sth back to sb/sth\nsell sth forward\nsell into sth\nsell sth off\nsell sb on sth\nsell sth on\nsell out\nsell through\nsell up\nan act of selling or trying to sell a product or service: a difficult/hard/tough sell In spite of continuing drought conditions, artificial grass remains a hard sell. Fear of unemployment make mortgage protection an easy sell. Compare\nsale\nan act of trying to persuade someone that something is a good idea: a hard/difficult/tough sell Tax breaks for developers to build more-expensive housing would be a tough sell.\n[ C ]\n&#160; FINANCE, STOCK MARKET\n&#160; (also sell rating) advice to sell shares in a particular company from a broker: The broker SG Securities is moving its rating to a sell. While Merrill has a neutral recommendation, we believe the shares are a sell. See also\nhard sell\nsoft sell"}