{"id":323876,"name":"seller","type":"noun","us_sound":"ˈsel.ɚ","us_link":"../audio/s/eus70745.mp3","uk_sound":"ˈsel.ər","uk_link":"../audio/s/ukceleb013.mp3","content":"Add to word list\nAdd to word list\nB1 a person who is selling something: flower/newspaper/souvenir sellers Do you think the seller will accept €300,000 for the house?\nThesaurus: synonyms, antonyms, and examples\na person who sells thingssellerWe'll need to talk to the seller and see if they'll accept your bid on the house.salespersonThe shop was so busy that it took me ages to get the salesperson's attention.salesmanHe was a used-car salesman.saleswomanShe was the company's top saleswoman.sales assistantUK Can you wave over a sales assistant? I have a question about this bracelet.\nSee more results »\na product that a lot of people buy: This car is our biggest seller so far this year.\nMore examplesFewer examplesI always read any online feedback about a seller before I buy anything from them.It was a hot sunny day and the ice cream sellers were out in force in the park.They're the UK's largest seller of software.Six years after it was first published, it is still their top seller.Their perfume is still a big seller.\nSMART Vocabulary: related words and phrases\nPeople who sell things\nagent\nassistant\nauctioneer\nbarker\nbarrow boy\nflower girl\nfranchisee\ngallerist\nhaberdasher\nhawker\nreseller\nretailer\nsales assistant\nsales force\nsales rep\ntout\ntradesman\ntradespeople\nvendor\nwholesaler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nAdd to word list\nAdd to word list\na person who sells something: The seller of the painting was kept secret.\nA seller is also something that is sold: That CD is our best seller.\nAdd to word list\nAdd to word list\na person or organization that sells something: The seller is able to sell the goods elsewhere for more than the buyer had agreed to pay. The seller has an interest in letting the buyer think that profits will be higher than they actually are.seller of sth It is the world's leading seller of automatic teller machines for banks. The top seller of personal computers reported flat earnings for the first quarter. a clothing/newspaper seller\na product that a lot of people buy: big/strong/top seller Flat screen TVs are once again expected to be a big seller this holiday season. That book has been one of Amazon's top sellers in Germany. See also\nbestseller\nbookseller\nshort sellerCompare\nbuyer"}