{"id":325505,"name":"senate","type":"noun","us_sound":"ˈsen.ət","us_link":"../audio/s/senate.mp3","uk_sound":"ˈsen.ət","uk_link":"../audio/s/uksen__002.mp3","content":"senate noun [C]\n(POLITICS)\nAdd to word list\nAdd to word list\none of the two groups of politicians who make laws in some political systems such as in the US, Australia, and France, often having different powers from the other group and different rules for members, for example being elected for a longer period: The law has no chance of being passed by the Senate. the French/Australian Senate The US Senate has 100 members. The UK doesn't have a senate; it has a House of Lords.\nMore examplesFewer examplesThe senate has the power to veto laws passed by the lower house.Bermuda is governed by a Senate (11 members), a House of Assembly (40 members, elected for 5 years), and a cabinet headed by a premier. The House speaker said he was confident the settlement would go through without the Senate's amendment. He is the chairman of the senate foreign relations committee.He compared the Canadian and Australian senates.\nSMART Vocabulary: related words and phrases\nInternational relations: United States politics & government\nanti-Republican\nbattleground state\nbicameral\nblue state\ncaucus\nconfederacy\nG-man\ngubernatorial\nhomeland security\nHouse Committee\njoint resolution\noverride\npentagon\nsecret service\nsecretary\nSecretary of State\nsenator\nthe Articles of Confederation\nthe GOP\nthe Republican Party\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: international politics & government\nsenate noun [C]\n(EDUCATION)\nthe group of people who control a college or university\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\ngraduate\nhall\nhall of residence\nOxbridge\nOxon\nPanhellenic\npass degree\npoly\nthe groves of academe idiom\nuniversity\nunselective\nvice chancellor\nwarden\nwardenship\nSee more results »\nAdd to word list\nAdd to word list\npolitics &amp; government the group of politicians who have the most power to make laws in a government: The US Senate has 100 members. He served in the state senate.\npolitics &amp; government In Canada, members of the Senate give advice about laws but do not make laws.\nAdd to word list\nAdd to word list\nthe name of the upper house (= more important of the two parts) of the parliaments of some countries, for example the US, Australia, and France: The law will not be passed by the Senate."}