{"id":325522,"name":"send","type":"verb","us_sound":"send","us_link":"../audio/s/send.mp3","uk_sound":"send","uk_link":"../audio/s/cdo0318uksend1234.mp3","content":"send verb [T]\n(POST/EMAIL)\nAdd to word list\nAdd to word list\nA1 to cause something to go from one place to another, especially by post or email: [ + two objects ] I'll send her a letter/email/parcel/postcard next week. We'll send it by post/airmail/sea. Could you send a reply to them as quickly as possible? The news report was sent by satellite. She sent a message with John to say that she couldn't come. They sent her flowers for her birthday. Maggie sends her love and hopes you'll feel better soon.\nMore examplesFewer examplesWe will send you written confirmation of our offer shortly.If you send it airmail, it'll be very expensive.Please send this letter by express delivery.I'll send you my email address once I'm online.I've sent my CV to a few companies in the region.Please send a covering letter with your application form.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nship\nshipment\nshipper\nshoot\nshoot something off\nteleport\ntruck\nSee more results »\nsend verb [T]\n(CAUSE TO GO)\nB2 to cause or order someone to go and do something: [ + to infinitive ] We're sending the kids to stay with my parents for a couple of weeks. The commander has asked us to send reinforcements. They've sent their son (away) to boarding school. He was trying to explain but she became impatient and sent him away (= told him to leave). When she was eight, they sent her off to boarding school.\nMore examplesFewer examplesI've sent Milly down to the shops to get some bread.I sent him into the house to get some glasses.They send their kids to private schools.They've sent troops into the region.His teacher sent him out of the room for swearing.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nship\nshipment\nshipper\nshoot\nshoot something off\nteleport\ntruck\nSee more results »\nsend verb [T]\n(CAUSE TO HAPPEN)\nC2 to cause someone or something to do a particular thing, or to cause something to happen: The explosion sent the crowd into a panic. Watching television always sends me to sleep. [ + adj ] UK His untidiness sends her crazy/mad/wild. [ + -ing verb ] The announcement of the fall in profits sent the company's share price plummeting (= caused it to go down a lot). The draught from the fan sent papers flying all over the room.\nMore examplesFewer examplesHis voice could send me to sleep.This job is going to send me nuts.The news sent the company's stock diving, dropping 10 percent.Speculation alone has sent the company's shares up from 304p to 316p.This then sent interest rates soaring.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspark\nSee more results »\nIdioms\nsend someone packing\nsend someone to Coventry\nsend shivers down/up someone's spine\nsend a signal (to sb) that\nsend a message\nsend wordPhrasal verbs\nsend something back\nsend someone down\nsend for someone\nsend (off/away) for/to something\nsend something in\nsend someone in\nsend something off\nsend someone off\nsend something on\nsend something out\nMore phrasal verbs\nsend out for something\nsend someone up\nsend someone/something up\nabbreviation for special educational needs and/or disabilities: an expression used to refer to special needs (= the needs of people with particular disabilities or problems) relating to education and/or physical or mental conditions that makes it difficult for them to do certain common activities : The framework makes sure that there's support in place for children with SEND. My job is to help children and young people with SEND navigate education, health, and social care. Compare\nSEN\nMore examplesFewer examplesHow do you know if a child has SEND?Children with SEND are likely to need extra or different help to be able to learn.The SEND system is the system that supports children and young people with additional needs throughout their education.\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\npupil\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nSee more results »\nsend verb [T]\n(HAVE DELIVERED)\nAdd to word list\nAdd to word list\nto cause something to go or be taken somewhere without going yourself: Send a letter to my office. I like to send e-mail to my friends.\nsend verb [T]\n(MAKE SOMEONE GO)\nto cause or arrange for someone to leave or go: The UN sent relief workers to the region. My parents want to send me back to Argentina when I finish my studies. Who can afford to send their kids to college these days?\nsend verb [T]\n(MAKE SOMETHING MOVE)\nto make something move quickly by force: Wind sent clouds skittering across the sky. The researcher sent the particles flying apart.\nsend verb [T]\n(CAUSE TO HAPPEN)\nto cause someone to feel or behave in a particular way, or to cause something to happen: Final exams always send me into a panic. Idioms\nsend a message\nsend someone’s love (to someone)\nsend shivers down your spinePhrasal verbs\nsend away for something\nsend back something\nsend for someone/something\nsend in something\nsend in something/someone\nsend off something\nsend off someone\nsend out something\nsend out someone/something\nAdd to word list\nAdd to word list\nCOMMUNICATIONS to cause something to go from one place to another, especially by mail, email, etc.: send a letter/fax/email send a reply/response/querysend sth to sth The schools collect used cell phones and send them to the phone recycling company.send sb sth Could you send them a reply as quickly as possible?\nto cause or order someone to go and do something: send sb to sth They were sent to India for work.send sb to do sth She's been sent from Head Office to sort out this mess. send sb on a course/errand/placement\nto cause someone or something to do a particular thing, or to cause something to happen: send sth higher/up/through the roof Eventually demand outstrips supply, sending prices through the roof. send sth plummeting/plunging/tumbling send sth soaring/skyrocketing\nPhrasal verbs\nsend away for sth\nsend sth back\nsend for sb\nsend sb in\nsend sth in\nsend sth off\nsend sth on\nsend sth out"}