{"id":325690,"name":"sensitive","type":"adjective","us_sound":"ˈsen.sə.t̬ɪv","us_link":"../audio/s/sensitive.mp3","uk_sound":"ˈsen.sɪ.tɪv","uk_link":"../audio/s/uksen__027.mp3","content":"sensitive adjective\n(UPSET)\nAdd to word list\nAdd to word list\nB2 easily upset by the things people say or do, or causing people to be upset, embarrassed, or angry: Her reply showed that she was very sensitive to criticism. He was very sensitive about his scar and thought everyone was staring at him.\nB2 A sensitive subject, situation, etc. needs to be dealt with carefully in order to avoid upsetting people: Sex education and birth control are sensitive issues. The stolen car contained military documents described as very sensitive.\nMore examplesFewer examplesDon't be so sensitive!She's very sensitive about her weight.He's very sensitive to criticism of his children.I have to be very careful with what I say because she's so sensitive.If I'd known how sensitive she was I wouldn't have made the remark.\nSMART Vocabulary: related words and phrases\nBecoming too excited and easily upset\nado\nant\nantsy\nat the end of your tether idiom\nbe in a whirl idiom\nfebrile\nhave a weak stomach idiom\nhave ants in your pants idiom\nhave thin/thick skin idiom\nhigh-strung\nhighly strung\nhysterics\nlather\nnot for the squeamish idiom\novereager\novereagerness\noversensitive\noverwrought\nunrestful\nworked up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplicated and difficult to do\nsensitive adjective\n(KIND)\nB2 understanding what other people need, and being helpful and kind to them: Representatives of the company claim their plan will be sensitive to local needs. In the movie, he plays a concerned and sensitive father trying to bring up two teenage children on his own.\nMore examplesFewer examplesYou have to be quite sensitive when you're dealing with adolescents.It needs someone a bit sensitive to handle this sort of thing.She's very sweet and sensitive.He's not the most sensitive of people.These are vulnerable people - you have to be sensitive to their needs.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nsensitivity\nsympathetic\nsympathize\nsympathy\ntoo bad idiom\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKind & thoughtful\nEmpathy and sensitivity\nsensitive adjective\n(REACTING EASILY)\nB2 easily influenced, changed, or damaged, especially by a physical activity or effect: Some people's teeth are highly sensitive to cold. sensitive skin\nThesaurus: synonyms, antonyms, and examples\npainfulpainfulHer ankle was still painful if she put weight on it.soreMy feet are sore from walking around all day.tenderThe glands in my neck feel really tender.sensitiveMy face was bright red and sensitive to the touch.excruciatingHis injury caused excruciating headaches.\nSee more results »\nB2 Sensitive equipment is able to record small changes: The patient's responses are recorded on a sensitive piece of equipment which gives extremely accurate readings.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nreception\nstrike while the iron is hot idiom\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nwake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - general words\nRelated words\n-sensitive\nsensitively\nsensitiveness\nreacting to the presence of a particular substance or physical effect: They have heat-sensitive infrared cameras. We use a pH-sensitive dye.\neasily influenced, changed, or damaged by a particular thing: After the exam, the patient's eyes are light-sensitive for two to four hours, which can cause blurred vision. Some types of debt are particularly risk-sensitive.\nMore examplesFewer examplesAnti-fraud features include heat-sensitive inks that are revealed if the prescription is photocopied.The light-sensitive lenses of his sunglasses are turning black.These findings suggest BPRP may be a glucose-sensitive protein. We measured responses to dehydration in both desiccation-tolerant and dessication-sensitive material.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nreception\nstrike while the iron is hot idiom\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nwake\nSee more results »\nsensitive adjective\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\nhaving or showing awareness and understanding, esp. of other people’s feelings and needs: My experience made me very sensitive to the suffering of others.\nsensitive adjective\n(UPSET)\n(of a person) easily upset: Tom is extremely sensitive about his hair. She’s very sensitive to criticism.\nsensitive adjective\n(REACTING EASILY)\neasily influenced, changed, or damaged, esp. by a physical activity or effect: an environmentally sensitive river Their products include cleansers and moisturizers for sensitive skin.\nsensitive adjective\n(NEEDING CAREFUL TREATMENT)\nneeding to be treated with care or secrecy: Raising fuel prices can be a sensitive issue.\nAdd to word list\nAdd to word list\neasily influenced or affected by something: This sector is more likely to be more price sensitive than the domestic sector. economically sensitivesensitive to sth Investors were increasingly sensitive to interest rates.\nused to describe a subject, situation, etc. that needs to be dealt with carefully or kept secret: The secret service has acknowledged that there's classified and sensitive information that they are not able to tell the public. sensitive documents sensitive email\nunderstanding what other people need, and being helpful to them: sensitive to sth A local board could be more sensitive to the education needs of students."}