{"id":325691,"name":"sensitively","type":"adverb","us_sound":"ˈsen.sə.t̬ɪv.li","us_link":"../audio/s/sensitively.mp3","uk_sound":"ˈsen.sɪ.tɪv.li","uk_link":"../audio/s/uksen__028.mp3","content":"sensitively adverb\n(CAREFULLY)\nAdd to word list\nAdd to word list\nin a careful way to avoid upsetting people: This is a very delicate situation and it needs to be handled sensitively.\nin a way that shows you understand a character in a play, story, etc. or the feelings in a piece of music: The solo was played very sensitively by the viola player. It was beautifully written and sensitively directed.\nMore examplesFewer examplesThey seem to want to deal with this sensitively, respecting differences. Journalism schools are teaching students how to cover tragedy sensitively and cope with their own emotions.The whole development will be done sensitively. She wanted to be certain that she could trust the students to act sensitively.Any information we receive will be treated sensitively and nobody need know who you are. It was sensitively written by Susan Harris, who went on to create \"The Golden Girls\". He soulfully and sensitively portrays Bobby, a Cleveland youth.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nrelate\nsensitivity\nsympathetic\nsympathize\nsympathy\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmpathy and sensitivity\nsensitively adverb\n(REACTING PHYSICALLY)\nin a way that reacts quickly to small changes or easily records small changes: Muscles respond sensitively to minute amounts of this electric current.\nMore examplesFewer examplesTwo or more types of cone cells work together to sense colour in abundant light, and a single type of rod cell detects light more sensitively, but only in black and white.With DWI, we can sensitively detect hyperacute infarction. Fluorescence can be measured much more sensitively than absorption.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nunsensitized\nwake\nSee more results »\nsensitively adverb\n(UPSET)\nin a way that involves becoming upset or angry easily: Maybe I'm reacting too sensitively.\nMore examplesFewer examplesMaybe other critics and I are responding too sensitively. I've tried to figure out why she reacts so sensitively to criticism of me.\nSMART Vocabulary: related words and phrases\nReacting and responding\nact on something\nadverse reaction\nbacklash\nbat\nbat something back\nbite\nnon-responsive\non your toes idiom\noverreact\noverreaction\npearl-clutching\nreaction\nrespond\nsupersensitivity\nticklish\nticklishly\ntoe\nultra-sensitive\nunsensitized\nwake\nSee more results »\nSee\nsensitive\nAdd to word list\nAdd to word list\nin a way that shows awareness and understanding of other people's feelings and needs: How can I say this sensitively?"}