{"id":325661,"name":"sensible","type":"adjective","us_sound":"ˈsen.sə.bəl","us_link":"../audio/s/sensible.mp3","uk_sound":"ˈsen.sə.bəl","uk_link":"../audio/s/uksen__025.mp3","content":"sensible adjective\n(GOOD JUDGMENT)\nAdd to word list\nAdd to word list\nB1 based on or acting on good judgment and practical ideas or understanding: a sensible answer/approach/compromise/option a sensible person I think the sensible thing to do is call and ask for directions. It would be sensible to take an umbrella.\nSensible clothes or shoes are practical and suitable for the purpose they are needed for, rather than being attractive or fashionable: It could be cold and wet so pack some sensible clothes.\nMore examplesFewer examplesI'm sure Jenny can be relied on - she seems eminently sensible.That would be a more sensible way of dealing with the problem.Wouldn't it be more sensible to eat now before we go?It would seem more sensible to do the research now before we start on the project.That was a very sensible decision.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nvictory\nwell advised\nwily\nwisdom\nwise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClothing - general words\nsensible adjective\n(AWARE)\nformal having an understanding of a situation: He did not appear to be sensible of the difficulties that lay ahead.\nSMART Vocabulary: related words and phrases\nAware\nabreast\nacquainted\nalive\nalive to something idiom\nawake\nawakening\nconscious\ngenned up\nhave/keep your finger on the pulse idiom\nhyper-aware\nhyper-awareness\nhyper-conscious\nomniscient\nomnisciently\non the inside idiom\novereducated\nperceive\npicture\nprofound\npulse\nSee more results »\nAdd to word list\nAdd to word list\nhaving or using good judgment; reasonable: She was sensible and easy to deal with. The only sensible thing to do is recycle.\nIf an object is sensible, it is practical but not exciting: a sensible family car sensible shoes sensibly adverb us\nYour browser doesn't support HTML5 audio\n/ˈsen·sə·bli/\nYou have to eat more sensibly."}