{"id":325622,"name":"sensation","type":"noun","us_sound":"senˈseɪ.ʃən","us_link":"../audio/s/sensation.mp3","uk_sound":"senˈseɪ.ʃən","uk_link":"../audio/s/uksen__014.mp3","content":"sensation noun\n(FEELING)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the ability to feel something physically, especially by touching, or a physical feeling that results from this ability: a burning sensation I had no sensation of pain whatsoever. The disease causes a loss of sensation in the fingers. Synonym\nfeeling (SENSE)\nB2 [ C usually singular ] a general feeling caused by something that happens to you, especially a feeling that you cannot describe exactly: [ + (that) ] I had the odd sensation (that) someone was following me. I can remember the first time I went sailing - it was a wonderful sensation. Synonym\nfeeling (EMOTION)\nMore examplesFewer examplesMy massage had left me with a pleasant tingly sensation.Suddenly she felt a burning sensation in her throat.I had a strange sensation in my neck as if something was pressing against it.Three months after the accident she still has no sensation in her right foot.I had the strange sensation that I'd been there before.\nSMART Vocabulary: related words and phrases\nThe senses in general\nhearing\nhyperacute\nhyperaesthetic\nintersensory\nnight vision\nnon-visual\nsensate\nsensately\nsense\nsensory\nsensually\nsight\nsmell\nsynaesthesia\nsynesthesia\ntaste\ntouch\nvision\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings - general words\nsensation noun\n(EXCITEMENT)\nB2 [ S ] something very exciting or interesting, or something that causes great excitement or interest: Their affair caused a sensation. The books have been a publishing sensation on both sides of the Atlantic. The show was an overnight sensation (= was very successful immediately).\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that becomes popular, wealthy, or has achieved a lotsuccessThe new TV series was a wild success. a roaring successHer third album was a roaring success and went platinum.hitDinner was a hit with the kids.triumphThe court verdict was a triumph for all abuse victims.winWhat can we do to get a win out of this situation?\nSee more results »\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nwoot\nzeal\nzealousness\nSee more results »\nsensation noun\n(FEELING)\nAdd to word list\nAdd to word list\n[ C/U ] a feeling in your body resulting from something that happens or is done to it, or the ability to feel as the result of touch: [ C ] He felt a sinking sensation in the pit of his stomach. [ U ] This part of your body doesn’t have a lot of sensation.\nsensation noun\n(EXCITEMENT)\n[ C ] great excitement or interest, or someone or something that causes excitement: His first recordings caused a sensation and became classics of rock."}