{"id":325779,"name":"sentiment","type":"noun","us_sound":"ˈsen.t̬ə.mənt","us_link":"../audio/s/eus74157.mp3","uk_sound":"ˈsen.tɪ.mənt","uk_link":"../audio/s/uksensi012.mp3","content":"sentiment noun\n(IDEA)\nAdd to word list\nAdd to word list\nC2 [ C or U ] formal a thought, opinion, or idea based on a feeling about a situation, or a way of thinking about something: Nationalist sentiment has increased in the area since the bombing. I don't think she shares my sentiments. His son was overwhelmed by the sentiments of love and support in the cards and letters he received.formal \"It's a very bad situation.\" \"My sentiments exactly (= I completely agree).\"\nMore examplesFewer examplesThe area has become a hotbed of anti-government sentiment.Already we have some indication of public sentiment on this issue.That sentiment is echoed north of the border.The past few weeks have witnessed an outpouring of patriotic sentiment.It's a sentiment that I can relate to.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\npolitics\nposture\npretension\nprism\nredistributionist\ntick\nSee more results »\nsentiment noun\n(FEELINGS)\n[ U ] often disapproving gentle feelings such as sympathy, love, etc., especially when considered to be silly or not suitable: The film is flawed by cloying sentiment.\nSMART Vocabulary: related words and phrases\nFeelings - general words\natmospherically\naura\ncharged\nemotional\nemotionalism\nemotionally\nfeeling\ngut\nhimself\nmyself\nnon-emotional\nnon-material\nsensibility\nsentience\nsentient\nsusceptibility\nteam spirit\nthirsty\ntwinge\nvibe\nSee more results »\nsentiment noun\n(GENERAL FEELING)\nAdd to word list\nAdd to word list\n[ C/U ] a general feeling, attitude, or opinion about something: [ C ] Writers learn that sentiments and ideas must serve the story, and not the other way around. [ U ] Boyd tried to turn community sentiment against the program.\nsentiment noun\n(EMOTION)\n[ U ] often disapproving gentle emotions such as love, sympathy, or caring: The film wallows in sentiment. There was little room for compassion or sentiment in his world.\nAdd to word list\nAdd to word list\npeople's opinions or feelings about a situation, especially the likely future direction of a financial market, the economy, etc.: Analysts and investors said market sentiment for the time being appears positive. Business sentiment is showing signs of recovery. There has been a dramatic shift in sentiment against technology stocks. positive/negative sentiment See also\nconsumer sentiment"}