{"id":325757,"name":"sentence","type":"noun","us_sound":"ˈsen.təns","us_link":"../audio/s/eus74155.mp3","uk_sound":"ˈsen.təns","uk_link":"../audio/s/uksensi008.mp3","content":"sentence noun [C]\n(WORD GROUP)\nAdd to word list\nAdd to word list\nA1 a group of words, usually containing a verb, that expresses a thought in the form of a statement, question, instruction, or exclamation and starts with a capital letter when written: He's very impatient and always interrupts me mid-sentence. Your conclusion is good, but the final sentence is too long and complicated. Compare\nclause (GRAMMAR) specialized\nphrase noun (GRAMMAR)\nMore examplesFewer examples'Bob' is the subject of the sentence 'Bob threw the ball'.In the sentence 'I wish I were rich', the verb 'were' is in the subjunctive.Sorry, could you just say that last sentence again please?'He was released from prison, ' is a passive sentence.In the sentence 'I sent Victoria a letter', 'send' is ditransitive.\nSMART Vocabulary: related words and phrases\nLinguistics: sentences & expressions\nadage\nasyndetic\nasyndetically\nasyndeton\nbackchannel\nclause\ncoin\ncomplex sentence\ncompound sentence\nconcessive clause\ndictum\nhedge\nmotto\noperative\nphrase\nslogan\nsubsentence\nthe operative word idiom\nto coin a phrase idiom\nTrumpism\nSee more results »\nsentence noun [C]\n(PUNISHMENT)\nB2 a punishment given by a judge in court to a person or organization after they have been found guilty of doing something wrong: He got a heavy/light sentence (= he was severely/not severely punished). The offence carries a jail/prison/life/five-year sentence. He was given a non-custodial/suspended sentence. pronounce sentence\n(of a judge) to say officially what a punishment will be: pronounce sentence on The judge will pronounce sentence on the defendant this afternoon.\nSee more\nSMART Vocabulary: related words and phrases\nPunishing & punishments\nankle bracelet\nankle tag\nattach\nball and chain\nbar\nbe brought/called to account idiom\ndiscipline\nendorse\nendorsement\nexcommunication\nfixed penalty\nflay\nflay someone alive idiom\nget what's coming to you idiom\npenalty\nskin someone alive idiom\nslam dunk\nsomeone should be shot idiom\nsort\nsort something out\nSee more results »\nGrammar\nClauses and sentencesA clause is the basic unit of grammar. A clause must contain a verb. Typically a clause is made up of a subject, a verb phrase and, sometimes, a complement: …\nWhat is a clause?A clause is the basic unit of grammar. A clause must contain a verb. Typically a clause is made up of a subject, a verb phrase and, sometimes, a complement: …\nWhat is a sentence?A sentence is a unit of grammar. It must contain at least one main clause. It can contain more than one clause. In writing, a sentence typically begins with a capital letter and ends with a full stop: …\nSentencesA sentence is a unit of grammar. Typically, in writing, it begins with a capital letter and ends with a full stop. …\nSentence structuresThere are three types of sentence structures: simple, compound and complex. …\nTypes of sentenceThere are four main types of clause or sentence. …\nB2 to decide and say officially what a punishment will be: He was sentenced to life imprisonment. Compare\ncondemn\nMore examplesFewer examplesHer sentence was commuted from death to life imprisonment.As it was her first conviction for stealing, she was given a less severe sentence.In some countries, drug-smuggling still carries the death sentence.The judge made an example of him and gave him the maximum possible sentence.He won his appeal and the sentence was halved.\nSMART Vocabulary: related words and phrases\nJudges & juries\nchallenge\nchief justice\ncourt of inquiry\ndismiss\nempanel\nfederal bench\njudge\njurist\njuror\njury nullification\njury service\njustice\nrecuse\nresentence\nrule\nset something aside\nsheriff\nsum\nsum (something/someone) up\nworship\nSee more results »\nsentence noun [C]\n(GRAMMAR)\nAdd to word list\nAdd to word list\ngrammar a group of words, usually containing a subject and a verb, expressing a statement, question, instruction, or exclamation, and, when written, starting with a capital letter and ending with a period or other mark: Your sentences are too long and complicated.\nsentence noun [C]\n(PUNISHMENT)\na punishment given by a law court to a person or organization that is guilty of a crime: She served a three-year prison sentence.\nto officially state the punishment given by a law court to a guilty person or organization: He was sentenced to three years in jail and fined $40,000."}