{"id":325841,"name":"separate","type":"adjective","us_sound":"ˈsep.ɚ.ət","us_link":"../audio/s/separate.mp3","uk_sound":"ˈsep.ər.ət","uk_link":"../audio/s/uksensi023.mp3","content":"Add to word list\nAdd to word list\nB1 existing or happening independently or in a different physical space: The art department and the music department are in two separate buildings. I try to keep meat separate from other food in the fridge. I have my public life and my private life, and as far as possible I try to keep them separate. Three youths have been shot and killed in separate incidents this month.\nMore examplesFewer examplesWe each have a separate bedroom but share a communal kitchen.Householders are given four separate receptacles for their rubbish.The waiter asked if we were all together so I explained that we were two separate parties.He regarded the north of the country as a separate cultural entity.The museums work closely together, but are separate legal entities.\nSMART Vocabulary: related words and phrases\nSeparateness and isolation in space\napart\napartheid\natomistic\natomized\nbitty\nfreely\ngappy\ngive something/someone a wide berth idiom\nhermetically sealed\nin pieces idiom\nloose\npurdah\nresegregation\nsecluded\nsecludedly\nseclusive\nuncombined\nuninhabited\nuntethered\nunvisited\nSee more results »\nIdiom\ngo your (own) separate ways\nseparate verb\n(DIVIDE)\nB2 [ I or T ] to (cause to) divide into parts: The north and south of the country are separated by a mountain range. You can get a special device for separating egg whites from yolks. The top and bottom sections are quite difficult to separate.\nMore examplesFewer examplesIt's sometimes hard to separate fact from fiction in what she says.In many churches the side aisles are separated from the central aisle by a row of arches.A narrow band of grass separated the greenhouse from the vegetable garden.A grille separated the prisoners from their visitors.I've separated the documents into three piles.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nseparate verb\n(MOVE APART)\nB2 [ I or T ] to make people move apart or into different places, or to move apart: At school they always tried to separate Jane and me because we were troublemakers. Somehow, in the rush to get out of the building, I got separated from my mother. Perhaps we should separate now and meet up later.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nremove\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nthose\nuncouple\nwrench\nwrenching\nzonal\nSee more results »\nseparate verb\n(CONSIDER AS DIFFERENT)\n[ T ] to consider two people or things as different or not related: You can't separate morality from politics.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nseparate verb\n(LIQUID)\n[ I ] If a liquid separates, it becomes two different liquids.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ncloven\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nseparate verb\n(RELATIONSHIP)\nB2 [ I ] to start to live in a different place from your husband or wife because the relationship has ended: My parents separated when I was six and divorced a couple of years later.\nSMART Vocabulary: related words and phrases\nRelationships: ending & divorce\naffiliation order\nannul\nannulment\nbreak something up\nbreak up with someone\nchild support\nchuck\nghost\ngive someone the elbow idiom\ngive someone the heave-ho idiom\ngive someone the push idiom\ngo off with someone\ngrow apart\nrebound\nrun out on someone/something\nseparation\nsplit\nsplit up\nthrow\nthrow someone over\nSee more results »\nAdd to word list\nAdd to word list\nexisting or happening independently or in a different physical space: The middle school and the high school are in two separate buildings. I have my public life and my private life, and as far as possible I try to keep them separate. separately adverb us\nYour browser doesn't support HTML5 audio\n/ˈsep·ər·ət·li/\nYou have to wash dark clothes and white stuff separately.\nto cause two or more people or things to stop being with or near each other, or to be positioned between two or more things: [ T ] A six-foot-high wall separates ticket holders from those hoping to get tickets. [ T ] Fighting broke out between two hockey players, and it took nearly five minutes to separate them.\nIf two married people separate, they stop living together as husband and wife, often as a part of a legal arrangement.\nAdd to word list\nAdd to word list\nnot together, joined, or connected: We realised that the best way to progress the project would be to set up a separate company. We have separate bank accounts.separate from sth The assets of the fund will be ring-fenced, which means they will be kept separate from the rest of the fund.\n[ I or T ] to divide into parts, or cause something to divide into parts: separate (sth) from sth They oppose the idea of Scotland separating from Britain.separate sth into sth We separated the workspace into cubicles using screens. separate a company/business\n[ T ] to consider two people or things as different or not connected: separate sth from sth These economic decisions cannot be separated from politics.separate sth and sth I find it difficult to separate home and business."}