{"id":326160,"name":"sequestration","type":"noun","us_sound":"ˌsiː.kwesˈtreɪ.ʃən","us_link":"../audio/s/eus74167.mp3","uk_sound":"ˌsiː.kwesˈtreɪ.ʃən","uk_link":"../audio/s/uksept_017.mp3","content":"sequestration noun [U]\n(OF PROPERTY)\nAdd to word list\nAdd to word list\nlaw\n&#160; specialized the act of taking temporary possession of someone's property until they have paid money that is owed or obeyed a court order: This would do nothing to halt the sequestration of property in the former colony. The union was ordered to to withdraw the instruction or face the sequestration of its funds and assets.\nMore examplesFewer examplesHe protested in vain at the sequestration of his estates.In the course of the sequestration proceedings, he was sentenced to 30 days' imprisonment.A corporation can be guilty of contempt of court, and the usual sanction is sequestration or fine or both.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nseize\nsequester\nsnag\nsnatch\nsnatch at something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIsolating and separating\nCourt cases, orders & decisions\nsequestration noun [U]\n(OF PEOPLE)\nthe act of keeping people, especially a jury, together in a place so that they cannot be influenced by other people, by newspaper reports, etc.: The committee called for an open trial and the sequestration of the jury. The extreme measure of jury sequestration is not required.\nMore examplesFewer examplesTo protect the jury's integrity, sequestration is necessary.Jury sequestration is expensive, and most cases do not require such extreme measures.Sequestration is something that should be done only as a last resort.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nremove\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nthose\nuncouple\nwrench\nwrenching\nzonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nsequestration noun [U]\n(OF SUBSTANCE)\nenvironment\n&#160; specialized the act of separating and storing a harmful substance such as carbon dioxide in a way that keeps it safe: We are actively pursuing new environmental approaches like carbon sequestration. natural processes that benefit people, such as the sequestration of carbon in soil and forests\nMore examplesFewer examplesWe will be leaders in clean-coal technology using coal gasification and sequestration of C02.Most candidates of both parties have called for spending on research for clean-coal technology, including the capture and sequestration of carbon dioxide emissions.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreclamation\nsequester\nsingle-use\nskip diving\nsmoggy\nsolar power\nSee more results »\nSee\nsequester"}