{"id":326147,"name":"sequester","type":"verb","us_sound":"sɪˈkwes.tɚ","us_link":"../audio/s/eus74166.mp3","uk_sound":"sɪˈkwes.tər","uk_link":"../audio/s/uksept_014.mp3","content":"sequester verb [T]\n(PROPERTY)\nAdd to word list\nAdd to word list\nlaw\n&#160; specialized (also sequestrate, uk/ˈsiː.kwə.streɪt/ us/ˈsiː.kwə.streɪt/) to take temporary possession of someone's property until they have paid money that is owed or until they have obeyed a court order\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\ncorner\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nseize\nsequestration\nsnag\nsnatch\nsnatch at something\nSee more results »\nsequester verb [T]\n(PEOPLE)\nUS to keep people, especially a jury, together in a place so that they cannot be influenced by other people, by newspaper reports, etc.\nSMART Vocabulary: related words and phrases\nIsolating and separating\nat one/this etc. remove idiom\nBrexit\ncompartmentalization\ncompartmentalize\ncompartmentation\nestrange\nestrangement\nfree-floating\nhard Brexit idiom\ninsulation\nremove\nresegregate\nrope\nrope something/somewhere off\nscreen something off\nthose\nuncouple\nwrench\nwrenching\nzonal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCourt cases, orders & decisions\nsequester verb [T]\n(SUBSTANCE)\nenvironment\n&#160; specialized to separate and store a harmful substance such as carbon dioxide in a way that keeps it safe: He said all coal plants should be closed until they find a way to sequester the carbon dioxide they emit. A growing forest sequesters carbon and gives off oxygen.\nMore examplesFewer examplesThe amount of carbon in the atmosphere must be reduced, either by lowering emissions or by sequestering carbon from the atmosphere.They should aim to sequester all significant caches of highly enriched uranium used in research reactors worldwide.Ecosystems with high biodiversity will take up and sequester more carbon and nitrogen.Mercury and other sequestered toxins are leaching out of the melting permafrost and into the ocean.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreclamation\nsequestration\nsingle-use\nskip diving\nsmoggy\nsolar power\nSee more results »\nRelated word\nsequestration\nAdd to word list\nAdd to word list\nto keep the people on a jury (= group deciding a legal case) separate from everyone else, even from their families, while deciding a case: The judge refused to have the jury sequestered.\nAdd to word list\nAdd to word list\nLAW, PROPERTY\n&#160; (also sequestrate) to take temporary possession of someone's property until they have paid back the money that they borrowed in order to buy it, or until they have obeyed a court order: You sign the acknowledgement of debt now and a few months later your property will be sequestered.\nLAW to keep a jury together in a place so that they cannot discuss the case with other people or see or hear news reports about it: He is expected to rule on a motion to sequester jurors during the trial."}