{"id":326388,"name":"series","type":"noun","us_sound":"ˈsɪr.iːz","us_link":"../audio/s/series.mp3","uk_sound":"ˈsɪə.riːz","uk_link":"../audio/s/ukseren013.mp3","content":"series noun [C]\n(SET OF EVENTS)\nAdd to word list\nAdd to word list\nB2 a number of similar or related events or things, one following another: There has been a series of sexual attacks on women in the area. She gave a series of lectures at Warwick University last year on contemporary British writers.\na number of games played one after another by two teams against each other: The Yankees have a four-game series against the Orioles at home. in series\nParts of an electrical system that are in series are arranged in a single line so that the current flows through each part, one after another: If two bulbs are in series, there is a single conducting path.\nSee more\nMore examplesFewer examplesThe initial earthquake was followed by a series of aftershocks.He's had a series of badly paid jobs.The police are trying to determine the series of events that led up to the murder.The government's reputation has already been harmed by a series of scandals.There was a series of explosions and the van burst into flames .\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinear\nlinearity\nlinearly\nlitany\nprecedence\npriority\nprocession\nsecondly\nsequence\nstring\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nseries noun [C]\n(SET OF BROADCASTS)\nB1 a set of television or radio broadcasts on the same subject or using the same characters but in different situations: The star is to host a television series on extreme sports. a comedy series I missed the second episode of the series so I don't know what's going on now.\nMore examplesFewer examplesHe's the creator of a successful cartoon series.He liked the second series but I thought it was fairly poor.Alan Bennett wrote a series of monologues called Talking Hea ds.A new series of wildlife programmes has started on Monday evenings.She has made a series of documentaries on the subject of family relationships.\nSMART Vocabulary: related words and phrases\nBroadcasting: programmes & other broadcasts\naction replay\nbinge-watch\nblooper\nbreakfast television\nbreaking news\ncommentary\nfiller\nfly on the wall idiom\ngame show\nGod slot\ngreen screen\nprocedural\nreality show\nreality TV\nrerun\nrom com\nsketch\nsoap\nsyndicate\nvox pop\nSee more results »\nseries noun [C]\n(SET OF BOOKS)\nB2 a set of books published by the same company that deal with the same subject: They do a series on architecture throughout the ages.\nMore examplesFewer examplesThey've just published a wine atlas series.They have recently launched a new series of monographs.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovel\nnovelette\nnovelistic\ntome\ntrilogy\nvade mecum\nworkbook\nya\nSee more results »\nAdd to word list\nAdd to word list\na number of similar or related events or things, one following another: A series of scandals over the past year has not helped public confidence in the administration.\nAdd to word list\nAdd to word list\na number of similar or related events or things, one following another: a series of events/interviews/meetingsa series of articles/books/studies This is the first of a series of articles looking at financial instability. a series of steps/actions/transactions a series of crimes/attacks\nPRODUCTION a set or range of similar products made by a company: The company has announced two new lines, the 2200 series and the 2300 series.\nFINANCE, STOCK MARKET used in the name of a company's shares that have things in common, for example particular voting rights: Shares are called Series A if they are the first batch of a series of shares issued by the company.\nSee also\ntime series"}