{"id":326428,"name":"serious","type":"adjective","us_sound":"ˈsɪr.i.əs","us_link":"../audio/s/serious.mp3","uk_sound":"ˈsɪə.ri.əs","uk_link":"../audio/s/ukseren014.mp3","content":"serious adjective\n(BAD)\nAdd to word list\nAdd to word list\nB1 severe in effect; bad: a serious illness There were no reports of serious injuries. The new tax regulations have landed some of the smaller companies in serious trouble. Drugs have become a serious problem in a lot of schools. This is a very serious offence. He's been taken to hospital where his condition is described as serious but stable.\nThesaurus: synonyms, antonyms, and examples\nhaving a bad result or outcomeseriousHer condition is not thought to be serious.badHe got a bad case of food poisoning.bigOnline fraud is a big problem.majorIt's not a major problem, but it does need to be taken care of.graveThe public are in grave danger.\nSee more results »\n[ after noun ] mainly Indian English very ill\nMore examplesFewer examplesThe long hot summer has led to serious water shortages.The drought caused serious shortfalls in the food supply.Drunken drivers pose a serious threat to other road users.It was a serious fall - it'll be a while before you feel up to walking again.Strong winds had caused serious damage to the roof.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\nbe no laughing matter idiom\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing & falling ill\nserious adjective\n(NOT JOKING)\nB1 not joking or intended to be funny: Please don't laugh - I'm being serious. He was wearing a very serious expression and I knew something was wrong. On the surface it's a very funny novel but it does have a more serious underlying theme.\nThesaurus: synonyms, antonyms, and examples\nlacking humour and not meant to be funnyseriousShe had a serious look on her face.earnestAt that time he was an earnest young environmental activist.soberThe mood of the gathering was sober and reflective.sombreUK Since their colleague died there has been a very sombre atmosphere in the office.solemnThe two men fell silent, their faces solemn.\nSee more results »\nB1 A serious person is quiet, thinks carefully about things, and does not laugh a lot: I remember her as a very serious child.\nMore examplesFewer examplesI thought she was joking but she was deadly serious.He was being funny but I think he was half serious.I know it's a funny piece of writing but I think there's a serious point being made here.Listen, I'm being serious now - this is a big problem.He's very serious about his work.\nSMART Vocabulary: related words and phrases\nLacking humour\na laugh a minute idiom\nbe no laughing matter idiom\nbeyond\nbeyond a joke idiom\nearnest\nearnestly\nearnestness\nhumourless\nhumourlessly\nlightly\nsaturnine\nsober\nsoberly\nsolemnity\nsombrely\nsombreness\nstraight-facedly\nturgid\nturgidity\nturgidly\nSee more results »\nserious adjective\n(DETERMINED)\n[ after verb ] determined to follow a particular plan of action: Is she serious about going to live abroad?\n[ after verb ] If two people who have a loving relationship are serious about each other, they intend to stay with each other for a long time and possibly marry: She's had a lot of boyfriends but Simon's the only one she's been serious about.\nMore examplesFewer examplesAre you serious about leaving?Was he serious about wanting a new job?If they were serious about ending poverty they would increase the minimum wage.You're not serious about moving house, are youSo is she serious about Anthony?\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngoing\ngrittily\ngutsily\ngutsy\ngutty\npersistent\npersistently\npertinacious\npertinaciously\npigheaded\ntough\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLoving and in love\nserious adjective\n(NEEDING ATTENTION)\nB2 [ before noun ] needing or deserving your complete attention: That's an interesting job offer - I'd give it some serious consideration if I were you. We've got some serious talking to do, you and me.\nMore examplesFewer examplesI have serious concerns about her ability to do the job.So he is a serious contender for the title?I have serious doubts about the whole project.This is a serious complaint - we can't just ignore it.This is a serious matter.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nserious adjective\n(EXTREME)\ninformal extreme in degree or amount: We did some fairly serious walking over the weekend. I mean we're talking serious (= a large amount of) money, right?\ninformal very good of its type: This is a serious wine, Belle, you have to try some.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformal words for good\nserious adjective\n(NOT JOKING)\nAdd to word list\nAdd to word list\nnot joking; not intended to amuse: You can never tell when he’s serious.\nserious adjective\n(NEEDING ATTENTION)\nneeding complete attention: That’s an interesting job offer – I’d give it serious consideration if I were you.\nserious adjective\n(BAD)\nsevere in effect; bad: Fortunately, there were no serious injuries.\nserious adjective\n(DETERMINED)\ndetermined to follow a particular plan of action: Is she serious about moving to Nevada? You have to start getting serious about your studies.\nIf two people who have a romantic relationship are serious about each other, they intend to continue the relationship and possibly marry."}