{"id":326345,"name":"serialized","type":"verb","us_sound":"ˈsɪr.i.ə.laɪz","us_link":"../audio/s/usserap012.mp3","uk_sound":"ˈsɪə.ri.ə.laɪz","uk_link":"../audio/s/ukseren012.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nserialize\nserialize verb [T]\n(BOOK)\nto make a book or story into a number of television or radio programmes or publish it in a newspaper or a magazine in parts: The novel was serialized on TV back in the 1990s. Her memoirs were serialized in the Sunday Times.\nMore examplesFewer examplesThe London Evening Standard was serializing his book, Desert and Forest, at the time of his fatal crash in an aeroplane. \"24\" was one of television's most successful serialized dramas.Breaking Bad is written in serialized form.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNewspapers & magazines\nserialize verb [T]\n(ARRANGE)\nto arrange something in a series: The program can retrieve a list of employees, serialize the results, and return it as the response to the request.\ncomputing\n&#160; specialized to change data into a form that can be stored or sent and put back into its original form later: The Chart Controls make it amazingly simple to serialize and deserialize chart data.\nMore examplesFewer examplesThe manufacturer serializes the part numbers.A series of short-term investment of 6 months to a few years each are serialized and turned into a single 30-year investment.You can easily save any public object to a binary serialized file. Data can be serialized to a disk.The browser is given a random cookie value which is then associated with a larger chunk of serialized data on the server.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nRelated word\nserialization"}