{"id":326738,"name":"service","type":"noun","us_sound":"ˈsɝː.vɪs","us_link":"../audio/s/service.mp3","uk_sound":"ˈsɜː.vɪs","uk_link":"../audio/s/ukseren028.mp3","content":"service noun\n(PUBLIC NEED)\nAdd to word list\nAdd to word list\nB1 [ C ] a government system or private organization that is responsible for a particular type of activity, or for providing a particular thing that people need: the postal serviceUS the National Park ServiceUK the National Health ServiceUK the ambulance/prison service I've worked in public health services throughout my career.\nB1 [ C or U ] the fact that a system is working: There is a very limited bus service on Sundays.operate a service We hope to be operating a normal service as soon as possible. services [ plural ] UK\na place at the side of a large road at which fuel, food, drink, and other things that people want on their journey are sold: We stopped at the services to get fuel.\nSee more\nMore examplesFewer examplesthe intelligence servicethe probation servicethe British secret servicethe prison service\nSMART Vocabulary: related words and phrases\nSociety - general words\namenity\ncivilized\nconsumer society\nculturomics\ndigital divide\nhunter-gatherer\nnon-segregated\nnon-segregation\nnon-utility\npluralism\nsociality\nsocially\nsocietal\nsocietally\nsocio-\nsociologist\nsociology\nsuperstructure\nuncivilized\nutility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUsing and misusing\nservice noun\n(DEALING WITH CUSTOMER)\nB1 [ U ] the act of dealing with customers in a shop, restaurant, or hotel by taking their orders, showing or selling them goods, etc.: The only trouble with this café is that the service is so slow.good service You should leave a generous tip to reward good service.\nB2 [ U ] an amount of money charged for serving a customer in a restaurant, often paid directly to the waiter: service charge There is a ten percent service charge included in the bill.\nMore examplesFewer examplesIf the service was so bad why didn't you complain to the manager?The food was bad and the service was dreadful.It really annoys me when people expect me to tip as well as pay a service charge in a restaurant.Restaurant-goers ought to complain more about bad food and service.Tax and service are included in the bill.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosts & expenses\nservice noun\n(WORK)\nC1 [ C or U ] work that someone does or time that someone spends working for an organization: community service These teenagers all do community service in their free time.public service She was given the award for a lifetime of public service.service on Service on a jury may be deferred for health reasons.\n[ C ] a business that offers a particular type of help or work: babysitting service Why don't you call the babysitting service?laundry/ironing service Guests may take advantage of free internet access and a reasonably priced laundry/ironing service.\nB2 [ C ] a government department that is responsible for a particular area of activity: the diplomatic service the security services services [ plural ] formal\nthe particular skills that someone has and can offer to others: the services of I may be needing the services of a surveyor soon, as I'm buying a house.\nSee more in service\nin use: The battleship has been in service since 1965.\nSee more be in service UK old-fashioned\nto be employed as a servant: Her mother was in service.\nSee more\nSMART Vocabulary: related words and phrases\nWorking hours\nafter hours idiom\nclock in\nclock out\nclose of business\nclose of play\nfull time\nhour\nin-service\nman-hour\nnight shift\novertime\npunch out\npunch the clock idiom\nreduced time\nrush hour\nshiftwork\ntime clock\nworking week\nworkweek\nzero-hours contract\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nUK politics: government departments & organizations\nservice noun\n(ARMED FORCES)\nB2 [ C or U ] (work in) the armed forces: in the service He joined the air force in 1964 and spent ten years in the service.military service All men under 35 were told to report for military service. Service personnel are subject to the Official Secrets Act. the services B2 [ plural ]\nthe army, navy, and/or air force: a career in the services\nSee more on active service mainly UK (also mainly US in active service)\nfighting in a war: He was the first member of his regiment to die while on active service.\nSee more\nMore examplesFewer examplesHe did his military service after leaving college.He joined the army on leaving school and spend the next 20 years in the service.\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nservice noun\n(RELIGIOUS CEREMONY)\n[ C ] a formal religious ceremony: memorial service is held A memorial service is being held on Sunday for victims of the explosion.\nMore examplesFewer examplesa church servicea remembrance servicea funeral servicea marriage service\nSMART Vocabulary: related words and phrases\nReligious ceremonies & prayers\nalleluia\namen\nanoint\nanointed\nanointment\ncommunion\nconfirm\nconfirmation\nconsecrate\nconsecration\nlitany\nliturgical\nliturgically\nliturgy\nthanksgiving\nthe Lord's Prayer\nunchristened\nunction\nunprogrammed\nvespers\nSee more results »\nservice noun\n(IN SPORTS)\nin sports such as tennis, the act of hitting the ball to the other player to start play: She has a very fast service. Synonym\nserve\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\ntennis\nunreturnable\nunseeded\nvolley\nSee more results »\nservice noun\n(ON TABLE)\n[ C ] a set of objects such as plates, cups, or other things that are used in providing and eating food: a 24-piece dinner service a tea service\nWoraphon Nusen/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nDishes, bowls, cups & glasses\nballon\nbeaker\nbowl of something\ncake stand\nchafing dish\negg cup\nfinger bowl\nflute\nglassware\ngo-cup\nramekin\nsalver\nsaucer\nserving board\nside dish\ntrencher\ntumbler\ntureen\nwashbowl\nwine glass\nSee more results »\nservice noun\n(REPAIR)\n[ C ] mainly UK a check and repair of a vehicle or machine that is done after regular periods: She took the car in for a service yesterday.\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCorrecting and mending\nIdioms\nbe of service (to someone)\ndo someone a service\nservice verb [T]\n(MACHINE)\nto examine a machine and repair any damaged parts: I'm taking the car in to have it serviced this afternoon.\nThesaurus: synonyms, antonyms, and examples\nto repair somethingrepairHe asked if she could repair the broken lamp.fixI must get my bike fixed.mendCan you mend that hole in my trousers?do upNick loves doing up old cars.serviceI'm taking the car to the garage to have it serviced this afternoon.patch upI patched up the old bike and got it working.\nSee more results »\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCorrecting and mending\nservice verb [T]\n(DEBT)\nto make payments to pay back a debt: The country is still spending $3 million a week servicing debt.\nSMART Vocabulary: related words and phrases\nBorrowing & lending\namortizable\namortization\nbonded\nborrow\nborrow something from something\nbridging loan\ncredit limit\nforeclose\nhole\nliquidator\nloan\nnon-prime\nnonaccrual\non the slate idiom\noutstanding\nover-borrowed\noverpay\noverpayment\npay someone/something back\nreceivership\nSee more results »\nservice verb [T]\n(PROVIDE SERVICES)\nto provide services to or for someone: We're quite happy to service our customers wherever they are. Together they service 46 buildings, including 37 schools.\nto provide transport, communications, etc. systems in an area: Wembley stadium is serviced by Wembley Stadium, Wembley Park and Wembley Central stations. The village is small, unspoilt and well serviced.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nRelated word\nservicing\nservice noun\n(HELP)\nAdd to word list\nAdd to word list\n[ U ] the help provided to a customer by someone who works in esp. a restaurant or store: The service in this restaurant is terrible – I’ve been waiting fifteen minutes.\nservice noun\n(WORK)\nwork done or help provided, esp. for the public or for a person or an organization: [ U ] She was given the award for a lifetime of public service. [ U ] The airplane had been in service (= used) for fifteen years. [ pl ] You should have the services of a lawyer.\nservice noun\n(SYSTEM)\n[ C/U ] a system, organization, or business that provides for a public need, or the operation of such a system: [ C ] the diplomatic/postal service [ C ] medical/social services [ U ] There is bus service to Newark Airport every twenty minutes.\n[ C/U ] A service is a business that provides something for people but does not produce goods: [ U ] My brother runs a car service (= business that rents cars with drivers).\n[ C/U ] The service is the armed forces: [ U ] He spent ten years in the service.\nservice noun\n(RELIGIOUS CEREMONY)\n[ C ] a formal religious ceremony\nservice noun\n(EMPLOYMENT)\n[ U ] work done for others, such as cleaning or repairing, caring for a building, or making deliveries: This building has five service employees including the super.\n[ U ] A service entrance is an entrance to a building that is used for deliveries.\nservice noun\n(BALL HIT)\n[ U ] the act of hitting a ball to put it in play in tennis and some other sports\nservice verb [T]\n(REPAIR)\nto examine a machine and repair any parts that are not working: I’m taking the car in to have it serviced this afternoon.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; COMMERCE business activity that involves doing things for customers rather than producing goods, or a single act of doing something for a customer: The bank was the first to offer 24-hour telephone banking service. We haven't actively promoted the email service because we have to be sure we can meet demand. These days there are service jobs that no one ever dreamed about in the 1950s. GDP is a measure of an economy's output of goods and services. The goal is to increase customer loyalty by providing customized products and services.offer/provide a service Career consultants offer numerous services, including résumé polishing.service for sb/sth We provide an internet service for lawyers.\n[ C ]\n&#160; GOVERNMENT a system or organization that provides something important that the public needs: the ambulance/health/postal, etc. service The planners have to investigate what local services are available including transport, housing, and schooling for employees' children.\n[ C ]\n&#160; GOVERNMENT a government department that is responsible for a particular area or activity: The immigration service has won an important victory in the courts.\n[ C or U ]\n&#160; TRANSPORT a system of buses, trains, aircraft, etc. that travel between particular places: Passenger traffic registered a sharp rise thanks to the opening of a new ferry service from Liverpool to Dublin. The 18:43 service to Liverpool has been cancelled. Commercial air service is ready to resume today.\n[ U ]\n&#160; COMMERCE the way that employees of a business, store, etc. deal with customers, especially how quickly and effectively they do this: level/quality/standard of service We constantly seek to improve the quality of service we give to our customers. good/excellent/poor serviceprovide/give service They have provided excellent service in handling problem cases.get/receive service It seems like you never get good service in restaurants these days.\nservices\n[ plural ] formal the particular skills that someone can offer to others: You need the services of a lawyer.offer your services (as sth) He has offered his services as a mediator in the dispute. Until fairly recently the Law Society frowned upon solicitors advertising their services in any way.\n[ C or U ]\n&#160; HR the time an employee spends working for an organization, or the work they do: British labour law gives employees rights dependent upon their length of service.15/40, etc. years (of) service The amount of the severance payment is based on his 25 years service with the group. Under Germany's constitution, the unions and employers' federations have the exclusive right to negotiate wages and conditions of service.\n[ C ] UK a check and repair of a vehicle or machine that is done at regular periods: I'm taking my car in for a service.\nbe of service (to sb)\nformal to help someone: Hello, how can I be of service?\nin service\nbeing used: If we find a technology that will work, it could be in service by 2012. See also\ncustomer service\ndebt service\nfinancial services\nlegal services\nmarketing services\npublic service\nFINANCE to make regular payments to pay back a debt or loan, including interest: As growth slowed and prices fell, borrowers were unable to service their debts. The country is still spending $3 million a week servicing debt, twice what it spends on healthcare.\nFINANCE to collect and keep records of payments from a person or organization that has borrowed money: We service about 350,000 mortgage loans.\nto examine a machine and repair any damaged parts: I'm taking the car in to have it serviced. The 10-year contract involves servicing 11 gas turbines on three deep-water platforms in the Gulf of Mexico.\nCOMMERCE to provide a service to someone: service an industry/market We hope to achieve greater efficiency and be better able to service customers. See also\nservicing\nused only by people who work in a building or are delivering goods there, not by the general public: a service elevator/entrance"}