{"id":326879,"name":"session","type":"noun","us_sound":"ˈseʃ.ən","us_link":"../audio/s/session.mp3","uk_sound":"ˈseʃ.ən","uk_link":"../audio/s/ukservi013.mp3","content":"session noun\n(FORMAL MEETING)\nAdd to word list\nAdd to word list\n[ C or U ] a formal meeting or series of meetings of an organization such as a parliament or a court of law: parliamentary session The parliamentary session is due to end on 27 May.in session The UN Security Council met in emergency session to discuss the crisis. See also\nclosed session\nMore examplesFewer examplesan emergency UN General Assembly sessiona semi-secret National assembly session\nSMART Vocabulary: related words and phrases\nOfficial meetings\nAGM\nannual general meeting\nassizes\nbrainstorming session\nbreakout room\nconference\nconvoke\ncouncil of war\ncounter-convention\nextraordinary\nplenum\npowwow\nquorate\nround-table\nscrum\nsit\nspeaking engagement\nsymposium\nteleconference\nteleconferencing\nSee more results »\nsession noun\n(ACTIVITY)\nB1 [ C ] a period of time or a meeting when a particular activity takes place: training session The 21-year-old runner twisted his ankle in a training session last Friday.recording session The recording session lasted four hours, during which they were able to get three tracks down. A minimum of three sessions of acupuncture is advised in the first instance. She has weekly sessions with a speech therapist.\n[ C ] UK informal an occasion when people drink a lot of alcohol together: The men had a heavy session last night . He drove home drunk after a late-night session in a pub.\n[ C ]\n&#160; computing\n&#160; specialized a period of time during which someone uses a particular computer, network, or software service: When a client closes a session, the server will receive a disconnect message. Many people prefer to pick up the phone, rather than open a chat session.\nMore examplesFewer examplesThe meeting will have the usual format - introductory session, group work and then a time for reporting back.We'll be starting the session at six o'clock.The delegates trailed back into the conference room for the afternoon session.I had a marathon session marking 55 exam papers yesterday.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking alcohol\nOperating computers\nsession noun\n(COLLEGE PERIOD)\n[ C or U ] US or Scottish English at a college, any of the periods of time that a teaching year or day is divided into, or the teaching year itself: He taught a class during the summer session.in session Access is restricted when school is in session.\nSMART Vocabulary: related words and phrases\nUniversity & college education\nacademe\nacademia\nanti-university\nbeadle\nbusiness school\ngrad\ngraduate\nhall\nhall of residence\nOxbridge\nOxon\nPanhellenic\npass degree\npoly\nthe groves of academe idiom\nuni\nuniversity\nunselective\nvice chancellor\nwarden\nSee more results »\nsession noun\n(MUSIC EVENT)\n[ C ] an event at which musicians and singers play and sing together in an informal way, especially playing folk or jazz music: The pub hosts Irish folk music sessions. He quickly mastered the piano and was playing in Harlem jazz sessions by the time he was 18.\nSMART Vocabulary: related words and phrases\nFolk & ethnic music\nbandura\nbluegrass\ncountry\ncountry and western\ncountry music\nfolk\nfolk rock\nfolk song\nhornpipe\nmahonia\nraga\nskiffle\nskirl\nthroat singing\nYou can also find related words, phrases, and synonyms in the topics:\nJazz & blues\nPlaying music\nSee also\nbrainstorming session\nbull session\nclosed session\nexecutive session\njam session\nphoto session\nposter session\nskull session\nsession musician\nsession noun\n(FORMAL MEETING)\nAdd to word list\nAdd to word list\na formal meeting of an organization, esp. of a legislature or law court: [ C ] He wanted to introduce the bill before the present session of the state legislature adjourned. [ U ] Congress is in session (= continuing to have meetings) until the end of the month.\nsession noun\n(ACTIVITY)\n[ C ] a period of time or a meeting arranged for a particular activity: The musicians gathered in the studio, waiting for the start of the recording session.\n[ C ] At a college or university, a session is any of the periods of time into which a teaching year is divided: The first summer session starts June 3rd.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MEETINGS a period of time or meeting arranged for a particular activity: I'm having a session with her this afternoon for a briefing. There are regular training sessions at the firm's central office. So far the intense negotiating sessions have failed to yield any substantial progress. a planning/brainstorming sessionthe opening/closing session She spoke at the opening session of the conference.\n[ C ]\n&#160; STOCK MARKET\n&#160; (also trading session) a period of buying and selling on a stock market, usually within a single day: Tokyo stocks surged in the trading session, pushed by record highs on Wall Street overnight. The group's shares gained 7.5p to close the session at 176.5p.\n[ C or U ]\n&#160; LAW, GOVERNMENT a formal meeting or series of meetings of an organization such as a parliament or a law court: The General Assembly is due back in session after a six-week adjournment. Improvements in workers' compensation were made during the last legislative session. The Bank's board held an emergency session yesterday."}