{"id":326908,"name":"set","type":"verb","us_sound":"set","us_link":"../audio/s/set.mp3","uk_sound":"set","uk_link":"../audio/s/ukservi014.mp3","content":"set verb\n(POSITION)\nAdd to word list\nAdd to word list\nB2 [ T usually + adv/prep ] to put something in a particular place or position: He set a vase of flowers on the table. The campsite is set in the middle of a pine forest. Our house is set back from the road.\nB1 [ T usually + adv/prep ] If a story, film, etc. is set in a particular time or place, the action in it happens in that time or place: \"West Side Story\" is set in New York City in the late 1950s.\nMore examplesFewer examplesHe set the books down on the table.She set the tray down beside me.Finish chopping the onions and set them to one side.The building itself is set back from the street.The mansion is set in 90 acres of beautiful, unspoilt countryside.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: production, direction & recording\nset verb\n(CONDITION)\nB2 [ T ] to cause something or someone to be in the stated condition or situation: It is believed that the building was set alight/ablaze/on fire deliberately. The new director has set a lot of changes in motion in our department. [ + adj ] After years in prison, the men who had wrongfully been found guilty of the bombing were finally set free. If I've made a mistake, then it's up to me to set it right (= correct it). set someone/something doing something\nto cause someone or something to start doing something: His remarks set me thinking. The thunderstorm set the radio crackling. set someone to work\nto give someone work to do: I was set to work dusting the bookshelves.\nMore examplesFewer examplesWe watched as demonstrators doused a car with petrol and set it alight.A peace campaigner had set herself on fire in protest at the government's involvement in the war.Rioters armed with firebombs set light to police barricades.The new government has decided to set all political prisoners free.The lamp caught fire and set light to the curtains.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWork, working and the workplace\nApplying for a job\nset verb\n(ESTABLISH)\nB2 [ T ] to establish or decide something: The school has been criticized for failing to set high standards for its students. The committee has set new limits on spending. Lewis has set a new world record. The court's decision has set a legal precedent. Parents should set a good example to their children. He's set himself the goal/target of making his first million by the time he's 30.\nMore examplesFewer examplesWe're not in a position to set any conditions - we'll have to accept what they offer us.They need to set some boundaries of behaviour for that child.My brother set the academic standards we all had to follow.We have set ourselves a limit for our spending.He sets us a great example by cycling to work every day.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nset verb\n(GET READY)\nB2 [ T ] to get something ready so that it comes into operation or can be used: [ + to infinitive ] The heating is set to come on at 5 p.m. Have you set up the DVD player? I usually set my watch by the time on the computer. He set the alarm for 7 a.m. Will you set the table (= put plates, knives, forks, etc. on it ready for use), please?\n[ T ] to put furniture and other things on a stage so that it represents the time and the place in which the action of a play, film, or television programme is going to happen: During the interval the stage was set for the second act.\nMore examplesFewer examplesShe set her clock by the time on the computer.I've set the alarm for 7.30.I set the heating to come on at six.The oven is set to come on automatically.I set the washing machine for a delicate wash.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\nprep\npreparation\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema & theatre: production, direction & recording\nset verb\n(FIX)\nB1 [ T ] to fix or make certain: Has a date/time been set for the meeting yet? The price of the house has been set at €425,000.\nThesaurus: synonyms, antonyms, and examples\nto decidedecideI've decided to move to Sweden.fixUK The price has been fixed at £10.setHave you set a date for the wedding?finalizeWe've chosen a venue for the wedding, but we haven't finalized the details yet.settleOK then, we're going to Spain. That's settled.settle on/uponHave you settled on a place to live yet?\nSee more results »\nset into something/be set with something\nIf a precious stone is set in/into a piece of jewellery, or a piece of jewellery is set with a precious stone, the stone is fixed firmly to the piece of jewellery: a gold ring with a diamond set into it a brooch set with rubies and pearls\n[ T ] When a doctor sets a broken bone, he or she puts it into the right position so that it will heal.\n[ I ] When a broken bone sets, it heals in a particular position.\n[ T ] If you have your hair set, you have it arranged while it is wet so that it will be in a particular style when it is dry.\n[ T ] If you set a part of your body, you tighten the muscles around it in order to show that you are determined about something: \"I'm never going back to him,\" she said, setting her jaw firmly. His face was set in determination.\n[ I ] If a liquid or soft material sets, it becomes firm or hard: Leave the jelly in the fridge to set. Don't walk on the concrete until it has set.\nMore examplesFewer examplesWe set a date for a follow-up meeting.Have you set a time for the next appointment?The price of the boat was set too high for us.\nSMART Vocabulary: related words and phrases\nDecisions and deciding\nascription\nbe make or break for someone/something idiom\nbe on the horns of a dilemma idiom\nchoose\nclinch\nconclusion\nfix\nget it together idiom\nget something into your head idiom\nhammer something out\nhave a, some, etc. say in something idiom\nif/when it comes to the crunch idiom\njudge\nresolution\nsleep\ntake the plunge idiom\ntightrope\ntilt\ntilt the balance/scales idiom\ntop-down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJewelry\nPhysiotherapy, massage & osteopathy\nRecovering from illness\nHairdressing\nPreparing\nPhysical & chemical processes\nset verb\n(GIVE WORK)\nB2 [ T ] UK (US assign) to give someone a piece of school work or homework to do: My science teacher always sets a lot of homework. What books have been set for this term? [ + two objects ] What homework have you been set for the holidays?\n[ T ] to give someone a particular task to do: Harry set them to work painting the walls. [ + two objects ] We set the kids the task of clearing the snow from the drive.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nset verb\n(MUSIC)\n[ T ] to write or provide music for a poem or other words so that they can be sung: poems set to music\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nandante\nantiphonal\narpeggio\narr.\ncadence\ngiusto\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopated\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\nSee more results »\nset verb\n(SUN)\nB1 [ I ] (of the sun, moon, or planets) to go down below the horizon (= the line at which the earth seems to join the sky): We sat on the beach and watched the sun set. The setting sun cast long shadows across the lawn. See also\nsunset noun\nSMART Vocabulary: related words and phrases\nAstronomy\nalbedo\nAndromeda\nAquarius\nAries\nasteroid\ngalactic\ngalaxy\nGemini\ngeostationary orbit\ngibbous\nnova\nobservatory\norbit\norbital\nOrion\nstellar\nsubstellar\nsunspot\nsupergiant\nsupermassive\nSee more results »\nIdioms\nnot set the world on fire\nset the scene/stagePhrasal verbs\nset about something\nset about someone\nset someone against someone\nset something against something\nset something/someone apart\nset something aside\nset someone back (something)\nset something/someone back\nset something back\nset something down\nMore phrasal verbs\nset someone down\nset something forth\nset in\nset off/out\nset something off\nset someone off\nset someone/something on someone\nset on/upon someone\nset out\nset something out\nset to\nset something up\nset someone up\nset something/someone up\nset (something) up\nset yourself up as something\nset noun\n(GROUP)\nA2 [ C ] a group of similar things that belong together in some way: We bought Charles and Mandy a set of cutlery as a wedding present. I always keep a tool set in the back of my car. The doctor said that he hadn't seen this particular set of symptoms before. We need to establish a new set of priorities.\nA2 [ C ] a number of objects or pieces of equipment needed for a particular activity, especially playing a game: a chess/train/chemistry set\na group of repeated movements performed as part of a period of physical exercise: I did three sets of 10 push-ups every night before bed. Sprint up the hill and jog down. Do three sets, then jog easy for 10 minutes.\n[ C ]\n&#160; mathematics\n&#160; specialized In mathematics, a set is a group of objects with stated characteristics.\n[ C, + sing/pl verb ] a group of people who have similar interests and ways of living: the fashionable set She's got in with a very arty set.\nMore examplesFewer examplesGovernment by coalition has its own peculiar set of problems.A set of stamps has been commissioned in commemoration of Independence Day.He only needs two more cards to complete the set.Cross the bridge and turn right at the first set of traffic lights.They got an entire set of silver cutlery as a wedding present.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nNumerical relationships\nGroups of people\nset noun\n(FILM/PLAY)\nB2 [ C ] the place where a film or play is performed or recorded, and the pictures, furniture, etc. that are used: a movie set a stage set a set designer They first met on the set of \"Star Wars\".\nMore examplesFewer examplesHe designs the sets for the local drama group.She was famous for throwing tantrums on set.They met on the set of 'Titanic'.\nSMART Vocabulary: related words and phrases\nTheatres, cinemas & their parts\napron\nart house\narthouse\nbackdrop\nbackstage\nbillboard\nbioscope\nfleapit\nfootlights\ngreen room\nloge\nonstage\nplayhouse\nscenery\nstage door\nstage left\nstage right\nstagily\nstagy\nwing\nSee more results »\nset noun\n(PART)\nB2 [ C ] a part of a game of tennis or volleyball: They won in straight sets (= they won every set).\nC2 [ C ] a musical performance that forms part of a concert, especially one of pop music or jazz: The band's opening set lasted 45 minutes.\nMore examplesFewer examplesI played a couple of sets with Alfie.He won the match by five sets to three.\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\ntennis\nunreturnable\nunseeded\nvolley\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical performances\nset noun\n(POSITION)\nthe set of something\nthe position in which you hold a part of your body: I could tell from the set of his jaw that he was angry.\n[ C ] the act of having your hair set: a shampoo and set\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHair care\nset noun\n(TELEVISION)\n[ C ] old-fashioned a television: We need a new television set.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\ngaffer\nghost image\ngoggle-box\nHD\nHDTV\nplasma screen\nreceiver\nshout-out\nsmart TV\nsquare-eyed\nsubtitler\nsweep\nthe small screen phrase\nzap\nSee more results »\nset adjective\n(READY)\nC1 [ after verb ] ready and prepared: Shall we go now - is everyone set? Is everything all set for the party? At the start of the race, the starter said \"On your marks, get set, go\". We were just getting set to leave when Ben said he had something important to tell us.\n[ after verb ] likely or in a suitable condition: He looks set to become world champion again this year.\nSMART Vocabulary: related words and phrases\nReady and willing\nagreeable\namenable\nat someone's beck and call idiom\nat your command idiom\nbe chafing at the bit idiom\nbeck\ncommand\ndisposed\neager\neagerly\nfain\nfind it in your heart to do something idiom\nfinger\nkeen\npoised\nprepared\nraring\nreadily\nreadiness\nripe\nSee more results »\nset adjective\n(SAME)\nC2 always the same, never changing: My parents say I have to be home by a set time.UK The restaurant does a set lunch (= a meal which is offered at a fixed price, but with little or no choice about what you have to eat) on Sundays. The receptionist had a bright set smile on his face, but I could tell that he was bored. My father has very set opinions/views on the matter. set expression/phrase\na phrase in which the words are always used in the same order\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregular\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: sentences & expressions\nset adjective\n(STUDY)\n[ before noun ] UK used to describe a book or writer that must be studied for a particular course: The students are reading \"Lord of the Flies\" as one of their set books this year. Eventually, he became a set author in Australian schools. See also\nset text\nSMART Vocabulary: related words and phrases\nClasses & courses\nacademic year\naccess course\nadvanced\nAdvanced Placement\nasynchronous\nfield trip\ngrind\nhomework\nHyFlex\nimmersion course\ninterdisciplinarity\ninterdisciplinary\nnon-class\nnon-degree\nopen admissions\nopen classroom\nplacement\nprep\nwork placement\nworkshop\nSee more results »\nIdioms\nbe (dead) set against something\nbe set fair\nbe set in your ways\nbe set on/upon something\nset verb\n(PUT)\nAdd to word list\nAdd to word list\n[ T always + adv/prep ] present participle setting | past tense and past participle set to put something in a particular place or position: Set the box on its end. Our house is set back from the road.\n[ T always + adv/prep ] present participle setting | past tense and past participle set If you set something down, you put it on a surface: [ M ] She set down her teacup and leaned forward.\n[ T always + adv/prep ] present participle setting | past tense and past participle set If you set a story in a particular place or time, the events happen then or there: Banks’s novel is set in the years before the Civil War.\nset verb\n(CAUSE A CONDITION)\npresent participle setting | past tense and past participle set to cause someone or something to be in a particular condition, or to begin doing something: [ T ] He carelessly dropped a match and set the grass on fire. [ T ] His remarks set me thinking. [ L ] The wildness in her paintings is what sets them apart. [ + to infinitive ] With the deadline only a few weeks away, I set to work right away.\nset verb\n(ARRANGE)\n[ T ] present participle setting | past tense and past participle set to arrange or adjust something so it is ready to work or be used: I’ve set the clock to daylight savings time. To get rid of mice, set a trap – or get a cat. My job is to set the table before dinner (= arrange the plates, utensils, etc.).\nset verb\n(ESTABLISH)\n[ T ] present participle setting | past tense and past participle set to establish a pattern or example to follow: Parents should try to set a good example. The governor wants to set spending limits. She set a new world record at the Wannamaker Games.\nset verb\n(BECOME FIXED)\n[ I/T ] present participle setting | past tense and past participle set to cause something to become fixed or firm: [ T ] Have they set a date for the wedding yet? [ I ] Glue that sets quickly makes it easier to repair things. [ T ] The old man’s face was set in a continual scowl.\n[ I/T ] present participle setting | past tense and past participle set If you have your hair set, you have it arranged while it is wet so that it will stay in a particular style when it is dry.\n[ I/T ] present participle setting | past tense and past participle set If a stone is set, it is fixed in a piece of jewelry: [ T ] The blue stone was set in a gold ring.\n[ I/T ] present participle setting | past tense and past participle set When a broken bone is set, it is kept in a fixed position so that it can heal.\nset verb\n(MOVE DOWN)\n[ I ] present participle setting | past tense and past participle set (esp. of the sun or moon) to sink in the sky until it cannot be seen: The sun sets with a great show of color.\nIdioms\nset foot in (some place)\nset something in motion\nset your mind to something\nset sail\nset your sights on something\nset someone straight\nset your teeth on edge\nset the stage (for something)\nset the tone (for something)\nset something to music\nMore idioms\nset up shop\nPhrasal verbs\nset about something\nset something against something\nset someone against someone/something\nset someone/something apart\nset aside something\nset aside something\nset someone back (something)\nset back someone/something\nset down something\nset forth something\nMore phrasal verbs\nset in\nset someone/something on someone\nset off\nset off something\nset out\nset out something\nset out something\nset up something/someone\nset up something\nset up someone\nset noun\n(PLAY BACKGROUND)\n[ C ] something built or put together to represent a place where the action happens in a play or movie: The set looks just like a real subway car.\nset noun\n(GROUP)\n[ C ] a group of things that belong together or are used together: a chess set a number set She has a strange set of symptoms.\n[ C ] A set is also a group of people who have similar interests and spend time together: the golf-playing set\n[ C ] In tennis, a set is a group of games between the same competitors: The match was over quickly, four sets to two.\nset noun\n(TELEVISION)\n[ C ] a television: I walked in the room and turned off the set.\nset noun\n(POSITION)\n[ C/U ] a position or an arrangement, esp. of the hair or body: [ U ] I could tell from the set of his jaw that he was angry. [ C ] Could you give my hair a set like the one in the picture in this magazine?\nset adjective [not gradable]\n(READY)\nwith everything arranged; ready: [ + to infinitive ] Katy is set to go to college in September. Is everything all set for the party?\nset adjective [not gradable]\n(FIXED)\nfixed or firm: There wasn’t a set time for us to get there.\nIf you are set on something, you have firmly decided about it: HMOs are good if you aren’t set on one specific doctor. Idioms\nset in stone\nset in your ways\nAdd to word list\nAdd to word list\n[ T ] to arrange or decide on something: set a date/time Have you set a time for the next meeting?set a price/rate Individual franchises set their own prices.set sth at sth The initial annual bonus rate has been set at 6.75%. Have they set a deadline for applications?set a limit (on sth) The government has set new limits on spending. The state should look for a better way to set annual salaries. We must continue to set clear priorities.\n[ T ] to state a goal or standard that people should try to achieve: set a goal/target/standard When it comes to safety, we will set high standards and enforce them.\n[ T ] to give someone a task or piece of work to do, or tell them what they must achieve: set sb sth She was set the task of looking for ways to cut costs.set sb a goal/target/challenge Analysts said the bank had set itself a tough target of increasing its revenues by 6% per annum.\nset up shop\nCOMMERCE\n&#160; informal to start a new business: They left for Switzerland and set up shop in Geneva. See also\noffset\nsetback\nset-offPhrasal verbs\nset about sth\nset sth (off) against sth\nset sth aside\nset sb back (sth)\nset sth/sb back\nset sth down\nset sth forth\nset sth off\nset out\nset sth out\nMore phrasal verbs\nset up\nset sb up\nset sth up\na group of similar things that belong together in some way: a set of sth We have laid out a set of principles to help leaders translate their values into actions. See also\nskill set\n[ before noun ] fixed or never changing: a set price/amount There is no set date for the announcement.\n[ after verb ] ready or likely to happen: be set to do sth Fears that interest rates are set to rise have knocked stock markets around the world. Two new factories are set to open next year.be set for sth The euro could even be set for a rapid recovery."}