{"id":326918,"name":"setback","type":"noun","us_sound":"ˈset.bæk","us_link":"../audio/s/setback.mp3","uk_sound":"ˈset.bæk","uk_link":"../audio/s/ukservi015.mp3","content":"Add to word list\nAdd to word list\nC1 something that happens that delays or prevents a process from developing: Sally had been recovering well from her operation, but yesterday she experienced/suffered a setback. There has been a slight/temporary setback in our plans. Synonyms\nblow\nhitch (PROBLEM)\nreversalSee also\nset something/someone back\nset something back\nThesaurus: synonyms, antonyms, and examples\na problemproblemWhat's the problem here?difficultyThe company is having some financial difficulties at the moment.troubleWe've had a lot of trouble with the new computer system.hitchThe ceremony went without a hitch.glitchWe've had a few technical glitches, but I'm confident we'll be ready on time.hurdleGetting a work permit is only the first hurdle.\nSee more results »\nSMART Vocabulary: related words and phrases\nDifficult things and people\na (heavy) cross to bear idiom\nalbatross\nball and chain\nbane\nbe dead meat idiom\nbe in the clear idiom\nbump\nequation\nhindrance\nhot potato\nimpediment\nincubus\nmarathon\nnut\nteaser\nteething troubles\nthe tip of the iceberg idiom\nthorn in your flesh/side idiom\ntie someone up\ntwist\nSee more results »\nAdd to word list\nAdd to word list\nsomething that causes delay or stops progress: Democrats suffered a serious setback in yesterday’s election, losing all three contested seats.\nAdd to word list\nAdd to word list\nsomething that happens that causes a delay or prevents a process from continuing: He suffered a setback yesterday in his attempts to take a stake in the mobile phone company.a setback to/for sth The new rule was a setback to smaller cable operators thinking of selling to other companies. a major/serious setback The decision is the latest in a series of setbacks for the industry.\nSTOCK MARKET, FINANCE a fall in prices on a stock or financial market: The mail order group suffered a 17p setback to 366.5p. Small companies are less likely to be diversified so setbacks in a single sector are more likely to wipe them out."}