{"id":326980,"name":"settlement","type":"noun","us_sound":"ˈset̬.əl.mənt","us_link":"../audio/s/settlement.mp3","uk_sound":"ˈset.əl.mənt","uk_link":"../audio/s/ukservi022.mp3","content":"settlement noun\n(AGREE)\nAdd to word list\nAdd to word list\nC1 [ C or U ] an official agreement that finishes an argument: It now seems unlikely that it will be possible to negotiate/reach a peaceful settlement of the conflict. As part of their divorce settlement, Jeff agreed to let Polly keep the house.\nThesaurus: synonyms, antonyms, and examples\na decision or arrangement between groups or peopleagreementDo we have an agreement?understandingWe had an understanding that the businesses would merge, but never got that in writing.gentleman's agreementHe and his builder have a gentleman's agreement that if there are spare materials left after working on the flat, the builder can take them home.dealDo we have a deal?contractThe basketball player was signed to a multimillion-dollar contract with a new team this week.accordThe leaders of the four countries signed a peace accord.\nSee more results »\nC2 [ C ] an arrangement to end a disagreement involving a law having been broken, without taking it to a law court, or an amount of money paid as part of such an arrangement: They reached an out-of-court settlement. The actor accepted a settlement of $100,000 from the magazine.\nMore examplesFewer examplesLack of willingness to compromise on both sides is the main stumbling block to reaching a settlement.This settlement will resolve one of the most vexatious problems in the field of industrial relations.Employers have reached a settlement over new working practices.\nSMART Vocabulary: related words and phrases\nInternational relations: diplomacy & mediation\nambassador\nambassadorial\nappease\nappeasement\nattaché\ndiplomatic\ndiplomatic bag\ndiplomatic corps\ndiplomatic immunity\ndiplomatic relations\nintermediary\nintermediation\ninternationalist\ninterventionism\nlegation\npeacemaker\nplenipotentiary\nshuttle diplomacy\nundiplomatic\nundiplomatically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing\nCourt cases, orders & decisions\nsettlement noun\n(HOME)\nC2 [ C or U ] a place where people come to live or the process of settling in such a place: A large Roman settlement has been discovered just outside the French town. Many Native Americans were killed during the settlement of the American West by Europeans in the 19th century.\nSMART Vocabulary: related words and phrases\nTowns & regions: towns, cities & villages (general)\naerotropolis\nanti-city\nanti-urban\nbackwater\nCantabrigian\ncentral city\nconurbation\ndormitory town\ngarden city\nmetro\nmunicipal\nnative place\nnon-municipal\nopen city\nretirement community\nretirement village\nsmall-town\nsmoke\nurban\nurbanite\nSee more results »\nsettlement noun\n(PAYMENT)\n[ C or U ] the action of paying money to someone: The settlement of his debts took him several months. I enclose a cheque in settlement of your claim.UK Her mother made a settlement on her (= made a formal arrangement to give her money) when she started college.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nsettlement noun\n(MOVEMENT LOWER)\n[ U ] the process of the slow sinking of a building or the ground\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nspiral\ntouch\ntouch down\nSee more results »\nsettlement noun\n(PAYMENT)\nAdd to word list\nAdd to word list\n[ C/U ] payment of money that is owed: [ U ] We enclose a check in settlement of your claim.\nsettlement noun\n(PLACE TO LIVE)\n[ C/U ] the act of going to live in a new place where few people have lived before, or the place where people have come to live: [ U ] Early settlement developed around a copper mine. [ C ] Permanent European settlements were established here in the 1830s.\nsettlement noun\n(AGREEMENT)\n[ C ] an official agreement that ends an argument: Both sides are working to negotiate a peace settlement.\n[ C ] A settlement is also an arrangement, often with payment of money, to end a legal disagreement without taking it to court: The actor agreed to a $100,000 settlement from the newspaper.\nAdd to word list\nAdd to word list\n[ C or U ] an official agreement or decision that ends an argument, often involving a payment of money: negotiate/reach a settlement The lawyer negotiated an out-of-court settlement of $2 million.\n[ C or U ] payment of a debt: in settlement of sth I wrote a check for $200 in settlement of my debts. Be sure to make full and final settlement by the repayment deadline.\n[ U ]\n&#160; FINANCE, STOCK MARKET the process by which shares and money are exchanged at the end of a day of trading on a financial market: The Stock Exchange has an electronic share settlement system.\n[ U ] the process by which payments are made on cheques: This charge is made for the returned cheque due to insufficient funds for cheque settlement. See also\nthe Bank for International Settlements\ncash settlement\nrolling settlement"}