{"id":327053,"name":"severe","type":"adjective","us_sound":"səˈvɪr","us_link":"../audio/s/severe.mp3","uk_sound":"sɪˈvɪər","uk_link":"../audio/s/ukseven007.mp3","content":"severe adjective\n(VERY SERIOUS)\nAdd to word list\nAdd to word list\nB2 causing very great pain, difficulty, worry, damage, etc.; very serious: a severe chest infection/leg injury/toothache This is a school for children with severe learning difficulties. In parts of Africa there is a severe food/water shortage. There is expected to be a severe frost tonight. Severe cutbacks in public spending have been announced.\nThesaurus: synonyms, antonyms, and examples\npainfulpainfulHer ankle was still painful if she put weight on it.soreMy feet are sore from walking around all day.tenderThe glands in my neck feel really tender.sensitiveMy face was bright red and sensitive to the touch.excruciatingHis injury caused excruciating headaches.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nhaving a bad result or outcomeseriousHer condition is not thought to be serious.badHe got a bad case of food poisoning.bigOnline fraud is a big problem.majorIt's not a major problem, but it does need to be taken care of.graveThe public are in grave danger.\nSee more results »\nextreme or very difficult: This will be a severe test of our strength.\nMore examplesFewer examplesThey confessed, but only under severe constraint.The latest trade figures have dealt a severe blow to hopes of an early economic recovery.The stock market crash marked the start of a severe depression.This year a severe drought has ruined the crops.In cases of severe mental handicap, constant supervision is recommended.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nseriously\nstringent\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplicated and difficult to do\nsevere adjective\n(NOT KIND)\nB2 not kind or showing sympathy; not willing to accept other people's mistakes or failures: The headteacher spoke in a severe voice. The president is currently facing severe criticism. There are severe penalties for failing to declare all your income to the Inland Revenue.\nSMART Vocabulary: related words and phrases\nUnkind, cruel & unfeeling\nacerbic\nacerbically\nacerbity\nacidly\nanti-cruelty\ncold-heartedly\ncruel\ncruelly\ncruelty\ncutthroat\nmeanly\nmeanness\nmental cruelty\nmerciless\nmercilessly\ntrenchant\ntrenchantly\nuncharitable\nuncharitably\nunchristian\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSevere\nsevere adjective\n(PLAIN)\noften disapproving completely plain and without decoration: She wore a severe black dress, and plain black shoes. I don't like these severe modern buildings.\nSMART Vocabulary: related words and phrases\nPlain and ordinary\nas it comes idiom\naustere\nausterely\nausterity\naverage Joe\ngeneralized\nhomeliness\nhomely\nhomespun\nhomey\nrun-of-the-mill\nseverely\nsimple\nsomething/nothing to shout about idiom\nsparely\nunostentatiously\nunremarkable\nunremarkably\nwell trodden\nworkaday\nSee more results »\nsevere adjective\n(VERY SERIOUS)\nAdd to word list\nAdd to word list\ncausing great pain, difficulty, damage, etc.; very serious: a severe earthquake The family faced severe challenges when he lost his job.\nsevere adjective\n(NOT KIND)\nnot kind or sympathetic; harsh: severe criticism"}