{"id":327373,"name":"shadow","type":"noun","us_sound":"ˈʃæd.oʊ","us_link":"../audio/s/shadow.mp3","uk_sound":"ˈʃæd.əʊ","uk_link":"../audio/s/uksexua020.mp3","content":"shadow noun\n(DARKNESS)\nAdd to word list\nAdd to word list\nB1 [ C ] an area of darkness, caused by light being blocked by something: The children were playing, jumping on each other's shadows. Jamie followed his mother around all day like a shadow.cast/throw a shadow The sun shone through the leaves, casting/throwing shadows on the lawn.in shadow This corner of the room is always in shadow (= slight darkness).\nLerrynPics/Moment/GettyImages the shadows [ plural ]\nan area of darkness in which people and things cannot be seen: Someone jumped out of the shadows and grabbed my handbag.\nSee more\n[ C ] a small dark area of skin under your eye: She put on some make-up to cover the dark shadows under her eyes. be in/under the shadow of something\nto be very close to a larger building or place: His workshop was in the shadow of the great church of San Paolo Maggiore.\nto be in a situation in which something unpleasant either seems likely to happen and to have a bad effect on your life, or is already having a bad effect on your life: be in/under the shadow of war We are all living under the shadow of war.\nSee more\nMore examplesFewer examplesThe setting sun cast long shadows across the lawn.Someone was lurking in the shadows.The shadows deepened as the evening drew on.The tree cast a shadow over his face.A shadow fell over her work and she looked up to see who was there.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshade\nshaded\nshadily\nshadowily\nshadowy\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe eye & surrounding area\nshadow noun\n(SMALL AMOUNT)\n[ S ] a small amount: It is a tragic story, but there is a shadow of hope.shadow of doubt There isn't a shadow of doubt that you've made the right decision. beyond/without a shadow of (a) doubt\nC2 If something is true beyond a shadow of (a) doubt, there is no doubt that it is true: This is without a shadow of a doubt the best movie I've seen all year.\nSee more\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nhint\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\nSee more results »\nshadow noun\n(FOLLOW)\n[ C ] someone who follows another person everywhere: \"I think we have a shadow on our tail,\" muttered the detective. Ever since he was able to walk, Stephen has been his older brother's shadow (= has followed him and copied his actions).\n[ C ] UK a person who follows someone else while they are at work in order to learn about that person's job\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\nasset\ndebug\nindustrial espionage\ninsider\nintel\nintelligence\nMI5\noperative\nscout\nsecret service\nsleuthing\nsnoop\nsnoopy\nspook\nspy\ntail\nthe CIA\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmployees & colleagues\nIdioms\nbe afraid of your own shadow\nbe a shadow/shell of your former self\nbe in/under someone's shadow\ncast a shadow/cloud over/on something\nshadow verb [T]\n(FOLLOW)\nto follow closely: The police think that the robbers shadowed their victims for days before the crime. The euro has closely shadowed the dollar.\nThesaurus: synonyms, antonyms, and examples\nto follow someone or somethingfollowFollow me - this way!tag alongDo you mind if my little brother tags along?chaseHe was running and the dog was chasing him.pursueThe robber was pursued by several members of the public.tailThe car was tailed by police for several hours.shadowThe police think the robbers shadowed their victims for days before the crime.\nSee more results »\nto follow someone else while they are at work in order to learn about that person's job: Your first week in the job will be spent shadowing one of our more experienced employees.\nSMART Vocabulary: related words and phrases\nPursuing\nbe hot on someone's track/trail idiom\nbe on someone's tail idiom\nbear\nbear down on someone/something\nbring\nbring up the rear idiom\nconvoy\nflight\nhound\nhumbug\nin hot pursuit idiom\non the scent idiom\npester\npursue\nstick\ntailgating\ntargetable\ntrack\ntrack and trace\ntrail\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLearning & knowing\nshadow verb [T]\n(DARKNESS)\nto produce a shadow: We came across a glade shadowed by large trees.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshade\nshaded\nshadily\nshadowily\nshadowy\ntwilight\nSee more results »\nshadow verb [T]\n(SADNESS)\nto make a person unhappy or to make their life less happy: Mental illness had shadowed him for more than a decade.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\nused in the title of important politicians in the main opposition party (= the party not in government): the Shadow Foreign Secretary the Shadow Cabinet\nSMART Vocabulary: related words and phrases\nGovernment ministers & civil servants\naide\nam\nattorney general\nbackbencher\ncabinet\nForeign Secretary\nfunctionary\ngovernment\nHome Secretary\ninterministerial\npress secretary\nprivate member\nprivate secretary\nPrivy Councillor\nprocurator\nsupervisor\nSurgeon General\nsyndic\ntown clerk\nundersecretary\nSee more results »\nshadow noun\n(DARKNESS)\nAdd to word list\nAdd to word list\n[ C/U ] an area of darkness caused when light is blocked by something, usually in a shape similar to the object that is blocking the light: [ C ] Chloë kept jumping on Tyler’s shadow. [ U ] This corner of the room is always in shadow. [ C ] He was standing in the shadows (= a dark area).\nshadow noun\n(SMALL AMOUNT)\n[ C ] a small amount: He saw a shadow of malice in her dark eyes. Are you convinced beyond a shadow of a doubt? Idioms\na shadow of your former self\nin the shadow of someone\nshadow verb [T]\n(FOLLOW)\nto follow someone closely: Matsuoka was shadowed by a security officer.\nAdd to word list\nAdd to word list\nHR to spend time with someone who is doing a particular job so that you can learn how to do it: All trainees are expected to spend a week shadowing an experienced manager.\nto behave in the same way or move in the same direction as something else: The cost of goods and services will shadow the recent rise in oil prices.\nPOLITICS in the UK, used to describe a leading member of Parliament whose party is not in power but who would be part of the cabinet (= people who are in charge of a department and make the main decisions) if their party were in power: the shadow Foreign Secretary"}