{"id":327349,"name":"shade","type":"noun","us_sound":"ʃeɪd","us_link":"../audio/s/shade.mp3","uk_sound":"ʃeɪd","uk_link":"../audio/s/uksexua016.mp3","content":"shade noun\n(SLIGHT DARKNESS)\nAdd to word list\nAdd to word list\nB1 [ U ] slight darkness caused by something blocking the direct light from the sun: The sun was hot, and there were no trees to offer us shade.in/under the shade of The children played in/under the shade of a large beach umbrella. See also\nsunshade\nShelly Chapman/Moment/GettyImages\nC2 [ C ] a covering that is put over an electric light in order to make it less bright: The lamps all had matching purple shades.\nThomas Golden/EyeEm/GettyImages\n[ U ]\n&#160; art\n&#160; specialized (also shading) the parts of a picture or painting that the artist has made slightly darker than the other parts: light and shade A good artist can produce a very realistic effect using only light and shade. shades [ plural ] informal\n→\nsunglasses : She was wearing a black leather jacket and shades.\nSee more\n[ C ] US (UK blind) a piece of material fixed onto a wooden or metal roller that can be pulled down to cover a window\nMarkYes/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesShe left the midday sun for the cool of the shade.This plant grows best in the shade.We pitched our tent in the shade.We sat in the shade of a tree, sipping tea and eating scones.The vines were trained over an arch, providing shade as well as fruit.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLighting & light fittings in the home\nPictures\nCurtains & wallpaper\nshade noun\n(DEGREE)\nB2 [ C ] a type or degree of a colour: shade of Their kitchen is painted an unusual shade of yellow/an unusual yellow shade. This hair colouring comes in several shades.pastel shade The room has been decorated in pastel shades (= soft and light colours) throughout.\n[ C ] something that is slightly different from other, similar things: shade of opinion They are hoping to satisfy all shades of public opinion.shade of meaning There are several shades of meaning in that sentence. a shade\nC1 slightly: Don't you think those trousers are a shade too tight?\nSee more shades of something/someone informal\nsaid to mean that something or someone makes you remember something or someone similar: In his speech he said - shades of Martin Luther King Jr. - that he had a dream.\nSee more\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCategories and varieties\nIdioms\nlight and shade\nput/leave someone in the shade\nshades of grey\nthrow shade\nshade verb\n(STOP LIGHT)\n[ T ] to prevent direct light from shining on something: shade your eyes I shaded my eyes from the glare of the sun. The broad avenues are shaded by splendid trees.\nSMART Vocabulary: related words and phrases\nDarkness & becoming dark\nblackness\ndarken\ndarkened\ndarkness\ndim\ndimly\ndimness\ndingily\ndingy\ndraw\ninky\nmatt\npitchy\nsemi-darkness\nshaded\nshadily\nshadow\nshadowily\nshadowy\ntwilight\nSee more results »\nshade verb\n(CHANGE)\n[ I usually + adv/prep ] to gradually change or become: shade from something into something At sunset, the sky shaded from pink into dark red.shade into Their views shade into the policies of the extreme left of the party.\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\nRelated word\nshadedPhrasal verb\nshade something in\nshade noun\n(DARKNESS)\nAdd to word list\nAdd to word list\n[ C/U ] darkness and cooler temperatures caused by something blocking the direct light from the sun: [ U ] The truck was parked in the shade.\n[ C/U ] A shade is a covering that is put over a light to make it less bright: [ C ] The lamps had matching shades.\n[ C/U ] A shade is also a cover, usually attached at the top of a window, that can be pulled over a window to block the light or to keep people from looking in.\nshade noun\n(DEGREE)\n[ C ]\n&#160; art a degree of darkness of a color: He painted the room a beautiful shade of red.\n[ C ] A shade can also mean one type among several: Simple yes-or-no questions can’t reveal all shades of opinion. Idiom\na shade\nshade verb\n(DARKEN)\n[ T ] to make part of something slightly darker: Students shade the ovals on multiple-choice tests.\nshade verb\n(CHANGE BY DEGREES)\n[ I/T ] to gradually change something, or to gradually change from one thing to another: [ I ] The sky shaded from pink into red.\nshade verb\n(BLOCK LIGHT)\n[ T ] to prevent direct light from shining on something: She shaded her eyes with her hand. The backyard is shaded by tall oaks."}