{"id":327521,"name":"shaky","type":"adjective","us_sound":"ˈʃeɪ.ki","us_link":"../audio/s/shaky.mp3","uk_sound":"ˈʃeɪ.ki","uk_link":"../audio/s/ukshake009.mp3","content":"shaky adjective\n(MOVEMENT)\nAdd to word list\nAdd to word list\nmoving with quick, short movements from side to side, not in a controlled way: Soon after it was born, the calf got up and tried to stand on its shaky legs. The child wrote her name in large shaky letters. She's recovering well from her operation, but she's still a little shaky on her feet.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshook\nshudder\nsquirm\ntoss\ntremulous\nwhip\nSee more results »\nshaky adjective\n(UPSET)\nupset: The news left me feeling a little shaky.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nwoeful\nSee more results »\nshaky adjective\n(WEAK)\nnot firm or strong: The building's foundations are rather shaky, and it could collapse at any time. We are taking these steps to try to improve the country's shaky economy. Their marriage looks pretty shaky to me. I think you're on very shaky ground with that argument. Synonyms\nunsound (WEAK)\nunstable\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nsitting duck\nsitting target\nsoft target\nsofty\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnsafe and insecure\nRelated words\nshakily\nshakiness\nshaky adjective\n(UPSET)\nAdd to word list\nAdd to word list\nfeeling upset: This was my fourth time in a plane, but I still felt shaky.\nshaky adjective\n(WEAK)\nnot firm or strong: It was a shaky marriage from the start. The building’s foundations are pretty shaky.\nShaky also means uncertain: The agreement is still shaky and hasn’t been approved yet.\nSomeone whose performance is shaky is not performing well: After a shaky start, the team started moving the ball and communicating.\nshaky adjective\n(MOVING)\nmoving with quick, short movements from side to side, not in a controlled way: His hands were shaky. She spoke in a shaky voice (= a voice that changed frequently because of emotion).\nAdd to word list\nAdd to word list\nnot in good condition or likely to fail: The government is taking these steps to try to improve the country's shaky economy. Too many mortgages were given to people with shaky credit histories. Several of the big life insurance companies are looking shaky.\non shaky ground\nin a situation in which there is a strong possibility that something might stop working, be defeated, etc.: The state's finances are still on shaky ground. I think you're on very shaky ground with that argument."}