{"id":327527,"name":"shakiness","type":"noun","us_sound":"ˈʃeɪ.ki.nəs","us_link":"../audio/s/ussewer030.mp3","uk_sound":"ˈʃeɪ.ki.nəs","uk_link":"../audio/s/ukshake008.mp3","content":"shakiness noun [U]\n(OF MOVEMENT)\nAdd to word list\nAdd to word list\nsmall uncontrolled movements caused by someone being weak, ill, nervous, etc.: The shakiness in his hands means he needs extra time to get dressed. Her voice was a little too loud - an attempt to cover her shakiness.\nsmall movements from side to side because something is not being held firmly: I was worried by the shakiness of the bridge.\nMore examplesFewer examplesWhen blood-glucose levels fall too low, hypoglycemia can result, causing shakiness, hunger, confusion and fatigue.Alcohol abuse can cause poor memory, incontinence, depression and shakiness.The shakiness of the hand-held camera made the footage seem very realistic.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshimmy\nsway\nthrash\nvibrate\nvibration\nvibratory\nwaggle\nwiggle\nSee more results »\nshakiness noun [U]\n(LIKELY FAILURE)\nthe fact of seeming weak or likely to fail: Government bonds gained popularity due to the shakiness of the US stock market. Given the shakiness of its central claim, the book is an unsatisfying read.\nMore examplesFewer examplesThe overall economic shakiness that we have been experiencing over the last 10 months has had a big impact on our business.There's a lot of shakiness in terms of confidence in the system.Besides the shakiness of the book's premise, it lacks structure or organization.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshaky\nsitting duck\nsitting target\nsoft target\nsofty\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUncertainty\nRelated words\nshaky\nshakily"}