{"id":327526,"name":"shakily","type":"adverb","us_sound":"ˈʃeɪ.kəl.i","us_link":"../audio/s/ussewer029.mp3","uk_sound":"ˈʃeɪ.kəl.i","uk_link":"../audio/s/ukshake007.mp3","content":"shakily adverb\n(OF MOVEMENT)\nAdd to word list\nAdd to word list\nin a way that involves someone shaking because of being weak, ill, etc.: The old man stood up and walked shakily across the room.\nin a way that involves small movements from side to side: The plane landed shakily at the airport.\nIf you say something shakily, your voice sounds weak or not very confident: \"What did you say?\" she asked shakily.\nMore examplesFewer examplesShe walked home shakily.He rose shakily, then put one foot in front of the other for the first time.Slowly, over a minute and a half, the camera shakily moves towards the light until it is finally clear what we are seeing.He found the matches, shakily opened the box, and spilled them everywhere. Rhodes shakily conveyed his glass to his lips. \"You scared me half to death,\" I said shakily.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflap\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakiness\nshimmy\nsway\nthrash\nvibrate\nvibration\nvibratory\nwaggle\nwiggle\nSee more results »\nshakily adverb\n(LIKELY TO FAIL)\nin a way that seems likely to be unsuccessful: The team began the game shakily. See\nshaky\nMore examplesFewer examplesHis performance last week was a vital boost for a campaign that started shakily.Her first tour in seven years started shakily this spring, with shows suddenly cancelled or postponed.It took them only six minutes to break down their opponent's shakily marshalled defence.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshaky\nsitting duck\nsitting target\nsoft target\nsofty\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUncertainty"}