{"id":327488,"name":"shake","type":"verb","us_sound":"ʃeɪk","us_link":"../audio/s/shake.mp3","uk_sound":"ʃeɪk","uk_link":"../audio/s/uksexua030.mp3","content":"shake verb\n(MOVE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to move backwards and forwards or up and down in quick, short movements, or to make something or someone do this: A young boy climbed into the apple tree and shook the branches so that the fruit fell down. Babies like toys that make a noise when they're shaken. The explosion shook buildings for miles around. [ + obj + adj ] People in southern California were shaken awake by an earthquake.shake something loose She shook her hair loose from its ribbon.shake something over something Anna shook some powdered chocolate over her coffee. Every time one of these big trucks goes by, all the houses shake.shake with The child's body was shaking with sobs.\nB2 [ I ] If you are shaking, your body makes quick short movements, or you feel as if it is doing so, because you are frightened or nervous: She was shaking as she opened the letter.shake in your shoes/boots I was shaking in my shoes/boots (= very nervous) about having to tell Dad what I'd done.shake like a leaf I was shaking like a leaf (= very nervous) before the test. shake in your boots\n(also shake in your shoes) to be very frightened or nervous: She said she was shaking in her boots when she found out the patient was a doctor.\nSee more\nC2 [ I ] If your voice shakes, it makes you sound nervous or frightened: Her voice shook as she talked about the person who attacked her. shake someone's hand (also shake someone by the hand)\nB1 to hold someone's hand and move it up and down, especially when you meet them for the first time or when you make an agreement with them: \"Pleased to meet you,\" he said, shaking my hand. \"Congratulations,\" she said, shaking the winner by the hand. She greeted him warmly and shook his hand. People often come up to him in the street to shake his hand and thank him. She embraced the mayor and shook his hand. She stopped and shook me by the hand. shake hands\nIf two people shake hands, they greet each other or say goodbye by briefly joining hands and moving them slightly up and down: shake hands with The Princess was photographed shaking hands with AIDS victims.\nSee more shake (hands) on something\nIf two people shake (hands) on something, they make an agreement by briefly joining hands and moving them slightly up and down: It seems that we have a deal, so let's shake (hands) on it.\nSee more shake your head\nB2 to move your head from side to side, in order to express disagreement, sadness, or that you do not want or believe something: I asked Tim if he'd seen Jackie lately but he shook his head.\nSee more shake your fist\nto hold your hand up in the air with your fingers and thumb bent, and move it forcefully backwards and forwards, to show that you are angry: He shook his fist at the driver who pulled out in front of him.\nSee more\nMore examplesFewer examplesScrew the lid firmly on to the jar and shake well.Turn the bottle upside down and shake it.I shook him but he didn't waken.When the plane started to shake, I feared the worst.She put out her hand to shake mine.\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nshiver\nsway\nthrash\ntremulously\nvibrate\nvibration\nvibratory\nwaggle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking short, sudden movements\nWelcoming, greeting & greetings\nGestures & gesturing\nshake verb\n(UPSET)\n[ T ] to cause to feel upset and worried: The child seemed nervous and visibly shaken. The news has shaken the whole country.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntoxic\nwipe\nSee more results »\nshake verb\n(MAKE WEAKER)\n[ T ] to make something less certain, firm, or strong: What has happened has shaken the foundations of her belief. After six defeats in a row, the team's confidence has been badly shaken.shake something (up) This discovery may shake (up) traditional theories on how mountains are formed.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nhedge\nmelt\nrelieve\nsink\nturn to jelly idiom\nundimmed\nunsubdued\nwane\nwaste away\nSee more results »\nshake verb\n(GET RID OF)\nC2 [ T ] to get rid of or escape from something: It's very difficult to shake the habit of a lifetime.shake something (off) The company has so far been unable to shake (off) its reputation for being old-fashioned.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nIdioms\nmore (...) than you can shake a stick at\nshake a legPhrasal verbs\nshake someone down\nshake someone/somewhere down\nshake down\nshake something off\nshake someone/something off\nshake out\nshake something out\nshake someone out of something\nshake someone up\nshake something up\nshake noun\n(MOVEMENT)\n[ C ] an act of shaking something: give something a shake She gave the box a shake to see if there was anything inside it.shake of \"No, no, no,\" he said with a shake of his head. the shakes [ plural ] informal\nshort, quick movements from side to side that your body makes because you are ill, are frightened, or have drunk too much alcohol: I watched her hands as she prepared coffee and she definitely had the shakes.\nSee more\nSMART Vocabulary: related words and phrases\nShaking, swinging and vibrating\nbrandish\nearth-shaking\nflappy\nflourish\nfluff\nfluff something up\nreverberative\nripple\nrock-a-bye\nshake out\nshakily\nshakiness\nshiver\nsway\nthrash\ntremulously\nvibrate\nvibration\nvibratory\nwaggle\nSee more results »\nshake noun\n(DRINK)\n[ C ] a drink made by adding fruit or other ingredients to milk or ice cream and mixing it together : She was carrying two hot dogs in one hand and a shake in the other. This place does the best banana shakes. Synonym\nmilkshakeCompare\nsmoothie (DRINK)\nDebby Lewis-Harrison/Cultura/GettyImages\n[ C ] a protein shake (= a drink made by mixing a special powder containing protein with milk or water): This shake will give you about 100 grams of protein, and should be taken immediately after your workout. That will give you a little more protein than you need, so you can cut the whey in your postworkout shake to 1 scoop.\nSMART Vocabulary: related words and phrases\nSoft drinks\napple juice\nArnold Palmer\nbitter lemon\nblackcurrant\nboba\ncream soda\ndalgona coffee\negg cream\nenergy drink\nfrappé\nnear beer\nnon-alcoholic\nnoncola\nOJ\norange juice\nslimline\nsoda pop\nsoda water\nsoft drink\nVichy water\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinks - general words\nshake noun\n(PIECE OF WOOD)\n[ C ] US a flat piece of wood split (= cut with a tool such as an axe) from a block, and then fixed in rows to make a roof or wall covering: Cedar shakes are hand split from logs and shaped with a thicker end to give a rustic appearance. Compare\nshingle\njatrax/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesWhile many people use the terms interchangeably, shingles and shakes are not the same.Generally, a shingle is sawn on both sides and is thinner at the butt than a shake.\nSMART Vocabulary: related words and phrases\nBuilding materials\nadobe\nagglomerate\nairbrick\nasphalt\nbamboo\ndrywall\nfibro\nflagged\nflagstone\nflitch\nparticle board\npaving\nprestressed\nputty\nrazor wire\ntwo-by-four\nunreinforced\nwattle\nwattle and daub\nweatherboarding\nSee more results »\nIdiom\nin two shakes (of a lamb's tail)\nshake verb\n(MOVE)\nAdd to word list\nAdd to word list\n[ I/T ] to move something backward and forward or up and down in quick, short movements: [ T ] Shake the can. [ T ] She shook Dana gently. [ T ] Cory shook some powdered sugar on her French toast. [ I ] The explosion made the ground shake. [ M ] Lily shook her long hair out (= moved her hair to make it fall loosely around her shoulders). [ M ] She shook out the tablecloth (= shook it so anything on it fell off).\n[ I/T ] If you or part of your body shakes, you make quick, short movements, or you feel as if you are doing this, because you are cold, frightened, or upset: [ I ] She was soaking wet and shaking when she when she finally got home. [ I ] Her hands shook as she opened the letter.\n[ I/T ] If someone’s voice shakes, its sound frequently changes because of fear or other emotions. shake your fist\nIf you shake your fist, you hold your hand up with your fingers and thumb closed and move it backward and forward to show you are angry: They stood at the gate, shaking their fists and shouting. shake hands\nIf two people shake hands, they greet or say goodbye by briefly joining hands and moving them slightly up and down: We shook hands and left. shake your head\nIf you shake your head, you move it from side to side to say \"no\" or show disagreement, sympathy, sadness, or that you do not believe something: Frank shook his head in disbelief. My dad shook his head, \"No, you can't go.\"\nshake verb\n(UPSET)\n[ T ] to cause someone to feel upset and troubled: Juanita was shaken and tried not to cry. The instructor was shaken by the angry e-mails she received.\nshake verb\n(WEAKEN)\n[ T ] to make someone’s beliefs less certain or strong; to weaken: Nothing shook her conviction that there was no substitute for hard work. The defense failed to shake Powell’s testimony.\nshake verb\n(GET RID OF)\n[ T ] to get rid of something, or escape from something: He couldn’t shake the feeling that Tony had another motive. I’ve had this cold all week and just can’t seem to shake it. Idioms\non shaky ground\nshake a legPhrasal verbs\nshake something up\nshake someone up\nshake down someone\nshake off something\nshake noun [C]\n(MOVEMENT)\nthe act of moving something backward and forward or up and down in quick, short movements: Give the bottle a shake. Maria answered no with a shake of her head.\ninfml A shake is a milkshake. the shakes infml\nThe shakes is a condition in which most or all of your body moves slightly from cold, fear, or illness: Just thinking about the upcoming interview gave him the shakes.\nAdd to word list\nAdd to word list\nif something shakes someone's beliefs, hopes, etc., it destroys these feelings or makes them weaker: Shareholders' hopes of a quick profit have been badly shaken by recent events. The credit crunch shook public confidence in the financial system.\nshake hands\nto hold someone's hand with one of your hands and move it up and down to greet someone or show that an agreement has been reached: shake hands with sb He waited in the lobby to shake hands with prospective customers. After signing the contract both sides shook hands.\nshake hands on sth\nto reach an agreement about something: After months of negotiation they finally shook hands on the deal.\nPhrasal verbs\nshake down\nshake sb down\nshake out\nshake sth out\nshake sth up"}