{"id":327566,"name":"shallow","type":"adjective","us_sound":"ˈʃæl.oʊ","us_link":"../audio/s/shallow.mp3","uk_sound":"ˈʃæl.əʊ","uk_link":"../audio/s/ukshake013.mp3","content":"shallow adjective\n(NOT DEEP)\nAdd to word list\nAdd to word list\nB2 having only a short distance from the top to the bottom: The stream was fairly shallow so we were able to walk across it. She told her children to stay in the shallow end (of the swimming pool). Fry the onions in a shallow pan. These beech trees have shallow roots (= roots which do not go very deep into the ground). Opposite\ndeep (TOP TO BOTTOM)\nThesaurus: synonyms, antonyms, and examples\nhaving a small distance from the bottom to the toplowThe garden was surrounded by a low hedge.shortHe's much shorter than I thought.shallowStay in the shallow end of the pool, please.low-lyingLow-lying areas are prone to flooding.squatI wish they'd tear down that squat block of flats.\nSee more results »\nconsisting of very few people or things: We are dealing with a very shallow pool of candidates.\nnot completely certain or convincing: Many natives see their rural way of life here increasingly circumscribed by outside \"environmentalists\" with shallow local roots. shallow breathing\nbreathing in which you only take a small amount of air into your lungs with each breath: Symptoms include rapid shallow breathing, dizziness, and nose bleeds.\nSee more\nMore examplesFewer examplesThe kids were splashing about in the shallow end of the swimming pool.Several different species of fish inhabit these shallow waters.We waded through a shallow river.The water was shallow so the kids were perfectly safe.In the shallow waters of the Gulf of Mexico, oil rigs attract shoals of fish.Horse owners invest millions of dollars in their stables - only to discover no more than a shallow pool of people competent to ride.Ray said Kerry's \"shallow roots \" don't make him a Coloradan.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow\nlow slung\nmini\nshort\nshort-range\nshorten\nshortness\nshorty\nshrimp\nsquatty\nstumpy\nstunted\ntitch\nundersized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSmall in number and quantity\nUncertainty\nBelievable\nshallow adjective\n(NOT STEEP)\nnot going very quickly from low to high or from high to low: The aircraft climbed at a shallow angle. She raced along the shallow slope down to the stream.\nMore examplesFewer examplesThe road continued up a shallow hill before turning eastwards.Try to hold the torch at a shallow angle to the surface.This time we laid the pipe at a shallower angle.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nsine\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nshallow adjective\n(NOT SERIOUS)\nC2 disapproving not showing serious or careful thought: I thought the film was pretty shallow. He's physically attractive, but shallow.\nSMART Vocabulary: related words and phrases\nNot showing careful thought\nairily\nairiness\nairy\nbang something out\nbash\nbash something out\nfrivolous\nfrivolously\nill-conceived\nincaution\nincautious\nnon-thinking\noff the cuff idiom\npat\npreconceived\nshallowly\nshallowness\nunconsidered\nunreflective\nunthinking\nSee more results »\nRelated words\nshallowly\nshallowness\nthe shallows [ plural ]\nthe shallow part of an area of water: in the shallows Alligators live in the shallows.\nSee more\nshallow adjective [-er/-est only]\n(NOT DEEP)\nAdd to word list\nAdd to word list\nhaving only a short distance from the top to the bottom: shallow water Transfer the tofu and broccoli to a shallow bowl.\nshallow adjective [-er/-est only]\n(NOT SERIOUS)\nnot showing serious or careful thought or real understanding: Reviewers called the book lightweight, shallow, and simplistic."}