{"id":327555,"name":"shall","type":"modal verb","us_sound":"ʃæl","us_link":"../audio/s/shall.mp3","uk_sound":"ʃæl","uk_link":"../audio/s/ukshake011.mp3","content":"shall modal verb\n(FUTURE)\nAdd to word list\nAdd to word list\nB1 old-fashioned used instead of \"will\" when the subject is \"I\" or \"we\": If you do that one more time, I shall be very angry. I shall never forget you. I'm afraid I shall not/shan't be able to come to your party.formal I shall look forward to meeting you next week. So we'll see you at the weekend, shall we (= is that right)? We shall (= intend to) let you know as soon as there's any news.\nMore examplesFewer examplesUnless the money is returned, we shall shortly be contacting our legal department.I can't afford a lawyer so I shall defend myself.I did meet him once and it was an experience I shall never forget.I shall list my objections to the plan in ascending order of importance.When we receive your instructions we shall act accordingly.\nshall modal verb\n(SUGGEST)\nA2 formal in US used, with \"I\" or \"we\", to make a suggestion: \"I'm cold.\" \"Shall I close this window?\" Shall we go out for dinner tonight? Shall I call him tomorrow?\nMore examplesFewer examplesAre you comfortable or shall I turn the heat down?\"So we'll meet at 5.30, shall we?\" \"Agreed .\"I'll leave you to get on then, shall I?Since it's such a nice day, shall we eat outside?What about Lola - shall we invite her?\nSMART Vocabulary: related words and phrases\nLinguistics: question words & expressions\namirite\nblaze\ndevil\nextent\nhow about...? idiom\nhow, what, why, etc. on earth... idiom\nin God's/heaven's name idiom\nquestion tag\ntrick\nwhat the blazes...? idiom\nwhat's something in aid of? idiom\nwhat's that (all) about (then)? idiom\nwhat's the score? idiom\nwhen\nwhenever\nwhere\nwherefore\nwhich\nwhy\nworld\nSee more results »\nshall modal verb\n(CERTAINLY WILL)\nformal or old-fashioned used to say that something certainly will or must happen, or that you are determined that something will happen: Don't worry, I shall be there to meet the train. The school rules state that no child shall be allowed out of the school during the day, unless accompanied by an adult. You shall go to the ball, Cinderella.\nMore examplesFewer examplesDon't worry - I shall make sure he comes!I shall make sure she knows.Very well then, I shall do it myself!If he won't do it, I shall do it and then there'll be trouble!I shall speak to her later.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsquarely\nwatertight\nwould\nyou can bet your life idiom\nSee more results »\nGrammar\nWill and shall: formWill and shall are modal verbs. They are used with the base form of the main verb (They will go; I shall ask her). Shall is only used for future time reference with I and we, and is more formal than will. …\nWill and shall: uses …\nShall …\nShall: forms …\nShall: uses …\nShall: typical error …\nAdd to word list\nAdd to word list\nused when referring to the future instead of \"will,\" esp. in questions: Shall we go? law Nothing in this letter shall be construed as a license to use our property. Note: In the past, as taught in schools, the future tense in English was formed with \"shall\" in the first person – I shall go, we shall go – and \"will\" in the second and third persons – you will go, Mary will go, they will go. In modern American English, \"will\" is commonly used in speech and writing for all three persons – I will go, etc. \"Shall\" is used mainly in formal situations with the first person – We shall be pleased to accept your invitation – and in legal documents."}