{"id":327577,"name":"shallowly","type":"adverb","us_sound":"ˈʃæl.oʊ.li","us_link":"../audio/s/usshale003.mp3","uk_sound":"ˈʃæl.əʊ.li","uk_link":"../audio/s/ukshake014.mp3","content":"shallowly adverb\n(NOT DEEPLY)\nAdd to word list\nAdd to word list\nin a way that measures only a short distance from the top to the bottom, or from where something is to the ground or surface: There were a few shallowly planted flowers. The holes had been dug too shallowly.\nin a way that is not completely certain or convincing: His faith turned out to be shallowly rooted. The few period details seem shallowly planted: brief talk of the Korean War, a sprinkling of song and movie titles, an unmarried-pregnancy scandal or two.\nin a way that involves taking in only a small amount of air with each breath: He was breathing shallowly from the excitement.\nMore examplesFewer examplesTo avoid baking in the dry sun, sunbathers lie in the pool on shallowly submerged platforms.The site contains skeletons of people who appear to have been hastily and shallowly interred.In some countries, democracy has turned out to be shallowly rooted.You can almost feel the audience breathing shallowly, so as not to miss a thing.\nSMART Vocabulary: related words and phrases\nLow, short and shallow\nbrief\nfubsy\nknee-high\nlevel\nlong\nlongish\nlow\nlow slung\nmini\nshort\nshorten\nshortness\nshorty\nshrimp\nsnubby\nstumpy\nstunted\ntitch\nundersized\nunraised\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUncertainty\nBelievable\nAnimal physiology: breathing & stopping breathing\nshallowly adverb\n(NOT SERIOUSLY)\nin a way that does not show serious or careful thought: The show features a wide, if shallowly portrayed, cast of characters. Live shallowly, and you will find yourself surrounded by shallow people.\nMore examplesFewer examplesThe melodrama of the threatened friendship is handled shallowly but engagingly.Visual art is not like a novel in that you can consume the whole thing at a glance, albeit shallowly.\nSMART Vocabulary: related words and phrases\nNot showing careful thought\nairily\nairiness\nairy\nbang something out\nbash\nbash something out\nfrivolous\nfrivolously\nill-conceived\nincaution\nincautious\nnon-thinking\noff the cuff idiom\npat\npreconceived\nshallow\nshallowness\nshoot from the hip idiom\nunreflective\nunthinking\nSee more results »\nRelated word\nshallow"}