{"id":327613,"name":"shame","type":"noun","us_sound":"ʃeɪm","us_link":"../audio/s/shame.mp3","uk_sound":"ʃeɪm","uk_link":"../audio/s/ukshake027.mp3","content":"shame noun\n(BAD LUCK)\nAdd to word list\nAdd to word list\nA2 [ S ] If something is described as a shame, it is disappointing or not satisfactory: [ + that ] It's a (great/real) shame that the event had to be cancelled. [ + to infinitive ] Have some more vegetables - it would be a shame to waste them. \"Douglas had to miss the school concert because he was ill.\" \"Oh, what a shame/that's a shame!\"\nMore examplesFewer examplesWhat a shame that you couldn't go to the party.\"I'm afraid I can't come tonight.\" \" Oh, that's a shame.\"It's such a shame they shut that factory down.\"Go on, finish off this tart, Paul.\" \"Well, it seems a shame to let it go to waste.\"It seems a shame to miss such a nice occasion.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nstreak\nunlucky\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nshame noun\n(BAD FEELING)\nC1 [ U ] an uncomfortable feeling of guilt or of being ashamed because of your own or someone else's bad behaviour: He said he felt no shame for what he had done.hang/bow your head in shame The children hung/bowed their heads in shame.shame of The shame of the scandal was so great that he shot himself a few weeks later.have no shame You can't go out dressed like that - have you no shame (= don't you feel ashamed about being dressed like that)?\n[ U ] loss of honour and respect: He thinks there's great shame in being out of work and unable to provide for his family.bring shame on In some societies, if a woman leaves her husband, it brings shame on her and her family. put someone to shame\nUK to make someone feel ashamed: It puts me to shame that I still haven't replied to David's letter.\nSee more to my shame\nI feel ashamed because: To my shame, I never wrote and thanked Mary for her present.\nSee more shame on you\nused to tell someone that they should feel sorry for something they did: shame on you for Shame on you for being so mean.\nSee more\nMore examplesFewer examplesHe knew he'd done something wrong and hung his head in shame.He went scarlet with shame and embarrassment.Her face burned with shame.The shame of losing a game of tennis to my mother!I couldn't treat anyone so badly - I couldn't bear the shame.\nSMART Vocabulary: related words and phrases\nSadness and regret\naw\nbe/weigh on your conscience idiom\nbitter\nblack dog\nbreastbeating\ncry\ndistress\nfeel bad idiom\ngloominess\nglumness\ngroan\nguilt\nprick\nprick someone's conscience idiom\nregretful\nregretfully\nremorse\nrepentant\nwrench\nwretchedness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHumiliating and degrading\nshame noun\n(COMPARE WELL)\nput someone/something to shame\nto make someone or something seem not good by comparison: Your cooking puts mine to shame.\nSee more\nIdiom\ndie of shame\nshame verb [T]\n(BAD FEELING)\nto make someone feel ashamed, or to make someone or something lose honour and respect: It shames me that I treated her so badly. The behaviour of a few children has shamed the whole school.\nto publicly criticize and draw attention to something someone has done, especially on the internet: A girl has shamed her library for saying she couldn't take part in a \"boys only\" robotics course. shame someone into/out of something\nto cause someone to do or not to do something by making them feel ashamed: [ + -ing verb ] The city council was shamed into taking action after criticism in the national and local media.\nSee more\nSMART Vocabulary: related words and phrases\nHumiliating and degrading\nabase\nabasement\nbe under a cloud idiom\nbring/take someone down a peg (or two) idiom\nbruise someone's ego idiom\ndisgraced\ndishonour\ndishonourable\ndishonourably\ndoghouse\nignoble\nignobly\nignominious\nignominiously\nignominy\nshoddily\nshoddiness\nshoddy\nstoop\nstoop to something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChastising & rebuking\nshame verb [T]\n(COMPARE WELL)\nto be so much better than something else that the other thing seems of a low standard by comparison: The school's exam results shame those of the other schools in the area.\nSMART Vocabulary: related words and phrases\nSurpassing in quality or number\ncatch\ncatch (someone) up\ncompare\ncrown\ncrush\ndo something for an encore idiom\neclipse\nencore\noutcompete\noutdo\noutflank\noutgo\noutman\npush the envelope idiom\nput/leave someone in the shade idiom\nshade\nsteal\nsteal a march on someone idiom\nsteal someone's thunder idiom\nsurpass\nSee more results »\nused to express disapproval of something that a public speaker is saying: To cries of \"Shame!\", the minister announced that taxes were being increased.\nSMART Vocabulary: related words and phrases\nLinguistics: interjections\naiyo\nattaboy\nattagirl\nauf Wiedersehen\naw shucks\ndoctor\neat your heart out idiom\nfigure\nmazel tov\nmore\nmore power to your elbow! idiom\nneed\nneed I say more? idiom\nperiod\nsmall wonder idiom\nthe rest is history idiom\nyou should have seen/heard something/someone idiom\nyou the man! idiom\nyuk\nyum yum\nSee more results »\nshame noun [U]\n(GUILT)\nAdd to word list\nAdd to word list\nan uncomfortable feeling of guilt or of being ashamed because of your own or someone else’s bad behavior: He pointed out that society needed to restore a sense of shame about certain things.\nshame noun [U]\n(MISFORTUNE)\nan unlucky or disappointing situation: What a shame that they left just before we arrived. [ + to infinitive ] Have some more vegetables – it would be a shame to waste them. Idiom\nshame on you\nto make someone feel guilty or ashamed: My aunt told us that in her day women who weren’t married by the age of 25 were considered \"old maids\" and were so shamed by their families that they would do anything to get married."}