{"id":327736,"name":"shape","type":"noun","us_sound":"ʃeɪp","us_link":"../audio/s/shape.mp3","uk_sound":"ʃeɪp","uk_link":"../audio/s/ukshame017.mp3","content":"shape noun\n(FORM)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the particular physical form or appearance of something: Clay can be moulded into almost any shape. These bricks are all different shapes.in the shape of Kim's birthday cake was in the shape of a train.in shape Our table is oval in shape.out of shape My bicycle wheel is bent out of shape.lose its shape This T-shirt has been washed so many times that it's lost its shape (= has become loose and lost its form).\nB1 [ C ] an arrangement that is formed by joining lines together in a particular way or by the line or lines around its outer edge: a round/square/circular/oblong shape A triangle is a shape with three sides. The children made patterns by sticking coloured shapes onto paper.\n[ C ] the physical form or appearance of a particular person or thing: take the shape of In the story, Faust is tempted by the Devil, who has taken the shape of a man.take a shape Life on earth takes many shapes.\n[ C ] a person or object that you cannot see clearly because it is too dark, or because the person or object is too far away: I could see a dark shape in the street outside. all shapes and sizes\nC2 many different types: all shapes and sizes of We sell all shapes and sizes of teddy bear.\nSee more in any shape or form\nof any type: I'm opposed to war in any shape or form.\nSee more\nMore examplesFewer examplesWe could see a dim shape in the fog.Ask a grown-up to cut the shape out for you.Those seven bright stars make the shape of a saucepan.This substance stretches to any shape you want.A heart shape is the symbol of love.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeometrical shapes\nConditions and characteristics\nObjects - general words\nshape noun\n(CHARACTER)\n[ U ] the way something is organized, or its general character or nature: shape of Technological developments have changed the shape of industry. We need to change the whole shape of our campaign.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nshape noun\n(CONDITION)\nB2 [ U ] condition, or state of health: in bad/poor/etc. shape He bought up businesses that were in bad/poor shape, and then sold them off piece by piece.in great shape \"How are you?\" \"Oh, I'm in great shape.\"in no shape to You're in no shape (= not in a good enough state of health) to go to work today.\nB2 [ U ] good physical condition: get something into shape It's taken us five years to get our house into shape.in shape She runs six miles every day to help keep herself in shape.out of shape I haven't had any exercise for weeks, and I'm really out of shape (= not in good physical condition).\nSMART Vocabulary: related words and phrases\nHealth in general\nattachment\nconstitutional\nexcess deaths\nexcess mortality\nfunctioning\nhealth\nhealthful\nhealthfully\nhealthily\nhealthy\nhygienic\nnon-carcinogenic\nnon-medical\npublic health\nsanitarily\nsanitary\nsanitation\nscraping\nwelfare\nwellness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nIdioms\nbe in good shape\nin the shape of something\nknock/lick something/someone into shape\nthe shape of things to come\ntake shape\nthrow shapes\nshape verb [T]\n(CHARACTER)\nC2 to decide or influence the form of something, especially a belief or idea, or someone's character: Many people are not able to shape their own destinies. My relationship with my father played a major part in shaping my attitude towards men. He was very influential in shaping the country's economic policy/strategy.\nMore examplesFewer examplesOur national identity has been shaped by our history.A child's character is in part shaped by the schools he or she attends.We are all shaped by our experiences.My whole outlook has been shaped by my relationship with him.She felt that her destiny had been shaped by her gender.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nshape verb [T]\n(FORM)\nto make something become a particular shape: The skirt has been shaped so that it hangs loosely.shape something into something When you've made the dough, shape it into two loaves.\nformal to make an object from a physical substance: shape something out of something Early humans shaped tools out of stone.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCreating and producing\nPhrasal verb\nshape up\nshape noun\n(APPEARANCE)\nAdd to word list\nAdd to word list\n[ C/U ] the particular way something looks as a whole: [ U ] Our table is oval in shape. [ C ] The birthday cake for Luis was in the shape of a heart. [ U ] These old sweatpants are all stretched out of shape (= changed from their original form).\n[ C/U ]\n&#160; art A shape is also an arrangement that is formed by joining lines together in a particular way: [ C ] A triangle is a shape with three sides.\n[ C/U ] A shape is also a person or object that you cannot see clearly because it is too dark, or because the person or object is too far away.\nshape noun\n(CONDITION)\n[ U ] (of a thing) condition, or (of a person) state of health: The city’s finances are in bad shape. I keep myself in good shape by running five miles a day.\n[ U ] Shape can also mean good physical condition: He’s in/out of shape (= in good/not in good condition). I try to stay in shape.\nshape noun\n(FORM)\n[ U ] the way something is organized; the general character or nature of something: The governor’s new program is finally beginning to take shape (= become better organized).\nshape verb [T]\n(FORM)\nto cause something to have a particular character or nature; form: We’re worried that they will try to shape the issue in a way that doesn't reflect what’s really going on. He had a major influence in shaping the government’s economic policies.\nshape verb [T]\n(APPEARANCE)\nto make something look a particular way: Shape the dough into balls. Phrasal verbs\nshape up\nshape up\nAdd to word list\nAdd to word list\nthe way that something is organized, or its general character or nature: the shape of sth Technological developments have changed the shape of industry. We need to change the whole shape of our ad campaign.\nthe condition something is in, or how strong something is: in good/great shape Our investments sailed through the recent downturn in fairly good shape with a diversified base. in bad/poor/terrible shapein no shape to do sth You should stay in bed; you're in no shape to go to work today."}