{"id":327813,"name":"sharing","type":"verb","us_sound":"ʃer","us_link":"../audio/s/share.mp3","uk_sound":"ʃeər","uk_link":"../audio/s/ukshame025.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nshare\nA2 [ I or T ] to have or use something at the same time as someone else: She's very possessive about her toys and finds it hard to share. Bill and I shared an office for years. I share a house with four other people.\nA2 [ I or T ] to divide food, money, goods, etc. and give part of it to someone else: Will you share your sandwich with me? Let's share the sweets (out) among/between everyone. We should share (in) the reward.\nB2 [ I or T ] If two or more people share an activity, they each do some of it: Shall we share the driving? We shared the preparation for the party between us, so it wasn't too much work.\nB1 [ I or T ] If two or more people or things share a feeling, quality, or experience, they both or all have the same feeling, quality, or experience: We share an interest in sailing. All hospitals share some common characteristics. I don't share your views/beliefs. The management and the union both share in the responsibility for the crisis. She knew that he was the person she wanted to share her life with.\nC1 [ T ] to tell someone else about your thoughts, feelings, ideas, etc.: He's not very good at sharing his worries. It's nice to have someone you can share your problems with. Come on, Bob, share the joke (with us).\n[ T ] to put something on a social media website so that other people can see it, or to let other people see something that someone else has put on a website : You might even recommend an article to other readers or share it on Facebook.\nMore examplesFewer examplesWe'll share the cost between us.I hate having to share a bathroom.I don't share my boyfriend's love of sport.They share the same high ideals.We share an interest in gardening.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistribution\ndistributive\ndistributively\njoint\nmate\nportion\nportion something out\nration\nration something out\nredistribute\nslice\nsplit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformal talking & conversation\nInternet terminology\nVisible\nIdioms\na problem shared is a problem halved\nshare and share alike\nsharing is caring"}