{"id":327775,"name":"share","type":"verb","us_sound":"ʃer","us_link":"../audio/s/share.mp3","uk_sound":"ʃeər","uk_link":"../audio/s/ukshame025.mp3","content":"Add to word list\nAdd to word list\nA2 [ I or T ] to have or use something at the same time as someone else: She's very possessive about her toys and finds it hard to share. Bill and I shared an office for years. I share a house with four other people.\nA2 [ I or T ] to divide food, money, goods, etc. and give part of it to someone else: Will you share your sandwich with me? Let's share the sweets (out) among/between everyone. We should share (in) the reward.\nB2 [ I or T ] If two or more people share an activity, they each do some of it: Shall we share the driving? We shared the preparation for the party between us, so it wasn't too much work.\nB1 [ I or T ] If two or more people or things share a feeling, quality, or experience, they both or all have the same feeling, quality, or experience: We share an interest in sailing. All hospitals share some common characteristics. I don't share your views/beliefs. The management and the union both share in the responsibility for the crisis. She knew that he was the person she wanted to share her life with.\nC1 [ T ] to tell someone else about your thoughts, feelings, ideas, etc.: He's not very good at sharing his worries. It's nice to have someone you can share your problems with. Come on, Bob, share the joke (with us).\n[ T ] to put something on a social media website so that other people can see it, or to let other people see something that someone else has put on a website : You might even recommend an article to other readers or share it on Facebook.\nMore examplesFewer examplesWe'll share the cost between us.I hate having to share a bathroom.I don't share my boyfriend's love of sport.They share the same high ideals.We share an interest in gardening.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistribution\ndistributive\ndistributively\njoint\nmate\nportion\nportion something out\nration\nration something out\nredistribute\nslice\nsplit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformal talking & conversation\nInternet terminology\nVisible\nIdioms\na problem shared is a problem halved\nshare and share alike\nsharing is caring\nshare noun\n(PART)\nB2 [ C or U ] a part of something that has been divided between several people: The total bill comes to €80, so our share is €20. We ought to make sure that everyone gets equal shares of the food. His share of the vote rose by 15 percentage points among Hispanics.\nB2 [ C or U ] a part of something that several people are involved in: She's not doing her share of the work. We must all accept some share of the responsibility.\nMore examplesFewer examplesOur share of the market has decreased sharply this year.We are aiming for a 50 percent share of the German market.I'm willing to do my fair share of the work.The party's share of the vote rose from 11 percent in the last election to 21 percent this time.I took my share of the profits.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistribution\ndistributive\ndistributively\njoint\nmate\nportion\nportion something out\nration\nration something out\nredistribute\nslice\nsplit\nSee more results »\nshare noun\n(PART OF A BUSINESS)\nC2 [ C ] one of the equal parts that the ownership of a company is divided into, and that can be bought by members of the public: The value of my shares has risen/fallen by eight percent. We have some shares in Apple. He invests in stocks and shares. share prices\nMore examplesFewer examplesShe buys and sells stocks and shares.They bought some shares on the London stock exchange.Following a tip-off from a friend, we sold all our shares in the company.On London's Stock Exchange, 18.5 million shares were traded yesterday.The company's shares are now virtually worthless.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nshare noun\n(SOCIAL MEDIA)\n[ C ] an occasion when someone shares something on a social media website: Her post has had over a thousand shares on Facebook.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nIdioms\ngo shares\nhave your (fair) share of something\nshare noun [C]\n(PART)\nAdd to word list\nAdd to word list\none of the parts into which something has been divided: The total bill comes to $200, so our share is $40. She’s not doing her fair share of the work.\nshare noun [C]\n(PART OWNERSHIP)\none of the equal parts into which the ownership of a company is divided: She owns 2000 shares of General Electric.\nshare verb [I/T]\n(DIVIDE INTO PARTS)\nto divide or use something with others: [ T ] Why don’t we share the salad? [ I/T ] All the employees in the company share (in) the profits. [ T ] She shares an office with Anne. [ T ] It’s a long trip – why don’t we share the driving (= each do some of it)? [ T ] Our whole family shares an interest in hiking (= We all like it). [ T ] I have an idea I’d like to share with you (= tell you).\nAdd to word list\nAdd to word list\n[ C, usually singular ] one of the parts that results when something is divided between several people, groups, etc., or a number representing that part: The total bill comes to €80, so our share is €20. The party's share of the vote fell from 39% to 24%. We must all accept some share of the responsibility.\n[ C ]\n&#160; FINANCE, STOCK MARKET one of the units that the ownership of a company, fund, etc. is divided into and which can be bought by members of the public: She buys and sells stocks and shares. The value of my shares has fallen by 8%. Share prices have gone up for three weeks in a row. have/own/hold shares in sth On the London Stock Exchange, 18.5 million shares were traded yesterday. The company is talking to its investors about issuing shares to fund the deal.\nsb's (fair) share of sth\na lot, or more than enough, of something bad: We've certainly got our share of problems at the moment. The country's economy has seen its fair share of difficult times lately.\nSee also\nadjusted share price\nadvancing share\nauthorized share capital\nbearer share\nblock noun\nbonus shares\nbrand share\ncapital share\ncommon share\nconvertible share\nView all\ncumulative preference share\ncyclical shares\ndeclining share\ndeferred share\ndelta shares\nequity share\nfractional share\nfully-paid shares\nfund share\ngolden share\ngrowth share\nheavy share\nincome share\nlisted share\nmanagement share\nmarket share\nmid-cap\nnew share\nnon-participating shares\nnon-voting\nno-par\nordinary share\noutstanding shares\nparticipating preference share\npartly-paid shares\npenny share\npreferred share\nprimary shares\nquoted share\nregistered share\nsecondary shares\nsplit share\nunderlying shares\nunit share\nunlisted shares\nvoting share\nwhen-issued share"}