{"id":327839,"name":"sharp","type":"adjective","us_sound":"ʃɑːrp","us_link":"../audio/s/sharp.mp3","uk_sound":"ʃɑːp","uk_link":"../audio/s/ukshari007.mp3","content":"sharp adjective\n(ABLE TO CUT)\nAdd to word list\nAdd to word list\nB1 having a thin edge or point that can cut something or make a hole in something: a knife with a sharp edge/blade. sharp teeth/claws/fingernails The point of this pencil isn't sharp enough.\nC2 producing or describing a quick, strong pain that makes you feel like you have been cut: She nudged me with a sharp elbow, to tell me to be quiet. I have this sharp pain in my chest, doctor.\nThesaurus: synonyms, antonyms, and examples\npainfulpainfulHer ankle was still painful if she put weight on it.soreMy feet are sore from walking around all day.tenderThe glands in my neck feel really tender.sensitiveMy face was bright red and sensitive to the touch.excruciatingHis injury caused excruciating headaches.\nSee more results »\nused to describe a part of someone's face that is very pointed: a thin face with a sharp nose\nIf someone is sharp or makes a sharp statement, they speak or act in a severe and angry way that can hurt other people: He was a little sharp with me when I asked him to help. The proposals came in for some sharp criticism.\nMore examplesFewer examplesThe doctor used a sharp instrument to dig a piece of glass out of my finger.Careful with that open tin - it's got a very sharp edge.File down the sharp edges.Shopkeepers are not supposed to sell knives and other sharp implements to children.I felt a sharp pain and looked down to see blood pouring from my leg.\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\ndull\nhone\njag\njaggy\nkeen\npointed\nprickly\nrazor-sharp\nsharpen\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nstrop\nultra-sharp\nwhet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPain & painful\nSevere\nBecoming angry and expressing anger\nsharp adjective\n(SUDDEN)\nB2 happening suddenly, quickly, and strongly: a sharp drop in temperature a sharp decline in the standard of living a sharp rise/increase in the number of cases of the disease a sharp bend in the road to suffer a sharp blow to the head\nMore examplesFewer examplesA sharp tap on the knee usually causes an involuntary movement of the lower leg.She gave me a sharp jab in the ribs with her elbow to stop me from saying any more.She pulled the bush out of the ground with a sharp jerk.The latest crime figures show a sharp rise in burglaries.Investors should not expect a sharp upturn in the economy.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunscripted\nunstarry\nunsuspected\nuntimely\nuntoward\nSee more results »\nsharp adjective\n(TASTE)\nsour in taste: Lemons have a sharp taste. This cheese is rather sharp. Synonym\nacid (CHEMICAL)\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsalty\nsavory\nsavoury\numami\nunseasoned\nunsweetened\nvelvety\nvinous\nSee more results »\nsharp adjective\n(CLEAR)\nC1 clear; easy to see or understand: This TV gives a very sharp picture. The mountains stood in sharp contrast to the blue sky. There is a sharp distinction between crimes which involve injury to people and those that don't. It was a sharp reminder of how dangerous the world can be.\nSMART Vocabulary: related words and phrases\nEasy to understand\n(as) clear as day idiom\nabundantly clear\naccessible\naccessibly\nassimilable\ndigestible\nexplicitly\nexplicitness\nexpressly\nfathomable\nhang\nin words of one syllable idiom\nlimpid\npellucidly\nperspicuity\nperspicuous\nperspicuously\npikestaff\ntaut\nwell defined\nSee more results »\nsharp adjective\n(CLEVER)\nB2 mainly approving intelligent or quick to notice things: Birdwatchers need to have sharp ears and eyes. She has a sharp eye for a bargain. Our new director is very sharp. She manages to combine a sharp mind/intellect with a sympathetic manner. He was a man of sharp wit/sharp-witted man who always spoke his mind. The play was full of sharp one-liners.US He may be old but he's still as sharp as a tack.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nSMART Vocabulary: related words and phrases\nPerceptive\nacute\nacuteness\nantenna\ncatch\neagle-eyed\neye\ngimlet\nhave an eye for something idiom\nhave/keep (all) your wits about you idiom\nhawk-eyed\nhawkish\nobservant\nperceptive\nperceptively\npercipiently\nsensate\nsensately\nsharp-eyed\nsharpness\nwit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIntelligence\nsharp adjective\n(FASHIONABLE)\ninformal fashionable: Tony is a very sharp dresser. a sharp-suited business executive\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoluminously\nvoop neck\nwaisted\nwashable\nwasp waist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nModern & fashionable\nRelated word\nsharpnessIdiom\nhave a sharp tongue\nsharp adverb\n(SUDDENLY)\nC1 suddenly or immediately: After the church, turn sharp left/right.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunscripted\nunstarry\nunsuspected\nuntimely\nuntoward\nSee more results »\nsharp adverb\n(EXACTLY)\nC1 exactly at the stated time: The performance will start at 7.30 sharp.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nslap\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntruly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAt the right time\nhigher than the correct or stated musical note: The E string on my guitar is a bit sharp. This concerto is in the key of C sharp (= the set of musical notes a semitone higher than the one based on the note C). to sing sharp Compare\nflat adjective adverb (MUSIC)\nnatural adjective (MUSIC)\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nregister\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nsharp noun [C]\n(MUSIC)\n(a symbol for) a note that is a semitone higher than the stated note\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nnote\nregister\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nsharp noun [C]\n(MEDICAL)\n[ usually plural ]\n&#160; medical\n&#160; specialized a small piece of equipment, such as a needle, that has a sharp point or edge: The safe disposal of sharps is very important. Medical providers were required to convert to safer sharps by April 16.\nSMART Vocabulary: related words and phrases\nMedical & surgical equipment\nbedpan\nbioprinting\nblood pressure monitor\nbougie\ncannula\ncatheter\ncatheterization\nclinical thermometer\nelectrocardiograph\nexoskeleton\nhypodermic\nincubator\nlaparoscope\nlaryngoscope\nlateral flow test\nmagnetic resonance imaging\nmicrocatheter\nnebulizer\nsyringe\nventilator\nSee more results »\nsharp adjective [-er/-est only]\n(ABLE TO CUT)\nAdd to word list\nAdd to word list\nhaving a thin edge or point that can cut something: a sharp blade/knife She put a sharp point on the pencil.\nsharp adjective [-er/-est only]\n(SUDDEN)\nsudden and immediately noticeable: a sharp drop in temperature a sharp increase in prices There’s a sharp curve in the road up ahead.\nsharp adjective [-er/-est only]\n(STRONGLY FELT)\nstrongly felt: As he leaned over, he felt a sudden, sharp pain in his lower back. This sauce is pretty sharp (= It has a strong taste).\nsharp adjective [-er/-est only]\n(SEVERE)\nintended to be strong enough to be felt as painful: The candidate delivered a sharp attack on her opponent’s voting record. Leonard has a sharp tongue (= often speaks in a severe and critical way).\nsharp adjective [-er/-est only]\n(CLEAR)\neasy to see or understand; clear: High-definition television produces a very sharp picture. Sales this month were up, in sharp contrast to the dismal sales of the last few months.\nsharp adjective [-er/-est only]\n(QUICK)\nable to understand or see quickly and easily: She has a really sharp mind and a great sense of humor.\nsharp adjective [-er/-est only]\n(FASHIONABLE)\ninfml fashionable: a sharp dresser sharpness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈʃɑrp·nəs/\nsharp adjective, adverb [-er/-est only]\n(MUSIC)\nmusic higher in pitch than a particular note or the correct note\nsharp adverb [not gradable]\n(EXACTLY)\nexactly at the stated time: The tour bus will leave at 8:30 a.m. sharp.\nsharp noun [C]\n(MUSIC)\nmusic a mark in written music showing that a note should be played a half step higher\nAdd to word list\nAdd to word list\na sharp change is sudden and very noticeable: a sharp rise/increase in sth Analysts expect a sharp rise in core inflation to 2.7%. The decision is likely to mean a sharp increase in regulatory fees paid by companies registered as sponsors.a sharp drop/decline/fall in sth There has been a sharp decline in the standard of living. Builders faced a sharp drop in construction spending in November.\nshowing intelligence and excellent judgement: The two are very sharp businessmen who have seen their property business move from handling small-scale office developments to schemes totaling €800 million. She is known in the media as a sharp and incisive thinker.\nsharp language is severe and angry: The CEO's proposals came in for some sharp criticism.be sharp with sb He was sharp with me when I asked him to help. Gomez's business practices came under sharp attack at the Senate hearing.\nin sharp contrast (to sth)\nin a way that is clearly recognized as different to something else: Sales were particularly strong last month, in sharp contrast to its main competitors."}