{"id":327815,"name":"shark","type":"noun","us_sound":"ʃɑːrk","us_link":"../audio/s/shark.mp3","uk_sound":"ʃɑːk","uk_link":"../audio/s/ukshari003.mp3","content":"shark noun [C]\n(FISH)\nAdd to word list\nAdd to word list\nB1 a large fish that has sharp teeth and a pointed fin on its back: a great white shark a basking shark The movie \"Jaws\" is about a man-eating shark.\nImage Source/ Image Source/GettyImages\nMore examplesFewer examplesWe could see the fin of a shark as it slowly circled our boat.Some species of shark are now endangered.\nSMART Vocabulary: related words and phrases\nSea fish\nalbacore\nAmerican shad\nanchovy\nbarracuda\nbeluga\nelver\nflatfish\nflathead\nflounder\nflying fish\nPacific salmon\npilchard\npink salmon\nplaice\npollack\nstickleback\nstingray\nstonefish\nstriped bass\nsturgeon\nSee more results »\nshark noun [C]\n(PERSON)\ninformal disapproving a dishonest person, especially one who persuades other people to pay too much money for something: People who need a place to live can often find themselves at the mercy of local property sharks.\nThesaurus: synonyms, antonyms, and examples\na dishonest personcheatShe's a liar and a cheat!cheaterUS I wouldn't play a game with him - he's a cheater.crookMy dad says that used car salesmen are just a bunch of crooks.cowboyUK The private security firm are just a bunch of cowboys looking to rough up anyone who crosses their path.fraudHe claims to be a doctor, but he's just a fraud without a medical licence.sharkThe landlord was a real shark, jacking up rents without relief.\nSee more results »\nAdd to word list\nAdd to word list\na type of large fish that has rows of sharp teeth\ninfml A shark is also a person who cheats other people, esp. if they seem trusting: a loan shark\nAdd to word list\nAdd to word list\na dishonest person, especially one who persuades other people to pay too much money for something: People who need a place to live can often find themselves at the mercy of local property sharks. See also\nloan shark"}