{"id":327969,"name":"she","type":"pronoun","us_sound":"ʃiː","us_link":"../audio/s/she.mp3","uk_sound":"ʃiː","uk_link":"../audio/s/ukshari024.mp3","content":"Add to word list\nAdd to word list\nA1 used as the subject of a verb to refer to a woman, girl, or female animal that has already been mentioned: I asked my mother if she'd lend me some money, but she said no.\nold-fashioned used instead of \"it\" to refer to a country, ship, or vehicle: After India became independent, she chose to be a member of the Commonwealth. Look at my new car - isn't she beautiful?\nMore examplesFewer examplesShe was the blond woman in the red dress.If I tell Marie she might tell Jane.When my mum comes to see us she always brings a cake.She's not as fat as her sister.She's so clever.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nthee\nthem\nthemself\nthey\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nHe, she, him, her, his, hersIn writing, we can use (s)he, he/she, him/her or his/her to refer to both sexes at the same time. When speaking formally, we say he or she and his or her: …\na female: Is this kitten a she or a he?\nSMART Vocabulary: related words and phrases\nSpecies & genders\nclade\nclass\ncliff edge\nfemale\nfemaleness\ngenera\ngenus\nhe\nholotype\nintergeneric\nmale\nmulti-species\norder\nparamecium\nphylum\nsame-gender\nspeciesism\nstrain\nsuborder\nsubspecies\nSee more results »\nRelated word\nshe-\nfemale: a she-wolf An enormous she-bear was hiding there, ready to pounce.\nMore examplesFewer examplesI read all these wild stories making me out to be a total she-devil.He crossed the room and took the slender she-cat into his arms. I saw a she-goat lying down in the shade, and two young kids sitting by her.\nSMART Vocabulary: related words and phrases\nNames for the male & female of animals\nbilly goat\nbitch\nboar\nboomer\nbuck\nbullock\ncob\ndoe\ndrake\ndrone\newe\ngelding\nhind\nmare\nsire\nsow\nstag\nstallion\nsteer\ntigress\nSee more results »\nAdd to word list\nAdd to word list\nthe female being spoken about, who has already been mentioned: I asked Barb if she’d lend me some money, but she said no. She’s such a cute dog!\nShe is sometimes used instead of \"it\" to refer to something, such as a country, vehicle, or ship, that has already been mentioned: Look at my new car – isn’t she a beauty? she noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ʃi/\nfemale The kitten is a she, not a he."}