{"id":328043,"name":"shed","type":"noun","us_sound":"ʃed","us_link":"../audio/s/shed.mp3","uk_sound":"ʃed","uk_link":"../audio/s/uksheat005.mp3","content":"Add to word list\nAdd to word list\nB2 a small building, usually made of wood, used for storing things: a tool/storage shedUK a garden/bicycle shed\nDreet Production/Alloy/GettyImages\na large, simple building used for a particular purpose: the lambing shed a cow shed\nMore examplesFewer examplesShe's planting seeds in the shed.We keep our bikes in the shed.\nSMART Vocabulary: related words and phrases\nGarden buildings & structures\nbelvedere\nbird table\nbirdbath\ncloche\ncold frame\nconservatory\nfountain\ngazebo\nglasshouse\ngreenhouse\ngrow house\nhothouse\npergola\npolytunnel\npotting shed\nsitootery\nsleepout\nwigwam\nwoodpile\nwoodshed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuildings for storing things\n(often used in newspapers) to get rid of something you do not need or want: 900 jobs will be shed over the next few months. Psychotherapy helped him to shed some of his insecurity/inhibitions. I'm going on a diet to see if I can shed (= become thinner by losing) a few pounds.\nto lose a covering, such as leaves, hair, or skin, because it falls off naturally, or to drop something in a natural way or by accident: shed its leaves The trees shed their leaves in autumn. They ran down to the water, shedding clothes as they went.UK A lorry had shed a load of gravel across the road. shed tears, blood, etc.\nC1 to allow tears or blood to flow: She shed a few tears at her daughter's wedding.\nSee more\nmedical , biology\n&#160; specialized to release a virus or bacterium from a cell or body into the environment where it can infect other people: Those who have contracted the new coronavirus shed the virus most heavily in the first few days of the illness. People shed the virus in respiratory droplets and aerosols.\nMore examplesFewer examplesShe's trying to shed her good girl image.He's managed to shed eight kilos.The bank is preparing to shed 200 branches from its 1,700 network.After a six-month diet, she's shed five inches from her hips and six inches from her waist.I was warm enough at that point to shed a few layers of clothing.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\nsling someone out\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPassing on illness & causing disease\nIdiom\nshed light on sth\nshed noun [C]\n(BUILDING)\nAdd to word list\nAdd to word list\na small building usually used for storage or shelter: The lawn mower is kept in the shed.\nshed verb\n(GET RID OF)\n[ T ] present participle shedding | past tense and past participle shed to get rid of something: As the day warmed up, she shed her sweater.\nshed verb\n(FALL OFF)\n[ I/T ] to lose hair, leaves, or skin, or to cause hair, skin, or leaves to drop: [ I ] My cat shed all over the couch. [ T ] By November, the trees had shed their leaves.\nshed verb\n(FLOW)\n[ T ] to make blood or tears flow: He didn’t shed one tear when his old car was stolen.\nshed verb\n(SPREAD)\n[ T ] present participle shedding | past tense and past participle shed to spread light: A single bulb shed a harsh light on the table. Idiom\nshed light on something\nAdd to word list\nAdd to word list\nto get rid of something you do not need or want, especially jobs or employees: There are rumors that the retailer will shed more than 400 jobs over the next year. shed workers/employees/staff\nSTOCK MARKET to lose value in the stock market or other financial markets: The stock shed another 16% of its value yesterday, closing at $15.25. The Dow Jones industrial average shed 242.66 points, or 1.97%, to close at 12,075.96.\na large simple building, usually used for storing equipment: The structure is used as a truck storage shed."}