{"id":328154,"name":"sheerly","type":"adverb","us_sound":"ˈʃɪr.li","us_link":"../audio/s/cdo0623usshee3654.mp3","uk_sound":"ˈʃɪə.li","uk_link":"../audio/s/cdo0623ukshee3677.mp3","content":"sheerly adverb\n(COMPLETELY)\nAdd to word list\nAdd to word list\ncompletely or extremely: It is a sheerly physical struggle trying to find enough water each day in order to survive. His poems are more sheerly beautiful than those of any other modern poet I can think of.\nMore examplesFewer examplesThis is the most sheerly enjoyable album of the year so far.There are moments when she is singing which are sheerly, heart-stoppingly beautiful.This will probably be the most sheerly pleasurable film on offer.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndearly\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\nsurpassingly\ntotally\nwhatever\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplete and whole\nsheerly adverb\n(ONLY)\nonly, or happening because of nothing except: Good executives are not driven sheerly by money. The deal failed sheerly due to lack of adequate access to finance.\nMore examplesFewer examplesAny further amount of money he might receive would be sheerly through chance.She was rich sheerly because she was born at the right time in history.\nsheerly adverb\n(STEEP)\nin an extremely steep way that is almost vertical: It is one of the most difficult and sheerly vertical climbs in the world. The tower, two hundred feet of marble, rises sheerly above the trees.\nMore examplesFewer examplesThe steep cliffs dropped sheerly to the sea.To the north and east, the land rose sheerly to the rocky crags surrounding the peak.The slope of the hillside descends sheerly to the sandy beach below.\nSMART Vocabulary: related words and phrases\nGeography: hills & mountains\nacclivity\nclifftop\ncraggy\nesker\nhighlands\nhillock\nMarilyn\nmesa\nmid-ocean ridge\nmotte\nMount Kilimanjaro\npinnacle\nscarp\nspur\nsteep\nthe Adirondack Mountains\nthe Alaska Range\nthe Alps\nthe Andes\nvolcano\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSlanting, sloping, leaning, tilting\nRelated word\nsheer"}