{"id":328218,"name":"shelf","type":"noun","us_sound":"ʃelf","us_link":"../audio/s/shelf.mp3","uk_sound":"ʃelf","uk_link":"../audio/s/uksheat023.mp3","content":"Add to word list\nAdd to word list\nA2 a long, flat board fixed horizontally, usually against a wall or inside a cupboard so that objects can be stored on it: a glass shelfon a/the shelf Store the remaining mixture on the top/bottom shelf of the refrigerator. One wall had shelves from floor to ceiling, crammed with books. See also\nbookshelf\nPhotography by Cathy Pyle/Moment/GettyImages\ngeology\n&#160; specialized a flat area of rock underwater or on a cliff off the shelf\nIf a product can be bought off the shelf, it does not need to be specially made or asked for: buy something off the shelf It's often cheaper if you buy wallpaper off the shelf, rather than having to order it.\nSee more remove something from your shelves\nWhen a shop removes something from its shelves, that product stops being available for sale there: They considered removing tobacco from their shelves to combat high smoking rates among teens.\nSee more\nMore examplesFewer examplesI've put the cake on a high shelf where he can't get at it.She arranged her birthday cards along the shelf.He lifted the box carefully down from the shelf.I hit my head on the shelf as I was standing up.The books were organized on the shelves according to their size.\nSMART Vocabulary: related words and phrases\nFurniture for storage\nairing cupboard\nalmirah\nbookcase\nbookshelf\nbroom closet\ncredenza\ncubby\ncubbyhole\ncupboard\ncwtch\nhatstand\nhot press\nhutch\nlocker\nottoman\ntallboy\ntrophy cabinet\nwalk-in\nwardrobe\nWelsh dresser\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: hills & mountains\nIdiom\non the shelf\nAdd to word list\nAdd to word list\na long, flat board hung on a wall or supported by a frame or cabinet, used to hold objects: Her shelves are filled with books and photographs. Idiom\non the shelf\nAdd to word list\nAdd to word list\na long flat board fixed horizontally, for example against a wall or inside a cupboard, on which objects are stored or shown for sale: In another room, stacked on every available shelf are four to five hundred large storage boxes. Supermarket shelves are filled with cheap, mass-produced food that is packed with calories. fill/refill the shelves stock/restock the shelves The manufacturer has asked retailers to remove the product from the shelves.\noff the shelf\nCOMMERCE, MARKETING if a product can be bought off the shelf, it does not need to be specially made or requested: It's often cheaper if you buy wallpaper off the shelf, rather than having to order it. The electronic components needed to make the sensors were easily available off the shelf."}