{"id":328285,"name":"shelter","type":"noun","us_sound":"ˈʃel.t̬ɚ","us_link":"../audio/s/eus74200.mp3","uk_sound":"ˈʃel.tər","uk_link":"../audio/s/uksheat028.mp3","content":"Add to word list\nAdd to word list\nB2 (a building designed to give) protection from bad weather, danger, or attack: an air-raid shelter They opened a shelter to provide temporary housing for the city's homeless.give/provide shelter from The trees gave/provided some shelter from the rain. find/take shelter\nB2 to protect yourself from bad weather, danger, or attack: find/take shelter in We took shelter for the night in an abandoned house.\nSee more\nMore examplesFewer examplesThere was no shelter from the merciless heat.The bomb shelter has concrete walls that are three metres thick.Spare a thought for all those without shelter on a cold night like this.An upturned boat on the beach provided shelter.When the air raid siren went off people ran to their shelters.\nSMART Vocabulary: related words and phrases\nSafe & enclosed spaces\nbolthole\nbooth\nbunker\nbus shelter\ncarrel\nchildproof\nchildproofing\ncocoon\ndry\nhaven\nhideaway\nhideout\nhidey-hole\nhiding place\nrefuge\nretreat\nsafe haven\nsafe house\nsanctuary\nsanctuary city\nSee more results »\nshelter verb\n(PROTECT)\nC2 [ I or T ] to protect yourself, or another person or thing, from bad weather, danger, or attack: We were caught in a thunderstorm, without anywhere to shelter.shelter from A group of us were sheltering from the rain under the trees.\nThesaurus: synonyms, antonyms, and examples\nto accommodate someoneaccommodateThere aren’t enough rooms to accommodate all the students.give accommodation toThe university gives free accommodation to nursing students.provide accommodation toWe only provide accommodation to first-year students.lodgeStudents will be lodged with host families.houseThe base can house up to 2,000 soldiers.put someone upI can put you up for a couple of nights.\nSee more results »\n[ T ] to give someone a secret hiding place so that they will not be caught by the army, police, etc.: shelter someone from something Local people risked their own lives to shelter resistance fighters from the army. shelter in place\nUS to remain in the building that you are in during an emergency such as an extreme weather event or a shooting: In most chemical emergencies people are instructed to shelter in place, closing windows and turning off air conditioners to keep out toxic fumes.\nUS to stay at home and only leave when you have to, for example to buy food, especially during an epidemic (= the appearance of a disease in a large number of people at the same time): Millions of Californians were told to shelter in place to stop the spread of coronavirus.\nSee more\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\nsheltered\nshield\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nshelter verb\n(AVOID TAX)\n[ T ] US If you shelter income, you legally avoid paying taxes on it: Their accountant suggested some novel ways of sheltering their retirement income.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nAdd to word list\nAdd to word list\nsomething that gives protection, such as a building or tent, or the protection provided: [ C ] We took the stray dog to an animal shelter. [ U ] The wall gave us some shelter from the wind. [ U ] The program offers shelter to runaway teens.\nto protect yourself, or another person or thing, from bad weather, danger, or attack: [ T ] The city feeds, clothes, and shelters the orphans. [ I ] We were caught in a thunderstorm and sheltered in a cave.\nAdd to word list\nAdd to word list\nUS if you shelter income, you find a legal way to avoid paying tax on it: shelter savings/assetsshelter sth from sb/sth The company needs to act now to shelter its assets from the taxman.\na way to legally avoid paying tax: shelter from sth These investments continue to offer shelter from capital gains tax. See also\ntax shelter"}