{"id":328475,"name":"shield","type":"noun","us_sound":"ʃiːld","us_link":"../audio/s/shield.mp3","uk_sound":"ʃiːld","uk_link":"../audio/s/ukshelv014.mp3","content":"Add to word list\nAdd to word list\nC2 in the past, a large, flat object made of metal or leather that soldiers held in front of their bodies to protect themselves\nAndrey_Kuzmin/iStock/Getty Images Plus/GettyImages\na large, flat object made of strong plastic that police officers hold in front of their bodies to protect themselves: The police held up their riot shields against the flying rocks and bricks.\nDaniel Garzón Herazo/EyeEm/GettyImages\nsomething or someone used as protection or providing protection: The anti-personnel mines were laid as a protective shield around the town. Anger can function as a shield against (= a way of avoiding) even more painful emotions of loss and hurt.\na flat object with two straight sides, a rounded or pointed lower edge, and usually a straight top edge, on which there is a coat of arms\nnicoolay/iStock/Getty Images Plus/GettyImages\nan object shaped like a shield that is used as a symbol or badge: The blazer has a shield sewn on the pocket.US When he retired from the police, he had to turn in his shield.\nwwing/iStock/Getty Images Plus/GettyImages\nUK an object shaped like a shield that is given as a prize: Our school won the county basketball shield this year.\najaykampani/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesAll the police officers were equipped with shields to defend themselves against the rioters.The front rank of the riot squad raised their shields.They had a collection of shields from many centuries ago.She's won various sporting trophies and shields.He had his family shield on the wall.\nSMART Vocabulary: related words and phrases\nHand weapons\nbattleaxe\nbayonet\nblowgun\nblowpipe\nbludgeon\ncatapult\ngoad\nhaft\nhalberd\nharpoon\nhilt\njackknife\nrapier\nsabre\nscabbard\nscimitar\nshanghai\nshank\nsheath knife\nunfond\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProtection and protectors\nSpecific signs and symbols\nPrizes, rewards and medals\nC1 [ T ] to protect someone or something: She held her hand above her eyes to shield them from the sun. They are accused of trying to shield the General from US federal investigators.\n[ T ] in football, to keep your body between an opponent and the ball, with your back to the other player, to prevent them from getting the ball: We teach young players how to step in front of the defender and use their body to shield the ball.\n[ I ] UK to protect yourself from a disease by staying at home and having as little contact as possible with people from outside your home, because you are at risk of becoming seriously ill if you get the disease: Please contact your GP if you think you should be shielding. Cancer patients need to shield from coronovirus.\nSMART Vocabulary: related words and phrases\nDefending and protecting\nanti-bug\nanti-mosquito\nbaby\nbandobast\nbastion\nbuffer\ncocoon\ndefend\ndefensive\nfight back\nfoot patrol\nharbour\nharm\nhave (got) someone's back idiom\nhold off\nshelter\nsheltered\nsplashproof\nstand/keep guard phrase\ntake someone under your wing idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFootball/soccer\nMedicines & drugs: preventing infection\nAdd to word list\nAdd to word list\na piece of metal or other material, carried to protect the front of the body when being attacked, or a person or thing that provides protection: The police held up their riot shields. The ozone layer is the earth’s shield against radiation from the sun.\nto protect someone or something: When the lights came on, I shielded my eyes with my hands, Mom tried to shield us from the bad news."}