{"id":328505,"name":"shift","type":"verb","us_sound":"ʃɪft","us_link":"../audio/s/shift.mp3","uk_sound":"ʃɪft","uk_link":"../audio/s/ukshelv015.mp3","content":"shift verb\n(MOVE/CHANGE)\nAdd to word list\nAdd to word list\nC1 [ I or T ] to (cause something or someone to) move or change from one position or direction to another, especially slightly: shift from something to something She shifted (her weight) uneasily from one foot to the other.shift (to) The wind is expected to shift (to the east) tomorrow.\nC1 [ I ] (of an idea, opinion, etc.) to change: Society's attitudes towards women have shifted enormously over the last century.shift onto Media attention has shifted recently onto environmental issues.\n[ T ] mainly US (UK usually change) to move the gears of a vehicle into different positions in order to make it go faster or slower: shift gears In cars that are automatics, you don't have to bother with shifting gears. shift house\nIndian English to leave your home in order to live in a new one; move house: I've just shifted house for the third time in three years.\nSee more\nMore examplesFewer examplesHe shifted awkwardly from one foot to the other.She shifted restlessly in her chair.She was shifting around in her seat.Fiona shifted around, looking embarrassed.He shifted his gaze back to her eyes.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChanging\nOn the road: driving & operating road vehicles\nshift verb\n(GET RID OF)\n[ T ] UK informal to get rid of something unwanted, or to sell something: Modern detergents will shift most stains. The people at the toy shop expect to shift a lot of stock in the run-up to Christmas.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSelling\nIdioms\nshift yourself\nshift (your) groundPhrasal verb\nshift for yourself\nshift noun\n(GROUP)\nB2 [ C, + sing/pl verb ] a group of workers who do a job for a period of time during the day or night, or the period of time itself: night/day shift As the night shift leave/leaves, the day shift arrive/arrives. Are you on the night shift or the day shift? (= Do you work during the night period or the day period?)\nMore examplesFewer examplesI worked the last hour of my shift on autopilot.His shift starts at seven o'clock.She's just finished a 13-hour shift at the hospital.Studies revealed that doctors were routinely working 15-hours shifts.As her shift finishes, mine begins.\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ncutter\ndrudge\nlabour force\nlabour market\nmachinist\nmanpower\nrouseabout\nsalaryman\nskeleton staff\nslogger\nthe shop floor\nworker\nworkforce\nworkhorse\nworking group\nworking party\nSee more results »\nshift noun\n(CHANGE)\nC1 [ C ] a change in position or direction: shift in a shift in the wind/temperature The shift in the balance of power in the region has had far-reaching consequences. There has been a dramatic shift in public opinion towards peaceful negotiations.\nMore examplesFewer examplesThe last few years have seen a shift in opinion on the issue.The 1990s saw a shift to democratic government in eastern Europe.Rarely has there been such a dramatic shift in American policy and tone.Opinion polls show a dramatic shift in attitude towards the environment.Recent years have witnessed a shift away from fatty foods.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nunsteady\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nshift noun\n(DRESS)\n[ C ] (also shift dress) a simple dress that hangs loosely from the shoulders\nmodustollens/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDresses, suits & gowns\nabaya\nballgown\nbandage dress\nbandeau dress\nblack tie\nghillie suit\ngown\nhimation\njilbab\njumpsuit\npinafore\npinstripe\nplaysuit\nrobe\nrompers\nsurplice\ntea dress\nthree-piece suit\ntoga\ntrouser suit\nSee more results »\nshift verb [I/T]\n(MOVE OR CHANGE)\nAdd to word list\nAdd to word list\nto change direction or move from one person, position, or place to another: [ I ] The wind shifted to the east. [ T ] She shifted her weight from one foot to the other. [ T ] He tried to shift the blame onto his sister.\nIf you shift your emphasis or attitude, you change it: [ T ] Our attention has shifted from baseball to the election.\nWhen you shift the gears of a vehicle, you move them into different positions to change the speed of the vehicle. Idiom\nshift gears\nshift noun [C]\n(PERIOD)\nthe period that a person is scheduled to work, or a group of workers who work during the same period of time: I’m working the day shift this month. The night shift is finished at 7 a.m.\nshift noun [C]\n(MOVE OR CHANGE)\na change in position or direction: There’s been a substantial shift in doctors’ methods.\nAdd to word list\nAdd to word list\n[ T ] to move something to a different place or position: shift sth to sth They shifted the money to another account.shift sth out of sth Rising costs forced them to shift manufacturing work out of Europe.\n[ I or T ] to change an opinion, idea, etc.: shift focus/emphasis/attentionshift (sth) away from sth They have shifted the emphasis of the business away from traditional manufacturing. shift (sth) towards sth The company has shifted towards a more flexible marketing mix. HR have shifted their position on overtime working and this will no longer be encouraged.\n[ T ]\n&#160; COMMERCE\n&#160; informal to manage to sell goods: At that time, Sony had shifted 30 million Playstation3 consoles since launch. The sales projections were over-optimistic and left them with $100 million of stock they couldn't shift.\n[ C ]\n&#160; HR, WORKPLACE an agreed period of time during the day or night when particular employees work, in a factory, hospital, etc.: He worked an 8 hour shift at the hospital.begin/end your shift They begin their shift at 4pm.\n[ C ]\n&#160; HR, WORKPLACE the group of workers who work at a particular time: the day/night/late shift We work until 8am, when the day shift takes over.\n[ C, usually singular ] a movement or change in something: a shift in sth There's been a major shift in strategy.a shift away from/towards sth The shift towards specialisation favours smaller firms.\n[ U ]\n&#160; IT on a computer keyboard, a key that changes the letter, number, or symbol that would normally appear when you press another key at the same time: Press shift to capitalize letters. See also\nback shift\ngraveyard shift\nnight shift\nparadigm shift\nswing shift"}