{"id":328662,"name":"shining","type":"adjective","us_sound":"ˈʃaɪ.nɪŋ","us_link":"../audio/s/ussheke029.mp3","uk_sound":"ˈʃaɪ.nɪŋ","uk_link":"../audio/s/ukshine008.mp3","content":"shining adjective\n(BRIGHT)\nAdd to word list\nAdd to word list\nsending out or reflecting light: a shining silver cup People described seeing a bright, shining light.\nThesaurus: synonyms, antonyms, and examples\nhaving or giving out strong lightbrightA bright light was shining through the gloom.shiningWe topped our Christmas tree with a shining star.brilliantThe moon shed a brilliant light over the ocean.intenseThe intense light reflecting off snow at high altitudes can damage your eyes.blazingWe stepped out of the plane into blazing sunshine.\nSee more results »\nlooking bright and happy: She looked at him with shining eyes.\nMore examplesFewer examplesThe house overlooked a shining lake.Inside was a softly shining lamp.She was a tall, slim woman in a long coat and shining leather shoes.He told me with shining eyes what this experience had meant to him.She looked out at a crowd of beaming, shining faces.\nSMART Vocabulary: related words and phrases\nThe qualities of light\naglow\nbacklit\nbrightly\nbrilliantly\ncoruscating\ndazzlingly\ndullness\nflickering\nfloodlit\nglittering\nlambent\nluminescence\nluminosity\nluminous\nlustrously\nnon-fluorescent\nnon-solar\nopalescent\novercast\nspangly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeeling pleasure and happiness\nshining adjective\n(EXCELLENT)\nexcellent in a way that people admire: These pictures are shining examples of great photography. She has a shining career ahead of her.\nMore examplesFewer examplesEvery now and again, a novelist makes a career out of just one novel - Harper Lee's To Kill a Mockingbird is the shining example.He built a shining career on discretion and trust.He is not a shining character, but he has many good qualities.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nsock\nsplendid\nsplendidly\nstellar\nstupendously\nwonderfully\nSee more results »\nRelated word\nshine"}