{"id":328697,"name":"ship","type":"noun","us_sound":"ʃɪp","us_link":"../audio/s/ship.mp3","uk_sound":"ʃɪp","uk_link":"../audio/s/ukshine014.mp3","content":"Add to word list\nAdd to word list\nA2 a large boat for travelling on water, especially across the sea: a sailing ship a merchant/naval ship They boarded (= went on to) a ship that was sailing (= leaving) the next day.\nPierre-Yves Babelon/Moment/GettyImages\nMore examplesFewer examplesThe crane lifted the container off the ship.We spent two months aboard ship .The ship sank slowly to the depths of the ocean.Hundreds of people turned up to see the ship dock at Southampton.The ship was flying the Spanish flag.\nSMART Vocabulary: related words and phrases\nPassenger, cargo & military ships\nbanana boat\ncar ferry\nclipper\ncoaster\ncontainer ship\nCorvette\ncutter\nflagship\njetfoil\nliner\nQ-boat\nschooner\nsemi-submersible\nsteamboat\nstoreship\nsubmersible\ntall ship\ntransport ship\ntrawler\nwarship\nSee more results »\nIdiom\nlike ships that pass in the night\nto send something, usually a large object or a large quantity of objects or people, to a place far away: We ship books out to New York every month.\nMore examplesFewer examplesHer books and clothes were packed into chests and shipped across to Canada.Millions of live animals are shipped around the world each year.The goods are then shipped across the Atlantic.Products like this are routinely shipped to the four corners of the earth.It's cheaper to ship goods than it is to fly them.\nSMART Vocabulary: related words and phrases\nDelivering and despatching\nair bridge\nair corridor\nair drop\nair-dash\nbox scheme\nconsign\ncourier\ndrop off\nmisaddress\nmisdirect\nmisdirection\nmisroute\nnon-delivery\nsend something out\nshipment\nshipper\nshoot\nshoot something off\nteleport\ntruck\nSee more results »\nPhrasal verb\nship someone off\nhaving the rank, position, skill, or relationship of the stated type: lordship partnership craftsmanship friendship\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nhonorary\nopposite number\nrank\nreach\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nwarranted\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkill, talent and ability\nAdd to word list\nAdd to word list\na boat, esp. one that is large enough to travel on the sea: a cruise/cargo ship\nA ship is also an aircraft or spacecraft.\nto transport something or someone by air, train, boat, or truck: They shipped our furniture from Tennessee. Parts for the space station are being shipped out there by spacecraft. Phrasal verb\nship someone/something off\nAdd to word list\nAdd to word list\n[ T ]\n&#160; TRANSPORT, COMMERCE to send or transport something by sea: ship sth to sb/sth The vessel was used to ship gold bullion to America.\n[ I or T ]\n&#160; TRANSPORT, COMMERCE to send goods by air, train, or road, or to be sent in this way: ship sth to sb/sth The company will ship purchases to any address within the US. I asked the suppliers to ship us a replacement as soon as possible. We don't currently ship outside the EU. They assured me our order will be shipping tomorrow.\n[ I or T ]\n&#160; COMMERCE, IT to make something, especially computer products and equipment, available for sale, or to become available: The company is now shipping the first in a new series of interactive DVDs. This software has been shipping for a while now.\nPhrasal verbs\nship sth off\nship out\nship sth out\na large boat used for transporting goods or people by sea: There were several ships waiting in the dock for their cargo to be unloaded.\nabandon/jump ship\nto leave an organization very suddenly, especially when you think it is going to fail: The CEO abandoned ship just before the auditors were called in. See also\ncargo\ncontainer\ndelivered ex ship\nex ship\nfactory ship\nfree alongside ship\nmerchant ship"}