{"id":328838,"name":"shit","type":"noun","us_sound":"ʃɪt","us_link":"../audio/s/shit.mp3","uk_sound":"ʃɪt","uk_link":"../audio/s/ukshish002.mp3","content":"[ U ] offensive the solid waste that is released from the bowels of a person or animal: There's so much dog shit on the pavement.\n[ S ] offensive the act of releasing solid waste from the bowels: to have a shit. the shits [ plural ] offensive\ndiarrhoea (= a medical condition in which the contents of the bowels are passed out of the body too often): Something I ate has given me the shits.\nSee more\n[ U ] offensive nonsense, or something of low quality: a load of shit UK She talks a load of shit.a lot of shit US She talks a lot of shit.\n[ C ] offensive an unpleasant person who behaves badly: The man's a complete shit.\n[ U ] offensive insults, criticism, or unkind or unfair treatment: get shit from Kyle gets a lot of shit from his parents about the way he dresses.take shit from Jackie doesn't take (any) shit from anyone (= does not allow anyone to treat her badly).\n[ U ] US offensive used in negatives to mean \"anything\": He doesn't know shit about what's going on.\nSMART Vocabulary: related words and phrases\nAnimal physiology: excrement & its excretion\naccident\nanal fissure\nbathroom\nbodily function\nbowel\ndefecate\ndoo-doo\ndung\ndunghill\nexcrement\nexcreta\nexcrete\ngo to the bathroom idiom\nmotion\nmovement\npellet\npoo\npoop\npowder\nstool\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSomething, anything, nothing, and everything\nIdioms\ngive someone the shits\nhave shit for brains\nhave/get your shit together\nno shit!\nnot give a shit\n(the) shit hits the fan\nthe shit out of someone/something\n[ I ] to pass solid waste from the bowels: That dog had better not shit in the house again!mainly US I need to shit real bad. shit yourself\nto be extremely frightened: She was shitting herself, especially when he pulled out a gun.\nSee more\nSMART Vocabulary: related words and phrases\nAnimal physiology: excrement & its excretion\naccident\nanal fissure\nbathroom\nbodily function\nbowel\ndefecate\ndoo-doo\ndung\ndunghill\nexcrement\nexcreta\nexcrete\ngo to the bathroom idiom\nmotion\nmovement\npellet\npoo\npoop\npowder\nstool\nSee more results »\nIdiom\nshit a brickPhrasal verb\nshit on someone\nused to express anger or surprise: Oh shit, we're going to be late! Shit - the damn thing's broken!"}