{"id":328939,"name":"shocked","type":"adjective","us_sound":"ʃɑːkt","us_link":"../audio/s/shocked.mp3","uk_sound":"ʃɒkt","uk_link":"../audio/s/ukshish025.mp3","content":"shocked adjective\n(SURPRISED)\nAdd to word list\nAdd to word list\nB1 surprised or upset because something unexpected and usually unpleasant has happened: After his announcement, there was a shocked silence. [ + to infinitive ] We were shocked to see smoke pouring out of the roof.\nMore examplesFewer examplesThe boy was too shocked and frightened to speak. He would never forget the shocked look on her face when she first saw it.Management at the hostel say they're deeply shocked by his murder. Both men stared at her in shocked silence. I was shocked at how different Mo looked. He was visibly shocked by the incident.\nSMART Vocabulary: related words and phrases\nSurprised\naback\nagape\naghast\namazed\nappalled\nflabbergasted\nflat-footed\ngobsmacked\ngoggle-eyed\nheadlight\nhorror of horrors idiom\njaw\nnot know what has hit you idiom\nnot know what hit you idiom\nopen-eyed\nopen-mouthed\npalpitation\nstalk\nyou have (got) to be kidding idiom\nyour eyes pop out of your head idiom\nSee more results »\nshocked adjective\n(OFFENDED)\noffended or upset by something that you consider to be wrong or unacceptable: She was shocked at the language they used.\nMore examplesFewer examplesShe is shocked at the fees some firms charge.Lowne was from a family with strict discipline, and was shocked at the drug use he saw when he first moved to San Diego in 1966.Families expecting typical kids' fare may well have been shocked by the film's mature themes. I was shocked out of my skin by coed dorms at first, and by coed bathrooms probably even more so.\nSMART Vocabulary: related words and phrases\nSaddening, shocking and upsetting\naffecting\nagonizingly\narrogance\nbaleful\nbe cold comfort idiom\ndisrespect\ndistressful\ndistressfully\ndistressing\ndistressingly\nhubris\nhurtful\nhurtfully\nimpiously\nimpiousness\nteary\ntouching\ntouchingly\ntragically\ntraumatic\nSee more results »\nSee\nshock\nAdd to word list\nAdd to word list\nfeeling very upset or surprised: [ + to infinitive ] He was shocked to discover that he had no money left in his account."}