{"id":329073,"name":"shoot","type":"verb","us_sound":"ʃuːt","us_link":"../audio/s/chute.mp3","uk_sound":"ʃuːt","uk_link":"../audio/s/ukchurc008.mp3","content":"shoot verb\n(WEAPON)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to fire a bullet or an arrow, or to hit, injure, or kill a person or animal by firing a bullet or arrow at him, her, or it: If he's not armed, don't shoot.shoot something at something The kids were shooting arrows at a target. She was shot three times in the head. He has a licence to shoot pheasants on the farmer's land. [ + obj + adj ] A policeman was shot deadin the city centre last night.shoot to kill The troops were told to shoot to kill.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\nMore examplesFewer examplesThe prisoners were put up against a wall and shot.He was shot at close range.Inner-city riots erupted when a local man was shot by police.Three youths have been shot and killed in separate incidents this month.He was shot down in enemy territory.\nSMART Vocabulary: related words and phrases\nGuns\nblaster\nblaze\ncannon\ncannonade\ncannonball\ncock\ndischarge\ngunnery\ngunpoint\ngunsmith\nkick\nmachine gun\nplug\npot\nsalvo\nsemi-automatically\nsemiautomatic\nshoot something down\nshoot up\nshooter\nSee more results »\nshoot verb\n(SPORT)\nB1 [ I ] to try to score points for yourself or your team, in sports involving a ball, by kicking, hitting, or throwing the ball towards the goal: He shot from the middle of the field and still managed to score. shoot baskets/hoops US informal\nto play basketball: She stands in the driveway for hours in the evening, shooting baskets.\nSee more\nMore examplesFewer examplesCallas feinted to pass the ball and then shot it into the net.Come on, shoot!The players seem afraid to shoot when they get near the goal.Again, he shoots wide of the net.You just have to seize the opportunity and shoot.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nshoot verb\n(MOVE QUICKLY)\nC2 [ I usually + adv/prep ] to move in a particular direction very quickly and directly: shoot past She shot past me several metres before the finishing line.shoot out He shot out of the office a minute ago - I think he was late for a meeting.shoot off They were just shooting off to work so we didn't stop to talk.shoot to fame Sylvester Stallone shot to fame (= became famous suddenly) with the movie \"Rocky\".\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\n[ T ] to move through or past something quickly: shoot (the) traffic lights informal He shot three sets of traffic lights (= went past them when they gave the signal to stop) before the police caught him.shoot the rapids It was so exhilarating shooting the rapids (= travelling through the part of a river where the water flows dangerously fast).\nMore examplesFewer examplesHe suddenly got up and shot out of the room.She shot passed me just now.I'm just going to shoot off to the shops.Anyway, I'd better shoot - bye!Several runners had already shot past me.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbelt\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nton\ntrot\nSee more results »\nshoot verb\n(FILM)\nC1 [ I or T ] to use a camera to record a video or take a photograph: We shot four reels of film in Egypt.be shot on location The movie was shot on location in Southern India.\nMore examplesFewer examplesHer last movie was shot on location in South America.Most of the scenes were shot in a studio.The urban scenes were shot in Manchester.He's just starting shooting his new movie.I shot a whole reel of film in the park.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\nshoot verb\n(PLAY)\n[ T ] mainly US informal to play a game of pool or craps\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSnooker, pool & billiards\nshoot verb\n(DRUG)\n[ T ] slang to take an illegal drug by injecting yourself with it: By the time he was 16, he was shooting heroin twice a day.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nIdioms\nhave shot your bolt\nshoot something/someone down (in flames)\nshoot yourself in the foot\nshoot your mouth off\nshoot a glance at someone\nshoot for the moon\nshoot from the hip\nshoot questions at someone\nshoot the breeze\nshoot the works\nMore idioms\nsomeone should be shot\nPhrasal verbs\nshoot something down\nshoot someone down\nshoot for something\nshoot something off\nshoot it out\nshoot through\nshoot up\nshoot something up\nshoot noun\n(PLANT)\n[ C ] the first part of a plant to appear above the ground as it develops from a seed, or any new growth on an already existing plant: Two weeks after we'd planted the seeds, little green shoots started to appear.figurative The first green shoots (= hopeful signs) of economic recovery have started to appear.\nRachen Buosa/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nNew growth in plants\nbud\ncoccygeus\ncollateral\ncolli\ncolliculus\ncollum\ncommissure\ncommunis\ncompartment\ncomplement system\nestablished\neye\nnutrient cycling\nresprout\nsprout\nsucker\nshoot noun\n(PHOTOGRAPHS)\n[ C usually singular ] an occasion when photographers take a series of photographs, usually of the same person or people in the same place: do a fashion shoot We did a fashion shoot on the beach, with the girls modelling swimwear. See also\nphotoshoot\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nshoot noun\n(WEAPON)\n[ C ] an occasion on which a group of people go to an area of the countryside to shoot animals\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nyoicks\nSee more results »\nused to tell someone that they should speak: \"Dad, I need to talk to you.\" \"Shoot.\"\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nshoot verb\n(FIRE WEAPON)\nAdd to word list\nAdd to word list\n[ I/T ] to fire a gun or other weapon, or to hit, injure, or kill someone or something by firing a gun or other weapon: [ I ] We’d take our bows and arrows and shoot at targets. [ T ] A long time ago the sergeant learned how to shoot a gun. [ T ] An unidentified man was shot yesterday afternoon.\n[ I/T ] infml If you say that someone or something should be shot, you are very annoyed by it: [ T ] This computer should be shot.\nshoot verb\n(SPORTS)\n[ I/T ] to throw, hit, or kick a ball or other object toward a goal in order to score points: [ T ] Both teams shoot the ball well. [ I ] When you shoot as poorly as we did, you can’t expect to win. shoot baskets slang (also shoot hoops)\nIf you shoot baskets or shoot hoops you play basketball. shoot pool slang\nIf you shoot pool you play that game: Patrick and I were shooting pool after work.\nshoot verb\n(MOVE QUICKLY)\n[ I always + adv/prep ] to move in a particular direction quickly and without unnecessary turns or stops: The ambulance was shooting around the corner, its tires squealing. Grace’s eyebrows shot up when she heard his voice.\nshoot verb\n(FILM)\n[ I/T ] to film or photograph something: [ T ] The movie will be shot in the fall. Idioms\nshoot yourself in the foot\nshoot your mouth off\nshoot the breezePhrasal verbs\nshoot down something/someone\nshoot for something\nshoot off something\nshoot up\nshoot up something\nshoot noun [C]\n(PLANT)\nthe first part of a plant to appear above the ground as it develops from a seed, or a new growth on an already existing plant: Little green shoots appeared in the spring.\nshoot noun [C]\n(FILM)\nthe act of taking a series of photographs or of filming a movie: I remember doing a shoot there.\nshoot exclamation\n(SPEAK)\nused to tell someone else they should speak: \"Dad, I need to talk to you.\" \"Shoot.\""}