{"id":329136,"name":"shopping","type":"noun","us_sound":"ˈʃɑː.pɪŋ","us_link":"../audio/s/shopping.mp3","uk_sound":"ˈʃɒp.ɪŋ","uk_link":"../audio/s/ukshodd025.mp3","content":"Add to word list\nAdd to word list\nA1 the activity of buying things from shops: I'm going shopping this afternoon. My granddaughter does my weekly shopping for me.UK The store is open for late night shopping on Wednesdays. Christmas shopping\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\nA2 goods that you have bought from shops, especially food: She had so many bags of shopping that she could hardly carry them. I forgot my shopping list.\nThesaurus: synonyms, antonyms, and examples\nthe things you buypurchaseI'm not in a position to make a major purchase like a car.goodsThere's a sale on home goods this week.shoppingCan you bring the shopping in for me?groceriesUS Thank you for bagging my groceries for me.acquisitionThat rare book is his latest acquisition.merchandiseThe shop's merchandise was heavily discounted.\nSee more results »\nMore examplesFewer examplesShe went shopping to cheer herself up.I dropped him at the library and went shopping.She's very independent and does all her own shopping and cooking.Will you be able to carry all the shopping back home on your bike ?I was loaded down with shopping.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\napproval\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nAdd to word list\nAdd to word list\nthe activity of looking for things to buy: I was out shopping this afternoon. My daughter and I go shopping together.\nAdd to word list\nAdd to word list\nthe activity of buying goods, especially from a store: When Americans go shopping, they're looking for bargains. These days many women are doing the shopping in their lunch hour. There are 37 shopping days left to Christmas. The goal is to improve the shopping experience for the customer. This software will suggest products based on customers' shopping habits. the Christmas/holiday/weekly shopping online/internet shopping a shopping spree/trip\ngoods that you have bought, especially from stores: I decided to see if I could cut the cost of my shopping. We put the shopping away. See also\ncomparison shopping\nhome shopping\nmystery shopping\nteleshopping"}