{"id":329087,"name":"shop","type":"noun","us_sound":"ʃɑːp","us_link":"../audio/s/shop.mp3","uk_sound":"ʃɒp","uk_link":"../audio/s/ukshodd019.mp3","content":"shop noun [C]\n(PLACE TO BUY THINGS)\nAdd to word list\nAdd to word list\nA1 UK (US usually store) a place where you can buy goods or services: a book/clothes/record/sweet shop a barber's/betting shop I need to go to the shops - I've got no food in the house.\nUK the act of shopping, especially of shopping for food and other things needed in the house: do the weekly shop I usually do the weekly shop on a Monday. be in the shops UK (US be in stores)\nto be available to buy: His latest novel will be in the shops by Christmas.\nSee more See also\nall over the place informal\nMore examplesFewer examplesWe could have a look round the shops if you like.The shop was closed.Most of the shops are open on Sundays.What time do the shops close?There are some lovely shops in the town centre.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBuying\nshop noun [C]\n(WORK AREA)\na place where a particular type of thing is made or repaired: He runs a car repair shop.\nSMART Vocabulary: related words and phrases\nFactories\nassembly line\nbrewery\ncannery\nchemical park\nconveyor belt\nindustrial park\nmill\nmiller\nmulti-plant\non the factory floor idiom\npacking house\npower station\nrolling mill\nshipyard\nslaughterhouse\nsmelter\nsmithy\nsolar plant\nsteel mill\nsweatshop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: rooms\nshop noun [C]\n(BUSINESS)\ninformal a business\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nIdiom\nset up shop\nshop verb\n(BUY THINGS)\nB1 [ I ] to buy things in shops: I like to shop at second-hand shops for clothes.shop for If I'm just shopping for food, I tend to go to the local supermarket.\nThesaurus: synonyms, antonyms, and examples\nto buy somethingbuyI need to buy some new shoes.getI need to go to the supermarket and get some bread.purchaseShe purchased a new computer.pick something upCan you just pop in the shop and pick up some eggs?\nSee more results »\n[ T ] mainly US to look at particular products with the intention of buying something: Here you can shop our range of luxurious beauty products. For me the most important thing when I shop clothes is the price.\n[ T ] mainly US to look in a particular place in order to find something that you want to buy: About a million Canadians choose to shop our stores every day. I shopped the sales looking for deals on sofas.\nMore examplesFewer examplesWhere do you shop for food?I like to shop locally.When I'm shopping in town I often pop in there.I was born to shop.If I'm shopping for clothes I like to go alone.\nSMART Vocabulary: related words and phrases\nBuying\nacquirable\nacquire\nacquisition\nacquisitiveness\nbidding\nbidding war\ninvest\nload up on something\nmisorder\nmoney-off\norder form\norder something in\npurchasing power\nrepurchase\nretail therapy\nROBO\nROPO\nsend\nslate\nsplurge\nSee more results »\nshop verb\n(GIVE INFORMATION)\n[ T ] UK slang to give the police information about a criminal: shop someone to someone/something His ex-wife shopped him to the police.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\nsurface\ntip\ntranspire\nunravel\nSee more results »\nshop verb\n(OFFER FOR SALE)\n[ T ] to offer something for sale, especially to several different companies in the hope that one of them will buy it: be/get shopped to Your script gets shopped to literary agents and movie studios.\nSMART Vocabulary: related words and phrases\nSelling\nauction\nBlack Friday\nbundle\nbundling\nchain of production\nconcession\noversell\npanic selling\npeddle\npile\npile it high and sell it cheap idiom\nply\npoint of sale\nsell out\nsell something off\nsellout\nsoft sell\nsold\nspecial offer\nsting\nSee more results »\nIdiom\nshop your closetPhrasal verb\nshop around\nshop verb [I]\n(BUY THINGS)\nAdd to word list\nAdd to word list\nto look for and buy (things): We shop in malls because they’re convenient. Phrasal verb\nshop around\nshop noun [C]\n(WORK AREA)\na place where a particular type of thing is made or repaired: a bicycle repair shop I work in a machine shop making wire.\nshop noun [C]\n(PLACE TO BUY THINGS)\na place where you can buy goods or services; store: a gift shop a barber shop a coffee shop\nAdd to word list\nAdd to word list\nCOMMERCE\n&#160; UK a place where people go to buy things: Our village shop sells mostly food and magazines. For more great bargains, visit our online shop! a book/clothes/shoe shop Compare\nstore noun\nCOMMERCE, PRODUCTION a place where particular things are made or repaired: All our delivery bicycles are regularly checked in the repair shop.\nbe in the shops UK\nCOMMERCE be available for people to buy: Her new designs will be in the shops in the spring.\nmind the shop UK\nto manage or look after a business when its usual owner or manager is not there: While their fellow employees are getting time off, they are left to mind the shop.\nset up shop informal\nto start doing business somewhere: Several European retailers have set up shop in the US. Setting up shop on the web is an increasingly attractive option for young entrepreneurs.\ntalk shop disapproving\nto talk about things relating to your work when you are in a social situation, especially in a way that is not interesting to other people: I hate these dinners where everyone talks shop the whole time.\nSee also\nbody shop\nbucket shop\nclosed shop\ncorner shop\nfactory outlet\ngift shop\njob shop\nmachine shop\nmobile shop\none-stop\n[ I ] to buy things, especially from stores: The new shopping mall is designed for people who love to shop.shop for sth She's always shopping for bargains. We usually shop at the local supermarket.shop with sb/sth Only shop with companies that offer a full after-sales service. Most people go shopping at the weekend.\n[ T ] US informal if you shop a company, you try to make people interested in buying it: Management is shopping the company. Phrasal verb\nshop around"}