{"id":329284,"name":"should","type":"modal verb","us_sound":"ʃʊd","us_link":"../audio/s/should.mp3","uk_sound":"ʃʊd","uk_link":"../audio/s/ukshorn024.mp3","content":"should modal verb\n(DUTY)\nAdd to word list\nAdd to word list\nA2 used to say or ask what is the correct or best thing to do: If you're annoyed with him, you should tell him. You should take the bus - it's the easiest way to get there. \"Should I apologize to him?\" \"Yes, I think you should.\" You should be ashamed of yourselves. This computer isn't working as it should. There should be an investigation into the cause of the disaster. He said that I should see a doctor. I should have written to her but I haven't had time. You shouldn't have said anything. Where should (= do you suggest that) we meet tonight? It's rather cold in here. Should I (= do you want me to) turn the heating on?\nMore examplesFewer examplesYou should always check your oil, water and tyres before taking your car on a long trip.I think I should have given check at move 23 instead of trying to find a safer square for the rook.Who should I make out this cheque to ?Under no circumstances should you approach the man.A long wool coat is a classic no wardrobe should be without.\nSMART Vocabulary: related words and phrases\nDuty, obligation and responsibility\naccountable\naccountable to someone\naccountably\nanswer for something\nbear\ncommitment\nfail\nfall to someone\nfiefdom\ngotta\nhad better/best do something idiom\nhat\nought to\nowe someone a living idiom\npass the buck idiom\npay your dues idiom\nportfolio\nsomeone's answer to someone/something idiom\nstick\nthe onus\nSee more results »\nshould modal verb\n(PROBABLE)\nB1 used to show when something is likely or expected: My dry cleaning should be ready this afternoon. You should find this guidebook helpful. I wonder what's happened to Annie. She should be (= it was expected that she would be) here by now.UK \"Could you have the report ready by Friday?\" \"Yes, I should think so (= it is likely that it will be ready).\" This should be good (= this is likely to be interesting or amusing).\nMore examplesFewer examplesThe building work should be finished by Christmas.We should get around 50 people at the event.I think it should stay sunny all afternoon.According to his teacher, he should pass the exam.The football match should be really tense.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\nshould modal verb\n(POSSIBILITY)\nformal used when referring to a possible event in the future: If anyone should ask for me, I'll be in the manager's office. Should you (= if you) ever need anything, please don't hesitate to contact me.\nmainly UK used after \"that\" and adjectives or nouns that show an opinion or feeling: It's odd that she should think I would want to see her again. It's so unfair that she should have died so young.\nmainly UK used after \"that\" to suggest that a situation possibly exists or might come into existence: We agreed that we should meet the following week.\nmainly UK formal used after \"so that\" and \"in order that\" to show purpose: He took his umbrella so that he shouldn't get wet.\nmainly UK formal used after \"for fear that\", \"in case\", and \"lest\": He took his umbrella in case it should rain.\nMore examplesFewer examplesShould you need it, there's more food in the fridge.It's strange that he should have confided in her.We agreed that we should meet the next week.Should the money not be forthcoming, we will have to go to court.I agreed that he should continue to see the children.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nSuggestions & proposals\nGoals and purposes\nshould modal verb\n(REASON)\nB2 mainly UK (also would) used after \"why\" when giving or asking the reason for something: Why should anyone want to eat something so horrible? Why should she not buy it if she can afford it?\nMore examplesFewer examplesWhy should I do all the tidying up?Why should the boys get more to eat than the girls?Why should Maurice care if the shop closes down?I don't see why he should get more money than me.Why should they have to travel second class?\nSMART Vocabulary: related words and phrases\nMotives and reasons\nautotelic\ncauseless\ndrive\nfirst principles\nfrom a place of idiom\nhidden agenda\nimpulse\ninclination\njustification\nmainspring\nmotivation\nmotive\nname\nobject\npeg\nplace\nreason\nwherefores\nwhy\nSee more results »\nshould modal verb\n(WOULD)\nUK formal used instead of \"would\" when the subject is \"I\" or \"we\": I should like a cup of tea before I go to bed. I shouldn't expect you to pay, of course.\nMore examplesFewer examplesI think I should like to go to bed now.I shouldn't want to be paid for the work.I should like to speak with Mr Lansley.\nshould modal verb\n(SURPRISE)\nused to express surprise in sentences that are in the form of questions: I was just getting off the bus when who should I see but my old school friend Pat!\nSMART Vocabulary: related words and phrases\nExpressions of surprise\naccha\nachha\nactually\nay\nbegorrah\nblow\nclutch\nfancy\nglory\nheavens (above)! idiom\nhell's bells\nhold on idiom\nhow about that? idiom\nI ask you! idiom\nomg\nsagebrush\nsheesh\nshit\nshock, horror! idiom\nshut\nSee more results »\nshould modal verb\n(ADVISE)\nUK (also would) used after \"I\" when giving advice: I shouldn't worry about it if I were you. I shouldn't (= I advise you not to) let it worry you.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nagony uncle\nbrain trust\nclinic\nconsultant\ncounselling\nguidance\nMonday-morning quarterback idiom\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\nsteer\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nGrammar\nOught to or should?Ought to and should are similar in meaning. Should is more common than ought to. Ought to is more formal than should: …\nShouldShould comes first in the verb phrase (after the subject and before another verb): …\nShould: formsShould comes first in the verb phrase (after the subject and before another verb): …\nShould: usesWe use should most commonly to talk about what is the ideal or best thing to do in a situation: …\nShould and wouldWe use should as a more formal alternative to would with I and we in conditional clauses. …\nShould and ought toShould and ought to have similar meanings and uses. Ought to is more formal and less common than should: …\nShould you (Should with inversion)In formal situations, we can use should + subject (s) + verb (v) instead of if: …\nHad you (Had with inversion)In formal situations, we can use had + subject + verb instead of if in third conditional sentences: …\nIf + were toIn formal situations, we can use if + were to when we talk about things that might happen but which we think are unlikely: …\nAs long as, so long as, providing, etc.Sometimes we need to impose specific conditions or set limits on a situation. In these cases, conditional clauses can begin with phrases such as as long as, so long as, only if, on condition that, providing (that), provided (that). …\nOr and otherwiseWe often use or and otherwise with conditional meanings: …\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nIf + shouldWe can use if with should to refer to events which might happen by chance or by accident: …\nConditionals: other expressions (unless, should, as long as)Conditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nUnlessConditional clauses can begin with unless. Unless means something similar to ‘if … not’ or ‘except if’. …\nIdioms\nhow should I know?\nI should hope/say/think so/not\nI should think not/so (too)!\nI should be so lucky!\nthey should worry!\nyou should have seen/heard something/someone\nyou shouldn't have\nshould modal verb\n(DUTY)\nAdd to word list\nAdd to word list\nused to express that it is necessary, desirable, or important to perform the action of the following verb: He should have told me about the change in plans. People like that should go to jail. Where should we meet tonight?\nshould modal verb\n(PROBABLE)\nused to express that the action of the main verb is probable: She should be back at any minute. If you follow these directions, you shouldn’t have any trouble finding our house. That should be enough food for five people.\nshould modal verb\n(OPINION)\nfml used to express a desire or opinion: I should think he’d be happy just to have a job. I shouldn’t worry about that if I were you.\nshould modal verb\n(ASKING WHY)\nused after a question word, such as \"how\" or \"why,\" when asking a reason for something: How should I know where you put the car keys?"}