{"id":329346,"name":"showcase","type":"noun","us_sound":"ˈʃoʊ.keɪs","us_link":"../audio/s/showcase.mp3","uk_sound":"ˈʃəʊ.keɪs","uk_link":"../audio/s/ukshove007.mp3","content":"showcase noun [C]\n(CONTAINER)\nAdd to word list\nAdd to word list\na container with glass sides in which valuable or important objects are kept so that they can be looked at without being touched, damaged, or stolen\nImage Source/GettyImages\nSMART Vocabulary: related words and phrases\nFurniture for storage\nairing cupboard\nalmirah\nbookcase\nbookshelf\nbroom closet\ncredenza\ncubby\ncubbyhole\ncupboard\ncwtch\nhatstand\nhot press\nhutch\nlocker\nottoman\nshelf\ntrophy cabinet\nwalk-in\nwardrobe\nWelsh dresser\nSee more results »\nshowcase noun [C]\n(OPPORTUNITY)\na situation or event that makes it possible for the best features of something to be seen: The Venice Film Festival has always been the showcase of Italian cinema. The exhibition is an annual showcase for British design and innovation.\nSMART Vocabulary: related words and phrases\nExhibiting and exhibitions\nco-curate\nco-curator\ncurate\ncuration\nexhibit\nexhibition\nexhibitor\nexpo\nexposition\nfashion show\nopen day\nopen house\npremiere\npreview\nretrospective\nshow\nshowing\nunmounted\nviewing\nto show the best qualities or parts of something: The main aim of the exhibition is to showcase British design.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nspeak\nvent\nvirtue signalling\nvisualization\nwhiff\nSee more results »\nshowcase noun [C]\n(CABINET)\nAdd to word list\nAdd to word list\na cabinet, usually of glass, in which objects are kept that are valuable or easily broken: a jeweler’s showcase\nshowcase noun [C]\n(OPPORTUNITY)\na place or event where something, esp. something new, can be shown or performed: The Sundance Film Festival is an especially sympathetic showcase for unusual films.\nshowcase verb [T]\n(SHOW BEST PARTS)\nto show the best qualities or parts of something: In the opening set, he showcased his own songs.\nAdd to word list\nAdd to word list\nMARKETING a situation or an event that makes it possible for the best features of something to be seen: a showcase for sth The North American International Auto Show is a showcase for new technologies related to driving.a showcase of sth The expo will be the largest showcase of green building products ever held. The forum included a technology showcase, during which participants were provided with hands-on demonstrations. 530 acres of land will be transformed into a showcase city.\nCOMMERCE in a store, museum, etc., a glass box in which products or objects can be displayed: They smashed a glass showcase, took 12 pieces of jewellery and fled.\nMARKETING to show what someone or something is like, especially their best qualities or features: We wanted a season that would showcase all the different kinds of things we do. The 10 finalists are asked a question before judges decide who best showcased her personality and capabilities."}