{"id":329336,"name":"show","type":"verb","us_sound":"ʃoʊ","us_link":"../audio/s/show.mp3","uk_sound":"ʃəʊ","uk_link":"../audio/s/ukshove003.mp3","content":"show verb\n(MAKE SEEN)\nAdd to word list\nAdd to word list\nA1 [ T ] to make it possible for something to be seen: [ + two objects ] Let me show you this new book I've just bought. On this map, urban areas are shown in grey. You ought to show that rash to your doctor. [ + obj + question word ] Why won't you show me what's in your hand? [ + obj + -ing verb ] The secretly filmed video shows the prince and princess kissing. These photographs show the effects of the chemical on the trees. He began to show signs of recovery. \"This is a Victorian gold coin.\" \"Is it? Show me (= allow me to see it).\"\nThesaurus: synonyms, antonyms, and examples\nto appearappearOne or two clouds appeared in the sky.be/become visibleAs the beach gets darker, the glow of city lights becomes more visible.show itselfHe believes the impact is showing itself clearly already. emergeA slender figure is seen emerging from the darkness.loomClouds of volcanic ash loomed menacingly overhead.\nSee more results »\nMore examplesFewer examplesCracks began to show in his facade of self-confidence.She was asked to show her press credentials.Mum dug out some old family photos to show me.Let me show you Pat's embroideries.Shall I show you my new dress?\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nshow verb\n(RECORD)\nB1 [ T ] to record or express a number or measurement: The right-hand dial shows the temperature, and the left-hand one shows the air pressure. The company showed a loss of $2 million last year. The latest crime figures show a sharp rise in burglaries.\nMore examplesFewer examplesIt's important to show some consistency in your work.Early vote counts show Mr Adams in the lead.Recently published figures show a divergence from previous trends.This screen shows the route the ship is taking.The graph shows population increase.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nshow verb\n(EXPLAIN)\nB1 [ T ] to explain something to someone, by doing it or by giving instructions or examples: [ + question word ] Can you show me how to set the DVD player? This dictionary contains many examples that show how words are actually used. Could you show me the way to the bus station?\nMore examplesFewer examplesFor a small consideration, madam, I'll show you the way there myself.Can you show me how to turn the computer on?Zoe will show you what you need to do.These diagrams show you how to fix the child seat in the car.Shona showed me how to make a great omelette.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nshow verb\n(PROVE)\nB2 [ T ] to prove something or make the truth or existence of something known: She has shown herself (to be) a highly competent manager. His diaries show him to have been an extremely insecure person. [ + (that) ] The diaries show (that) he was very insecure. Show me (that) I can trust you. [ + question word ] Our research has shown (us) how little we know about this disease.\nMore examplesFewer examplesDoes the market research show that the product will succeed commercially ?The opinion polls show the three election candidates in a dead heat (with each other).These facts alone show that he's not to be trusted.Empirical studies show that some forms of alternative medicine are extremely effective.Surveys show that animal welfare has recently become a major concern for many schoolchildren.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »\nshow verb\n(EXPRESS)\nB2 [ T ] to express ideas or feelings using actions or words: He finds it difficult to show affection. She showed enormous courage when she rescued him from the fire. [ + two objects ] You should show your parents more respect/show more respect to your parents.\nMore examplesFewer examplesThe new daytime soap opera has yet to show signs that it's clicking with the television audience.I was hoping she might show a little compassion.Could you turn your music down and show a little consideration for the neighbours!We need to show a bit of cunning if we want to trick the enemy.We are demonstrating to show our anger and disgust at the treatment of refugees.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nshow verb\n(NOTICEABLE)\nC1 [ I ] to be easy to see or notice: \"Oh no, I've spilled red wine on my jacket!\" \"Don't worry, it doesn't show.\" Whatever she's thinking, she never lets it show. I've painted over the graffiti twice, but it still shows through. The drug does not show up in blood tests because it is effective in very small quantities. When we moved in, the house hadn't been decorated for 20 years, and it showed. See also\nshow up informal\n[ I ] When a pregnant woman shows, it is possible to see that she is pregnant: Once she started to show, people started treating her differently. Although I'm not showing yet, my baby is due in the spring. show your age\nto look as old as you really are: Recently, he's really starting to show his age.\nMore examplesFewer examplesI was really angry, but I hope it didn't show.The stains don't really show on the brown carpet.He's been doing much more piano practice and it really shows.The ink shows through the paper.\nSMART Vocabulary: related words and phrases\nVisible\na mile off idiom\ndiscernibly\neye-catching\nfront and centre\nfull\ngoldfish bowl\nhigh-visibility\nintervisibility\nlarge\nnoticeable\nout\nperceivable\nperceivably\nprominent\nprominently\nrelief\nsore\nstand\nstick out\nvisibility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nObstetrics: pregnancy\nDescribing age & birthdays\nshow verb\n(PUBLIC EVENT)\n[ T ] to make an artist's work available for the public to see: Our aim is to make it easier for young unknown artists to show their work.\n[ I or T ] If a cinema or television station shows a film or programme, or if a film or programme is showing somewhere, you can see it there: It's the first time this movie has been shown on television. Now showing at a cinema near you!\nSMART Vocabulary: related words and phrases\nExhibiting and exhibitions\nco-curate\nco-curator\ncurate\ncuration\nexhibit\nexhibition\nexhibitor\nexpo\nexposition\nfashion show\nopen day\nopen house\npremiere\npreview\nretrospective\nshowcase\nshowing\nunmounted\nviewing\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nshow verb\n(ARRIVE)\n[ I ] mainly US to\nshow up informal\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nshow verb\n(LEAD)\n[ T usually + adv/prep ] to take someone somewhere by going there with them: Could you show Dr Sanchez into the living room? The waiter showed us to our table.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\nshow verb\n(FAIL TO HIDE)\n[ T ] to fail to hide something, or to make it possible to see or know something that is not intended to be seen or known: Your shirt's so thin that it shows your bra. Light-coloured carpets show the dirt. [ + question word ] His failure in the exams shows (up) just how bad his teachers are.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nshow verb\n(MAKE UNDERSTAND)\n[ T + obj + question word ] to make someone understand something by directing their attention to it: Can you show me where it hurts? Show me which one you want.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nIdioms\nhave something/nothing to show for something\nshow your face\nshow your hand\nshow someone the door\nshow (someone) the way\nthat will show someonePhrasal verbs\nshow someone around (something)\nshow off\nshow something/someone off\nshow someone out\nshow yourself out\nshow someone over something\nshow someone round (something)\nshow up\nshow someone up\nshow noun\n(ENTERTAINMENT)\nA2 [ C ] a theatre performance or a television or radio programme that is entertaining rather than serious: a radio/television/stage show a quiz/game show Why don't we go to London on Saturday and see a show? We had to raise £60,000 to stage the show. We had a puppet show for Jamie's birthday party. See also\nroadshow\nMore examplesFewer examplesPeople came from afar to see the show.She comperes that awful game show on Saturday night.A crowd congregated around the entrance to the theatre, hoping to catch a glimpse of the stars of the show.The Circus has been described as the greatest show on earth .We can either eat now or after the show - it's up to you.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nshow noun\n(PUBLIC EVENT)\nB2 [ C ] an event at which a group of related things are available for the public to look at: a fashion/flower show There were some amazing new cars at the motor show. They put on a retrospective show of his work at the National Museum of American Art. See also\nairshow\npeepshow\nroadshow\nshowjumping\nsideshow on show\nC1 Something that is on show has been made available for the public to look at: Her sculptures will be on show at the museum until the end of the month.\nMore examplesFewer examplesHis dog won best of breed at the show.The climax of the air show was a flying display.She was doing a flower arrangement for the village show.There is a show of local painters' work in the village hall.There was an exhibition of sheep shearing at the county show.\nSMART Vocabulary: related words and phrases\nExhibiting and exhibitions\nco-curate\nco-curator\ncurate\ncuration\nexhibit\nexhibition\nexhibitor\nexpo\nexposition\nfashion show\nopen day\nopen house\npremiere\npreview\nretrospective\nshowcase\nshowing\nunmounted\nviewing\nshow noun\n(EXPRESSION)\n[ C ] an action that makes other people know what your feelings, beliefs, or qualities are: In a show of solidarity, the management and workers have joined forces to campaign against the closure of the factory. Over 100 military vehicles paraded through the capital in a show of strength. a good, poor, etc. show\nan activity or piece of work that appears to be done with great, little, etc. effort: She may not have won, but she certainly put up a good show.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nshow noun\n(FALSE APPEARANCE)\n[ C ] an appearance of something that is not really sincere or real: Despite its public show of unity, the royal family had its share of disagreements just like any other. They put on a show of being interested, but I don't think they really were. for show\nSomething that is for show has no practical value and is used only to improve the appearance of something else: Do the lights on this phone have any useful function or are they just/only for show?\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nstudiedly\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUseless and futile\nshow noun\n(ACTIVITY)\n[ U ] informal an activity, business, or organization, considered in relation to who is managing it: Who will run the show when Meg retires? The wedding is their show - let them do it their way.\nSMART Vocabulary: related words and phrases\nActing and acts\n(your) every move idiom\n-ence\nact\nact for someone\nact/do something on your own responsibility idiom\nADL\nagency\nant\nbeat\ner\nexecution\nexploit\nmove\nput your money where your mouth is idiom\nresponsibility\nrole-play\nrot\nstep\nstuff\ntalk\nSee more results »\nshow noun\n(BLOOD)\n[ C ]\n&#160; medical\n&#160; specialized a small amount of blood and mucus (= thick liquid) that comes out of the vagina at the start of labour (= the process of giving birth): the bloody show\nSMART Vocabulary: related words and phrases\nObstetrics: birth\nafterbirth\nantenatally\nApgar score\nB, b\nbirth centre\nbirth partner\nbirth rate\nbore\nchildbearing\nchildbirth\nhypnobirth\nhypnobirthing\ninduce\nmaternity suite\nmaternity unit\nmatrescence\nposh\npreemie\nstillbirth\nstillborn\nSee more results »\nIdioms\nget the/this show on the road\nthe show must go on\nshow verb\n(MAKE SEEN)\nAdd to word list\nAdd to word list\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to cause or allow something to be seen: You should show that rash to your doctor. These trees show the effects of acid rain. He’s starting to show his age.\nshow verb\n(EXPRESS)\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to express your feelings or opinion by your actions or words: I do not know how to show my thanks for all your help. He is a scrappy lawyer and shows no mercy to any opponent.\nshow verb\n(EXPLAIN)\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to explain something to someone by helping to do it or by giving instructions or examples to copy: [ + question word ] The diagram shows how to fit the pieces together.\nshow verb\n(PROVE)\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to make something clear or prove something to be true: Your writing shows you can be a good writer. He has shown himself to be unreliable.\nshow verb\n(BE NOTICEABLE)\n[ I/T ] past tense showed | past participle shown us/ʃoʊn/ to be able to be seen or noticed, or to make something noticeable: [ I ] I’ve been working for hours, and I’ve got nothing to show for it.\nshow verb\n(LEAD)\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to lead someone somewhere or to point out something: Could you show me the way to the post office? Show me which cake you want.\nshow verb\n(RECORD)\n[ T ] past tense showed | past participle shown us/ʃoʊn/ to record or express an amount, number, or measurement: My barometer shows a change in the weather is coming.\nshow verb\n(APPEAR)\n[ I ] to appear at a gathering or event: Jenny said she'd be here, but she never showed.\nshow verb\n(MAKE PUBLIC EVENT)\n[ I/T ] past tense showed | past participle shown us/ʃoʊn/ to make an artist's work available for the public to see: [ T ] This gallery is a place where young artists can show their work.\n[ I/T ] past tense showed | past participle shown us/ʃoʊn/ To show a movie is to offer it for viewing in a movie theater or on television: [ T ] That channel often shows foreign films. Idioms\nshow your face\nshow someone the doorPhrasal verbs\nshow someone around\nshow off\nshow off something/someone\nshow up\nshow up\nshow up someone\nshow noun\n(ENTERTAINMENT)\n[ C ] a performance in a theater, a movie, or a television or radio program: a stage/talk show\nshow noun\n(PUBLIC EVENT)\n[ C ] an event at which the public can view a particular collection of things: a flower show a fashion show\nshow noun\n(ACTIVITY)\n[ U ] infml an activity, business, or organization, considered in relation to who is managing it: Who will run the show when the boss retires?\nshow noun\n(APPEARANCE)\n[ C/U ] an appearance of something that is not really sincere or real: [ C ] Ray made a show of reaching for his wallet. [ U ] Does this fireplace work or is it just for show? [ U ] Half for show and half in real anger, I stood up and shouted, “I'm not your friend!”\nAdd to word list\nAdd to word list\nMARKETING, COMMERCE an event at which goods and services, or information about them, are displayed so that people can decide whether to buy them: a fashion/technology/trade show We try to schedule our show ahead of Tucson so dealers can leave here and go straight there. What is the future of green automotive business at the Detroit auto show?\nCOMMUNICATIONS a broadcast on television or radio: You can watch reruns of the show on the Internet. a television/TV/radio show a news/reality/cooking showa show about sth We saw a show about the space program.a show on sth I love that new show on the history channel.\na show of hands\na situation in which people raise one of their hands to show that they support or agree with something or in order to vote for something: Very few attendees belonged to senior management, according to a show of hands.\non show\navailable for people to see: An exhibition of her photographs is currently on show in London. See also\nagricultural show\ndog and pony show\nno-show\nroadshow\ntrade show"}