{"id":329623,"name":"shudder","type":"verb","us_sound":"ˈʃʌd.ɚ","us_link":"../audio/s/shudder.mp3","uk_sound":"ˈʃʌd.ər","uk_link":"../audio/s/ukshred028.mp3","content":"Add to word list\nAdd to word list\nC2 to shake suddenly with very small movements because of a very unpleasant thought or feeling: The sight of so much blood made him shudder. She shuddered at the thought of kissing him.\nWhen something shudders, it shakes violently and quickly: I heard a massive explosion and the ground shuddered beneath me. There was a screech of brakes and the bus shuddered to a halt (= shook violently and stopped).\nMore examplesFewer examplesShe looked up at the grey sky and shuddered.I still shudder when I think of the risks we took.She shuddered with horror.I shudder at the thought of eating the fat on meat.I don't like to think about getting close to him - it makes me shudder.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nsquirm\ntoss\ntremulous\nwhip\nSee more results »\nIdioms\nI shudder to think\nshudder to a halt\nthe act of shuddering: He gave a slight shudder as he considered how close he had come to death. She recalled with a shudder how her boss had once tried to kiss her.figurative America's second biggest supermarket chain has sent a shudder through (= has had a strong effect on) its rivals by slashing its prices.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nsquirm\ntoss\ntremulous\nwhip\nSee more results »\nIdiom\nsend shudders/a shudder down your spine\nAdd to word list\nAdd to word list\nto shake suddenly and briefly, esp. because of an unpleasant thought or feeling: I shuddered, remembering the frightening stories I had heard.\na sudden and brief shaking movement of the body, esp. because of an unpleasant emotion: When the car flipped over, a shudder went through the crowd watching the race. Just thinking about that film sends shudders down my spine."}