{"id":329675,"name":"shunt","type":"verb","us_sound":"ʃʌnt","us_link":"../audio/s/shunt.mp3","uk_sound":"ʃʌnt","uk_link":"../audio/s/ukshun_002.mp3","content":"shunt verb\n(TRAINS)\nAdd to word list\nAdd to word list\n[ T ] to move a train or carriage onto a different track in or near a station using a special railway engine designed for this purpose\nSMART Vocabulary: related words and phrases\nRailways: trains & parts of trains\nbogie\nboiler\nbullet train\ncarriage\ncoach\ncowcatcher\nemergency cord\nfootplate\nfreight car\nguard's van\ninterurban\nloco\nluggage van\npuffer train\nrolling stock\nshunter\nsleeper\nsleeping car\nsmoker\nthird rail\nSee more results »\nshunt verb\n(MOVE)\n[ T usually + adv/prep ] to move someone or something from one place to another, usually because that person or thing is not wanted, and without considering any unpleasant effects: I spent most of my childhood being shunted (about) between my parents who had divorced when I was five. He shunts his kids off to a camp every summer. Viewers are sick of their favourite sitcoms being shunted to later times to make way for live sports coverage.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nshunt noun [C]\n(PASSAGE)\nmedical\n&#160; specialized a hole or passage that allows liquid to move from one part of the body to another, either found naturally in the body or put into the body in an operation: The doctor had trouble finding a vein to insert the shunt. An estimated 50% of all shunts fail within two years, requiring further surgery to replace the shunts.\nMore examplesFewer examplesThe neurosurgeon can place a shunt to divert spinal fluid under pressure.The man had had a shunt inserted into his head to drain away fluid.A total of 63 shunts were performed in 57 patients.\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nvalvular\nventriculus\nvesica\nvesical\nvesicle\nSee more results »\nshunt noun [C]\n(CRASH)\nUK informal a car accident in which one vehicle drives into the back of another: The accident was his second high-speed shunt. He gave me a lift last night because I had a little shunt in my new car.\nThesaurus: synonyms, antonyms, and examples\na traffic accidentaccidentAn accident on the M11 is blocking traffic in a northerly direction.collisionPolice responded to the collision and closed the road.head-onBoth drivers were injured in the head-on collision.shuntUK My insurance company refused to pay out after my little shunt.crashA serious crash on the motorway yesterday led to its closure for two hours.car crashHe died in a car crash.\nSee more results »\nMore examplesFewer examplesThis was a minor shunt with bent bumpers, not a head-on smash.I remember when I had my first proper shunt in a racing car.The race was delayed for more than 30 minutes following a five-car shunt.\nSMART Vocabulary: related words and phrases\nOn the road: accidents involving vehicles\na screech of brakes phrase\nanti-collision\nbird strike\nbrake\ncar crash\ncrash-landing\ncropper\nderailment\nfender bender\novershoot\nprang\nrear-end\nroad toll\nrubbernecking\nrun (something) into something/someone\nrun someone/something down\nrun someone/something over\nsideswipe\nspin\nstack\nSee more results »\nAdd to word list\nAdd to word list\nto move someone or something to the side or away: Seals can shunt blood away from their skin to maintain body temperature. You can’t just shunt your problems aside."}