{"id":329691,"name":"shut","type":"verb","us_sound":"ʃʌt","us_link":"../audio/s/shut.mp3","uk_sound":"ʃʌt","uk_link":"../audio/s/ukshun_004.mp3","content":"shut verb [I or T]\n(CLOSE)\nAdd to word list\nAdd to word list\nA2 to (cause to) close something: Please shut the gate. I've got a surprise for you! Shut your eyes tightly and hold out your hand. Mary shut her book and put it down on the table. This window won't shut - it's jammed.\nThesaurus: synonyms, antonyms, and examples\nto close closeCan you close the door behind you?shutI shut the door so the cat couldn't get out.snap shutHe snapped his briefcase shut and walked out of the office.click shutThe door clicked shut. slamPlease don't slam the door.\nSee more results »\nMore examplesFewer examplesCould you shut the door, please?This door won't shut properly.I'd better check that I've shut the windows before I leave.I can't get this drawer to shut.I shut my eyes for the violent scenes.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncongest\ncork\ndam\ndam something up\nensconce\ngum\nsandbag\nseal something in\nseal something off\nself-seal\nself-sealing\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nshut verb [I or T]\n(STOP OPERATING)\nA2 to (cause to) stop operating or being in service, either temporarily or permanently: The shops shut at eight o'clock on Wednesday evenings. It's such a shame they shut that factory (down).\nThesaurus: synonyms, antonyms, and examples\nto stop operating permanentlyclose downWith sales down, the company closed one factory down and reduced the workforce at another. closeMany of the shops in the High Street have closed recently. shut downThe bookshop is shutting down after 25 years of business.shutUK Several of the bank's local branches are shutting.shut up shopUK The seaside businesses all shut up shop during the winter.go/put out of businessMy favourite ice cream shop went out of business last summer.\nSee more results »\nMore examplesFewer examplesUK The shop is shutting in five minutes.UK All the shops have shut down.The bars all shut at midnight.What time does the restaurant shut?He lost his job when they shut the factory down.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlay\nlid\nsnap\nstamp on something\nstamp something out\nstanch\nstaunch\nstem\nSee more results »\nIdioms\nshut the front door!\nshut your eyes to something\nshut your mouth/face\nshut up shopPhrasal verbs\nshut someone away\nshut something away\nshut yourself away\nshut (something) down\nshut someone/something in (something)\nshut something in something\nshut (something) off\nshut something off\nshut yourself off\nshut someone/something out\nMore phrasal verbs\nshut something out\nshut someone out\nshut (someone) up\nshut someone/something up\nshut (something) up\nB1 closed: I suspected something was wrong when I noticed her curtains were still shut at lunchtime.figurative The government ought to have opened the door to Japanese investment instead of slamming it shut. See also\nopen-and-shut\nMore examplesFewer examplesThe door clicked shut behind her.Half the time you go around with your eyes shut.Her bedroom door was shut so I assumed she was in bed.The window slammed shut with a loud bang.The lid of the box sprang shut.\nSMART Vocabulary: related words and phrases\nOpen and closed\nairtight\najar\nbarred\nclosed\ncrack\ngaping\nhermetic\nhermetically sealed\nhour\nlatch\noff-hours\nopen\noutspread\npatency\nsealed\nto\nunbarricaded\nundone\nwatertight\nwide-eyed\nSee more results »\nAdd to word list\nAdd to word list\nto close something: [ T ] Would you shut the door, please? [ I ] I can’t get this window shut. [ T ] I shut the book (= closed it) and put it back on the shelf. Idiom\nshut your mouthPhrasal verbs\nshut off (something)\nshut off something/someone/yourself\nshut out someone/something\nshut out someone\nshut up (someone/something)\nshut up something/someone\nnot open; closed: Her office door was shut all day. Her eyes were shut, but she was still awake.\nAdd to word list\nAdd to word list\nCOMMERCE, WORKPLACE\n&#160; UK if a store, restaurant, or public place shuts or someone shuts it, it stops being open for business at the end of the day, week, etc.: The shops shut at 7 on Friday.\nCOMMERCE if a business shuts or is shut, it stops operating permanently: When tougher controls force these dumps to shut, their operators will vanish. The older plant will be shut down soon.\nshut up shop UK informal\nto stop operating a business either temporarily or permanently: Last weekend the greengrocer shut up shop and others are likely to follow. In contrast to other national institutions that are shutting up shop for Christmas, nobody knows when - if ever - it will re-open.\nPhrasal verbs\nshut (sth) down\nshut (sth) off\nnot open for business: Tourists arrived to find the shops and restaurants shut."}