{"id":329903,"name":"sick","type":"adjective","us_sound":"sɪk","us_link":"../audio/s/sic.mp3","uk_sound":"sɪk","uk_link":"../audio/s/ukshun_023.mp3","content":"sick adjective\n(ILL)\nAdd to word list\nAdd to word list\nA2 physically or mentally ill; not well or healthy: a sick child a sick cow My father has been off sick (= not working because of illness) for a long time. Anyone who could hurt a child like that must be sick (= mentally ill). The old woman fell/took/was taken sick (= became ill) while she was away and had to come home.figurative High rates of crime are considered by some people to be a sign of a sick society. See also\nheartsick literary\nhomesick\nlovesick call in sick (US also call out sick); (also phone in sick); (UK also ring in sick)\nto tell your employer, usually by phone, that you are unable to go to work because of illness: A review of the caterer’s log for that day showed that 24 employees had called in sick. Sometimes several teachers would phone in sick on the same day.US Does your company have a set protocol for calling out sick?\nMore examplesFewer examplesHer new film deals with the relationship between a woman and her sick daughter.The new president said she would dedicate herself to protecting the rights of the old, the sick, and the homeless.In his speech, he dwelt on the plight of the sick and the hungry.He had the furred tongue of a sick man.I spent most of the morning ministering to my sick husband.\nSMART Vocabulary: related words and phrases\nNot fit & healthy\nbe a shadow/shell of your former self idiom\nbe at death's door idiom\nbed\nclinically obese\ncomplain of something\ncritical list\nfrailty\ngaunt\nhollow\nhollow-eyed\ninfirm\npoorly\nrough\nsickly\ntake to your bed idiom\nundernourishment\nunhealthily\nunthrifty\nunwholesomeness\nwan\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTime off\nsick adjective\n(VOMIT)\nA2 [ after verb ] feeling ill as if you are going to vomit: Lucy felt sick the morning after the party. If you eat any more of that cake, you'll make yourself sick. See also\nairsick\ncarsick\nseasick be sick\nB1 to vomit: She was sick after she ate too much chocolate.\nMore examplesFewer examplesWe had a really rough crossing - I was sick three times.I ate so much of it one day I was sick and that cured me of my addiction.Tell me if you start to feel sick, all right?If he eats anything with wheat in it he's very sick.Just looking at a picture of the sea is guaranteed to make me feel sick.\nSMART Vocabulary: related words and phrases\nVomiting & feelings of sickness\nairsickness\nbring\nbring someone up\ncarsick\ncarsickness\nchunder\ndisgorge\ngreenly\nnausea\nregurgitate\nretch\nsick something up\nsick to your stomach idiom\nsick-making\nsickeningly\nsickness\nspew\nspew (something) up\ntravel sickness\nvomit\nSee more results »\nsick adjective\n(UNPLEASANT)\nB2 [ after verb ] informal feeling strong unpleasant emotions, especially anger or disgust: I'm sick at (= unhappy about) not getting that job. It makes me sick (= makes me very angry) to see people wearing fur coats.UK informal It's sick-making (= very annoying) that she's being paid so much for doing so little. I'm sick (and tired/to death) of (= very annoyed about) the way you're behaving. She was worried sick (= very worried) when her daughter didn't come home on time. I felt sick (= felt shocked and disgusted) when I heard about the prisoners being beaten.\n[ after verb ] informal cruel or offensive: Joan was not amused by the sick joke her brother told.\nSMART Vocabulary: related words and phrases\nInspiring dislike\naversive\ncloy\ndisgust\ndread\ndreaded\ngross\ngross someone out\nick\nit makes me (want to) puke idiom\nnon-charismatic\npuke\nrepel\nrepulse\nresistible\nrevolt\nunadmired\nunbeloved\nuncharming\nunlamented\nYou can also find related words, phrases, and synonyms in the topics:\nSerious and unpleasant\nUnkind, cruel & unfeeling\nRude and cheeky\nMaking people sad, shocked and upset\nsick adjective\n(GOOD)\nslang very good, excellent: snowboarders doing sick tricks\nThesaurus: synonyms, antonyms, and examples\nextremely pleasant, enjoyable, or likableexcellentThe food was excellent, thank you.wonderfulHave a wonderful trip!terrificThat's such terrific news, congratulations!fabulousI love her dress, it's fabulous.greatThe film was great.\nSee more results »\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nGrammar\nIll or sick?Ill and sick are both adjectives that mean ‘not in good health’. We use both ill and sick after a verb such as be, become, feel, look or seem: …\nIdioms\nsick as a dog\nsick as a parrot\nsick at heart\nsick to your stomach\nsick noun\n(ILL)\nthe sick [ plural ]\npeople who are ill: It's better for the sick to be cared for at home rather than in hospital.\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncase\ncasualty\nconvalescent\nday patient\ndonor\nepileptic\ngeriatric\nhealth tourist\ninvalid\nmedical tourist\nnon-responder\norgan donor\noutpatient\npatient\nsufferer\nunder\nvictim\nwounded\nSee more results »\nsick noun\n(VOMIT)\n[ U ] UK informal vomit: a pool of sick on the floor\nSMART Vocabulary: related words and phrases\nVomiting & feelings of sickness\nairsickness\nbring\nbring someone up\ncarsick\ncarsickness\nchunder\ndisgorge\ngreenly\nnausea\nregurgitate\nretch\nsick something up\nsick to your stomach idiom\nsick-making\nsickeningly\nsickness\nspew\nspew (something) up\ntravel sickness\nvomit\nSee more results »\nsick adjective\n(ILL)\nAdd to word list\nAdd to word list\nphysically or mentally ill; not well or healthy: We’ve got a sick cat. I feel sick. Only a sick mind could think of such things. He’s out sick (= absent because of illness). Samantha called in sick (= called to say she was ill and not coming to work).\nsick adjective\n(VOMITING)\n[ -er/-est only ] feeling as if you are going to vomit: She was so nervous she got sick. I feel sick to my stomach (= likely to vomit).\nsick adjective\n(UNPLEASANT)\n[ -er/-est only ] causing or experiencing unpleasant feelings: Michelle is sick about not getting that job. I can’t believe she lost the election – it just makes me sick.\nIdiom\nsick (and tired) of someone/something\nAdd to word list\nAdd to word list\nWORKPLACE, HR not feeling well: Peter called in sick this morning.off/out sick She's been out sick for a week.\na sick business, economy, etc. is having a lot of problems that are difficult to solve: Low interest rates often signal that an economy is sick. New executives were brought in to turn the sick company around."}