{"id":330015,"name":"side","type":"noun","us_sound":"saɪd","us_link":"../audio/s/side.mp3","uk_sound":"saɪd","uk_link":"../audio/s/uksickl006.mp3","content":"side noun\n(SURFACE)\nAdd to word list\nAdd to word list\nA2 [ C ] a flat outer surface of an object, especially one that is not the top, the bottom, the front, or the back: The names of ships are usually painted on their sides. The window on the right side of the house was open. Please write on one side of the paper only.UK I've already written four sides (= pages of writing) for my essay. Canadian coins have a picture of the British Queen's head on one side. Please use the side entrance.\nMore examplesFewer examplesQuigley clouted me smartly across the side of the head.This plan shows the front, side and back elevations of the new supermarket.You turn the television on by flipping the switch at the side.The monument was hewn out of the side of a mountain.I walked around the side of the building.\nSMART Vocabulary: related words and phrases\nSurfaces of objects\n-backed\nback\nbase\nbases\nbed\ncrust\nescutcheon\nface\nfront\nmeniscus\nmulti-sided\nnap\nobverse\noutside\noverlay\nplate\nrear\nsubstrate\nsuperficialis\nsurface area\nSee more results »\nside noun\n(EDGE)\nA2 [ C ] an edge or border of something: A square has four sides. There are trees on both sides of the road.on all sides They were surrounded on all sides/on every side by curious children.\nMore examplesFewer examplesHow many sides does a rhombus have?There are hedges around the sides of the garden.Along one side of the field was a high fence.The sides of the tablecloth are edged with lace.He was surrounded on all sides by journalists.\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\nSee more results »\nside noun\n(NEXT TO)\nB2 [ U ] a place next to something: at/by the side I have a small table at/by the side of (= next to) my bed.at/by someone's side He stayed at/by her side (= with her) throughout her long illness. See also\nalongside\naside adverb (TO ONE SIDE)\nbeside\n[ C ] US informal (also side order); (UK also side dish) in a restaurant, an extra dish of food, for example vegetables or salad, that is served with the main dish, sometimes on a separate plate: side of I’ll have a side of onion rings. side by side\nB2 next to each other: The children sat side by side on the sofa watching television.\nSee more\nMore examplesFewer examplesBoth children, disengaging themselves from their game, came to her side.Unfortunately I was sitting at the table with smokers on either side of me.Cut off any excess pastry and put it to one side.Her son walked by her side.I have a lamp at the side of my chair.\nSMART Vocabulary: related words and phrases\nNext to and beside\nabreast\nadjacency\nadjacent\nadjacently\nadjoining\nagainst\nat someone's elbow idiom\nbeside\nbordering\ncontiguity\ncontiguous\nneighbour\nnext\nnext door\nnext door but one idiom\nnon-contiguous\non\nshoulder\nshoulder to shoulder idiom\nto\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeals & parts of meals\nside noun\n(PART)\nA2 [ C ] a part of something, especially in relation to a real or imagined central line: He likes to sleep on the right side of the bed. In Britain, cars drive on the left side of the road.on someone's side (of the family) There is no money on my mother's side (of the family).on the far/other side of I could just see Joan on the far/other side of the room.from all sides Children came running from all sides (= from all directions).\nThesaurus: synonyms, antonyms, and examples\nyour relativesrelativeAll my relatives gather every year for a family reunion.extended familyHe has a very large extended family.relationShe is a distant relation of his, though I don't quite remember how.kinHe remained true to his kin.mother's/father's side (of the family)I have aunts and uncles on my mother's side of the family.\nSee more results »\nC2 [ C usually singular ] the part of the body from under the arm to the top of the leg: I have a pain in my side.\n[ C ] UK a television channel: What side is \"Coronation Street\" on? from side to side\nB2 from left to right and from right to left: The curtains were swinging from side to side in the breeze.\nSee more\n[ C usually singular ] half of an animal's body, considered as meat: She bought a side of lamb from the butcher.\nMore examplesFewer examplesAt the top of the hill I switched off the engine and we just coasted down the other side.We can now communicate instantly with people on the other side of the world.He managed to keep afloat by holding on to the side of the boat.In the US, you drive on the right hand side of the road, but in Britain the converse applies.They ran to the pool, dived in, and swam to the other side.\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe human torso\nBroadcasting: television\nCuts of meat\nside noun\n(OPPOSING GROUP)\nB2 [ C, + sing/pl verb ] one of two or more opposing teams or groups: This is a war which neither side can win.UK Our side (= team) lost again on Saturday.UK Which/Whose side are you on (= which team are you playing for/supporting)?on someone’s side Don't be angry with me - I'm on your side (= I want to help you). take sides\nto support one person or group rather than another, in an argument or war: My mother never takes sides when my brother and I argue.\nSee more take someone's side\nB2 to support someone in an argument: My mother always takes my father's side when I argue with him.\nSee more\nMore examplesFewer examplesHe was cheering for the other side.Our commiserations to the losing side!The ceasefire treaty was a dead letter as soon as it was signed, as neither side ever had any intention of keeping to it.France play with more flair and inventiveness, whereas England are a more disciplined side.The teams change ends at half-time so that neither side has an unfair advantage.\nSMART Vocabulary: related words and phrases\nGroups of people\nalliance\nan\nanti-gang\nassemblage\nbaby boomer\nfirst people\nflashmob\nflock\nfocus group\nfoursome\nline (someone) up\nmafia\nmob\nposse\npublic\nquaternity\nrabble\nretinue\nscratch\nsyndicate\nSee more results »\nside noun\n(OPINION)\nB2 [ C ] an opinion held in an argument, or a way of considering something: side to There are at least two sides to every question.side of the story I've listened to your side of the story, but I still think you were wrong to do what you did.\nMore examplesFewer examplesThe government has come down on the side of military action.Critics said judges were on the side of the establishment.He was, in this matter at least, firmly on the side of the angels.Whose side are you on in this dispute?The media seem to be on the side of the rebels.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nside noun\n(PART OF SITUATION)\nB2 [ C ] a part of a situation, system, etc. that can be considered or dealt with separately: She takes care of the financial side of things. Fortunately my boss did see the funny side of the situation. Synonyms\nangle (WAY OF THINKING)\naspect (FEATURE)\nfacet\nfeature (QUALITY)\npoint (CHARACTERISTIC)\nstrand (PART)\nSMART Vocabulary: related words and phrases\nWords meaning parts of things\nback end\nbifurcation\nbiomarker\nbranch\ncartridge\nchunk\nelement\nmodularity\nmodularized\nmodularly\nmodule\nmoiety\nmulti-branched\npanel\npiece\nsnatch\nsub-sector\nsubscale\nsubscience\nsubsection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConditions and characteristics\nside noun\n(CHARACTER)\nB2 [ C ] a part of someone's character: She seems quite fierce, but actually she has a gentle side.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nsuperego\nSee more results »\nRelated word\n-sidedIdioms\nbe two sides of the same coin\ncome down on one side of the fence or the other\nget on the right/wrong side of someone\nhave something on your side\nkeep on the right side of someone\non the large, small, etc. side\non the right/wrong side of 40, 50, etc.\non the right/wrong side of the law\non the side\nthe other side of the coin\nMore idioms\nput/lay something on/to one side\nput/leave something on/to one side\ntake/lead someone on/to one side\nthis side of something\nthe wrong/other side of the tracks\nnot in or at the centre or main part of something: side street/road We parked the car on a side street/road (= a small road, especially one that joins on to a main road).side issue I think that's a side issue (= a subject which is separate from the main one) which we should talk about later. I'd like a side dish of potatoes (= some potatoes on a separate plate).\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\nside noun\n(SURFACE)\nAdd to word list\nAdd to word list\n[ C ] a surface of something that is not the top or the bottom, or a surface of a flat object: Label all four sides of the box. I painted one side of the boat green to see if we like the color. The trail leads up the side of the mountain. Please write on only one side of the paper.\n[ C ] A side is also a surface that is not the front or the back: There’s a scratch on the side of my new bookcase.\nside noun\n(EDGE)\n[ C ] an edge or border of something: A square has four sides. We rested by the side of the river. There are trees on both sides of the road.\n[ C ]\n&#160; geometry A side is one of the edges of a flat surface.\nside noun\n(NEXT POSITION)\n[ U ] a place next to something: I have a small table by the side of my bed. a side of\na side of some type of food is a small serving of food, esp. vegetables, served in addition to the main dish: I’ll have a side of onion rings.\nside noun\n(PART)\n[ C ] a part of something, esp. in relation to a real or imagined central line: the right/left side The swimming pool is on the other side of town. I’m Irish on my mother’s side (= her family is from Ireland). Children came running from all sides (= from many directions).\nside noun\n(OPPOSING GROUP)\n[ C ] one of two or more opposing groups or people: This is a war which neither side can win. Which side are you on (= Whom do you support)? fig. The other candidate had experience on his side (= as an advantage).\nside noun\n(OPINION)\n[ C ] an opinion held in an argument, or a way of considering something: There are two sides to every argument.\nside noun\n(PERSONAL QUALITY)\n[ C ] a part of someone’s character: He has a gentle side. Idioms\non the side\nside by side\nside adjective\n(LESS IMPORTANT)\nless important or smaller than the thing it is connected with: a side issue We parked on a side street.\nside adjective\n(ON THE SIDE)\n[ not gradable ] at, on, of, or in the side of something: a side view Please use the side entrance.\nside verb [I always + adv/prep]\n(SUPPORT)\nto support one person or group rather than another in an argument or war: Peter always sides with you.\nAdd to word list\nAdd to word list\none of the two or more people or groups who are arguing, discussing, or negotiating something: Despite the difficulties, the two sides say the direct talks were helpful.the other/opposite side The other side has legitimate concerns as well.on both sides of sth Activists on both sides of the gun control issue called the judge's decision important.\nthe ideas or opinions of one of the people or groups in an argument, discussion, or negotiation: sb's side of sth We want the public to hear our side of the story.\na particular part of a job, system, business, etc.: Legal requirements are one side of his new role.the business/commercial/creative side of sth I took the job because I wanted to explore the business side of radio.\ntake sb's side\nto decide whose opinion or belief you support in an argument: take sb's side on sth Most Democrats have taken the union's side on this issue. See also\ndemand side noun\nsafe adjective\nsupply side adjective"}