{"id":330290,"name":"sight","type":"noun","us_sound":"saɪt","us_link":"../audio/s/cite.mp3","uk_sound":"saɪt","uk_link":"../audio/s/ukcirrh008.mp3","content":"sight noun\n(ABILITY TO SEE)\nAdd to word list\nAdd to word list\nB1 [ U ] the ability to see: If your sight is poor, you should not drive a car.lose your sight The old woman has lost her sight (= has become blind). Synonym\nvision (ABILITY)See also\neyesight\nMore examplesFewer examplesShe suffers from a sight defect.He has no sight in his left eye.We will know in a couple of days if the operation to restore her sight was successful.Doctors have restored his sight.She lost her sight after a car accident.\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe senses in general\nsight noun\n(VIEW)\nB2 [ C or S or U ] something that is in someone's view: The flowers at the annual flower show were a beautiful sight.keep sight of You should always keep sight of your bags (= have them where you can see them) while you're at the airport.a real sight informal He was a real sight in his old clothes (= he looked messy or silly).at the sight of The child laughed at the sight of (= when she saw) the new toy.sight of formal The lawyer requested sight of (= to see) the papers.out of your sight I don't dare let the children out of my sight (= go where I cannot see them) at the park.out of sight The police officer was hidden out of sight (= where he could not be seen) behind a tree.into sight The castle came into sight (= started to be able to be seen) as we went round a bend in the road.within sight of We're looking for a house which is within sight of (= from which it is possible to see) the mountains.in sight figurative After three years of campaigning, the end is finally in sight (= will happen soon) for Jon.catch sight of I caught sight of (= saw for a moment) my former teacher while I was out shopping today, but she turned a corner and I lost sight of (= could no longer see) her.by sight \"Do you know David Wilson?\" \"I haven't met him, but I know him by sight (= I recognize him, but do not know him).\"the sight of informal She hated/loathed the sight of (= hated) her former husband.can't bear/stand the sight of informal They used to be very good friends, but now they can't bear/stand the sight of (= hate) each other.at first sight The question seemed easy at first sight (= when they first saw it), but when the students tried to answer it, they discovered how difficult it was.\nThesaurus: synonyms, antonyms, and examples\nto see somethingseeI can see for miles from up here.noticeI noticed a crack in the ceiling.perceiveBill perceived a tiny figure in the distance.observeA teacher observed her climbing over the gate.spotWe managed to spot a leopard.catch sight ofWe looked for the bird and caught sight of it just as it flew off.\nSee more results »\nthe sights\nB1 places of interest, especially to visitors: We spent a week in Rome looking at all the sights.\nSee more sight unseen\nwithout seeing something first: I never buy anything sight unseen.\nSee more\nMore examplesFewer examplesThe sky was a perfect blue - not a cloud in sight.It was an affecting sight.I cringed at the sight of my dad dancing.The car decelerated at the sight of the police car.He faints at the sight of blood.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nsight noun\n(MUCH)\na sight informal\na lot; much: a sight more Food is a darn/damn sight more expensive than it used to be.UK He's a sight better than he was yesterday. She's a damn sight funnier than most comedians, that's for sure. The whole task would have been a damn sight easier if we'd been given proper instructions. I mean it's not perfect but it's a darn sight better than it was before.\nSMART Vocabulary: related words and phrases\nMasses and large amounts of things\naccumulation\nany number of things idiom\narmload\nbacklog\nbolus\nflood\nfoam\nhulk\ninundation\nlion\nmany\nmotherlode\npile\nthe lion's share idiom\ntsunami\nwadge\nwave after/upon wave idiom\nwedge\nwelter\nwodge\nSee more results »\nsight noun\n(GUN PART)\n[ C usually plural ] a part of a gun or other device through which you look to help you aim at something: Make sure you line up the sights before you fire the gun.\nSMART Vocabulary: related words and phrases\nParts of guns\nbanana clip\nbore\nbump stock\nbusiness end\nbutt\nclip\nflint\ngauge\nhammer\nholster\nmuffler\nmuzzle\nplier\nramrod\nsafety catch\nsilencer\nstock\ntampion\ntrigger\nSee more results »\nIdioms\nget out of my sight!\nlower your sights\nout of sight\nout of sight, out of mind\nset your sights on something\na sight for sore eyes\nto suddenly see something or someone: After days at sea, the sailors finally sighted land.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nsight noun\n(SEEING)\nAdd to word list\nAdd to word list\n[ U ] the ability to see, or the act of seeing something: Machines don’t have a sense of sight. The sight of sick children disturbs her. I know David by sight (= I know what he looks like). Officers arrested the looters on sight (= as soon as they saw them).\nsight noun\n(VIEW)\n[ C/U ] something that is in someone’s view, or the view someone has: [ C ] The finish line was a welcome sight for the runners. [ C ] Don’t let the children out of your sight. [ U ] Keep your bags in sight.\n[ C/U ] A sight is also an interesting place: [ C ] No sights in Moscow are more historic than the Kremlin.\nsight noun\n(GUN PART)\n[ C ] a device, esp. on a gun or telescope (= device for looking at objects that are far away), through which you look to help you aim at something: Locate the target in your sight.\nIdioms\na sight for sore eyes\nsight unseen\nsight verb [T]\n(SEE)\nto suddenly see something or someone: After several days at sea, the sailors finally sighted land.\nafter sight\nAdd to word list\nAdd to word list\nused to say that an amount of money must be paid within a particular number of days, months, etc. after the document showing the amount owed is received by the person paying: The bill read \"30 days after sight.\" a draft payable at two months after sight\nat sight\nused to say that an amount of money must be paid as soon as the document showing the amount owed is received by the person paying: The bank draft was marked \"at sight\". a bill that is payable at sight Compare\non demand"}