{"id":330417,"name":"signature","type":"noun","us_sound":"ˈsɪɡ.nə.tʃɚ","us_link":"../audio/s/signature.mp3","uk_sound":"ˈsɪɡ.nə.tʃər","uk_link":"../audio/s/uksiege020.mp3","content":"Add to word list\nAdd to word list\nB1 your name written by yourself, always in the same way, usually to show that something has been written or agreed by you Compare\nautograph noun\nExamples\nI mistook your signature and thought the letter was from someone else.Please print your name clearly below your signature.On display were boxing gloves which bore Rocky Marciano's signature.I'm not going to forge his signature for you! What do you take me for?His signature was an illegible squiggle at the bottom of the page.\nSMART Vocabulary: related words and phrases\nSigning & signatures\nanon\nautographically\nco-sign\nco-signatory\nco-signer\ncountersign\ninitial\nJohn Hancock\nnotarize\nsign\nsign (something) off\nsign for something\nsign for/with someone\nsign in\nsign on\nsign something away\nsigning\ntag\nthe undersigned\nunsigned\nSee more results »\nused to refer to the special thing for which a person or place is particularly known: The restaurant's signature dish is seafood paella. Some of the biggest fashion names from the 40s, 50s, and 60s continue to produce pieces in their signature styles.\nMore examplesFewer examplesA signature champagne cocktail was created for the event.Many women choose to stick to their signature scent, once they have found it, rather than face the bewildering process again. In the Black Forest region of Germany, the signature dessert is layered with chocolate, cherries, and whipped cream.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\nstamp\ntagging\ntell something/someone apart\ntraceable\nSee more results »\nAdd to word list\nAdd to word list\nyour name written in the particular way you write it, esp. on a printed document to show that you have written it yourself: I need your signature on the credit card receipt. We collected hundreds of signatures on our petition.\nAdd to word list\nAdd to word list\n[ C ] your name written by yourself, always in the same way, often used on documents to show that you have read something or that you agree to something: I need your signature on this release document He accused her of forging his signature.collect/gather signatures We are collecting signatures for a petition.\n[ U ] formal the act of signing something: I enclose one part of the contract for signature by you. See also\ndigital signature\nelectronic signature\nspecimen signature\nused to describe the product or service that a company or person is known for: Rock Fish is the signature dish of his favourite restaurant. The market for FedEx's signature product, overnight express delivery in the US, has flattened."}