{"id":330427,"name":"signer","type":"noun","us_sound":"ˈsaɪ.nɚ","us_link":"../audio/s/cdo0622ussign1676.mp3","uk_sound":"ˈsaɪ.nər","uk_link":"../audio/s/cdo0622uksign1842.mp3","content":"Add to word list\nAdd to word list\na person, organization, or country that has signed an official document: The Academy boasts a proud list of former students, including two signers of the Declaration of Independence. Nearly 300 letter writers and petition signers have questioned the fairness of the plan. Synonym\nsignatorySee also\nco-signerCompare\nnon-signer\na person who uses sign language (= a system of hand and body movements representing words, used by and to people who cannot hear or speak): She liked the idea of living in a community with signers and a mixture of hearing and deaf residents. The Director of Special Education has hired interpreters who go from class to class, providing relief for the regular signer. Compare\nnon-signer\nMore examplesFewer examplesFacsimiles of the Declaration of Independence will be available during the day for tourists to add their names to the list of original signers.He was the signer of a longterm contract that locked in relatively low power rates for the next five years.In some cases, the witness or the signer did not date their signatures, thus invalidating the documents.Sometimes the addresses listed by signers of the petition did not match addresses of registered voters of the same name.Our research showed that baby signers actually learn to talk sooner - and at age 8, they had higher IQs.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nsign on the dotted line idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of speaking\nUsing other languages"}