{"id":330379,"name":"signal","type":"noun","us_sound":"ˈsɪɡ.nəl","us_link":"../audio/s/signal.mp3","uk_sound":"ˈsɪɡ.nəl","uk_link":"../audio/s/uksiege015.mp3","content":"signal noun [C]\n(ACTION)\nAdd to word list\nAdd to word list\nB2 an action, movement, or sound that gives information, a message, a warning, or an order: When she gave (them) the signal, they all cheered. [ + that ] The fireworks were a signal that the festival had started. [ + to infinitive ] The police officer gave us the signal to stop. The signal for a race to start is often the firing of a gun.\nUS (UK indicator) a\nturn signal\nsandsun/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesAt a prearranged signal, everyone started moving forwards.I usually set my watch by the time signal on the radio.At the given signal, the group rushed forward to the barrier.I've been trying to call him all evening, but I keep getting the engaged signal.A whistle is the signal for the children to line up ready to go into the classroom.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe exterior of vehicles\nsignal noun [C]\n(WAVE)\nB2 a series of electrical or radio waves that are sent to a radio or television in order to produce a sound, picture, or message\nExamples\nThe picture quality is bad because the TV signal isn't powerful enough.The equipment sent out a regular high-pitched signal.There is some interference on the signal - do not adjust your set.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nsignal noun [C]\n(SHOWING)\nsomething that shows that something else exists or is likely to happen: The loss is a clear signal of his deteriorating confidence. The changing colour of the leaves on the trees is a signal that it will soon be autumn.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nsignal noun [C]\n(EQUIPMENT)\nequipment, especially on the side of a railway or road, often with lights, that tells drivers to stop, continue, or go more slowly: a railway signal a traffic signal a road signal\nSMART Vocabulary: related words and phrases\nRailways & railway lines\nAmtrak\nartery\nbranch line\nelectrify\nfunicular\njunction\nlevel crossing\nlight rail\nlight railway\nmetro\nmonorail\nrailroad\nrailroad tie\nRR\nsiding\nsignal box\nswitch\nswitchback\ntrack\nunderground\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads: lights, signs & markings on roads\nsignal verb\n(ACTION)\nC2 [ I or T ] to make a movement, sound, flash, etc. that gives information or tells people what to do: Flashing lights on a parked car usually signal a warning (to other drivers). He signalled left, and turned the lorry slowly. He was signalling (= giving a signal) with a red flag. She signalled for help. [ + that ] She signalled to the cars behind her that they were going the wrong way. [ + obj + to infinitive ] The children's mother signalled them to be quiet. [ + to infinitive ] The children's mother signalled to/for them to be quiet.\nMore examplesFewer examplesShe signalled to them to sit down.The ship signalled for help.A flashing light signalled that there was danger ahead.I signalled left and turned into the driveway.\nSMART Vocabulary: related words and phrases\nCommunicating & keeping in touch\nahold\nbackchannel\nbell\ncall back\ncall someone up\ncatchup\ncommunication\ncommunicative\ncommunicator\ndrop\ninteractive\npeople skills\npick\npick someone/something up\npropagation\nradio silence\nreach\nring\ntinkle\nvia\nSee more results »\nsignal verb\n(SHOW)\n[ T ] to show that you intend or are ready to do something: [ + that ] The union has signalled that the workers will strike. The union has signalled the workers' intention to strike. The death of Chairman Mao signalled (= marked) the end of an era in Chinese history.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nnoticeable and unusual: a signal success/failure\nSMART Vocabulary: related words and phrases\nUnique and unusual\naccidental\nalt-\nalternative\natypically\nbe marked out as something idiom\nguerrilla\nincongruous\ninimitable\ninimitably\nirreplaceable\npersonalized\nquaintly\nquaintness\nquirkily\nquirkiness\nuniquely\nunmatchable\nunmatched\nunparalleled\nunrivalled\nSee more results »\nsignal noun [C]\n(ACTION)\nAdd to word list\nAdd to word list\nan action, movement, or sound that gives information, a message, a warning, or an order: I tried to call but kept getting a busy signal. When the lieutenant gave the signal, five police officers charged into the apartment. In retrospect, looking at how she was acting, we should have been able to recognize the danger signals.\nA signal is also a device, often with lights, that shows people or vehicles whether to stop, go, or move carefully.\nsignal noun [C]\n(WAVE)\na series of energy waves that carry a sound, picture, or other information: a low-frequency radio signal\nsignal adjective\n(IMPORTANT)\nunusual and important: You performed a signal service to our people, and we wish to express our gratitude.\nsignal verb [I/T]\n(MAKE MOVEMENT)\nto make a movement, sound, etc. that gives information or tells people what to do: [ I ] When you learn to drive, you are told that you have to signal before you turn right or left. [ T ] The police officer signaled us to stop.\nAdd to word list\nAdd to word list\na sign that something is true or that something is going to happen: a signal to sb It is a signal to the rest of the world that we are serious about global warming. a clear/strong /important signala signal of sth It was a strong signal of the power now wielded by big institutional investors. mixed/conflicting/contradicting signals the right/wrong signal a positive signal\nCOMMUNICATIONS a series of electrical or radio waves that are sent to a radio, television, or mobile phone in order to produce a sound, picture, or message: I couldn't get a signal on my phone.\nto show that something is going to happen or that you are going to do something: Drops in sales signal a tough year ahead.signal that It recently signalled that it would not stand in the way of a takeover bid."}