{"id":330375,"name":"sign","type":"verb","us_sound":"saɪn","us_link":"../audio/s/sign.mp3","uk_sound":"saɪn","uk_link":"../audio/s/uksiege014.mp3","content":"sign verb\n(WRITE)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to write your name, usually on a written or printed document, to show that you agree with its contents or have written or created it yourself: to sign a letter/cheque/contract/lease/agreement Sign here, please. He signed his name at the end of the letter. [ + obj + noun ] He signed himself \"Mark Taylor\". She said the painting was by Picasso, but it wasn't signed.\n[ T ] in sport, to make a legal written agreement to employ a player: The team has just signed a new player.\nMore examplesFewer examplesGetting the two leaders to sign a peace treaty was his greatest accomplishment.We can't sign the agreement yet - we'll have to play for time.He asked her to sign a prenuptial agreement when they got engaged.Can I nominate someone as a proxy to sign for me?Don't sign anything until you've read the small print.\nSMART Vocabulary: related words and phrases\nSigning & signatures\nanon\nautographically\nco-sign\nco-signatory\nco-signer\ncountersign\ninitial\nJohn Hancock\nnotarize\nsign (something) off\nsign for something\nsign for/with someone\nsign in\nsign on\nsign something away\nsignature\nsigning\ntag\nthe undersigned\nunsigned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApplying for a job\nsign verb\n(BODY MOVEMENT)\n[ T or I ] to give an order or information, or make a request, using hand and body movements: [ + to infinitive ] He signed for/to the waiter to bring him another drink. [ + that ] He signed to the waiter that he wanted another drink.\n[ I or T ] to use sign language (= language used by people who cannot hear or talk)\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngesture\nnon-verbally\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap\nsnap your fingers idiom\ntongue\nwink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSigns, signals and symbols\nIdioms\nsign your own death warrant\nsign on the dotted line\nsigned and sealedPhrasal verbs\nsign something away\nsign for something\nsign for/with someone\nsign in\nsign someone in\nsign (something) off\nsign off\nsign on\nsign out\nsign someone out\nMore phrasal verbs\nsign something out\nsign something over\nsign up\nsign noun [C]\n(NOTICE)\nA2 a notice giving information, directions, a warning, etc.: a road sign a shop sign\nAHS Photography - Alex Schregardus/Moment/GettyImages\nMore examplesFewer examplesThe sign by the roadworks said 'Slow - heavy plant crossing'.The road sign points left.The sign on the gate said 'Private Property - No Admittance.'The sign on the wall said \"Please refrain from smoking.\"He hung a sign on the door of the shop that said it would reopen at 11.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\nsign noun [C]\n(BODY MOVEMENT)\nB1 a movement of the body that gives information or an instruction: She pointed to her watch as a sign that it was getting late and she wanted to leave. He made/gave a sign to his boyfriend to stop talking. The priest made the sign of the cross (= made the shape of a cross by moving his hand between four points on his chest) when he entered the church. See also\nsignal noun (ACTION)\nMore examplesFewer examplesShe made a sign to the others to come in.The conductor gave a sign for them to play louder.He made a sign to them to stand up.He pulled a face as a sign that he thought Tommy was talking rubbish.He made a spiral sign with his hand to indicate that they should turn.\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngesture\nnon-verbally\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap\nsnap your fingers idiom\ntongue\nwink\nSee more results »\nsign noun [C]\n(SHOWING)\nB1 something showing that something else exists or might happen or exist in the future: His inability to handle the situation is a sure sign of weakness. [ + that ] The fact that he's eating more is a sign that he's feeling better. I've searched for my hat, but there's no sign of it anywhere (= I can't find it). There was no sign of life in the building (= there seemed to be no one in it). Billy's work at school has shown signs of improvement this year. There is every sign that/All the signs are that the worst is over. See also\nsignal noun (SHOWING)\nMore examplesFewer examplesDoug scanned the horizon for any sign of the boat.She searched his face for some sign of forgiveness, but it remained expressionless.The detectives searched the house from top to bottom , but they found no sign of the stolen goods.A common sign of dyslexia is that the sequencing of letters when spelling words may be incorrect.High rates of crime are considered by some people to be a sign of a sick society.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nsign noun [C]\n(MARK)\nB2 a written or printed mark that has a standard meaning: + and - are mathematical signs. £ is the sign for the British pound.\nMore examplesFewer examplesHow do you write the euro sign?There was a percentage sign after the figure.Where is the degree sign on this keyboard?\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nIdiom\nsign of the times\nsign noun [C]\n(MARK)\nAdd to word list\nAdd to word list\na written or printed mark that has a standard meaning: The symbol for subtraction is the minus sign.\nsign noun [C]\n(PUBLIC INFORMATION)\na device that gives information to people who see it: a stop sign A neon sign marked the entrance to the parking garage.\nsign noun [C]\n(BODY MOVEMENT)\na movement of the hands or body that gives information or an instruction: He kept giving me the cut-throat sign to end the speech.\nsign noun [C]\n(SIGNAL)\na signal that something exists or that shows what might happen in the future: She was at least sharing her problems with me, and that was a sign of progress. There was nobody in the place, and I thought that was a bad sign. There are signs that he is thinking of running for president.\nsign verb\n(WRITE)\n[ I/T ] to write your name on a document to show that you agree with it or that you have written it yourself: [ T ] to sign a letter/contract/check [ I ] Please sign for the package when it arrives (= write your name on a form to show that you have received it).\n[ I/T ] If an organization signs someone, that person has officially become a member of the organization by agreeing to a contract: [ T ] The team signed four new players this week.\nsign verb\n(COMMUNICATE)\nto communicate by using hand movements: [ + that clause ] He signed that he’d be ready in five minutes.\nPhrasal verbs\nsign away something\nsign in\nsign off\nsign off (on something)\nsign on\nsign something over (to someone)\nsign up\nsign with someone\nAdd to word list\nAdd to word list\n[ I or T ] to write your name, usually on a written or printed document, for example to show that you agree with its contents or have written or created it yourself: sign a contract/agreement/declaration We've already agreed the details and I just need to sign a contract. sign a letter/form/cheque Please sign your name below if you are available to help. Sign here please.\nsigned and sealed (also signed, sealed, and delivered)\nfinished and official because all the necessary documents have been signed: The project can start now that the contract has been signed and sealed.\nsign on the dotted line\nto agree to do something, especially by signing an agreement: Many people sign on the dotted line without reading their policy documents.\nPhrasal verbs\nsign for sth\nsign in\nsign sb in\nsign out\nsign off\nsign (sth) off\nsign off on sth\nsign on\na flat object giving information, directions, a warning, etc.: The store had a handwritten sign in the window. A sign advertising the closing-down sale was clearly visible from the road. road/shop/street signs\na written or printed mark that has a standard meaning: + is the plus sign and % is the percentage sign.\nsomething that shows that something else exists or might happen or exist in the future: a sign of sth His inability to handle the situation is a sure sign of weakness. a sign that There are signs that the economy is improving Neither side is showing signs of backing down. All the signs are that the worst is over."}