{"id":330447,"name":"significant","type":"adjective","us_sound":"sɪɡˈnɪf.ə.kənt","us_link":"../audio/s/significant.mp3","uk_sound":"sɪɡˈnɪf.ɪ.kənt","uk_link":"../audio/s/uksiege023.mp3","content":"significant adjective\n(IMPORTANT)\nAdd to word list\nAdd to word list\nB2 (also significative) important or noticeable: There has been a significant increase in the number of women students in recent years. The talks between the USA and the USSR were very significant for the relationship between the two countries. There was no significative change of blood pressure.\nThesaurus: synonyms, antonyms, and examples\nhaving great effect or influenceimportantIt was one of the most important legal cases of the century.bigThis is a big match tonight - if we lose, we won't be in the playoffs.majorThis is a major decision so we'd better get it right.significantDid he make any significant changes to my suggestions?\nSee more results »\nMore examplesFewer examplesIs there any significant difference in quality between these two items?Research in the field of genito-urinary medicine has led to significant health advances in the last decade.The institution of a Freedom of Information Act has had a significant effect.You have all invested significant amounts of time and energy in making this project the success that it is.Lotus make luxury cars for a small but significant niche market.The treatment resulted in a major and significative reduction of the pain.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweightily\nweighty\nSee more results »\nsignificant adjective\n(SPECIAL MEANING)\nhaving a special meaning: She looked at him across the table and gave him a significant smile. Do you think it's significant that he hasn't replied to my letter yet?\nSMART Vocabulary: related words and phrases\nMeaning & significance\nacceptation\nadd\nadd up to something\nbackspin\nbadge\nbe a badge of something idiom\ni.e.\ninterpretable\nlocution\nlocutionary\nmeaning\nmeaningfully\nmeaningfulness\npurport\nsense\nspeak\nsubtext\nsubtextually\nuse\nwhat's with something? idiom\nSee more results »\nAdd to word list\nAdd to word list\nimportant, large, or great, esp. in leading to a different result or to an important change: This election reaffirms a significant shift of the center of power. Marriage is a significant commitment. significance noun [ U ] us\nYour browser doesn't support HTML5 audio\n/sɪɡˈnɪf·ɪ·kəns/\nThe full significance of space exploration may not be understood for many years to come."}