{"id":330558,"name":"silence","type":"noun","us_sound":"ˈsaɪ.ləns","us_link":"../audio/s/silence.mp3","uk_sound":"ˈsaɪ.ləns","uk_link":"../audio/s/uksilen001.mp3","content":"silence noun\n(QUIET)\nAdd to word list\nAdd to word list\nB1 [ U ] a period without any sound; complete quiet: A loud crash of thunder broke the silence of the night. Silence reigned (= there was complete silence) in the church.\nMore examplesFewer examplesThe conductor waited for dead silence before commencing the performance.After he had spoken, a deathly silence/hush fell on the room.In the silence of the night, a lone wolf howled.A screech of brakes jarred the silence.The silence was broken only by the whisper of the leaves in the gentle breeze.\nSMART Vocabulary: related words and phrases\nSilence & quiet\ncrickets idiom\ndeafening\ndeafeningly\nhushed\ninaudibly\nkeep it down idiom\nkeep something down\nmuffled\nmuted\nquiet\nquietness\nradio silence\nsilent\nsilently\nsoundlessly\nsubdued\ntrail\ntrail away/off\nunder your breath idiom\nunmute\nSee more results »\nsilence noun\n(NO SPEAKING)\nB1 [ U ] a state of not speaking or writing or making a noise: The soldiers listened in silence as their captain gave the orders. \"Silence! (= Stop talking!)\" shouted the teacher. My request for help was met with silence (= I received no answer). Their mother's angry words reduced the children to silence.\nB2 [ C ] a period of time in which there is complete quiet or no speaking: Their conversation was punctuated by uncomfortable silences.\nC2 [ U or C ] a state of refusing to talk about something or answer questions, or a state of not communicating: My request for help was met with silence (= I received no answer). Her silence about/on what had happened to her surprised everyone. I don't expect to hear from her now, after three years' silence (= three years in which she has not spoken or written to me).\nMore examplesFewer examplesCistercian monks and nuns take a vow of silence.He has maintained a dignified silence about the rumours.A jury should not interpret the silence of a defendant as a sign of guilt.No one could think of anything more to say, and the meeting lapsed into silence.We listened in silence as the names of the dead were read out.\nSMART Vocabulary: related words and phrases\nFalling silent and not speaking\nbe (on) non-speakers idiom\nbite\nbite something back\nbite your tongue idiom\nbutton your lip idiom\nclam\nclam up\ndraw\nhave nothing to say for yourself idiom\nmouth\nradio silence\nsilence is golden idiom\nspeak\nspeechlessly\nspeechlessness\nstick\nstick in someone's throat idiom\ntight-lipped\ntongue-tied\nwordless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSilence & quiet\nIdiom\nsilence is golden\nto make someone or something be quiet: The teacher raised his voice to silence the class (= to make them stop talking). Her remark about his appearance completely silenced him (= made him unable to answer).figurative The enemy's guns were silenced (= made to stop firing) in a surprise attack.\nto prevent someone from expressing their views or from criticizing or opposing someone: Big companies file lawsuits to silence their critics. The more they try to silence us, the more we will speak out. Al Capone silenced his opponents by killing them.\nSMART Vocabulary: related words and phrases\nFalling silent and not speaking\nbe (on) non-speakers idiom\nbite\nbite something back\nbite your tongue idiom\nbutton your lip idiom\nclam\nclam up\ndraw\nhave nothing to say for yourself idiom\nmouth\nradio silence\nsilence is golden idiom\nspeak\nspeechlessly\nspeechlessness\nstick\nstick in someone's throat idiom\ntight-lipped\ntongue-tied\nwordless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPreventing and impeding\nsilence noun\n(QUIET)\nAdd to word list\nAdd to word list\n[ U ] an absence of sound; complete quiet: A profound silence spread itself through the sleeping house.\nsilence noun\n(NO SPEAKING)\n[ C/U ] a state of not speaking or making noise: [ U ] The two men ate in silence and listened to traffic swishing past on the highway. [ C ] Her question was followed by a long silence (= a long period of time in which no one spoke).\nsilence verb [T]\n(STOP FROM SPEAKING)\nto stop someone from speaking or from criticizing: Successful action could silence the administration’s critics."}