{"id":330793,"name":"silly","type":"adjective","us_sound":"ˈsɪl.i","us_link":"../audio/s/silly.mp3","uk_sound":"ˈsɪl.i","uk_link":"../audio/s/uksilen017.mp3","content":"Add to word list\nAdd to word list\nB1 showing little thought or judgment: Don't do that, you silly boy! a silly mistake It was silly of you to go out in the sun without a hat.\nThesaurus: synonyms, antonyms, and examples\nstupidstupidSome people are too stupid to realize what's bad for them.foolishShe was really foolish to quit her job like that.sillyIt was silly of you to go out in the sun without a hat.crazyYou'd be absolutely crazy to marry that man.dumbUS She was terrified of asking dumb questions.\nSee more results »\nembarrassed; afraid that people will laugh at you: I feel silly in this dress. Synonym\nfoolish\nB1 not important, serious, or practical: She gets upset over such silly things. We were served our drinks in these silly little glasses.\nMore examplesFewer examplesWhat's the name of that guy on TV - you know, the American one with the silly voice?They can't expect me to accommodate all their silly little likes and dislikes.Why are you putting on that silly voice?I screamed myself silly on the roller coaster.Seriously now, did he really say that or are you just being silly?\nSMART Vocabulary: related words and phrases\nStupid and silly\nabsurd\nabsurdity\nabsurdly\nadolescent\nagainst your better judgment idiom\ndopily\ndorky\ndottiness\ndotty\ndozily\nin his/her/their wisdom idiom\nin someone's infinite wisdom idiom\ninadvisable\ninjudicious\ninjudiciously\nundiscriminating\nunintelligent\nunreasonable\nunreasonably\nunsmart\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAshamed and embarrassed\nOf little or less importance\nUnsuitable and unacceptable\nIdioms\ndrink, laugh, etc. yourself silly\nsilly billy\nAdd to word list\nAdd to word list\nshowing a lack of thought or judgment; not serious and not showing much intelligence: a silly grin I watched another silly movie last night. silliness noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈsɪl·i·nəs/\nIt’s time to stop the silliness and get serious."}