{"id":330875,"name":"silurian","type":"adjective","us_sound":"sɪˈlʊr.i.ən","us_link":"../audio/s/cdo0318ussilu4478.mp3","uk_sound":"saɪˈlʊə.ri.ən","uk_link":"../audio/s/epd25773.mp3","content":"Add to word list\nAdd to word list\nfrom or referring to the period of time between about 445 and 420 million years ago, in which fish with jaws (= mouth bones) and some plants and small animals on land first appeared: The grey slates and shales of the Silurian rock are obvious as you walk. the Silurian period\nMore examplesFewer examplesThe underlying Siktefjellet Group is likely to be Late Silurian in age, although there is no direct fossil evidence of this.It has a very local feel with its sandstone dressings, and is rendered in rough cast, a common practice in areas like this where the Silurian stone was weak.Many of these had at one time been volcanoes, the lava from which had flowed over and covered the Silurian formation in which the gold bearing quartz was found.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time\nthe Silurian\nthe period of time between about 445 and 420 million years ago, in which fish with jaws (= mouth bones) and some plants and small animals on land first appeared: marble-like fossil corals, dating from the Silurian Very recently, discoveries of some new and very well-preserved thelodonts from the Silurian of British Columbia were announced.\nMore examplesFewer examplesCurrently, biostratigraphic intervals averaging 500 000 million years are routinely recognized in the Silurian.Within a few years he had defined and classified three important periods of geological development, the Silurian, Devonian and Permian. By the late Silurian, colonization of the changing land with its newly emerging continents was well under way.\nSMART Vocabulary: related words and phrases\nGeology - general words\nAnthropocene\nanticline\nauriferous\nbiozone\ncarboniferous\ncementation\ncontinental crust\ncontinental plate\ngeologically\ngeomorphic\ngully erosion\nhenge\nHolocene\npetrographic\npetrographically\npetrography\npetrological\npetrologically\nPrecambrian\nrockfall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrehistory\nSpecific periods of time"}