{"id":330910,"name":"silver","type":"noun","us_sound":"ˈsɪl.vɚ","us_link":"../audio/s/silver.mp3","uk_sound":"ˈsɪl.vər","uk_link":"../audio/s/uksilen022.mp3","content":"Add to word list\nAdd to word list\nA2 (symbol Ag) a chemical element that is a valuable shiny, white metal, used for making cutlery (= knives, spoons, etc.), jewellery, coins, and decorative objects: We gave them a dish made of solid silver as a wedding present. Cleaning the silver (= silver objects) is a dirty job. Shall we use the silver (= knives, spoons, plates, etc. made of silver) for dinner tonight?UK I need some silver (= coins made of silver or a metal of similar appearance) for the ticket machine in the car park.\nasbe/iStock/Getty Images Plus/GettyImages\n(also silver medal [ C ]) a small disc of silver, or a metal that looks like silver, that is given to the person who comes second in a competition, especially in a sport: Great Britain won (a) silver/a silver medal in the javelin.\nbaona/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe walls of the palace are marble with silver inlay.The knives and forks are silver plate.He made his money speculating on the London gold and silver markets.I'm looking for a cloth for cleaning silver. Do you have such a thing?They are mining for silver in the area.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnetism\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nA2 made of silver, or of the colour of silver: a silver ring My grandmother has silver hair.\nMore examplesFewer examplesThe room was ostentatiously decorated in white and silver.She was wearing a little black dress, accessorized simply with a silver necklace.Robert was polishing up some old silver candlesticks.She wore a small silver brooch.Mary was wearing a beautiful silver chain around her neck.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnetism\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLess common colours\nto cover something, especially glass, with a thin layer of silver-coloured material in order to make a mirror\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nsilver noun [U]\n(METAL)\nAdd to word list\nAdd to word list\na white metal that is highly valued and used esp. in utensils, jewelry, coins, and decorative objects silver adjective us\nYour browser doesn't support HTML5 audio\n/ˈsɪl·vər/\na silver tray\nsilver adjective, noun [U]\n(COLOR)\n(of) a bright gray-white color: silver hair The book jacket was printed in silver and black."}