{"id":331121,"name":"similar","type":"adjective","us_sound":"ˈsɪm.ə.lɚ","us_link":"../audio/s/similar.mp3","uk_sound":"ˈsɪm.ɪ.lər","uk_link":"../audio/s/uksilen030.mp3","content":"Add to word list\nAdd to word list\nB1 looking or being almost, but not exactly, the same: My father and I have similar views on politics. I bought some new shoes which are very similar to a pair I had before. Paul is very similar in appearance to his brother. Synonym\nalike\nThesaurus: synonyms, antonyms, and examples\nlooking or being almost but not exactly the samesimilarI have a sofa quite similar to yours.likeShe's a lot like her mother.alikeThe girls look alike.closeMy cousin and I are quite close in age.something likeI was worried something like this would happen.\nSee more results »\nMore examplesFewer examplesThe two sisters are so similar that it's almost impossible to tell one from the other.We come from similar backgrounds, so we speak the same language.People often mix us up because we look so similar.This fabric is similar to wool, only cheaper.Insurance companies are already overburdened with similar claims.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\nGrammar\nSame, similar, identicalSame means that two or more things are exactly like one another. We can use same as an adjective before a noun or as a pronoun. When we use same to compare people or things, we must use it with the: …\nAdd to word list\nAdd to word list\nlooking or being almost the same, although not exactly: They both went to Ivy League schools and have similar backgrounds. He used similar tactics to win the last election. similarly adverb us\nYour browser doesn't support HTML5 audio\n/ˈsɪm·ə·lər·li/\nThe disease affects both sexes similarly."}