{"id":331365,"name":"simplex","type":"adjective","us_sound":"ˈsɪm.pleks","us_link":"../audio/s/cdo1121ussimp3903.mp3","uk_sound":"ˈsɪm.pleks","uk_link":"../audio/s/cdo1121uksimp3890.mp3","content":"Add to word list\nAdd to word list\nlanguage, biology, mathematics consisting of or containing a single part, structure, etc.: A parent with such a single dose of the dominant allele is called the simplex parent.\nelectronics of a communications system, allowing communication in only one direction: Radio technology refers to a simplex system when only one party can transmit at a time.\nMore examplesFewer examplesJones (1991) tested first graders on the segmentation of morphophonologically complex and simplex forms in English.Many of these studies observe that despite their semantic, structural, and pragmatic complexity, diminutives are one of the earliest, morphosyntactic form to be acquired, with both simplex and diminutized forms appearing in the speech of very young children. The simplex algorithm was used to minimize the mean-squared error between these data sets.The 3816 laser printer prints in both simplex (front side only) and duplex (both sides) modes.Data transmission flow: circuits are: Simplex: one direction; Half duplex : two directions, only one at a time; Full duplex: two directions simultaneously.\nSMART Vocabulary: related words and phrases\nCrude and basic\n101\nat bottom idiom\nbackward\nbackwardly\nbackwardness\nfolksy\nhomespun\ninelegant\ninelegantly\nlow-tech\nprimordially\nrough and ready idiom\nroughly\nroughness\nrudely\nsimple\nskeletal\nskeletally\nstone-age\nvanilla\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - general words\nlanguage a simple word that is not a combination of other words or parts of words : Several Old English simplices have the general meaning \"mind\".\nmathematics the simplest shape that is possible in a particular space : A regular simplex of dimension n is the polytope with the largest number of points that can be embedded in Rn such that all points are equidistant.\nMore examplesFewer examplesThis difference in the usage of compounds and simplexes in verse is illustrated quite concisely by a comparison of their average distributions.A d-polytope is simplicial if every proper face is a simplex.\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ndouble entendre\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: morphology & parts of words\nGeometrical shapes"}