{"id":331996,"name":"single","type":"adjective","us_sound":"ˈsɪŋ.ɡəl","us_link":"../audio/s/single.mp3","uk_sound":"ˈsɪŋ.ɡəl","uk_link":"../audio/s/uksineq016.mp3","content":"single adjective\n(ONE)\nAdd to word list\nAdd to word list\nB2 [ before noun ] one only: He knocked his opponent down with a single blow.not a single Not a single person offered to help her. You haven't been listening to a single word I've been saying. Compare\ndouble adjective\nThesaurus: synonyms, antonyms, and examples\nhaving no others like this oneonlyShe's the only one who can do it.oneHe's the one person you can rely on in a situation like this.singleYou haven't listened to a single thing I've said!lonePolice were looking for a lone gunman.soleHe was the sole survivor of the plane crash.\nSee more results »\nMore examplesFewer examplesShe insisted on telling me every single detail of what they did to her in hospital.Identical twins develop from a single fertilized egg which then splits into two.It was very difficult to encapsulate the story of the revolution in a single one-hour documentary.Not a single sound fell from her lips.He was floored with a single punch to the head.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nsingle adjective\n(NOT MARRIED)\nA2 not married, or not having a romantic relationship with someone: a single woman/man/person He's been single for so long now, I don't think he'll ever marry.single-parent family The number of single-parent families dependent on the state has risen enormously in recent years.\nMore examplesFewer examplesWomen's rights groups have cried out against the proposed cut in benefit paid to single mothers.He finds it extremely difficult being a single parent.It's hard being a single mother.Please state whether you are single, cohabiting, married, separated, divorced or widowed.Children with single parents at my school were very much in the minority .\nSMART Vocabulary: related words and phrases\nMarriage: marital status\nbachelor\nbachelorette\nbachelorhood\nbe between jobs/marriages/boyfriends, girlfriends, etc. idiom\nbetween\ngrass widow\nhoneymooners\nlive in\nmarried\nmarry\nsingleton\nspinster\nspinsterhood\nspoken for\ntrophy wife\nwidow\nwidowed\nwidower\nwidowhood\nwifely\nSee more results »\nsingle adjective\n(SEPARATE)\nB1 [ before noun ] considered on its own and separate from other things: Patience is the single most important quality needed for this job. She lost every single thing when her house burned down.\nMore examplesFewer examplesThe closure of the Manchester printing factory is the company's biggest single cutback so far.It's a huge window made from a single pane of glass.The single most important factor in health was good sanitation.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntri-\ntrilateral\ntrilaterally\ntriply\nunilateral\nSee more results »\nA baseball player singles by hitting a ball that allows him to reach first base.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nPhrasal verb\nsingle someone/something out\na record or CD that has a main song and usually a small number of other songs on it: Have you heard Lady Gaga's new single?\nin cricket, one run (= point)\nin baseball, a hit that allows the player to reach first base singles [ U ]\na game, especially in tennis, played between one player on one side and one on the other: He was one of only two Americans to win his singles match.\nSee more singles [ plural ]\npeople who are not married and do not have a romantic relationship with someone: They hold a number of social events especially for singles.\nSee more single (ticket) B1 UK\na ticket for a journey to a place, but not for the return: May I have a single to London, please.\nSee more\na\nsingle room\nSMART Vocabulary: related words and phrases\nSound and image recordings\naudiobook\nautotune\nB-side\nBlu-ray\nbox set\ncompact disc\nconcept album\njewel case\nLP\nMD\nMiniDisc\nmultitrack\nreissue\nsample\nsharpness\ntagging\ntalking head\nvideo clip\nVOD\nVR\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCricket\nBaseball & rounders\nHotels & hostels\nParts of buildings: rooms\nsingle adjective [not gradable]\n(ONE)\nAdd to word list\nAdd to word list\none only: A single customer was left in the shop.\nA single bed is a bed for one person.\nsingle adjective [not gradable]\n(SEPARATE)\nconsidered by itself or separate from other things: Taxes are the single most important source of funds for the government.\nsingle adjective [not gradable]\n(NOT MARRIED)\nnot married: He’s been single for so long, I don’t think he’ll ever marry.\nsingle noun [C]\n(DOLLAR BILL)\nA single is a one-dollar bill.\nA single is also a room for only one person.\nsingle noun [C]\n(PERSON WHO IS NOT MARRIED)\na person who is not married: Singles pay more in income tax than married people do.\nAdd to word list\nAdd to word list\none only: Journalism often relies on a single source. Is a thread of e-mails a single document or many? a single use card\nTRANSPORT\n&#160; UK travelling or allowing travel in only one direction: a single fare/ticket/journey Compare\nreturn adjective\nTRANSPORT\n&#160; UK a ticket for a journey to a place, but not back again: single to somewhere A single to London, please. Compare\nreturn noun\nMONEY\n&#160; US a piece of paper money worth one dollar"}