{"id":332109,"name":"sink","type":"verb","us_sound":"sɪŋk","us_link":"../audio/s/sink.mp3","uk_sound":"sɪŋk","uk_link":"../audio/s/uksineq027.mp3","content":"sink verb\n(GO DOWN BELOW)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to (cause something or someone to) go down below the surface or to the bottom of a liquid or soft substance: The Titanic was a passenger ship which sank (to the bottom of the ocean) in 1912. The legs of the garden chair sank into the soft ground. Enemy aircraft sank two battleships. The dog sank her teeth into (= bit) the ball and ran off with it. Related word\nsunken\nMore examplesFewer examplesWe all thought we were done for when the boat started to sink.The tanker is listing badly and liable to sink at any moment.It is hoped that the oil slick will sink to the seabed where it would be covered within a few years by sediments and eventually decompose.It's good to sink into a hot tub at the end of a hard day's work.We sank our teeth into the enormous cakes.\nSMART Vocabulary: related words and phrases\nStaying afloat, capsizing & sinking\nbail out\nbuoy\nbuoyancy\nbuoyant\nbuoyantly\ncapsize\nducking\nfloatation\nflotation\nground\nkeel over\nkickboard\noutrigger\nrefloat\nride\nright\nrun\nscupper\nsunken\nwaterlogged\nSee more results »\nsink verb\n(FALL)\nB2 [ I ] to (cause something or someone to) fall or move to a lower level: The sun glowed red as it sank slowly below the horizon. Student numbers have sunk considerably this year.UK informal We sank (= drank) a bottle of wine each last night. The wounded soldier sank (= fell) to the ground. She sank back in her chair and closed her eyes. He sank into deep despair (= became very unhappy) when he lost his job.\n[ T ] to hit a ball into a hole or pocket, especially in golf or snooker\nMore examplesFewer examplesUnemployment figures have sunk for the second year running.We sat on the mountain and watched the sun sink below the horizon.The level of teenage pregnancy sank dramatically.He sank to the ground, clutching his chest.They sank to the floor in exhaustion.\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nspiral\ntouch\ntouch down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\nsink verb\n(DIG)\n[ T ] to dig a hole in the ground, or to put something into a hole dug into the ground: Sinking more wells is the best way of supplying the population with clean drinking water. The first stage of building the fence is sinking the posts into the ground. See also\nsunken\nSMART Vocabulary: related words and phrases\nDigging\nbore\nborer\nbreak ground idiom\nburrow\ndig\ndig (yourself) in\ndig someone/something out\ndrill\nexcavate\nexcavator\nfork\nfurrow\ngrub something up/out\nplough\nplough something back/in\nprospect\nredrill\nroot something out/up\nsteam shovel\nunearth\nSee more results »\nsink verb\n(FAILURE)\n[ T ] to cause something to fail or be in trouble: This rain could sink our plans for the barbecue.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\ncostly\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\ntear\nwipe\nSee more results »\nIdioms\nsink your differences\nsink like a stone\nsink or swim\nsink to a whisper\nsink to such a level/such depths\nsink without (a) trace\nsinking fast\nsinking feeling\nsinking shipPhrasal verbs\nsink in\nsink in/sink into something\nsink into something\nsink something into something\nA2 a bowl that is attached to the wall in a kitchen or bathroom in which you wash dishes or your hands, etc.: a bathroom/kitchen sink\nImage Source/GettyImages\nMore examplesFewer examplesWe're only going on vacation for a week, but John will insist on taking everything but the kitchen sink.You'll need a strong abrasive for cleaning this sink.There's no need to get so het up about a few dirty dishes in the sink!Put the plug in the sink and run some water.The kitchen was in its original state, with a 1920s sink and stove.\nSMART Vocabulary: related words and phrases\nWashing the dishes\ndish\ndish soap\ndishcloth\ndishrag\ndishtowel\ndrainboard\ndrainer\ndraining board\ndraining rack\nhandwash\npan scourer\nroller towel\nscouring pad\nscrubber\nsink unit\ntea cloth\ntea towel\nwashing-up\nwashing-up liquid\nwaste disposal\nYou can also find related words, phrases, and synonyms in the topics:\nBathroom fixtures & fittings\nsink verb\n(GO BELOW WATER)\nAdd to word list\nAdd to word list\n[ I/T ] to move below the surface of water: [ I ] The boat filled with water and began to sink. [ T ] It isn’t clear exactly what sank the ship.\nsink verb\n(FALL)\n[ I/T ] to fall or move to a lower level: [ I ] The sun sank slowly below the horizon. [ I ] Exhausted after the race, she sank to the ground. [ I ] My feet sink into the sand with every step. [ I ] Gasoline prices sank last year. [ I ] Relations between the countries have sunk to a new low.\n[ I/T ] To sink a ball is to hit it into a hole, as in golf and pool, or throw it through a hoop (= ring with a net) in basketball. sink their teeth into\nPeople or animals who sink their teeth into something bite hard: I sank my teeth into the sandwich.\nsink verb\n(DESTROY)\n[ T ] to cause something to fail: A price war sank the company. I thought these issues would sink his career.\nIdioms\nsink or swim\nsink your teeth into somethingPhrasal verbs\nsink back\nsink in\nsink in\nsink into something\nsink into something\nsink into something\nsink something into something\nsink noun [C]\n(CONTAINER)\na container for water in a kitchen or bathroom used for washing and connected to pipes that bring and carry off water\nAdd to word list\nAdd to word list\n[ I ] if prices, profits, shares, etc. sink, they fall to a lower level: Bond prices sank and stocks rose today.sink to sth The dollar sank to a record low against the euro. Shares sank 3% Wednesday to close at $39.35.\n[ I or T ] to go under, or cause something to go under, the surface of the water: The tanker sank off the coast of Alaska. The explosion sank the ship in 300 feet of water. Phrasal verb\nsink sth into sth"}