{"id":332602,"name":"sir","type":"noun","us_sound":"sɝː","us_link":"../audio/s/sir.mp3","uk_sound":"sɜːr","uk_link":"../audio/s/uksinle011.mp3","content":"Add to word list\nAdd to word list\nB1 used as a formal and polite way of speaking to a man, especially one who you are providing a service to or who is in a position of authority: Would you like to see the menu, sir? \"Did you hear what I said?\" \"Yes, Sir.\" Compare\nmadam (WOMAN)\nMiss\nMs\nmainly UK sometimes used by children to address or refer to teachers who are men: Can I go to the toilet, sir?\nIndian English used after the name of a man, especially one who is in a position of authority, in order to be polite or show respect: John Sir Dear Sir\nB2 used to begin a formal letter to a man whose name you do not know. \"Dear Sirs\" is an old fashioned way of beginning a letter to a company: Dear Sir, I am writing in response to your recent request for information.\nSee more Dear Sir or Madam\nused to begin a formal letter when you do not know if the person you are writing to is a man or a woman: Dear Sir or Madam, I am writing to express my concern over the recent proposal to build housing on Orchard Park.\nSee more\nMore examplesFewer examplesCome hither, young sir!I'm sorry, sir, the salmon is off.Officer Clarke will show you where to go, sir.The seat of those trousers looks rather tight, sir - Would you like to try a larger size?Would you like to settle up now, sir?\nSMART Vocabulary: related words and phrases\nTeachers\nacademician\nALNCo\nassociate professor\nboard of education\nco-principal\nhandler\nhomeschooler\nhousemaster\nhousemistress\ninstructor\nlecturer\nmentor\nrector\nresidence\nschoolie\nschoolmarm\nschoolmaster\nscribe\ntrainer\ntutor\nSee more results »\nIdiom\nno sir\nused as the title of a knight (= a man who has been given a rank of honour by a British king or queen), with a first name or with both first and family names, but never with just the family name: Sir Walter (Scott)\nMore examplesFewer examplesSir Geoffrey will see you now.Sir Harold and Lady Wilson arrived at eight.\nSMART Vocabulary: related words and phrases\nRoyalty, aristocracy & titles\naccede to something\naccession\nanointed\nanti-monarchical\nanti-monarchist\nduke\ndukedom\nearl\nearldom\nemir\nMessrs\nmiss\nmister\nmonarch\nmonarchist\nroyal prerogative\nroyalist\nroyally\nRt. Hon.\nShah\nSee more results »\nsir noun [C]\n(USED TO ADDRESS)\nAdd to word list\nAdd to word list\na polite word used to address a man: Excuse me, sir, do you know what time it is?\nSir is used at the beginning of a formal letter to a man you do not know: Dear Sir\nsir noun [C]\n(USED AS TITLE)\n(also Sir)used as a title with the first or full name of a man given a rank of honor by a king or queen\nAdd to word list\nAdd to word list\na formal and polite way of speaking to a man: May I help you, Sir?\nDear Sir\nthe usual way of beginning a formal letter to a man whose name you do not know: Dear Sir, I am writing to complain about the quality of the service I received last week.\nDear Sir or Madam\nused to begin a formal letter when you do not know whether the person you are writing to is a man or a woman: Dear Sir or Madam, I am writing to inform you that I wish to cancel my credit card.\nDear Sirs old-fashioned\nused to begin a letter to a company when you do not have someone's name to write to directly Compare\nMadam"}