{"id":332866,"name":"sister","type":"noun","us_sound":"ˈsɪs.tɚ","us_link":"../audio/s/sister.mp3","uk_sound":"ˈsɪs.tər","uk_link":"../audio/s/uksinle020.mp3","content":"Add to word list\nAdd to word list\nA1 a girl or woman who has the same parents as another person: Sophie and Emily are sisters. Emily is Sophie's younger/little/older/big sister.\nThesaurus: synonyms, antonyms, and examples\na siblingbrotherHow many brothers does she have?sisterI'm one of three sisters.siblingDo you have any siblings?sibHis celebrity sib was always in the tabloids.stepbrotherDo you have any stepbrothers?\nSee more results »\na girl or woman who treats you in the kind way that a sister would: Lynn's such a good friend - she's like a sister to me.\na woman who shares an interest with you, especially that of improving women's rights: [ as form of address ] \"We must continue the fight, sisters!\"\nUS old-fashioned informal used to address a woman: [ as form of address ] OK, sister, move it!\na female member of a religious group, especially a nun: Sister Bernadette [ as form of address ] God bless you, Sister.\nUK a female nurse who is in charge of a department of a hospital: The sister told us that visiting hours were over. [ as form of address ] Excuse me, Sister, could I have some water? Compare\ncharge nurse\nMore examplesFewer examplesWhile I struggled, my sister coasted through school with top grades.You're confusing me with my sister, - she's the one studying drama.I do like her - after all, she is my sister.Not content with having upset my parents, he then insulted my sister!I've got a family crisis on my hands - my 16-year-old sister is pregnant.\nSMART Vocabulary: related words and phrases\nFamily: relations in general\nanti-family\naunt\nauntie\nbaby daddy\nbiologically\nfatherhood\nfilial\nfilially\nfirst cousin\nfraternal\nkinsman\nkinswoman\nkith and kin\nlong-lost\nloved one\nrelationally\nrelationship\nrelative\nremoved\nsecond cousin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious people: monks & nuns\nMedical treatment: doctors & health workers generally\nIdioms\nsister from another mister\nsister under the skin\nbelonging to a pair or group of similar and related things, such as businesses, usually owned or operated by the same person or organization: our sister company in Australia the US battleship Missouri and her sister ship, the Wisconsin\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmission\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nAdd to word list\nAdd to word list\na female who has the same parents as another person: an older/younger sister\nA sister is also a woman who is a member of the same race, church, religious group, or organization as others: a sorority sister\nSister may be used as a form of address to a woman.\nAdd to word list\nAdd to word list\nused to describe one of the organizations or companies in a pair or group of similar organizations when referring to it in relation to the others: The competition is being run in conjunction with our sister publication Money Observer. sister company/organization Compare\nparent company"}