{"id":332909,"name":"site","type":"noun","us_sound":"saɪt","us_link":"../audio/s/cite.mp3","uk_sound":"saɪt","uk_link":"../audio/s/ukcirrh008.mp3","content":"site noun [C]\n(PLACE)\nAdd to word list\nAdd to word list\nB1 a place where something is, was, or will be built, or where something happened, is happening, or will happen: a building site The company hasn't yet chosen the site for the new hospital. This is the site of the accident. on site\nC1 inside a factory, office building, etc.: There are two restaurants on site. The office complex has an on-site nursery. off site\naway from a factory, office building, etc.: The next time the meeting had to be held off site. It is more difficult to manage off-site employees.\nMore examplesFewer examplesa derelict siteThey're planning to develop the whole site into a shopping complex.Armed guards are posted around the site.Houses have been built on the periphery of the factory site.So far, only the westerly part of the site has been developed.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nsite noun [C]\n(INTERNET)\nA2 a website\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nsite noun [C]\n(TENT)\n[ C ] US (UK pitch) the piece of ground on which you can put up a tent, park a caravan, etc.: We chose a large, level site for our tent.\nSMART Vocabulary: related words and phrases\nCamping\nbackpack\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\ntent\nSee more results »\nto exist or be built in a particular place: The company's head office is sited in Rome.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nAdd to word list\nAdd to word list\na place where something is, was, or will be: The fort is now a historic site. The fan club has its own Web site.\nAdd to word list\nAdd to word list\nINTERNET a place on the internet where a person, company, or organization can give information about their products or services: The student activities page is the most viewed page on the college's site. eBay was founded as the first internet auction site in 1995. access/search/visit a site build/create/design a site host/set up a site\nPROPERTY an area of land or place where a particular business, industrial, manufacturing, etc. activity happens or is planned to happen: The plant sits on a 37-acre site in a field off a rural road. We provide generators and small natural-gas compressors for drilling sites. Plans by a private property company to build offices on a prime site in Kensington face rejection by local councillors. This is the proposed site for the gasworks. a building/construction site See also\nbrownfield\ndestination site\ngreenfield site\nmirror site\noff-site\nonsite adverb\nrun of site\nsocial networking site\nwebsite\nworksite\nto build something in a particular place: be sited The wind turbines would be sited about 20 miles offshore. The rail company does not need planning permission to erect the communications masts as long as they are sited on railway land. Siting landfills has become more difficult as public awareness grows."}