{"id":333054,"name":"size","type":"noun","us_sound":"saɪz","us_link":"../audio/s/size.mp3","uk_sound":"saɪz","uk_link":"../audio/s/uksitua011.mp3","content":"size noun\n(AMOUNT)\nAdd to word list\nAdd to word list\nA2 [ C or U ] how large or small something or someone is: We are concerned about the size of our debt. Some kinds of trees grow to a huge size. What is the size of that window?in size The field was about ten acres in size.size of He had a lump on his head the size of (= the same size as) an egg.a good size The baby is a good size (= quite large). I was amazed at the size of their kitchen (= it was very big).\nMore examplesFewer examplesReducing the size of classes may improve educational standards.The fruit is washed and then graded by size.We were horrified at the size of the bill.My foot swelled up to three times the normal size when it was stung by a wasp.He's twice her size.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nsize noun\n(MEASURE)\nA2 [ C ] one of the standard measures according to which goods are made or sold: a size 14 dressin children's/petite/plus/etc. sizes Do these shoes come (= are they made) in children's sizes? What size are you?/What is your size?/What size do you take?try something (on) for size Would you like to try the coat (on) for size (= see how well it fits you), sir?to size We'll need to get the carpet cut to size (= cut so that it fits).\nMore examplesFewer examplesCould I try these shoes in a bigger size?I take a size five in shoes.What size shoes do you take?I couldn't find anything in the shop in my bust size.This jacket is a bit tight - do you have it in a larger size?\nSMART Vocabulary: related words and phrases\nMeasurements in general\naltitude\nbathymetric\nbathymetrically\nbathymetry\nbe running at something idiom\ncalibrate\ndrop\nelevation\nfactor\nknee-length\nmetric\nmetrication\nmicro\nmilli-\nscale\nsetting\ntera-\nuncalibrated\nunmeasurable\nunsized\nSee more results »\nsize noun\n(GLUE)\n[ U ]\n&#160; fabrics &amp; fashion, art\n&#160; specialized a substance like glue that gives stiffness and a hard, shiny surface to cloth, paper, etc.\nSMART Vocabulary: related words and phrases\nGlues, gluing & stickiness\nadhere\nadherent\nadhesion\nadhesive\nadhesively\nbinder\ngloop\ngloopy\nglue\nglue gun\nglue stick\npitchy\npropanone\nputty\nScotch tape\nself-adhesive\nSuper Glue\ntackiness\ntreacly\nviscid\nSee more results »\nIdiom\nthat's about the size of it\nto cover or treat cloth, paper, etc. with size\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\nPhrasal verb\nsize something/someone up\nsize noun\n(DEGREE)\nAdd to word list\nAdd to word list\n[ C/U ] the degree to which something or someone is large or small: [ C ] an average size [ U ] to double in size [ U ] Have you seen the size of their house? [ C ] Skirts come in many colors and sizes. [ U ] The camera is roughly the size of a business-card case.\nsize noun\n(MEASURE)\n[ C ] one of the standard measures according to which goods are made or sold: She generally wears a size 12. What is your shoe size? The boxes come in many sizes.\nsize adjective\n(OF PARTICULAR DEGREE)\nof a particular size: The house is tiny, just three medium-size rooms and a kitchen. We can give you a special rental rate on a full-sized car (= a large car).\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MEASURES one of the standard measures according to which things are made or sold: a size 14 dress The products come in three sizes.\n[ C or U ] how big or small something is: The maximum loan size is €125,000. Voters were angry at the size of the budget deficit. No matter what size company you work for, you will learn valuable lessons about how to find your customers and reach out to them. Regardless of size and industry, most organizations devote considerable time and resources to developing unique, profitable areas of competence. Despite the potential market size, no bank was interested in their proposal.double/triple/quadruple in size The share sale will enable the company to double in size over the next three years.\none size fits all\nthe idea that one set of rules, one solution, etc. is suitable for any situation: The major charitable foundations were working on the assumption that one size fits all. When it comes to choosing an online broker, one size doesn't always fit all.\nSee also\neconomy-size\nfull-size\ngiant-size\nking-size\nlarge-sized\nmedium-sized\none-size-fits-all\npalm-sized\npocket-sized\nto make something a particular size: Word allows you to size the font in a document.\nto measure how big or small something is: Demographic data is critical in helping companies size their markets. See also\nright-size"}