{"id":333837,"name":"slack","type":"adjective","us_sound":"slæk","us_link":"../audio/s/slack.mp3","uk_sound":"slæk","uk_link":"../audio/s/ukskunk017.mp3","content":"slack adjective\n(NOT TIGHT)\nAdd to word list\nAdd to word list\nnot tight; loose: These tent ropes are too slack - they need tightening.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\nsuppleness\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nslack adjective\n(NOT ACTIVE)\nshowing little activity; not busy or happening in a positive way: business is slack Business is always slack at this time of year.UK disapproving Discipline in Mr Brown's class has become very slack recently.UK disapproving The job is taking a long time because the workmen are so slack.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nSee more results »\nRelated word\nslackly\nslack noun\n(NOT TIGHT)\n[ U ] the fact that something is too loose: There's too much slack in these ropes.take up the slack The men pulled on the ropes to take up the slack (= to tighten them).\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\nsuppleness\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nslack noun\n(TROUSERS)\nslacks [ plural ] US or UK old-fashioned\na pair of trousers that are in the style of trousers worn as part of a suit, and that are considered fairly formal but not as formal as a suit: wool slacks\nSee more\nslack noun\n(COAL)\n[ U ] very small pieces and dust from coal\nSMART Vocabulary: related words and phrases\nFuels\nbioethanol\nbiofuelled\nbiomaterial\nbriquette\nCHP\ncoal\ncoalification\ncogeneration\nfuel\ngasometer\nguzzle\nhickory chips\nmesquite\nnon-fuel\nnon-petroleum\nnuclear\nnuclear power\noil-fired\npropellant\nsolar panel\nSee more results »\nIdiom\npick up/take up the slack\nto work more slowly and with less effort than usual, or to go more slowly: slack off/up Everyone slacks off/up at the end of the week.disapproving You'll be in trouble if you're caught slacking on the job.slack off your speed Slack off your speed as you approach the corner.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nSee more results »\nslack adjective [-er/-est only]\n(NOT TIGHT)\nAdd to word list\nAdd to word list\nnot tight; loose: His jaw went slack, and he looked puzzled.\nslack adjective [-er/-est only]\n(NOT ACTIVE)\nshowing a lack of activity; not busy or happening in a positive way: The teachers are kind of slack about enforcing rules.\nslack noun [U]\n(LOOSE STATE)\nthe state of being too loose or not tight enough: There was too much slack in the cable.\nslack noun [U]\n(SLOW STATE)\na period when something is slower or less active than usual: the midsummer slack Idiom\npick up the slack\nAdd to word list\nAdd to word list\nif business or economic activity is slack, there is less activity than usual: He wanted to sell some of his rental homes, but the region's slack economy stopped him. May was a very slack month for the entire industry. slack market/demand/salesslack time/period Summer is usually a slack time for energy demand.\nsomething that is slack is not strict or effective enough: Experts say that slacker financial controls may be to blame. There were claims in the media of slack corporate governance.\nsomeone who is slack is not working hard enough or spending enough time or care on something: Businesses that shout loudest about delayed payments are often the worst slack payers.be slack with something She's always been a bit slack with her accounts.\nresources, such as money, people, or time, that are not being used at a particular time: At the moment we have very little slack for dealing with emergencies.slack in something Anne and Bill didn't have enough slack in their household budget.\npick/take up slack\nto make a business, industry, or economy operate more effectively by doing the work that someone else has stopped doing but that still needs to be done: More business investment would pick up the slack in the economy. The drug maker is having problems with production, but none of its competitors have taken up the slack. slackness noun [ U ]\nThere has been some slackness in the labor market this quarter."}