{"id":333953,"name":"slant","type":"verb","us_sound":"slænt","us_link":"../audio/s/slant.mp3","uk_sound":"slɑːnt","uk_link":"../audio/s/uksland006.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to (cause to) lean in a position that is not vertical; to (cause to) slope: Italic writing slants to the right. The evening sun slanted (= shone with the light moving in a slope) through the narrow window.\n[ T ] often disapproving to present information in a particular way, especially showing one group of people, one side of an argument, etc. in such a positive or negative way that it is unfair: The police claimed that reports in the media were slanted against/towards the defendant.\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitch\npitched\nrake\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\ntilt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnfairness and favouring someone unfairly\n[ S ] a position or direction that is sloping: The car was parked on a slant. The snow came down at a slant.\n[ C usually singular ] a particular way of showing or looking at something: The book had a personal/political/sociological slant.\nThesaurus: synonyms, antonyms, and examples\na feeling or opinion about something or someoneattitudeHis attitude towards authority has often got him into trouble.outlookI wish I could share your positive outlook on life.frame of mindI need to be in the right frame of mind to talk about this.approachIt's time to try a different approach to the problem.viewpointHis viewpoint is his own and does not affect how I think about the issue.point of viewFrom a strictly financial point of view it looks like a positive change.\nSee more results »\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitch\npitched\nrake\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\ntilt\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOpinions, beliefs and points of view\nRelated word\nslantwise\nslant verb\n(LEAN)\nAdd to word list\nAdd to word list\n[ I ] to lean in a diagonal direction, or to cause (something) to slope: Rays of sunlight slanted down on her.\nslant verb\n(GIVE OPINION)\n[ T ] to present information by ignoring or hiding some things and emphasizing other things: He was known to slant reports, writing what his boss wanted to hear.\nslant noun\n(OPINION)\n[ C ] someone’s opinion about a subject that is expressed by ignoring or hiding some information and emphasizing other information: He put his own liberal slant on the general’s writings.\nslant noun\n(SLOPE)\n[ U ] a position that is leaning or sloping: Most ocean beaches are on a slant."}