{"id":333991,"name":"slash","type":"verb","us_sound":"slæʃ","us_link":"../audio/s/slash.mp3","uk_sound":"slæʃ","uk_link":"../audio/s/uksland017.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to cut with a sharp blade using a quick, strong movement: The museum was broken into last night and several paintings were slashed. She tried to commit suicide by slashing her wrists. We had to slash (our way) through the long grass to clear a path.\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\n[ T ] informal to very much reduce something, such as money or jobs: Prices have been slashed by 50 percent!\nMore examplesFewer examplesOn one car all the tyres had been slashed.His throat had been slashed.He was slashed across the chest three times and stabbed.Since 1993 the company has cut 65,000 jobs and slashed costs by £3 billion.The budget has since been slashed.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\nslash noun\n(PUNCTUATION)\nB2 [ C ] (UK also oblique (stroke)) the symbol / used in writing to separate letters, numbers, or words: You often write a slash between alternatives, for example, \"and/or\". See also\nbackslash\nforward slash\n[ C ] spoken (UK also oblique (stroke)) used to mean \"or\", or to show that something has two uses: The room functions as a guest bedroom slash study.\nSMART Vocabulary: related words and phrases\nPunctuation\nabbreviated\naccent\nacute\napostrophe\nat sign\nblock capitals\ncaron\ncolon\ncomma\ndiacritical\ndouble prime\npunctuation mark\nsemicolon\nsmall cap\nsmall capitals\nsolidus\nstroke\ntilde\nunbracketed\nuncapitalized\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: connecting words joining words or phrases with similar or related meanings\nslash noun\n(CUT)\na long, deep cut\n[ C ] a fast, long movement to hit something: Ben took a wild slash at the ball and luckily managed to hit it.\n[ C ] a decorative opening in a piece of clothing, often with a different colour showing through it: My new dress is pale blue, with a dark blue slash in the sleeves.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHitting and beating\nParts of clothes\nslash noun\n(TOILET)\n[ S ] UK slang the act of going to the toilet and urinating\nSMART Vocabulary: related words and phrases\nAnimal physiology: urine & urinating\naccident\nbathroom\nbodily function\nexcrete\nexcretion\ngenitourinary\ngo to the bathroom idiom\nleak\npass\npass water idiom\npee\npiddle\ntake a leak/have a leak idiom\ntinkle\nuric\nwater\nwaterworks\nwazz\nwee\nwet your pants idiom\nSee more results »\nslash noun\n(STORIES)\n[ U ] slang (also slash fiction) a type of fanfiction (= stories written about TV, film, or book characters by their fans) in which two male characters are imagined to have a sexual relationship: Slash focuses on the homoerotic pairing of male characters such as Captain Kirk and Mr. Spock of Star Trek. \"Slash for me is ideal fiction because I dislike female characters,\" she said. See also\nfemslash slang\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\ninscription\nintertextual\nintertextuality\nintertextually\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nversification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLiterature\nGrammar\nPunctuationThe most common punctuation marks in English are: capital letters and full stops, question marks, commas, colons and semi-colons, exclamation marks and quotation marks. …\nPunctuation: dashes ( – ) and other punctuation marksDashes are more common in informal writing. They can be used in similar ways to commas or semi-colons. Both single and multiple dashes may be used: …\nslash verb\n(REDUCE)\nAdd to word list\nAdd to word list\n[ T ] to reduce an amount by a lot: Airfares have been slashed on most domestic routes.\nslash verb\n(CUT)\n[ I/T ] to cut someone or something with a sharp blade in a quick, swinging action: [ I ] Arauz slashed through brush with a machete.\nslash noun [C]\n(SLOPING LINE)\na mark in the form of a sloping line (/), used in signs to mean not permitted, and to separate numbers or words: The no-parking sign had a red slash through a picture of a car. Fractions are often written with slashes, for example 2/3.\nslash noun [C]\n(REDUCTION)\na large reduction in an amount: a slash in prices\nAdd to word list\nAdd to word list\nto reduce the number or level of something by a large amount suddenly: American businesses slashed 200,000 jobs in September. slash prices/costs/ratesslash sth from sth The retail giant is slashing €65m from prices.\nthe symbol (/), used to show a range of possibilities, or between the two numbers of a fraction: The address for this web page starts with http: and two slashes. Two thirds is written as 2 slash 3. Compare\nbackslash\nforward slash"}