{"id":334179,"name":"sleep","type":"noun","us_sound":"sliːp","us_link":"../audio/s/sleep.mp3","uk_sound":"sliːp","uk_link":"../audio/s/ukslave022.mp3","content":"sleep noun\n(NOT AWAKE)\nAdd to word list\nAdd to word list\nB1 [ U ] the resting state in which the body is not active and the mind is unconscious: I haven't had enough sleep. Teenagers need more sleep than adults.get some sleep I must get some sleep - I'm exhausted. Go home and get some sleep. I like at least seven hours' sleep a night. Synonyms\nkip UK informal\nshuteye informal , old-fashioned in UK\nslumber literarySee also\nsleepwalker go to sleep\nto start sleeping: You'll find that your baby usually goes to sleep after a feed.\nSee more get to sleep\nB1 to succeed in starting to sleep: I couldn't get to sleep at all last night, I was so worried.\nSee more\nB1 [ C ] a period of sleeping: have a sleep UK You must be tired after all that driving - why don't you have a little sleep?fall into a deep sleep He fell into a deep sleep.good night's sleep You'll feel better after a good night's sleep.\n[ C ] informal a night's sleep, used especially when saying how far away in time something is: It's only one more sleep till we go to Disneyland! How many sleeps until I see you again, Daddy?\nMore examplesFewer examplesGet a good night's sleep and you'll feel better able to cope.She fell into a lovely deep sleep.I'm not feeling very alert today - not enough sleep last night!It was so hot that I didn't get off to sleep till three o'clock.She grinds her teeth in her sleep.\nSMART Vocabulary: related words and phrases\nAnimal physiology: sleep & sleeping\nbeauty\nbed\nbunk\nbunk down\nbye-byes\ncatch/cop/get some z's idiom\ncount\ncrash\ndelayed sleep phase pattern\ndoss\ndrift off\ndrop\npower nap\nsnooze\nsnoozing\nsomnambulate\nsomnambulist\nsomnolence\nsoporifically\nyour beauty sleep idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeriods of time - general words\nsleep noun\n(SUBSTANCE)\n[ U ] informal a yellowish substance sometimes found in the corners of the eyes after sleeping\nSMART Vocabulary: related words and phrases\nAnimal physiology: bodily fluids & their production\nbilirubin\nbodily fluid\nbogy\nbooger\nbucket\ndribbling\ngob\nlather\npus\nsaliva\nsalivation\nsemen\nserous\nslag\nslobber\nslobbery\nsnotty\nspittle\nsputum\nsweatily\nSee more results »\nIdioms\ncould do something in your sleep\ngo back to sleep!\ngo to sleep\nput something to sleep\nA1 [ I ] to be in the state of rest when your eyes are closed, your body is not active, and your mind is unconscious: I couldn't sleep because of all the noise next door.sleep late I slept late on Sunday morning.sleep at night How can Jayne sleep at night with all those worries on her mind!sleep the night We had dinner with Ann and Charles and slept the night there (= at their home). See also\noversleep\nsleepout Australian English\n[ T ] If a vehicle, tent, etc. sleeps a particular number of people, it provides enough space or beds for that number of people to be able to sleep in it: The tent sleeps four comfortably. sleep like a log informal\nto sleep very well: I went to bed early and slept like a log.\nSee more sleep on something\nC2 to delay making a decision about something important until the next day so that you have time to consider it carefully: Can I sleep on it, and tell you my decision tomorrow?\ninformal to pay no attention to something important or impressive: It would be mad to sleep on such an opportunity.\nSee more sleep rough\nUK to sleep outside because you have no home and no money: Hundreds of kids are sleeping rough on the streets of the capital.\nSee more sleep tight\nsaid to someone who is going to bed to tell them you hope they sleep well: Sleep tight - see you in the morning.\nSee more\nMore examplesFewer examplesHaving a milky drink before bed helps me sleep.My brother and I slept in the same room.He likes to sleep on the right side of the bed.I'm so tired I could sleep in this chair!I slept terribly last night.\nSMART Vocabulary: related words and phrases\nAnimal physiology: sleep & sleeping\nbeauty\nbed\nbunk\nbunk down\nbye-byes\ncatch/cop/get some z's idiom\ncount\ncrash\ndelayed sleep phase pattern\ndoss\ndrift off\ndrop\npower nap\nsnooze\nsnoozing\nsomnambulate\nsomnambulist\nsomnolence\nsoporifically\nyour beauty sleep idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccommodating people\nRelated word\nsleepingIdioms\nsleep at night\nsleep like a babyPhrasal verbs\nsleep around\nsleep in\nsleep something off\nsleep over\nsleep through something\nsleep together\nsleep with someone\nAdd to word list\nAdd to word list\nthe resting state in which the body is not active and the mind is unconscious: I usually sit up in bed and watch the TV news before going to sleep.\nto be in a resting state in which the body is not active and the mind is unconscious: [ I ] I was too excited to sleep much that night. [ T ] The boat sleeps four (= has space for four people to sleep) comfortably. Idioms\nsleep it off\nsleep like a log\nsleep on itPhrasal verb\nsleep in"}