{"id":334314,"name":"slickly","type":"adverb","us_sound":"ˈslɪk.li","us_link":"../audio/s/cdo0623usslic3701.mp3","uk_sound":"ˈslɪk.li","uk_link":"../audio/s/cdo0623ukslic3724.mp3","content":"slickly adverb\n(SKILFULLY)\nAdd to word list\nAdd to word list\nin a way that operates or happens skilfully and effectively, without problems and without seeming to need effort: Pop music there is dominated by slickly packaged songs and videos. The restaurant is a very slickly run operation with an ambitious menu, well-prepared food, and efficient service.\ndisapproving in a way that is skilful and effective but not sincere or honest: She offered them employment while also slickly exploiting them. She wasn't sure she wanted to accept his slickly charming offer.\nMore examplesFewer examplesThe new book is neither slickly written nor edited, but it is sincere.Don't expect slickly trained chefs.He is far more slickly ambitious than his colleagues.He drove slickly into the parking space.They passed the ball around slickly throughout the game.\nSMART Vocabulary: related words and phrases\nSkilled, talented and able\nable\nably\naccomplished\nadept\nadeptly\ndexterous\ndexterously\ndigital native\nexpert\nexpertly\npedicure\npedigreed\npolished\npractised\nproficient\nup to (doing) something idiom\nwell qualified\nwhite-collar\nwith the best of them idiom\nworkmanlike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffected & insincere\nslickly adverb\n(SMOOTHLY)\nin a way that is smooth, and moves easily: The lid closes smoothly, and the volume control turns slickly. The ball skidded slickly across the grass.\nMore examplesFewer examplesThey led me slickly indoors.She whizzed slickly from page to page of her computer database.\nAdd to word list\nAdd to word list\nin a way that is very clever or attractive, but lacks real meaning or importance: a slickly modern hotelslickly produced/packaged/marketed The film is a slickly produced promotional piece."}