{"id":334300,"name":"slicing","type":"verb","us_sound":"slaɪs","us_link":"../audio/s/slice.mp3","uk_sound":"slaɪs","uk_link":"../audio/s/uksleep016.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nslice\nslice verb\n(CUT)\nB2 [ T ] to cut something into thin, flat pieces: Slice the mushrooms thinly and fry in butter. [ + two objects ] Could you slice me a very thin piece of cake/slice a very thin piece of cake for me?\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\n[ I + adv/prep ] to easily cut into or through something with a sharp knife: He screamed as the blade sliced into his leg.figurative She watched his slim strong body as it sliced effortlessly through the water.\nMore examplesFewer examplesPeel off the skins and thickly slice the potatoes.Slice the onions as thin as you can get them.Take off the heat and slice the bananas lengthways.With a very sharp knife, slice the beef as thinly as possible.He accidentally sliced the top off his finger while he was cutting vegetables.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nslice verb\n(HIT)\n[ T ] in the sports of golf and baseball, to hit a ball so that it goes to one side rather than straight in front: Sara sliced the ball, sending it a hundred yards or so to the left.\n[ T ] If you slice the ball in a game of tennis, you hit the bottom of the ball so that it does not bounce very high when it hits the ground.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\nfade\nfore\nfringe\ngolf ball\noutdrive\nouthit\nputting green\nround\nslice\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nTennis & racket sports\nIdiom\nany way you slice itPhrasal verb\nslice something off"}