{"id":334292,"name":"slice","type":"noun","us_sound":"slaɪs","us_link":"../audio/s/slice.mp3","uk_sound":"slaɪs","uk_link":"../audio/s/uksleep016.mp3","content":"slice noun\n(PIECE)\nAdd to word list\nAdd to word list\nA2 [ C ] a flat, often thin, piece of food that has been cut from a larger piece: a slice of bread/cake cucumber/lemon slices Would you like another slice of ham/beef?\nDorling Kindersley/GettyImages\nC2 [ S ] a part of something, such as an amount of money: We agreed before we did the deal that we'd both take an equal slice of the profit. The film presents us with a fascinating slice of history.\n[ C ] a kitchen utensil with a wide blade, used for serving pieces of food: a cake/fish slice\nhoriyan/iStock / Getty Images Plus/GettyImages\nMore examplesFewer examplesa slice of toastShe took a slice of chocolate cake and smothered it in cream.Layer the pasta with slices of tomato.She cut two slices of noticeably unequal size.Could you cut me a smaller slice?\nSMART Vocabulary: related words and phrases\nWords meaning small pieces and amounts\nby a nose idiom\nclipping\ncrumb\ndab\ndash\ndollop\ngrain\nort\nparing\npeewee\npinch\npotsherd\nskinny\nspark\nswatch\ntad\nthimbleful\ntidbit\ntiddler\ntrace\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning parts of things\nKitchen utensils\nslice noun\n(HIT)\n[ C ] in tennis, the action of hitting the bottom of the ball so that it does not bounce very high when it hits the ground: That wonderful backhand slice of Maria's sends the ball where her opponent just can't reach it.\nin the sports of golf and baseball, the action of hitting a ball so that it goes to one side rather than straight in front\nSMART Vocabulary: related words and phrases\nTennis & racket sports\nadvantage\nbackhand\nball boy\nball girl\nbaseline\nbird\nbreak\ncode violation\ncourt\ndouble\ndouble fault\ngroundstroke\nlob\noverhead\nserve\nsquash\nsweet spot\nunreturnable\nunseeded\nvolley\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGolf\nBaseball & rounders\nIdioms\na slice of life\nslice of the cake\nslice verb\n(CUT)\nB2 [ T ] to cut something into thin, flat pieces: Slice the mushrooms thinly and fry in butter. [ + two objects ] Could you slice me a very thin piece of cake/slice a very thin piece of cake for me?\nThesaurus: synonyms, antonyms, and examples\nto cut somethingcutOuch, I've cut my finger!chopHe was chopping vegetables to make a stew.sliceSlice the mushrooms and fry them in butter.snipShe snipped the corner off the soup packet.slitHe slit open the envelope with a knife.carveHe carved her name on a tree.\nSee more results »\n[ I + adv/prep ] to easily cut into or through something with a sharp knife: He screamed as the blade sliced into his leg.figurative She watched his slim strong body as it sliced effortlessly through the water.\nMore examplesFewer examplesPeel off the skins and thickly slice the potatoes.Slice the onions as thin as you can get them.Take off the heat and slice the bananas lengthways.With a very sharp knife, slice the beef as thinly as possible.He accidentally sliced the top off his finger while he was cutting vegetables.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshave\nshearing\nsheep shearing\nslash\nsliced\nslit\nsnip\nspike\nSee more results »\nslice verb\n(HIT)\n[ T ] in the sports of golf and baseball, to hit a ball so that it goes to one side rather than straight in front: Sara sliced the ball, sending it a hundred yards or so to the left.\n[ T ] If you slice the ball in a game of tennis, you hit the bottom of the ball so that it does not bounce very high when it hits the ground.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nstiff\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBaseball & rounders\nTennis & racket sports\nIdiom\nany way you slice itPhrasal verb\nslice something off\nAdd to word list\nAdd to word list\na flat, often thin piece of food that has been cut from a larger piece: a slice of bread/cake/pizza\nfig. A slice is also any small part that has been separated from something larger: She demanded a slice of the profits. slice of life\nIf you describe a story as a slice of life, you mean that it shows ordinary details of the lives of the people mentioned: The drama is a slice of life about Puerto Ricans living in the Bronx. Idiom\nany way you slice it\nto cut something into thin pieces, or to cut one or more thin pieces from something: Slice the onions and fry them in butter.\nAdd to word list\nAdd to word list\na part or share of something, especially an amount of money: a/sb's slice of sth The energy development company has quickly increased its slice of the US market. She agreed to help us out in exchange for a slice of the profits.a big/large/small slice of sth The best plan would be to buy a bigger slice of the network."}