{"id":334329,"name":"slide","type":"verb","us_sound":"slaɪd","us_link":"../audio/s/slide.mp3","uk_sound":"slaɪd","uk_link":"../audio/s/uksleep022.mp3","content":"slide verb\n(MOVE)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause to) move easily and without interruption over a surface: When I was little I used to like sliding on the polished floor in my socks. We have one of those doors in the kitchen that slides open. He slid the letter into his pocket while no one was looking. sliding doors\nMore examplesFewer examplesI slid down the hill.She slid her hand into his pocket.She slid her legs from under the duvet and got up stealthily.Hardly aware of what she was doing, Susie slid her hand up to his shoulder.She slid into the seat next to him.\nSMART Vocabulary: related words and phrases\nAdvancing and moving forward\nadvance\nadvancing\nballistically\nbeeline\ncome\ncome over\ncome up\ncruise\ngain\nghost\nglide\nhead\nlead\nmake for somewhere/something\nmake towards something/someone\nproceed\nprogress\npull\npush\nrun\nSee more results »\nslide verb\n(GET WORSE)\n[ I ] to go into a worse state, often through lack of control or care: The dollar slid against other major currencies. Car exports slid by 40 percent this year. He was improving for a while, but I think he's sliding back into his old habits. I was doing really well with my diet, but I've let it slide (= not tried so hard) recently. See also\nbackslide\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\nslide noun\n(MOVEMENT)\n[ C ] a sudden movement of a large mass of mud (= wet earth) or rock down a hill: a mud/rock slide See also\nlandslide (FALLING EARTH)\n[ C ] a structure for children to play on which has a slope for them to slide down and usually a set of steps leading up to the slope\nizzzy71/iStock/Getty Images Plus/GettyImages\na part that moves easily backwards and forwards on an instrument or machine: the slide on a trombone\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlay areas for children\nMachines - parts\nslide noun\n(WORSE STATE)\n[ C usually singular ] the process of moving into a worse state, often through lack of control or care: The government must take measures, he said, to halt the country's slide into recession.\nSMART Vocabulary: related words and phrases\nDeteriorating and making worse\nadd\nadmin\naggravate\nbackslide\nbe (all) downhill idiom\ndebase\ndeterioration\ndevaluation\ndevalue\ndisintegrate\ndog\ndowngrade\none step forward, two steps back idiom\nregress\nregression\nregressive\nregressively\nwear thin idiom\nworse\nworsen\nSee more results »\nslide noun\n(DISPLAY)\n[ C ] a small piece of photographic film in a frame that, when light is passed through it, shows a larger image on a screen or plain surface: colour slides Synonym\ntransparency\nDouglas Sacha/Moment/GettyImages\n[ C ] one of the screens in a presentation (= a talk that uses images and texts to give information) created on a computer: My slides were all in the wrong order. Her first slide showed an image of an explosion with a large question mark over it.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLecturing & addressing\nComputer programming & software\nslide noun\n(GLASS)\n[ C ] a small piece of glass on which you put something in order to look at it through a microscope\nAndrew Brookes/Cultura/GettyImages\nSMART Vocabulary: related words and phrases\nPhysics: optics, microscopy & lasers\nanti-reflection\nanti-reflective\nchromatic aberration\nconcentrator\nconverging lens\nelectron microscope\neyepiece\nfield glasses\nlens\nmagnification\nmagnifying glass\nopera glasses\noptics\npolarization\npolarize\npolarized\npolarizer\nreflect\nreflecting telescope\nreflection\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLaboratory equipment\nslide noun\n(HAIR)\n[ C ] UK short form of\nhair slide UK\nCheshmeh/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nHair care\nargan oil\nblow dryer\nblowout\nbobble\nbobby pin\nbrush\ncoconut oil\ncoily\ncrimp\nhair gel\nhair slide\nhairdryer\npermanent wave\nrelaxed\nrelaxer\nroller\nsnood\nstraighteners\nstyling\nuncombed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPins, clips, hooks & pegs\nslide noun\n(SHOE)\n[ C ] (also slider); (US also slide sandal) a type of plastic shoe that you can slide your foot into, open at the front and the back, with a wide band or bands across the top of the foot: This season, the must-have pool slide makes a welcome return for sports fans and the fashion pack alike. If there's one piece of advice I can give you, it's buy a pair of sliders.\nKurgu128/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesSlip on a pair of slides, a welcome relief from clunky boots.If you are simply looking for some slip-on summer comfort, we've got the perfect sliders for any vacation.\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh heels\nhigh-top\nhiking boot\nhobnail\nhobnail boot\nrunning shoe\nsandal\nshoehorn\nshoelace\nshoemaker\nwedge\nwedgie\nwellie\nwellington\nwelly\nSee more results »\nslide verb\n(MOVE EASILY)\nAdd to word list\nAdd to word list\nto cause something to move easily over a surface, or to move in this way: [ I ] My mother slid into the car seat next to me. [ T ] He slid his hand into his back pocket.\nslide verb\n(GET WORSE)\n[ I ] to go into a worse state, often through lack of control or care: The stock market crashed in October 1929 and the nation slid into a depression.\nslide noun\n(PHOTOGRAPH)\n[ C ] a small piece of film in a frame which, when light is passed through it, shows a photograph on a screen: The art history professor showed us slides of the Parthenon today.\n[ C ]\n&#160; science In scientific study, a slide is a small piece of glass on which you put something in order to look at it through a microscope (= device that makes small objects look larger) and see its structure.\nslide noun\n(WORSE STATE)\n[ C usually sing ] a movement into a worse state, often through lack of control or care: He felt he was on a downward slide in which nothing was going right in his life.\nslide noun\n(STRUCTURE FOR PLAY)\n[ C ] a structure used by children in their play that has a smooth, sloping side which lets them move down quickly from the top to the ground\nAdd to word list\nAdd to word list\nECONOMICS, FINANCE to become worse, lower, or less in value, especially gradually: Economists predict that house prices will continue to slide in most areas. Manufacturing employment has slid for seven months in Minnesota.slide (from sth) to sth The nation's unemployment rate slid to less than 5% last month.slide into sth The economy was sliding into deep crisis. Returns from Government bonds also slid sharply from 6.3% last year to 4.5% this year.\nECONOMICS, FINANCE the process of becoming worse, lower, or less: Several ministers expressed their worry at the euro's slide.a slide in sth The last few months have seen a sharp slide in voter confidence.a slide of sth The corporation's shares ended the day at 509p, a slide of 13p. a downward/sharp/steady slidehalt/stop/reverse a slide The French central bank yesterday succeeded in reversing the slide in the franc.\nMARKETING one of a series of computer screens of information shown in a presentation: The final slide showed two graphs."}