{"id":334369,"name":"slightness","type":"noun","us_sound":"ˈslaɪt.nəs","us_link":"../audio/s/ussleep013.mp3","uk_sound":"ˈslaɪt.nəs","uk_link":"../audio/s/uksleep025.mp3","content":"slightness noun [U]\n(OF AMOUNT)\nAdd to word list\nAdd to word list\nthe quality of being small in amount or degree: Because of the slightness of the symptoms, it is often very difficult to persuade patients that they are cured. A lawyer friend is surprised at the slightness of the payment.\nMore examplesFewer examplesThe language they use disguises the slightness of their contribution to public debate.Given the slightness of the resemblance, it's surprising he noticed it. The very slightness of the change long prevented its being appreciated or noticed.\nSMART Vocabulary: related words and phrases\nSmall\nbaby\nbijou\nbite-sized\nclaustrophobically\ncompactly\ndwarf\nmidget\nminiaturized\nmissy\nmodest\nmodestly\nno/not enough room to swing a cat idiom\non the large, small, etc. side idiom\nS, s\nsampler\nscaled-down\nscrubby\nshoe box\nshrunken\nwee\nSee more results »\nslightness noun [U]\n(THINNESS)\n(of a person) the quality of being thin and delicate: Charlie's slightness makes him seem shorter than he really is. The contrast between her tall elegance and his slightness was striking.\nMore examplesFewer examplesHis black uniform accentuated both the slightness of his build and the natural paleness of his skin.His physical slightness meant he was held back in age-group sport.Slightness need not imply lack of strength.\nSMART Vocabulary: related words and phrases\nAnimal physiology: thin or slender (of people)\nbe as thin as a rake phrase\nbe skin and bone(s) idiom\nectomorph\nemaciated\nemaciation\ngauntly\ngauntness\nhollow\nhollow-cheeked\nlithe\nraw-boned\nscrawny\nskinny\nslight\nsparely\nsylphlike\nthinness\nultra-thin\nwasted\nwirily\nSee more results »\nslightness noun [U]\n(LACK OF SERIOUSNESS)\nthe quality of not dealing with very serious or important subjects, or not needing much serious thought: Excellent performances by the two leads make up for the slightness of the tale. His poems have a certain slightness.\nMore examplesFewer examplesThe play is profoundly affecting, despite the apparent slightness of its subject matter.Sometimes the slightness of subject matter cannot be concealed by the brilliance of the execution. The film is 120 minutes long which, given the slightness of the material, is pushing it.\nSMART Vocabulary: related words and phrases\nOf little or less importance\nbe in/under someone's shadow idiom\nbe neither here nor there idiom\nbig deal\nbiggie\nderisory\nlesser\nmarginal\nmeaningless\nmeaninglessly\nmeaninglessness\npicayune\npicture\npiddling\npiddly\npiffling\nunseriousness\nvenial\nvestigial\nvestigially\nwho needs...? idiom\nSee more results »\nSee\nslight"}