{"id":334375,"name":"slim","type":"adjective","us_sound":"slɪm","us_link":"../audio/s/slim.mp3","uk_sound":"slɪm","uk_link":"../audio/s/uksleep026.mp3","content":"slim adjective\n(THIN)\nAdd to word list\nAdd to word list\nA1 approving (especially of people) attractively thin: slim hips/legs She has a lovely slim figure. Synonyms\nskinny (THIN) informal mainly disapproving\nthin (NOT FAT)Opposite\nfat (BIG)\nThesaurus: synonyms, antonyms, and examples\nhaving less flesh on the body than averagethinShe's on a diet but I think she's already too thin.skinnyYou should eat more. You're much too skinny.scrawnyHe hated his scrawny legs.slimHe was tall, very slim, with pale, deep-set eyes.slenderHe put his arms around her slender waist.\nSee more results »\nMore examplesFewer examplesShe was of slim build with short, dark hair.She was slim, svelte and sophisticated.She was much slimmer than I remembered her.You look so slim in those trousers.He looks a lot slimmer now he's exercising.\nSMART Vocabulary: related words and phrases\nAnimal physiology: thin or slender (of people)\nbe as thin as a rake phrase\nbe skin and bone(s) idiom\nectomorph\nemaciated\nemaciation\ngauntly\ngauntness\nhollow\nlithe\nraw-boned\nscrawny\nslender\nslight\nslimness\nsparely\nthinness\nultra-thin\nwasted\nwirily\nwiry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThin and fine\nslim adjective\n(SMALL)\nvery small: They only have a slim chance of winning (= it's unlikely that they will win).\nSMART Vocabulary: related words and phrases\nExtremely small\natomized\nbe knee-high to a grasshopper idiom\nbitsy\nexiguity\nexiguous\nincy\nindiscernibly\ninfinitesimal\ninfinitesimally\nirreducible\nmicroscopic\nmicroscopically\nminiature\nminuscule\nslimly\ntinily\ntiny\ntitchy\nultra-small\nultra-tiny\nSee more results »\nRelated word\nslimness\nto try to get thinner by eating less food and doing more exercise: You don't have much lunch - are you slimming? Compare\nthin verb\nSMART Vocabulary: related words and phrases\nExercising & training\naerial yoga\naerobic\naerobic exercise\nAnti-Gravity yoga\naquacise\ncross-trainer\ncurl\njerk\njog\njog trot\njumping jack\nKegel exercise\nkettlebell\nPilates\nSpinning\nsquat thrust\nstability ball\nstar jump\nsuperheavyweight\nSwiss ball\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDiets & dieting\nPhrasal verbs\nslim down\nslim something down\nEast African for AIDS (= a serious disease that destroys the body's ability to fight infection)\nSMART Vocabulary: related words and phrases\nBacteria, moulds, germs & viruses\nadenovirus\naerobe\namoeba\namoebic\nanti-HIV\nantimicrobial\ngnotobiotic\nGram-negative\nGram-positive\nGram-variable\nhen of the woods\nlisteria\nmicrobe\nMRSA\nprobiotic\nretroviral\nroot rot\nrotavirus\nRSV\nsaprozoic\nSee more results »\nAdd to word list\nAdd to word list\nthin, or (esp. of people) attractively thin: She’s published several slim volumes of poetry.\nSlim also means only a little or not much: Coaches told him his chances of making the team were slim at best.\nAdd to word list\nAdd to word list\nsmall or slight, especially in a way that makes success difficult: The trend was upwards, but the gains were slim. The polls show Brackett leading by a slim 51% to her opponent's 49%. The pizza delivery chain operates on a philosophy of slim margins and huge volume.\na slim chance or possibility is not likely to happen or be true: The likelihood of selling the machinery at that price is slim.a slim chance/possibility A member of the board said there was only a slim chance of the merger succeeding. There is still a slim hope of the negotiations ending well for union members.\na slim company or organization is one that has been made smaller, and often more effective, by reducing the number of employees it has: The result of the changes is a slimmer organization that is better able to respond to its customers.\nto reduce the number of people who work in a company or organization, often so that it operates more effectively: Margins are to be widened and central expenses slimmed down. The government developed a public works program as one way of slimming the 12% jobless rate.slim (down) to sth Having slimmed down to around 1400 staff, the company is now recruiting again. slimming noun [ U ]\nInvestors applauded the government's 10% slimming of budget spending."}