{"id":334419,"name":"slingshot","type":"noun","us_sound":"ˈslɪŋ.ʃɑːt","us_link":"../audio/s/ussleep021.mp3","uk_sound":"ˈslɪŋ.ʃɒt","uk_link":"../audio/s/ukslimm007.mp3","content":"Add to word list\nAdd to word list\na Y-shaped stick or piece of metal with a piece of elastic (= material that stretches) attached to the top parts, used especially by children for shooting small stones Compare\nsling noun\niamwayclick/ iStock / Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nHand weapons\nbattleaxe\nbayonet\nblowgun\nblowpipe\nbludgeon\ncatapult\ngoad\nhaft\nhalberd\nharpoon\nhilt\njackknife\nrapier\nsabre\nscabbard\nscimitar\nshanghai\nshank\nsheath knife\nunfond\nSee more results »\n[ I ] in motor racing, to pass another car by driving behind it to gain speed using less power, before accelerating (= increasing speed) and moving past it : Stewart used the momentum to shift to the inside and slingshot around to the lead.\n[ I or T ] to push something or someone somewhere with a lot of force, or to be pushed somewhere with a lot of force: The surfers used jet skis to provide them with the initial momentum to slingshot them onto the giant waves. The spaceship slingshot through space. Synonym\npropel\n[ I or T ] to cause someone or something to suddenly be in a particular situation, area of activity, etc., or to suddenly be in it: Somehow, this PR catastrophe slingshot her back onto the music charts. Candidates are going to have to win South Carolina to slingshot into that national primary. Synonym\npropel\nSMART Vocabulary: related words and phrases\nMotor racing\ncockpit\nDNF\ndrag racing\ndrag strip\ngo-karting\ngrand prix\ngrid\nhill climb\nmotocross\npole position\nrace car\nrace car driver\nracing car driver\nracing driver\nscramble\nspeedway\nspin out\nstarter\nstock car\nthe chequered flag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement through the air\nMovement on or through water\nCausing things to happen\nAdd to word list\nAdd to word list\na Y-shaped stick with a piece of elastic fixed to the top parts, used esp. by children for shooting small stones"}