{"id":334658,"name":"sloppily","type":"adverb","us_sound":"ˈslɑː.pəl.i","us_link":"../audio/s/sloppily.mp3","uk_sound":"ˈslɒp.əl.i","uk_link":"../audio/s/ukslobb012.mp3","content":"sloppily adverb\n(BADLY)\nAdd to word list\nAdd to word list\ndisapproving badly or carelessly: a sloppily written letter I think this test was done sloppily.\nMore examplesFewer examplesThere's a difference between working quickly and working sloppily.I am sorry to say some of the documents were sloppily written.This article has some good insights, but it's also sloppily constructed.\nSMART Vocabulary: related words and phrases\nNot paying attention\nabsent\nabsent-minded\nabsent-mindedly\nabsent-mindedness\nabsently\ndreamily\ndreamy\ndrop/lower your guard idiom\nfaraway\nglazed\nlax\nlaxity\nlaxly\nlike a bull in a china shop idiom\nmerrily\nunguarded\nunmindful\nunwarily\nunwary\nzone out\nSee more results »\nsloppily adverb\n(UNTIDILY)\nin an untidy way, in clothes that are large and loose: The owner of the cafe described the men he saw as sloppily dressed and speaking English. We were getting people coming to work dressed sloppily.\nMore examplesFewer examplesWhat you wear is unlikely to make you stand out, unless you dress sloppily.He's not slick, and he's sloppily dressed. A survey shows TV viewers are fed up with sloppily dressed presenters.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\nfullness\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nsloppily adverb\n(WET)\ninformal disapproving in a way that has a lot of liquid, often unpleasantly so: Brushes and rags were sloshing sloppily in the mess from the bucket. He bounded to the door and kissed Genevieve sloppily on the forehead.\nMore examplesFewer examplesThere was so much chicken and it was sloppily tasty.I realized I was eating very sloppily again. His white room had been attacked with a paintbrush, black colour sloppily smeared over the walls.He introduced them to Dr. Milstein, who sloppily kissed Sara's hand.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\ngranulated\nimpervious\nmelted\npolyunsaturated\nrarefy\nreflective\nrustily\nrusty\nself-healing\nsloppiness\nsloppy\nspectrally\nSee more results »\nsloppily adverb\n(SILLY)\ninformal disapproving (of feelings) expressed in a way that is silly or embarrassing: She spoke in a way that was sloppily sentimental.\nMore examplesFewer examplesIt takes courage to be that sloppily sentimental.The whole thing was so sloppily emotional it was revolting.\nSMART Vocabulary: related words and phrases\nSentimental and over-emotional\ncloying\ncloyingly\ngauzily\ngushily\ngushy\nmush\nmushily\nmushy\nsappiness\nsappy\nsentimentalist\nsentimentality\nsick-making\nsickly\nsloppiness\nslushy\nsoppily\ntreacly\ntwee\ntweeness\nSee more results »\nSee\nsloppy\nAdd to word list\nAdd to word list\nin a messy or careless way: We played sloppily and lost the game."}