{"id":334659,"name":"sloppiness","type":"noun","us_sound":"ˈslɑː.pi.nəs","us_link":"../audio/s/sloppiness.mp3","uk_sound":"ˈslɒp.i.nəs","uk_link":"../audio/s/ukslobb013.mp3","content":"sloppiness noun [U]\n(CARELESSNESS)\nAdd to word list\nAdd to word list\ndisapproving a lack of care or effort: The work has been criticized for sloppiness and errors. There was a general sloppiness in the way the business was run.\nMore examplesFewer examplesThere is no evidence of particular sloppiness by the airport security. The chef saw so much sloppiness in the kitchen that he flew into one of his rages.He passed the ball with an alarming sloppiness.\nSMART Vocabulary: related words and phrases\nNot paying attention\nabsent\nabsent-minded\nabsent-mindedly\nabsent-mindedness\nabsently\ndreamily\ndreamy\ndrop/lower your guard idiom\nfaraway\nglazed\nlax\nlaxity\nlaxly\nlike a bull in a china shop idiom\nmerrily\nunguarded\nunmindful\nunwarily\nunwary\nzone out\nSee more results »\nsloppiness noun [U]\n(LOOSENESS)\n(of clothes) the quality of being untidy and too big or loose: The jacket seemed a bit big but I love its comfortable sloppiness. You may need to speak to her about the sloppiness of her appearance.\nMore examplesFewer examplesWhile disapproving of the sloppiness of his clothes, she envied him his ease.There's a funny sloppiness that occurs in many a mom's wardrobe.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\nfullness\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nsloppiness noun [U]\n(WET)\ninformal disapproving the state of being too liquid, often in an unpleasant way: Serve with bread to scoop up all that delicious sloppiness. I forgot to mention the sloppiness of the chocolate pots. They were a mess.\nMore examplesFewer examplesI add extra sauce, and the kids love the sloppiness of this dish.The individual ingredients were lost in the overall sloppiness of the burger.The problem was not really the food itself, but more the sloppiness of the food.\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\ngranulated\nimpervious\nmelted\npolyunsaturated\nrarefy\nreflective\nrustily\nrusty\nself-healing\nsloppily\nsloppy\nspectrally\nSee more results »\nsloppiness noun [U]\n(SILLY)\ninformal disapproving the quality of being silly or too emotional: I think too much sloppiness on a first date can be claustrophobic. See\nsloppy\nMore examplesFewer examplesHe cast a look of such simpering sloppiness at his wife it would have made a cat sick.There was none of the sentimental sloppiness about her that had been so noticeable before.He didn't like my emotional sloppiness, even though he himself sometimes became sentimental.\nSMART Vocabulary: related words and phrases\nSentimental and over-emotional\ncloying\ncloyingly\ngauzily\ngushily\ngushy\nmush\nmushily\nmushy\nsappiness\nsappy\nsentimentalist\nsentimentality\nsick-making\nsickly\nsloppily\nslushy\nsoppily\ntreacly\ntwee\ntweeness\nSee more results »\nAdd to word list\nAdd to word list\nthe quality of being messy or done in a careless way: Such remarkable sloppiness was the result of too much hurry."}