{"id":334680,"name":"slot","type":"noun","us_sound":"slɑːt","us_link":"../audio/s/slot.mp3","uk_sound":"slɒt","uk_link":"../audio/s/ukslobb018.mp3","content":"slot noun [C]\n(LONG HOLE)\nAdd to word list\nAdd to word list\nC1 a long, narrow hole, especially one for putting coins into or for fitting a separate piece into: I put my money in the slot and pressed the button but nothing came out. The holder has slots for 100 CDs. Synonyms\nbreach (OPENING) formal\nchink (CRACK)\ncleft\ncrack (NARROW SPACE)\ncranny\ncrevice\nfissure\ngap (HOLE)\ninterstice formal\nopening (HOLE)\nslit\nTwilightEye/E+/GettyImages\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\nescape hatch\ngouge\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npiercing\npinprick\nshaft\nvoid\nSee more results »\nslot noun [C]\n(AMOUNT OF TIME)\nC1 an amount of time that is officially allowed for a single event in a planned order of activities or events: The programme will occupy that half-hour slot before the six o'clock news.\nan amount of time that is available for an appointment, delivery, etc.: We placed our order but had to wait two days for a delivery slot. Couples have been able to reserve time slots to obtain marriage licenses.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nday\ndigital age\nduration\ninterval\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsession\nsleep\nspasm\ntide\ntime span\ntimescale\nSee more results »\nto put something into a slot or fit together using slots: The legs of the chair are meant to slot into the holes at the back. Do these two pieces slot together? Slot piece A into piece B, taking care to keep the two pieces at right angles.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\nmanoeuvrable\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\ntranspose\ntransposition\nSee more results »\nPhrasal verb\nslot someone/something in\nslot noun [C]\n(HOLE)\nAdd to word list\nAdd to word list\na narrow hole or opening: Drop the letter in the mail slot.\nslot noun [C]\n(POSITION)\na place or position available to someone or something: Perry will fill one of the open slots on the commission. Shaap’s program can be heard in the same time slot every morning.\nslot verb [T]\n(PUT IN POSITION)\nto put someone or something in a particular position: Weather reports are slotted between commercials.\nAdd to word list\nAdd to word list\n(also time slot) an amount of time that is allowed for a single event in a planned order of activities or events: I think I have a slot open in my diary.1-hour/90 minute/4-hour, etc. slot What can we test in the 90-minute time slot?the 9pm/Saturday night/morning, etc. slot The show competes with 'Bob the Builder' in the morning slot.delivery/viewing/landing slot Airlines are competing for landing slots at Gatwick airport.\na job in a company or organization: Five of the fifteen slots on the charity's board are open this year. Johnson moved to the top slot last month. a training/teaching/management slotthe CEO/Vice President/Director slot She left the CEO slot in 2009.\na position in a list of ranks: Within a few years we expect to compete with the big Wall Street firms for the top slot in the industry.the number 1/2/3, etc. slot They fought their way to the number 1 slot in the nation. a top 10/50/100 slot\nIT a small, narrow opening for something to be put in: the memory card slot in your computerin/into a slot You can insert a smart card into a slot on the keyboard to verify digital signatures. See also\nexpansion slot"}