{"id":334910,"name":"slurp","type":"verb","us_sound":"slɝːp","us_link":"../audio/s/slurp.mp3","uk_sound":"slɜːp","uk_link":"../audio/s/ukslove026.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] informal to drink a liquid noisily as a result of sucking air into the mouth at the same time as the liquid: Try not to slurp. I wish you wouldn't slurp your soup like that. He slurped down his coffee.\nThesaurus: synonyms, antonyms, and examples\nto drinkdrinkWhat would you like to drink?haveI don't let the children have sweet fizzy drinks.sipShe sipped the tea carefully because it was hot.swigHe was swigging milk from the bottle.gulp (down)Stop gulping your water!slurpThe children were eating pizza and slurping lemonade.\nSee more results »\n[ I ] UK informal When a thick liquid slurps, it makes loud noises: The lava slurped and bubbled down the mountainside.\nMore examplesFewer examplesToday, he would paint adults sipping lattes in a bookstore rather than kids slurping milkshakes at a soda fountain.The thought of slurping a raw egg makes me sick.\nSMART Vocabulary: related words and phrases\nDrinking\nconsume\ndrink\ndrink (something) up\ndrinker\ndrinking\ndrinking fountain\ndrinking water\ndrunk\nmainline\nnon-consumption\noverindulge\noverindulgence\noverindulgent\npartake\nsup\nswig\nswill\ntasting\ntea ceremony\nwash\nSee more results »\nan amount of liquid that you drink noisily: She paused to take a slurp of lemonade. \"I don't have a clue,\" said Bill between slurps.\nthe sound someone makes when they drink noisily: They wolfed down their food in silence, punctuated only by slurps, grunts, and scraping knives. All of the tasters have their own distinct slurps.\nMore examplesFewer examplesHe took a slurp from his mug as he carried it back to his chair.He drinks a slurp of coffee and stares past me. For maximum benefit, take small slurps of water throughout the day.\nSMART Vocabulary: related words and phrases\nDrinking\nconsume\ndrink\ndrink (something) up\ndrinker\ndrinking\ndrinking fountain\ndrinking water\ndrunk\nmainline\nnon-consumption\noverindulge\noverindulgence\noverindulgent\npartake\nsup\nswig\nswill\ntasting\ntea ceremony\nwash\nSee more results »\nAdd to word list\nAdd to word list\nto make sucking noises while eating or drinking: [ T ] I wanted to tell him not to slurp his soup."}