{"id":334948,"name":"sluttish","type":"adjective","us_sound":"ˈslʌt̬.ɪʃ","us_link":"../audio/s/eus74282.mp3","uk_sound":"ˈslʌt.ɪʃ","uk_link":"../audio/s/ukslutt001.mp3","content":"sluttish adjective\n(SEXY)\nAdd to word list\nAdd to word list\ninformal disapproving looking like or relating to a person, especially a woman, who has a lot of sexual relationships without any emotional involvement: Don’t wear that, it makes you look sluttish.\nMore examplesFewer examplesShe claimed her husband made her wear slutty clothes even though the two were regular Church goers.Now it's considered as slutty if your jeans are really low. The plot focuses on a lonely, eccentric draughtsman who is bullied at work by his colleagues and lasciviously pursued at home by his sluttish landlady.I asked them to find me the sort of clothes they wear in Sex In The City, something classy and yet sluttish to suit my new image.\nSMART Vocabulary: related words and phrases\nAttention-seeking, distracting and showing off\nchichi\nconspicuous consumption\ndressed\ndressed (up) to the nines idiom\nexhibitionistic\nexhibitionistically\nflamboyance\nflamboyancy\nflamboyant\nflaunt\ngimmick\nhotdog\nnegging\nostentation\nostentatiously\npeacock\npeacocking\nposture\nrazzle-dazzle\nshowboating\nSee more results »\nsluttish adjective\n(UNTIDY)\nUK informal disapproving untidy or lazy: A single girl's bachelor pad can be instantly transformed from sluttish tip to fragrant room. See\nslut\nMore examplesFewer examplesYou are spoilt, slovenly and sluttish. I prefer not to sleep in a pigsty. Check plates and cutlery for tell-tale signs of sluttish washing-up.\nSMART Vocabulary: related words and phrases\nLaziness and lazy people\nbludger\nbone idle idiom\nbum around\nCBA\nclock-watcher\nindolent\nindolently\nlayabout\nlazily\nlaziness\nphone in\nshiftless\nshirker\nskiver\nslacker\ntime-server\ntime-serving\nunambitious\nvegetable\nwork-shy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDirty & untidy"}