{"id":335023,"name":"smart","type":"adjective","us_sound":"smɑːrt","us_link":"../audio/s/smart.mp3","uk_sound":"smɑːt","uk_link":"../audio/s/ukslutt023.mp3","content":"smart adjective\n(STYLISH)\nAdd to word list\nAdd to word list\nB1 mainly UK having a clean, tidy, and stylish appearance: Guy looks very smart in his new suit, doesn't he? I need a smart jacket for my interview. She works in a very smart new office overlooking the river.\nB1 mainly UK A place or event that is smart attracts fashionable, stylish, or rich people: a smart restaurant We went to a very smart party on New Year's Eve.\nMore examplesFewer examplesShe tends to wear quite smart clothes for work.I need some smart trousers for work.I wanted a more casual jacket - that one's a bit smart.Paul had booked us into a very smart little hotel off the main square.The nightclub is popular with Berlin's smart set.\nSMART Vocabulary: related words and phrases\nSmart & elegant\nclean-cut\ncut\ncut a fine figure idiom\ndapper\ndapperly\ndebonair\ndressed (up) to the nines idiom\ndressed to kill idiom\nelegant\nelegantly\nnattily\nnatty\nnine\nsmartness\nsoigné\nspiff someone/something up\nspiffily\nspiffy\nspruce\nwell groomed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttractive\nsmart adjective\n(INTELLIGENT)\nB1 mainly US intelligent, or able to think quickly or intelligently in difficult situations: Maddy's teacher says she's one of the smartest kids in the class. Why don't you fix it if you're so smart? I'm not smart enough to understand computers. He's smart enough to know he can't run the business without her. Quitting that job was the smartest move I ever made.\nThesaurus: synonyms, antonyms, and examples\nintelligentintelligentHe seems like a very intelligent young man.cleverI'm the cleverest kid in the class.smartShe's incredibly smart and a great writer.brightJacob was a very bright boy.sharpHow can we stay mentally sharp as we age?\nSee more results »\nMore examplesFewer examplesHe's a very smart kid.She's not especially academic but she's smart enough.Steve's as smart as anyone I know with figures.He's smart enough to know an opportunity when he sees one.He was a very smart guy.\nSMART Vocabulary: related words and phrases\nIntelligence\nacuity\nacumen\nagility\napt\naptness\nbrain\ngumption\nhighbrow\nhorse sense\nhyper-intelligent\nimaginative\npenetrative\nperceptively\npercipient\npercipiently\nperspicacious\nperspicaciously\nprofundity\nwhip-smart\nwisdom\nSee more results »\nsmart adjective\n(QUICK)\n[ before noun ] done quickly with a lot of force or effort: She gave him a smart smack on the bottom. We'll have to work at a smart pace if we're going to finish on time.\nSMART Vocabulary: related words and phrases\nHurrying and doing things quickly\naccelerate\nacceleration\nagainst the clock idiom\nagainst time/the clock idiom\nalacrity\nbash\ndispatch\nget a move on idiom\nget a wiggle on idiom\ngrab-and-go\ngrease\nhacky\nprecipitately\nprompt\npromptly\npromptness\nquickie\nrattle something off\nstroke\ntear\nSee more results »\nsmart adjective\n(WORKING BY COMPUTER)\nC1 A smart machine, weapon, etc. uses computers to make it work so that it is able to act in an independent way: Until the advent of smart weapons, repeated attacks were needed to ensure the destruction of targets.\nused to refer to a motorway or other road on which computers are used to watch traffic and change speed limits, close lanes, and show warning signs according to the amount of traffic : What should you do if you break down on a smart motorway? Smart road technologies are shaping the future of transportation.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nword processing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRoads: motorways\nsmart adjective\n(WITHOUT RESPECT )\nmainly US not showing respect, especially when making a funny remark: Don't get smart with me, young lady! Your smart mouth is going to get you into trouble.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\ncheeky\nchurlishly\nchurlishness\ncoarsely\nfruity\ngall\ngraceless\nincivility\nindelicate\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHumour & humorous\nRelated word\nsmartness\nin a clever and effective way: We have to work hard and work smart. They are encouraging people to eat smart and adopt a healthy lifestyle.\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEfficient and effective\nto hurt with a sharp pain: My eyes were smarting from the onions.\nThesaurus: synonyms, antonyms, and examples\nto cause painhurtMy leg hurts.acheMy legs are still aching from my run yesterday.throbMy head throbbed.stingHis cheeks stung from the aftershave he'd just put on.smartThe smoke was thick, making her eyes smart.rubThe clothing is cleverly stitched to prevent the seams rubbing anywhere.\nSee more results »\nto feel upset and angry because of failure or criticism: The police are still smarting from their failure to prevent the robbery.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsting\nstitch\nthrob\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeeling sad and unhappy\nsmart adjective [-er/-est only]\n(INTELLIGENT)\nAdd to word list\nAdd to word list\nintelligent, or able to think and understand quickly in difficult situations: Jed’s smart enough to get A’s in this class. Her daughter is smarter than she is. Ginny is a very smart kid. Quitting that job was a smart move.\nSmart devices are ones that operate using computers: smart phones a smart card\nsmart adjective [-er/-est only]\n(STYLISH)\ndated having a clean, neat, stylish appearance: She wore smart dresses and dashing hats.\nsmart verb [I]\n(STING)\nto feel a stinging pain: Abby’s eyes smarted from the smoke. fig. Sacramento is still smarting from the loss (= is upset by it).\nAdd to word list\nAdd to word list\nabbreviation for Specific, Measurable, Agreed (or Achievable), Realistic, and Time Bound (or Timed): a phrase to say that the aims of a company, employee, etc. should be stated in relation to these things: You need to ensure that all your objectives are SMART.\nIT using advanced computer systems: smart design/technology The passports have smart chips, designed to relay travellers' biometric information.\nintelligent or able to think quickly: They recruit smart young people and train them on the job. Buying those shares was a really smart move. See also\nsmart card\nsmartphone"}