{"id":335102,"name":"smell","type":"verb","us_sound":"smel","us_link":"../audio/s/smell.mp3","uk_sound":"smel","uk_link":"../audio/s/uksmash005.mp3","content":"smell verb\n(CHARACTERISTIC)\nAdd to word list\nAdd to word list\nB1 [ I, L only + adj ] to have a particular quality that others can notice with their noses: My hands smell of onions. That cake smells good. There's something in the fridge that smells mouldy. Your feet smell (= have an unpleasant smell). Why don't you wash them?\nMore examplesFewer examplesThose toilets smell foul!This milk smells funny.You smell lovely - what's your perfume?He always smells of cigarettes.My armpits were starting to smell.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nsmell verb\n(DISCOVER)\nB1 [ T ] to notice or discover something using the nose: Come and smell these flowers!smell something burning Can you smell something burning? [ + (that) ] Didn't you smell (that) the pie was burning? I can smell something rotten in the bottom of the fridge.\n[ T ] informal to know about or be aware of a situation without having to be told about it: smell trouble Brenda can smell trouble a mile off (= a long time in advance).\nMore examplesFewer examplesI could smell smoke on the night air.I can smell onions cooking.Smell this perfume.I could smell alcohol on his breath.Can you smell gas?\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGuessing, supposing and suspecting\nsmell verb\n(ABILITY)\nB2 [ I ] to have the ability to notice or discover that a substance is present by using your nose: Humans can't smell as well as dogs. What I hate most about having a cold is not being able to smell.\nMore examplesFewer examplesMy nose is blocked so I can't smell.If you can't smell, your ability to taste is also impaired.It feels so unnatural not to be able to smell.Not being able to smell has its advantages.Many animals are able to smell better than humans.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nIdioms\ncome up/out smelling of roses\nsmell a rat\nsmell bloodPhrasal verbs\nsmell somewhere out\nsmell something/someone out\nsmell noun\n(CHARACTERISTIC)\nB1 [ C ] the characteristic of something that can be recognized or noticed using the nose: What's your favourite smell?the smell of I love the smell of orange blossoms. The marketplace was filled with delightful smells.delicious smell There's a delicious smell in here. I wish we could get rid of that smell (= bad smell) in the bathroom.\nThesaurus: synonyms, antonyms, and examples\na smellsmellWhat's that terrible smell?aromaThe delicious aroma of fresh bread wafted out of the bakery.fragranceI adore the delicate fragrance of roses.perfumeThe perfume of the flowers filled the room.scentShe smelled the sweet scent of the lilies.odourUK There was the unmistakable odour of sweaty feet.\nSee more results »\nthe smell of something literary\nthe particular character or feeling that someone or something has: the sweet smell of success She's still enjoying the sweet smell (= pleasant experience) of success after her victory in the world championships.\nSee more\nMore examplesFewer examplesthe smell of decaying meatThe delicious smell of freshly-made coffee came from the kitchen.There was an unpleasant smell coming from the drains.What's that horrible smell?The smell of hospitals always makes my stomach turn.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nsmell noun\n(ABILITY)\nB2 [ U ] the ability to notice or discover that a substance is present by using your nose: Smell is one of the five senses.sense of smell Dogs have a very good sense of smell.\nMore examplesFewer examplesSharks have a highly developed sense of smell.She has a very keen sense of smell.As you get older you tend to lose your sense of smell.He has a very poor sense of smell.Pregnancy can change your sense of smell.\nSMART Vocabulary: related words and phrases\nThe senses in general\nhearing\nhyperacute\nhyperaesthetic\nintersensory\nnight vision\nnon-visual\nsensate\nsensately\nsensation\nsense\nsensory\nsensually\nsight\nsynaesthesia\nsynesthesia\ntaste\ntouch\nvision\nSee more results »\nsmell noun\n(DISCOVER)\n[ S ] mainly UK the act of putting your nose near something and breathing in so that you can discover its characteristics with your nose: a smell of Have a smell of this perfume.\nSMART Vocabulary: related words and phrases\nSmells & smelling\nacridly\nanosmic\nbergamot\ndeodorize\ndeodorizing\nfetid\nfragrant\nmalodorous\nminging\nodourless\npiny\npungency\npungently\nrankly\nredolence\nredolent\nscented\nsmelly\nsniff\nstink\nSee more results »\nRelated word\n-smelling\nsmell noun\n(ABILITY)\nAdd to word list\nAdd to word list\n[ U ] the ability to notice or discover a substance in the air by using the nose: Smell is one of the five senses. Dogs have a very good sense of smell.\nsmell noun\n(CHARACTERISTIC)\n[ C ] the characteristic of something that can be recognized or noticed using the nose: a sweet/strong/unpleasant smell the smell of flowers/perfume/coffee/paint I woke up to the smell of bacon and eggs. I wish we could get rid of that smell in the garage.\nsmell noun\n(DISCOVERY)\n[ U ] the act of using your nose to discover the characteristic of a substance in the air: Have a smell of this thyme.\nsmell verb\n(DISCOVER)\n[ T ] to become aware of or to discover something using the nose: Just smell this perfume! She smelled something burning. fig. Brenda can smell trouble a mile off. (= knows when there will be trouble.)\nsmell verb\n(USE ABILITY)\n[ I/T ] to have the ability to notice or discover a substance in the air by using your nose: [ T ] I have a cold and I can’t smell anything.\nsmell verb\n(HAVE CHARACTERISTIC)\nto have a particular quality that people can notice with their noses: [ I ] My hands smell of onions. [ I ] It smells like you’ve been baking in here. [ L ] That soup smells good. [ I ] Your feet smell (= have an unpleasant smell).\nIdioms\nsmell fishy\nsmell a rat"}