{"id":335168,"name":"smile","type":"noun","us_sound":"smaɪl","us_link":"../audio/s/smile.mp3","uk_sound":"smaɪl","uk_link":"../audio/s/uksmash013.mp3","content":"Add to word list\nAdd to word list\nB1 a happy or friendly expression on the face in which the ends of the mouth curve up slightly, often with the lips moving apart so that the teeth can be seen: Amy had a big/broad smile on her face. She has a nice smile. He winked and gave me a smile. It's nice to be able to bring a smile to people's faces (= make people smile).\nYuri_Arcurs/E+/GettyImages\nMore examplesFewer examplesSlowly a smile spread across her face.There was the faintest trace of a smile on her lips.He tried to suppress a smile but felt the corner of his mouth twitch.She gave everyone a welcoming smile.The minister wore a confident smile throughout the interview.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nIdiom\nbe all smiles\nB1 [ I or T ] to make a happy or friendly expression in which the corners of your mouth curve up: He smiled and shook my hand. When he smiled at me I knew everything was all right. Esme's so cheerful - she's always smiling. I couldn't help smiling when I thought of how pleased she was going to be. He smiled politely as Mary apologized for her drunken friends. He smiled to himself as he thought about his new girlfriend. He smiled the smile of a man who knew victory was within reach.\n[ T ] to express or say something with a smile: He smiled his congratulations and left without another word. \"Don't you worry about a thing. Everything's going to be just fine,\" smiled Robin reassuringly.\nMore examplesFewer examplesShe smiled affectionately at him.My mother smiled encouragingly at me as I went up on stage.He smiled fondly at the children.She looked up from her book and smiled at me.He smiled at me in a reassuring way.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nPhrasal verb\nsmile on something/someone\nAdd to word list\nAdd to word list\nan expression on the face in which the ends of the mouth curve up slightly, often with the lips moving apart so that the teeth can be seen, expressing esp. happiness, pleasure, amusement, or a friendly feeling: a big/happy/pretty smile a smile of joy/satisfaction/amusement We exchanged smiles as we passed in the hallway. smiley adjective us\nYour browser doesn't support HTML5 audio\n/ˈsmɑɪ·li/\ninfml He’s a very smiley, friendly baby.\nto make a happy or friendly expression in which the ends of the mouth curve up slightly: [ I ] I couldn’t help smiling. [ I ] When he smiled at me, I knew everything was OK. [ I ] She smiled to herself. [ T ] He smiled a happy smile."}