{"id":335203,"name":"smirk","type":"noun","us_sound":"smɝːk","us_link":"../audio/s/smirk.mp3","uk_sound":"smɜːk","uk_link":"../audio/s/uksmash019.mp3","content":"Add to word list\nAdd to word list\na smile that expresses satisfaction or pleasure about having done something or knowing something that is not known by someone else: \"Maybe your husband does things that you don't know about,\" he said with a smirk. \"I told you it would end in disaster,\" said Polly with a self-satisfied smirk on her face. Compare\nsimper noun\nMore examplesFewer examplesHe left, but not before noticing Christine’s amused smirk.Wipe that stupid smirk off your face!She lifted a hand to her mouth to hide a smirk.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nto smile in a way that expresses satisfaction or pleasure about having done something, or knowing something that is not known by someone else: I don't like the way he winks and smirks at me whenever he sees me. He smirked his way through the interview. Compare\nsimper verb\nMore examplesFewer examplesWhat are you smirking at?The defendant appeared to be sniggering and smirking.He will spend his three minutes of glory smirking triumphantly.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nAdd to word list\nAdd to word list\nto smile in a way that expresses satisfaction with yourself or pleasure about having done something or knowing something that is not known by someone else: When she told him he was cool, he just smirked. smirk noun [ C ] us\nYour browser doesn't support HTML5 audio\n/smɜrk/\nHer lips curled into a smirk."}