{"id":335281,"name":"smoke","type":"noun","us_sound":"smoʊk","us_link":"../audio/s/smoke.mp3","uk_sound":"sməʊk","uk_link":"../audio/s/uksmash029.mp3","content":"smoke noun\n(GREY GAS)\nAdd to word list\nAdd to word list\nB1 [ U ] the grey, black, or white mixture of gas and very small pieces of carbon that is produced when something burns: cigarette smoke Her clothes smelled of cigarette smoke.smoke-filled The age of the smoke-filled bar is over. The fire produced a pall (= large mass) of smoke visible 20 miles away. Plumes of smoke billowed from the chimney.a puff of smoke She leaned back thoughtfully and blew a puff of (= a small amount of) smoke into the air.\nmartin_33/iStock/Getty Images Plus/GettyImages go up in smoke\nto be destroyed by burning: Because of the fire, hundreds of houses went up in smoke.\nSomething that goes up in smoke fails to produce the result that was wanted: When the business went bankrupt, 20 years of hard work went up in smoke.\nSee more\nMore examplesFewer examplesThe smoke made me cough.The alarm should go off automatically as soon as smoke is detected.I saw her through a haze of cigarette smoke.I heard a loud bang and then saw black smoke.Breathing in other people's cigarette smoke is bad for you .\nSMART Vocabulary: related words and phrases\nProducts of fire\nash\nashy\nbelch\ncinder\nclinker\nember\nfumes\nhaze\nsmokeless\nsmokily\nsmoky\nsmut\nsoot\nsooty\nsmoke noun\n(CIGARETTE)\n[ S ] the act of smoking a cigarette: a smoke I really enjoy a smoke at the end of a meal.\n[ C ] informal a cigarette: Would you buy me some smokes while you're out?\nSMART Vocabulary: related words and phrases\nTobacco & smoking\nanti-tobacco\nbig tobacco\nbong\nbriar\nchain-smoker\ncigarette\ncigarette butt\ncigarette holder\nfag\nfilter tip\nnicotine patch\npuff\npuffer\nroll up! idiom\nroll-your-own\nsecond-hand smoke\nshisha\nsmokeless\ntobacco\ntobacconist\nSee more results »\nsmoke noun\n(CITY)\nthe (big) smoke UK and Australian English informal\nany large city, especially London, Sydney, or Melbourne: He was a young lad of 16 when he first came to the big smoke.\nSee more\nIdiom\nthere's no smoke without fire\nsmoke verb\n(BREATHE SMOKE)\nA1 [ I or T ] to breathe smoke into the mouth and usually lungs from a cigarette, pipe, etc.: Do you mind if I smoke? I used to smoke a packet of cigarettes a day.\nMore examplesFewer examplesFewer people smoke these days than used to.In the interests of safety, please do not smoke.She doesn't drink or smoke and I'm sure she'll outlive us all.She can smoke - I don't have a problem with that.He used to smoke 40 cigarettes a day.\nSMART Vocabulary: related words and phrases\nTobacco & smoking\nanti-tobacco\nbig tobacco\nbong\nbriar\nchain-smoker\ncigarette\ncigarette butt\ncigarette holder\nfag\nfilter tip\nnicotine patch\npuff\npuffer\nroll up! idiom\nroll-your-own\nsecond-hand smoke\nshisha\nsmokeless\ntobacco\ntobacconist\nSee more results »\nsmoke verb\n(GREY GAS)\n[ I ] to produce smoke as a result of industrial activity or of something such as an electrical fault: The skyline is dominated by smoking factory chimneys. Suddenly the TV went blank and started smoking.\nSMART Vocabulary: related words and phrases\nBurning, burnt & on fire\nafire\naflame\nblaze\nburn (something) down\nburn sb up\nburned out\nburnt out\ncombustible\ncombustion\nconsume\nflare\nfrazzled\nincinerate\ninflammable\non fire idiom\npost-burn\nreignite\nscald\nself-immolation\nunburnable\nSee more results »\nsmoke verb\n(PRESERVE)\n[ T ] to preserve meat, fish, or cheese using smoke from burning wood: People in Egypt were salting, drying, and smoking fish and meat 6,000 years ago.\nSMART Vocabulary: related words and phrases\nPreserving & storing food\naluminium foil\nbeeswax wrap\nbin\nbiscuit tin\nbread basket\ndefrost\nflash-freeze\nfoil\nfood technology\nfreeze-dried\npickling\nplastic wrap\npotted\npreserving\nprocessed\nTupperware\nultra-pasteurized\nultra-processed\nunrefrigerated\nunsulphured\nSee more results »\nPhrasal verb\nsmoke someone/something out\nsmoke noun\n(CLOUDY AIR)\nAdd to word list\nAdd to word list\n[ U ] a cloudy gray or black mixture of air and very small pieces of carbon produced by something that is burning: The building filled with smoke. Nobody died in the fire, but three people were treated for smoke inhalation.\nsmoke noun\n(ACT OF SMOKING)\n[ C ] an act of smoking\nsmoke verb\n(BREATHE SMOKE)\n[ I/T ] to breathe smoke into the mouth or lungs from burning tobacco\nsmoke verb\n(PRESERVE)\n[ T ] to preserve and add a smoky flavor to meat, fish, or cheese using smoke from burning wood: They smoke the fish over wood chips.\nsmoke verb\n(PRODUCE SMOKE)\n[ I ] to produce or give off smoke: The oil in the frying pan started smoking. Phrasal verb\nsmoke someone out"}