{"id":335374,"name":"smoothness","type":"noun","us_sound":"ˈsmuːð.nəs","us_link":"../audio/s/smoothness.mp3","uk_sound":"ˈsmuːð.nəs","uk_link":"../audio/s/uksmoke015.mp3","content":"smoothness noun [U]\n(REGULAR)\nAdd to word list\nAdd to word list\n(of a surface or material) the quality of being perfectly regular with no holes, lumps, or areas that rise or fall suddenly: I just love the smoothness of silk.\nMore examplesFewer examplesHer skin was the colour and smoothness of porcelain. I found myself admiring the smoothness of the Tarmac during visits to London. The sheer smoothness of her body, the way the light reflected off her skin, the ripples in her robe, were just captivating.Ground almonds are used in cooking, especially in sauces, giving them body and creamy smoothness.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nultra-smooth\nSee more results »\nsmoothness noun [U]\n(NO PROBLEMS)\nthe quality of happening without any sudden changes, interruption, or difficulty: The merger has happened with surprising smoothness.\nMore examplesFewer examplesStill, the smoothness with which Sunday's election was conducted offers a ray of hope that democracy here will thrive.Once they had made up their minds, the smoothness of the arrangements was remarkable.the smoothness of Arsenal's passage through the season\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nhere to stay idiom\nimmanence\nimmanent\nimmanently\nimperishable\nnon-stop\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nunremittingly\nSee more results »\nsmoothness noun [U]\n(NO SUDDEN MOVEMENT)\nthe quality of making no sudden or uncontrolled movements or changes of direction: The condition of the track determines the smoothness of the ride enjoyed by a tram passenger.\nMore examplesFewer examplesThe smoothness of takeoff is important in a commercial flight.I was impressed by the bike's phenomenal smoothness.He envied his friends for their smoothness on the dance floor. Parkinson's disease is a form of degeneration in a part of the brain which controls the smoothness of movement.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nflight\nflit\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nmid-air\nnon-flying\nsoar\nsomersault\nswishy\nswoop\nwaft\nwheel\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement on or through water\nsmoothness noun [U]\n(PLEASANT)\nthe quality of having a pleasant flavour that is not sour or bitter: The wine possesses a smoothness and balanced depth that is rare.\nthe quality of sounding pleasant: Her voice has power, tone, and smoothness.\nMore examplesFewer examplesYou get sweetness and tartness from mangoes and smoothness from the pears. Honey and vanilla give root beer an overall smoothness. Aging is what gives our rums a smoothness that has made them preferred over all others. She delivered each aria with supple smoothness.His voice has lost the smoothness it once had.\nSMART Vocabulary: related words and phrases\nPleasant to eat or drink\nambrosia\nambrosial\nappetizing\nappetizingly\ncooked/done to a turn idiom\njuicy\nlekker\nlip-smacking\nluscious\nlusciously\nquaffable\nscrumptious\nscrumptiously\nslap-up\nsucculence\nultra-smooth\nuncloying\nwarming\nyummy\nzestily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWines & winemaking\nDescribing qualities of sound\nDescribing qualities of the human voice\nsmoothness noun [U]\n(INSINCERE POLITENESS)\npoliteness, confidence, and an ability to persuade people, but in a way that is not sincere: She was irritated by his smoothness.\nMore examplesFewer examplesHe's not known for subtlety or smoothness. He seemed disarmed and charmed by the smoothness of Osborne's argument. It was nothing more than the oily smoothness of a concierge.He's got a persuasive smoothness which is quite impressive for somebody so young.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\ntheatricality\nSee more results »\nSee\nsmooth\nsmoothness noun [U]\n(BEING WITHOUT INTERRUPTION)\nAdd to word list\nAdd to word list\nthe fact of happening or being done without any sudden changes, interruption, or difficulty: The car delivers power with the smoothness of a jet engine.\nsmoothness noun [U]\n(BEING REGULAR)\nthe quality of being perfectly regular, with no holes or lumps or areas that rise or fall suddenly: I love the smoothness of silk"}