{"id":335423,"name":"smudging","type":"noun","us_sound":"ˈsmʌdʒ.ɪŋ","us_link":"../audio/s/ussmoke008.mp3","uk_sound":"ˈsmʌdʒ.ɪŋ","uk_link":"../audio/s/uksmoke021.mp3","content":"smudging noun [U]\n(BECOMING DIRTY)\nAdd to word list\nAdd to word list\n(of ink, paint, etc.) the act or process of becoming dirty or not clear because someone or something has touched it: It is always preferable to work from top to bottom to avoid unwanted smudging. There is absolutely no smudging or smearing, and no leftover mascara after removal.\nMore examplesFewer examplesA coat of hairspray will stop any fading or smudging on your children's drawings and artwork.I leave the softer pencils until the whole drawing is practically finished, to prevent unintentional smudging.A liquid preparation is sprayed over charcoal drawings, chalks, or pastels to prevent smudging.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndispersion\ndisseminate\ndistribution\ndredge\ndusting\nencroach on/upon something\nfan out\nrambling\nscatteringly\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsprinkle\nSee more results »\nsmudging noun [U]\n(CEREMONY)\na ceremony that uses smoke from burning herbs to make a space pure: The burning of sage, or smudging, takes place in large ceremonies. The Centre has a fire pit where visiting tribes can perform smudging ceremonies. See\nsmudge\nMore examplesFewer examplesIt is widely known as the best sage for smudging, and has an amazing aroma which we all love. Most ceremonies I am aware of require years of devotion, praying, smudging, and fasting.Ceremonies involve the use of sacred herbs such as sage, sweet grass, and cedar in a smudging bowl.\nSMART Vocabulary: related words and phrases\nReligious practices\nagarbatti\nallocution\nanoint\nanointment\nbaptize\nfaith healing\nflagellate\nflagellation\nfleishig\ngenuflect\nproselyte\nproselytize\nprostration\npurdah\npurificatory\nrebaptize\nsidelock\ntelevangelism\nunbaptized\nunction\nSee more results »"}