{"id":335411,"name":"smudge","type":"noun","us_sound":"smʌdʒ","us_link":"../audio/s/smudge.mp3","uk_sound":"smʌdʒ","uk_link":"../audio/s/uksmoke019.mp3","content":"Add to word list\nAdd to word list\na mark with no particular shape that is caused, usually by accident, by rubbing something such as ink or a dirty finger across a surface: Her hands were covered in dust and she had a black smudge on her nose.figurative She said we were nearly there, but the island was still no more than a distant smudge on the horizon. Synonyms\nmark (DIFFERENT AREA)\nsmear (SPREAD)Compare\nstain noun (MARK)\nThesaurus: synonyms, antonyms, and examples\na mark on somethingmarkThe backs of the chairs have left marks on the wall.stainShe had grass stains on her white jeans.smearHe had smears of tomato ketchup on his shirt.smudgeNo matter how often I wash my hands, I leave smudges all over my phone's screen.blotchHe had blotches all over his face.speckShe looked through the old camera lens and saw specks of dust.\nSee more results »\nSMART Vocabulary: related words and phrases\nDirt & untidiness\nbloodstain\nblot\nclutter\ncontaminant\ncontamination\ncrud\nfleck\ngrime\ngrunge\ngunge\ngunk\nmuck\npollutant\nscrappiness\nscruff\nshambles\nslime\nslob\nslovenliness\nsmear\nSee more results »\nRelated word\nsmudgy\nIf ink, paint, etc. smudges or if someone smudges it, it becomes dirty or not clear because someone or something has touched it: She was crying and her mascara had smudged. Synonym\nsmear Compare\nmark verb (DAMAGE/MAKE DIRTY)\nstain verb (MARK)\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndispersion\ndisseminate\ndistribution\ndredge\ndusting\nencroach on/upon something\nfan out\nrambling\nscatteringly\nslap something on\nslather\nsmear\nsmudgily\nsmudging\nsprinkle\nSee more results »\nRelated word\nsmudging\nAdd to word list\nAdd to word list\na mark left on a surface, usually unintentionally, from having touched something wet or sticky: Trev wiped a smudge of chocolate from the side of his mouth.\nto make a dirty, wet, or sticky mark on a surface: She was sweaty and her face was smudged with dirt.\nIf you smudge something that is neat, you make it messy: She draws a line and then smudges it with her finger."}