{"id":335624,"name":"snare","type":"noun","us_sound":"sner","us_link":"../audio/s/snare.mp3","uk_sound":"sneər","uk_link":"../audio/s/uksmut_019.mp3","content":"Add to word list\nAdd to word list\na device for catching small animals and birds, usually with a rope or wire that tightens around the animal\nbauhaus1000/DigitalVision Vectors/GettyImages\na trick or situation that deceives you or involves you in some problem that you do not know about: The legal system is full of snares for those who are not wary.\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfisherman\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlotting & trapping\nto catch an animal using a snare: We used to snare small birds such as sparrows and robins.figurative She grew up in the days when a woman's main aim was to snare a rich husband.\nThesaurus: synonyms, antonyms, and examples\nto take a wild or loose animalcatchThe dog got out, but we caught her.netWe netted a ton of fish downstream.trawlCommercial fisheries trawl these waters for cod.trollThey troll for tuna far offshore. lassoThe cowboys learned at a young age how to lasso horses and steers.trapThe turtles are trapped for their flesh.\nSee more results »\nSMART Vocabulary: related words and phrases\nHunting & fishing\nangler\nangling\nanti-hunt\nanti-hunter\nanti-hunting\nbarb\nfisher\nfisherman\nfishhook\nfishing line\nfishing rod\nfly fishing\noutcatch\noutfish\noverfishing\npiscatory\npoach\nquarry\nravening\nwhaler\nSee more results »\nAdd to word list\nAdd to word list\na device for catching small animals, usually with a rope or wire that tightens around the animal\nA snare is also a trick or situation that deceives you or involves you unexpectedly in a problem: The legal system is full of snares for the unwary.\nto get or achieve something that is difficult to get: Arriving in Nashville, she had hopes of snaring a country-music record contract."}