{"id":335663,"name":"snatching","type":"verb","us_sound":"snætʃ","us_link":"../audio/s/snatch.mp3","uk_sound":"snætʃ","uk_link":"../audio/s/uksmut_022.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsnatch\nsnatch verb [T]\n(TAKE QUICKLY)\nC2 to take hold of something suddenly and roughly: He snatched the photos out of my hand before I had a chance to look at them.figurative Running the best race of his career, Fletcher snatched (= only just won) the gold medal from the Canadian champion.\nto take something or someone away by force: The six-year-old girl was snatched from a playground and her body was found two days later. She had her purse snatched (= stolen) while she was shopping. Synonyms\nabduct (TAKE A PERSON)\nkidnap\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\nto do or get something quickly because you only have a short amount of time: Maybe you'll be able to snatch a couple of hours' sleep before dinner.\nMore examplesFewer examplesDon't snatch, Isabel!He snatched the phone from my hand.She snatched the parcel and tore into it.Lara snatched the chocolate from my hand and put it to her mouth.Her handbag was snatched from her in the street.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\nIdiom\nsnatch victory (from the jaws of defeat)Phrasal verb\nsnatch at something"}