{"id":335778,"name":"snicker","type":"verb","us_sound":"ˈsnɪk.ɚ","us_link":"../audio/s/snicker.mp3","uk_sound":"ˈsnɪk.ər","uk_link":"../audio/s/uksneak007.mp3","content":"Add to word list\nAdd to word list\nto laugh at someone or something in a silly and often unkind way: What are you snickering at/about? People were staring and snickering. Synonym\nsnigger mainly UK\nThesaurus: synonyms, antonyms, and examples\nto laughlaughThe children were laughing at the cartoons.chuckleShe was chuckling as she read the letter.giggleThe girls were giggling at the back of the classroom.sniggerThey sniggered at what she was wearing.snickerUS Stop snickering at that rude joke and get back to your classwork.chortleShe chortled with glee at the news.\nSee more results »\nMore examplesFewer examplesHe wore his hair in a style that made his co-workers snicker.Some people snickered at the very idea of her becoming a pilot.Armstrong looked out into the audience to challenge anybody to snicker.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nthe act of laughing at someone or something in a silly and often unkind way: She barely stifled a snicker. His clothes prompted snickers and taunts from neighborhood boys. Synonym\nsnigger mainly UK\nMore examplesFewer examplesHis work often drew snickers and jokes.I had to supress a snicker when he started talking about how he fell over in the street.I heard subdued snickers from different parts of the room.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nAdd to word list\nAdd to word list\nto laugh quietly at someone or something that you think is silly or slightly ridiculous: The audience of sportswriters tried to keep from snickering, but failed miserably. snicker noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈsnɪk·ər/"}