{"id":335832,"name":"snigger","type":"verb","us_sound":"ˈsnɪɡ.ɚ","us_link":"../audio/s/ussniff003.mp3","uk_sound":"ˈsnɪɡ.ər","uk_link":"../audio/s/uksneak016.mp3","content":"Add to word list\nAdd to word list\nto laugh at someone or something in a silly and often unkind way: They spent half the time sniggering at the clothes people were wearing. What are you two sniggering at/about?\nThesaurus: synonyms, antonyms, and examples\nto laughlaughThe children were laughing at the cartoons.chuckleShe was chuckling as she read the letter.giggleThe girls were giggling at the back of the classroom.sniggerThey sniggered at what she was wearing.snickerUS Stop snickering at that rude joke and get back to your classwork.chortleShe chortled with glee at the news.\nSee more results »\nMore examplesFewer examplesHe sniggered quietly to himself.Schoolchildren snigger at the mention of some words.Stop sniggering at the back of the class please!\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »\nthe act of laughing at someone or something in a silly and often unkind way: We were having a snigger at the bride who was rather large and dressed in a tight, pale pink dress.\nMore examplesFewer examplesThere aren't many words which raise a snigger every time they're mentioned.Few other men in public life could say those words without provoking sniggers of disbelief in his audience.After half-an-hour of suppressing my sniggers at this drivel, I couldn't understand why nobody else was laughing.\nSMART Vocabulary: related words and phrases\nLaughing and smiling\na gleam in your eye idiom\namused\nbe all smiles idiom\nbe in convulsions idiom\nbe rolling in the aisles idiom\nbe wreathed in smiles idiom\nburst\ncrease\ndissolve\ngale\ngiggle\ngiggler\ngigglingly\ngiggly\nnot know whether to laugh or cry idiom\npiss yourself (laughing) idiom\nquake\nrictus\nsay cheese idiom\nsimper\nSee more results »"}