{"id":335893,"name":"snitch","type":"verb","us_sound":"snɪtʃ","us_link":"../audio/s/snitch.mp3","uk_sound":"snɪtʃ","uk_link":"../audio/s/uksneak023.mp3","content":"snitch verb\n(TELL SECRETLY)\nAdd to word list\nAdd to word list\n[ I ] informal disapproving to secretly tell someone in authority that someone else has done something bad, often in order to cause trouble: She thought I'd snitched on her.UK He snitched to my boss that I'd been making long-distance calls at work!\nMore examplesFewer examplesWould you snitch on your friend's partner?Inmates who snitch on other inmates risk being savagely beaten.Eventually a classmate snitched, and Emma was called to the headteacher's office.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunload\nunravel\nSee more results »\nsnitch verb\n(STEAL)\n[ T ] informal to steal something: \"Where did you get that money?\" \"I snitched it from my dad when he wasn't looking.\" Dad snitched the Halloween sweets.\nMore examplesFewer examplesI once snitched a bottle of perfume from my mother's bedroom.He'd snitched credit card numbers from credit-company computers.\"Slamming\" refers to an underhanded method of snitching clients from rivals.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\njoyriding\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoach\nsnaffle\nsnarf\nSee more results »\nsomeone who secretly tells someone in authority that someone else has done something bad, often in order to cause trouble: You little snitch! People who cooperate with police are viewed by their neighbours as snitches.\nMore examplesFewer examplesNobody wants to hire snitches who badmouth their employer.They hired the mafia to hunt down the snitch who released the information.He was largely convicted by the testimony of a lying jailhouse snitch.\nSMART Vocabulary: related words and phrases\nPeople who reveal secrets & tell tales\nbig mouth\nblabbermouth\ndobber\nfink\ngrass\ninformer\nnark\nrat\nrumour-monger\nscandalmonger\nscaremonger\nsneak\nsource\nstool pigeon\nsupergrass\ntattletale\ntelltale\nwhistle-blower\nsnitch verb\n(TELL SECRETLY)\nAdd to word list\nAdd to word list\n[ I ] to secretly tell someone in authority that someone else has done something bad, often in order to cause trouble: If you keep snitching on your friends, you won’t have many left.\nsnitch verb\n(STEAL)\n[ T ] to steal, or to take without permission: I snitched a pencil from your desk – hope you don’t mind.\ninfml a person who secretly tells someone in authority that someone else has done something bad: Don’t be a snitch."}