{"id":336146,"name":"snowplowing","type":"noun","us_sound":"ˈsnoʊ.plaʊ.ɪŋ","us_link":"../audio/s/cdo1121ussnow3959.mp3","uk_sound":"ˈsnəʊ.plaʊ.ɪŋ","uk_link":"../audio/s/cdo1121uksnow3930.mp3","content":"snowplowing noun [U]\n(REMOVING SNOW)\nAdd to word list\nAdd to word list\nthe activity of removing snow from roads and railroads using special vehicles : Highway departments ended up spending more money on snowplowing than they had budgeted. Ordering cars to stay off certain streets after a blizzard reduces snowplowing costs.\nMore examplesFewer examplesUrban areas are especially challenging for snowplowing because the snowplow creates snow banks that block driveways.After a winter of snowplowing, engineers will see how the ramps held up.They own and maintain a large fleet of snowplowing equipment.\nSMART Vocabulary: related words and phrases\nRemoving and extracting\nablate\nabstract\nabstraction\nbowdlerization\nbowdlerized\ndrain\nextraction\nfish something out\ngouge something out\ngrapeseed\nirremovable\nirremovably\nscoop\nslice\nslice something off\nsnowploughing\nsuck\nsuck someone/something dry idiom\ntake something away\nwipe\nSee more results »\nsnowplowing noun [U]\n(REMOVING CHILD'S PROBLEMS)\n(also snowplow parenting) the behavior of a parent who removes or deals with problems for a child, so they never have to do anything difficult and never fail, and do not learn how to do things for themselves: Snowplowing is the new parenting trend that is ruining children's lives. Make your kids do chores and avoid the perils of snowplow parenting.\nMore examplesFewer examplesSnowplowing is shoveling all problems out of the way before your child even hits them.The habit of snowplowing can be hard to break.What is snowplow parenting and should we be concerned about it?\nSMART Vocabulary: related words and phrases\nParenting & caring for children\nadopt\nadoptable\nadopted\nadoptee\nadoption\ncared-for\ncaretaking\nchild-rearing\nchildless\nchildlessness\nkinship carer\nlawnmower parent\nlooked-after\nmothering\nnanny\nsnowploughing\nstay-at-home\nswaddle\nunadoptable\nunadopted\nSee more results »"}