{"id":336170,"name":"snub","type":"verb","us_sound":"snʌb","us_link":"../audio/s/snub.mp3","uk_sound":"snʌb","uk_link":"../audio/s/uksnows006.mp3","content":"Add to word list\nAdd to word list\nto insult someone by not giving them any attention or treating them as if they are not important: Lawrence attempted to draw me into conversation, but I snubbed him, and went to another part of the room. I think she felt snubbed because Anthony hadn't bothered to introduce himself.\nThesaurus: synonyms, antonyms, and examples\nto intentionally not give someone or something any attentionignoreThe buzzing is irritating, but try to ignore it.disregardHe disregarded the advice of his doctor and went back to work.turn a blind eye toUntil now, the mayor has turned a blind eye to the city's homelessness problem.close your eyes toThe administration closed its eyes to human-rights abuses by its soldiers.\nSee more results »\nMore examplesFewer examplesHe denies that he is deliberately snubbing Owen.His wife snubs him because he is friendly toward the female staff. It infuriated him to be snubbed by a man for whom he had no respect.\nSMART Vocabulary: related words and phrases\nNeglecting and ignoring\naside\nbeneath the/someone's radar idiom\nblock something out\nbrush someone/something off\nbury/have your head in the sand idiom\near\nlay\nlet go idiom\nlet sleeping dogs lie idiom\nlet something go/pass idiom\nlet something ride idiom\nlook straight/right through someone idiom\nnose\nset something aside\nshut\nshut someone/something out\nshut your eyes to something idiom\nsomeone's back is turned idiom\nthe silent treatment idiom\nwink\nSee more results »\nan insult that involves not giving someone any attention or treating them as if they are not important: I simply didn't recognize her and apparently she took it as a snub. Vice presidents often feel offended by real and perceived snubs.\nMore examplesFewer examplesIt is not clear whether his omission from the guest list was an oversight or a deliberate snub.My younger brother was not aware of the subtle snubs and racist attitudes he occasionally faced while attending a prestigious private school.He has managed to build a superstar career in the face of constant snubs by the music establishment.\nSMART Vocabulary: related words and phrases\nInsults & abuse\nabusive\nabusively\nbackhanded compliment\nbrickbat\ncontumely\ncut (someone) to the quick idiom\ndenigration\ndis\njeer\nleft-handed compliment\nmouth\nname\nneg\nnegging\npoint-scoring\nput something/someone down\nrevile\nsledging\nslight\nstick\nSee more results »\nAdd to word list\nAdd to word list\nto treat someone rudely, esp. by ignoring that person: They’re likely to snub people who aren’t just like them. snub noun [ C ] us\nYour browser doesn't support HTML5 audio\n/snʌb/\nShe was annoyed by their snubs."}