{"id":336253,"name":"so","type":"adverb","us_sound":"soʊ","us_link":"../audio/s/sew.mp3","uk_sound":"səʊ","uk_link":"../audio/s/ukseven010.mp3","content":"so adverb\n(VERY)\nAdd to word list\nAdd to word list\nA2 very, extremely, or to such a degree: The house is so beautiful. Thank you for being so patient. Don't be so stupid! I didn't know she had so many children! You can only do so much to help (= there is a limit to how much you can help).ever so UK informal She's ever so kind and nice. I'm so tired (that) I could sleep in this chair!not so something as to do something I'm not so desperate as to agree to that.so something as to be something The word itself is so rare as to be almost obsolete.\nnot standard used before a noun or before \"not\" to emphasize what is being said: Don't wear that - it's so last year (= it was fashionable last year but not now).so not I'm sorry, but she is so not a size 10 (= she is very much larger than a size 10).\nused at the end of a sentence to mean to a very great degree: Is that why you hate him so? You worry so!\nMore examplesFewer examplesHe's so unreliable.It was so kind of you.I'm so tired.He's so gorgeous.She's so tall.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nso adverb\n(SAME WAY)\nB1 used usually before the verbs \"have\", \"be\", or \"do\", and other auxiliary verbs to express the meaning \"in the same way\" or \"in a similar way\": \"I've got an enormous amount of work to do.\" \"So have I.\" \"I'm allergic to nuts.\" \"So is my brother.\" Neil left just after midnight and so did Roz.as…so Just as you like to have a night out with the lads, so I like to go out with the girls now and again.\nMore examplesFewer examples\"We went on Saturday.\" \"So did we.\"\"I'm fed up with him.\" \"So am I.\"\"I've really put on weight.\" \"So have I.\"\"I'd like to go skiing.\" \"So would I.\"\"We're going to France this summer.\" \"So are we.\"\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\nso adverb\n(MENTIONED EARLIER)\nA2 used to avoid repeating a phrase mentioned earlier: \"I hope they stay together.\" \"I hope so too.\" \"Do you think he's upset?\" \"I don't think so.\" James is coming tonight, or so he said.\nB2 used to say that a situation mentioned earlier is correct or true: \"Is it true that we're not getting a pay increase this year?\" \"I'm afraid so.\" \"Anthony and Mia don't get along very well.\" \"Is that so?\" \"The forecast says it might rain.\" \"If so, we'll have the party inside.\"\nused to say that a fact that has just been stated is certainly true: \"My eyes are slightly different colours.\" \"So they are.\" \"That's her brother - he looks like James Dean.\" \"So he does.\"\nused instead of repeating an adjective that has already been mentioned: She's reasonable to work with - more so than I was led to believe. He's fairly bright - well, certainly more so than his brother.\nUS child's word used, especially by children, to argue against a negative statement: \"You didn't even see the movie.\" \"I did so!\" to do so\nC1 to act in the way mentioned: Parents must take responsibility for their children. Failure to do so could mean a fine or a jail sentence.\nSee more\nMore examplesFewer examples\"Will Charles be there?\" \"I think so.\"\"Is Lucy coming?\" \"I hope so.\"\"Are they leaving Manchester?\" \"I believe so.\"Alice works there - or so I was told.Oliver was furious - or so Tilly told me.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying again\nExpressions used to describe situations\nLinguistics: very & extreme\nso adverb\n(IN THIS WAY)\nin this way, or like this: The pillars, which are outside the building, are so placed in order to provide the maximum space inside. I've so arranged my trip that I'll be home on Friday night.\nused when you are showing how something is done: Just fold this piece of paper back, so, and make a crease here.like so Gently fold in the eggs like so.\nused when you are representing the size of something: \"How tall is he next to you?\" \"Oh, about so big,\" she said, indicating the level of her neck. \"The table that I liked best was about so wide,\" she said, holding her arms out a metre and a half.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing and acts\nGeneral words for size and amount\nGrammar\nSoWe often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo + adjective (so difficult), so + adverb (so slowly)We often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo much and so manyWe use so before much, many, little and few: …\nSo as a substitute formIn formal contexts we can use so instead of an adjective phrase after a verb: …\nSo am I, so do I, Neither do IWe use so with be and with modal and auxiliary verbs to mean ‘in the same way’, ‘as well’ or ‘too’. We use it in order to avoid repeating a verb, especially in short responses with pronoun subjects. When we use so in this way, we invert the verb and subject, and we do not repeat the main verb (so + verb [= v] + subject [= s]): …\nSo as a conjunctionWe use so as a subordinating conjunction to introduce clauses of result or decision: …\nSo as a discourse markerSo is a very common discourse marker in speaking. It usually occurs at the beginning of clauses and we use it when we are summarising what has just been said, or when we are changing topic: …\nSo: other uses in speakingSo far means ‘up to now’: …\nSo and not with expect, hope, think, etc.We can use so after some verbs instead of repeating an object clause, especially in short answers. The verbs we do this with most are: appear, assume, be afraid (meaning ‘regret’), believe, expect, guess, hope, imagine, presume, reckon, seem, suppose, think: …\nIdioms\nonly so much/many\nso be it\nso much so\nso conjunction\n(SENTENCE BEGINNING)\nA2 used at the beginning of a sentence to connect it with something that has been said or has happened previously: So, there I was standing at the edge of the road with only my underwear on ... So, just to finish what I was saying earlier...\nA2 used as a way of making certain that you or someone else understand something correctly, often when you are repeating the important points of a plan: So we leave on the Thursday and get back the next Tuesday, is that right?\nA2 used to refer to a discovery that you have just made: So that's what he does when I'm not around!\nA2 used as a short pause, sometimes to emphasize what you are saying: So, here we are again - just you and me.\nA2 used before you introduce a subject of conversation that is of present interest, especially when you are asking a question: So, who do you think is going to win the election?\ninformal used to show that you agree with something that someone has just said, but you do not think that it is important: So the car's expensive - well, I can afford it.\nMore examplesFewer examplesSo, what are we having for dinner?\"So, what were you saying about Nadia?\"So, you'll be moving house I hear.So, what was I saying just now?So that's why you wanted me there tonight - to help with the cooking!\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nnow\nslash\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nso conjunction\n(THEREFORE)\nA2 and for that reason; therefore: My knee started hurting so I stopped running. I was lost so I bought a street map.\nMore examplesFewer examplesShe was ill so I sent her some flowers to cheer her up.I felt a bit chilly so I put on a jacket.She looked at me so I smiled at her.He hit me so I hit him back.I was hungry so I bought a sandwich.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nnow\nslash\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nSoWe often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo + adjective (so difficult), so + adverb (so slowly)We often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo much and so manyWe use so before much, many, little and few: …\nSo as a substitute formIn formal contexts we can use so instead of an adjective phrase after a verb: …\nSo am I, so do I, Neither do IWe use so with be and with modal and auxiliary verbs to mean ‘in the same way’, ‘as well’ or ‘too’. We use it in order to avoid repeating a verb, especially in short responses with pronoun subjects. When we use so in this way, we invert the verb and subject, and we do not repeat the main verb (so + verb [= v] + subject [= s]): …\nSo as a conjunctionWe use so as a subordinating conjunction to introduce clauses of result or decision: …\nSo as a discourse markerSo is a very common discourse marker in speaking. It usually occurs at the beginning of clauses and we use it when we are summarising what has just been said, or when we are changing topic: …\nSo: other uses in speakingSo far means ‘up to now’: …\nIdioms\nso there\nso what?\nB1 used before you give an explanation for the action that you have just mentioned: [ + (that) ] I deliberately didn't have lunch so (that) I would be hungry tonight.so (that) Leave the keys out so (that) I remember to take them with me. so as to\nB2 in order to: I always keep fruit in the fridge so as to keep flies off it.\nSee more so as not to\nC1 in order not to: He did not switch on the light so as not to disturb her.\nSee more\nMore examplesFewer examplesI didn't tell him so he wouldn't worry.I took the umbrella so we wouldn't get soaked.I told my mother so she'd know why we were late.I got my hair cut so I'd be smart for the party.I gave it to Isobel so she could enjoy it too.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthat\nthing\nview\nwith a view to doing something idiom\nSee more results »\nGrammar\nSoWe often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo + adjective (so difficult), so + adverb (so slowly)We often use so when we mean ‘to such a great extent’. With this meaning, so is a degree adverb that modifies adjectives and other adverbs: …\nSo much and so manyWe use so before much, many, little and few: …\nSo as a substitute formIn formal contexts we can use so instead of an adjective phrase after a verb: …\nSo am I, so do I, Neither do IWe use so with be and with modal and auxiliary verbs to mean ‘in the same way’, ‘as well’ or ‘too’. We use it in order to avoid repeating a verb, especially in short responses with pronoun subjects. When we use so in this way, we invert the verb and subject, and we do not repeat the main verb (so + verb [= v] + subject [= s]): …\nSo as a conjunctionWe use so as a subordinating conjunction to introduce clauses of result or decision: …\nSo as a discourse markerSo is a very common discourse marker in speaking. It usually occurs at the beginning of clauses and we use it when we are summarising what has just been said, or when we are changing topic: …\nSo: other uses in speakingSo far means ‘up to now’: …\nSo that or in order that?We use so that and in order that to talk about purpose. We often use them with modal verbs (can, would, will, etc.). So that is far more common than in order that, and in order that is more formal: …\njust/exactly so\nperfectly tidy and well arranged: He's a perfectionist - everything has to be just so.\nSee more\nthe musical note\nsoh Synonym\nsol\nSMART Vocabulary: related words and phrases\nNotes of the musical scale\nB, b\nC, c\nD, d\ndoh\nE, e\nflat\nhigh doh\nla\nlah\nmajor\nmi\nmiddle C\nminor\nregister\nscale\nsemitone\nsoh\nsol\nsol-fa\nte\nSee more results »\nso adverb [not gradable]\n(TO SUCH A DEGREE)\nAdd to word list\nAdd to word list\nto such a great degree; very: He’s so stupid he’d believe anything you tell him. Our families live so far away.\nso adverb [not gradable]\n(SIMILARLY)\n(used usually before the verbs have, be, do, and other auxiliary verbs) in the same way; similarly: He was interested, and so were a lot of other people.\nso adverb [not gradable]\n(TRUE)\ntrue, or truly: He thinks I’m out to get him, but that simply isn’t so.\nso adverb [not gradable]\n(IN THIS WAY)\nmore or less like this or in this way: Grandpa could be generous when he so desired.\nSo is also used to suggest the approximate size of someone or something: The box is about so big. Idioms\nin so many words\nso much\nso much as\nso much so\nso what\nso there\nso be it\nso far\nso far, so good\nso help me\nMore idioms\nso long\nso long as\nso much for\nso to speak\nso adjective, adverb [not gradable]\n(IT IS THE SITUATION)\n(used instead of repeating something that has just been mentioned) it is the situation: \"I hope our paths cross again.\" \"I hope so too.\"\nso conjunction\n(THEREFORE)\nand for that reason; therefore: My knee started hurting, so I stopped running.\nso conjunction\n(IN ORDER THAT)\nin order that, or with the result that: They moved so they could be closer to her family.\nabbreviation for south or southern"}