{"id":336316,"name":"soar","type":"verb","us_sound":"sɔːr","us_link":"../audio/s/soar.mp3","uk_sound":"sɔːr","uk_link":"../audio/s/uksnows026.mp3","content":"soar verb\n(RISE QUICKLY)\nAdd to word list\nAdd to word list\nC2 [ I usually + adv/prep ] to rise very quickly to a high level: All night long fireworks soared into the sky. Temperatures will soar over the weekend, say the weather forecasters. House prices soared a further 20 percent.\nThesaurus: synonyms, antonyms, and examples\nto increaseincreaseWe need to increase production to meet demand.growThe number of people living alone grows each year.risePrices rose by 10 per cent.go upHouse prices keep going up.escalateCrime in the city has escalated in recent weeks.\nSee more results »\nC2 [ T ] to reach a great height: The highest peak in the range soars 15,771 feet into the sky.\nMore examplesFewer examplesShare prices have soared to a new all-time high in a day of frantic trading on the stock market.The popularity of such bands has soared in recent years.Property prices have soared in the last two years.Pollution levels are soaring all the time.All across Europe, wherever you look, marriage is in decline and divorce rates are soaring.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving upwards\nsoar verb\n(FLY)\n[ I ] (of a bird or aircraft) to rise high in the air while flying without moving the wings or using power: She watched the gliders soaring effortlessly above her.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\nfawn\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement through the air\nRelated word\nsoaring\nsoar verb [I]\n(INCREASE QUICKLY)\nAdd to word list\nAdd to word list\nto increase or go up quickly to a high level: temperatures/prices soared My spirits soared when I heard the good news.\nsoar verb [I]\n(RISE IN AIR)\n(esp. of a bird or aircraft) to rise or fly high in the air: Planes soared overhead.\nIf you say that a mountain, building, or other object soars, you mean that it has great height: The mountain soars 10,000 feet above the village.\nAdd to word list\nAdd to word list\nto increase quickly in amount, number, value, or level: Corn, soybean, and wheat prices all soared this year. The organic industry's sales are soaring. As prices tumbled, farmers watched their debt soar.soar from sth to sth Under her editorship its circulation has soared from 5,000 to 30,000. The Dow Jones was up 0.88% at 10,204.93 after soaring more than 210 points early in the day.shares/stocks soar The news sent shares soaring 12p to 170p."}