{"id":336323,"name":"soaring","type":"adjective","us_sound":"ˈsɔːr.ɪŋ","us_link":"../audio/s/usb01523.mp3","uk_sound":"ˈsɔː.rɪŋ","uk_link":"../audio/s/ukb01523.mp3","content":"soaring adjective\n(RISING)\nAdd to word list\nAdd to word list\nC1 rising very quickly to a high level: soaring property prices The soaring price of natural gas is a serious concern, since many power plants are fuelled by it.\nThesaurus: synonyms, antonyms, and examples\ngreater than the usual level or amounthighHigh temperatures are set to continue into next week.high inThis cereal is high in fibre and nutrients.extremeThey live in extreme poverty.stratosphericHome prices are stratospheric around here!soaringRents are soaring while pay remains steady.\nSee more results »\nMore examplesFewer examplesIn the face of soaring costs, family farms have faced increasing difficulty.There were still isolated moments of soaring hope. She has been hospitalized twice for soaring blood pressure.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice increases\nsoaring adjective\n(TALL OR HIGH)\nreaching a great height: The deep blue lakes, soaring peaks, and lush valleys are typical of Switzerland. For his interview, he chose a conference room that overlooked soaring skyscrapers.\nThesaurus: synonyms, antonyms, and examples\nhaving a large distance from bottom to tophighThe garden is surrounded by a high wall.tallMount Everest is the world's tallest mountain.loftyThe path winds along the lofty peaks of the Andes.soaringSoaring mountains and lush valleys are every nature enthusiast's dream.\nSee more results »\nMore examplesFewer examplesWith soaring mountains and clear blue skies, the country's beauty is inescapable.The home boasts enormous windows and soaring ceilings.If you live in a place with soaring hills and picturesque cottages, you probably have mixed feelings about tourists.\nSMART Vocabulary: related words and phrases\nMoving upwards\nascend\nascension\nascent\nbe on an upward/downward trajectory idiom\nbristle\nclamber\ncome\ncome up\nheave\nhoick\nlevitate\nlevitation\nmount\npull\nrear\nrise\nscale\nscramble\nshinny\nupwardly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHigh, tall and deep\nsoaring adjective\n(FLYING)\nrising high in the air while flying without moving the wings or using power: It is a mysterious region of castles and soaring eagles. His spare time is spent in soaring gliders. See\nsoar\nMore examplesFewer examplesa great soaring bird with long broad wingsThe soaring hawks are more readily seen because of their habit of circling high in the air.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) behaviour\naccidental\napex predator\nbeg\nbehave\nbehaviour\nbehavioural science\nclaw\ngambol\ngroom\nhoming\nhousebroken\nhover\nmonogamously\nmonogamy\nmurmuration\nnocturnal\nnon-migrant\nnuzzle\nscent\nskitter\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMovement through the air\nAdd to word list\nAdd to word list\nincreasing quickly in amount, number, value, or level: soaring costs/prices/sales For most of the summer, consumers in America were insulated from the soaring cost of crude oil."}