{"id":336431,"name":"society","type":"noun","us_sound":"səˈsaɪ.ə.t̬i","us_link":"../audio/s/eus74291.mp3","uk_sound":"səˈsaɪ.ə.ti","uk_link":"../audio/s/uksober015.mp3","content":"society noun\n(PEOPLE)\nAdd to word list\nAdd to word list\nB1 [ C or U ] a large group of people who live together in an organized way, making decisions about how to do things and sharing the work that needs to be done. All the people in a country, or in several similar countries, can be referred to as a society: a classless/multicultural/capitalist/civilized society These changes strike at the heart of British/American/modern society. There's a danger that we will end up blaming innocent children for society's problems. We must also consider the needs of the younger/older members of society.\n[ U ] (also high society) the part of society that consists of people who are rich, powerful, and fashionable: a society hostess/ball/function\n[ U ] formal the state of being together with other people: She prefers her own society (= likes to be alone).\nMore examplesFewer examplesA fair justice system is a fundamental part of a civilized society.In most countries, the family unit is still the cornerstone of society.We are witnessing the corrosion of moral standards within our society.The judge described him as a danger to society.We live in a multicultural society.\nSMART Vocabulary: related words and phrases\nSociety - general words\namenity\ncivilized\nconsumer society\nculturomics\ndigital divide\nhunter-gatherer\nnon-segregated\nnon-segregation\nnon-utility\npluralism\nsociality\nsocially\nsocietal\nsocietally\nsocio-\nsociologist\nsociology\nsuperstructure\nuncivilized\nutility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRich people\nFriends, acquaintances & contemporaries\nsociety noun\n(ORGANIZATION)\nB2 [ C ] an organization to which people who share similar interests can belong: the school debating society the Royal Society for the Protection of Birds\nMore examplesFewer examplesa choral societyan operatic society\nSMART Vocabulary: related words and phrases\nOrganizations, Societies & clubs\nAssn\nAssoc.\nco-op\ncollegium\ncooperative\nestablishment\nfellowship\nguild\nhost\nlodge\nmembership\norganization\nsecretary\nsemi-public\nshuffle\nsuperclub\nthird party\ntrust\nyouth academy\nyouth club\nSee more results »\nsociety noun\n(PEOPLE)\nAdd to word list\nAdd to word list\n[ C/U ] people considered as a group, or a group of people who live together in a particular social system: [ U ] Society is changing little by little. [ C ] Societies change over the course of time.\n[ C/U ] Society also refers to that group of people who are rich, powerful, or fashionable: [ U ] He’s a part of Boston society.\nsociety noun\n(ORGANIZATION)\n[ C ] an organization for people who have special interests or who want to support particular activities: Zoological societies protect and study wild animals.\nAdd to word list\nAdd to word list\n[ U ] people in general living together in an organized way, making decisions about how to do things, and sharing the work that needs to be done: Society cannot expect perfection in products and services, but it can expect that corporations will always act responsibly. These fraudsters are preying on the poorest and the most vulnerable people in society.\n[ C or U ] the people who live in a particular country or area and their way of life and customs: The prime growth engine of capitalist societies is innovation. We live in a multicultural society. Will we ever achieve a cashless society? Homeownership is a linchpin of American society.\n[ C ]\n&#160; BANKING used in the name of some UK banks to show that they are mutuals (= banks that are owned by the people who keep money in them), or that they were mutual in the past: The building society responded to numerous inquiries about mortgages from first-time buyers. These bonds are only offered by friendly societies. The society says it has been passing on extra benefits to its members for some time.\n[ C ] an organization to which people who share similar interests can belong: the American Society of Civil Engineers the Industrial Society See also\nbuilding society\nclassification society\nconsumer society\ncooperative society\ncredit society\nfriendly society\nstakeholder theory"}