{"id":336392,"name":"social","type":"adjective","us_sound":"ˈsoʊ.ʃəl","us_link":"../audio/s/social.mp3","uk_sound":"ˈsəʊ.ʃəl","uk_link":"../audio/s/uksober007.mp3","content":"social adjective\n(GOING OUT)\nAdd to word list\nAdd to word list\nB1 relating to activities in which you meet and spend time with other people and that happen during the time when you are not working: I had an active social life when I was at college. I'm a social drinker - I only drink when I'm with other people. Most schools organize social events for the students.UK I've just become a member of the company's sports and social club.\napproving Social people like to meet and spend time with other people: I'm shy, but my brother's very social. Synonyms\ngregarious\nsociable approvingOpposite\nunsociable\nMore examplesFewer examplesSusannah's party was the social event of the year.I see her two or three times a year, usually at social functions.One of the minus points of working at home is not having social contact with colleagues.Whenever I'm in a social situation with my boss, we seem to run out of conversation after two minutes!a social gathering\nSMART Vocabulary: related words and phrases\nFriendly\naffability\naffable\naffably\naffiliative\nagreeableness\nconversable\nconvivial\nconviviality\nconvivially\ncordial\nhospitable\nhospitably\nhospitality\ninseparable\nsugar and spice idiom\nsweet-natured\nsweet-tempered\nsweetness\nthe human touch\ntogetherness\nSee more results »\nsocial adjective\n(SOCIETY)\nB2 [ before noun ] relating to society and living together in an organized way: social classes/groups social disorder/trends/change/equality/justice/differences Monkeys are highly social animals. Synonym\nsocietal formal\nMore examplesFewer examplesThere have been monumental social and demographic changes in the country.People's voting habits are influenced by political, social and economic factors.The government have failed to come to grips with the two most important social issues of our time.Some monkeys have a very complex social hierarchy.Overpopulation is one of the country's most pressing social problems.\nSMART Vocabulary: related words and phrases\nSociety - general words\namenity\ncivilization\ncivilized\nconsumer society\nculturomics\ndigital divide\nhunter-gatherer\nnon-segregated\nnon-segregation\nnon-utility\npluralism\nsocially\nsocietal\nsocietally\nsocio-\nsociocultural\nsociology\nsuperstructure\nuncivilized\nutility\nSee more results »\nsocial noun [C]\n(PARTY)\nold-fashioned an occasion when the members of a group or organization meet informally to enjoy themselves: a church social Synonym\nmixer (SOCIALIZE) US old-fashioned\nSMART Vocabulary: related words and phrases\nCelebrations, parties & special occasions\nafterparty\nApril Fool's Day\nbaby shower\nbachelor party\nbackslapping\nDay of the Dead\ndinner\ndinner dance\nEaster egg hunt\nfayre\nlawn party\nluau\nmasked ball\nmasquerade\nmela\nstrippergram\nsweet sixteen\ntea party\ntrick-or-treating\nValentine's Day\nSee more results »\nsocial noun [C]\n(SOCIAL MEDIA)\ninformal a social media website : I've deleted them from all my socials. Please share our crowdfunder on your socials.\nSMART Vocabulary: related words and phrases\nInternet terminology\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet café\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweetstorm\ntwitterati\nTwitterer\ntwittering\ntwitterstorm\nSee more results »\nsocial adjective [not gradable]\n(OF HUMAN SOCIETY)\nAdd to word list\nAdd to word list\nrelated to the way people live together or to the rank a person has in a society: social conditions/position\nsocial adjective [not gradable]\n(OF MEETING PEOPLE)\nrelated to meeting and spending time with other people for pleasure: He had almost no social life.\nAdd to word list\nAdd to word list\nrelating to society and the way people live together: Women may have emerged as Algeria's most potent force for social change. If the government is to earn a reputation as a government of social reform it will need to loosen its alliance with capitalism.\nrelating to your position in society: The rate of stress at work is consistent throughout the population, irrespective of age, sex and social class. social status/standing\nrelating to activities in which you meet and spend time with other people and to your ability to be friendly with others: Social skills are what employers need most. There is a social event every two or three months. I keep my social life fairly separate from work.\nan event at which people can meet and enjoy themselves: The company is sponsoring socials to bring telecommuters together and give them the feeling that they belong to a community. We meet up at various socials; it assists team building."}