{"id":336415,"name":"socializing","type":"noun","us_sound":"ˈsoʊ.ʃə.laɪ.zɪŋ","us_link":"../audio/s/cdo1121ussoci3970.mp3","uk_sound":"ˈsəʊ.ʃəl.aɪ.zɪŋ","uk_link":"../audio/s/cdo1121uksoci3939.mp3","content":"socializing noun [U]\n(GOING OUT)\nAdd to word list\nAdd to word list\nthe activity of spending time when you are not working with friends or with other people in order to enjoy yourself: I work 50 hours a week, so there's not much time for socializing. Some students care more about socializing than school.\nMore examplesFewer examplesSocializing, such as visiting with friends or attending or hosting social events, was the next most common leisure activity.By most accounts his \"relentless socializing\" contributed to his demise. It's a popular student hangout for studying, socializing, and sipping java.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nbuild\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nstrike\nSee more results »\nsocializing noun [U]\n(TRAINING)\nthe process of learning or training people or animals to behave in a way that is acceptable in a group : Working as a team reinforces socializing, learning how to share, and taking turns. The breed makes a good family pet, but needs plenty of socializing and must know its boundaries.\nMore examplesFewer examplesAlong with academics, the school offers classes in physical play, and socializing through conversation, art, and music.Socializing means introducing your puppy to as many new people, dogs, places, and situations as possible.Puppy raisers are required to attend class with their dogs to learn more about training and socializing.\nSMART Vocabulary: related words and phrases\nTeaching in general\nasynchronous\nchief academic officer\nCLIL\nclue\nclue in\ncommunicative\ndidactic\ninstruct\nmiseducation\nMoodle\nmulti-course\nnon-conditioned\nnon-didactic\nsocialization\nsocialize\nspecial education\nSRE\nsynchronous\nteach someone a lesson idiom\ntutelage\nSee more results »"}