{"id":336675,"name":"software","type":"noun","us_sound":"ˈsɑːft.wer","us_link":"../audio/s/software.mp3","uk_sound":"ˈsɒft.weər","uk_link":"../audio/s/uksodiu014.mp3","content":"Add to word list\nAdd to word list\nA2 the instructions that control what a computer does; computer programs: He's written a piece of software that does your taxes for you. Compare\nhardware (COMPUTER)\nMore examplesFewer examplesHe works for a software company.When you buy a new computer, you usually get software included at no extra cost.This software helps firms archive and retrieve emails.Andrew, can you help me install this software?He's written a piece of software that calculates your tax returns for you.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nAdd to word list\nAdd to word list\nthe instructions that control what a computer can do; computer programs: educational software\nAdd to word list\nAdd to word list\nthe programs that you put into a computer to make it do particular jobs: The help desk helps customers install and run software. install/load software Thousands of users are able to download software provided by the company.develop/design software The company has invested $3m to develop software. They have written software for an international trade database. The firm masterminds the computer software and hardware for the lottery. The companies offer software applications through the internet. software developer/consultant/company financial/educational/accounting software See also\napplication software\ngraphic software\ninvestment software\nknowledge-based software\npackaged software\npresentation software\nspeech recognition software\nthird-party softwareCompare\nhardware"}