{"id":336634,"name":"soft","type":"adjective","us_sound":"sɑːft","us_link":"../audio/s/soft.mp3","uk_sound":"sɒft","uk_link":"../audio/s/uksodiu005.mp3","content":"soft adjective\n(NOT HARD)\nAdd to word list\nAdd to word list\nA2 not hard or firm: soft ground a soft pillow/mattress soft cheese I like chocolates with soft centres. Soft tissue, such as flesh, allows X-rays through.\nA2 Soft things, especially parts of the body, are not hard or rough and feel pleasant and smooth when touched: soft lips/cheeks/skin/hair soft leather\ninformal disapproving Someone who is soft is not very healthy and strong: Look at you! You need more exercise. You're going/getting soft.\nMore examplesFewer examplesI like soft French cheeses such as Brie and Camembert.Sleeping on a bed that is too soft can be bad for your back.Bananas and other soft fruits bruise easily.The material was soft to the touch.He loved the feel of her soft hair against his skin.\nSMART Vocabulary: related words and phrases\nSoft and fluffy\nanneal\nas smooth as silk/a baby's bottom idiom\nbillowy\ncottony\nfeathery\nfrothily\nfrothy\ngauzy\nlathery\nlimp\nsilky\nsoften\nsoftener\nsoftness\nsoggily\nsupersoft\nultra-soft\nvelvet\nvelvety\nworkable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeakness and vulnerability\nsoft adjective\n(GENTLE)\nB1 not forceful, loud, or easily noticed: a soft voice/sound soft music/lighting a soft glow\nThesaurus: synonyms, antonyms, and examples\nmaking little or no noisequietThere was a quiet tapping at the door.silentThe stadium fell silent after the goal was scored.soft\"Come here!\" he said in a soft voice.muffledI could hear muffled voices from the next room.faintThere was the faint sound of traffic in the distance.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nnot strong or forcefulgentleA gentle breeze stirred the leaves.mildThe children just have a mild cold.softHer voice was so soft, I could barely hear her.lightThe temperature in London is 24 degrees, with light winds out of the west.lowKeep your voices low while the baby's sleeping.\nSee more results »\ndisapproving not severe or forceful enough, especially in criticizing or punishing someone who has done something wrong: She thinks I'm too soft on the kids when they misbehave. The government can't be seen to be taking a soft line (= not being severe enough) with criminals.\nThesaurus: synonyms, antonyms, and examples\ncalm and nice to othersgentleShe's so sweet and gentle with the children.mildHer grandmother is such a kind, mild person.mild-manneredHe's a mild-mannered diplomat known for his measured responses to crisis. genteelThey're lovely, genteel people who sent flowers when her father passed away.wouldn't hurt a flyOh, she's so nice, she wouldn't hurt a fly.\nSee more results »\nMore examplesFewer examplesthe soft flicker of candlelightPalm trees swayed lazily in the soft breeze.He put on some soft music and turned the lights down in order to give the room a bit more atmosphere.I heard the soft mutter of voices in the next room.He spoke with a soft Irish accent.\nSMART Vocabulary: related words and phrases\nTender & gentle\ncaressing\ncaressingly\nfly\ngentle\ngentleness\ngently\nmeekly\nmeekness\nmild\nmild-mannered\nmildly\nmildness\nnon-critical\nsoftness\nsofty\ntender\ntender-hearted\ntenderly\ntenderness\nSee more results »\nsoft adjective\n(EASY)\nUK not difficult: He's got a pretty soft job - he hardly seems to do anything all day.\nSMART Vocabulary: related words and phrases\nEasiness and simplicity\n(as) easy as pie/ABC/anything/falling off a log idiom\na walk in the park idiom\naccessibility\nat the push of a button idiom\nat the stroke of a pen idiom\nbe a matter of something idiom\nfacilely\nfail-safe\nfoolproof\nfrictionless\nfrictionlessly\nover-facile\nover-simple\nover-simply\npainlessly\npainting\nUX\nwalk\nwalk into something\nwieldy\nSee more results »\nsoft adjective\n(WATER)\nSoft water contains a low level of minerals and allows soap to make bubbles.\nSMART Vocabulary: related words and phrases\nWater in general\naquatically\naqueous\nbathwater\nbathymetric\nbathymetrically\nbathymetry\nbrackish\nbriny\ndistilled water\ngrey water\nhydrosphere\nhypersaline\nhypersalinity\nnon-turbulent\noverwater\nrainwater\nsalt water\nsoft water\nstorm surge\nwet\nSee more results »\nsoft adjective\n(DRUGS)\n[ before noun ] Soft drugs are illegal drugs that many people think are not dangerous.\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\nsoft adjective\n(ECONOMY)\nIn a soft market/economy there are more goods for sale than there are people to buy them, so prices are usually low.\nRelated word\nsoftness nounIdioms\nbe soft on someone\nsoft in the head\nsoft adjective [-er/-est only]\n(NOT HARD)\nAdd to word list\nAdd to word list\nnot hard or firm; changing its shape when pressed: The crabs are plucked from the water before their soft shells have had a chance to harden. The baby’s skin feels so soft (= smooth and enjoyable to touch).\nsoft adjective [-er/-est only]\n(GENTLE)\nnot forceful, loud, or easily noticed: a soft voice She likes soft pastel colors.\nsoft adjective [-er/-est only]\n(WEAK)\nnot strong; weak: Car sales were soft last year. If someone is said to be soft on crime, that person is thought to be not forceful enough in punishing criminals.\nsoft adjective [-er/-est only]\n(EASY)\nnot difficult; easier than other things of the same type: She asked some soft questions.\nAdd to word list\nAdd to word list\nSTOCK MARKET, FINANCE used to describe a market in which prices are not rising or are going down: Its products may be good, but they cost a lot of money, which makes them difficult to sell in a soft market. Deepening soft market conditions make profitable growth difficult to maintain. Compare\nhard\nECONOMICS used to describe prices, demand, sales, etc. that are not increasing or that are falling: The industry is generally struggling with soft prices and expensive running costs. Domestic demand is soft and the Fed could cut interest rates further."}