{"id":336669,"name":"softness","type":"noun","us_sound":"ˈsɑːft.nəs","us_link":"../audio/s/softness.mp3","uk_sound":"ˈsɒft.nəs","uk_link":"../audio/s/uksodiu013.mp3","content":"softness noun [U]\n(NOT HARD)\nAdd to word list\nAdd to word list\nB2 the quality of not being hard or firm: the softness of the bed\nthe quality of not being rough or hard to touch: the softness of a baby's skin He wanted to take her hand and feel its softness.\nMore examplesFewer examplesThe luxury bathrooms feature high-end tiling, the deepest baths, and towels of unbelievable softness.Feel the luxurious softness of silk against your skin. It has the richness and softness of velvet. The softness of gold made it relatively easy to employ for ornamental purposes. Then he hugged her to him, feeling her warmth and softness.\nSMART Vocabulary: related words and phrases\nSoft and fluffy\nanneal\nas smooth as silk/a baby's bottom idiom\nbillowy\ncottony\nfeathery\nfrothily\nfrothy\ngauzy\nlathery\nlimp\nsilky\nsoften\nsoftener\nsoggily\nsogginess\nspongy\nultra-soft\nvelvet\nvelvety\nworkable\nSee more results »\nsoftness noun [U]\n(GENTLE)\nB1 the quality of not being forceful, loud, or easily noticed: Some people were surprised by the softness of his voice.\ndisapproving the quality of not being severe or forceful enough, especially in criticizing or punishing someone who has done something wrong: He was criticized for his softness on crime.\nMore examplesFewer examplesI don't think he's comfortable revealing the softness that he has, the vulnerable part.Her softness of manner overlays a core of complete moral certainty.There was a softness in her eyes.That likability should not be mistaken for softness, her fans say.\nSMART Vocabulary: related words and phrases\nTender & gentle\ncaressing\ncaressingly\nfly\ngentle\ngentleness\ngently\nmeekly\nmeekness\nmild\nmild-mannered\nmildness\nnon-critical\nsoft\nsofty\ntender\ntender-hearted\ntenderly\ntenderness\nTLC\nSee more results »\nsoftness noun [U]\n(OF WATER)\nthe quality of water when it contains a low level of minerals and allows soap to make bubbles\nExamples\nShe explained that the sound produced is dramatically affected by the hardness or softness of the water the glasses spin in.\nSMART Vocabulary: related words and phrases\nWater in general\naquatically\naqueous\nbathwater\nbathymetric\nbathymetrically\nbathymetry\nbrackish\nbriny\ndistilled water\nfreshwater\ngrey water\nhypersaline\nhypersalinity\nnon-turbulent\noverwater\npool\nrainwater\nsalt water\nsoft water\nwet\nSee more results »\nsoftness noun [U]\n(OF ECONOMY)\nthe situation in a market or economy when there are more goods for sale than there are people to buy them, so prices are usually low: The market has been showing some signs of softness.\nMore examplesFewer examplesFalgoust said the stock market's drop and concern over the national economy is what's behind the softness in the commercial market. The company expects that softness to continue into its next fiscal year as well. With some softness in the energy business, the momentum for Houston's energy-reliant economy in the new year is not robust.Buyers have sensed that low mortgage rates and a softness in the market mean they can get good deals now.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrenchment\nstagflation\nthe public purse\nSee more results »\nSee\nsoft\nsoftness noun [U]\n(LACK OF HARDNESS)\nAdd to word list\nAdd to word list\nthe quality of being soft and not hard or firm: I sank into the softness of my bed.\nsoftness noun [U]\n(GENTLE QUALITY)\nthe quality of being gentle and not loud or forceful: There was a softness in her voice.\nsoftness noun [U]\n(WEAKNESS)\nthe quality of being weak: A lot of people think that kindness is a sign of softness."}