{"id":336645,"name":"soften","type":"verb","us_sound":"ˈsɑː.fən","us_link":"../audio/s/soften.mp3","uk_sound":"ˈsɒf.ən","uk_link":"../audio/s/uksodiu009.mp3","content":"soften verb [I or T]\n(LESS HARD)\nAdd to word list\nAdd to word list\nto become soft, or to make something soft: You can soften the butter by warming it gently. These dried apples will soften (up) if you soak them in water.\nSMART Vocabulary: related words and phrases\nSoft and fluffy\nanneal\nas smooth as silk/a baby's bottom idiom\nbillowy\ncottony\nfeathery\nfrothily\nfrothy\ngauzy\nlathery\nlimp\nsilky\nsoftener\nsoftness\nsoggily\nsogginess\nspongy\nultra-soft\nvelvet\nvelvety\nworkable\nSee more results »\nsoften verb [I or T]\n(MORE GENTLE)\nto become more gentle or less strict, or to make someone do this: The news will upset him - we must think of a way to soften the blow (= make the news less unpleasant for him). Would you say the government's stance on law and order has softened?\nSMART Vocabulary: related words and phrases\nCalming and relaxing\nappease\nassuage\nballs-to-the-wall\nbask\nbread\nchill\ncompose\nkick back\nlet/blow off steam idiom\nlie down\nlighten something up\nlull\nmelt\nplacebo\nrelaxation\nrelaxer\nrelaxing\nself-soothe\nsettle down\nshirt\nSee more results »\nPhrasal verb\nsoften someone up\nsoften verb\n(BECOME GENTLE)\nAdd to word list\nAdd to word list\n[ I/T ] to become gentle, or to make something less forceful or loud: [ T ] He made an effort to soften his tone.\nsoften verb\n(WEAKEN)\n[ T ] to make something weaker: Congress will move to soften the law’s impact.\nsoften verb\n(BECOME LESS FIRM)\n[ I/T ] to become less hard or firm, or to make something less firm: [ I ] The butter will soften if you leave it out.\nIdiom\nsoften the blowPhrasal verb\nsoften someone/something up\nAdd to word list\nAdd to word list\n[ I ]\n&#160; FINANCE, STOCK MARKET if demand, a price, a market, etc. softens, it stops increasing or it goes down: Share prices softened with continued worries about the country's economic recovery. Although demand softened again in November, it has strengthened in December. When the economy began softening, the relatively newer factories in the suburbs began to feel pressure. There are signs that household expenditure is already softening after the longest consumer boom on record.soften against sth Sterling may have strengthened against the dollar but it's softened against the euro.\n[ I or T ] to become, or to make something seem, less severe or unpleasant: The regulator's stance on water mergers has softened. The new draft softens the rules on the role of the senior non-executive director. The organisation is trying to soften its image."}