{"id":336816,"name":"solarize","type":"verb","us_sound":"ˈsoʊ.lɚ.aɪz","us_link":"../audio/s/cdo0623ussola3747.mp3","uk_sound":"ˈsəʊ.lər.aɪz","uk_link":"../audio/s/cdo0623uksola3771.mp3","content":"solarize verb\n(SOIL)\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; biology\n&#160; specialized to cover soil with plastic in order to use the sun to prepare it for planting: You need to keep an eye on the condition of the plastic when you solarize for extended periods. Normally, 4–6 weeks are required to properly solarize soil.\nMore examplesFewer examplesThe rest of the garden can be solarized, to dry out the soil and reduce insect populations.Soil pH was slightly lower in the solarized plots.A field must be solarized the summer prior to planting the corn.\nSMART Vocabulary: related words and phrases\nGardening - general words\nallotmenteer\nallotmenteering\naquaponics\narborist\nbeanpole\nbed\nhedging\nhomegrown\nhorticultural\nhorticulturally\nhorticulture\nprune\nregraft\nregreen\nrepot\nresod\nweedy\nwindow box\nxeriscaping\nyardwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImproving fertility & pest control\nSoil\nsolarize verb\n(PHOTO)\n[ I or T ] old-fashioned to give light to a piece of photographic film or paper before the image is completely developed (= treated with chemicals to make the image appear), which changes the light and dark areas or colours of the printed image: The solarized portrait was done using special darkroom techniques. Be careful not to allow the film to solarize during development.\nMore examplesFewer examplesHe produced solarized images of the rich and famous.When you solarize the negative, you can make any number of identical final prints.The film was solarized for various lengths of time.She produced solarized duotone prints that have a mysterious, coppery look.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nprojection\nSee more results »\nsolarize verb\n(BUILDING)\n[ T ] to add devices to a building so that it can use the energy from the sun to produce electric power: Harvest the sun and beat energy costs by solarizing your home. He's very keen on the idea of solarizing the city as much as possible.\nMore examplesFewer examplesIn certain areas, it may be possible to get a grant to solarize your house.The book provides step-by-step plans for project organizers to solarize their community.We can and should solarize 5 million homes a year.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\natmospheric pressure\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nspecific heat\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvironmental issues"}