{"id":336876,"name":"sole","type":"adjective","us_sound":"soʊl","us_link":"../audio/s/sole.mp3","uk_sound":"səʊl","uk_link":"../audio/s/uksoldi002.mp3","content":"Add to word list\nAdd to word list\nC1 being one only; single: My sole objective is to make the information more widely available. The sole survivor of the accident was found in the water after six hours.\nThesaurus: synonyms, antonyms, and examples\nhaving no others like this oneonlyShe's the only one who can do it.oneHe's the one person you can rely on in a situation like this.singleYou haven't listened to a single thing I've said!lonePolice were looking for a lone gunman.soleHe was the sole survivor of the plane crash.\nSee more results »\nC1 not shared with anyone else: She has sole responsibility for the project. I have sole charge of both children all day.\nMore examplesFewer examplesThe company's sole concern is to ensure the safety of its employees.In most of these cases, the woman is the sole earner in the family.Letters whose sole purpose is to make a political point will not be published.He was the sole survivor of the plane crash.The sole British runner, White Knight, was unplaced.\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\nquintuple\nsolitarily\nsolitary\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlone\nsole noun [C]\n(FOOT)\nplural soles the bottom part of the foot that touches the ground when you stand or walk, or the bottom part of a shoe that touches the ground, usually not including the heel: a cut on the sole of her foot shoes with rubber soles\nFabrice LEROUGE/ONOKY/GettyImages\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh heels\nhigh-top\nhiking boot\nhobnail\nhobnail boot\nrunning shoe\nsandal\nshoehorn\nshoelace\nshoemaker\nwedge\nwedgie\nwellie\nwellington\nwelly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe foot\nsole noun [C]\n(FISH)\nplural sole one of a number of flat, round fish that are eaten as food: lemon sole Dover sole\nEddWestmacott/ iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSea fish\nalbacore\nAmerican shad\nanchovy\nbarracuda\nbeluga\nelver\nflatfish\nflathead\nflounder\nflying fish\nPacific salmon\npilchard\npink salmon\nplaice\npollack\nsprat\nstickleback\nstingray\nstonefish\nstriped bass\nSee more results »\nto put a new sole on a shoe\nSMART Vocabulary: related words and phrases\nShoes\nankle boot\nballet shoe\nBirkenstock\nbootie\nbootlace\nhigh heels\nhigh-top\nhiking boot\nhobnail\nhobnail boot\nrunning shoe\nsandal\nshoehorn\nshoelace\nshoemaker\nwedge\nwedgie\nwellie\nwellington\nwelly\nSee more results »\nRelated word\n-soled\nsole adjective [not gradable]\n(ONLY)\nAdd to word list\nAdd to word list\nbeing the only one; single: She is the sole survivor of the accident.\nSole also means belonging to one person or group: The team moved into sole possession of first place. solely adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈsoʊl·li/\nThese industries aren’t solely responsible for hazardous wastes.\nsole noun\n(BOTTOM PART OF FOOT)\n[ C ] the bottom part of a foot which touches the ground when you stand or walk, or the front part of the bottom of a shoe: shoes with leather/rubber soles\nsole noun\n(FISH)\n[ C/U ] plural sole a flat, round fish that is eaten as food\nAdd to word list\nAdd to word list\nbeing the only one: Investment trusts are companies whose sole business is investing.sole owner/director A company which has a sole director is required to have another person as its company secretary. The deal makes the bank the company's sole agent in the region. The University is North America's sole supplier of an antibiotic to treat tuberculosis.\nnot shared with anyone else: UK employers are far too powerful to accept sole responsibility for employees' pensions."}