{"id":337104,"name":"solitary","type":"adjective","us_sound":"ˈsɑː.lə.ter.i","us_link":"../audio/s/solitary.mp3","uk_sound":"ˈsɒl.ɪ.tər.i","uk_link":"../audio/s/uksolip003.mp3","content":"Add to word list\nAdd to word list\nC2 A solitary person or thing is the only person or thing in a place: On the hill, a solitary figure was busy chopping down trees. In the distance was a solitary building. He was a solitary child (= he enjoyed being alone).\nThesaurus: synonyms, antonyms, and examples\nnot with othersaloneYou can tell me your secret - I think we're alone. (all) on your ownI like living on my own. on your lonesomeUK Sure, you can play the game on your lonesome, but it's more fun with friends.on your todUK Ah, your family's gone and left you on your tod, have they?unaccompaniedTo everyone's great surprise, she arrived at the ball unaccompanied.solitaryHe was a solitary child who preferred reading a book to football.\nSee more results »\nC2 done alone: solitary walks by the river fishing and other solitary pastimes\nThesaurus: synonyms, antonyms, and examples\nwithout help(all) by yourselfI don't think I can fix the car alone - can you help?(all) on your ownUK I learnt the song all on my own. single-handedlyShe single-handedly saved the company from bankruptcy.unassistedAfter years of using a cane, intensive physio enabled her to walk unassisted.unaidedAfter six months of treatment I can finally walk unaided.independentlyThe charity helps people to live independently.\nSee more results »\nSMART Vocabulary: related words and phrases\nNumbers: single, double & multiple\nalone\nbilateral\nbilaterally\nbipartite\nbipolar\ndeca-\ndeka-\ndouble-action\ndual\nhimself\nmultiple\nplural\npurely\nquintuple\nsolitarily\ntrilateral\ntrilaterally\ntriply\nunilateral\nunit\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlone\ninformal short for\nsolitary confinement : a punishment in which someone is kept alone in a room, especially in a prison: After weeks in solitary, he started hallucinating. Prisoners made a grim joke of their confinement, saying that solitary was like being dead in a coffin.\nSMART Vocabulary: related words and phrases\nPutting people in prison\nat His/Her Majesty's pleasure idiom\nbang\nbang someone up\nbar\nbehind bars idiom\nbird\nimmured\nimprison\nimprisonment\nincarcerate\nincarceration\nintern\nlock\npen\nremand\nrestraint\nrot\nrot in jail, prison, etc. idiom\nsend\nstretch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nAdd to word list\nAdd to word list\nbeing the only one, or not being with other similar things, often by choice: I live a solitary life. He enjoys solitary walks in the wilderness."}