{"id":337133,"name":"solo","type":"adjective","us_sound":"ˈsoʊ.loʊ","us_link":"../audio/s/solo.mp3","uk_sound":"ˈsəʊ.ləʊ","uk_link":"../audio/s/uksolip005.mp3","content":"Add to word list\nAdd to word list\nB2 alone; without other people: a solo performance/flight to sail/fly solo He used to play with a group but now he's going solo/pursuing a solo career.\nThesaurus: synonyms, antonyms, and examples\nwithout help(all) by yourselfI don't think I can fix the car alone - can you help?(all) on your ownUK I learnt the song all on my own. single-handedlyShe single-handedly saved the company from bankruptcy.unassistedAfter years of using a cane, intensive physio enabled her to walk unassisted.unaidedAfter six months of treatment I can finally walk unaided.independentlyThe charity helps people to live independently.\nSee more results »\nMore examplesFewer examplesHe made his name in the 90s boy band Boyzone, before going on to a highly successful solo career.It's a retrospective album of solo Freddie Mercury tracks.This is her first solo album.This makes him the biggest-selling solo artist of all time.This was his first solo appearance at a public event.\nSMART Vocabulary: related words and phrases\nAlone\nabandoned\nalienate\nalienated\napart\nbe cast away idiom\nherself\nhimself\nlone wolf\nlonely\nloner\nlonesome\nminority\nshag\nshut\nshut someone away\nsole\nsolely\nsolitarily\nsolitary\nsolitude\nSee more results »\nB2 a musical performance given by one person alone, or a musical performance in which one person is given special attention: a trumpet solo Parker's solo on \"A Night in Tunisia\" was so amazing that the pianist backing him simply stopped playing.\nMore examplesFewer examplesA haunting oboe solo introduces the third movement of the concerto.Each verse was sung as a solo and then everyone joined in on the chorus.We had to sit through a ten-minute drum solo.Next up was a tedious guitar solo.She had to do a solo in the Christmas concert.\nSMART Vocabulary: related words and phrases\nMusical pieces\narrangement\nballade\nbolero\nbossa nova\nBritannia\nchorus\nfantasia\nhook\nmambo\nmedley\nmelody\nmulti-part\nnocturne\noctet\nreel\nserenade\nsextet\nsignature tune\nsong form\nstreetscape\nSee more results »\nAdd to word list\nAdd to word list\nalone; without other people: She takes long, solo bike rides to relax after work. He decided to go solo instead of touring with the band.\na musical performance done by one person or one instrument alone, or in which one person is featured: a piano solo a Miles Davis solo soloist noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈsoʊ·loʊ·ɪst/\nThe cellist is a featured soloist at the recital."}