{"id":337195,"name":"solution","type":"noun","us_sound":"səˈluː.ʃən","us_link":"../audio/s/solution.mp3","uk_sound":"səˈluː.ʃən","uk_link":"../audio/s/uksolip011.mp3","content":"solution noun\n(ANSWER)\nAdd to word list\nAdd to word list\nB1 [ C ] the answer to a problem: solution to There's no easy solution to this problem. She just seems so unhappy and I don't know what the solution is. When you finish doing the crossword, the solution is on the back page. They help you talk through your problems but they don't give you any solutions.\nThesaurus: synonyms, antonyms, and examples\nan answeranswerWe're still waiting for an answer.reply \"How far?\" asked Nigel. \"Not far,\" was the mumbled reply.answer105 is the correct answer.responseThank you for your swift response.reactionWhat was her reaction when she was asked for her resignation?retortAlan snapped back with a witty retort.\nSee more results »\nSMART Vocabulary: related words and phrases\nSolving and solutions\nband-aid solution\nbe at the bottom of something idiom\nbottom\nclear (something) up\nclue\nconquer\nfix\nholding operation\ninsolvable\niron\niron something out\nirresolvable\nit will (all) come out in the wash idiom\nkill\nresolution\nsolvable\nsolve\nsurmountable\ntalk something out\nunsolvable\nSee more results »\nsolution noun\n(MIXTURE)\n[ C or U ]\n&#160; chemistry\n&#160; specialized a mixture in which one substance is dissolved in another, especially a solid dissolved in a liquid : an aqueous solution of saltsin solution The warmer water becomes, the less oxygen it can hold in solution (= dissolved in it).\nSMART Vocabulary: related words and phrases\nPhysics: the state of matter\nabsorbency\nacidic\nallotropic\nallotropy\ncompressible\ncrystalline\ne-liquid\nfluidity\nimpervious\nmelted\npolyunsaturated\npowdered\nrarefy\nreflective\nrustily\nscaly\nself-healing\nsloppily\nsloppiness\nsloppy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMixing and mixtures\nsolution noun\n(ANSWER)\nAdd to word list\nAdd to word list\n[ C ] an answer to a problem: It seemed a reasonable solution to a difficult problem.\nsolution noun\n(LIQUID)\n[ C/U ]\n&#160; chemistry a liquid in which other substances have been mixed and dissolved\nAdd to word list\nAdd to word list\na way to solve a problem or deal with a difficult situation: a solution to/for sth Education is seen as a solution to the state's economic and employment problems. find/have/offer a solution She can not find a solution to the problem. In this case you need a solution pretty desperately. produce/provide a solution They have worked hard to produce a solution which balances the interests of job creation and operational requirements. They will be looking to the industry to work with the Financial Services Authority and Government towards a solution.the best/easy/most effective solution The legislation we have introduced is the best solution to the challenge. The problem is still far from a final solution.a good/acceptable/ideal solution Whether lawmakers can find an acceptable solution is unclear.an immediate/instant/long-term solution As an immediate solution, consumers need access to affordable, unbiased advice. One obvious solution would be to fund existing government health plans to cover all who are eligible. We're pursuing a diplomatic solution to the problem."}