{"id":337338,"name":"somersault","type":"noun","us_sound":"ˈsʌm.ɚ.sɑːlt","us_link":"../audio/s/somersault.mp3","uk_sound":"ˈsʌm.ə.sɔːlt","uk_link":"../audio/s/uksolip030.mp3","content":"Add to word list\nAdd to word list\na rolling movement or jump, either forwards or backwards, in which you turn over completely, with your body above your head, and finish with your head on top again: Do you want to see me do a somersault? She was so happy she turned three somersaults on the lawn. Synonym\nflip Compare\ncartwheel noun\nSunnybeach/E+/GettyImages\nMore examplesFewer examplesHe did his first somersault on a trampoline when he was two.She attempted a backwards somersault.He could do somersaults and cartwheels and he could walk on his hands.\nSMART Vocabulary: related words and phrases\nGymnastics\naerialist\nartistic gymnastics\nasymmetric bars\nbackflip\nfree running\ngym\ngymnast\ngymnastic\npommel horse\nsplit\nspotter\nstand on your hands/head idiom\nstick\nstick the/your landing idiom\nthe parallel bars\ntrampoline\ntrampolining\ntrampolinist\ntuck\ntwist\nSee more results »\n[ I ] to roll or jump, either forwards or backwards, turning over completely, with your body above your head, and finish with your head on top again: Acrobats somersaulted across the stage. He was supposed to crouch on the floor and wait for a large girl named Maureen to somersault over him.\n[ I or T ] to turn over completely, or to make something do this: The bus plunged down the embankment, somersaulted twice, and finally landed on its side. The driver went out of control and somersaulted his car into a knot of onlookers. Synonyms\ncartwheel\nflip (TURN)\noverturn (GO UPSIDE DOWN)\nturn (CHANGE POSITION)\nMore examplesFewer examplesHe would somersault off the elephants' backs into the river.Her horse somersaulted over the fence and fell on her.You need a good kite that somersaults easilyThree women died instantly when the bus somersaulted into a ditch.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nflight\nflit\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nmid-air\nnon-flying\nsoar\nsoaring\nswishy\nswoop\nwaft\nwheel\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGymnastics\nAdd to word list\nAdd to word list\na rolling movement or jump, either forward or backward, in which you turn over completely, with your body above your head, and finish on your feet: She turned somersaults on the lawn. somersault verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈsʌm·ərˌsɔlt/\nThe bus plunged down the hill, somersaulted twice, and landed on its side."}