{"id":337323,"name":"some","type":"determiner","us_sound":"sʌm","us_link":"../audio/s/some.mp3","uk_sound":"sʌm","uk_link":"../audio/s/uksolip024.mp3","content":"some determiner\n(UNKNOWN AMOUNT)\nAdd to word list\nAdd to word list\nA1 an amount or number of something that is not stated or not known; a part of something: There's some cake in the kitchen if you'd like it. Here's some news you might be interested in. We've been having some problems with our TV over the last few weeks. Could you give me some idea of when the construction work will finish? I've got to do some more work before I can go out.\nMore examplesFewer examplesI've just had some chocolate.Add some fresh parsley, finely chopped.I need to get some fresh air to clear my head .Steven gave me some good advice.We had some friends round for dinner on Saturday.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\ncertain\nfaintly\nfairly\nha'porth\nhalfway\nlightly\nlittle\nmildly\npie\npretty\nquite\nrather\nremotely\nseveral\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nsome determiner\n(LARGE AMOUNT)\nB2 uk\nYour browser doesn't support HTML5 audio\n/sʌm/ us\nYour browser doesn't support HTML5 audio\n/sʌm/ a large amount or number of something: It'll be some time before we meet again. It was some years later when they next met. We discussed the problem at some length.\nMore examplesFewer examplesIt'll be some time before we get to eat again.It took some effort to get the thing upstairs.In the end she agreed but she took some persuading.Will you phone me back - it's a matter of some importance.Green's new world record will take some beating.\nSMART Vocabulary: related words and phrases\nLarge in number or quantity\nabove and beyond something idiom\namount\nand then some idiom\nanother\nany amount of idiom\nbag\nin buckets idiom\nin spades idiom\nincalculable\nincomputable\ninnumerable\npoly\nscore\nshower\nso much so idiom\nstrength\nsuper-large\nsupererogation\nsupererogatory\nwhole\nSee more results »\nsome determiner\n(PARTICULAR THING)\nC1 uk\nYour browser doesn't support HTML5 audio\n/sʌm/ us\nYour browser doesn't support HTML5 audio\n/sʌm/ used to refer to a particular person or thing without stating exactly which one: Some lucky person will win more than $1,000,000 in the competition. Some idiot's locked the door! There must be some way you can relieve the pain.\nMore examplesFewer examplesSome fool switched it off.Some girl rang for you but she didn't say her name.Some bright spark thought it would be a good idea to let the animals out.There must be some way you can get it to work.There must be some way you can get the documents back.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\ncertain\nfaintly\nfairly\nha'porth\nhalfway\nlightly\nlittle\nmildly\npie\npretty\nquite\nrather\nremotely\nseveral\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nsome determiner\n(ANGER)\ninformal uk\nYour browser doesn't support HTML5 audio\n/sʌm/ us\nYour browser doesn't support HTML5 audio\n/sʌm/ used before a noun, especially at the beginning of a sentence to show anger or disapproval, often by repeating a word that was not accurately used: Some people just don't know when to shut up. Some help you were! You sat on your backside most of the afternoon! \"A friend of mine sold me a radio that doesn't work.\" \"Some friend!\"\nSMART Vocabulary: related words and phrases\nInconvenience\naggravation\naggro\nawkward\nbore\nbother\nbulky\ndisturbance\ndrag\nfag\nhave fun and games idiom\nimposition\ninconvenience\ninconvenient\ninconveniently\npalaver\npisser\nput something out\nrigamarole\nrigmarole\ntempest\nSee more results »\nsome determiner\n(EXCELLENT)\ninformal uk\nYour browser doesn't support HTML5 audio\n/sʌm/ us\nYour browser doesn't support HTML5 audio\n/sʌm/ used before a noun to show how good something or someone is: Wow, that was some dinner!\nSMART Vocabulary: related words and phrases\nInformal words for good\nA-OK\namazeballs\napple pie\nawesomesauce\nbadass\ndank\njim-dandy\njuicy\nkiller\nknock\nknock spots off something idiom\nlike a boss idiom\nout of sight idiom\nroyally\nrule OK idiom\nsafe\nshabby\nshit hot\nsight\nsteal\nSee more results »\nGrammar\nSomeSome is a determiner and a pronoun. …\nSome as a determinerWe use some before nouns to refer to indefinite quantities. Although the quantity is not important or not defined, using some implies a limited quantity: …\nSome as a pronounWe use some as a pronoun (i.e. without a noun following) when the noun is understood: …\nSome ofWe use some with of before the, demonstratives (this, that), pronouns (you, us) or possessives (my, your). We use some of to refer to a part of a whole: …\nSome: typical errorsWe don’t use weak form some with singular countable nouns: …\nSome and anyWe use some and any in different types of clauses. …\nIdioms\nand then some\nsome ... or other\nA1 an amount or number of something that is not stated or not known; a part of something: If you need more paper then just take some. \"Would you like to have dinner with us?\" \"No thanks, I've already had some.\" Some of you here have already met Imran. Have some of this champagne - it's very good.\nsome people: Some have compared his work to Picasso's.\nMore examplesFewer examplesWe've got a lot of apples if you'd like some.There's a cake here - would you like some?I had some of Jean's bread and it was good.There's plenty of coffee here if you'd like some.Some of you will know Ron already.\nSMART Vocabulary: related words and phrases\nSome and quite\na piece/slice/share of the pie idiom\nbit\ncertain\nfaintly\nfairly\nha'porth\nhalfway\nlightly\nlittle\nmildly\npie\npretty\nquite\nrather\nremotely\nseveral\nto a/some degree idiom\ntouch\ntrifle\nvaguely\nSee more results »\nGrammar\nSomeSome is a determiner and a pronoun. …\nSome as a determinerWe use some before nouns to refer to indefinite quantities. Although the quantity is not important or not defined, using some implies a limited quantity: …\nSome as a pronounWe use some as a pronoun (i.e. without a noun following) when the noun is understood: …\nSome ofWe use some with of before the, demonstratives (this, that), pronouns (you, us) or possessives (my, your). We use some of to refer to a part of a whole: …\nSome: typical errorsWe don’t use weak form some with singular countable nouns: …\nSome and anyWe use some and any in different types of clauses. …\nsome adverb\n(APPROXIMATELY)\nused before a number to mean approximately; about: Some 50 tons of rock are taken from the quarry every day. The water is some 20 to 30 metres beneath the ground.\nSMART Vocabulary: related words and phrases\nApproximate\nabout\napprox.\napproximate\napproximately\naround\nexact\nguess\ninexact\ninexactly\nish\nloosely\nloosey-goosey\nround\nrule\nsense\nsketchy\nsomething\nsomething like 96 percent, half, etc. idiom\nsomewhere\nsort\nSee more results »\nsome adverb\n(SMALL AMOUNT)\nUS informal by a small amount or degree; a little: She says she's feeling some better. We could turn down the heat some if that would make you more comfortable.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nsome adjective [not gradable]\n(UNKNOWN AMOUNT)\nAdd to word list\nAdd to word list\nhaving an amount or number that is not known or not stated, or being a part of something: Let’s get some work done. Some stories he wrote were made into movies.\nsome adjective [not gradable]\n(PERSON OR THING)\nused to refer to a person or thing when you cannot say exactly who or what it is: Some jerk backed into my car in the parking lot. There’s got to be some way out of here. Idiom\nsome thing or other\nsome adverb [not gradable]\n(APPROXIMATELY)\n(used in front of a number) approximately; about: Some 200 people applied for the job.\nsome pronoun\n(UNKNOWN AMOUNT)\nan amount or number that is not known or stated: If you want more spaghetti, please take some. I like some of the people in my class.\nSome can also mean some people: Some have compared him to President Kennedy. Note: In negative sentences, you use \"any\" or \"no\" instead of \"some.\" In questions, you usually use \"any\" instead of \"some.\"\nsome adjective [not gradable]\n(LARGE AMOUNT)\nbeing a large amount or number of something: She was married to him for some years. These things have been going on for some time.\nsome adjective [not gradable]\n(UNUSUAL)\ninfml used before a noun and spoken with emphasis to show that something is unusual: Some party that turned out to be – nobody showed up. Margo is really a terrific cook – that was some dinner!\nsome adverb [not gradable]\n(UNKNOWN AMOUNT)\na little; in or by a small degree: I slept some in the car on the way home."}