{"id":337368,"name":"somewhere","type":"adverb","us_sound":"ˈsʌm.wer","us_link":"../audio/s/somewhere.mp3","uk_sound":"ˈsʌm.weər","uk_link":"../audio/s/uksomet007.mp3","content":"somewhere adverb\n(PLACE)\nAdd to word list\nAdd to word list\nA2 (US also someplace) in or at a place having a position that is not stated or not known: He was last heard of living somewhere on the south coast of France. You must have put their letter somewhere! [ + to infinitive ] I'm looking for somewhere to eat/stay.somewhere else Can we go somewhere else to talk - it's very noisy here.or somewhere Wouldn't you like to go to Disneyland or somewhere (= or to a similar place)? Note: Somewhere is not usually used in negatives and questions.\nMore examplesFewer examplesHave you found somewhere to stay?I keep on thinking I've seen her before somewhere.My top priority is to find somewhere to live.He was here a moment ago but he's wandered off somewhere.They're holidaying somewhere in the Caribbean.\nSMART Vocabulary: related words and phrases\nSomewhere, anywhere, nowhere, or everywhere\nacross\nall over\nanyplace\nanywhere\nat every turn idiom\ncoast\nevery\nfrom top to bottom idiom\nfrom top to toe idiom\nhunt/search high and low idiom\nlength\nnon-universal\nround\nsomeplace\nthe length and breadth of somewhere idiom\nthroughout\nturn\nubiquitous\nubiquitously\nubiquity\nSee more results »\nsomewhere adverb\n(APPROXIMATELY)\nsomewhere around, between, etc.\nB2 approximately; about: Somewhere between 900 and 1,100 minor crimes are reported in this city every week.\nSee more Grammar\nSomeone, somebody, something, somewhereSomeone, somebody, something, somewhere are indefinite pronouns. They function in a similar way to some. We use them in affirmative clauses and in questions expecting a particular answer. We can use them to refer to both general and specific people or things. We use them with a singular verb: …\nIdiom\nbe getting somewhere\nsomewhere adverb [not gradable]\n(PLACE)\nAdd to word list\nAdd to word list\nin, to, or at a place which is not known or not stated: I want to live somewhere else. Can we go somewhere and talk? Note: \"Anywhere\" is usually used instead of \"somewhere\" in negative sentences and questions.\nsomewhere adverb [not gradable]\n(APPROXIMATELY)\n(used esp. before a number) approximately; about: CDs cost somewhere around $15 apiece. Idiom\nsomewhere between"}