{"id":337633,"name":"soon","type":"adverb","us_sound":"suːn","us_link":"../audio/s/soon.mp3","uk_sound":"suːn","uk_link":"../audio/s/uksoon_001.mp3","content":"Add to word list\nAdd to word list\nA2 in or within a short time; before long; quickly: She'll soon be here./She'll be here soon. It will soon be impossible for foreigners to enter the country. The sooner we leave, the sooner we'll get there.soon after Soon after agreeing to go, she realized she'd made a mistake.how soon How soon (= when) can we sign the contract?the sooner the better \"When would you like to meet?\" \"The sooner the better.\" I couldn't get out of that place soon enough. as soon as\nB1 at the same time or a very short time after: As soon as I saw her, I knew there was something wrong.\nSee more as soon as possible\nA2 If you do something as soon as possible, you do it as quickly as you can: We need the repairs done as soon as possible.\nSee more\nMore examplesFewer examplesThe school's winter break starts soon.They were very keen to start work as soon as possible.She'll soon be as tall as her mother.We must meet for lunch soon.Be patient! They'll be here soon.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nyet\nSee more results »\nGrammar\nSoonSoon means ‘a short time after now’ and ‘a short time after a point in the past’. Like many other short adverbs, we can use it in front position, mid position or end position, though we don’t use it in end position when referring to the past: …\nIdioms\nno sooner ... than\nno sooner said than done\nsee you soon\nsooner or later\nwould (just) as soon\nAdd to word list\nAdd to word list\nin or within a short time; before long; quickly: We’ll soon be there. How soon (= When) can we sign the contract? \"When would you like to meet?\" \"The sooner the better.\" Idiom\nsooner or later"}