{"id":337947,"name":"sorry","type":"adjective","us_sound":"ˈsɔːr.i","us_link":"../audio/s/sorry.mp3","uk_sound":"ˈsɒr.i","uk_link":"../audio/s/uksorel010.mp3","content":"sorry adjective\n(SAD)\nAdd to word list\nAdd to word list\nA2 [ after verb ] feeling sadness, sympathy, or disappointment, especially because something unpleasant has happened or been done: sorry about I'm just sorry about all the trouble I've caused her. He'd really upset her and he didn't seem at all sorry. [ + (that) ] I'm sorry (that) you had such a difficult journey. [ + to infinitive ] We were both sorry to hear you've been ill again.feel sorry for I feel so sorry for their kids - it must be really hard for them. Compare\napologetic feel sorry for yourself disapproving\nto feel sad because you have a problem and you feel that it is not fair that you are suffering so much: He sounded very sorry for himself on the phone.\nSee more I'm sorry to say\nused to show that something that must be said causes sadness or disappointment: I'm sorry to say that I'm sorry to say that the project's funding has been cancelled.\nSee more\nMore examplesFewer examplesI feel sorry for the kids, too - they've had a hard time.I was sorry to hear about your trouble on holiday.I feel so sorry for people in that situation.I'm just sorry about messing him around again.I'm sorry you're ill - I hope you get well soon.\nSMART Vocabulary: related words and phrases\nFeeling sad and unhappy\na dog's life idiom\na long face idiom\nabjection\nangsty\nbe cut up idiom\nbe down in the mouth idiom\nbe in a funk idiom\ndistraught\ndistressed\ndog\ndoleful\nlovelorn\nlovesick\nlow-spirited\nlugubrious\nwistful\nwistfully\nwoe\nwoe is me idiom\nwoebegone\nSee more results »\nsorry adjective\n(APOLOGY)\nA1 [ after verb ] used to say that you wish you had not done what you have done, especially when you want to be polite to someone you have done something bad to: Oh, I'm sorry - I didn't see you there.sorry about Tom, I'm so sorry about last night - it was all my fault.say sorry I've said I'm sorry.\nThesaurus: synonyms, antonyms, and examples\nto apologize for somethingapologizeUK I apologise for the error.say sorryHe didn't even say sorry.sorryI forgot your name, sorry.make an apologyThe president made an apology to the people of Japan in a public speech.express regretHe later expressed regret for portraying sharks as creatures that target human beings.\nSee more results »\nMore examplesFewer examplesI'm sorry that I wasn't able to phone you yesterday.I'm sorry I'm late.I'm genuinely sorry for what I said, I really am.I'm sorry, I was only trying to be helpful.I'm so sorry to keep you waiting.\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbeg\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nsorry adjective\n(SAYING NO)\nI'm sorry\nB2 used to show politeness when refusing something or disagreeing: I'm sorry, but I think you've made a mistake.\nSee more\nsorry adjective\n(BAD CONDITION)\nsorry sight, state, tale, etc.\na bad condition or situation: He was a sorry sight when he got home - soaking and covered in mud.\nSee more\nsorry exclamation\n(APOLOGY)\nused when apologizing for something: \"That's my foot you're stepping on.\" \"Sorry!\"\nThesaurus: synonyms, antonyms, and examples\nto apologize for somethingapologizeUK I apologise for the error.say sorryHe didn't even say sorry.sorryI forgot your name, sorry.make an apologyThe president made an apology to the people of Japan in a public speech.express regretHe later expressed regret for portraying sharks as creatures that target human beings.\nSee more results »\nMore examplesFewer examplesSorry - I didn't catch what you said.Sorry, could you say that again?Sorry, this area is closed to the public.Sorry, I can't let you in without identification.Sorry, can I see your pass?\nSMART Vocabulary: related words and phrases\nMaking & accepting apologies\namends\napologetically\napologize\natone for something\natonement\nbeg\nbury\nbygone\nconciliatory\ncrawl\ncrawl back (to someone) idiom\nforge ahead\nforgive\npenance\nrepentance\nshred\nsink your differences idiom\nsolatium\nsorry to bother you\nsoz\nSee more results »\nsorry exclamation\n(POLITE NEGATIVE)\nused to show politeness when refusing something or disagreeing: Sorry, you can't go in there.\nused when politely asking someone to repeat something or when politely interrupting someone: \"He's late.\" \"Sorry?\" \"I said he's late.\" Sorry, could you just say that last sentence again please?\nSMART Vocabulary: related words and phrases\nPolite expressions\nactually\nallow\nbe so good as to phrase\nby all means idiom\nchance\ncordially\ncould\nmagic word\nmay I ask idiom\nmight\nmight I ask/inquire/know idiom\nno problem idiom\nobliged\npardon (me) idiom\nproblem\nsay\nwelcome\nwonder\nwould\nyou're welcome idiom\nSee more results »\nIdiom\nsorry not sorry\nsorry adjective\n(ASKING FORGIVENESS)\nAdd to word list\nAdd to word list\nfeeling bad because you have caused trouble or difficulty to someone else: [ + (that) clause ] I’m really sorry (that) I forgot about our appointment yesterday.\nSorry is also used as a polite way to show your sympathy to someone because of a loss, problem, or trouble the person has had: [ + to infinitive ] We were sorry to learn about the death of your grandmother.\nSorry is also used as a polite way of asking someone to excuse you for having done something that might have annoyed the person: The train will be moving shortly – we are sorry for the inconvenience.\nsorry adjective\n(POLITE REFUSAL)\nused as a polite way of expressing refusal or disagreement: I’m sorry, but I think you’ve made a mistake in our check. Sorry, you can’t go in there.\nsorry adjective\n(BAD CONDITION)\n[ -er/-est only ] dated so bad as to cause feelings of sympathy: They were a sorry sight, dressed in rags and so weak they could hardly stand up. Note: describing a situation or condition"}