{"id":337994,"name":"sorting","type":"verb","us_sound":"sɔːrt","us_link":"../audio/s/sort.mp3","uk_sound":"sɔːt","uk_link":"../audio/s/uksorel011.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsort\nsort verb\n(ORDER)\nB2 [ I or T ] to put a number of things in an order or to separate them into groups: Paper, plastic, and cans are sorted for recycling. I'm going to sort these old books into those to be kept and those to be thrown away. You can use the computer to sort the newspaper articles alphabetically, by date, or by subject. She found the ring while sorting (through) some clothes.\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesEggs are sorted into different sizes by a machine.We no longer use manual sorting of letters.The eggs are sorted into different sizes.They sorted the rotten apples from the good ones.The students were sorted according to ability.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nsort verb\n(DEAL WITH)\n[ T ] UK informal to deal with something by repairing or organizing it: Can you sort the car by tomorrow? We must get the phone sorted soon. I must get this paperwork sorted before I go on holiday next week.\nMore examplesFewer examplesIn all seriousness now - joking aside - I do think there's a problem here that we've got to get sorted.I need to get tomorrow's food sorted.At least that's Sam's birthday present sorted.The plumber came and got the leak sorted.I need to get my bike sorted.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle\nfiddle (around) with something\nfine-tune\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDealing with things or people\nPhrasal verbs\nsort something out\nsort something/someone out\nsort someone out"}