{"id":337970,"name":"sort","type":"noun","us_sound":"sɔːrt","us_link":"../audio/s/sort.mp3","uk_sound":"sɔːt","uk_link":"../audio/s/uksorel011.mp3","content":"sort noun\n(TYPE)\nAdd to word list\nAdd to word list\nA2 [ C ] a group of things that are of the same type or that share similar qualities: sort of We both like the same sort of music.of some sort I'm going to have a salad of some sort. What sort of shoes will I need?all sorts of We saw all sorts (= many types) of animals in the park.sorts of Many sorts of bacteria are resistant to penicillin. This sort of camera is very expensive. Plants of this sort need shady conditions.\nThesaurus: synonyms, antonyms, and examples\na group of people or things that share similar qualitiessortWhat sort of clothes do you like to wear?kindWhat kind of job are you looking for?typeHe's the type of man who never listens to what you're saying.formSwimming is the best form of exercise.varietyThe article was about the different varieties of Spanish spoken in South America.categoryThere are three categories of hotel room - standard, executive, and deluxe.\nSee more results »\nyour sort\nthe type of thing or person that you like: your sort of Hmm, this is my sort of wine!\nSee more (and) that sort of thing B1 informal\nused to show that what you have just said is only an example from a much larger group of things: They sell souvenirs, postcards, that sort of thing.\nSee more\nMore examplesFewer examplesHe struck me as an affable sort of a man.There was some sort of property deal that didn't come off.He hates physical contact of any sort - he doesn't even like to shake your hand.What sort of music do you like dancing to?His condition was diagnosed as some sort of blood disorder.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nform\ngenre\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nstratification\nsubcategory\nsubclassification\nsubstance\nupdate\nSee more results »\nsort noun\n(PERSON)\n[ C usually singular ] UK old-fashioned a person having the stated or suggested character: He seemed like a decent sort to me.\nSMART Vocabulary: related words and phrases\nPeople in general\nbeggar\nbird\nbod\nbody\ncoot\ncreature\ndevil\nfellow man/men\nloiterer\nlubber\nman\nmankind\nnumber\nparty\npeeps\nperson\nperson of interest\nrogue\nsod\nstiff\nSee more results »\nGrammar\nSort, type and kindSort, type and kind all generally mean the same thing. They are words we use to refer to a group of people or things which share the same characteristics. We use these words very often when we describe things and we often find them in dictionary definitions: …\nKind of and sort ofKind of and sort of are very common expressions in speaking. They soften other words and phrases so that they do not appear too direct or exact. Kind of is more common in American English. Sort of is more common in British English: …\nIdioms\nbe out of sorts\nit takes all sorts (to make a world)\nof sorts\n(a) sort of\nsort of\nsort verb\n(ORDER)\nB2 [ I or T ] to put a number of things in an order or to separate them into groups: Paper, plastic, and cans are sorted for recycling.sort something into something I'm going to sort these old books into those to be kept and those to be thrown away.sort something by something You can use the computer to sort the newspaper articles alphabetically, by date, or by subject.sort (through) She found the ring while sorting (through) some clothes.\nThesaurus: synonyms, antonyms, and examples\nto arrange papers, furniture, etc.arrangeThe books are arranged in alphabetical order.orderThe names are ordered alphabetically.sortTen million pieces of mail are sorted every day. organizeHe liked to organize his herbs and spices alphabetically in the cabinet.lay outHe laid the playing cards out in a precise circle.set outShe was setting out the usual platter of cheese sandwiches.\nSee more results »\nMore examplesFewer examplesEggs are sorted into different sizes by a machine.We no longer use manual sorting of letters.The eggs are sorted into different sizes.They sorted the rotten apples from the good ones.The students were sorted according to ability.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort something out\ntick\nSee more results »\nsort verb\n(DEAL WITH)\n[ T ] UK informal to deal with something by repairing or organizing it: Can you sort the car by tomorrow?get something sorted We must get the phone sorted soon. I must get this paperwork sorted before I go on holiday next week.\nMore examplesFewer examplesIn all seriousness now - joking aside - I do think there's a problem here that we've got to get sorted.I need to get tomorrow's food sorted.At least that's Sam's birthday present sorted.The plumber came and got the leak sorted.I need to get my bike sorted.\nSMART Vocabulary: related words and phrases\nCorrecting and mending\ncalibration\nclean (someone/something) up\ncorrection\nfiddle (around) with something\nfine-tune\nmess\nrecondition\nreconstruct\nreconstruction\nrectifiable\nrectification\nremedy\nrevise\nscratch\nservicing\nset/put the record straight idiom\nsmooth something away\nsmoothen\nsort something out\ntinker\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDealing with things or people\nPhrasal verbs\nsort something out\nsort something/someone out\nsort someone out\nsort noun [C]\n(TYPE)\nAdd to word list\nAdd to word list\na group of things that are of the same type or that share similar qualities: What sort of equipment will she need? He was squinting through the eyepiece of some sort of navigational device.\nSort can sometimes refer to a person of a particular type: What sort of person do you think I am? a sort of (also sort of)\nA person might say a sort of or sort of when describing something about which the person does not have a clear or exact knowledge: He’s a sort of agent for athletes, but not officially. She’s sort of running the company, I think, but her parents are still involved. Idiom\nsort of\nsort verb [I/T]\n(PUT IN ORDER)\nto put things in a particular order or separate them into groups according to a principle: [ T ] We have to sort the job applications into groups based on their qualifications. [ T ] Paper, plastic, and cans are sorted for recycling. [ M ] Sort out the clothes that you don’t want, and we’ll donate them to a charity. [ I always + adv/prep ] He spent hours sorting through the photos (= searching them to find one). Phrasal verb\nsort out something\nAdd to word list\nAdd to word list\nto put a number of things in an order or to separate them into groups: Documents are sorted and indexed.sort sth by sth Customer records can be sorted by name or by postcode. Phrasal verb\nsort sth out\na computer instruction that organizes things into a particular order: He's written a sort program for the database."}