{"id":338140,"name":"sound","type":"noun","us_sound":"saʊnd","us_link":"../audio/s/sound.mp3","uk_sound":"saʊnd","uk_link":"../audio/s/uksorel026.mp3","content":"sound noun\n(NOISE)\nAdd to word list\nAdd to word list\nA2 [ C or U ] something that you can hear or that can be heard: hear a sound They could hear the sound of a bell tolling in the distance.make a sound She stood completely still, not making a sound. Suddenly we heard a loud knocking sound from the engine.sound travels Sound can travel over very large distances in water.\n[ U ] the activity of recording and broadcasting sound such as from a performance of music or for a film: a sound engineer/recording\n[ U ] the volume or quality of the sound of a television or film: turn the sound down/up Could you turn the sound down/up on the TV?\n[ C ] the particular quality of the music that a musician or a group of musicians produce: The band's sound is a distinctive mixture of funk and rap.\nMore examplesFewer examplesPavlov conditioned dogs to salivate at the sound of a bell.The strange sound made his blood curdle.The sound of the door closing deceived me into thinking they had gone out.The sound of his footsteps gradually died away.She could hear the distant sound of fireworks exploding.\nSMART Vocabulary: related words and phrases\nSound & its properties\nacoustic\nacoustically\nanechoic\naurally\ncrosstalk\ndiapason\necho\nhigh definition\nmonaural\nmonaurally\nmono\nquadraphonic\nreverberate\nreverberative\nringing\nsilken\nsonic\nsoundproof\nthunder\nunlistenable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecording sounds and images\nPlaying music\nsound noun\n(SEEM)\nthe sound of something C2 [ S ]\nhow something seems to be, from what is said or written: I like the sound of the beef in red wine sauce.\nSee more\nsound noun\n(WATER PASSAGE)\n[ C ] a passage of sea connecting two larger areas of sea, or an area of sea mostly surrounded by land: the Kalmar Sound\nSMART Vocabulary: related words and phrases\nBays & gulfs\narm\nbasin\nbay\nchannel\ncove\ngulf\nHudson Bay\ninlet\nlagoon\nnarrows\nsea coast\nstrait\nthe Bay of Bengal\nthe Bay of Fundy\nthe Gulf of Mexico\nthe Persian Gulf\nGrammar\nSound or noise?Sound and noise are nouns. We can use them both as countable or uncountable nouns. Both refer to something which you can hear, but when a sound is unwanted or unpleasant, we call it a noise: …\nsound verb\n(SEEM)\nsound good, interesting, strange, etc.\nA2 to seem good, interesting, strange, etc. from what is said or written: Your job sounds really interesting.\nSee more sound like/as if/as though\nB1 to seem like something, from what is said or written: That sounds like a good idea.\nSee more sound angry, happy, rude, etc.\nB2 to seem angry, happy, rude, etc. when you speak: He sounded very depressed when we spoke on the phone yesterday.\nSee more\nsound verb\n(NOISE)\n[ I or T ] to make a noise: If the alarm sounds, leave the building immediately.sound like It sounds like a bird. He sounds (= speaks) just like someone I used to work with. Sounding the car's horn, she drove at high speed through the crowded streets. sound the alarm\nto cause a noise to be made or say or shout a message to warn people about something: Quick, sound the alarm - there's a fire in the machine room!\nSee more\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nspit\nsplat\nsputter\nsqueak\nswoosh\ntinkly\ntintinnabulation\nunsounded\nwhirr\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSounds made by humans with their mouths\nsound verb\n(WATER DEPTH)\n[ T ] to measure the depth of a mass of water, such as the sea, usually by sonar See also\necho sounder\nSMART Vocabulary: related words and phrases\nNavigation & shipwrecks\nastrolabe\ncelestial navigation\nchart\ncircumnavigate\ncircumnavigation\ndead reckoning\nfoghorn\nlane\nlightship\nlodestar\nnarrows\nnavigability\npassage\npilot\nquadrant\nsea lane\nsextant\nsubmersible\nthe Pole Star\nyaw\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasuring & weighing\nPhrasal verbs\nsound off\nsound someone out\nsound adjective\n(GOOD CONDITION)\nnot broken or damaged; healthy; in good condition: It's an old building but it's still structurally sound. Considering his age, his body is surprisingly sound.of sound mind Was she of sound mind (= not mentally ill) at the time of the incident?\nfinancially strong and likely to succeed: Although the company's share price has declined, its business remains basically sound.sound investment Government bonds are a sound investment.\nSMART Vocabulary: related words and phrases\nUndamaged, unbroken or in good condition\n(all) in one piece idiom\nain't\nanti-wear\nbe (as) good as new idiom\nbe as sound as a bell idiom\nbe none the worse idiom\nrepair\nresistive\nsafe\nsoundness\nunbroken\nuninjured\nunpolluted\nunscarred\nunscathed\nunspoiled\nwalk\nwalk away\nwell preserved\nworse\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: fit & healthy\nBusiness - general words\nStock markets\nsound adjective\n(GOOD, CORRECT)\nshowing or based on good judgment: sound advice She gave me some very sound advice. She is a sound judge of character. I'm not sure how sound the theoretical basis for this argument is.\nable to be trusted because of having a lot of ability or knowledge: sound on The book is very sound on the basics. How sound is her knowledge of the subject?\nnot harmful or wrong: Are these pesticides environmentally sound? I want our business to operate in an ethically sound way.\nUK informal used to say that you like, agree with, or approve of someone or something: He's a good guy. He's sound. \"Shall we go there now?\" \"Yeah, sound.\"\nSMART Vocabulary: related words and phrases\nWise and sensible\nbe a victory for common sense idiom\ncannily\ncanny\nclear-headed\nclear-headedly\njudicious\njudiciously\nlevel-headed\nlong-sightedness\nmethod\nreasoned\nresponsibility\nresponsible\nresponsibly\nright-minded\nto be wise after the event idiom\nvictory\nwell advised\nwily\nwisdom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperts and specialists\nComplete and whole\nGood, better and best\nInformal words for good\nsound adjective\n(SLEEP)\n(of sleep) deep: He quickly fell into a sound sleep. Her sleep was so sound that she did not wake when they moved her.\nused to describe someone who sleeps deeply and well: I'm normally a very sound sleeper but this noise kept me awake.\nSMART Vocabulary: related words and phrases\nAnimal physiology: sleep & sleeping\nbeauty\nbed\nbunk\nbunk down\nbye-byes\ncatch/cop/get some z's idiom\ncount\ncrash\ndelayed sleep phase pattern\ndoss\ndrift off\npower nap\nsleep\nsnooze\nsnoozing\nsomnambulate\nsomnambulist\nsomnolence\nsoporifically\nyour beauty sleep idiom\nSee more results »\nsound adjective\n(SEVERE)\n(of a beating or defeat) severe: The party was forced to reflect after a sound beating at the ballot box. The thief was given a sound thrashing.\nSMART Vocabulary: related words and phrases\nSevere\nan iron hand/fist in a velvet glove idiom\naustere\nausterely\nauthoritarian\nbe heavy on someone idiom\nbrutally\nflaming\nflinty\nharsh\nharshness\nnonsense\nnot stand any nonsense idiom\npitiless\nseverely\nseverity\nsharply\nsharpness\nstern\nsternly\nsternness\nSee more results »\nIdiom\nbe as sound as a bell\ndeeply: sound asleep He was sound asleep within moments of getting into bed.\nSMART Vocabulary: related words and phrases\nAnimal physiology: sleep & sleeping\nbeauty\nbed\nbunk\nbunk down\nbye-byes\ncatch/cop/get some z's idiom\ncount\ncrash\ndelayed sleep phase pattern\ndoss\ndrift off\npower nap\nsleep\nsnooze\nsnoozing\nsomnambulate\nsomnambulist\nsomnolence\nsoporifically\nyour beauty sleep idiom\nSee more results »\nsound noun\n(SOMETHING HEARD)\nAdd to word list\nAdd to word list\n[ C/U ] something heard or that may be heard: [ C ] They could hear the sound of an airplane overhead.\nsound noun\n(WATER PASSAGE)\n[ C ] a passage of sea connecting two larger areas of sea, or an area of sea mostly surrounded by land: Puget Sound Long Island Sound\nsound verb\n(SEEM)\nto suggest a particular feeling, state, or thing by the way something is said or a noise is made: [ L ] He sounded rather discouraged when I called him yesterday. [ I always + adv/prep ] You sound as if you have a sore throat. [ I always + adv/prep ] From what you told me, she sounds like (= seems to be) a nice person. [ I always + adv/prep ] That sounds like fun (= seems likely to be enjoyable).\nsound verb\n(MAKE NOISE)\n[ I/T ] to make a noise: [ I ] A bell sounds after fifty minutes to signal the end of the class period. [ T ] Sound the alarm – a prisoner has escaped! Phrasal verbs\nsound off\nsound out someone\nsound adjective [-er/-est only]\n(HEALTHY)\nin good condition; (of a person) healthy, or (of a thing) not broken or damaged: a person of sound mind Engineers had to close the bridge because it was not sound.\nSound also describes sleep that is deep and peaceful: She was sound asleep when the phone rang.\nsound adjective [-er/-est only]\n(GOOD)\ngood because based on good judgment or correct methods: It was a sound approach to investing money.\nAdd to word list\nAdd to word list\nshowing good judgment, or able to be trusted: A sound money-management strategy that has the added benefit of freeing up cash for new investments. The booklet gives sound advice on how to choose a with-profits bond.\nin good condition: The bridge is structurally sound.\ncomplete or detailed: A sound knowledge of law is essential."}