{"id":338208,"name":"source","type":"noun","us_sound":"sɔːrs","us_link":"../audio/s/eus74322.mp3","uk_sound":"sɔːs","uk_link":"../audio/s/uksatan030.mp3","content":"Add to word list\nAdd to word list\nB2 the place something comes from or starts at, or the cause of something: a source of heat/energy/light a heat/energy/light sourcesource of Oranges are a good source of vitamin C. Experts are trying to track down the source of the contamination in the water supply. We walked up the river to its source in the hills. Money is often a source of tension and disagreements in young married couples.\nC1 someone or something that supplies information: The journalist refused to reveal her sources (= say who had given the information to her). According to government sources (= people in the government) many MPs are worried about this issue. According to congressional sources (= people who work in Congress) many Representatives are worried about this issue. Always acknowledge your sources (= say which books you have used) at the end of a paper. at source (also US at the source)\nat the place where something comes from: Tax is deducted from my income at source.\nSee more\nMore examplesFewer examplesThe opera house is a great source of civic pride.His main source of work had dried up, leaving him short of money.Some alluvial deposits are a rich source of diamonds.Engineers are endeavouring to locate the source of the problem.He's established himself as a dependable source of information.\nSMART Vocabulary: related words and phrases\nOrigins and sources\nat source phrase\nbases\nbe a recipe for disaster, trouble, success, etc. idiom\nbeginning\nbirth\nbirthplace\ncradle\nemanate\nemanate from/through something/someone\nfount\nfountainhead\ngateway drug\nhail\norigin\noriginate\npaternity\nprovenance\nrecipe\nroot\nseed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who reveal secrets & tell tales\nto get something from a particular place: Where possible the produce used in our restaurant is sourced locally.\nSMART Vocabulary: related words and phrases\nFinding and discovering\nascertain\nbreak (fresh/new) ground idiom\nbreakthrough\nbring something to light idiom\ncatch someone red-handed idiom\nflush someone/something out\nfossick\nfound\ngeocache\ngeocaching\npinpoint\nrake\nred-handed\nrediscover\nrediscovery\nrefind\nrefound\nrumble\nsniff\nuncover\nSee more results »\nAdd to word list\nAdd to word list\nsomething or someone that causes or produces something, or is the origin of it: a source of energy/light Spinach is a good source of vitamins. His wife was a constant source of inspiration to him.\nA source is also someone or something from which you obtain information: The reporter refused to cite the names of her sources.\nto get something from a particular place: Where possible the produce used in our restaurant is sourced locally.\nAdd to word list\nAdd to word list\nthe place or thing that something comes from or starts at, or the cause of something: source of sth Customer complaints are a very important source of information.source of income/revenue For many poor families, pensions are now the main source of income. The project still may work if money can be found from other sources to supplement tolls. The source of the problem is unrealistic expectations about what training can accomplish.\n[ often plural ] someone or something that supplies information: Industry sources said discussions were taking place. A source close to the firm said a total of eight employees would be let go.\nat source\nTAX if your income is taxed at source, income tax is taken from your salary and sent directly to the tax authorities: Tax is deducted from my income at source.\nto get something, especially products or materials, from a particular place: source sth from sth The supermarket decided it wanted to source all its milk from one company. More and more of its merchandise will have to be sourced overseas. Financial information can now be sourced from an endless stream of online services."}