{"id":338274,"name":"south","type":"noun","us_sound":"saʊθ","us_link":"../audio/s/south.mp3","uk_sound":"saʊθ","uk_link":"../audio/s/uksound018.mp3","content":"Add to word list\nAdd to word list\nA2 the direction that goes towards the part of the earth below the equator, opposite to the north, or the part of an area or country that is in this direction: The points of the compass are north, south, east, and west. The best beaches are in the south (of the island). We spent our holiday in the south of France. Canberra is/lies to the south of Sydney. the South\nthe southern states of the US: The American Civil War was fought between the North and the South partly over the issue of slavery.\nthe developing countries of the world, most of which are below the equator See also\nthe Third World old-fashioned\nMore examplesFewer examplesA forest fire raging in the south of France is defying all attempts to control it.They reported a sudden outbreak of the disease in the south of the country.The south of the country enjoys an equable climate.They live in the extreme south of the island.The Nationalist Party have gained a lot of support in the south of the country.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nTowns & regions: named regions of countries\nCountries, nationalities & continents: continents & regions of the world\nGrammar\nEast or eastern; north or northern? …\nA2 in or forming the south part of something: South Africa the South China Sea These plants grow well on a south-facing wall. south wind\na wind coming from the south\nMore examplesFewer examplesThere are at least 20 distinguishable dialects of the language just on the south island.Despite being heavily outgunned, the rebel forces seem to have held on to the south side of the city.He was last heard of living somewhere on the south coast.We spent the entire holiday lying on the sun-drenched beaches at the south end of the island.Thousands of day trippers flock to resorts on the south coast.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWind & winds\nGrammar\nEast or eastern; north or northern? …\nA2 towards the south: The Mississippi river flows south. They drove south towards the coast. He travelled due (= directly) south, towards the desert. down south\nto or in the south of a country or region: Alice got a job down south. south of the border\n(in or to) England, when considered in relation to Scotland\n(in or to) Mexico and the other countries south of the US border with Mexico, when considered in relation to the US\nMore examplesFewer examplesMigrating birds make use of airstreams to assist them on their long journey south.We'll drive east for a few more miles, then turn south.The terrace faces south.As you go further south, you will notice a gradual change of climate.We're going to stop off in Paris for a couple of days before heading south.\nSMART Vocabulary: related words and phrases\nPoints of the compass\ncardinal point\ncompass reading\ncompass rose\nE, e\neasterly\neastern\neasternmost\ngeomagnetic pole\nmagnetic north\nmagnetic pole\nnortheastern\nnortheastward\nnortherly\nnorthern\nnorthernmost\nsouthern\nsouthwestern\nSW\nwestern\nwesternmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: named regions of countries\nCountries, nationalities & continents: country & nation\nCountries, nationalities & continents: continents & regions of the world\nGrammar\nEast or eastern; north or northern? …\nIdiom\ngo south\nAdd to word list\nAdd to word list\nthe direction opposite north, or the part of an area or country in this direction: The points of the compass are north, south, east, and west.\nIn the US, the South is the southeastern part of the country: We moved to the South when I was a child.\nUS history In the US Civil War, the South was the group of states that fought to become separate from the federal government. southerly adjective us\nYour browser doesn't support HTML5 audio\n/ˈsʌð·ər·li/\na southerly direction southern adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈsʌð·ərn/ (abbreviation S.); (abbreviation So.)\nLouisiana is in the southern part of the US.\nin, forming, or toward the south part of something: The University is on the south side of town. We drove south. Idiom\nsouth of the border"}