{"id":338436,"name":"space","type":"noun","us_sound":"speɪs","us_link":"../audio/s/space.mp3","uk_sound":"speɪs","uk_link":"../audio/s/uksouth022.mp3","content":"space noun\n(EMPTY PLACE)\nAdd to word list\nAdd to word list\nA2 [ C or U ] an empty area that is available to be used: space for Is there any space for my clothes in that cupboard?make space I need to make (some) space for Mark's things.space between When the roads are wet, you've got to leave plenty of space between you and the car in front. The blank space at the end of the form is for your name.parking space We found a parking space close to the museum. Synonyms\ncavity\nchamber (SPACE) specialized\ngap (HOLE)\nhole (SPACE)\nhollow\npocket (GROUP/AREA)\nroom (SPACE)See also\nairspace\nB2 [ U ] the area around everything that exists, continuing in all directions: stare/gaze into space He was absent-mindedly staring/gazing into space (= looking, but seeing nothing). Virtual reality gives us artificial worlds to explore, outside normal space and time.\n[ U ] the distance between a football, rugby, etc. player and any opposing players: If you give quality players that much space, they will punish you.create space The winger drifted right, creating space for Neymar to run into. open space\nland, especially in a town, that has no buildings on it: What I like about this town is that there's so much open space.\nan area in a sports field where there are no opponents: He found himself in open space as he sprinted down the left wing.\nSee more in/within a short space of time\nvery soon: Within a short space of time you could be speaking perfect English!\nSee more in/within the space of six weeks, three hours, etc.\nduring a period of six weeks, three hours, etc.: It all happened in the space of ten minutes.\nSee more\nMore examplesFewer examplesIs there plenty of cupboard space in your new house?The museum is planning to increase the amount of space allotted to modern art.A great number of trees were felled to provide space for grazing.My car's too big to fit in this space.There's barely enough floor space to fit a bed in this room.\nSMART Vocabulary: related words and phrases\nSpace - general words\nbay\nbox\nchamber\nelbow room\nexpanse\nfloor\nfootprint\nheadroom\nnon-spatial\nroom\nspacial\nspacing\nspacious\nspatialize\nspatially\nstanding room\nsubzone\nvoid\nway\nzone\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting in sport\nspace noun\n(BEYOND EARTH)\nB1 [ U ] the empty area outside Earth's atmosphere, where the planets and the stars are: space exploration/travel a space rocketin/into space Who was the first human being in space/the first to go into space?\nMore examplesFewer examplesThe film was about creatures from outer space.The music represents the immensities of space.Once in space, the spacecraft will go into orbit around Earth.They filmed a rocket propelled through space.This is a joint program bankrolled by the U.S. space agency.\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ncosmic\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunconformity\nweightlessness\nzero gravity\nSee more results »\nto arrange things or people so that there is some distance or time between them: That page looks badly spaced (= there is too much/too little distance between the lines or words).be spaced (out) The flowers were spaced (out) evenly (= planted at equal distances) beside the path.space something (out) over something If you're in financial difficulty, we're happy to let you space (out) your payments (= pay in smaller amounts over a longer period of time) over two years.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nspace noun\n(EMPTY PLACE)\nAdd to word list\nAdd to word list\n[ C/U ] an empty place: [ C ] a parking/storage space [ U ] He was staring into space, seeing nothing.\n[ C/U ] Open space is land that has nothing built on it: [ C ] Out west there are lots of wide open spaces.\n[ C/U ]\n&#160; art In a painting, space is the appearance of depth even though the painting only has width and height.\nspace noun\n(BEYOND EARTH)\n[ U ] the area beyond the atmosphere (= air) of the earth: space travel The rocket blasted off to outer space.\nspace noun\n(TIME)\n[ U ] an amount of time: Within the space of three weeks, I felt much better.\nspace verb [T]\n(ARRANGE DISTANCE)\nto arrange the distance between things: Try to space the stitches evenly as you sew.\nspace verb [T]\n(ARRANGE TIME)\nto arrange the time between things: The moves are spaced about eight to ten seconds apart.\nAdd to word list\nAdd to word list\nan empty area that is available to be used: There is greater demand for downtown office space.\nMARKETING a section of a newspaper, magazine, or website that is sold to companies who want to advertise: The company buys advertising space for international clients.\nPROPERTY\n&#160; (also open space) land, especially in a town, that has no buildings on it: Development was planned for the open space outside town.\nSee also\nadvertising space\nincubator space\noffice space\nprint space\nshelf space"}