{"id":338449,"name":"spacer","type":"noun","us_sound":"ˈspeɪ.sɚ","us_link":"../audio/s/cdo1119usspac1108.mp3","uk_sound":"ˈspeɪ.sər","uk_link":"../audio/s/cdo1119ukspac1032.mp3","content":"spacer noun [C]\n(FOR KEEPING THINGS APART)\nAdd to word list\nAdd to word list\na device used to keep two things apart: Press a square spacer into the joint between the blocks. A toe spacer is a small cushion placed between the first and second toes that helps keep bones straight so that the bunion won't get worse.\nMore examplesFewer examplesDiscs are flexible spacers between the bony vertebrae of the spine.They were playing a game with the plastic spacers used in pizza delivery boxes.The mechanic who removed the clips reported that no spacers had been installed.\nSMART Vocabulary: related words and phrases\nTools in general\naid\nambidextrous\nblade\nblaster\ncontrivance\ncutter\ndevice\nfan\ngadget\ngrabber\nhardware\nmachine tool\npower tool\nprecision instrument\nratchet\nspreader\nstuffer\ntoolkit\nutensil\nutility belt\nSee more results »\nspacer noun [C]\n(MEDICAL)\nmedical\n&#160; specialized a large empty tube that attaches to an inhaler (= a small device for breathing in medicines) and helps the medicine go straight to your lungs : Breathe in and out from the spacer for four breaths in a row. For some, an asthma spacer can be used in conjunction with their prescribed inhaler.\ndavidf/E+/GettyImages\nMore examplesFewer examplesPress the inhaler so that the medication sprays into the spacer.Equipment used to treat childhood asthma includes inhaler spacers, nebulizers and peak flow meters.Medication is sprayed into the spacer and the child breathes it into his or her lungs in five or six breaths.\nSMART Vocabulary: related words and phrases\nMedical dressings, supports & devices\nanti-shock\nauditory brainstem implant\nbind\nbinder\nbiomaterial\nbiventricular pacemaker\nbrace\ncotton wool\nElastoplast\nexoskeleton\nin a cast phrase\nin plaster phrase\ninduction loop\nkinesiology tape\nliposome\nmedicine ball\npoultice\nsling\nwheelchair\nZimmer frame\nSee more results »"}