{"id":338728,"name":"spark","type":"noun","us_sound":"spɑːrk","us_link":"../audio/s/spark.mp3","uk_sound":"spɑːk","uk_link":"../audio/s/ukspaci026.mp3","content":"spark noun\n(FIRE/ELECTRICITY)\nAdd to word list\nAdd to word list\nC2 [ C ] a very small piece of fire that flies out from something that is burning, or one that is made by rubbing two hard things together, or a flash of light made by electricity: Sparks were flying out of the bonfire and blowing everywhere. You can start a fire by rubbing two dry pieces of wood together until you produce a spark.\nguruXOOX/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nFire & flame\nbeacon\nblaze\nbonfire\nbrand\nbushfire\ncampfire\nconflagration\ndumpster fire\nfire\nfireball\nfirebrand\nfirepit\nfirestorm\nflame\ninferno\nopen fire\nopen fireplace\nwildfire\nSee more results »\nspark noun\n(CAUSE)\nC2 [ S ] a first small event or problem that causes a much worse situation to develop: That small incident was the spark that set off the street riots.\n[ S ] a feeling or quality that causes excitement: They kept running into each other and eventually realized there was a spark between them. The music is mediocre because there's no spark, no thrill, no unpredictability.\nMore examplesFewer examplesHis speech was the spark for major riots.Her letter was the spark that drove him to commit murder.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspell\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWords meaning small pieces and amounts\nspark noun\n(ELECTRICIAN)\nUK informal (also sparks) an electrician (= a person whose job is to put in and repair electrical wires and equipment): You need a brickie and a sparks.\nIdiom\nsparks fly\nC2 to cause the start of something, especially an argument or fighting: This proposal will almost certainly spark another countrywide debate about immigration. The recent interest-rate rises have sparked new problems for small businesses. The visit of the G20 leaders sparked off (= caused the start of) mass demonstrations.\nThesaurus: synonyms, antonyms, and examples\nto make something happencauseFirefighters determined that a campfire spark caused the wildfire.bring aboutMany illnesses are brought about by poor diet and lack of exercise.result inThe fire resulted in damage to their house.lead toReducing speed limits has led to fewer deaths on the motorways.makeThe heat is making me tired.arouseIt's a subject that has aroused a lot of interest.\nSee more results »\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstarting\nthe ground floor\nwheel\nSee more results »\nAdd to word list\nAdd to word list\na very small bit of something burning that flies out from a fire, or a flash of light seen when an electric current crosses an open space: Flame, smoke, and sparks climbed into the dark sky. Sparks from the old wiring started the fire. fig.No one can light the spark that will make you a writer (= the thing that causes you to write).\nA spark of something is a small amount of it: When students show a spark of interest, I try to give them extra encouragement. Idiom\nsparks fly\nto start a fire: Downed power lines sparked fires in several parts of town. fig.Parks’s actions in 1955 sparked the Civil Rights Movement. We try to find stories that will spark our students’ imaginations."}