{"id":338922,"name":"spatter","type":"verb","us_sound":"ˈspæt̬.ɚ","us_link":"../audio/s/spatter.mp3","uk_sound":"ˈspæt.ər","uk_link":"../audio/s/uksparr014.mp3","content":"Add to word list\nAdd to word list\nto drop small drops of liquid, etc. on a surface, or (of liquid) to fall, especially noisily, in small drops: Two bikes raced by and spattered mud over our clothes. The bikes spattered them with mud. They could hear raindrops spattering on the roof of the car.\nMore examplesFewer examplesReduce the flame to low otherwise the oil will spatter all over the kitchen.The spray went wide, spattering her face and hands.The blood seemed more like paint spattered from an artist's brush.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpreading and scattering\nthe act of a liquid falling on a surface in small drops, especially noisily; the drops themselves: I grew to love the spatter of rain on the roof. The pavement was covered with a fine spatter of paint.\nMore examplesFewer examplesA spatter of water came off the stone steps.Police noticed blood spatters on the home's floor.All mechanical systems pose risks of dropping small components, or at least a spatter of grease.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\npuddle\nrain gauge\nrainstorm\nseed\nshower\ntorrentially\nwash\nwash (something) out\nwet\nSee more results »\nAdd to word list\nAdd to word list\nto scatter small drops or bits of liquid on a surface, or of liquid to fall in small drops: [ T ] The taxi hit a puddle and spattered us with mud. spatter noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈspæt̬·ər/\nYou left paint spatters on the floor!"}