{"id":338877,"name":"spatchcock","type":"noun","us_sound":"ˈspætʃ.kɑːk","us_link":"../audio/s/cdo0318usspat4658.mp3","uk_sound":"ˈspætʃ.kɒk","uk_link":"../audio/s/cdo0318ukspat1323.mp3","content":"Add to word list\nAdd to word list\na chicken or other type of bird that has been cut open down the middle, pressed flat, and cooked; this method of cooking a chicken, etc.: Massage the mixture into the skin of the spatchcocks and allow them to marinate for 1 hour minimum. We went straight to the main course and ordered spatchcock and beef tenderloin.\nJannHuizenga/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesWhen we grill chicken, I prefer the thighs and drumsticks or even the whole chicken as in my Spicy Spatchcock Chicken. Spatchcocks are available from game butchers and specialty poultry suppliers.Her recipe for buttered spatchcock has chickens covered with a thick layer of butter.\nSMART Vocabulary: related words and phrases\nPreparing animals & fish for cooking\nbone\nboneless\nbutchery\nceviche\nchine\nclean\ndebeard\ndevein\nfleishig\nFrenching\ngut\nhang\njoint\npaillard\npluck\nskin\nskinless\ntenderize\ntruss\nuntrimmed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCuts of meat\nto prepare a chicken or other type of bird for cooking by cutting it open down the middle, and then pressing it flat: First, spatchcock the chicken (see our step-by-step video here).\nMore examplesFewer examplesThe contestants had to attempt to spatchcock a poussin and then make a lemon curd.Spatchcocked quail was a little fiddly to eat, particularly as a dish to share. The recipe requires 4 poussin (ask your butcher to spatchcock them for you).Once all the birds are spatchcocked, smear with marinade and leave overnight in the fridge.\nSMART Vocabulary: related words and phrases\nPreparing animals & fish for cooking\nbone\nboneless\nbutchery\nceviche\nchine\nclean\ndebeard\ndevein\nfleishig\nFrenching\ngut\nhang\njoint\npaillard\npluck\nskin\nskinless\ntenderize\ntruss\nuntrimmed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCuts of meat"}