{"id":338978,"name":"speak","type":"verb","us_sound":"spiːk","us_link":"../audio/s/speak.mp3","uk_sound":"spiːk","uk_link":"../audio/s/uksparr019.mp3","content":"speak verb\n(SAY WORDS)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to say words, to use the voice, or to have a conversation with someone: Would you mind speaking more slowly, please?speak to mainly UK \"Can I speak to Dan please?\"speak with mainly US \"Can I speak with Scott please?\" \"Speaking.\" (= This is Scott.) If he tells Julie what I said, I'll never speak to him again.speak of formal She spoke of her sadness over her father's death.speak highly of She speaks very highly of (= says good things about) the new director.speak for I can certainly come but I can't speak for my wife (= I can't tell you whether she can or not).formal Who is going to speak for (= represent in a court of law) the accused?speak for yourself He's old enough to speak for himself (= to say what he thinks). I went with Ava - speaking of (= on the subject of) Ava, have you seen her new haircut?speaking of which We've been invited to Rachel and Jamie's wedding - speaking of which, did you know that they're moving to New York?speak as Speaking as (= with my experience as) a mother of four, I can tell you that children are exhausting.speak with an accent Sue speaks with an American accent.speak in a whisper Why are you speaking in a whisper (= very quietly)?speak a word For five whole minutes, neither of them spoke a word (= they both said nothing).\nThesaurus: synonyms, antonyms, and examples\nto talk to someonetalkA group of men were talking in the street.speakCould I speak to you privately?sayI couldn't hear what they were saying.chatWe were just chatting about the party.have a chatWe had a little chat over the garden wall.chatterThey spent the morning chattering away.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto talk about somethingtalk aboutI don't like talking about my feelings.speak aboutHe is often asked to speak about the decline of global energy supplies.discussWe need to discuss arrangements for next week.talk overI need to talk it over with my wife before I accept the job.talk throughWe're used to talking things through, so we don't have many arguments.debateThe bill will be debated in parliament next week.\nSee more results »\nbroadly, historically, strictly, etc. speaking\nB2 talking from a particular point of view: Historically speaking, the island is of great interest.\nSee more speak to someone\nto tell someone that they have done something wrong: The manager promised that she would speak to the person responsible.\nSee more\nMore examplesFewer examplesChoking back my anger, I tried to speak calmly.She cleared her throat nervously before she began to speak.Can I speak to you confidentially?\"Can I speak to Isobel, please?\" \"She's still in bed. I'll just go and see if she's conscious yet.\"It is considered bad manners in some cultures to speak with your mouth full of food.\nSMART Vocabulary: related words and phrases\nSaying & uttering\n(your) every word idiom\nadd\ncome out with something\nevery\nfall from something\nfind your voice idiom\nget in\nin your own words idiom\nintone\nloud\nobserve\nphrase\nquoth\nsay\nspoken\nstring\ntalk sense idiom\nthink\nverbalize\nvolunteer\nSee more results »\nspeak verb\n(LANGUAGE)\nA1 [ T ] to (be able to) talk in a language: He speaks fluent French. How many foreign languages do you speak?speak a word of I couldn't speak a word of (= I did not know any) Spanish when I got there. I couldn't figure out what language they were speaking.\nMore examplesFewer examplesUnable to speak a word of the language, he communicated with his hands.They speak a language akin to French.Do you speak English?I'd like to speak English fluently.Do you speak Swedish ?\nSMART Vocabulary: related words and phrases\nUsing other languages\nAnglocentric\nAnglocentrism\nbilingual education\nbilingualism\nbilinguality\ninterpret\nmistranslate\nmistranslation\nmonolingual\nmother tongue\nmultilingually\nnatively\nnon-native\nrender\nrendering\ntarget language\ntranslator\ntransliterate\ntrilingual\nword for word idiom\nSee more results »\nspeak verb\n(FORMAL TALK)\nB2 [ I ] to give a formal talk to a group of people: Who is speaking in the debate tonight?speak to The Queen speaks to the nation on television every Christmas.speak for/against Janet is speaking for the motion (= trying to persuade the people listening that the idea is good) and Peter is speaking against (it) (= trying to persuade them that it is bad).\nMore examplesFewer examplesThe audience clapped and cheered when she stood up to speak.I've deputed Lara Brown to speak for me at the conference.They invited her to speak especially because of her experience in inner cities.There was loud jeering from the opposition parties when the prime minister stood up to speak.He didn't want to be involved in the organization of the conference, although he was willing to attend and speak.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nslide\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nspeak verb\n(SUGGEST)\n[ I + adv/prep, T ] literary to show or express something without using words: She was silent, but her eyes spoke her real feelings for him.speak of The whole robbery spoke of (= made it seem that there had been) inside knowledge on the part of the criminals.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensive\nostensively\noutlet\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nreflect\nreveal\nunwrap\nvent\nvirtue signalling\nvisualization\nSee more results »\nGrammar\nSpeak or talk?The verbs speak and talk both generally mean ‘say words’, but there are some small differences in how they are used. Speak is more formal than talk. …\nSpeak and talk: usesThe verbs speak and talk both generally mean ‘say words’, but there are some small differences in how they are used. Speak is more formal than talk. …\nSpeak and talk with prepositionsWe usually use to after speak and talk. In more formal situations, people sometimes use with: …\nIdioms\nbe on speaking terms\nnone to speak of\nnot be on speaking terms\nso to speak\nspeak your mind\nspeak for yourself\nspeak too soon\nspeak to someone\nspeak volumes\nspeak when you're spoken to!\nMore idioms\nspeaks for itself\nPhrasal verbs\nspeak out/up\nspeak to something\nspeak up\nspeak up for someone/something\nused to form nouns to mean the special language used in a particular subject area or business: computer-speak marketing-speak\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njargonistic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\npatois\npidgin\nplain English\nPolari\npsychobabble\nrhyming slang\nshibboleth\nslang\nSee more results »\nspeak verb\n(SAY WORDS)\nAdd to word list\nAdd to word list\n[ I/T ] to say words, to use the voice, or to have a conversation with someone: [ I ] I heard someone speaking in the hallway. [ I ] Please speak louder. [ I ] \"I’ll never speak to you again,\" he said angrily. [ T ] No one spoke a word (= No one said anything). [ I ] She spoke in a whisper (= very quietly).\n[ I/T ] Speaking is used with adverbs ending in -ly to show that you are talking from a particular point of view: [ I ] Generally speaking, this is what happens when you see a nutritionist.\nspeak verb\n(KNOW A LANGUAGE)\n[ T ] to talk in a language: How many languages do you speak? He speaks fluent Italian. When I arrived in Canada, I didn’t speak a word of English (= I did not know any English).\nspeak verb\n(FORMAL TALK)\n[ I ] to give a formal talk: Will you be speaking at the conference? Ted will speak about careers in education.\nspeak verb\n(SUGGEST)\n[ I/T ] to show or express something without using words: [ I always + adv/prep ] The incident spoke of shady financial dealings between the partners. [ T ] Her face spoke volumes (= showed clearly what she thought). Idioms\nspeak for yourself\non speaking terms\nspeaking as someone\nspeaking of someone/something\nsomething speaks for itself\nspeak too soon\nno something to speak ofPhrasal verbs\nspeak for someone\nspeak out\nspeak up\nspeak up\nspeak up for someone/something\nAdd to word list\nAdd to word list\nthe special language used in a particular subject area or business: business-speak management-speak"}