{"id":339034,"name":"spec","type":"noun","us_sound":"spek","us_link":"../audio/s/spec.mp3","uk_sound":"spek","uk_link":"../audio/s/uksparr026.mp3","content":"Add to word list\nAdd to word list\n[ C ] informal for\nspecification (= a detailed description of how something should be or has been done, made, etc.): The article compares the specs of ten of the best-selling cars.\nSMART Vocabulary: related words and phrases\nElaborating, specifying and simplifying\nabstract\nanti-reductionism\nanti-reductionist\nbroad brush\nbroaden\nenlarge\nenlarge on/upon something\nexpand\nexpand on something\nexpansively\nover-elaboration\novergeneralization\novergeneralize\noversimplification\noversimplify\nsimplify\nspecification\nspecificity\nspecify\nsplit hairs idiom\nSee more results »\non spec\ntaking a chance, without being sure that you will get what you want: We just turned up at the airport on spec, hoping that we'd be able to get tickets.\nSee more\nto plan, do, or make something according to a particular specification (= a detailed description of how something should be done or made): I have seen players spec their characters into real killing machines. You can also spec your TwinTop with a 197bhp engine.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nused to describe a house, etc. that is designed and built by a person or company to be sold to anyone who will buy it, rather than for a particular customer: spec home Building high-priced spec homes is a gamble that can pay off but also can prove disastrous when the market tightens.spec house His company has one spec house for sale in Scottsdale for nearly $3.8 million.\nMore examplesFewer examples\"Builders just kept putting up one spec house after another,\" she says.He said developers are building spec homes for short-term profits, not realizing the long-term effects.He built the two houses on the lake as \"spec homes,\" or on speculation that he could sell them.There are not less than five spec buildings going up in the area.\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nflip\nfound\nglazier\njoiner\nreface\nrefurb\nrefurbish\nrefurbished\nrefurbishment\ntiler\nwell built\nworkman\nwright\nSee more results »\nAdd to word list\nAdd to word list\nshort form ofspecification: We’re drawing up the specs for your new bathroom this week.\nAdd to word list\nAdd to word list\ninformal abbreviation for\nspecification : Always look at the car's spec before you sign a contract.high/basic spec The PC with the most basic spec is the cheapest. How much does it cost to continue retooling a mold when a customer keeps changing design specs?\non spec\ntaking a chance, without being sure that you will get what you want: The builders built homes on spec - prior to finding a buyer."}