{"id":339266,"name":"speculative","type":"adjective","us_sound":"ˈspek.jə.lə.t̬ɪv","us_link":"../audio/s/eus74334.mp3","uk_sound":"ˈspek.jə.lə.tɪv","uk_link":"../audio/s/ukspect005.mp3","content":"speculative adjective\n(GUESS)\nAdd to word list\nAdd to word list\nbased on a guess and not on information: The article was dismissed as highly speculative. bizarre and speculative theories\nMore examplesFewer examplesHis theory is too speculative for most of his colleagues to accept at this point. This type of polling is less scientific and more speculative.The numbers are high, but they're purely speculative.There is another speculative but intriguing explanation.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculation\nspeculatively\nsuspicion\nSee more results »\nspeculative adjective\n(TRADE)\nbought or done in order to make a profit in the future: The office block was built as a speculative venture. Some of these buyers are speculative investors.\nMore examplesFewer examplesThis is an aggressive, speculative market. Most oil trades are speculative and do not result in physical delivery of oil. After two decades of sustained economic growth and speculative residential building, places that were once farms and woodland have been transformed.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nspeculative adjective\n(JOB)\ndone or sent in the hope of getting a job with a company although no job has been advertised: If you know where you'd really like to work, don't be afraid of making a speculative application. Send a speculative CV to Human Resources.\nMore examplesFewer examplesMany employers encourage speculative applications through their websites.The survey found that 78% of French employers recruit from speculative applications, compared with just 64% who advertise in the press.You should be sending out speculative letters, networking, and searching the web as well as checking job ads.Her big break was a speculative letter to the editor of the magazine.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nRelated word\nspeculatively\nspeculative adjective\n(DONE FOR PROFIT)\nAdd to word list\nAdd to word list\nbought or done in order to make a profit in the future: a speculative venture\nspeculative adjective\n(BASED ON GUESS)\nbased on a guess and not on information: Our forecast for next year is speculative.\nAdd to word list\nAdd to word list\nbased on a guess and not on information: The idea that a merger of this kind would ever take place is purely speculative. highly/overly speculative\nFINANCE done in order to make a profit even though there is risk that you may lose money: We should remember that a sign of the end of the first bubble was a large number of highly speculative transactions. Company shares advanced 6p to 34p on speculative buying. News of the sale led to considerable speculative activity on the exchange.\nFINANCE a speculative investor is willing to accept a high level of risk in the hope of making a profit: This stock should only be considered by the speculative investor."}