{"id":339045,"name":"specialist","type":"noun","us_sound":"ˈspeʃ.əl.ɪst","us_link":"../audio/s/specialist.mp3","uk_sound":"ˈspeʃ.əl.ɪst","uk_link":"../audio/s/uksparr029.mp3","content":"Add to word list\nAdd to word list\nB2 someone who has a lot of experience, knowledge, or skill in a particular subject: a software specialist She's a specialist in modern French literature.\n(UK also consultant) a doctor who has special training in and knowledge of a particular area of medicine: She's a specialist in childhood illnesses. I've asked to be referred to a specialist about my back pain. a leading cancer/eye specialist\nMore examplesFewer examplesHer doctor was at fault for not sending her straight to a specialist.My doctor has referred me to a specialist for a second opinion on the results of my blood test.She's a specialist in Ancient Greece.You'll need a specialist to do that woodwork.\nSMART Vocabulary: related words and phrases\nExperts and specialists\nacademician\nartist\nauthority\nboffin\nchild prodigy\ndoyenne\nhotshot\nknow something inside out idiom\nlapidary\nLatin Americanist\nliterati\npunditocracy\npyrotechnician\nRenaissance man\nsavant\nsemiotician\nwhizz-kid\nwizard\nwonder\nwunderkind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: doctors & health workers generally\nhaving or involving detailed knowledge of a subject: We direct people to specialist advice on problems with debt, mortgages, or utility bills. Our health team can arrange specialist help when you need it.\ndealing with one particular subject, product, or area of activity more than with others: The causes and treatment of cancer are her specialist subject. A specialist store often has a very intimate relationship with its customers. If your usual insurer won't give you a quote, there are plenty of specialist insurers you can try who are prepared to handle higher risks. Synonym\nspecialized\nMore examplesFewer examplesWe offer specialist advice on a wide range of stress-related problems.We would never encourage small investors to put their money into very specialist trusts: the risks are too high.Clean the tent with one of the specialist products that are available.A supermarket may stock about 250 titles as opposed to up to 25,000 in a specialist bookshop.This is obviously a very specialist area of investment and you will need expert advice.\nSMART Vocabulary: related words and phrases\nExperts and specialists\nacademician\nartist\nauthority\nboffin\nchild prodigy\ndoyenne\nhotshot\nknow something inside out idiom\nlapidary\nLatin Americanist\nliterati\npunditocracy\npyrotechnician\nRenaissance man\nsavant\nsemiotician\nwhizz-kid\nwizard\nwonder\nwunderkind\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSkilled, talented and able\nUnique and unusual\nAdd to word list\nAdd to word list\nsomeone who limits his or her studying or work to a particular area of knowledge, and who is an expert in that area: She’s a specialist in financial management.\nA specialist is also a doctor who works in and knows a lot about one particular area of medicine: an eye/heart/joint specialist\nAdd to word list\nAdd to word list\nsomeone who has a lot of experience, knowledge, or skill in a particular subject or business area: specialist in sth She is a specialist in financial services and insurance.\nFINANCE, STOCK MARKET someone who works on a US stock market and buys and sells shares in particular types of companies: Specialists on regional exchanges sometimes have lower dealing costs than those in New York.\nhaving a lot of experience, knowledge, or skill in a particular subject or business area: The bank can give you specialist advice. It is always good to consult a specialist financial adviser. Five specialist firms are under investigation for allegedly interfering in the buying and selling of shares by investors."}