{"id":339057,"name":"specially","type":"adverb","us_sound":"ˈspeʃ.əl.i","us_link":"../audio/s/specially.mp3","uk_sound":"ˈspeʃ.əl.i","uk_link":"../audio/s/ukspeci004.mp3","content":"specially adverb\n(VERY)\nAdd to word list\nAdd to word list\nextremely or in particular: This is a specially good wine. \"Is there anything you want to do this evening?\" \"Not specially.\" The children really liked the museum, specially the dinosaurs.\nMore examplesFewer examplesI'm not specially keen on cheese.I wasn't specially interested in his book.She seemed specially keen to talk to him.The meeting was specially well attended tonight.Are you specially interested in watching this programme?\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParticular and individual\nspecially adverb\n(FOR ONE PURPOSE)\nB1 for a particular purpose: I came here specially to see you. She has a wheelchair that was specially made for her. The opera \"Aida\" was specially written for the opening of the Cairo opera house in 1871.\nMore examplesFewer examplesThe generously proportioned singer has to have all his garments specially made.I'll lend you a bag for your trip - it'll save you buying one specially.A series of sorties was carried out at night by specially equipped aircraft.The dogs are specially trained to follow the trail left by the fox.The aircraft base is protected with specially designed shelters which are built to withstand ground and air attacks.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividual\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nrespectively\nseparately\nSee more results »\nGrammar\nEspecially or specially?Especially and specially are adverbs. …\nAdd to word list\nAdd to word list\nin a particular way or for a particular purpose: Her wheelchair was specially designed for her."}