{"id":339267,"name":"speculatively","type":"adverb","us_sound":"ˈspek.jə.lə.t̬ɪv.li","us_link":"../audio/s/usspamm023.mp3","uk_sound":"ˈspek.jə.lə.tɪv.li","uk_link":"../audio/s/ukspect006.mp3","content":"speculatively adverb\n(GUESS)\nAdd to word list\nAdd to word list\nin a way that shows you are guessing what will happen or what someone is thinking: We noticed them looking at each other speculatively. I glanced speculatively towards the window, where more bad weather had blown in from the North Sea.\nMore examplesFewer examplesSome things are said speculatively about me and have nothing to do with the facts. The professor speculatively suggests that leptin works directly on each individual cell. He looks speculatively at the pill.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculation\nsupposition\nsuspicion\nSee more results »\nspeculatively adverb\n(BUSINESS)\nin the hope of making a profit in the future: Some homes are built speculatively without a committed buyer. The recordings were put out speculatively and sold really well.\nMore examplesFewer examplesI often buy shares speculatively.They buy speculatively, not to purchase a home of their own. Purpose-built stadia generally followed from club success rather than being built speculatively in the hope of profit.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrogue trader\nstockbroker\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nspeculatively adverb\n(APPLYING FOR JOB)\nin the hope of getting a job with a company although no job has been advertised: It is worth applying speculatively to the companies that you are really keen to work for but that aren't advertising at the moment. How do I approach a company speculatively?\nMore examplesFewer examplesApplying speculatively means sending a CV and/or covering letter to an employer asking whether they can offer jobs or work experience.Graduates need to get over the idea that there's a stigma to applying speculatively.Having speculatively applied for the manager's post at Milton Keynes Dons, he received a call from the club's chairman.\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nprospect\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nSee\nspeculative"}