{"id":339037,"name":"special","type":"adjective","us_sound":"ˈspeʃ.əl","us_link":"../audio/s/special.mp3","uk_sound":"ˈspeʃ.əl","uk_link":"../audio/s/uksparr027.mp3","content":"special adjective\n(NOT USUAL)\nAdd to word list\nAdd to word list\nA2 not ordinary or usual: The car has a number of special safety features. Is there anything special that you'd like to do today? Passengers should tell the airline in advance if they have any special dietary needs. I don't expect special treatment - I just want to be treated fairly. Full details of the election results will be published in a special edition of tomorrow's newspaper. I have a suit for special occasions. There's a special offer on peaches (UK also peaches are on special offer) (= they are being sold at a reduced price) this week.\nA2 especially great or important, or having a quality that most similar things or people do not have: Could I ask you a special favour? I'm cooking something special for her birthday.\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nMore examplesFewer examplesThe informative asides about rural life make this wine guide rather special.I would like to say a big thankyou to everyone who's helped to make our wedding such a special occasion!The hotel has a special discount rate for newlyweds.I have a suit but I only wear it on special occasions.Her voice is OK, but it's nothing special.\nSMART Vocabulary: related words and phrases\nUnique and unusual\naccidental\nalt-\nalternative\natypically\nbe marked out as something idiom\nguerrilla\nincongruous\ninimitable\ninimitably\nirreplaceable\npersonalized\nquaintly\nquaintness\nquirkily\nquirkiness\nuniquely\nunmatchable\nunmatched\nunparalleled\nunrivalled\nSee more results »\nspecial adjective\n(PARTICULAR)\nB1 [ before noun ] having a particular purpose: Firefighters use special breathing equipment in smoky buildings. Some of the children have special educational needs. You need special tyres on your car for snow. She works as a special adviser to the president.\nMore examplesFewer examplesThey use special chemicals to accelerate the growth of crops.These automatic cameras have a special focusing mechanism.This food processor has a special attachment for grinding coffee.Sailors have special equipment to help them navigate.They probed in the mud with a special drill.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\na television programme that is made for a particular reason or occasion and is not part of a series: a three-hour election night special\na dish that is available in a restaurant on a particular day that is not usually available: Today's specials are written on the board.\nmainly US a product that is being sold at a reduced price for a short period: Today's specials include T-shirts for only $2.99.\n(also Special) in the UK, a person who is not a paid member of the police force but who wears a police uniform and is trained to act as a police officer in certain situations: Police officers are stressing the need for many more specials. Two Specials attended the scene. Synonym\nspecial constable\nSMART Vocabulary: related words and phrases\nBroadcasting: programmes & other broadcasts\naction replay\nbinge-watch\nblooper\nbreakfast television\nbreaking news\ncommentary\nfiller\nfly on the wall idiom\ngame show\nGod slot\ngreen screen\nprocedural\nreality show\nreality TV\nrerun\nrom com\nsketch\nsoap\nsyndicate\nvox pop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRestaurants & cafes\nSavoury dishes\nProducts & producers\nPrice decreases\nPeople who work for the police service\nspecial adjective\n(NOT USUAL)\nAdd to word list\nAdd to word list\nnot ordinary or usual: a special occasion special attention/treatment The car has a number of special safety features. Is there anything special you’d like to do today? The magazine published a special anniversary issue.\nSpecial can also mean unusually great or important: You’re very special to me.\nspecial adjective\n(PARTICULAR)\n[ not gradable ] having a particular purpose: Kevin goes to a special school for the blind. She’s a special correspondent for National Public Radio.\nspecial noun [C]\n(THING NOT USUALLY AVAILABLE)\nsomething that is not usually available: There’s a two-hour special (= a television program that is not regularly shown) on the Olympics tonight. Our restaurant’s specials today are pasta primavera, baked chicken with rice, and shrimp scampi (= these foods are not always sold).\nA special is also the sale of goods at a reduced price: The store had a special on lawn furniture this week.\nAdd to word list\nAdd to word list\nnot ordinary or usual: Hongkong has a special relationship with the world's financial markets.\nhaving a particular purpose: special representative/adviser/committee\na product that is being sold at a reduced price for a short period: a special on sth This week we have a special on children's toys."}