{"id":339263,"name":"speculation","type":"noun","us_sound":"ˌspek.jəˈleɪ.ʃən","us_link":"../audio/s/speculation.mp3","uk_sound":"ˌspek.jəˈleɪ.ʃən","uk_link":"../audio/s/ukspect004.mp3","content":"speculation noun [C or U]\n(GUESS)\nAdd to word list\nAdd to word list\nC1 the activity of guessing possible answers to a question without having enough information to be certain: Rumours that they are about to marry have been dismissed as pure speculation. Speculation about his future plans is rife. [ + that ] News of the president's illness fuelled/prompted speculation that an election will be held later in the year.\nMore examplesFewer examplesHe had tried to damp down speculation about the state of his marriage.Her resignation ends months of speculation about her future.The statement excited new speculation that a senior minister may be about to resign.The prime minister's speech fuelled speculation that she is about to resign.The minister dismissed the newspaper reports as pure speculation.\nSMART Vocabulary: related words and phrases\nGuesses and assumptions\na shot in the dark idiom\napproximation\nassumption\nbet\nconjecturally\nconjecture\ncounterfactual\nestimate\nmisestimate\nmisestimation\noverestimate\noverestimation\npreception\nproposition\npurportedly\nre-estimate\nsneaking\nspeculative\nspeculatively\nsuspicion\nSee more results »\nspeculation noun [C or U]\n(TRADING)\nthe act of speculating in order to make a profit\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProfits & losses\nAdd to word list\nAdd to word list\nthe act of guessing possible answers to a question without having enough information to be certain: Rumours that the CEO is retiring have been dismissed as pure speculation.speculation about sth The news led to speculation about possible further departures among the senior executive team.speculation (that) There is speculation that fourth quarter GDP growth could be revised downwards. The dollar rose amid speculation that central banks could buy the currency in collaboration.fuel/prompt speculation The chairman's speech fuelled speculation that a merger will happen later in the year.on speculation The stock shot up recently on speculation that a financing package was imminent.\nFINANCE the act of buying something hoping that its value will increase and then selling at this higher price in order to make a profit: speculation on/in sth Evidence that the economy is accelerating could fuel further speculation in commodity markets. The share issue coincided with a huge rise in amateur stock market speculation."}