{"id":339083,"name":"specification","type":"noun","us_sound":"ˌspes.ə.fəˈkeɪ.ʃən","us_link":"../audio/s/specification.mp3","uk_sound":"ˌspes.ɪ.fɪˈkeɪ.ʃən","uk_link":"../audio/s/ukspeci010.mp3","content":"Add to word list\nAdd to word list\nC1 a detailed description of how something should be done, made, etc.: All products are made exactly to the customer's specifications. A specification has been drawn up for the new military aircraft. a job specification The cars have been built to a high specification (= a high standard).\nSMART Vocabulary: related words and phrases\nElaborating, specifying and simplifying\nabstract\nanti-reductionism\nanti-reductionist\nbroad brush\nbroaden\nenlarge\nenlarge on/upon something\nexpand\nexpand on something\nexpansively\nover-elaboration\novergeneralization\novergeneralize\noversimplification\noversimplify\nsimplify\nspec\nspecificity\nspecify\nsplit hairs idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlans and arrangements\nAdd to word list\nAdd to word list\na clear, detailed plan or description of how something will be made: Specifications have been drawn up for the new aircraft. The house was built to the architect’s specifications.\nAdd to word list\nAdd to word list\n[ C, usually plural ] (also informal spec) a detailed description of how something should be done, made, etc.: meet/conform to specifications The health accounts would have to be used in conjunction with insurance policies that meet specifications set by law.specifications for sth We have set rigid specifications for customer service. product/performance/design specifications We all need to be working from the same set of specifications. Those specs cover everything from default settings for screen resolutions to more standard ways to work with modems.\nto specification(s) (also informal to spec(s))\nif a product is made to specification, it is made exactly as the person who designed it said it should be made: If the project is completed on time to specification the contractor will realize a reasonable profit.make/build sth to (sb's) specification(s) All products are made exactly to the customer's specifications.\n[ U ] the act of giving detailed information about how something should be done: Management made no clear specification of the size of the sales territory that each salesperson was to cover."}