{"id":339251,"name":"spectrum","type":"noun","us_sound":"ˈspek.trəm","us_link":"../audio/s/spectrum.mp3","uk_sound":"ˈspek.trəm","uk_link":"../audio/s/ukspect001.mp3","content":"spectrum noun [C]\n(COLOURS)\nAdd to word list\nAdd to word list\nC2 the set of colours into which a beam of light can be separated, or a range of waves, such as light waves or radio waves: The colours of the spectrum - red, orange, yellow, green, blue, indigo, and violet - can be seen in a rainbow.\nsitox/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe survey revealed a wide spectrum of opinion.He is some way along the autistic spectrum.He was held in great affection by people from the entire political spectrum.\nSMART Vocabulary: related words and phrases\nColour - general words\nchalkiness\nchalky\nchromatic\ncolour gamut\ncolour wheel\ncolouration\ncoloured\ndiscolour\ndye\npalette\npigmentation\npigmented\nprimary colour\nrecolour\nsecondary colour\nslaty\nspectral\nstain\ntinge\nundertone\nSee more results »\nspectrum noun [C]\n(RANGE)\nC1 a range of different positions, opinions, etc. between two extreme points: He has support from across the whole political spectrum. The group includes students from both ends of the social spectrum (= range of social classes). A wide spectrum of opinion was represented at the meeting. My disease is nowhere near as bad as hers but they are on the same spectrum. the autism spectrum\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspread\nstretch\nstring\nSee more results »\nIdiom\non the spectrum\nspectrum noun [C]\n(RANGE)\nAdd to word list\nAdd to word list\na range of objects, ideas, or opinions: There’s agreement across the political spectrum. A wide spectrum of opinion was represented at the meeting.\nspectrum noun [C]\n(COLORS)\nphysics\n&#160; plural spectra us/ˈspek·trə/ spectrums the set of colors into which a beam of light can be separated\nphysics\n&#160; plural spectra us/ˈspek·trə/ spectrums Spectrum also means a range of waves such as light waves or radio waves.\nAdd to word list\nAdd to word list\na range of similar things: a spectrum of sth A methodology will have to be developed to gradually cover the entire spectrum of technologies. a wide/broad spectrumthe economic/business/political spectrum He has support from across the whole political spectrum."}