{"id":339102,"name":"specimen","type":"noun","us_sound":"ˈspes.ə.mɪn","us_link":"../audio/s/specimen.mp3","uk_sound":"ˈspes.ə.mɪn","uk_link":"../audio/s/ukspeci015.mp3","content":"Add to word list\nAdd to word list\nC2 something shown or examined as an example; a typical example: He has a collection of rare insect specimens. Museums will pay large amounts of money for good dinosaur fossil specimens. Astronauts brought back specimens of moon rock.\na small amount of blood or urine used for testing: They took blood and urine specimens for analysis.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nsample\nshowpiece\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical examination\nused to refer to something that is an example of a particular thing : The signature on the letter must be compared with the specimen signature held by the company. Specimen papers of the new examinations were released to schools.\nused to refer to a container for things collected for medical or scientific use: Various bits of bone were laid out in specimen jars. The urine is collected in a specimen cup.\nused to refer to a plant or tree that is grown as a main point of interest in a garden: A specimen tree on the lawn beside the Manor House is 130 years old. This lilac thrives in full sun and can be used as a background plant for smaller plants, or as a specimen plant. Any type of rose can be used as a specimen shrub.\nMore examplesFewer examplesMore than 3 million people have downloaded specimen bank charge letters from campaigning websites.Code numbers, not names, are put on the specimen bottles to ensure anonymity.A specimen plant, dragon's eye pine should be the centerpiece of a landscape design.Many of the specimen trees which are still in the park were almost certainly planted by Webb.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nsample\nshowpiece\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical & surgical equipment\nBushes & shrubs\nAdd to word list\nAdd to word list\nsomething shown or examined as an example; a typical example: He has a collection of rare insect specimens.\nmedical A specimen is a small amount of something, such as urine or blood, taken for testing.\nAdd to word list\nAdd to word list\nsomething that is used or can be examined as a typical example: You'll find specimens of most of the kind of letters you will need to write at every stage of the job application process. The urine specimens were used for drug testing. specimen adjective [ before noun ]\nSpecimen ballots are printed below."}