{"id":339075,"name":"specific","type":"adjective","us_sound":"spəˈsɪf.ɪk","us_link":"../audio/s/specific.mp3","uk_sound":"spəˈsɪf.ɪk","uk_link":"../audio/s/ukspeci008.mp3","content":"specific adjective\n(PARTICULAR)\nAdd to word list\nAdd to word list\nB2 relating to one thing and not others; particular: The virus attacks specific cells in the brain. The money is intended to be used for specific purposes.formal The disease seems to be specific to (= only found in) certain types of plant. Is there anything specific you want from the shops?\nMore examplesFewer examplesThe regional editions of the paper contain specific information for that area.We're looking for a very specific sort of person and this woman seems to fulfil all of our criteria.Some of the children have specific learning difficulties.They nailed him down to a specific time and place.Several subcommittees will be set up to deal with specific environmental issues.\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividual\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nrespectively\nseparately\nSee more results »\nspecific adjective\n(EXACT)\nC1 clear and exact: No specific allegations have yet been made about the prison officers' behaviour. Can you be more specific about where your back hurts?\nThesaurus: synonyms, antonyms, and examples\ncomplete and true in every detailexactWhat is your exact location?preciseIt was a mathematically precise model of how the wind would affect the structure.accurateWe need accurate measurements before we can begin the building project.superaccurateScientists use a superaccurate atomic clock to measure time.specificPlease make your questions as specific as possibile.\nSee more results »\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntightness\ntruly\nSee more results »\nspecific adjective\n(PARTICULAR)\nAdd to word list\nAdd to word list\nrelating to one thing and not others; particular: The virus attacks specific cells in the body. The meeting is for the specific purpose of discussing the merger.\nspecific adjective\n(EXACT)\nclear and exact: The report makes specific recommendations. Can you be more specific?\nAdd to word list\nAdd to word list\nrelating to one particular thing and not others: A specific provision in the agreement stated that research materials should not be used for commercial purposes.\nclear and exact: He wouldn't give a specific estimate of how much the company would make."}