{"id":339052,"name":"specialize","type":"verb","us_sound":"ˈspeʃ.ə.laɪz","us_link":"../audio/s/specialize.mp3","uk_sound":"ˈspeʃ.əl.aɪz","uk_link":"../audio/s/ukspeci002.mp3","content":"specialize verb [I]\n(SPECIAL SKILL, PRODUCT, ETC.)\nAdd to word list\nAdd to word list\nB2 to study or work on a particular subject or skill more than any others, so that you become an expert in it: She hired a lawyer who specializes in divorce cases. I enjoy working in general medicine, but I hope to be able to specialize in the future.\nto offer a particular product or service more than any other, usually so that you have a good reputation for this product or service: a restaurant that specializes in seafood\nto do something very often, so that you are known for doing it: Their home fans specialize in personal taunts that often cross the line into abuse.\nMore examplesFewer examplesThese nurses specialize in the care of the dying.Some people argue that 18-year-olds are too young to specialize, and that such a narrow educational scope prevents them from exploring diverse fields at their own pace.Consider seeing a counsellor who specializes in stepfamily relationships.US marshals specialize in finding fugitives and escapees.The company specializes in customized computer systems.This store specializes in natural-fibre wallpapers inspired by kimonos and woodblock paintings. She specializes in historical novels set in 18th-century England.He specializes in breeding large dogs such as Irish wolfhounds.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nextension\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nBusiness - general words\nHabitual behaviour\nspecialize verb [I]\n(IN BIOLOGY)\nbiology\n&#160; specialized to change or develop in order to suit a particular environment or situation, or to perform a particular function: Embryonic stem cells begin to specialize and move through the body to develop organs such as the heart, bones and skin. Some insects are general pollinators, and others specialize. See also\nspecialized\nMore examplesFewer examplesTo keep stem cells from specializing requires a carefully controlled lab environment.The precursor cells are able to proliferate (continue to replicate) and specialize into different functions.Adult cells have a more limited ability to specialize than embryonic cells.\nSMART Vocabulary: related words and phrases\nCells\nanaphase\nanti-platelet\nassort\nbiotech\nbipolar\ncovalent bond\ndiploid\neukaryotic\nextracellular\nflagellum\ngap junction\ngermline\nhaemoglobin\nmulticellular\nnucleate\nnucleated\npluripotent\nprokaryote\nprokaryotic\nzygote\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal & plant biology - general words\nAdd to word list\nAdd to word list\nto spend most of your time studying one particular subject or doing one type of work: She’s a lawyer who specializes in accident cases. The store specializes in Asian antiques. specialized adjective us\nYour browser doesn't support HTML5 audio\n/ˈspeʃ·əˌlɑɪzd/\nHer job is very specialized.\nAdd to word list\nAdd to word list\nto spend most of your time studying one particular subject or doing one type of business: specialize in sth The bank has hired a trader to specialize in Southeast Asian and Latin American currencies."}