{"id":339073,"name":"specify","type":"verb","us_sound":"ˈspes.ə.faɪ","us_link":"../audio/s/specify.mp3","uk_sound":"ˈspes.ɪ.faɪ","uk_link":"../audio/s/ukspeci014.mp3","content":"Add to word list\nAdd to word list\nB2 to explain or describe something clearly and exactly: He said we should meet but didn't specify a time. The peace treaty clearly specifies the terms for the withdrawal of troops. [ + question word ] The newspaper report did not specify how the men were killed. [ + (that) ] My contract specifies (that) I must give a month's notice if I leave my job. The loan must be repaid within a specified period/by a specified date.\nMore examplesFewer examplesPlease specify the dimensions of the room.For a monthly flat fee, paid by the consumer or employer, HMOs provide a specified list of medical services both in and outside the hospital.He didn't specify exactly which documents he needed.The contract specifies that a penalty fee is to be paid if the work is late.I need you to specify the materials you need.\nSMART Vocabulary: related words and phrases\nElaborating, specifying and simplifying\nabstract\nanti-reductionism\nanti-reductionist\nbroad brush\nbroaden\nenlarge\nenlarge on/upon something\nexpand\nexpand on something\nexpansively\nover-elaboration\novergeneralization\novergeneralize\noversimplification\noversimplify\nsimplify\nspec\nspecification\nspecificity\nsplit hairs idiom\nSee more results »\nAdd to word list\nAdd to word list\nto state or describe something clearly and exactly: The treaty specified terms for the withdrawal of troops. [ + question word ] He didn’t specify how much was spent on advertising. specifiable adjective us\nYour browser doesn't support HTML5 audio\n/ˌspes·əˈfɑɪ·ə·bəl/\nAdd to word list\nAdd to word list\nto state or describe something clearly and exactly: He said we should meet but didn't specify a time. My contract specifies that I must give a month's notice if I leave my job. The loan must be repaid by a specified date. The land is zoned for development within a specified period of five years."}