{"id":339259,"name":"speculate","type":"verb","us_sound":"ˈspek.jə.leɪt","us_link":"../audio/s/speculate.mp3","uk_sound":"ˈspek.jə.leɪt","uk_link":"../audio/s/ukspect003.mp3","content":"speculate verb [I]\n(GUESS)\nAdd to word list\nAdd to word list\nC2 to guess possible answers to a question when you do not have enough information to be certain: I don't know why she did it - I'm just speculating. A spokesperson declined to speculate on the cause of the train crash. Journalists are speculating about whether interest rates will be cut. [ + that ] The newspapers have speculated that they will get married next year.\nThesaurus: synonyms, antonyms, and examples\nto guessguessGuess who called yesterday?estimateThey estimate that the work will take at least ten weeks.divineMum had divined my state of mind rather shrewdly.surmiseFrom the expression on his face, she surmised that something bad had happened.conjectureIt would be reasonable to conjecture that lack of exercise contributed to his obesity.speculateA spokesperson declined to speculate on the cause of the plane crash.\nSee more results »\nMore examplesFewer examplesIt's useless to speculate without more information.Royal-watchers have once again been speculating on the health of the princess.Scientists have speculated about the possibility of parallel universes.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nfall\nguess\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nSee more results »\nspeculate verb [I]\n(TRADE)\nto buy and sell in the hope that the value of what you buy will increase and that it can then be sold at a higher price in order to make a profit: He made his money speculating on the London gold and silver markets. The company has been speculating in property for years.\nSMART Vocabulary: related words and phrases\nInvesting money\nbacker\nbet\nbet big on something/someone idiom\ncapitalize\nco-investor\ndiscretionary\ndivestiture\ndivestment\nendow\nethical\nhedge fund\ninvestor\nmature\nmicrofinance\npay something in\npension plan\nplough\nplough into something/someone\nprotect\npump something into something\nSee more results »\nspeculate verb [I]\n(GUESS)\nAdd to word list\nAdd to word list\nto form opinions about something without having the necessary information or facts; to make guesses: I’m just speculating about what happened. Officials refused to speculate on the cause of the crash.\nspeculate verb [I]\n(TRADE)\nsocial studies to buy and sell with the hope that the value of what you buy will increase and that it can then be sold at a higher price in order to make a profit: He made his money speculating in the gold and silver markets.\nAdd to word list\nAdd to word list\nto guess possible answers to a question when you do not have enough information to be certain: speculate on/about sth Journalists are speculating about whether interest rates will be cut. A spokesperson declined to speculate on the date of the merger.speculate that Currency traders speculated that Japan's central bank might soon buy large amounts of dollars in the hope of preventing the yen from strengthening further\nFINANCE to buy something hoping that its value will increase and then sell at this higher price in order to make a profit: speculate on/in sth He made his money speculating on the London gold and silver markets. The company speculates in property."}