{"id":339301,"name":"speed","type":"noun","us_sound":"spiːd","us_link":"../audio/s/speed.mp3","uk_sound":"spiːd","uk_link":"../audio/s/ukspect014.mp3","content":"speed noun\n(RATE OF MOVEMENT)\nAdd to word list\nAdd to word list\nB1 [ C or U ] how fast something moves: He was travelling at a speed of 90 mph. The car has a top speed of 155 miles per hour. You should lower/reduce your speed as you approach a junction. On a clear, straight road you can gather/pick up speed. He came off the road while driving his car round a bend at high/breakneck speed (= very fast). There are speed restrictions (= controls on how fast traffic is allowed to move) on this part of the road. an electric drill with two speeds (= rates at which it turns)\nThesaurus: synonyms, antonyms, and examples\nslowlyslowlyI got out of bed and walked slowly to the door.slowGo slower! I can't keep up.at a slow paceThey are easy hikes, done at a slow pace.at a slow speedYou only have to hit a pedestrian at a slow speed to kill them.at slow rateThe economy grew at a slower rate during the second half of the year.\nSee more results »\nB2 [ U ] very fast movement: I get a real thrill from speed. He put on a sudden burst of speed. Both cars were travelling at speed (= very fast) when the accident happened.\n[ U ] how fast something happens: We were surprised at the speed of the response to our enquiry. It was the speed at which it all happened that shocked me. She got through her work with speed (= quickly) and efficiency. the speed of light/sound\nthe rate at which light or sound travels: The speed of light is 300 million metres per second. These planes travel at twice the speed of sound.\n[ C ] a\ngear : a bicycle with ten speeds a ten-speed bicycle\n[ C ] the rate at which a photographic film absorbs or reacts to light: What speed film do I need for taking photographs indoors? shutter speed\nthe length of time for which part of a camera is open to allow light to reach the film when a photograph is being taken: a high/low shutter speed\nMore examplesFewer examplesThe hummingbird beats its wings at great speed.With this drill it's possible to adjust the speed of rotation.The engine shuts off automatically when the desired speed is reached.Slack off your speed as you approach the corner.The police car drove past at a terrific speed.\nSMART Vocabulary: related words and phrases\nSpeed of motion\nairspeed\nat full/half throttle idiom\nbriskness\ncelerity\nclip\nclock\ncruising speed\nground speed\nhypersonic\nhypervelocity\ninstantaneous velocity\nlight speed\nmomentum\nmulti-speed\npace\nspeediness\nsupersonically\nswiftness\nvelocity\nzip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHurrying and doing things quickly\nFast and rapid\nThe engine & engine parts\nBicycles\nPhotography\nspeed noun\n(DRUG)\n[ U ] slang for\namphetamine (= a drug that makes the mind or body more active): She was on speed at the time.\nSMART Vocabulary: related words and phrases\nSpecific types of drug\nalprazolam\namnesiac\namyl nitrite\nanaphrodisiac\nanti-AIDS\nanti-aphrodisiac\naphrodisiac\ncaffeine\ndesigner drug\nE, e\necstasy\ngas and air\nGHB\nkhat\nlegal high\nLSD\npep pill\npopper\nroach\nsmack\nSee more results »\nGrammar\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nIdiom\nup to speed\nto (cause to) move, go, or happen fast: The train sped along at over 120 miles per hour. The actress then sped away/off in a waiting car. We sped down the ski slopes. This year is speeding by/past. Ambulances sped the injured people (= moved them quickly) away from the scene. The best thing you can do to speed your recovery (= make it quicker) is to rest.\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nbe speeding\nto be driving faster than you are legally allowed to do: He was caught speeding.\nMore examplesFewer examplesO'er land and sea they sped.The car pulled off and sped up the road.The train sped through the station with a whoosh.We are trying to speed investment in the area.Four boys on motorbikes came speeding down the road.\nSMART Vocabulary: related words and phrases\nIncreasing and decreasing speed of motion\naccelerant\naccelerate\naccelerating\nacceleration\naccelerative\nbrake\ncatch\ncatch (someone) up\ninhibition\nisolator\nnon-accelerating\nput your foot down idiom\nquicken\nretard\nspeed (something) up\nspurt\nstep on the gas idiom\nthrottle\nthrottle (something) back/down\nupshift\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nCrime - general words\nPhrasal verb\nspeed (something) up\nAdd to word list\nAdd to word list\n(a) rate at which something moves or happens: [ C ] a speed of 25 miles per hour [ U ] Both cars were traveling at high speed. [ U ] They came racing down the hill at top speed (= as fast as they could go). [ U ] The processing speed of my new computer is much faster. [ C ] This electric drill has two speeds (= rates at which it turns).\nphysics Speed is also the rate at which something travels, expressed as the number of meters in a second.\nA speed is also a gear (= part that controls the rate at which a vehicle moves): [ C ] I have a ten-speed bicycle. speedily adverb us\nYour browser doesn't support HTML5 audio\n/ˈspi·dəl·i/\nThe error can be speedily corrected.\nto move, go, or happen fast, or to cause something to happen fast: [ I ] The train sped along at over 120 miles per hour. [ I ] This year seems to be speeding by/past. [ T ] Ambulances sped the injured people (= moved them quickly) away from the scene. Phrasal verb\nspeed up (something)\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; IT, INTERNET the rate at which a computer or an internet connection operates and provides information: Increase the speed of your computer with our new software. How do I verify my computer's CPU speed? First you need to find out what your internet connection speed is.\nup to speed\nif you are up to speed with a subject or activity, you have all the latest information necessary to understand or do something well: A few days training on the new computer system will get you up to speed. Before we start the meeting I'm going to bring you up to speed with the latest developments."}