{"id":339281,"name":"speech","type":"noun","us_sound":"spiːtʃ","us_link":"../audio/s/speech.mp3","uk_sound":"spiːtʃ","uk_link":"../audio/s/ukspect009.mp3","content":"speech noun\n(SAY WORDS)\nAdd to word list\nAdd to word list\nB1 [ U ] the ability to talk, the activity of talking, or a piece of spoken language: Children usually develop speech in the second year of life. People who suffer a stroke may experience a loss of speech.\n[ U ] the way a person talks: His speech was slurred and I thought he was drunk.\nB1 [ U ] the language used when talking: Some expressions are used more in speech than in writing.\n[ C ] a set of words spoken in a play: Do you know the words to Hamlet's famous speech at the beginning of Act III?\nMore examplesFewer examplesShe suffers from a speech defect.From her slow, deliberate speech I guessed she must be drunk.Freedom of speech and freedom of thought were both denied under the dictatorship.As a child, she had some speech problems.We use these aids to develop speech in small children.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nunderstand\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of speaking\nLiterature\nspeech noun\n(FORMAL TALK)\nB2 [ C ] a formal talk given usually to a large number of people on a special occasion: I had to give/make a speech at my brother's wedding. The Governor of New York delivered a rousing speech to the national convention. He gave the after-dinner speech (= a talk given after a formal evening meal at which a large number of people are present). Did you hear her acceptance speech at the Oscars ceremony? See also\nspeak (FORMAL TALK)\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\nMore examplesFewer examplesHer speech was received with cheers and a standing ovation.She closed the meeting with a short speech.The vicar's forgetting his lines in the middle of the speech provided some good comedy.Her speech caused outrage among the gay community.She concluded the speech by reminding us of our responsibility.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\nfloor\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nslide\nspeak\nspeechify\ntalk at someone\nvalediction\nSee more results »\nGrammar\nSpeech into writingBoth speech and writing can be formal or informal. Whether language is formal or informal depends on who our readers and listeners are, for what purpose we use the language and the situation in which we use it. For example, an official notice would be written in formal English, whereas the same information would be more commonly written informally by an individual in a less public situation: …\nspeech noun\n(TALKING)\nAdd to word list\nAdd to word list\n[ U ] the ability to talk, or the activity of talking: People who suffer a stroke may experience a loss of speech.\n[ U ] Your speech is also your way of talking: His speech became slurred and indistinct.\n[ U ] Speech can also mean the language used when talking: Some expressions are used more in speech than in writing.\nspeech noun\n(FORMAL TALK)\n[ C ] a formal talk given usually to a large number of people on a special occasion: an acceptance speech I’m nervous about the speech I’m making tomorrow."}