{"id":339402,"name":"spelling","type":"noun","us_sound":"ˈspel.ɪŋ","us_link":"../audio/s/spelling.mp3","uk_sound":"ˈspel.ɪŋ","uk_link":"../audio/s/ukspell003.mp3","content":"Add to word list\nAdd to word list\nA2 [ U ] forming words with the correct letters in the correct order, or the ability to do this: He's hopeless at spelling. My computer has a program which corrects my spelling. Your essay is full of spelling mistakes/errors.\n[ C ] the way a particular word is spelled: This dictionary includes both British and American spellings of words.\nMore examplesFewer examples\"Is that the correct spelling?\" \"I don't know - look it up in a dictionary.\"His essay was full of spelling errors.Nobody got full marks in the spelling test.The irregularity of English spelling means that it is easy to make mistakes.You'll be marked down for poor spelling and punctuation.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nGrammar\nSpellingWords in English are not always spelled as they are pronounced. Spelling in English follows some basic rules and the majority of English words (around 75%) follow these rules. You can learn the rules but there are always exceptions to the rules that need to be learned too. …\nSpelling: prefixesWhen there is a prefix, we do not normally add or take away more letters: …\nSpelling and pluralsThere are rules for the plurals of regular nouns and the -s forms of regular verbs. …\nSpelling: doubling consonantsWe often double the final consonant of a word (b, d, g, l, m, n, p, r, t) when a suffix beginning with a vowel is added (-ed, -er, -est, -ing): …\nSpelling: dropping and adding lettersWe often drop the final -e when a suffix beginning with a vowel is added to a word: …\nSpelling: ie or ei?If in doubt about ie or ei, when the sound of the vowel is as in brief /i:/, we spell it ie; but after the letter c, we spell it ei: …\nSpelling and verb formsThe past and -ed forms are the same in regular verbs. The following are the spelling rules for regular verbs. …\nBritish and American English SpellingHere are some common differences between British and American English spelling. A good learner’s dictionary will give information about other spelling differences: …\nAddition of final -e to indicate long vowelWe use a final silent -e to indicate that the stressed vowel is long: …\nAdd to word list\nAdd to word list\nthe forming of words with the letters in the correct order, or the way in which a word is formed: [ C ] I shouldn’t be marked wrong just because I used British spellings rather than American."}