{"id":339398,"name":"speller","type":"noun","us_sound":"ˈspel.ɚ","us_link":"../audio/s/usspele007.mp3","uk_sound":"ˈspel.ər","uk_link":"../audio/s/ukspell002.mp3","content":"speller noun [C]\n(PERSON)\nAdd to word list\nAdd to word list\na person who spells words in the way that is described: With these games we hope to make it cool to be a good speller. In school I was always a bad speller. Hemingway, Keats, Virginia Woolf, and Yeats were all said to be appalling spellers. She said that frequent texters tend to be better spellers, because they're much more used to writing.\na person who takes part in a spelling competition: She was one of only 12 spellers who made it to the finals broadcast live on ABC.\nMore examplesFewer examplesHe isn't a natural speller and I used to be a teacher, so I always have to check his work.Good spellers often enjoy searching for exceptions and looking at incorrect examples, because they can see what's wrong.Spellers who rely on sound (that is, spellers with a weak visual memory) often make mistakes.The annual spelling bee begins this week in Washington, D. C., with nearly 300 spellers.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\ntab\ntranscribe\nunwritten\nSee more results »\nspeller noun [C]\n(BOOK)\nUS a book that teaches spelling: They publish grammars, usage guides, pronunciation guides, spellers, etc.\nMore examplesFewer examplesI never went to school. I learned to read out of McGuffey's speller. It was a little book with a blue back. Because English spelling is often unrelated to its pronunciation, spellers were used as teaching tools in schools.Webster's small volume, in later editions titled The American Spelling Book, became widely known as The Blue-Backed Speller.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovel\nnovelette\nnovelistic\ntome\ntrilogy\nvade mecum\nworkbook\nya\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks: reference books"}