{"id":339385,"name":"spell","type":"verb","us_sound":"spel","us_link":"../audio/s/spell.mp3","uk_sound":"spel","uk_link":"../audio/s/ukspect027.mp3","content":"spell verb\n(FORM WORDS)\nAdd to word list\nAdd to word list\nA2 [ I or T ] spelled or UK also spelt | spelled or UK also spelt to form a word or words with the letters in the correct order: How do you spell receive? Shakespeare did not always spell his own name the same way.spell something (out) Our address is 1520 Main Street, Albuquerque. Shall I spell that (out) (= say in the correct order the letters that form the word) for you? I think it's important that children should be taught to spell.\nMore examplesFewer examplesCould you spell your name again, please?Some words are more difficult to spell than others.Does she spell her name with a C or with a K?She always spells my name wrong.He even spelled his own client's name wrongly.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\nfair\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\nspell verb\n(RESULT)\nspell disaster, trouble, etc.\nto cause something bad to happen in the future: The new regulations could spell disaster for small businesses.\nSee more\nspell verb\n(DO INSTEAD)\n[ T ] mainly US spelled | spelled to do something that someone else would usually be doing, especially in order to allow them to rest: You've been driving for a while - do you want me to spell you?\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nPhrasal verb\nspell something out\nspell noun [C]\n(PERIOD)\na period of time for which an activity or condition lasts continuously: for a spell I lived in Cairo for a spell.have a spell as She had a brief spell as captain of the team.dizzy spell I keep having/getting dizzy spells (= periods of feeling as if I'm turning around).\na short period of a particular type of weather: a spell of dry weather The weather forecast is for dry, sunny spells.\nMore examplesFewer examplesIn this current cold spell, many old people are dying needlessly of hypothermia.It looks as if we are in for a settled spell this week.After a brief spell in the army, he started working as a teacher.He had a brief spell in the army.She had a couple of spells in a mental hospital.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWeather & climate - general words\nspell noun [C]\n(DO INSTEAD)\nUS a period when you do something that someone else would usually be doing, especially in order to allow them to rest: spells (with) If we take spells (with) doing the painting, it won't seem like such hard work.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nspell noun [C]\n(MAGIC)\nspoken words that are thought to have magical power, or (the condition of being under) the influence or control of such words: cast/put a spell on The witch cast/put a spell on the prince and he turned into a frog.break the spell A beautiful girl would have to kiss him to break (= stop) the spell.under a spell Sleeping Beauty lay under the wicked fairy's spell until the prince woke her with a kiss.\nSMART Vocabulary: related words and phrases\nMagic\nabracadabra\nalchemy\nbewitch\nbezoar\nblack magic\nenchantment\nescapology\nevil\nhex\nmagic word\nmagical\nmagically\nmugwort\nmystic\nthe evil eye idiom\nwand\nwhammy\nwhite magic\nwitchcraft\nwizardry\nSee more results »\nIdiom\nbe under someone's spell\nspell verb\n(FORM WORDS)\nAdd to word list\nAdd to word list\n[ I/T ] to form a word or words with the letters in the correct order: [ I ] As a child he never learned to spell. [ T ] Send it to Dr. Mikolajczyk – I’ll spell that name for you (= say the letters that form the word).\nspell verb\n(RESULT)\n[ T ] to have usually something unpleasant as a result: This cold weather could spell trouble for gardeners. Phrasal verbs\nspell something out\nspell something out\nspell noun [C]\n(PERIOD)\na period of time during which an activity or condition lasts: a spell of wet weather She lived in London for a short spell in the 1980s.\nspell noun [C]\n(POWER)\na magic power produced by speaking a set of words or taking a specific set of actions: He was placed under a spell that could be broken only when the princess kissed him."}