{"id":339447,"name":"spending","type":"noun","us_sound":"ˈspen.dɪŋ","us_link":"../audio/s/spending.mp3","uk_sound":"ˈspen.dɪŋ","uk_link":"../audio/s/ukspell009.mp3","content":"Add to word list\nAdd to word list\nC2 the money that is used for a particular purpose, especially by a government or organization: government spending on health spending cuts Consumer spending has more than doubled in the last ten years.\nMore examplesFewer examplesThe government and the opposition parties have clashed over the cuts in defence spending.The government is trying to control spending.With the housing market picking up and consumer spending buoyant, it appears that the feelgood factor has returned.The prime minister has announced that public spending will be increased next year.There was a modest rise in high-street spending last month.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nAdd to word list\nAdd to word list\nthe act of giving money for goods and services: Government spending for scientific research will be increased in next year’s budget. We have to find ways to cut spending and keep down costs.\nAdd to word list\nAdd to word list\nthe money that is used for a particular purpose, especially by a government, organization, or group: spending on sth Net spending on Britain's infrastructure last year was £2.6 billion.increase/raise/boost spending The huge retailer increased spending on health care for its employees. cut/trim/control spending Spending cuts alone will not generate the needed growth in the economy. Massive increases were made in government spending. Consumer spending has more than doubled in the last ten years. corporate/federal spending defence/R&amp;D spending See also\ndeficit spending\ndiscretionary spending\npublic spending\nstandard spending assessment"}