{"id":339441,"name":"spend","type":"verb","us_sound":"spend","us_link":"../audio/s/spend.mp3","uk_sound":"spend","uk_link":"../audio/s/ukspell007.mp3","content":"spend verb\n(MONEY)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to give money as a payment for something: How much did you spend? I don't know how I managed to spend so much in the club last night. We spent a fortune when we were in New York. She spends a lot of money on clothes. We've just spent $1.9 million on improving our computer network. We went on a spending spree (= we bought a lot of things) on Saturday.\nThesaurus: synonyms, antonyms, and examples\nto spend moneyspendHow much do you intend to spend on a house?payWhen you bought the tickets, how much did you pay?investShe's invested all her savings in the business.pay outI've just paid out £700 to get the car fixed.splurgeWe've just splurged on new kitchen appliances.blowWe won a £15 million settlement in court and we blew it all in six years.\nSee more results »\nMore examplesFewer examplesIt may be fairly cheap to buy, but you've got to take into consideration the money you'll spend on repairs.The number of staff we can take on will be determined by how much money we're allowed to spend.I'm meant to be on an economy drive at the moment, so I'm trying not to spend too much.We are duty bound to justify how we spend our funds.The council has some spare cash which it proposes to spend on public amenities.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nspend verb\n(TIME)\nA2 [ T ] to use time doing something or being somewhere: I think we need to spend more time together. I spent a lot of time cleaning that room. I've spent years building up my collection. I spent an hour at the station waiting for the train. How long do you spend on your homework? My sister always spends ages in the bathroom. We spent the weekend in Buenos Aires. You can spend the night here if you like.\nMore examplesFewer examplesStudents learning computer studies spend two days each week in a computer lab and four days in the classroom.I have to spend three months of the year away from home - but there are compensations like the chance to meet new people.They were condemned to spend the rest of their lives in prison.It would be a crime to spend such a beautiful day indoors.We would spend every meal time entreating the child to eat her vegetables.\nSMART Vocabulary: related words and phrases\nSpending time & time passing\nall the time in the world idiom\nAnno Domini\ncourse\nelapse\nemploy\nfall\nfall away\nmisspend\npass\nroll\nroll by\nrun\nrun out\nslip\nslip away\nthe sands of time idiom\ntick\ntimekeeper\nwear on\nwhile something away\nSee more results »\nspend verb\n(FORCE)\n[ T ] to use energy, effort, force, etc., especially until there is no more left: For the past month he's been spending all his energy trying to find a job. They continued firing until all their ammunition was spent (= there was none of it left). The hurricane will probably have spent most of its force (= most of its force will have gone) by the time it reaches the northern parts of the country. Her anger soon spent itself (= stopped).\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\ntap\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\nIdioms\nspend money like water\nspend a penny\nspend the night together\nthe amount of money that is spent on something: The total spend on the project was almost a million pounds.\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nspend verb\n(MONEY)\nAdd to word list\nAdd to word list\n[ I/T ] to give money as a payment for something: [ T ] We spent a lot of money on our vacation but we had a great time.\nspend verb\n(TIME)\n[ T ] to use time; to allow time to go past: It doesn’t look as if you spent very long on your homework. I’ve spent many years building up my collection. You can spend the night here if you like (= stay here for the night).\nspend verb\n(FORCE)\n[ T ] to use energy, effort, force, etc., until there is no more left: For the past month he’s been spending all his energy trying to find a job.\nAdd to word list\nAdd to word list\n[ I or T ] to give money as a payment for something: How much did you spend?spend sth on sth We've just spent €1.9 million on improving our computer network. We've spent too much money on advertising that isn't working. We spent a fortune when we were in New York.\n[ T ] to use time doing something or being somewhere: spend time doing sth They need to spend more time improving customer relations.spend time on sth I spent a lot of time on that report. How long do you spend at the computer each day?spend years/ages I've spent years building up this company.spend a day/week/year, etc. We spent last weekend working.\n[ T ] to use energy, effort, force, etc., especially until there is no more left: For the past month he's been spending all his energy trying to find a job.\nSee also\noverspend verb\ntax-and-spend\nunderspend verb\nthe amount of money that is spent on a particular activity: the spend on/for sth The total spend on the project was almost a million pounds. If your company's annual spend on telephone calls exceeds $3,000, then it would be worth changing plans.the total/actual spend BP will spend $1 billion more this year, raising the total spend to $15 billion. advertising/marketing/promotional spend See also\noverspend noun\nunderspend noun"}