{"id":340322,"name":"spiral","type":"noun","us_sound":"ˈspaɪr.əl","us_link":"../audio/s/spiral.mp3","uk_sound":"ˈspaɪə.rəl","uk_link":"../audio/s/ukspino004.mp3","content":"Add to word list\nAdd to word list\na shape made up of curves, each one above or wider than the one before: spiral-shaped A corkscrew is spiral-shaped.\nMike_Kiev/iStock/Getty Images Plus/GettyImages downward spiral\nC2 a situation in which a price, etc. becomes lower, or a situation gets worse and is difficult to control because one bad event causes another: This year's downward spiral of house prices has depressed the market.\nSee more\nin American football, a kick or throw of the ball that spins on its long axis (= imaginary straight line going through the centre of an object that is spinning) as it is thrown in the air: The quarterback threw a perfect spiral into the hands of the wide receiver.\nMore examplesFewer examplesThe country's economy is on a downward spiral.The pasta was in small spiral shapes.The staircase was a grand spiral of marble.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntight\ntrajectory\nturn\nwhirl\nwhorl\nwraparound\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRevolving, rotating and spinning\nAmerican football\nto move in a spiral: With one wing damaged, the model airplane spiralled downwards.\nIf costs, prices, etc. spiral, they increase faster and faster: Spiralling costs have squeezed profits. spiral downwards mainly UK (US usually spiral downward)\n(of prices, etc.) to become less, at a faster and faster rate: Employees were demanding higher wages at a time when productivity was spiralling downwards.\nSee more\nIf a situation spirals, it quickly gets worse in a way that becomes more and more difficult to control: spiral out of control Violence in the country is threatening to spiral out of control.spiral into He spiralled into a drug addiction that cost him his life.\nSMART Vocabulary: related words and phrases\nMoving downwards\nbase jumping\ncascade\ndescend\ndive\ndownwardly\ndrop/fall/sink like a stone idiom\nfall down\nflop\ngo down\nparachute\npronate\npronation\nput\nput something/someone down\nrain (something) down\nset\nset something down\nsink\ntouch\ntouch down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrice increases\nshaped in a series of curves, each one above or wider than the one before: a spiral staircase a spiral galaxy\nSMART Vocabulary: related words and phrases\nGeometry: properties of circles & curves\namplitude\narched\nbelly\nbore\ncircularity\ncircumference\ncircumferential\nconcave\nconcavity\nconcentric\nconcentrically\nconic\ncurvy\ngauge\ngirth\nincisura\nosculate\nparabolic\nrectifiable\nsinuosity\nSee more results »\nAdd to word list\nAdd to word list\na shape of a continuous, curving line that forms circles around a center point: A corkscrew is made in a spiral. fig. Roy was bitter about the downward spiral of his life (= it was becoming continuously worse). spiral adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈspɑɪ·rəl/\nNew playground equipment includes a large spiral slide.\nto move in a spiral: The engine quit, and my beautiful model airplane spiraled downward. High winds spiraled around the storm center.\nAdd to word list\nAdd to word list\na situation in which prices, levels, rates, etc. go down, or in which a situation gets worse and is difficult to control because one bad event causes another: a spiral of sth The world's two biggest economies are caught in a spiral of borrowing. This year's downward spiral of house prices has depressed the market. My former colleagues have been stuck in a spiral that continues to say, the only way we can continue our profit margins is to cut good journalism, and that is to me a death spiral.\n(also spiral up/upward(s)) if costs, prices, etc. spiral, they increase quickly: Costs spiral, and the patient is subjected to tests they don't need. Inflation began to spiral upward.spiral (from sth) to sth The country's foreign debt spiralled from $840 million to $2.6 billion.\nspiral downwards\nif costs, prices, etc. spiral downwards, they go down quickly: Stock prices have spiralled downwards for the past two weeks.\nspiral out of control\nif a situation spirals out of control, it becomes impossible to control because one bad event causes another: The project spiraled out of control, running $300 million over budget. There is a great deal of evidence that internet gambling is spiralling rapidly out of control. spiralling (US spiraling)\nspiralling fuel costs"}