{"id":340393,"name":"spirit","type":"noun","us_sound":"ˈspɪr.ət","us_link":"../audio/s/spirit.mp3","uk_sound":"ˈspɪr.ɪt","uk_link":"../audio/s/ukspino006.mp3","content":"spirit noun\n(WAY OF FEELING)\nAdd to word list\nAdd to word list\nB2 [ S or U ] a particular way of thinking, feeling, or behaving, especially a way that is typical of a particular group of people, an activity, a time, or a place: team spirit The players have a very strong team spirit (= loyalty to each other).spirit of the age/times As rock musicians in the 1960s, they were very much part of the spirit of the age/times.in a spirit of We acted in a spirit of cooperation. spirits B2 [ plural ]\nthe way a person is feeling: in high/low spirits I've been in high/low spirits (= feeling happy/sad) lately.\nSee more the spirit of a law, rule, etc.\nthe principle that a law, rule, etc. was created to make stronger, rather than the particular things it says you must or must not do: They followed neither the spirit nor the letter of the law.\nSee more enter/get into the spirit\nto show enthusiasm and enjoyment: They went to the tennis club a few times but never really got into the spirit of it.\nSee more that's the spirit\nused to approve or encourage someone's positive attitude (= way of thinking) or action: \"Come on, we can win this game.\" \"That's the spirit.\"\nSee more\nMore examplesFewer examplesThe presence of so many outsiders has ruined the community spirit.I could never play team sports - I lack the competitive spirit .There is a spirit of defeatism among some members of the party.She'll make money - she's got that entrepreneurial spirit.Our football coach has worked hard to inculcate a team spirit into the players.\nSMART Vocabulary: related words and phrases\nFeelings - general words\natmospherically\naura\ncharged\nemotional\nemotionalism\nemotionally\nfeeling\ngut\nhimself\nmyself\nnon-emotional\nnon-material\nsensibility\nsentience\nsentient\nsusceptibility\nteam spirit\nthirsty\ntwinge\nvibe\nSee more results »\nspirit noun\n(NOT BODY)\nC1 [ U ] the characteristics of a person that are considered as being separate from the body, and that many religions believe continue to exist after the body dies: in spirit Although he's now living in America, I feel he's with me in spirit (= I feel he is present and is influencing me, in a way that is not physical).\nB2 [ C ] the form of a dead person, similar to a ghost, or the feeling that a dead person is present although you cannot see them: an evil spirit The spirits of long-dead warriors seemed to haunt the area.\nMore examplesFewer examplesAfter the priest exorcized the spirit/house/child, apparently, the strange noises stopped.She claims to have occult powers, given to her by some mysterious spirit.This place is visited by the spirits of the dead.Her spirit haunts the house.\nSMART Vocabulary: related words and phrases\nMind and personality\n-hearted\n-heartedly\n-heartedness\nalexithymia\nallism\nallistic\nalter ego\nambivert\nAsperger's syndrome\ngestaltist\nhuman nature\njib\nneurotypical\nneurotypicality\nnoddle\nnoetic\nnoggin\npsychoanalysis\npsychoanalytic\nsubconscious\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSouls, spirits & ghosts\nspirit noun\n(ENTHUSIASM)\n[ U ] approving enthusiasm, energy, or courage: with spirit The orchestra performed The Rite of Spring with great spirit.break someone's spirit The torture failed to break the prisoner's spirit.\nSMART Vocabulary: related words and phrases\nExcitement, interest, energy and enthusiasm\nalacrity\nanimation\nardour\navidity\nboosterism\ncommotion\nflirtation\nfrenzy\nfriskiness\nfrisson\nfrolic\nget-up-and-go\nhubbub\npep\nperkiness\nphysicality\npiquancy\npizzazz\nzeal\nzealousness\nSee more results »\nspirit noun\n(ALCOHOL)\nC1 [ C or U ] a strong alcoholic drink: Vodka is a type of spirit. Spirits are more expensive than beer, but they get you drunk faster.\n[ U ] Some types of spirit are alcoholic liquids used especially for cleaning, mixing with paint, etc.: white spirit Thin the paint with white spirit.\nSMART Vocabulary: related words and phrases\nSpirits & distilling\nabsinthe\namaretto\napplejack\nbenedictine\nbitter\ncordial\ncreme\ncrème de menthe\ncuraçao\ndistil\nkirsch\nliqueur\nmalt\nmalt whisky\nmother's ruin\nschnapps\nsloe gin\nsmall-batch\nsotol\ntoddy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCleaning agents\nIdioms\nas, if, when, etc. the spirit moves someone\nthe spirit is willing, but the flesh is weak\nspirit someone/something away, off, out, etc.\nto move someone or something out of or away from a place secretly: Somehow the prisoners managed to spirit news out to the world outside. We managed to spirit her away to the countryside for a few days. Criminals bought the jewels and spirited them off the island. My task was to get hold of the documents and spirit them out of the country. The only way to protect the boy was to spirit him away from his home town.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nbike rack\nborne\nbring\nbudge\ncall for someone\nchauffeur\nconvey\nhump\nimport\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntransportation\ntruck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving to avoid being seen\nspirit noun\n(STATE OF MIND)\nAdd to word list\nAdd to word list\n[ U ] a state of mind or attitude: It’s very important to play the game in the right spirit. Rock music in the 1960s expressed the spirit of the times.\nspirit noun\n(INNER CHARACTER)\n[ C/U ] the inner character of a person, thought of as different from the material person we can see and touch: [ U ] All her life she remained young in spirit, bubbling with ideas. [ C ] It is a belief of many religions that your spirit lives on after your body dies.\n[ C/U ] A spirit is also something that can be felt to be present but cannot be seen, similar to a ghost.\nspirit noun\n(ENTHUSIASM)\n[ U ] enthusiasm and energy: The orchestra performed the symphony with great spirit.\nspirit verb [T always + adv/prep]\n(MOVE)\nto move someone or something secretly: [ M ] Everyone wonders who spirited away the body."}