{"id":340430,"name":"spiritualist","type":"noun","us_sound":"ˈspɪr.ə.tʃu.əl.ɪst","us_link":"../audio/s/usspill014.mp3","uk_sound":"ˈspɪr.ɪ.tʃu.əl.ɪst","uk_link":"../audio/s/ukspino013.mp3","content":"Add to word list\nAdd to word list\nsomeone who believes that living people can communicate with people who have died, especially someone who helps other people communicate with their dead family members: A spiritualist had told her he could give her a message from her dead husband. Emma became a Spiritualist, a person who believes that the living can communicate with the spirits of the dead. See\nspiritualism\nMore examplesFewer examplesShe tried to contact her dead sister though mediums and spiritualists. The business of keeping in touch with the dead is generally left to spiritualists and mediums.Their work appears to be the product of dramatic empathy, rather like that of spiritualists calling up the dead.\nSMART Vocabulary: related words and phrases\nSouls, spirits & ghosts\napparition\nastral plane\nastral projection\naura\nchi\nectoplasm\nhaunted\nincorporeal\nincubus\nnecromancer\nnecromancy\npossessed\nreincarnation\nsoul\nspectrally\nsuccubus\nséance\nwight\nwraith\nzombie\nSee more results »\nbelieving that living people can communicate with people who have died, or relating to this belief: A spiritualist medium insisted that the dead girl would return for her best friend's wedding. She goes to the spiritualist church. See\nspiritualism\nMore examplesFewer examplesShe decided to visit a spiritualist medium.A few days after his death, a spiritualist meeting was arranged for him to make an appearance from beyond the grave.He was prominent in the spiritualist movement, often attending seances.\nSMART Vocabulary: related words and phrases\nSouls, spirits & ghosts\napparition\nastral plane\nastral projection\naura\nchi\nectoplasm\nhaunted\nincorporeal\nincubus\nnecromancer\nnecromancy\npossessed\nreincarnation\nsoul\nspectrally\nsuccubus\nséance\nwight\nwraith\nzombie\nSee more results »"}