{"id":340859,"name":"split","type":"verb","us_sound":"splɪt","us_link":"../audio/s/split.mp3","uk_sound":"splɪt","uk_link":"../audio/s/uksplee011.mp3","content":"split verb\n(DIVIDE)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to (cause to) divide into two or more parts, especially along a particular line: be split between The prize was split between Susan and Kate.split something in something Split the aubergines in half and cover with breadcrumbs.split someone/something (up) into something The teacher split the children (up) into three groups.split something with someone informal I'll split (= share) this croissant with you. His trousers split when he tried to jump the fence. [ + obj + adj ] The woman had split her head open (= got a long, deep wound in her head) when she was thrown off the horse.\nThesaurus: synonyms, antonyms, and examples\nto breakbreakI didn't mean to break your phone.fractureLast year he fractured his skull.bustOne of the children has bust the computer.shatterThe ball hit the window and shattered it.smashI dropped the vase and it smashed.snapShe bent the ruler and it snapped.\nSee more results »\nC2 [ I ] to form cracks: The wooden floor had cracked and split in the heat.\nC2 [ I or T ] If the people in an organization or group split, or if something splits them, they disagree and form smaller groups: The childcare issue has split the employers' group.split down the middle The union executive has split down the middle (= divided into two equal-sized groups who disagree with each other) on what to do next.split (off) from A group of extremists split (off) from the Labour Party to form a new \"Workers Party\". split the difference\nIf you split the difference, you agree on a number or amount that is exactly in the middle of the difference between two other numbers or amounts: I suggested that we split the difference between his current salary and what we had initially offered for the job.\nSee more\nMore examplesFewer examplesOpinions were split cleanly between men and women.The electronics division was split off into a freestanding company.Let's split the cost right down the middle.The family is split down the middle on this issue.Pieces of stone can be split off by forcing wedges between the layers.\nSMART Vocabulary: related words and phrases\nSeparating and dividing\napheresis\natomize\nbifurcate\nbifurcation\nbisect\ndissociate\ndissociate yourself from something\ndissociation\ndisunion\ndisunite\nparcel something out\npartible\nperiodization\nperiodize\npolarize\nunbridgeable\nunforked\nunjoined\nuntangle\nwheat\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTearing and breaking into pieces\nArguing & disagreeing\nsplit verb\n(TELL)\n[ I ] UK old-fashioned informal to tell other people secret and damaging information about someone: split on someone to someone They knew Josie wouldn't split on them to the teacher.\nSMART Vocabulary: related words and phrases\nRevealing secrets & becoming known\nanti-secrecy\nbackchannel\nbare\nbare your heart/soul idiom\nblow someone's cover idiom\nblow/take the lid off something idiom\nbreak\ndeclassify\nhold\nhuddle\nkiss\nrat\nrat on someone/something\nreintroduce\nrevealingly\nrevelatory\nstate's evidence\ntip\ntranspire\nunravel\nSee more results »\nsplit verb\n(LEAVE)\n[ I ] old-fashioned informal to leave a place\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ngone\nmove\np.o.q.\npeel away/off\npiss off\npull\npull out\npull something off\npush along\nsea\nturf something out\nvacate\nvamoose\nwalk\nwalk off (somewhere)\nSee more results »\nIdioms\nsplit your sides\nsplit hairs\nsplit the defencePhrasal verb\nsplit up\nsplit noun [C]\n(division)\na long, thin hole in something where it has broken apart: split in Rain was getting in through a split in the plastic sheeting.\nSuthep Wongkhad/EyeEm/GettyImages\na situation in which a group of people is divided into smaller groups because they disagree about something: split between There is a widening split between senior managers and the rest of the workforce.split in/within The tax issue has caused a split in/within the government.split in There was a 75/25 split in the voting. the splits [ plural ] (US also a split [ singular ])\nthe action of sitting on the floor with your legs straight out and flat along the floor in opposite directions: do the splits Can you do the splits?\nSee more\nSMART Vocabulary: related words and phrases\nHoles, hollows and dips\nanti-crack\naperture\nblistered\nchink\ncranny\ncratering\ngouge\nhatch\nhollow\nimpression\nimprint\ninterstice\nladder\nleak\nleaky\nnook\npinprick\nshaft\nspyhole\nvoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArguing & disagreeing\nsplit noun [C]\n(time)\nthe time that is recorded after part of a race, or the part of a race itself: If you look at the splits of the other boats, it looks like the race will be close. She swam the fastest split in U.S. relay history. At the split time on the first descent he was in 5th place.\nSMART Vocabulary: related words and phrases\nSailing, yachting & canoeing\nboating\ncanoe\ncanoeing\ncanoeist\nCowes Week\ncrewless\nkayaking\nmizzen\npaddle\npaddler\npunt\nregatta\nresail\nsailing\nslalom\nyachting\nyachtsman\nyachtswoman\nYou can also find related words, phrases, and synonyms in the topics:\nParts & stages of competitions\nAthletics\nSwimming\nAdd to word list\nAdd to word list\nto divide into two or more parts, esp. along a particular line: [ T ] I suggest we split the profits between us. [ T ] The teacher split the class into three groups. [ I ] His pants split when he jumped the fence.\nslang To split also means to leave a place: [ I ] The movie was boring, so I split. Idiom\nsplit the differencePhrasal verb\nsplit up\na long, thin tear, or a division: There’s a split in this sheet. Peace talks are threatened by a split among rebel leaders.\nAdd to word list\nAdd to word list\n[ I or T ] (also split (sth) up) to divide or cause to divide into two or more parts: The senior leadership finally concluded that it made sense for the two businesses to split. The roles of chief executive and chairman could be split.split sth between sth It is thought that Mr Snow's job will now be split between general insurance and life insurance.split sth equally/evenly She splits her time equally between work and home.split sth up into sth The corporation was split up into three separate companies.\n[ I or T ] (also split off) if a part of an organization splits or is split from the larger organization, it becomes its own independent organization: split (sth) from sth The Shanghai enterprise split from a joint venture with S.C. Johnson.split sth into sth The electronics division was split off into a freestanding company.\n[ T ] to divide money in order to share it between people, organizations, or groups: split sth between sb/sth Sales-tax money will be split between the city and the state. The online magazine recorded revenues of $11.5m split equally between subscription fees and advertising.split sth two/three/four, etc. ways We will split the profits three ways.split sth 50-50/60-40/70-30, etc. Let's split the cost 50-50.\n[ T ]\n&#160; FINANCE, STOCK MARKET to divide shares of a company into two or more shares with lower value: Some analysts said the company is splitting its stock to gain investors' attention.\n[ I or T ] if a group of people or their opinions split or are split, some people have one opinion and others have a different opinion: The ruling party was split on the issue.be split between sb Opinions were split cleanly between workers and managers.split 50-50/55-45/60-40, etc. Shareholders split 55-45 in the vote to install the new CEO.\n[ I ] (also split up) to end a relationship: The partners split after working together for fifteen years.\nFINANCE, STOCK MARKET\n&#160; (also stock split) the act of dividing each of a company's shares into two or more shares: Companies that announce stock splits often see their shares rise before the split as investors anticipate demand. See also\nreverse stock split"}