{"id":340911,"name":"splutter","type":"verb","us_sound":"ˈsplʌt̬.ɚ","us_link":"../audio/s/eus74343.mp3","uk_sound":"ˈsplʌt.ər","uk_link":"../audio/s/uksplee018.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to speak in a quick and confused way, producing short, unclear noises because of surprise, anger, etc.: [ + speech ] \"But, er ... when, um, ... how?\" he spluttered. The old gentleman was spluttering with indignation. He sputtered an apology about being 14 minutes late.\n[ I ] (of a person) to produce short, unclear noises from your mouth, especially because you cannot breathe properly: Gasping, choking, spluttering, she struggled to escape. She took too big a gulp of whisky and started to cough and splutter.\n[ I ] (of an engine or machine) to make a series of short, unclear noises: One of the engines spluttered as if it was short of fuel. I can hear a coffee machine spluttering away.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\ntelegrammatic\nthrow your voice idiom\ntrash\nturn of phrase\ntwittering\nwang\nwhang\nyammer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: breathing & stopping breathing\nSounds made by humans with their mouths\nSounds made by objects, movement or impact\nthe act of speaking in a quick and confused way, producing short, unclear noises, because of surprise, anger, etc.: I listened to his splutters of justification. A few splutters of indignation could be heard from the back row.\nshort, unclear noises from your mouth, especially because you cannot breathe properly: She was struggling to make sense of the garbled words, splutters, and sneezes.\na series of short, unclear noises made by an engine or machine: She heard the cough and splutter of an aircraft engine.\nMore examplesFewer examplesWith a little splutter of laughter, she lightly punched his arm.The baby gave one last cry, several squeaks and splutters, and then fell asleep. The engine gave one final splutter and died.\nSMART Vocabulary: related words and phrases\nWays of talking\n-tongued\natonally\nbeg the question idiom\nblah\nblither\nchirp\ncoo\ncrap\nhalting\nslur\nsweet nothings\ntalk through your hat idiom\ntelegrammatic\nthrow your voice idiom\ntrash\nturn of phrase\ntwittering\nwang\nwhang\nyammer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal physiology: breathing & stopping breathing\nSounds made by humans with their mouths\nSounds made by objects, movement or impact"}