{"id":341123,"name":"spontaneous","type":"adjective","us_sound":"spɑːnˈteɪ.ni.əs","us_link":"../audio/s/spontaneous.mp3","uk_sound":"spɒnˈteɪ.ni.əs","uk_link":"../audio/s/ukspong005.mp3","content":"spontaneous adjective\n(NOT PLANNED)\nAdd to word list\nAdd to word list\nhappening or done in a natural, often sudden way, without any planning or without being forced: His jokes seemed spontaneous, but were in fact carefully prepared beforehand.approving She's such a spontaneous, lively woman.\nMore examplesFewer examplesI am certain both these statements were spontaneous and genuine.The audience broke into spontaneous applause.What happened was not a spontaneous outburst of violence.This was a spontaneous outpouring of emotion.We had no plans to do it - it was a spontaneous thing.\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunstarry\nunsuspected\nuntimely\nuntoward\nunwilled\nSee more results »\nspontaneous adjective\n(NO OUTSIDE CAUSE)\nbiology, medical\n&#160; specialized happening, especially in a living thing, without being caused by something outside, or without the organism's control: Since spontaneous remissions are common in rheumatoid arthritis, it is impossible to attribute them to any particular therapy. Spontaneous maturation is when meiosis continues without hormonal stimulation.\nMore examplesFewer examplesIt is estimated that spontaneous tendon ruptures occur in about one in 100,000 people.Although about 15 percent of cases are inherited, the vast majority appear to be spontaneous genetic mutations. The bacterium is capable of spontaneous movement.The delivery was spontaneous, rather than an induced or Caesarean birth.\nSMART Vocabulary: related words and phrases\nAnimal & plant biology - general words\nabiotic\nanatomical\nanatomically correct\nanti-Darwinian\nanti-Darwinism\nbiologist\nDarwinian\nDarwinism\nDarwinist\nentomological\nentomologist\nmorph\nnaturalist\npoisonous\npolymorphism\nprimary producer\nprimitively\nprokaryote\npseudopod\nzoology\nSee more results »\nRelated words\nspontaneity\nspontaneously\nAdd to word list\nAdd to word list\nhappening naturally, without planning or encouragement: a spontaneous performance spontaneous affection spontaneously adverb us\nYour browser doesn't support HTML5 audio\n/spɑnˈteɪ·ni·əs·li/\nThe children spontaneously gave us hugs and kisses."}