{"id":341113,"name":"sponsor","type":"verb","us_sound":"ˈspɑːn.sɚ","us_link":"../audio/s/sponsor.mp3","uk_sound":"ˈspɒn.sər","uk_link":"../audio/s/ukspong002.mp3","content":"sponsor verb [T]\n(PAY MONEY)\nAdd to word list\nAdd to word list\nB2 (of a business or other organization) to pay for someone to do something or for something to happen: The participants' employers sponsor them for the six-month training program. His organization sponsored the study.\n(of a business or other organization) to pay the costs of a sports event, concert, etc., or of a sportsperson, in return for advertising: BMW has plenty of practice sponsoring golf tournaments in Europe. The team is sponsored by JVC, so the players wear the letters JVC on their shirts.\nto agree to give money to someone who is taking part in an event to raise money for a special reason, especially to help people who are suffering: Eva said she was doing a ten-mile walk for charity and asked if I'd sponsor her. Get your friends and family to sponsor you.\nMore examplesFewer examplesWe're trying to find companies to sponsor us.The event was sponsored by several local businesses.I'm trying to get people at work to sponsor me to do a hundred-mile cycle.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nPaying money\nsponsor verb [T]\n(SUGGEST A NEW LAW)\npolitics\n&#160; specialized to write a bill (= a formal statement of a planned new law) and try to get people to vote for it: A bill is normally sponsored by the cabinet and introduced into Parliament by a cabinet minister.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nsponsor verb [T]\n(ORGANIZE TALKS)\nto organize talks between different groups: The World Health Organization sponsored talks on an international convention meant to reduce smoking and tobacco-related disease. It was the first time that the USA had officially sponsored negotiations between the two sides.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nsponsor verb [T]\n(SUPPORT SOMEONE)\nto officially take responsibility for someone else's actions: In general, immigrants qualified by having a close relative or employer sponsor them for a visa.\nreligion\n&#160; specialized (in the Christian church) to be someone's godparent at a baptism ceremony: The children are very close to the godparents who sponsored them at baptism.\nSMART Vocabulary: related words and phrases\nHelping and co-operating\nabet\naccommodative\naid\nany port in a storm idiom\nassist\nassist with something\nattend\nbridge\ncarry\nfacilitate\nfacilitation\nfinancial assistance\ngive someone a leg up idiom\ngive/lend someone a helping hand idiom\nrecourse\nrelief\nrun errands idiom\nshare a platform idiom\nsolid\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious practices\nRelated word\nsponsorship\nsponsor noun [C]\n(PAYER)\nB2 a person or company that supports a person, organization, or activity by giving money: All the major theatres now have sponsors, especially for high-cost productions. The players wore shirts with the sponsor's logo on the front.\nThesaurus: synonyms, antonyms, and examples\nsomeone who gives somethinggiverWomen are the primary gift givers in households.donorOne anonymous donor contributed $1 million.benefactorPip is told he has a mysterious benefactor and is going to be very well off.philanthropistThe philanthropist has given a large chunk of his fortune to good causes.sponsorLondon Fashion Week is funded by corporate sponsors.backerThey were lucky to find two wealthy backers.\nSee more results »\na person who agrees to give money to someone who is taking part in an event to raise money for a special reason, especially to help people who are suffering: How many sponsors have you got? The children have been collecting sponsors for their swimathon.\nThesaurus: synonyms, antonyms, and examples\nsomeone who gives somethinggiverWomen are the primary gift givers in households.donorOne anonymous donor contributed $1 million.benefactorPip is told he has a mysterious benefactor and is going to be very well off.philanthropistThe philanthropist has given a large chunk of his fortune to good causes.sponsorLondon Fashion Week is funded by corporate sponsors.backerThey were lucky to find two wealthy backers.\nSee more results »\nMore examplesFewer examplesOur sponsors have backed out.We're looking for sponsors.A lot of television series now have sponsors.Our sponsors are generally local companies.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nadvocate\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnon-member\nnon-membership\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPaying money\nsponsor noun [C]\n(PERSON SUGGESTING NEW LAW)\npolitics\n&#160; specialized someone who writes a bill (= a formal statement of a planned new law) and tries to get people to vote for it: I commend the bill 's sponsor for introducing such necessary legislation. The Senator is listed as a sponsor on all five bills.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nsponsor noun [C]\n(SUPPORTER)\na person who officially takes responsibility for someone else's actions: Under the program, family members would act as sponsors for addicts. For immigrants without a sponsor, marriage to a U. S. citizen can be the fastest route to legal status.\nreligion\n&#160; specialized (in the Christian religion) a person who, at a baptism ceremony, promises to help a new member of the religion, usually a child, in religious and moral matters: He was a sponsor at the baptism of Richard and Eliza's daughter Elizabeth in 1837. Synonym\ngodparent\nSMART Vocabulary: related words and phrases\nHelpers and accomplices\nabettor\naccessory\naccomplice\nacolyte\naide\nally\nbackup\nbuddy\ncollaborator\nconfederate\nden mother\nenabler\nlifesaver\nman Friday\nmate\nmoll\nright-hand man\nroom parent\nstrength\nsupport group\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFamily: non-blood relations\nAdd to word list\nAdd to word list\nto support a person, organization, or activity by giving money, encouragement, or other help: The Rotary Club sponsors Little League baseball in the summer. sponsor noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈspɑn·sər/\nCorporate sponsors support many public TV programs. sponsorship noun [ C/U ] us\nYour browser doesn't support HTML5 audio\n/ˈspɑn·sərˌʃɪp/\n[ U ] corporate sponsorship of the arts\nAdd to word list\nAdd to word list\nMARKETING to provide money for a television or radio programme, website, sports event, or other activity in exchange for advertising: We found a major shoe manufacturer that would like to sponsor the series. The event was sponsored by several local businesses.\nGOVERNMENT if someone in a position of authority sponsors a new idea, especially a law, they give it their support: Six Senators originally sponsored the bill.\nto give money to support a person, organization, or activity: We sponsor children in developing countries.\nMARKETING a company or organization that provides money for a television or radio programme, website, sports event, or other activity in exchange for advertising: And now a word from our sponsors. We are grateful to our corporate sponsors for making this event free to the public.\nGOVERNMENT someone in a position of authority who gives their support to a new idea, especially a new law: The bill is sponsored by one Democrat and one Republican.\nsomeone who supports a person, organization, or activity by giving money: We encourage our employees to become sponsors of participants in the charity run."}