{"id":341389,"name":"spot","type":"noun","us_sound":"spɑːt","us_link":"../audio/s/spot.mp3","uk_sound":"spɒt","uk_link":"../audio/s/ukspong029.mp3","content":"spot noun [C]\n(CIRCLE)\nAdd to word list\nAdd to word list\nB1 a small, usually round area of colour that is differently coloured or lighter or darker than the surface around it: He had a spot of grease on his tie.\nThesaurus: synonyms, antonyms, and examples\na mark on somethingmarkThe backs of the chairs have left marks on the wall.stainShe had grass stains on her white jeans.smearHe had smears of tomato ketchup on his shirt.smudgeNo matter how often I wash my hands, I leave smudges all over my phone's screen.blotchHe had blotches all over his face.speckShe looked through the old camera lens and saw specks of dust.\nSee more results »\nGlobalP/iStock/Getty Images Plus/GettyImages\nB1 one of many spots, that form a pattern: I wore that skirt with the green spots.\nnimon_t/iStock/Getty Images Plus/GettyImages\nB2 UK a raised, pale red circle on the skin that is temporary: Teenagers often suffer a lot from spots.\nmainly UK a small amount: I felt a few spots of rain. Let's stop for a spot of lunch.spot of bother I'm having a spot of bother (= some trouble) with one of my back teeth.\nMore examplesFewer examplesHe wore a grey tie with pink spots.There was a spot of food on his shirt.Her back erupted in small red spots.There are still a few stray spots of paint on the window pane.I felt a few spots of rain so I put my umbrella up.\nSMART Vocabulary: related words and phrases\nDirt & untidiness\nbloodstain\nclutter\ncontaminant\ncontamination\ncrud\nfleck\ngrime\ngrunge\ngunge\ngunk\nmuck\npollutant\npolluter\nscrappiness\nscruff\nshambles\nslime\nslob\nslovenliness\nsmear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nSkin complaints & blemishes\nWords meaning small pieces and amounts\nspot noun [C]\n(PLACE)\nB2 a particular place: This looks like a nice spot for a picnic. on the spot\nat the place where an event is happening or has recently happened: The police were called and they were on the spot within three minutes.\nC2 immediately: You can be sacked on the spot for stealing.\nUK (US in place) (of running or jumping) in one place, without moving forward or backward at all: Do a bit of running on the spot to warm up your leg muscles.\nSee more\nMore examplesFewer examplesThese plants need a sunny spot with good drainage.We found a sheltered spot to have our picnic.I found a sequestered spot at the bottom of the garden and lay down with my book.I found a nice spot for a bit of sun-bathing.Where shall we settle? This looks like a good spot.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nstation\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nspot noun [C]\n(PART OF A SHOW)\na short length of time in a show that is given to a particular performer: She's doing a regular five-minute spot on his show.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nIdiom\nput someone on the spot\nspot verb\n(SEE)\nB2 [ T ] to see or notice someone or something, usually because you are looking hard: I've just spotted Mark - he's over there, near the entrance. If you spot any mistakes in the article just mark them with a pencil. [ + -ing verb ] The police spotted him driving a stolen car. [ + question word ] I soon spotted what was wrong with the printer. [ + that ] The policewoman spotted that I hadn't got my seat belt on and signalled me to stop.\nThesaurus: synonyms, antonyms, and examples\nto see somethingseeI can see for miles from up here.noticeI noticed a crack in the ceiling.perceiveBill perceived a tiny figure in the distance.observeA teacher observed her climbing over the gate.spotWe managed to spot a leopard.catch sight ofWe looked for the bird and caught sight of it just as it flew off.\nSee more results »\nwell spotted UK\nused to praise someone who has noticed something: \"I've just seen your glasses - they're under the table.\" \"Ah, well spotted!\"\nSee more\nMore examplesFewer examplesA girl answering the description of the missing teenager was spotted in Hull.He was driving at 120 mph when the police spotted him.The thieves were spotted by a postman out on his rounds .Scott leapted to the rescue when he spotted the youngster in difficulty.They were spotted cavorting beside the swimming pool.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\ntab\nSee more results »\nspot verb\n(RAIN)\n[ I ] UK If you say it's spotting (with rain), you mean that a few drops of rain are falling.\nSMART Vocabulary: related words and phrases\nPrecipitation: rain\nbucket\nbucket down\ncloud seeder\ncloud seeding\ncloudburst\ndeluge\ndownpour\ndrizzle\nheaven\nmizzle\npelt\npiss\nrain gauge\nrainbow\nseed\nshower\nsun shower\ntorrentially\nwash\nwash (something) out\nSee more results »\nspot verb\n(SUPPORT)\n[ T or I ] in weight training and gymnastics, to stand next to the person lifting weights or doing particular movements in order to make sure they do not injure themselves: The coach will spot the gymnast briefly if they risk falling during a dangerous move. With friends urging one another on and spotting for one another, lifting weights can be fun.\nMore examplesFewer examplesIf you're spotting someone or supporting their weight in acroyoga, you have to be very engaged.At the gym, he often spotted for other guys when they lifted weights.\nSMART Vocabulary: related words and phrases\nGymnastics\naerialist\nartistic gymnastics\nasymmetric bars\nbackflip\nbeam\nfree running\ngym\ngymnast\ngymnastic\npommel horse\nsplit\nspotter\nstand on your hands/head idiom\nstick the/your landing idiom\nthe parallel bars\ntrampoline\ntrampolining\ntrampolinist\ntrapeze\ntwist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nspot noun [C]\n(MARK)\nAdd to word list\nAdd to word list\na mark, usually round, that is different esp. in color from the area around it: You got a spot on your new blouse.\nesp. CdnBr A spot is a pimple.\nspot noun [C]\n(PLACE)\na particular place: a vacation spot Our cat has a favorite spot where he loves to sleep.\nA spot is also a job in a particular organization or a position within a group, esp. in sports: When Sain was injured, they asked me to fill his spot.\nspot noun [C]\n(BROADCAST)\na period of time during which a broadcast takes place: NBC put the show on in the 7 p.m. spot.\nA spot is also an advertisement: a 30-second spot\nIdiom\non the spot\nspot verb [T]\n(SEE)\nto see or notice someone or something: Darryl spotted a woodpecker high on the tree.\nAdd to word list\nAdd to word list\nMARKETING a television or radio advertisement: a radio/television spot We are planning a series of radio spots during the afternoon commute.\nMARKETING a period of time during which a radio or television advertisement is broadcast: The firm bought a 30-second spot during prime time every evening.\nFINANCE, STOCK MARKET to be delivered immediately, rather than in the future: Spot trades are executed immediately at the prevailing exchange rate."}