{"id":341460,"name":"spray","type":"noun","us_sound":"spreɪ","us_link":"../audio/s/spray.mp3","uk_sound":"spreɪ","uk_link":"../audio/s/ukspotl016.mp3","content":"spray noun\n(LIQUID)\nAdd to word list\nAdd to word list\n[ U ] a mass of very small drops of liquid carried in the air: Can you feel the spray from the sea/waterfall?\nB2 [ C ] a liquid that is forced out of a special container under pressure so that it becomes a mass of small liquid drops like a cloud: a quick spray of perfume/polish\nDave and Les Jacobs/Blend Images/GettyImages\nB2 [ C ] a mass of small drops of liquid spread onto plants and crops, etc. from a special piece of equipment, or the piece of equipment itself: Farmers use a lot of chemical sprays on crops.\nMore examplesFewer examplesShe could feel the spray from the water on her skin.I don't like using sprays in my garden.Do you use any sprays on your hair?Some hair conditioners comes in the form of sprays.If you use this nasal spray, your nose should clear a bit.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nspray noun\n(FLOWERS)\n[ C ] a single small branch or stem with leaves and flowers on it: All the wedding guests wore sprays of carnations.\nRosemary Calvert/Photographer's Choice/GettyImages\nSMART Vocabulary: related words and phrases\nParts of plants\n-stemmed\nbilobed\nblade\nbulb\ncaning\ncascara sagrada\ncorolla\nendodermis\nknot\npine needle\nrhizome\nspine\nsprig\nsting\nstinger\nstoma\nstubbly\ntea leaf\ntrilobed\ntubule\nSee more results »\nB2 to spread liquid in small drops over an area: She sprayed herself with perfume. Vandals had sprayed graffiti on the wall. The pipe burst and water was spraying everywhere.figurative Rush hour commuters were sprayed with bullets by a gunman in a car.\nMore examplesFewer examplesHooligans had sprayed paint all over the car.She sprayed red paint all over his car in one last vengeful act before leaving him for good.She turned on the hose and a jet of water sprayed across the garden.The woman next to me sprayed on some perfume and stank out the whole shop .She sprayed conditioner into my hair.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nspray noun\n(LIQUID)\nAdd to word list\nAdd to word list\n[ C/U ] a mass of very small drops of liquid forced through the air, or a container from which small drops of liquid are forced out: [ U ] As the waves crashed over the rocks, some of the ocean spray reached them where they stood. [ C ] When my nose is stuffy, I use a nasal spray.\nspray noun\n(FLOWERS)\n[ C ] a single, small branch or stem with leaves and flowers on it, or a small arrangement of cut flowers: On the table was a spray of fresh flowers.\nspray verb [I/T]\n(FORCE OUT LIQUID)\nto put a mass of small drops of liquid on someone or something or into the air, or to flow out of a container in a mass of small drops: [ T ] Store employees offer to spray you with perfume. [ T ] fig. They were sprayed with flying glass from the shattered windows."}