{"id":341511,"name":"spread","type":"verb","us_sound":"spred","us_link":"../audio/s/spread.mp3","uk_sound":"spred","uk_link":"../audio/s/ukspotl018.mp3","content":"Add to word list\nAdd to word list\n[ I or T ] to cover or reach a wider or increasing area, or to make something do this: The fire spread very rapidly because of the strong wind.spread to It started off as cancer of the liver but it spread to other areas of the body. Student artwork can't cover more than 20% of a wall because it could help spread a fire into the ceiling.\n[ I or T ] to affect more and more places, people, or things, or to make something do this: Discontent among junior ranks was rapidly spreading. If disease is allowed to spread, it will cause widespread devastation. The virus is spread through contact with blood and other body fluids. They would then be free to impose their will and spread their totalitarian ideology. be spread somewhere\nto exist in many different places: be spread across The redundancies are spread across the banking and building industries.\nSee more\n[ T ] to open something that has been folded or make something flat, so it covers a larger area : spread something out We spread the picnic rug out on the ground and sat down to eat. The peacock spread out its wings.spread something over something To keep each grain of rice separate, spread a wet cloth over the cooked rice vessel and cover it with a plate for 10 minutes.\n[ T ] to stretch your arms, legs, fingers, or toes as far away from each other as possible: He spread his arms in a grand gesture. Flex your foot and spread your toes wide.\n[ T ] to arrange or put things all over a surface, usually in a thin layer or with spaces in between them : spread something (out) She spread the papers (out ) on a big table in the conference room. He spread coffee beans over a plastic sheet to dry in the sun.\n[ I or T ] to tell something to a lot of people, or to be told to a lot of people: Are you spreading gossip/rumours again? He said a challenger needs campaign cash to spread the message about why an incumbent needs to be replaced. The gossip spread like wildfire.\n[ T ] to divide something between several or many people: spread something between someone If we spread the work between us, it won't seem so bad.spread something amongst someone/something I could have spread the money amongst my 15 grandkids.\n[ I or T ] to put a soft substance on a surface and make it cover it, or to be able to be put on a surface in this way: She spread her toast with a thick layer of butter./She spread a thick layer of butter on her toast. It's a special sort of butter that spreads easily even when cold. The icing is nice and white and spreads well.\nThesaurus: synonyms, antonyms, and examples\nto put something over someone or somethingcoverI covered her with a blanket to keep her warm.spreadI spread peanut butter on my bread.smother something in/with somethingThe chicken was absolutely smothered in butter sauce.coatCoat the cherries in chocolate.plasterHis laptop cover was completely plastered with stickers.cakeHis shoes were caked in mud.\nSee more results »\n[ I ] to cover a large area: spread (out) The suburbs spread (out) for miles to either side of the city.\n[ I ] (of a smile) to appear on someone's face, until it is a big smile: Slowly a smile spread across her face. As Greene's head popped up, a huge grin spread over his face.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndisseminate\ndistribution\ndredge\ndusting\nencroach on/upon something\nfan out\nramble\nrambling\nscatteringly\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsprinkle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\nStretching the body\nAnnouncing, informing & stating\nSharing\nPreparing food\nLaughing and smiling\nIdioms\nspread your wings\nspread the word\nspread yourself too thinPhrasal verbs\nspread out\nspread something over something\nspread noun\n(ACT OF SPREADING)\nB2 [ S ] the development or growth of something so that it covers a larger area or affects a larger number of people: The spread of the disease in the last few years has been alarming.\n[ S ] the act of spreading knowledge, information, etc. to more and more people : The web allows the rapid spread of information. The feedback system enables the spread of best practice.\nMore examplesFewer examplesThe government is trying to allay public fears about the spread of the disease.The treatment has so far done little to arrest the spread of the cancer.The mountains acted as a natural barrier to the spread of the disease.The Swedes are not alone in finding their language under pressure from the ubiquitous spread of English.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndisseminate\ndistribution\ndredge\ndusting\nencroach on/upon something\nfan out\nramble\nrambling\nscatteringly\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsprinkle\nSee more results »\nspread noun\n(RANGE)\n[ S ] the area or range covered by something: wide spread The survey found a wide spread of opinion over the proposed new building.broad spread Few other corporate roles require such a broad spread of knowledge and experience.\nMore examplesFewer examplesThe course includes not only philosophy and history but a broad spread of modern European languages and literature.There is a wide spread of ages among the volunteers.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nstretch\nstring\nSee more results »\nspread noun\n(IN NEWSPAPER)\n[ C ] a large article or advertisement covering one or more pages in a newspaper or magazine: spread on The magazine recently ran a spread on Oregon beaches, mountains, hotels and restaurants.double-page spread There's a double-page spread on the latest fashions.\nMore examplesFewer examplesFood and Wine did a spread on caviar around Christmas.The advertising manager had written to confirm the booking of a double-page spread in the colour supplement for six successive weeks.\nSMART Vocabulary: related words and phrases\nNewspapers & magazines: headlines & features\nadvertorial\nadvice column\nadvice columnist\nagony aunt\nagony column\nagony uncle\ncomic strip\ncover story\ndateline\ndouble-page\ndouble-page spread\neditorial\nleader\nmasthead\nobituary\nop-ed\npersonal column\npress cutting\nproblem page\nsplash\nSee more results »\nspread noun\n(SOFT FOOD)\n[ C or U ] a soft food for putting on bread and biscuits: cheese/chocolate/fish spread There's bread and various spreads for tea.\nDiane Macdonald/Moment Open/GettyImages\nSMART Vocabulary: related words and phrases\nJams & spreads\napple butter\nconfiture\nconserve\nfilling\ngianduja\ngolden syrup\nhoney\njelly\nlekvar\nlemon butter\nlemon curd\nmanuka\nmarmalade\nmembrillo\nnut butter\npaste\nPB&amp;J\npeanut butter\npreserve\nquince paste\nSee more results »\nspread noun\n(LAND)\n[ C ] US a\nranch or other large area of land or water\nSMART Vocabulary: related words and phrases\nFarms & ranches\ncollective farm\ncroft\ndairy farm\ndairyman\nfarm\nfarmhouse\nfarmstead\nfish farm\ngrange\nhomestead\nkibbutz\nmarket garden\nnon-cultivated\nnon-farm\nranch\nsmallholding\nstation\nsuperfarm\ntruck farm\ntruck farming\nSee more results »\nspread noun\n(MEAL)\n[ C ] UK old-fashioned or US a meal, especially one for a special occasion with a lot of different dishes arranged on a table: lay on a spread Sheila laid on (= made) a magnificent spread for us. Synonyms\nbanquet\nfeast (FOOD)\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea\ntea party\nteatime\nSee more results »\nspread noun\n(DIFFERENCE)\n[ C ] the difference between two amounts, such as two prices or interest rates: The issue was priced at a spread of 115 basis points above Treasury bonds.\nSMART Vocabulary: related words and phrases\nDifferent and difference\naltered\nalternative\nanomalous\nanother\nanything\ndisparity\ndissimilar\ndissimilarly\ndissimilitude\ndistinct\nnon-comparability\nnon-comparable\nnon-congruent\nnon-identical\nnon-typical\nunrepresentativeness\nunstandardized\nuntraditional\nuntraditionally\nuntypical\nSee more results »\nspread verb [I/T]\n(COVER)\nAdd to word list\nAdd to word list\npast tense and past participle spread to cover or cause something to cover an object or an area: [ T ] Pianist Eubie Blake could spread his fingers over 20 keys. [ M ] She spread out the tablecloth. [ I ] I had toast spread with strawberry jam. [ I ] A strange look spread over his face.\nspread verb [I/T]\n(MOVE)\nto move from one place to another, or to cause something to move or be communicated: [ I ] The flames quickly spread to the next room. [ I ] Obesity is spreading in many countries. [ I ] Doctors fear the cancer may spread to other organs. [ T ] She’s been spreading lies about him. [ T ] Neighbors have been spreading the word (= communicating information) about the proposed building project. Idiom\nspread yourself (too) thinPhrasal verbs\nspread something out (over something)\nspread out\nspread noun\n(MOVEMENT)\n[ U ] the process of moving to cover a larger area or to affect a larger number of people: Jazz records fostered the spread of American culture. More should be done to stop the spread of this disease.\nspread noun\n(COVER)\n[ C ] A spread is a cover for a bed.\n[ C ] A spread is also a soft food put on bread or other food: a cheese spread\n[ C ] A spread is also a meal, esp. one with a lot of different foods arranged on a table: This is quite a spread.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; STOCK MARKET, FINANCE the difference between a trader’s buying price and selling price for particular shares, currencies, etc. See also\nagio\nbid-offer spread\n[ C ]\n&#160; FINANCE the difference between two interest rates : a spread of sth The issue was priced at a spread of 115 basis points above Treasury bonds.\n[ S ] a number of different things or people: If you do not need immediate access to your money, why not diversify into a wider spread of investments? a geographic/demographic spread\n[ S or U ] an increase in effect or influence, so that something affects more people or places: the spread of sth Corporations have a crucial influence on the global spread of a homogenized culture.\n[ S ] the different areas or numbers of people that are affected by something: Given the size and spread of the American economy, the whole world has an economic interest in the US.\n[ C ]\n&#160; MARKETING, COMMUNICATIONS an advertisement or article in a newspaper or magazine that covers two pages that are opposite each other: a double-page spreada spread on sth A magazine for Japanese businesspeople recently did a spread on the resort.\nSee also\nyield spread\n[ I or T ] to affect more people or different areas, or to make something do this: In the fall of 2007, the subprime lending crisis really began to spread. High oil prices can spread inflation throughout the economy if companies decide to boost the prices of many other goods and services.spread through/across/around sth A recruitment crisis is currently spreading through the public sector.spread to Job cuts are spreading to big manufacturers.\n[ T ] to share something among a group of people or things, so that no one person or thing has too much: spread the costs/risks/load Include different types of income-yielding investments in your portfolio in order to spread the risk.\n[ I or T ] to cover a particular area or a number of different areas, or to make something or someone do this: be spread over/throughout/across sth The company employs 2,100 people spread over five locations.\nspread payments/repayments/costs\nFINANCE to make regular payments towards the total cost of something, usually for a period of months or years: Repayments can be spread over two years.\nspread the word/message\nto tell other people about something, especially something new, and say whether you think it is good or bad: Satisfied customers who spread the word play a big part in establishing the reputation of a brand."}