{"id":341672,"name":"spritz","type":"verb","us_sound":"sprɪts","us_link":"../audio/s/usspond028.mp3","uk_sound":"sprɪts","uk_link":"../audio/s/uksprin008.mp3","content":"Add to word list\nAdd to word list\nto spray a mass of very small drops of liquid out of a container, usually by pressing a part of the container: She spritzed perfume on the insides of her wrists. After you've applied your powder, spritz with a little mineral water.\nMore examplesFewer examplesFirst, spritz the roots of the hair with a volumizing spray.If your curls have lost their bounce, spritz them with water.Just spritz a few squirts of nasal spray up each nostril.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nspritz noun [C]\n(AMOUNT OF LIQUID)\nan amount of liquid that is sprayed as a mass of very small drops of liquid out of a container, usually by pressing a part of the container: A quick spritz of scent and I'm ready. Add a spritz of hairspray for control.\nMore examplesFewer examplesUse just a spritz of cooking spray.A spritz of perfume would be enough to set off her morning sickness.A light spritz of hairspray will help your hair to hold its shape.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nspritz noun [C]\n(DRINK)\na drink consisting of sparkling wine (= with bubbles) mixed with a bitter-tasting liqueur (= a strong alcoholic drink), and sparkling water: Visit one of the many wine bars where you can drink a spritz – a typical Venetian aperitif.\nMore examplesFewer examplesThe hot spot for meeting with friends over a spritz or glass of vino rosso is the tiny Marq bar in Campo Battisti.She orders a spritz and watches the world go by.The spritz is one of the most popular apéritifs in Italy, and it’s as tasty as it is refreshing. Each of these drinks comes with a different twist on the great classic cocktail the Spritz.\nSMART Vocabulary: related words and phrases\nCocktails\nBloody Mary\nBuck's Fizz\ncaipirinha\ncocktail\ncosmopolitan\ngimlet\nhighball\njulep\nkir\nmanhattan\nmint julep\nmixology\nmocktail\nmojito\norgeat\nshaker\nshrub\nspritzer\nswizzle\nswizzle stick\nSee more results »"}