{"id":341888,"name":"squabble","type":"noun","us_sound":"ˈskwɑː.bəl","us_link":"../audio/s/squabble.mp3","uk_sound":"ˈskwɒb.əl","uk_link":"../audio/s/uksquab001.mp3","content":"Add to word list\nAdd to word list\nan argument over something that is not important: Polly and Susie were having a squabble about who was going to hold the dog's lead. Often relationships between family members are so strained that squabbles break out. Synonyms\nspat\ntiff informal\nThesaurus: synonyms, antonyms, and examples\nan argumentargumentI don't want to get into an argument with you about this.disagreementThere was a disagreement over who should pay the bill.quarrelThere were bitter quarrels between the two neighbours.rowUK My parents had a row about money.squabbleI'm always dealing with squabbles between the children.tiffShe had a tiff with her boyfriend last night.\nSee more results »\nMore examplesFewer examplesThere is any easy way to end their family squabble.Parents often try to avoid squabbles by playing games with their children.He settles the squabble over the word game by disqualifying the word \"jader\".\nSMART Vocabulary: related words and phrases\nArguments & disagreements\nargument\nbe (on) non-speakers idiom\nbelligerence\nbickering\nblow (someone/something) up\nbust up\nclash\nconflict\ncontentiousness\ncontretemps\nding-dong\ndisagreement\ndispute\ndust-up\nhostility\nkerfuffle\nlogjam\nmisunderstanding\npersonality clash\nspat\nSee more results »\nto argue over something that is not important: When small children are tired they are more likely to squabble with each other. They are still squabbling over who will get the big office.\nThesaurus: synonyms, antonyms, and examples\nto argue with someoneargueThe kids are always arguing about something.have an argumentI had an argument with my sister.fightThe two sides continue to fight over control of the assembly.quarrelStop quarrelling, you two!rowUK My parents were always rowing about money.squabbleThey are still squabbling over who will get the big office.\nSee more results »\nMore examplesFewer examplesThe children have been squabbling all morning.The couple spent most of their time squabbling among themselves.They are squabbling about how to use the money.\nSMART Vocabulary: related words and phrases\nArguing & disagreeing\nagent provocateur\nalienate\nalienated\nalienation\nargue with someone\nargumentatively\nbandy\nbet\nbone\nconflict\ncross swords idiom\nhammer\npiggy in the middle\nprovocateur\nquarrel\nsays who? idiom\nset someone against someone\nshadowbox\nshadowboxing\nthrow\nSee more results »\nAdd to word list\nAdd to word list\na disagreement, often about an unimportant matter: family squabbles with your brothers and sisters squabble verb [ I ] us\nYour browser doesn't support HTML5 audio\n/ˈskwɑb·əl/\nThey squabbled about how the money would be spent."}