{"id":342117,"name":"squawk","type":"verb","us_sound":"skwɑːk","us_link":"../audio/s/squawk.mp3","uk_sound":"skwɔːk","uk_link":"../audio/s/uksquab020.mp3","content":"Add to word list\nAdd to word list\n(of a bird) to make an unpleasantly loud, sharp noise: As the fox came into the yard, the chickens began squawking in alarm.\nto shout, scream, or cry in a loud, unpleasant way: The baby never stopped squawking all night.\ninformal disapproving to complain about something noisily: Environmental groups have been squawking about the decision to build the motorway through a forest.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nclip-clop\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShouting & screaming\nComplaining\nan unpleasantly loud, sharp noise made by a bird: The owl flew off with a squawk. I peered up through the leaves but a piercing squawk warned me away.\na loud and unpleasant shout, scream, cry, etc.: He emitted strange and inappropriate high-pitched squawks of laughter throughout the performance.\ninformal disapproving a noisy complaint about something: We may expect the usual squawks about how we're selling our national treasures to foreigners.\nMore examplesFewer examplesThe bird fought to free itself in a rustle of feathers and squawks.The silence was broken only by the occasional squawk from the baby.This decision may cause some squawks.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nclip-clop\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\nsqueal\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShouting & screaming\nComplaining\nAdd to word list\nAdd to word list\nto make a loud, unpleasant cry: Sea gulls squawked overhead.\ninfml Someone who squawks about something complains about it in a way that gets attention: Employers have begun to squawk because of rising health insurance costs. squawk noun [ C ] us\nYour browser doesn't support HTML5 audio\n/skwɔk/\nThe owl flew off with a squawk."}