{"id":342024,"name":"square","type":"noun","us_sound":"skwer","us_link":"../audio/s/square.mp3","uk_sound":"skweər","uk_link":"../audio/s/uksquab010.mp3","content":"square noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\nA2 a flat shape with four sides of equal length and four angles of 90°: First draw a square. It's a square-shaped room.\nIgor Zakowski/iStock/Getty Images Plus/GettyImages\nA2 any square-shaped object: When cooled, cut the chocolate brownies into squares.\nA2 an area of approximately square-shaped land in a city or a town, often including the buildings that surround it: Are they still living at 6 Eaton Square? A band were playing in the town square.\n© Marco Bottigelli/Moment/GettyImages\na particular space on a board used for playing games: She moved her castle forward three squares.\nkiruk/iStock/Getty Images Plus/GettyImages\nUS a tool for drawing or testing a right angle\nWolv/E+/GettyImages\nMore examplesFewer examplesCut the pastry into a square and turn in the corners.A square is a regular quadrilateral.A square has four right angles.Just before midnight, the square filled up with drunken revellers.In the square in front of the hotel stands a monument to all the people killed in the war.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncongruently\nconic\ncrescent\ncylindrically\novoid\npolyhedron\npolytope\nprism\npyramid\nquadrilateral\nrectangle\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nthree-dimensional\ntrapezoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nRoads: urban & residential streets\nBoard games\nGeometrical & mathematical instruments\nsquare noun [C]\n(BORING PERSON)\nold-fashioned informal a boring person who does not like new and exciting ideas: He's a bit of a square.\nSMART Vocabulary: related words and phrases\nPeople who are boring and old-fashioned\nbuzzkill\nColonel Blimp\ncrashing bore\ndinosaur\ndrip\nfogey\nfuddy-duddy\nfun sponge\nhas-been\nkilljoy\nLuddite\nparty pooper\nsad-sack\nsaddo\nspod\nspoilsport\nuncharismatic\nuntrendy\nwet blanket\nyawn\nSee more results »\nsquare noun [C]\n(MULTIPLY)\nthe result of multiplying a number by itself: The square of 7 is 49.\nSMART Vocabulary: related words and phrases\nTerms for numbers\nadditive inverse\naliquot\ncommon denominator\ncommon factor\ncommon multiple\nexponent\nfold\nfortyfold\nfourfold\nGCF\nhundredfold\nimaginary number\nreciprocal\nrecurring\nrecurring number\nremainder\nresponse variable\ntwentyfold\ntwofold\nweighting\nSee more results »\nIdiom\ngo/be back to square one\nsquare adjective\n(SHAPE)\nA2 having the shape of a square: The recipe recommends that you use a square cake tin. He's got that square-jawed masculinity that a lot of women seem to find attractive.\n(written abbreviation sq.); (symbol 2) used with units of measurement of length to express the total size of an area: The floor is 3 m wide by 5 m long, so its total area is 15 sq m. The city itself covers 13 square miles. Ensure that the exposed area is less than 2 cm2.\nSquare is used immediately after measurements of length when expressing the length of the four sides of a square-shaped area: So you want carpet for a room that's eight metres square (= eight metres long and eight metres wide).\nMore examplesFewer examplesIt's a square room.He has a very square face.She was wearing a square pendant around her neck.We've bought a square table for the dining room.She drew a square shape on the paper.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncongruently\nconic\ncrescent\ncylindrically\novoid\npolyhedron\npolytope\nprism\npyramid\nquadrilateral\nrectangle\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nthree-dimensional\ntrapezoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasurements of length & distance\nMass, area, weight & volume in general\nsquare adjective\n(EQUAL)\ninformal equal or level: Could you stand back from these shelves and tell me if they're square (= level)? (all) square informal\nIf two people are all square, one of them has paid off a debt to the other and neither now owes or is owed any money: If you give me £25, I think we'll be all square. You paid for the meal, so we're all square now. Just one more payment to go, then we'll be all square. Are we all square, or do I still owe you for the work you did on Friday? Once Rob had given Joe the money from the logs, they were all square.\nmainly UK If two teams or players are (all) square, they have an equal number of goals or points: They're all square at 30 points each. When they reached the last tee, the match was all square. We were all square with just three more holes to play. At the end of the first day, Britain and France were all square. Torquay and Plymouth ended all square at 1-1.\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nflush\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nsteady\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nWinning, losing & scoring in sport\nsquare adjective\n(STRAIGHT)\nin a straight line\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nsquare adjective\n(BORING PERSON)\nold-fashioned informal used to describe a person who is boring and does not like new and exciting things: Do you think my new haircut makes me look a bit square?\nSMART Vocabulary: related words and phrases\nTedious and uninspiring\nanonymous\nbanal\nbanally\nbasic\nbe (as) dull as ditchwater idiom\nmarginal\nmarmoreal\nmeh\nmenial\nmenially\nspinach\nstaid\nstaidly\nstale\nstaleness\nwatch paint dry idiom\nwatch the clock idiom\nwearisome\nwearisomely\nwell worn\nSee more results »\nIdiom\nsquare peg (in a round hole)\nsquare verb\n(MULTIPLY)\n[ T ] to multiply a number by itself: 10 squared equals a hundred. 42 means four squared, and equals 16.\nSMART Vocabulary: related words and phrases\nAddition, subtraction, multiplication & division\nadd\nadd (something) up\naddition sign\nadditive\narithmetical\ndeduction\nhalf\nhalve\nhighest common factor\nlong division\npower\nquadruply\nquintuple\nquotient\nrecursion\nround something down\nsubtraction sign\ntable\ntimes\ntreble\nSee more results »\nsquare verb\n(SHAPE)\nsquare your shoulders\nto pull your shoulders up and back because you feel determined to do something: He squared his shoulders and took a deep breath before diving into the pool.\nSMART Vocabulary: related words and phrases\nGestures & gesturing\nair punch\nair quotes\nbeckon\nbird\nblow someone a kiss phrase\nflip someone off\nflourish\ngesticulate\ngesticulation\ngesture\nnon-verbally\npeace sign\npump someone's hand idiom\nshake\nshrug\nsigning\nsnap\nsnap your fingers idiom\ntongue\nwink\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStrong-willed\nIdioms\nsquare the accounts/books\nsquare the circlePhrasal verbs\nsquare something/someone away\nsquare off\nsquare up\nsquare something up\nsquare up to someone/something\nsquare (something) with something\nsquare noun [C]\n(SHAPE)\nAdd to word list\nAdd to word list\ngeometry a flat shape with four sides of equal length and four angles of 90°, or an area or object having this shape\nsquare noun [C]\n(PLACE)\na small area of open land in a city or town, often one in the shape of a square\nsquare noun [C]\n(PERSON)\ndated slang a person who is old-fashioned\nsquare noun [C]\n(RESULT OF MULTIPLYING)\nthe result of multiplying a number by itself: The square of 7 is 49.\nsquare adjective [-er/-est only]\n(EQUAL)\nhaving all debts paid or other matters arranged fairly: I paid last time, so if you pay now, we’re square. square deal\nA square deal is a fair agreement: All I want is a square deal.\nsquare adjective [-er/-est only]\n(SHAPE)\nhaving four sides of equal length and four angles of 90°: They set up the square card tables for the bridge players.\n(abbreviation sq) A square unit of measurement is an area that is a particular distance wide and the same distance long: The box was three feet square. The correct figure is 900 sq miles.\nsquare verb [T]\n(MULTIPLY)\nmathematics to multiply a number by itself: Ten squared equals a hundred. Phrasal verbs\nsquare something with something\nsquare away something/someone\nsquare off\nAdd to word list\nAdd to word list\nMEASURES, PROPERTY used before units of measurement to describe the size of an area, especially an area of land. An area of 100 square metres is equal in size to 100 squares with sides that are 1 metre long: 100 square metres/kilometres/miles, etc. About 81,000 square metres of office space is due to be completed in the City this year.100 square feet/foot/inches, etc. The house has 3 bedrooms and 2 bathrooms in about 4,700 square feet. New Jersey has an average of well over 1,000 people per square mile. Permeable concrete costs about $9 per square foot.\n[ after noun ]\n&#160; MEASURES used after units of measurement to describe the size of an area. An area of 10 metres square is equal in size to a square with sides that are 10 metres long, or equal to 100 square metres: 10 metres/feet/foot, etc. square We will deliver items to a maximum size of three feet square.10 miles/kilometres, etc. square The city has a population of 1 million crammed into an area only a few miles square.\nbe (all) square\nto be in a situation in which everyone or everything is equal and no one has an advantage over anyone else: Dealers claim that after Wednesday's bout of profit-taking, the market is 'all square' again.\nif people are all square, all debts between them have been paid and no one owes or is owed any money: If I give you another $5, then we're all square.\nthe result of multiplying a number by itself: The square of 7 is 49.\nbe back to square one informal\nto not have made any progress after trying to succeed or achieve something: While congestion charging had an initial impact, many cities are almost back to square one in terms of traffic volumes. See also\nmarket square\n[ T ]\n&#160; FINANCE to reach an agreement with someone: square sth with sb The company's full-year results will be postponed until it has squared a new agreement with its lenders. A state-owned bank had to be brought in, in order to square the deal.\n[ I ] (also square up) if two things that should be the same do not square, they seem different or show different results: A Superior Court judge ruled that the tape and the officers' reports \"didn't square\".\nsquare the books\nACCOUNTING to make sure that you have paid all the money you owe, or that you have received all the money that other people owe you: Currency traders are squaring their books ahead of the long holiday weekend.\nsquare the circle\nto solve a very difficult situation or problem: He will have to square the circle of how to sell at current prices while cutting the cost of production to make a profit. Phrasal verbs\nsquare sth away\nsquare off\nsquare up\nsquare up to sb/sth\nsquare with"}