{"id":342180,"name":"squeeze","type":"verb","us_sound":"skwiːz","us_link":"../audio/s/squeeze.mp3","uk_sound":"skwiːz","uk_link":"../audio/s/uksquab029.mp3","content":"squeeze verb\n(PRESS)\nAdd to word list\nAdd to word list\nB2 [ T ] to press something firmly, especially from all sides in order to change its shape, reduce its size, or remove liquid from it: Cut the lemon in half and squeeze the juice into the bowl. As she waited to go into the exam, he squeezed her hand (= pressed it affectionately with his hand) and wished her good luck. Once he had finished cleaning the floor, he squeezed the cloth out. He reloaded the gun, took aim, and then squeezed (= pulled back) the trigger.figurative The studio is using all sorts of marketing tricks to squeeze as much profit from the movie as they can.\nThesaurus: synonyms, antonyms, and examples\nto remove liquid from somethingdryCan you dry the dishes for me?dry something upCan you dry up the plates for me?dry (someone/something) offLet me dry the chairs off before you sit down. blotI blotted the spilled wine with a cloth.towelShe stepped out of the pool and towelled her hair.\nSee more results »\n[ T ] to give someone a quick, tight hug (= an act of holding someone close to your body with your arms): She squeezed him tight and kissed him on both cheeks. \"Oh, Andrew,\" she said, as she squeezed him in her tight embrace.\nMore examplesFewer examplesfreshly squeezed orangeHe squeezed some sauce out of the tube.She squeezed his hand and said goodbye.He squeezed Chuck's forearm and then glanced at his younger son.She squeezed her eyes shut for a second.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing affection\nsqueeze verb\n(MOVE)\nC1 [ I + adv/prep ] to get in, through, under, etc. with difficulty: She squeezed through the crowd and found a seat at the front. They managed to squeeze under the fence and get into the festival without paying.\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhalting\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nstumblingly\nteeter\ntoddle\ntoil\ntotter\ntumble\nSee more results »\nsqueeze verb\n(BADLY AFFECT)\n[ T ] If you are squeezed by financial demands, they cause you financial problems: Small businesses are being squeezed by heavy taxation.\nIdiom\nsqueeze someone dryPhrasal verbs\nsqueeze (someone/something) in/squeeze (someone/something) into something\nsqueeze someone/something in\nsqueeze something out of someone\nsqueeze noun\n(PRESS)\n[ C ] the act of pressing something firmly: She gave the present a quick squeeze and tried to guess what was inside. Garnish the fish with some fresh parsley and a squeeze of lemon.\n[ C ] a short, tight hug (= an act of holding someone close to your body with your arms): She hugged him in a gentle squeeze. He gave his daughter one last squeeze and jumped onto the train.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompact\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing affection\nsqueeze noun\n(LIMIT)\n[ C usually singular ] a reduction or limit: The squeeze on profits in the oil industry has led to thousands of redundancies. The squeeze on local spending means that many services will have to be cut.\n[ C usually singular ] a period in which the supply of money is limited by the government because of economic difficulties: The government has imposed a sharp credit squeeze in an attempt to hold down inflation.\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstraitly\nstranglehold\nstunt\nsuffocatingly\ntempered\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nsqueeze noun\n(SPACE)\n[ S ] a situation in which people or things are pushed or forced into a small space: I can give you a lift, but it'll be a tight squeeze as I'm taking four other people as well.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nround\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nsqueeze noun\n(GIRLFRIEND/BOYFRIEND)\n[ C usually singular ] informal someone's girlfriend or boyfriend: She turned up arm in arm with her latest squeeze. She was never his squeeze, only his business partner.\nsqueeze verb\n(PRESS TOGETHER)\nAdd to word list\nAdd to word list\n[ T ] to press something firmly, or to force something out, esp. a liquid, by pressing: Bake for 15 minutes, then squeeze the cloves to get the softened garlic out. I squeezed her shoulder (= pressed it affectionately with a hand).\nsqueeze verb\n(FORCE INTO)\n[ always + adv/prep ] to force someone or something into a small space or a short period of time: [ I ] I’m just not able to squeeze into last year’s swimsuit. [ T ] She’s asking me to squeeze a shopping trip into my day off. [ M ] You can squeeze in six people at the table. Phrasal verb\nsqueeze something out of someone/something\nsqueeze noun\n(PRESSING TOGETHER)\n[ C ] the act of pressing something firmly: I gave his shoulder a squeeze. fig. State parks will feel the squeeze from budget cuts (= the cuts will have a limiting effect).\nsqueeze noun\n(FORCING INTO A SPACE)\n[ C usually sing ] the act of forcing someone or something into a small space, often by pushing or pressing: It’ll be a tight squeeze with four other people in the car, but I’ll give you a lift.\nAdd to word list\nAdd to word list\nto reduce the amount of money that a person, company, or government can spend or earn: Higher energy and utility bills are squeezing disposable incomes. squeeze profits/budgets/marginssqueeze taxpayers/consumers/borrowers Rising food prices continue to squeeze consumers ever harder.\nto reduce the number of things that are produced or sold: squeeze supplies/exports European exports have been squeezed by the cheap dollar and equally cheap Chinese yuan. Phrasal verbs\nsqueeze sb/sth out\nsqueeze sth out of/from sth/sb\na large reduction in the amount of money that a person, company, or government can spend or earn: a budget/spending/cash squeeze Hard choices have to be made during a budget squeeze. an economic/financial/monetary squeezea squeeze on sth A squeeze on earnings is expected to be highlighted in official labour market figures this week.put a/the squeeze on sb/sth Competition from discount operations is putting the squeeze on mid-market chains.a squeeze in margins/markets/profits A squeeze in the global credit market has forced the company to scrap plans to sell its US drinks division.feel/face a squeeze A series of reports last week suggests that financial institutions will feel the squeeze on their balance sheets well into next year. See also\ncredit squeeze\nprofit squeeze"}