{"id":342187,"name":"squeezing","type":"verb","us_sound":"skwiːz","us_link":"../audio/s/squeeze.mp3","uk_sound":"skwiːz","uk_link":"../audio/s/uksquab029.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsqueeze\nsqueeze verb\n(PRESS)\nB2 [ T ] to press something firmly, especially from all sides in order to change its shape, reduce its size, or remove liquid from it: Cut the lemon in half and squeeze the juice into the bowl. As she waited to go into the exam, he squeezed her hand (= pressed it affectionately with his hand) and wished her good luck. Once he had finished cleaning the floor, he squeezed the cloth out. He reloaded the gun, took aim, and then squeezed (= pulled back) the trigger.figurative The studio is using all sorts of marketing tricks to squeeze as much profit from the movie as they can.\n[ T ] to give someone a quick, tight hug (= an act of holding someone close to your body with your arms): She squeezed him tight and kissed him on both cheeks. \"Oh, Andrew,\" she said, as she squeezed him in her tight embrace.\nMore examplesFewer examplesfreshly squeezed orangeHe squeezed some sauce out of the tube.She squeezed his hand and said goodbye.He squeezed Chuck's forearm and then glanced at his younger son.She squeezed her eyes shut for a second.\nSMART Vocabulary: related words and phrases\nSqueezing and grinding\ncompression\ncompressive\nconcertina\nconstrict\nconstriction\ngnash your teeth idiom\nmash\nmill\nnip\nnoncompressible\npinch\npound\npresser\npulp\nsnap\nsquash\nsquinch\nsquish\ntamp\nunmilled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing affection\nsqueeze verb\n(MOVE)\nC1 [ I + adv/prep ] to get in, through, under, etc. with difficulty: She squeezed through the crowd and found a seat at the front. They managed to squeeze under the fence and get into the festival without paying.\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhalting\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nsqueeze\nstumblingly\nteeter\ntoddle\ntoil\ntotter\ntumble\nSee more results »\nsqueeze verb\n(BADLY AFFECT)\n[ T ] If you are squeezed by financial demands, they cause you financial problems: Small businesses are being squeezed by heavy taxation. Idiom\nsqueeze someone dryPhrasal verbs\nsqueeze (someone/something) in/squeeze (someone/something) into something\nsqueeze someone/something in\nsqueeze something out of someone"}