{"id":342154,"name":"squeal","type":"verb","us_sound":"skwiːl","us_link":"../audio/s/squeal.mp3","uk_sound":"skwiːl","uk_link":"../audio/s/uksquab024.mp3","content":"Add to word list\nAdd to word list\nto make a long, very high sound or cry: We could hear the piglets squealing as we entered the farmyard. The brakes squealed as the van rounded the corner. The two children squealed with joy.\ninformal to complain about something loudly: The threat of further changes in the education system is making teachers squeal.\nslang disapproving to give information to the police about people you know who have committed a crime: When he finds out who squealed on him, he's going to make them very sorry.\nSMART Vocabulary: related words and phrases\nShouting & screaming\nbarracking\nbawl\nbellow\nbray\nburst\nburst out\ncall (something) out\nclamour\ncry\ncry out\nejaculate\ngive someone a shout idiom\nholler\nhowl\nraise\nshout\nshouty\nsquawk\nthe hairdryer treatment\nthunder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplaining\nRevealing secrets & becoming known\na long, very high sound or cry: Erik collapsed into giggles and squeals as Penny began tickling him. The train ground to a halt with a squeal of brakes.\nSMART Vocabulary: related words and phrases\nAnimal (non-human) sounds\nbarky\nbray\nbuzzy\ncaterwauling\nchatter\ncheep\nchirp\nclip-clop\ncockcrow\ncoo\nhonk\nmiaow\nmoo\npurr\nroar\ntrill\ntrumpet\ntu-whit tu-whoo\nwarble\nwhinny\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShouting & screaming\nsqueal verb\n(MAKE SOUND)\nAdd to word list\nAdd to word list\n[ I/T ] to make a long, very high sound or cry: [ I ] The tires squealed as I sped away. [ T ] \"This is awesome,\" Mary Lou squealed in her coach’s ear.\nsqueal verb\n(GIVE INFORMATION)\n[ I ] slang to give the authorities information about people you know who have committed crimes or done something wrong: He refused to squeal on his buddies.\na long, very high sound or cry: She collapsed into giggles and squeals when her sister tickled her."}