{"id":342337,"name":"squirm","type":"verb","us_sound":"skwɝːm","us_link":"../audio/s/squirm.mp3","uk_sound":"skwɜːm","uk_link":"../audio/s/uksquee015.mp3","content":"Add to word list\nAdd to word list\nto move from side to side in an awkward way, sometimes because of nervousness, embarrassment, or pain: Nobody spoke for at least five minutes and Rachel squirmed in her chair with embarrassment. The fish squirmed on the ground for a few moments and then lay still. Synonyms\ntwist\nwriggle\nwrithe\nto feel nervous or embarrassed about something: Sal would occasionally squirm at his parents' behaviour.\nMore examplesFewer examplesShe began to fidget and squirm, unable to find a comfortable position.If your child squirms and fusses when you start unfolding the stroller, let him walk.At first, she squirmed at the thought of touching the scaly animal.Some industry watchers squirm about the trend because of its elitist implications.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nshudder\ntoss\ntremulous\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAshamed and embarrassed\nAnxious and worried\na side to side, awkward movement, sometimes made because of nervousness, embarrassment, or pain: His squirms of discomfort were hilarious to watch. The hugs produce squirms, laughter, and cries from the little children.\nMore examplesFewer examples\"She wanted to kiss me,\" he said with a squirm.The worm gave a little squirm.Only the slightest squirm betrayed his desire to back away.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchoppily\nchoppiness\nconvulse\nconvulsion\nflick\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nshudder\ntoss\ntremulous\nwhip\nSee more results »\nAdd to word list\nAdd to word list\nto make twisting movements with the body, esp. because of embarrassment, pain, or excitement: The kids squirmed in their chairs."}