{"id":342465,"name":"stable","type":"adjective","us_sound":"ˈsteɪ.bəl","us_link":"../audio/s/stable.mp3","uk_sound":"ˈsteɪ.bəl","uk_link":"../audio/s/ukstabl001.mp3","content":"Add to word list\nAdd to word list\nC1 firmly fixed or not likely to move or change: If the foundations of the house aren't stable, collapse is possible. After several part-time jobs, he's now got a stable job in a bank. The hospital said she was in a stable condition (= not likely to get worse) following the operation.\nC1 A stable person is mentally healthy: She seems more stable these days.\nchemistry\n&#160; specialized A stable substance keeps the same chemical or atomic state.\nMore examplesFewer examplesThe economy is fairly stable.House prices have been reasonably stable these past few years.Most children need the security of a stable family life.He's been taken to hospital where his condition is described as serious but stable.I'm just happy to see him in a stable relationship.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\nstability\nstabilization\nstabilize\nstably\nstay\nunreformed\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalm and relaxed\nChemistry: types of chemical\nC2 a building in which horses are kept\nJuan Silva/DigitalVision/GettyImages\na group of racehorses that are owned or trained by one person\na group of people who perform a similar activity and who are trained by the same person or employed by the same organization: During the 1950s, Sun Records' stable of singers included Johnny Cash and Jerry Lee Lewis.\nSMART Vocabulary: related words and phrases\nAnimal dwellings - man-made\nanimal shelter\napiary\naviary\nbee house\nbeehive\nbird box\nbullpen\ncowshed\ncrate\ndoghouse\ndovecote\nfish tank\nhive\nnesting box\nperch\npigeon loft\npigpen\npigsty\nrabbit hutch\nsty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnimal groupings\nHorse racing\nGroups of people\nto keep a horse in a stable\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nshear\nsheep shearing\nsheepdog\nshepherd\nslaughter\nsubtherapeutic\nteaser\nSee more results »\nstable adjective\n(FIXED)\nAdd to word list\nAdd to word list\nfirmly fixed or not likely to move or change: Don’t climb the ladder until you’re sure it’s stable. She’s in the hospital in stable condition. The country needs a stable government that is free of corruption.\nstable noun [C]\n(BUILDING)\na building in which horses or cattle are kept: The horses in the stable have plenty of straw.\nAdd to word list\nAdd to word list\nECONOMICS, POLITICS a stable economy, country, system, etc. is able to continue in a regular and successful way without unexpected changes: a stable economy/country/government financially/economically/politically stable The company must now focus on operating a more efficient and stable supply chain.stable jobs/employment A proposed merger has resulted in key staff quitting in order to find more stable jobs.\nECONOMICS, FINANCE stable prices or rates do not change much: stable prices/currencies/rates The mortgage rate cut created more stable house prices. The rouble is stable and public finances are looking remarkably healthy.remain/stay stable We have experienced high growth recently, with the unemployment rate remaining extremely stable at 2.9%."}