{"id":342434,"name":"stab","type":"verb","us_sound":"stæb","us_link":"../audio/s/stab.mp3","uk_sound":"stæb","uk_link":"../audio/s/uksquee025.mp3","content":"Add to word list\nAdd to word list\nB2 [ T ] to injure someone with a sharp pointed object such as a knife: She was stabbed several times in the chest. He was jailed for 15 years for stabbing his wife to death.\nThesaurus: synonyms, antonyms, and examples\nto hurt someone physicallyhurtI hurt my arm climbing over the fence.injureThe bomb killed ten people and injured many more.woundHe was wounded so badly in the attack that doctors said he might never walk again.maimThe atrocities have killed or maimed thousands of people.tortureThe guards were accused of torturing prisoners.stabHe was fatally stabbed with a kitchen knife.\nSee more results »\n[ I or T ] to make a short, forceful pushing movement with a finger or a long, thin object: As she spoke she stabbed the air with her finger. He stabbed at the meat with his fork.\nMore examplesFewer examplesHe pulled a knife and stabbed her.Mercutio, fatally stabbed, staggers round the stage in his death throes.In a fit of insane jealousy he tried to stab her.She was stabbed twelve times and left for dead.He'd been stabbed several times and his throat cut.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshearing\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPushing and shoving\nIdiom\nstab someone in the back\nthe act of pushing a knife into someone, or an injury caused by stabbing: He was admitted to hospital with stab wounds.\na sudden feeling, especially an unpleasant one such as pain: She felt a stab of envy when she saw all the expensive presents Zoe had been given for Christmas.\nThesaurus: synonyms, antonyms, and examples\npainpainThere are drugs you can take to ease the pain.agonyMothers will often talk about the agony of childbirth.sorenessIf you sailed through the exercises without soreness, you can move on.acheI developed a dull ache in my jaw.discomfortSometimes receding gums can cause discomfort.stingBee stings can cause an allergic reaction in some people.\nSee more results »\nan action or remark that attacks someone's reputation: Her criticism of the company's plans was a stab at the chairman himself.\nSMART Vocabulary: related words and phrases\nCutting and stabbing\nabrasion\nbayonet\nbutcher\ncarve\ncarving\nchisel\nchop\nimpaler\nincise\njulienne\nlacerate\nlacerated\nshearing\nsheep shearing\nslash\nslice\nsliced\nslit\nsnip\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPain & painful\nFeelings - general words\nDamaging reputation\nIdiom\nhave/make a stab at something\nAdd to word list\nAdd to word list\nto injure someone using a sharp, pointed object: He was stabbed with a fork. Idiom\nstab someone in the back\nthe act of injuring someone with a sharp, pointed object: He’s recovering from stab wounds.\nA stab is also a sudden feeling: Cheri felt a sudden stab of guilt.\nA stab is also an attempt to do something that you may not be able to do: I wouldn’t even take a stab at estimating its cost."}