{"id":342459,"name":"stabilize","type":"verb","us_sound":"ˈsteɪ.bə.laɪz","us_link":"../audio/s/stabilize.mp3","uk_sound":"ˈsteɪ.bəl.aɪz","uk_link":"../audio/s/uksquee029.mp3","content":"Add to word list\nAdd to word list\n[ I ] If something stabilizes, it becomes fixed or stops changing: He suffered a second heart attack two days ago but his condition has now stabilized.\n[ T ] If you stabilize something, you cause it to become fixed or to stop changing: In China, the policy of one child per family was introduced to stabilize the country's population at 1.6 billion.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\npeg\nstability\nstabilization\nstably\nstay\nsteadfast\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nRelated word\nstabilization\nAdd to word list\nAdd to word list\nto cause something to become fixed and stop changing, esp. in order to keep it from becoming worse, or to become fixed and stop changing: [ T ] These medicines stabilize your heart rate and lower blood pressure. [ I ] Once your salary stabilizes you can start to save a little money. stabilization noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌsteɪ·bə·ləˈzeɪ·ʃən/\nstabilization of the economy\nAdd to word list\nAdd to word list\n[ I or T ]\n&#160; ECONOMICS, FINANCE if something such as an economy or system stabilizes or if something stabilizes it, it becomes able to continue in a regular and successful way without unexpected changes: A package of monetary and fiscal policies aimed at stabilizing the economy was announced yesterday. My advice to investors is to wait for markets to stabilize before buying shares. According to the report, if we do not stabilize carbon dioxide emissions before 2030, the planet's temperature will increase by as much as 6.3 degrees Fahrenheit. Industrial activity appears to have stabilized."}