{"id":342624,"name":"stagger","type":"verb","us_sound":"ˈstæɡ.ɚ","us_link":"../audio/s/stagger.mp3","uk_sound":"ˈstæɡ.ər","uk_link":"../audio/s/ukstabl017.mp3","content":"stagger verb\n(MOVE)\nAdd to word list\nAdd to word list\nC2 [ I usually + adv/prep ] to walk or move with difficulty as if you are going to fall: After he was attacked, he managed to stagger to the phone and call for help.figurative The company is staggering under a $15 million debt and will almost certainly collapse by the end of the year. Synonym\nlurch\nThesaurus: synonyms, antonyms, and examples\nto walkwalkThe baby has just learned to walk. strideShe strode purposefully up to the desk and demanded to speak to the manager.marchHe marched right in to the office and demanded to see the governor.strollWe strolled along the beach.wanderShe wandered from room to room, not sure of what she was looking for.ambleShe ambled down the street, looking in shop windows.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nstumblingly\nteeter\ntoddle\ntoil\ntotter\ntumble\nSee more results »\nstagger verb\n(SHOCK)\n[ T ] to cause someone to feel shocked or surprised because of something unexpected or very unusual happening: He staggered all his colleagues by suddenly announcing that he was leaving the company at the end of the month.\nSMART Vocabulary: related words and phrases\nMaking people sad, shocked and upset\naback\namiss\nappal\nbe laughing on the other side of your face idiom\nbite\nbum\nget to\ngnaw\nhaunt\nheartbreaker\nheartbreakingly\nnerve\nscrew (something) up\nsensitivity\nshake someone out of something\nshake someone up\nshake/rock something to its foundations idiom\nshattering\ntear\ntoxic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurprising and shocking\nstagger verb\n(ARRANGE)\n[ T ] to arrange things, especially hours of work, holidays, or events, so that they begin at different times from those of other people: Some countries have staggered school holidays so that holiday resorts do not become overcrowded.\n[ T ] If the start of a race is staggered, the competitors start at different times or in different positions.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\njournal\npack\nprogramme\nschedule\nscheduled\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAthletics\nCompeting in sport\na way of walking or moving in which you almost fall: He left the bar with a drunken stagger. Synonym\nlurch\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nstumblingly\nteeter\ntoddle\ntoil\ntotter\ntumble\nSee more results »\nstagger verb\n(MOVE)\nAdd to word list\nAdd to word list\n[ I/T ] to walk or move awkwardly, as if you have lost your balance, or to cause someone to move awkwardly or to lose his or her balance: [ T ] When he hit his head on a shelf, it momentarily staggered him. [ I ] She staggered out of bed to answer the phone.\nstagger verb\n(ARRANGE)\n[ T ] to arrange events or schedules so that they happen at different times, or to arrange objects so they are not regular: The clinics will try to stagger vaccination times to minimize waits and confusion.\nAdd to word list\nAdd to word list\nto arrange for things like holidays, working hours, or payments to happen at different times so that they are easier to manage: Utilities companies will allow customers to stagger payments when they have bills they cannot pay. Over half of American firms stagger the election of board members, so that the whole board is not replaced at once."}