{"id":342670,"name":"stagnation","type":"noun","us_sound":"stæɡˈneɪ.ʃən","us_link":"../audio/s/stagnation.mp3","uk_sound":"stæɡˈneɪ.ʃən","uk_link":"../audio/s/ukstabl023.mp3","content":"stagnation noun [U]\n(NO CHANGE)\nAdd to word list\nAdd to word list\na situation in which something stays the same and does not grow and develop: Despite more than 10 years of economic stagnation, the unemployment rate remains low. We are seeing stagnation in the market for cows and sheep.\nMore examplesFewer examplesMany Americans have experienced wage stagnation.The stagnation in student numbers between the two world wars was true of most British universities.This is not an unattainable ideal, but a goal which you must pursue in order to avoid stagnation.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\nstagnation noun [U]\n(NO MOVEMENT)\na situation in which a liquid or air does not move or flow: The black colour of the water is due to stagnation. Phlegm congestion in the lungs and chest will cause congestion and stagnation in the lymphatic system. See\nstagnate\nMore examplesFewer examplesHigh-tech equipment will allow technicians to monitor, clean, and circulate the water to prevent stagnation and maintain quality.Water stagnation occurs when water stops flowing and can be a major environmental hazard.When dairy products are eaten in excess, they tend to cause stagnation in the body.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswill\nswirl\nswirling\ntop something up\ntrickle\nSee more results »\nAdd to word list\nAdd to word list\na state in which growth or development stops: The Chancellor's policy was to expand into new markets in order to avoid economic stagnation. Berlin's real-estate market finally recovered from a long period of stagnation. price/salary stagnation"}