{"id":342708,"name":"stain","type":"verb","us_sound":"steɪn","us_link":"../audio/s/stain.mp3","uk_sound":"steɪn","uk_link":"../audio/s/ukstabl027.mp3","content":"stain verb\n(MARK)\nAdd to word list\nAdd to word list\nC2 [ I or T ] to leave a mark on something that is difficult to remove: Tomato sauce stains terribly - it's really difficult to get it out of clothes. While she was changing the wheel on her car, her coat had become stained with oil.\n[ I ] If a material stains, it absorbs substances easily, causing it to become covered with marks, or coloured by a chemical: This carpet is ideal for the kitchen because it doesn't stain easily.\n[ T ] to change the colour of something using a chemical: She stripped the floorboards and stained them dark brown.\nMore examplesFewer examplesWater and other liquids can stain unprotected wood surfaces.Lily pollen stains really badly.Red wine stains.The wood itself was light but I stained it darker.You can stain wood in different colours.\nSMART Vocabulary: related words and phrases\nMaking things dirty & untidy\nblacken\nclutter\ncontaminate\ndefile\ndirty\ndisarrange\nfoul\nmark\nmess\nmix\nmix someone/something up\nmuddle\nmuddle something up\nmuss\npollute\npolluter\nrecontaminate\nsoil\ntarnish\nthe polluter pays principle idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nColour - general words\nstain verb\n(SPOIL)\nC2 [ T ] literary to permanently spoil something such as someone's reputation: Several important politicians have had their reputations stained by this scandal. The country's history is stained with the blood of (= the country is guilty of killing) millions of innocent men and women.\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nhatchet job\nscurrilous\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslur\nsmear\ntarnish\nSee more results »\nstain noun\n(MARK)\nB1 [ C ] a dirty mark on something that is difficult to remove: a blood/grass stain You can remove a red wine stain from a carpet by sprinkling salt over it.\nThesaurus: synonyms, antonyms, and examples\na mark on somethingmarkThe backs of the chairs have left marks on the wall.stainShe had grass stains on her white jeans.smearHe had smears of tomato ketchup on his shirt.smudgeNo matter how often I wash my hands, I leave smudges all over my phone's screen.blotchHe had blotches all over his face.speckShe looked through the old camera lens and saw specks of dust.\nSee more results »\n[ C ] a chemical for changing the colour of something\nSMART Vocabulary: related words and phrases\nDirt & untidiness\nbloodstain\nclutter\ncontaminant\ncontamination\ncrud\nfleck\ngrime\ngrunge\ngunge\ngunk\nmuck\npollutant\npolluter\nscrappiness\nscruff\nshambles\nslime\nslob\nslovenliness\nsmear\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry: types of chemical\nstain noun\n(DAMAGE)\n[ S ] literary permanent damage to someone's reputation or character: His solicitor said, \"He leaves this court without a stain on his character.\"\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nhatchet job\nscurrilous\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslur\nsmear\ntarnish\nSee more results »\nAdd to word list\nAdd to word list\nto leave a mark on something that is difficult to remove, or to become colored or spoiled by a mark: [ T ] Strawberry juice stained my shirt. [ I ] This carpet is practical because it doesn’t stain easily.\nIf you stain wood, you put a substance on it that changes its color: [ T ] Instead of painting the woodwork, she stained it dark brown. stainless adjective us\nYour browser doesn't support HTML5 audio\n/ˈsteɪn·ləs/\na dirty mark on something that is difficult to remove: The tomato sauce left a stain on the tablecloth.\nA stain is also a thin, oily liquid used to change the color of wood.\nbiology A stain is also a chemical used to color cells to make them easier to see when studying them under a microscope."}