{"id":342757,"name":"stake","type":"noun","us_sound":"steɪk","us_link":"../audio/s/stake.mp3","uk_sound":"steɪk","uk_link":"../audio/s/ukstair004.mp3","content":"stake noun [C]\n(SHARE)\nAdd to word list\nAdd to word list\na share or a financial involvement in something such as a business: He holds (= owns) a 40 percent stake in/of the company. have a stake in something\nIf you have a stake in something, it is important to you because you have a personal interest or involvement in it: Employers have a stake in the training of their staff.\nMore examplesFewer examplesHe has no financial stake in the company.With a 50 percent stake in the company, it must be tempting to cash it in.Walker will retain a 30 percent stake in the business.They had planned to buy a 20 percent stake in the company.He left his wife and family a 38 percent stake in the largest store group in the world.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull\nbull market\ndead cat bounce\nequity\nfootsie\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking part and getting involved\nstake noun [C]\n(RISK)\nthe amount of money that you risk on the result of something such as a game or competition: She spent two weeks in Las Vegas playing high-stakes blackjack at the casinos. the stakes [ plural ]\nIn an activity or competition, the stakes are the reward for the person who wins or succeeds in it: The team is playing for enormous stakes - the chance to play in the final. the Stakes\nused in the names of horse races in which the prize money is provided by all the owners of the horses that are competing in the race the beauty, popularity, etc. stakes\na situation where someone is judged on how much of a particular quality they have: The prime minister is not very high in the popularity stakes (= he is not very popular) at the moment. raise/up the stakes\nto increase the prize or reward in a competition or any activity in which you are competing\nto make a situation more urgent or more difficult to ignore: The stowaways are trying to raise the stakes by refusing to eat until they are given money and aid.\nMore examplesFewer examplesI gamble occasionally, but only for small stakes.What are the stakes?\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPrizes, rewards and medals\nHorse racing\nSituations and circumstances\nIncreasing and intensifying\nstake noun [C]\n(STICK)\na strong stick or metal bar with a pointed end: The stakes are pushed or hammered into the ground and can be used for supporting a plant or forming part of a fence.\nETIENJones/iStock/Getty Images Plus/GettyImages the stake\nin the past, a wooden post to which people were tied before being burned to death as a punishment: In medieval Europe, many women were accused of being witches and were burned at the stake.\nSMART Vocabulary: related words and phrases\nPoles, rods, shafts and sticks\nbar\nbargepole\nbaton\nbilly club\nboathook\nbollard\ncane\nlathi-charge\nlightning conductor\nlitter grabber\nlitter pick\nlitter picker\nmast\npointer\nshaft\ntelegraph pole\ntelephone pole\ntent pole\ntotem pole\ntrash grabber\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDeath penalties\nIdioms\nat stake\ngo to the stake for something\npull up stakes\nstake verb [T]\n(RISK)\nto risk an amount of money: At the roulette table, he staked $10,000 on number 21.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\ngaming table\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nstake verb [T]\n(USE STICK)\nto hold up and support something by fastening it to stakes: Tomato plants should be staked.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nIdiom\nstake a claimPhrasal verbs\nstake something on something\nstake something out\nstake somewhere/something out\nstake someone to something\nstake noun [C]\n(SHARE)\nAdd to word list\nAdd to word list\na share in something, esp. a financial share in a business, or an emotional investment in something: He holds a 20% stake in the company. Parents have a large stake in their children’s education.\nIn an activity or competition, the stakes are the costs or risks involved in competing: Global competition has raised the stakes of doing business.\nstake noun [C]\n(RISK)\nthe amount of money that you risk on the result of a game or competition: Almost everyone has a stake in the global economy these days.\nstake noun [C]\n(POLE)\na thick, strong, pointed wood or metal pole pushed into the ground and used to mark a spot or to support something: Stakes in the ground marked the outline of the new building.\nIdiom\nat stake\nstake verb [T]\n(RISK)\nto risk harming or losing something important: He has talent and ambition, and I’d stake my reputation on his success.\nstake verb [T]\n(FASTEN TO POLE)\nto fasten something to a stake: Tomato plants should be staked soon after they are planted. Idiom\nstake a claim (to something)Phrasal verbs\nstake out something\nstake out something\nAdd to word list\nAdd to word list\n[ C, usually singular ]\n&#160; FINANCE the amount that someone has invested in a company, often expressed as a percentage of the total share capital (= money invested in a business in the form of shares): a 15%/3%/10%, etc. stake His 22% stake makes him the retailer's biggest shareholder.have/hold/own a stake (in sth) The Chief Executive has a controlling stake in the company worth €58m. acquire/buy/sell a stake (in sth) increase/raise/reduce a stake (in sth)\nhave a stake in sth\nif you have a stake in something, its success or failure will have an effect on you: All three officials have a personal stake in the President's re-election as it would allow them to keep their jobs.\nstakes [ plural ]\nthe amount of money you risk losing by guessing the result of something wrongly: The City continued to play for high stakes in shares of the airline.\nin a business activity, the stakes are the level of risk and possible profit involved: Given the high stakes for both hardware makers and software suppliers, neither side is likely to give up easily.\nat stake\nif something like money, a job, or someone's reputation is at stake, it is in danger of being lost because of a particular situation: The company's reputation is at stake and they need to act quickly and decisively. Up to 300 jobs are thought to be at stake at head office. See also\nequity stake\nmajority stake\nminority stake\nstake a/your claim\nto state that you have a right to something and that it should belong to you: Foreign companies across a range of sectors seek to stake a claim in China's fast-growing economy.stake a claim to/for/on sth Various countries are trying to stake their claims to the oil under the polar ice cap. Phrasal verb\nstake sth on sth"}