{"id":342811,"name":"stalinist","type":"adjective","us_sound":"ˈstɑː.lən.ɪst","us_link":"../audio/s/cdo1121usstal4056.mp3","uk_sound":"ˈstɑː.lɪn.ɪst","uk_link":"../audio/s/cdo1121ukstal4006.mp3","content":"Add to word list\nAdd to word list\nrelating to, typical of, or supporting the political, economic, and social beliefs of the former Soviet leader Joseph Stalin: He was a musician in the Soviet Union towards the end of the repressive Stalinist era. They accused him of using Stalinist methods to eliminate his political opponents. Work that did not conform to Stalinist ideology was banned from publication. Compare\nanti-Stalinist adjective\nMore examplesFewer examplesThe Party embraced the Stalinist theory of the revolution by stages.She refused to denounce the Stalinist personality cult following the dictator's death.Stalinist economic planning emphasized the development of heavy industries in urban areas.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\nNATO\noccupied\npariah\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »\na supporter of the political, economic, and social beliefs of the former Soviet leader Joseph Stalin: He was a Stalinist out of personal conviction, not because he feared for his life. Compare\nanti-Stalinist noun\nMore examplesFewer examplesFor many years the Trotskyists waged intellectual battle with the Stalinists.The film tries to show how the Marxist cause was betrayed by Stalinists during the Spanish Civil War.He denied accusing the Democratic candidate of being a Stalinist.The leader, Ho Chi Minh, was a convinced Stalinist.\nSMART Vocabulary: related words and phrases\nInternational relations: international politics & government\naccession\nallied\nAnglo-American\nanti-Stalinist\nbipolar\nconfederacy\nG20\nG7\nGATT\nGeneva Convention\ninternationalism\ninternationalize\nNATO\noccupied\npariah\nthe G8\nthe new world order\nthe North-South divide\nthe World Trade Organization\nWTO\nSee more results »"}