{"id":342832,"name":"stall","type":"noun","us_sound":"stɑːl","us_link":"../audio/s/stall.mp3","uk_sound":"stɔːl","uk_link":"../audio/s/ukstair014.mp3","content":"stall noun\n(SHOP)\nAdd to word list\nAdd to word list\nB1 [ C ] a large table or a small shop with an open front from which goods are sold in a public place: In the village market, the stalls are piled high with local vegetables.\nNigel Allison/EyeEm/GettyImages\nMore examplesFewer examplesHe runs a fruit and vegetable stall in the market.She runs a stall in the market.The stall sells drinks and snacks.The gaily striped awnings of the little shops and market stalls made an attractive scene.Some displayed their wares on stalls, while others had just spread them out on the pavement.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nstall noun\n(SMALL AREA)\n[ C ] a small closed area within a farm building in which there is space for one animal to be kept\npbombaert/Moment/GettyImages\n[ C ] a small area of a room that is separated from the main part of the room by walls or curtains: shower stall There was one bathroom with a shower stall in the corner.\nSMART Vocabulary: related words and phrases\nAnimal dwellings - man-made\nanimal shelter\napiary\naviary\nbee house\nbeehive\nbird box\nbullpen\ncowshed\ncrate\ndoghouse\ndovecote\nfish tank\nhive\nnesting box\nperch\npigeon loft\npigpen\npigsty\nrabbit hutch\nsty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: walls & parts of walls\nstall noun\n(SEATS)\nthe stalls [ plural ]\nrows of fixed seats in a church, often with the sides and backs connected: Members of the public were invited to sit in the choir stalls.\nUK (US the orchestra) the seats on the main floor of a theatre or cinema, not at a higher level: As he came onto the stage, a woman threw flowers from the stalls.\nSee more\nstall verb\n(ENGINE)\n[ I or T ] If an engine stalls, or if you stall it, it stops working suddenly and without you intending it to happen: A car may stall due to the driver braking too suddenly. I stalled the car twice during my driving test but still managed to pass.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak\nbreak down\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nstall verb\n(DELAY)\n[ I ] to delay taking action or avoid giving an answer in order to have more time to make a decision or get an advantage: stall (for time) She says she'll give me the money next week but I think she's just stalling (for time).\n[ T ] If you stall a person, you delay them or prevent them from doing something for a period of time: I managed to stall him for a few days until I'd got enough money to pay back the loan.stall someone off mainly US The thief broke into the office while his accomplice stalled off the security guard.\n[ I ] to stop making progress: Japan's economic growth has stalled, with industrial production contracting in June for the fourth straight month.\n[ T ] If you stall an event, you delay it or prevent it from making progress: Commandos stalled the enemy attack by destroying three bridges. Fears are growing that a tax increase may stall economic recovery.\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiency\ninefficiently\nkept\nkick\nkick something into the long grass idiom\npigeonhole\npush\nraincheck\nretard\nretardation\nset someone back (something)\nshelve\nsit\nspin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics\nstall verb [I/T]\n(DELAY)\nAdd to word list\nAdd to word list\nto delay or put off action: [ I ] They’re just stalling, trying to avoid making a decision. [ T ] I can stall him for a few minutes.\nstall verb [I/T]\n(STOP WORKING)\nto cause a vehicle or engine to stop suddenly, or of a vehicle or engine to stop suddenly: [ I ] My car stalled at the traffic light.\nstall noun [C]\n(AREA)\na separate area in which an animal is kept\nA stall is also a small enclosed space used for a particular purpose: The bathroom had a tiled shower stall.\nAdd to word list\nAdd to word list\n[ I or T ] if a process or system stalls or something stalls it, it suddenly stops developing or making progress: Japan's economic growth has stalled. Contract negotiations between management and the union have stalled again. I don't believe there was a deliberate plan to stall the process.\n[ I ] if someone stalls, they do not answer a question immediately or continue a discussion, in order to give themselves more time to think: \"I have to look it up on my machine at home,\" he said stalling for time.\na table or structure from which someone sells things on the street or in an outdoor market: She set up a stall at the fair to sell her jewelery. A long row of market stalls was filled with every kind of food you could imagine."}