{"id":342839,"name":"stalled","type":"verb","us_sound":"stɑːl","us_link":"../audio/s/stall.mp3","uk_sound":"stɔːl","uk_link":"../audio/s/ukstair014.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nstall\nstall verb\n(ENGINE)\n[ I or T ] If an engine stalls, or if you stall it, it stops working suddenly and without you intending it to happen: A car may stall due to the driver braking too suddenly. I stalled the car twice during my driving test but still managed to pass.\nSMART Vocabulary: related words and phrases\nMachines - not functioning\nact up\nbalky\nblooey\nbreak down\nbroken\nbrokenness\nbrownout\nburn out\ndowntime\nflat\nmalfunction\noutage\nseize up\nshort circuit\nshot\nshudder\nshut\nshut (something) down\nshut (something) off\nshutdown\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOn the road: driving & operating road vehicles\nstall verb\n(DELAY)\n[ I ] to delay taking action or avoid giving an answer in order to have more time to make a decision or get an advantage: She says she'll give me the money next week but I think she's just stalling (for time).\n[ T ] If you stall a person, you delay them or prevent them from doing something for a period of time: I managed to stall him for a few days until I'd got enough money to pay back the loan.mainly US The thief broke into the office while his accomplice stalled off the security guard.\n[ I ] to stop making progress: Japan's economic growth has stalled, with industrial production contracting in June for the fourth straight month.\n[ T ] If you stall an event, you delay it or prevent it from making progress: Commandos stalled the enemy attack by destroying three bridges. Fears are growing that a tax increase may stall economic recovery.\nSMART Vocabulary: related words and phrases\nDelaying and wasting time\nado\nbusywork\nbuy time idiom\ncarry something over\ndally\ngridlock\ninefficiency\ninefficiently\nkept\nkick\nkick something into the long grass idiom\npigeonhole\npush\nraincheck\nretard\nretardation\nset someone back (something)\nshelve\nspin\nstall\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEconomics"}