{"id":342889,"name":"stammer","type":"verb","us_sound":"ˈstæm.ɚ","us_link":"../audio/s/stammer.mp3","uk_sound":"ˈstæm.ər","uk_link":"../audio/s/ukstair022.mp3","content":"Add to word list\nAdd to word list\nto speak or say something with unusual pauses or repeated sounds, either because of speech problems or because of fear or nervousness : [ + speech ] \"Wh-when can we g-go?\" she stammered. He dialled 999 and stammered (out) his name and address. Compare\nstutter verb (SPEAK)\nbumble\nMore examplesFewer examplesI stammered a bit when I was a boy.She stammered an apology and ran out of the room.He stuttered and stammered about having a busy schedule that week.\nSMART Vocabulary: related words and phrases\nSpeech impediments\ndisfluency\ndisfluent\nlisp\nnon-verbal\nspeech and language therapist\nspeech and language therapy\nspeech impediment\nstammerer\nstammeringly\nstutter\nstutterer\nstuttering\nstutteringly\nRelated word\nstammeringly\na speech problem in which someone speaks with unusual pauses or repeated sounds : Robert has a slight stammer. Speech lessons had corrected a childhood stammer.\nthe act of saying something with unusual paused or repeated sounds because of fear or nervousness: Although he said he felt calm, there was a slight stammer in his voice. She was a gangly girl of 15, all stammers and blushes.\nMore examplesFewer examplesHer older brother had a slight stammer from an early age.Despite a lifelong stammer, he resolved that he was going to make his fortune as a singer.Davis' voice didn't have a single stutter, stammer or pause. Machines don't understand the stammers and stalls, \"uhms,\" \"likes,\" and grammatical errors of natural speech.\nSMART Vocabulary: related words and phrases\nSpeech impediments\ndisfluency\ndisfluent\nlisp\nnon-verbal\nspeech and language therapist\nspeech and language therapy\nspeech impediment\nstammerer\nstammeringly\nstutter\nstutterer\nstuttering\nstutteringly\nYou can also find related words, phrases, and synonyms in the topics:\nWays of talking\nAdd to word list\nAdd to word list\nto speak or say something with unusual pauses or repeated sounds; stutter: [ I ] He stammers when he is nervous. stammer noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˈstæm·ər/\nRobert has a slight stammer which was much worse when he was younger."}