{"id":342901,"name":"stamp","type":"noun","us_sound":"stæmp","us_link":"../audio/s/stamp.mp3","uk_sound":"stæmp","uk_link":"../audio/s/ukstair025.mp3","content":"stamp noun\n(LETTER)\nAdd to word list\nAdd to word list\nA2 [ C ] (formal postage stamp) a small piece of paper with a picture or pattern on it that is stuck onto a letter or package before it is posted, to show that the cost of sending it has been paid: I stuck a 50p stamp on the envelope.\nmeshaphoto/E+/GettyImages\nMore examplesFewer examplesa valuable stamp collectionShe affixed a stamp to the envelope.How much is a first-class stamp?He sealed the envelope and put a stamp on it.a stamp album\nSMART Vocabulary: related words and phrases\nCommunications - the postal system\naddy\nBFPO\ncare of idiom\ncollection box\nconsignee\ndelivery\ndirect mail\ndispatch\nexpress\nFreepost\nmail\nmail slot\npigeonhole\npostage\npostbox\npostmark\nself-addressed\nshipping and handling\nwindow\nzip code\nSee more results »\nstamp noun\n(MARK)\n[ C ] a tool for putting a mark on an object either by printing on it or pushing into it, or the mark made in this way: A date stamp inside the front cover of a library book shows when it should be returned.\nBet_Noire/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nstamp noun\n(PROOF OF PAYMENT)\n[ C ] UK a small piece of paper worth a particular amount of money that you can buy several of, as a way of paying for something over a period of time: vehicle licence stamps\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\ncharge\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nsales slip\nsavings bond\ntab\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\nstamp noun\n(QUALITY)\n[ U ] a particular quality in something or someone, or a quality in something that shows it was done by a particular person or group of people: Although this painting clearly bears the stamp of genius, we don't know who painted it. Each manager has left his or her own stamp on the way the company has evolved.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nstamp noun\n(FOOT)\n[ C ] an act of putting the foot down on the ground hard, or the noise made in doing so: With a stamp of her foot she stormed out.\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmarch\nmark\npace\nparade\nprance\nquick march! idiom\nsashay\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nstamp verb\n(MARK)\nB2 [ T ] to put a mark on an object either by printing on it or pushing into it with a small tool: It is necessary to stamp your passport. Every carton of yogurt is stamped with a sell-by date.\nMore examplesFewer examplesThe lawyer stamped the certificate with her seal.Both books have 'property of Her Majesty's Government' stamped inside them.She's stamped her name in all of her books.Sell-by dates are stamped on eggs.The dark red royal crest was stamped on the back of the envelope.\nSMART Vocabulary: related words and phrases\nPublishing: printing & word processing\n3-D printing\nbackspace\nbed\nboldface\nboldfaced\nbolding\nimpression\nimprint\nindent\nindentation\ninline\nprint on demand\nprint run\nprint something out\nprinted\nprinting\ntypographical\ntypography\nunpublished\nxerography\nSee more results »\nstamp verb\n(MOVE FOOT)\nC2 [ I or T ] (US also stomp) to put a foot down on the ground hard and quickly, making a loud noise, often to show anger: The little boy was stamping his foot and refusing to take his medicine. She stood by the road, stamping her feet to stay warm. I wish those people upstairs would stop stamping (about/around). Why did you stamp on that insect? Compare\nstomp\nSMART Vocabulary: related words and phrases\nMoving firmly on foot\nbreeze\nclomp\nclump\nflounce\ngoose step\nlope\nmarch\nmark\npace\nparade\nprance\nquick march! idiom\nsashay\nstomp\nstride\nstrut\nswagger\nswaggeringly\nunmounted\nwaltz\nSee more results »\nstamp verb\n(SHOW QUALITY)\n[ T ] to mark with a particular quality or show that someone has a particular quality: Our new administrator seems to be trying to stamp her authority on every aspect of the department.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\ntagging\ntell something/someone apart\ntraceable\nSee more results »\nIdiom\nstamped on someone's memoryPhrasal verbs\nstamp on something\nstamp something out\nAdd to word list\nAdd to word list\nto hit the floor or ground hard with a foot, usually making a loud noise: [ T ] She stood by the road, stamping her feet to stay warm. [ I ] I wish those people upstairs would stop stamping around.\nthe act of hitting the floor or ground hard with a foot: With a stamp of her foot she hurried out.\nstamp noun\n(MAIL)\n[ C ] (also postage stamp) a small piece of paper, usually with a colorful design, that is attached to a package or envelope to show that the charge for sending it through the mail has been paid: The new stamps depict blues singers.\nstamp noun\n(MARK)\n[ C ] a tool for printing or cutting a mark into an object, or the mark made by such a tool: The guard examined the permit, then reached for his rubber stamp. The stamp on the rim shows that Paul Revere made this mug.\nstamp noun\n(QUALITY)\n[ U ] a particular quality or character: This painting clearly bears the stamp of genius.\nstamp verb [T]\n(MARK)\nto use a special tool to print or cut a mark into an object: An immigration official stamped his passport. fig. That scene will be stamped in my memory forever.\nPhrasal verb\nstamp something out\nAdd to word list\nAdd to word list\n(also formal postage stamp) a small piece of paper with a picture or pattern on it, that you stick onto a letter or package to pay for the cost of mailing it: first-class/second-class stamp\na tool used to put a date, an address, or other mark on a document or an object, usually as proof of something: The assistant uses a stamp to sign his boss's name.\nan official mark put on something that shows a date, an address, or other information: Look for the official USDA stamp before you buy.\nstamp of approval\napproval from someone in a position of authority: The Board will meet Thursday to discuss the contract and is likely to give its stamp of approval Friday. The foreign-made goods still have not earned the government's stamp of approval. See also\ndate stamp noun\nfood stamp\nrevenue stamp\nrubber stamp\nto use a tool to put a date, an address, or other mark on a document or an object, usually as proof of something: EU citizens don't need to get their passports stamped when travelling within Europe.stamp sth on sth All supermarket food packaging has a sell-by date stamped on it.stamp sth with sth The invoice was stamped with the date that payment had been received. See also\nrubber-stamp"}