{"id":342949,"name":"stand","type":"verb","us_sound":"stænd","us_link":"../audio/s/stand.mp3","uk_sound":"stænd","uk_link":"../audio/s/ukstair030.mp3","content":"stand verb\n(VERTICAL)\nAdd to word list\nAdd to word list\nA2 [ I or T ] to be in a vertical state or to put into a vertical state, especially (of a person or animal) by making the legs straight: Granny says if she stands for a long time her ankles hurt.stand (up) As a sign of politeness, you should stand (up) when she comes in.stand still Stand still and be quiet! After the earthquake not a single building was left standing in the village.stand something on something Stand the bottles on the table over there. See also\nstand up\nMore examplesFewer examplesDon't stand out there in the cold - come in here and get warm.The audience clapped and cheered when she stood up to speak.They stood on the street corner handing out leaflets.We stood huddled together for warmth.She stood up to address a hushed courtroom.\nSMART Vocabulary: related words and phrases\nSitting and standing\nakimbo\nastride\nbestride\ncross-legged\ncrouch\non all fours idiom\npew\nplump (someone/something) down\npose\nrampant\nreseat\nseat\nsit\nstance\nstand around\nstand aside\nstand round\nstand up\nstrike\nsurface\nSee more results »\nstand verb\n(STATE)\nC1 [ I, L only + adj ] to be in, cause to be in, or get into a particular state or situation: How do you think your chances stand (= are) of being offered the job?stand at something The national debt stands at 55 billion dollars.stand empty The house stood empty for years. Martina is currently standing second in the world listings. [ + to infinitive ] Our firm stands to lose (= will lose) a lot of money if the deal is unsuccessful. We really can't allow the current situation to stand (= to exist in its current form). Newton's laws of mechanics stood (= were thought to be completely true) for over two hundred years. Leave the mixture to stand (= do not touch it) for 15 minutes before use.stand in someone's opinion It would be difficult for her to stand much lower/higher in my opinion (= for me to have a worse/better opinion of her) after the way she behaved at the party. She's very blunt, but at least you know where you stand with her (= you know what she thinks and how she is likely to behave).stand accused of formal You stand accused of murder, how do you plead? stand trial\nC2 to be put on trial in a law court: stand trial for Two other men are to stand trial next month for their part in the bombing.\nSee more\nMore examplesFewer examplesInflation currently stands at three percent.The current total stands at £30,000.He stands to benefit from the situation.Eight years later the building stands empty.The theatre has been left to stand derelict.\nSMART Vocabulary: related words and phrases\nExisting and being\naccount for something\nalive\nbe\nbe a thing idiom\nbeen\ncome\nexistentially\nextant\nfound\nhave legs idiom\nhood\nlie in\nliving\nrun\nspring up\nthey're\nthing\nthingness\nviability\nwe're\nSee more results »\nstand verb\n(PLACE)\nB2 [ I or T, usually + adv/prep ] to be in, cause to be in, or put into a particular place: The room was empty except for a wardrobe standing in one corner. Stand the paintings against the wall while we decide where to hang them. The photograph shows the happy couple standing beside a banana tree.\n[ I usually + adv/prep ] Vehicles that are standing are waiting: stand at The train now standing at platform 8 is the 15.17 for Cardiff. no standing US (UK no waiting)\nused on signs to mean vehicles are not allowed to park, even for short periods of time: The sign by the side of the road said \"no standing\".\nSee more\nMore examplesFewer examplesHis walking stick stood by the door.You'll have to stand the sofa on its end to get it through the door.Could you stand the bookcase against that wall, please?There was a big chest of drawers standing in one corner.In the centre of the hall stood a colossal wooden statue, decorated in ivory and gold.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStaying and remaining\nWaiting\nstand verb\n(ACCEPT)\nB1 [ T usually in negatives ] to successfully accept or bear something that is unpleasant or difficult: I can't stand her voice. Our tent won't stand another storm like the last one. [ + -ing verb ] I can't stand hearing her cry.\nThesaurus: synonyms, antonyms, and examples\nto hate someone or somethinghateI hate camping.detestI detest any kind of cruelty.loathe\"Do you like cabbage?\" \"No, I loathe it.\"despiseShe despised him for the way he treated her.\nSee more results »\nMore examplesFewer examplesPersonally, I can't stand her.I can't even stand the smell.I can't stand being cold.He can't stand the sight of her.I can't stand the thought of waiting so long.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nput up with something/someone\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nstomach\nstruggle\nsweat it out idiom\ntolerance\ntough\ntough something out\nwait\nwait something out\nweather the storm idiom\nSee more results »\nstand verb\n(POLITICS)\nC2 [ I ] UK (US also UK run) to compete, especially in an election, for an official position: stand for The president has announced she does not intend to stand for re-election.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nstand a chance\nC2 to have a chance of success: stand a chance of She stands a good chance of passing her exam if she works hard.\nSee more\nstand verb\n(HEIGHT)\n[ L only + noun ] to be a stated height: Even without his shoes he stood over two metres tall.\nSMART Vocabulary: related words and phrases\nHigh, tall and deep\nabysmal\naltitude\nbottomless\ndeep\ndwarf\nectomorph\nelevated\neye level\nheight\nhigher\nlofty\novershadow\nrangy\nrear\nrear above/over something/someone\ntall\ntallish\ntallness\ntower\ntower above/over someone/something\nSee more results »\nstand verb\n(BUY)\n[ T + two objects ] to buy something, especially a meal or a drink, for someone: I couldn't get to the bank, so could you stand me lunch?\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nstand verb\n(OPINION)\nC2 [ I usually + adv/prep ] to have as an opinion: stand on How/Where does he stand on foreign policy issues?\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nstand verb\n(IN CARD GAME)\n[ I ] in the game of blackjack (= type of card game played for money), to say that you do not want to be given any more cards: The guide provided a probability outline for when players should stand or take a hit. Good players sometimes hit, sometimes stand, depending on the count.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\nIdioms\ncan't stand the sight of someone/something\nfrom where someone stands\nI stand corrected\nit stands to reason\nknow where you stand\nstand (up) and be counted\nstand your ground\nstand someone in good stead\nstand something on its head\nstand and deliver!\nMore idioms\nstand bail\nstand fast/firm\nstand in the way of something/someone\nstand on your dignity\nstand on your hands/head\nstand on your head\nstand on your own (two) feet\nstand on ceremony\nstand or fall by something\nstand the test of time\nstanding on your head\nPhrasal verbs\nstand around\nstand aside\nstand back\nstand by someone\nstand by\nstand by something\nstand clear\nstand down\nstand for something\nstand in\nMore phrasal verbs\nstand out\nstand out against something/someone\nstand over someone\nstand round\nstand together\nstand up\nstand someone up\nstand up for something/someone\nstand up to someone/something\nstand up to something\nstand noun\n(SPORT)\n[ C ] UK a large structure at a sports ground, usually with a sloping floor and sometimes a roof, where people either stand or sit to watch a sports event See also\ngrandstand\ndmitry_7/iStock/Getty Images Plus/GettyImages stands [ plural ]\na stand: Fighting broke out in the stands five minutes before the end of the match.\nSee more\nSMART Vocabulary: related words and phrases\nSports venues\nall-seater\namphitheatre\narena\nballpark\nbowl\ncommentary box\ncrush barrier\ncurva\ncycle track\ndirectors' box\ndojo\nfitness centre\nice rink\nmezzanine\nrink\nrow Z\ntrack\ntunnel\nvelodrome\nvert\nSee more results »\nstand noun\n(OPINION)\n[ C ] an opinion, especially one that is public: stand on What's her stand on sexual equality?\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nstand noun\n(COURT)\n[ C ] US (UK witness box) the place in which a person sits or stands in a law court when they are being asked questions: take the stand The witness took the stand (= went to the place in a court where you stand and answer questions).\ndcdebs/E+/GettyImages\nSMART Vocabulary: related words and phrases\nLaw courts\nappellate\nbefore\nbench\nchamber\nchancery\ncircuit court\ncourthouse\ncourtroom\ncriminal court\nCrown Court\nHigh Court\nindustrial tribunal\njury box\njustice\nkangaroo court\nthe Inns of Court\nthe Supreme Court\ntribunal\nvenue\nwitness box\nSee more results »\nstand noun\n(SHOP)\nC1 [ C ] a small shop or stall or an area where products can be shown, usually outside or in a large public building, at which people can buy things or get information: a hotdog stand Over three thousand companies will have stands at this year's microelectronics exhibition. See also\nnewsstand\n/GettyImages\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsuper-sale\nsupermarket\nsuperstore\nswap meet\nsweet shop\nSee more results »\nstand noun\n(FRAME)\nC2 [ C ] a frame or piece of furniture for supporting or putting things on: a music stand a hatstand\nfStop Images/GettyImages\nSMART Vocabulary: related words and phrases\nFrames & structures\nanatomy\narmature\nbezel\ncarcass\nclothes hanger\nclothes horse\ncoat hanger\nframework\nframing\ngantry\nhanger\nhomeschool\nmatrix\nphoto frame\npicture frame\nrack\nreframe\nsafety gate\nskeleton\nstair gate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFurniture for storage\nstand noun\n(OPPOSITION)\nC2 [ C usually singular ] an act of opposition, especially in order to defend someone or something: make a stand against Environmental groups are making a stand against the new road through the valley.\nSMART Vocabulary: related words and phrases\nOpposing & against\nad hominem\nadversarial\nalienate\nalienated\nantagonistic\nanti-boycott\nantithetical\nconverse\ndiscordant\ninsurgent\nlark\nman the barricades idiom\nnimby\nnimbyism\nnon-confidence\nprotest\nraise\nresistant\nversus\nvirulent\nSee more results »\nstand noun\n(PERFORMANCES)\n[ C usually singular ] US a particular number or period of performances: The Orioles will be in town for a three-game stand.\nSMART Vocabulary: related words and phrases\nSpectacles & performances\naerobatic\namateur theater\nbalancing act\nbravura performance\nbullfight\ndouble-header\nminstrel show\nmusic hall\nnon-musical\none-night stand\none-person\nroutine\nspectacular\nstrip\nstripping\nstriptease\nsuper-spectacle\nsupershow\nswansong\ntattoo\nSee more results »\nstand noun\n(GROUP OF TREES)\na group of trees, especially ones of a similar size, age, or type: A pelican drifts toward a stand of trees. If a beetle infestation hits your forest stand and all the trees are killed, all of the carbon gets re-emitted.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nstand verb\n(BE VERTICAL)\nAdd to word list\nAdd to word list\n[ I/T ] to be on your feet or get into a vertical position, or to put someone or something into a vertical position: [ I ] I stood motionless as the snake slithered by. [ I ] Please stand back so the paramedics can get through. [ T always + adv/prep ] I stood the ironing board against the wall. stand on your hands (also head)\nIf you stand on your hands or head, you hold yourself with your head near or on the ground and your feet in the air.\nstand verb\n(BE IN SITUATION)\nto be or get into a particular state or situation: [ I ] As things stand right now, there’s no telling who will win. [ I ] Let the mixture stand for fifteen minutes. [ L ] Some of these older houses have stood empty for years. [ L ] He stands accused of tax evasion. [ L ] Even without her shoes, she stands over six feet tall. stands trial\nIf someone stands trial, accusations against that person are examined in a court of law: Berenson will stand trial next month in the county court.\nstand verb\n(BE IN PLACE)\n[ I ] to be in a particular place: A desk stood in the middle of the room. A taxi stood at the curb, waiting for a fare. fig. If you want to apply for promotion, I won’t stand in your way.\nstand verb\n(ACCEPT)\n[ T ] to be able to accept or bear something unpleasant or difficult: Our tent won’t stand another storm like the last one. How can you stand all that pressure at work?\nstand verb\n(HAVE OPINION)\n[ I always + adv/prep ] to have a particular opinion about something: On foreign policy, the president seems to stand to the left of his party. Idioms\nI stand corrected\nit stands to reason (that)\non standby\nstand a chance\nstand your ground\nstand guard\nstand on your own (two) feetPhrasal verbs\nstand around\nstand by\nstand by\nstand by someone/something\nstand for something\nstand for something\nstand out\nstand over\nstand up\nstand up someone\nMore phrasal verbs\nstand up for someone/something\nstand up to someone/something\nstand noun [C]\n(OPINION)\nan opinion, esp. one publicly expressed: What’s his stand on health care reform? She’ll no doubt take a strong stand against raising taxes.\nstand noun [C]\n(COURT)\nshort form ofwitness stand\nstand noun [C]\n(STRUCTURE)\na small structure where food, newspapers, candy, and other small items are sold: Hot dog stands with colorful umbrellas always attract a crowd.\nstand noun [C]\n(GROUP)\na group of trees or tall plants: Stands of spruce trees dotted the hills.\nstand noun [C]\n(FRAME)\na pole or frame designed to hold something: a coat stand He mounts the baseballs on marble stands.\nAdd to word list\nAdd to word list\n[ I ] to be in a particular state or situation: As things stand, the existing rules are not working in favour of competition. Office blocks all over the city are standing empty. They stand accused of backdating stock options to coincide with the lowest possible share price. stand divided/united\n[ I ] to be at or reach a particular level: stand at sth The country's national debt stands at $55 billion.\n[ I ]\n&#160; POLITICS\n&#160; UK to compete in a election for an official position: She's decided to stand for re-election. He was persuaded to stand against the party leader in the upcoming election.\n[ I ] to have a particular opinion on something: stand on sth Where does the party stand on immigration?\n[ I ] if an offer, a decision, or a record still stands, it still exists and has not been changed: They have not made a second bid for the company but their original offer still stands. The commission declared that the election results should stand.\nstand a chance (of doing sth)\nto be likely to do sth: These ambitious projects only stand a chance of happening if they get generous financial backing. I don't think they stand a chance of winning the election.\nstand bail (for sb)\nLAW\n&#160; UK to pay money to show that you promise that someone accused of a crime will come to a court of law to be judged: A friend asked me to stand bail for his son.\nstand or fall by/on sth\nto depend completely on something to be able to succeed: Governments stand or fall by their economic performance.\nstand pat (on sth)\nUS to refuse to change a decision or the way you do something: The party is standing pat on the issue of immigration reform.\nstand the test of time\nto be popular or successful for a long time: We only invest in companies with established brands that have stood the test of time.\nstand to do sth\nto be in a situation in which it is possible or likely that something will happen to you: stand to gain/lose/win Our firm stands to lose a lot of money if the deal doesn't go through.\nstand trial\nLAW to be judged in a court of law after being accused of illegal behaviour: Roberts will stand trial next week for insider trading. Phrasal verbs\nstand by\nstand down\nstand for sth\nstand in\n[ C ]\n&#160; COMMERCE, MARKETING a table or structure where someone can sell or advertise their products or services: There were street vendors selling ice cream and hot dogs from their stands. Over 100 charities will have stands at this year's exhibition.\n[ C, usually singular ] someone's opinion, especially when they make it public: sb's stand on sth What's their stand on environmental issues?a stand against/for sth Mr Williams said his organization's stand against the new development would not change. his outspoken stand for human rightstake/make a stand We decided to take a stand against the proposed changes to the law.\n[ S ]\n&#160; LAW →\nwitness stand : Both the chairman and chief executive are expected to take the stand in this high-profile fraud case. See also\nexhibition stand"}