{"id":342985,"name":"standing","type":"noun","us_sound":"ˈstæn.dɪŋ","us_link":"../audio/s/standing.mp3","uk_sound":"ˈstæn.dɪŋ","uk_link":"../audio/s/ukstand007.mp3","content":"standing noun [U]\n(REPUTATION)\nAdd to word list\nAdd to word list\nreputation, rank, or position in an area of activity, system, or organization: As a pathologist of considerable standing, his opinion will have a lot of influence. A financial scandal would shake the Institute's standing in the international academic community.\nMore examplesFewer examplesHe's a barrister of considerable standing.The president's standing with the public has been largely unaffected by the disclosure.This latest revelation has done nothing to boost his political standing.He had the wealth of a gentleman but not the social standing.She had hoped that the move would enhance her standing within the company.\nSMART Vocabulary: related words and phrases\nReputation\nby reputation idiom\ncred\ncredibility\ndetoxify\ndisreputable\nhonourable\nhonourably\ninfamous\ninfamously\ninfamy\nmud\nnotoriety\nnotorious\nnotoriously\nreputable\nreputably\nsmoke\nstature\nTeflon\nthere's no smoke without fire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - position & status\nstanding noun [U]\n(TIME)\nformal the time for which something has existed: One member, of twelve years' standing on the committee, resigned in protest at the changes. See also\nlong-standing\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\npermanent, rather than formed or created when necessary: a standing committee You know you have a standing invitation to come and stay anytime you're in town.\nSMART Vocabulary: related words and phrases\nContinuous & permanent\nabiding\nabidingly\nad infinitum\naround-the-clock\nbe\nhere to stay idiom\nimmanence\nimmanent\nimmanently\nimperishable\nnon-stop\non the bounce idiom\non the spin idiom\non the trot idiom\nperennial\nuninterruptedly\nunrelentingly\nunrelieved\nunrelievedly\nunremitting\nSee more results »\nIdiom\nfrom a standing start\nstanding adjective [not gradable]\n(PERMANENT)\nAdd to word list\nAdd to word list\npermanent or always continuing to exist or happen: African-Americans headed five standing committees in the House of Representatives.\nstanding adjective [not gradable]\n(VERTICAL)\nin a vertical position: Only one building was left standing after the earthquake.\nstanding noun\n(RANK)\nrank, position, or reputation in an area of activity, system, or organization: [ U ] Financial scandal will affect the institute’s standing in the academic community. [ U ] You must pay dues to remain a member in good standing.\nStandings are ranked lists of people or things: [ pl ] the league standings\nAdd to word list\nAdd to word list\nthe reputation or position that someone or something has in an area of activity or an organization: Because they are a public limited company, their financial standing is public knowledge. improve/increase sb's standing\nthe time for which something has existed: of a year's, etc. standing The society also offers a Members' Loyalty Bond for investors of two years' standing.\nin good standing\na person or an organization in good standing has followed all the necessary official processes and paid the necessary charges: The bonds were backed by prime bank securities, issued by an acceptable institution in good standing.\nSee also\ncredit standing\npermanent, rather than created or formed when necessary: standing committee/contract The state has standing contracts with trucking firms to ensure it can deliver firetrucks as they're needed."}