{"id":342929,"name":"stance","type":"noun","us_sound":"stæns","us_link":"../audio/s/stance.mp3","uk_sound":"stɑːns","uk_link":"../audio/s/ukstair027.mp3","content":"stance noun [C]\n(OPINION)\nAdd to word list\nAdd to word list\nC2 a way of thinking about something, especially expressed in a publicly stated opinion: The doctor's stance on the issue of abortion is well known. Synonyms\nmentality\nmindset\nopinion\noutlook (OPINION)\npoint of view\nstandpoint\ntake on something\nview (OPINION)\nviewpoint\nThesaurus: synonyms, antonyms, and examples\na feeling or opinion about something or someoneattitudeHis attitude towards authority has often got him into trouble.outlookI wish I could share your positive outlook on life.frame of mindI need to be in the right frame of mind to talk about this.approachIt's time to try a different approach to the problem.viewpointHis viewpoint is his own and does not affect how I think about the issue.point of viewFrom a strictly financial point of view it looks like a positive change.\nSee more results »\nMore examplesFewer examplesThe leader's aggressive stance seems to have foreclosed any chance of diplomatic compromise.Craig doesn't have a car as a part of his anti-consumerist stance.There have been repeated calls for the president to moderate his stance on contraception.The UN called on all parties in the conflict to take a positive stance towards the new peace initiative.Would you say the government's stance on law and order has softened?\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\noutlook\npole\npolitics\nposture\npretension\nprism\nredistributionist\ntick\nSee more results »\nstance noun [C]\n(POSITION)\na particular way of standing: Jenny took up a stance with her feet slightly apart, ready to catch the ball.\nSMART Vocabulary: related words and phrases\nSitting and standing\nakimbo\nastride\nbestride\ncross-legged\ncrouch\nfoot\non all fours idiom\npew\nplump (someone/something) down\nrampant\nreseat\nseat\nsit\nstand around\nstand aside\nstand round\nstand up\nstrike\nsurface\ntake a pew! idiom\nSee more results »\nstance noun [C]\n(OPINION)\nAdd to word list\nAdd to word list\nan opinion about something, esp. one that is publicly expressed: The governor’s stance on the issue of tax cuts is well known.\nstance noun [C]\n(WAY OF STANDING)\na way of standing: He had the stance of a baseball player focusing on the ball.\nAdd to word list\nAdd to word list\na particular way of thinking about something, especially when those opinions are expressed publicly or officially: an ethical/fiscal/moral stance a stance against/on/towards sth The government took a tough stance against terrorism. adopt/take a stance change/alter/maintain a stance an aggressive/defensive/tough stance an official/political/public stance\nFINANCE the way in which investors behave that shows whether or not they are confident about the profit they can make: Fund managers can take a defensive stance in times of market uncertainty. a bearish/bullish stance"}