{"id":342951,"name":"standard","type":"noun","us_sound":"ˈstæn.dɚd","us_link":"../audio/s/standard.mp3","uk_sound":"ˈstæn.dəd","uk_link":"../audio/s/ukstand001.mp3","content":"standard noun\n(QUALITY)\nAdd to word list\nAdd to word list\nB2 [ C or U ] a level of quality: This essay is not of an acceptable standard - do it again. This piece of work is below standard/is not up to standard. We have very high safety standards in this laboratory. Not everyone judges success by the same standards - some people think happiness is more important than money. Her technique became a standard against which all future methods were compared. Compare\ncriterion\nmeasure noun\ntouchstone\nyardstick (STANDARD)\nC2 [ C usually plural ] a moral rule that should be obeyed: Most people agree that there are standards (of behaviour) that need to be upheld.\nMore examplesFewer examplesThe standard of the students' work is abysmal.For years they have enjoyed a standard of living unmatched by any other country in Europe.The standard of care at our local hospital is excellent.Certain of the candidates were well below the usual standard, but others were very good indeed.As his career attests, he is a cricketer of world-class standard.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nclass\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstar\nstarred\nstatus\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMorality and rules of behaviour\nstandard noun\n(USUAL)\n[ C usually singular ] a pattern or model that is generally accepted: This program is an industry standard for computers.\n[ C ] a song or other piece of music that has been popular and often played over a long period of time\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nsample\nshowpiece\nspecimen\ntaste\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical pieces\nstandard noun\n(CAR)\n[ C ] US a car with gears that are changed by hand\nSMART Vocabulary: related words and phrases\nCars\n4×4\nall-wheel drive\nartic\nautomobile\nbanger\nbeetle\nblack cab\nclassic car\ncrock\nhardtop\nJeep\nmarque\nMerc\nMk\nmotor\nroad racer\nsport utility vehicle\nsportily\nsupercar\ntown car\nSee more results »\nstandard noun\n(FLAG)\n[ C ] a flag, especially a long, narrow one ending with two long points: the royal standard\nFlavia Morlachetti/Moment Unreleased/GettyImages\nSMART Vocabulary: related words and phrases\nFlags\ncolour\ncrossbones\nensign\nflag\nflag bearer\nflag of convenience\nhalf-mast\nhalf-staff\npennant\nred flag\nsaltire\nskull and crossbones\nStar-Spangled Banner\nStars and Stripes\nthe Jolly Roger\ntifo\ntricolour\nUnion Jack\nwindsock\nB2 usual rather than special, especially when thought of as being correct or acceptable: White is the standard colour for this model of refrigerator. These are standard procedures for handling radioactive waste. The metre is the standard unit for measuring length in the SI system.mainly UK Your new TV comes with a two year guarantee as standard. See also\nsubstandard\nThesaurus: synonyms, antonyms, and examples\nnormalnormalTemperatures are well above normal today.usualI went to bed at my usual time.ordinaryThe magazine has stories about ordinary people rather than celebrities.standardIt's standard practice for surgeons to wear gloves.naturalIt's completely natural to feel anxious on your first day at a new school.typicalHe was a typical teenager - arguing with his parents and staying out late.\nSee more results »\nLanguage described as standard is the form of that language that is considered acceptable and correct by most educated users of it: Most announcers on the BBC speak standard English. In Standard American, \"gotten\" is used as a past participle of \"get\".\n[ before noun ] A standard book or writer is the one that is most commonly read for information on a particular subject: Her book is still a standard text in archaeology, even though it was written more than 20 years ago.\nMore examplesFewer examplesPower steering, electric windows and central locking are standard features on all models.What is standard practice in a situation like this?It's a standard surgical procedure.Her standard excuse for being late was beginning to wear thin.There are three categories of accommodation - standard, executive and deluxe.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregular\nregularity\nregularization\nregularize\nround\nstock\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nForms of languages & specialist dialects\nTypifying, illustrating and exemplifying\nGrammar\nStandard and non-standard languageA standard language is a variety of language that is used by governments, in the media, in schools and for international communication. There are different standard varieties of English in the world, such as North American English, Australian English and Indian English. Although these standard varieties differ in terms of their pronunciation, there are few differences in grammar between them. In contrast, there are non-standard forms of a language that are used, for example, in different regional dialects and these non-standard varieties are different from each other. …\nstandard adjective\n(USUAL)\nAdd to word list\nAdd to word list\nusual or expected; not involving something special or extra: a standard contract I don’t work a standard, 35-hour week. The car came with an air conditioner and tape player as standard equipment. This is a standard medical text (= a commonly used medical book).\nA standard unit of measurement is an accepted method of measuring things of a similar type.\nstandard noun [C]\n(LEVEL OF QUALITY)\nsomething that others of a similar type are compared to or measured by, or the expected level of quality: moral/ethical/community standards That’s not their usual standard of service. The new standard will allow data to be sent over telephone wires at higher speeds.\nstandard noun [C]\n(SONG)\na song or piece of music that has been popular for many years and that musicians often perform\nstandard noun [C]\n(FLAG)\na flag used as the symbol of a person, group, or organization: Pete carried the troop’s standard in the parade.\nAdd to word list\nAdd to word list\n[ C or U ] a level of quality that people expect and generally accept as normal: basic/high/low standard Their Customer Services is generally of a very high standard. Online form-completion is fast becoming the standard.achieve/meet/set a standard Banks in Hong Kong and China are setting the standard for customer service in call centres. Customers have witnessed the standard of services decline while the profitability of the banks has escalated.by sb's/sth's standards At $80,000, the house is a bargain by American standards. The new probe is modest by modern space technology standards.below/up to standard The electrical equipment was not up to standard. falling/rising standards improve/lower/raise standards\n[ C ]\n&#160; MEASURES\n&#160; ( written abbreviation std.) an official rule, unit of measurement, or way of operating that is used in a particular area of manufacturing or services: a common/a global/an international standard MP3 is a recognized global standard for audio encoding and compression. an accountancy/industry/legal standard Several states were given notice that they do not meet the standard for ozone levels. safety standards a federal/government/national standard enforce/tighten standards See also\naccounting standard\nCAT standard\nthe gold standard\nInternational Accounting Standards\nInternational Financial Reporting Standard\ninternational labour standards\nmonetary standard\nopen standard\nTrading Standards\nnormal or average: The price quoted is for the standard size.standard practice/procedure The board has been careful to follow standard procedures and employment law. The current model comes with all these extra features as standard.\nMEASURES\n&#160; ( written abbreviation std.) following a particular set of rules or measurements, without any changes or added details: standard contract/letter/replystandard format/size Candidates need to enter their expenditure records in a standard format on a Web-based form. Compare\nnon-standard\n[ before noun ] used by most people: It has become the standard text for all trainee accountants."}