{"id":342970,"name":"standby","type":"noun","us_sound":"ˈstænd.baɪ","us_link":"../audio/s/standby.mp3","uk_sound":"ˈstænd.baɪ","uk_link":"../audio/s/ukstand004.mp3","content":"standby noun [C]\n(READY)\nAdd to word list\nAdd to word list\nsomething that is always ready for use, especially if a regular one fails: Board games are a good standby to keep the children amused if the weather is bad. There are standby generators but these usually only have to work for a few hours a year during power cuts. on standby\nWhen a person or a thing is on standby, they are or it is ready to be used if necessary: Hospitals are on standby ready to deal with casualties from the crash.\nWhen an electrical device such as a television is on standby, the power is on but the device will not work until a switch, etc. is pressed. : Not leaving your TV on standby at night will save you money.\nUS When someone is on standby, they are waiting for a seat that might become available just before a flight or performance: I was too late for my flight but I managed get on standby for a later one.\nSee more\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstash\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nstandby noun [C]\n(TICKET)\n(also standby ticket) a cheaper ticket sold just before a flight or a performance if there is a seat available: Tickets start at about at about £7, with cheap standbys sometimes available to students on the evening of the performance. About 850 standby tickets have been given to those hoping to take the place of no-shows.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\neconomy class\nhalf\nhall pass\npass\nrain check\nreturn fare\nround fare\nround-trip ticket\nseason ticket\nsingle\nsupersaver\nticketing\nticketless\ntimed ticket\ntransferable\nSee more results »\nAdd to word list\nAdd to word list\nsomething available for use when needed, or the state of being ready for use: I have several meals I use as standbys for unexpected company. Cary also has sought to put more contractors on standby for major storms.\nIf you fly standby, you hold a ticket and are ready to travel when space becomes available on a flight. Idiom\non standby\nAdd to word list\nAdd to word list\na person or thing that is available and that can be used when necessary, if another person or thing is not available, or in an emergency: They manufacture portable GPS systems which can be used as an emergency standby.\nTRANSPORT\n&#160; (also standby ticket) a cheap ticket sold just before a flight or a performance if there is a seat available\nfly standby\nTRANSPORT to travel by plane using a ticket that cannot be bought in advance, but that becomes available just before the plane is due to leave: Employees at some airlines can fly for free if they fly standby.\non standby\nready to be used or to do something if necessary: They have 700 gritters and snow ploughs on 24-hour standby in order to prepare for the freezing temperatures.leave sth on standby You should make sure that electrical goods are not left on standby, because it wastes energy.remain/be put on standby Economists are remaining on standby for the all-important employment report for August.\nTRANSPORT a person who is on standby is ready to travel on a plane immediately if a ticket becomes available: The salesmen book the cheapest flight they can find on the day they want to fly, then go to wait on standby for the flight they really want to get aboard.\nready to be used if necessary: a standby generator If the computer is left undisturbed for five minutes, it goes into standby mode. The phone offers up to four hours of talk time and 106 hours of standby time.\nECONOMICS relating to extra money that a country can borrow from the International Monetary Fund if it has serious financial difficulties: a standby agreement/arrangement/loan standby credit\nsold just before a flight or a performance if there is a seat available: a standby flight/seat"}