{"id":343138,"name":"star","type":"noun","us_sound":"stɑːr","us_link":"../audio/s/star.mp3","uk_sound":"stɑːr","uk_link":"../audio/s/ukstand022.mp3","content":"star noun\n(OBJECT IN SPACE)\nAdd to word list\nAdd to word list\nA2 [ C ] a very large ball of burning gas in space that is usually seen from the earth as a point of light in the sky at night: Stars twinkled above them as they lay on the hill.\nmalcolm park/Oxford Scientific/GettyImages\nMore examplesFewer examplesElaine looked up at the black, velvety sky studded with tiny, twinkling stars.The stars twinkled in the clear sky.We could see hundreds of stars in the clear desert sky.The sky glimmered with stars.Those seven bright stars make the shape of a saucepan.\nSMART Vocabulary: related words and phrases\nAstronomy\nalbedo\nAndromeda\nAquarius\nAries\nasteroid\ngalactic\ngalaxy\nGemini\ngeostationary orbit\ngibbous\nnova\nobservatory\norbit\norbital\nOrion\nstellar\nsubstellar\nsunspot\nsupergiant\nsupermassive\nSee more results »\nstar noun\n(PERFORMER)\nA2 [ C ] a very famous, successful, and important person, especially a performer such as a musician, actor, or sports player: a rock/movie/football star Kids wanting to be stars come to Hollywood from all over America. See also\nco-star noun\nsuperstar\nThesaurus: synonyms, antonyms, and examples\nsomeone famouscelebrityThe magazine is all about the lives of celebrities.celebWhich celeb recently spent $60,000 on an engagement ring?slebUK She was last spotted interviewing a minor sleb on the red carpet.starHer ambition was always to become a movie star.superstarRock superstar Elton John grew up working class in England.legendHe became a legend in his own lifetime.\nSee more results »\nMore examplesFewer examplesthe stars of the silver screenThere will be many stars performing in the Royal Ballet's Gala Night, held in aid of children's charities.She is one of the rising stars in the political firmament.A number of stars from the world of music attended the event.The 23-year-old tennis star looks unbeatable this season.\nSMART Vocabulary: related words and phrases\nCinema & theatre: actors & performers\nactor\nactress\nall-star\nalum\nbelly dancer\ncast\nchorus\nheadliner\nimproviser\njuvenile lead\nleading lady\nleading man\nperformer\nscream queen\nspear carrier\nstage name\nstarlet\nstooge\nsuperstar\ntroupe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFamous people\nEntertainers in general\nstar noun\n(SYMBOL)\nA2 [ C ] a symbol with five or more points: star-shaped How many stars (= symbols showing quality) does this restaurant have? The teacher gave Tom a gold star (= a paper symbol rewarding good work) for his drawing.\nkyoshino/iStock/Getty Images Plus/GettyImages two-star, three-star, etc.\nC1 used to show how good a restaurant, hotel, etc. is: The cheaper two-star hotels are also within the range of the budget traveller.\na symbol made of metal or cloth worn by particular officials to show their rank: a sheriff's star a four-star general\nkickers/iStock/Getty Image Plus/GettyImages\n[ C ] an asterisk (= a symbol *)\nMore examplesFewer examplesThe US flag has 50 stars on it.She was wearing a T-shirt with a star on the front.She sent me that Christmas card with the star on it.There are little stars all over her bedroom ceiling.I bought some wallpaper with stars on it for the spare bedroom.\nSMART Vocabulary: related words and phrases\nGeometrical shapes\n-cornered\ncircularly\ncongruently\nconic\ncrescent\ncylindrically\novoid\npolyhedron\npolytope\nprism\npyramid\nquadrilateral\nrectangle\nrectangular\nrectangularly\nrhombus\nright triangle\nsemicircle\nthree-dimensional\ntrapezoid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecific signs and symbols\nJudgments and analyses\nPunctuation\nstar noun\n(LUCK)\n[ C ] informal any planet or other object in the sky thought of in astrology as influencing a person's luck: She was born under a lucky/an unlucky star. See also\nstar sign stars [ plural ] informal\n→\nhoroscope : I always like to see what the stars say in the newspaper.\nSMART Vocabulary: related words and phrases\nAstrology\nastrologer\nastrological\nastrology\nhoroscope\nnumerological\nnumerologically\nnumerologist\nretrograde\nsign of the zodiac\nstar sign\nstargaze\nstargazer\nstargazing\ntransit\nzodiac\nzodiacal\nIdiom\nyou're a star!\nB1 If a film, play, etc. stars someone, or if someone stars in a film, play, etc., they are the main actor in it: David Oyelowo starred in the movie \"Selma\". Zusak's novel \"The Book Thief\" was turned into a movie starring Geoffrey Rush. Compare\nfeature verb\nMore examplesFewer examplesIngrid Bergman starred with Humphrey Bogart in the movie 'Casablanca'.Last year he starred in the movie adaptation of Bill Cronshaw's best-selling novel.The movie stars Mark Burgess-Ashton as the gung-ho young fighter pilot.The movie stars Kathleen Turner as the hard-boiled detective of Sarah Paretsky's novel.Russell Crowe stars as a grief-stricken avenger on the trail of his family's killers.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappearance\nblocking\ncamp\ncamp it up\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nC1 best or most important: Natalie is, without a doubt, the star student in this year's ballet class. This afternoon the prosecution will call its star witness. Compare\nleading\nstellar\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\na measurement of quality, usually in numbers from one to five with one being the lowest: A three-star hotel is better than a two-star.\nSMART Vocabulary: related words and phrases\nQuality and standard\nbar\nbenchmark\ncachet\ncalibre\nclass\nconform\nconform to/with something\nideal\nlevel\nmark\nmulti-levelled\nmultilevel\nnotch\nqualitative\nstarred\nstatus\nstyle\ntake first/second place idiom\nunranked\nupscale\nSee more results »\nstar noun [C]\n(OBJECT IN SPACE)\nAdd to word list\nAdd to word list\na large ball of burning gas in space that is usually seen from earth as a point of light in the sky at night: Stars twinkled in the night sky.\nstar noun [C]\n(SHAPE)\na shape having four or more pointed parts coming out from a center at equal distances: The children were cutting stars out of paper to make decorations.\nA star is sometimes used as a symbol of quality: The Times gave this restaurant three stars.\nA star is also used as a symbol of rank or position: a four-star general\nA star is also an asterisk (= the symbol *).\nstar noun [C]\n(PERFORMER)\na famous and successful person, esp. a performer such as a musician, actor, or sports player: a rock/movie/basketball star\nA star is also someone who is especially good at something: Janet is our star math student.\nstar verb [I/T]\n(PERFORM)\nto be one of the most important performers in a show: [ I ] He has starred in several recent movies. [ T ] The school play stars children in the seventh and eighth grades.\nAdd to word list\nAdd to word list\na symbol with four or more points. A system of stars is used to show someone's official opinion of the quality of a product or place: Vehicles with one star are four times more likely to roll over in a crash than vehicles with five stars. Organizations are awarded star ratings to indicate the effectiveness of their safety programmes.\nsomeone or something that is the best in a group, an organization, etc.: Business stars were joined by scores of private investors, who snapped up shares in quoted operators. He's now one of the rising stars of the company.\nMARKETING in the Boston Matrix, a product or company with a large share in a market that is growing very fast: If a star can maintain its large market share, it will become a cash cow when the market growth rate declines. See also\nBoston MatrixCompare\ncash cow\ndog\nquestion mark\n-star\nused to show someone's official opinion of the quality of a place, especially a hotel or restaurant. One-star is the lowest and five-star is the highest: five-star accommodation a four-star hotel\nstar dot star\nIT the set of symbols (*.*) that matches all DOS and Windows file names. The first star means \"all files\", and the second star means \"all extensions\".\nbetter or more important than others: star banker/manager/performer The consumer sector stands out as a star performer in the country's economy."}