{"id":343193,"name":"stargazing","type":"noun","us_sound":"ˈstɑːrˌɡeɪ.zɪŋ","us_link":"../audio/s/usstarg002.mp3","uk_sound":"ˈstɑːˌɡeɪ.zɪŋ","uk_link":"../audio/s/ukstarg002.mp3","content":"stargazing noun [U]\n(LOOKING AT STARS/PLANETS)\nAdd to word list\nAdd to word list\nthe activity of looking up at the stars and objects in space as a hobby, as part of scientific study, or as part of astrology (= the belief that the position of the stars influences people's lives): The forest is far from any city lights and perfect for stargazing. Where is the best place to set up a telescope for stargazing?\nMore examplesFewer examplesThe astronomy professor stood on a ladder inside the Observatory getting ready for a night of stargazing. Once limited only to scientists, stargazing took off among amateurs in the 1960s.Until not too long ago professional stargazing was a tough business, demanding as much physical stamina as scientific know-how.\nSMART Vocabulary: related words and phrases\nAstrology\nastrologer\nastrological\nastrology\nhoroscope\nnumerological\nnumerologically\nnumerologist\nretrograde\nsign of the zodiac\nstar\nstar sign\nstargaze\nstargazer\ntransit\nzodiac\nzodiacal\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nstargazing noun [U]\n(WATCHING FAMOUS PEOPLE)\nthe activity of watching famous people in public places: We decided to go to Beverly Hills for a spot of stargazing. Whistler plays host to international celebrities, so you can combine stargazing with your apres ski. Related words\nstargaze\nstargazer\nMore examplesFewer examplesThe resort is known for its spectacular stargazing – both in the night sky and Hollywood-style.Obsession with star gazing has been a pop-culture mainstay for decades.\nSMART Vocabulary: related words and phrases\nMiscellaneous pastimes & their participants\nasana\nbicycling\nbrass rubbing\ncampanologist\ncoasteering\ngearhead\ngongoozler\ngongoozling\nhate-read\nhate-watch\nnumismatics\nphilatelist\nphilately\npigeon fancier\npotholing\nstorm chaser\nstorm chasing\nsunbathing\ntailgating\ntrainspotter\nSee more results »"}