{"id":343253,"name":"started","type":"verb","us_sound":"stɑːrt","us_link":"../audio/s/start.mp3","uk_sound":"stɑːt","uk_link":"../audio/s/ukstarg016.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nstart\nstart verb\n(BEGIN)\nA1 [ I or T ] to begin doing something: When do you start your course/your new job? We'll be starting (the session) at six o'clock. Can you start (= begin a new job) on Monday? [ + -ing verb ] They started building the house in January. [ + to infinitive ] I'd just started to write a letter when the phone rang.\nB2 [ I or T ] (also start up) If a business or other organization starts, or if someone starts one, it is created and starts to operate: She started her own software company. A lot of new restaurants have started up in the region.\nB1 [ I or T ] to begin to happen or to make something begin to happen: A new series about wildlife has started on Monday nights. Police believe the fire was started by arsonists.\nA1 [ I or T ] to begin a set of activities with the thing or person mentioned: The speaker started with a description of her journey to China. Give me your answers one by one, starting with Lucy. You could start by weeding the flowerbeds. He started his working life as an engineer but later became a teacher.\n[ I ] informal to begin to complain or be annoying in some way: Don't start with me - we're not going and that's that!informal \"It would help if Richard did some work.\" \"Oh, don't get me started on Richard!\" get started\nto begin: When can we get started? start a family\nto have your first child start something\nto begin an argument or a fight: You could tell the guy wanted to start something, so we just walked away. start work\nto begin being employed: He started work at 16 in a bakery. to start with\nB2 at the beginning, or as the first of several things: We only knew two people in Montreal to start with, but we soon made friends. To start with, we need better computers - then we need more training.\nMore examplesFewer examplesHe started as an actor, making his debut as a director in 1990.As soon as the war started, any broadcasts with a military theme were taken off the air.People have started to gossip about us.The party had hardly started when she left.Halfway through the meeting my mind started to wander.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\nget down to business idiom\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\ninaugurate\nmotion\nstart out\nstart/set/get the ball rolling idiom\nstarting\nstirring\nstrike\nstrike out (somewhere)\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccess & failure in business\nCausing things to happen\nComplaining\nParenting & caring for children\nFighting\nArguing & disagreeing\nApplying for a job\nFirst and firstly\nstart verb\n(FIRST POINT)\n[ I usually + adv/prep ] to begin at one point and then move to another, in distance or range: The run starts at/from the entrance to the park. We'll need to start (off/out) early because the journey takes six hours. Tell me what happened - start at the beginning. Ticket prices start at/from €80 and go up to €500.\nSMART Vocabulary: related words and phrases\nDeparting\nabandon\nabandon ship\nabandonment\nabsquatulate\nbackward\ndrive\np.o.q.\npiss off\npull\npull out\npull something off\npush along\npush off\nsea\ntrack\nvamoose\nwalk\nwalk off (somewhere)\nwalk out\nwithout (so much as) a backward glance idiom\nSee more results »\nstart verb\n(MOVE SUDDENLY)\n[ I ] to move your body suddenly because something has surprised or frightened you: He started at the sound of the phone.\nSMART Vocabulary: related words and phrases\nMaking short, sudden movements\naquiver\nchatter\nchoppily\nchoppiness\nconvulse\nconvulsion\njerk\njerkily\njerkiness\njerky\njig\nquake\nquiver\nrecoil\nshaky\nshook\nshudder\nsquirm\ntoss\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSurprised\nstart verb\n(WORK)\nB2 [ I or T ] (also start up) to (cause to) begin to work or operate: I'm having trouble starting the car. The engine won't start.\nSMART Vocabulary: related words and phrases\nMachines - Functioning\naction\nactuator\ndeactivation\nengaged\nfaultily\nfaulty\nfire someone up\nfunction as something/someone\nlight\noperative\npeg\npeg out\nplay something up\npower\npower (something) up\nrefire\nreset\nroad\ntick\nworking\nSee more results »\nGrammar\nBegin or start?We can use the verbs begin and start to mean the same thing but begin is more formal than start. Begin is an irregular verb. Its past simple form is began and its -ed form is begun: …\nPhrasal verbs\nstart (something) off\nstart someone off\nstart on something\nstart on at someone\nstart out\nstart over\nstart (something) up"}