{"id":343260,"name":"starting","type":"adjective","us_sound":"ˈstɑːr.t̬ɪŋ","us_link":"","uk_sound":"ˈstɑː.tɪŋ","uk_link":"","content":"Add to word list\nAdd to word list\nhappening or used at the beginning of a process: A lower starting dose is recommended for patients who have moderate or severe liver impairment. Children in Britain start school at five or earlier, whereas the starting ages are six in France, Germany and Italy and seven in Denmark.\nsports\n&#160; specialized The starting players in a team are the ones chosen to start playing at the beginning of a game, rather than the substitutes (= players who are used for part of a game instead of other players): starting lineup He will have to earn his way back into the starting lineup. The team's starting fifteen won't be named until tomorrow night. See also\nstarting block\nstarting date\nstarting gate\nstarting line\nstarting pistol\nstarting pitcher\nstarting point\nstarting price\nstarting salary\nstarting time\nMore examplesFewer examplesYou may want to consider accepting a lower starting income in return for a pay-out that increases incrementally each year.Pensioners may reject this option because of the lower starting pension that they will receive.Carlos Edwards made a welcome return to the starting eleven.There are just three changes to the starting line-up.The starting goalkeeper for the US soccer team will be Brad Fredel.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstirring\nthe ground floor\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games\nthe act of beginning something, or the fact of beginning: After two years of starting and stopping, he is now seriously learning to drive. They had taken no part in the actual starting of the revolution.\nthe act of beginning to work or operate, or of making something do this: There is a safety button to prevent the accidental starting of the mower. Then there was the sound of car doors banging and the starting of engines.\nMore examplesFewer examplesThere was a lot of resistance to the starting of this venture.You could hear the repeated starting and stopping of the tape.The starting of large electrical motors may cause a large power draw.\nSMART Vocabulary: related words and phrases\nStarting and beginning\nbe in the first flush of idiom\nbe/get in on the ground floor idiom\nbecome\nbegin\nbranch out\ndevelop\ngrow\nhalf-cock\nhere\nhere goes! idiom\nhit the ground running idiom\nmotion\nsail in\nstart (something) off\nstart on something\nstart out\nstart/set/get the ball rolling idiom\nstirring\nthe ground floor\nwheel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - Functioning"}