{"id":343190,"name":"stargazer","type":"noun","us_sound":"ˈstɑːrˌɡeɪ.zɚ","us_link":"../audio/s/usstarg001.mp3","uk_sound":"ˈstɑːˌɡeɪ.zər","uk_link":"../audio/s/ukstarg001.mp3","content":"stargazer noun [C]\n(LOOKING AT STARS)\nAdd to word list\nAdd to word list\na person who is involved in astronomy or astrology: Environmentalists and stargazers both want dark skies. Star gazers with small telescopes may be able to spot the comet on Monday night. Compare\nastrologer\nastronomer\nMore examplesFewer examplesStargazers around the world watched as a small black spot crossed from one side of the sun to the other.Summer skies can be frustrating to even the most casual stargazers.For thousands of years, stargazers have seen the aftermath of supernova explosions in the night sky.\nSMART Vocabulary: related words and phrases\nAstrology\nastrologer\nastrological\nastrology\nhoroscope\nnumerological\nnumerologically\nnumerologist\nretrograde\nsign of the zodiac\nstar\nstar sign\nstargaze\nstargazing\ntransit\nzodiac\nzodiacal\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nstargazer noun [C]\n(WATCHING FAMOUS PEOPLE)\nsomeone who watches famous people in public places: Celebrities, stargazers, and movie executives all attend the Cannes film festival. An army of star-gazers followed the singer wherever he went.\nMore examplesFewer examplesStargazers and paparazzi turned out in force for a glimpse of the actor.For serious star-gazers, there's a red-carpet special at 8pm.Star gazers will get their celebrity fix with appearances by Ben Affleck, Anthony Hopkins, and Laura Linney.\nSMART Vocabulary: related words and phrases\nMiscellaneous pastimes & their participants\nasana\nbicycling\nbrass rubbing\ncampanologist\ncoasteering\ngearhead\ngongoozler\ngongoozling\nhate-read\nhate-watch\nnumismatics\nphilatelist\nphilately\npigeon fancier\npotholing\nstorm chaser\nstorm chasing\nsunbathing\ntailgating\ntrainspotter\nSee more results »\nRelated words\nstargaze\nstargazing"}