{"id":343300,"name":"stash","type":"verb","us_sound":"stæʃ","us_link":"../audio/s/stash.mp3","uk_sound":"stæʃ","uk_link":"../audio/s/ukstarg026.mp3","content":"Add to word list\nAdd to word list\nto store or hide something, especially a large amount: The stolen pictures were stashed (away) in a warehouse. He needed a place to stash some cash. Compare\nhoard verb\nThesaurus: synonyms, antonyms, and examples\nto keep somethingkeepI've kept all my grandmother's jewellery.storeI've stored all Helen's books in the attic.stashHis money was stashed in a cupboard.saveI have some really good chocolates that I've been saving for a special occasion.hang ontoYou should hang onto that picture - it might be worth something.\nSee more results »\nMore examplesFewer examplesHughes owned countless aircraft, which he stashed all over the country. Several powerful bombs were found stashed in the trunk of his rental car. My gut feeling is he's got the stuff stashed somewhere.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstockpile\nstockpiling\nstorage\nstore\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHiding and disguising\nan amount of something that has been stored or hidden, especially a large amount: They discovered a stash of money hidden at the back of a drawer. Quilters are notorious for having big stashes of fabrics.\nMore examplesFewer examplesThe police discovered a large stash of drugs.He was afraid that someone might steal his stash.So many healthy people been given private stashes of antibiotics to use at their whim.\nSMART Vocabulary: related words and phrases\nHiding and disguising\nbe holed up idiom\nbooby trap\ncamo\ncamouflage\ncamouflaged\ncloak\ndrown\nhole up (somewhere)\nillusion\nillusionistically\nillusively\nillusorily\nobscure\nsecrete\nshut someone/something out\nsidle\nskulk\nsmokescreen\nstealthy\ntuck\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and storing things\nAdd to word list\nAdd to word list\nto store or hide something: Extra blankets are stashed in the closet. stash noun [ C ] us\nYour browser doesn't support HTML5 audio\n/stæʃ/\nHe has a stash of old comic books in the attic.\nAdd to word list\nAdd to word list\nto store something, especially a large amount of money, in a safe place, often secretly: She stashed an $84 million fortune in foreign bank accounts.stash sth away He had never revealed to his wife that he had stashed away $3 million in assets. stash noun [ C ]\nOver 20 years the extra savings will add $160,000 to your retirement stash."}