{"id":343381,"name":"stating","type":"verb","us_sound":"steɪt","us_link":"../audio/s/state.mp3","uk_sound":"steɪt","uk_link":"../audio/s/ukstarg028.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nstate\nB2 to say or write something, especially clearly and carefully: Our warranty clearly states the limits of our liability. [ + (that) ] Union members stated (that) they were unhappy with the proposal. [ + question word ] Please state why you wish to apply for this grant. Children in the stated (= named) areas were at risk from a lack of food, the report said.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the newspapers, records, etc.according toAccording to reports, the ceasefire is holding.as stated by/inAs stated by medical experts, these products are totally safe when used correctly. as maintained byThere is no reason to change your diet, as maintained by some lifestyle experts.as claimed bySo-called superfoods will not make you live longer, as claimed by some advertising.\nSee more results »\nMore examplesFewer examplesHe stated firmly that no concessions will be made to the strikers.The rebel leaders stated that they are willing to enter into dialogue with the government.The police stated that some 50 rounds had been discharged.The assessor stated that the fire damage was not as severe as the hotel's owner had claimed.All recipes in this book, unless otherwise stated, will serve four to five people.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »"}