{"id":343382,"name":"station","type":"noun","us_sound":"ˈsteɪ.ʃən","us_link":"../audio/s/station.mp3","uk_sound":"ˈsteɪ.ʃən","uk_link":"../audio/s/ukstate012.mp3","content":"station noun [C]\n(BUSES/TRAINS)\nAdd to word list\nAdd to word list\nA1 a building and the surrounding area where buses or trains stop for people to get on or off: UK a railway stationUS a railroad station a train/bus/coach station Our office is near the station. We looked on our map to find the nearest underground/tube (US subway/metro) station.\nJulian Elliott Photography/Photolibrary/GettyImages\nMore examplesFewer examplesShall we get a taxi to the station?It's a good half hour's walk to the station from here.They hugged each other when they met at the station.Is there any possibility that you could pick me up from the station?\"Can you get me to the station by 11.30?\" \"No problem.\"\nSMART Vocabulary: related words and phrases\nTrain & bus stations & taxi ranks\nbaggage room\nbus shelter\nbus station\nbus stop\ncabstand\ncoach station\ndepot\ninter-terminal\ninterstation\nleft luggage\nrailway station\nrank\nrequest stop\nretiring room\nstaging post\nstop\ntaxi rank\nterminal\ntrain station\nSee more results »\nstation noun [C]\n(BROADCASTING)\nB1 a company that broadcasts radio or television programmes: a radio/television station a commercial/foreign station The reception is not very good - try to tune in to another station.UK a pirate (= illegal) station\nMore examplesFewer examplesWe drove past an advert for the local radio station.There are plans afoot to launch a new radio station.The radio station is on air from 6.00 a.m.The newcomer on the radio scene is a commercial station devoted to classical music.The radio station received a lot of calls complaining about the show's bad language.\nSMART Vocabulary: related words and phrases\nBroadcasting in general\nairplay\nairtime\nairwaves\naudio described\naudio description\ncarry\ncommentary box\nheadline\nhost\ninterchannel\nlive stream\nlocation\nmistune\nproduce\nserialize\nshowrunner\nslow motion\nstation break\nsubtitled\ntune\nSee more results »\nstation noun [C]\n(PLACE)\na building or place used for a particular service or type of work: US a gas stationUK a petrol station a police/fire station\na place where scientific information about the natural world is collected: The research station will monitor wildlife, vegetation and the water table. The scientists trawl for fish and set gill nets at sampling stations on each beach. Compare\ninterstation\nmainly Australian English a large farm with animals in Australia and New Zealand: a sheep station\nMore examplesFewer examplesI bought a pint of milk at the petrol station.I spoke to a policeman and he told me to call in at the station.\nSMART Vocabulary: related words and phrases\nBuildings in general\n-bedroomed\nbeach hut\nbuilding\nbunkhouse\ncampanile\nfour-square\ngeodesic dome\nhalf-timbered\nheritage\nheritage-listed building\nnew-build\nnon-residential\nnon-structural\nNorman\nobservation tower\nstructurally\nstructure\ntower\nturreted\nwarren\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFarms & ranches\nstation noun [C]\n(POSITION)\na particular position that someone has been ordered to move into or to stay in: The police took up their stations at the edge of the road, holding back the crowd.\nsomeone's position in society, especially the position that they are born into: If everyone just meekly accepted their station in life, nothing would ever change. She was accused of having ideas above her station. Manual work was considered below their station.\nSMART Vocabulary: related words and phrases\nPlaces and locations\nanatopism\nbehind\ncapital\ncoign of vantage\ncore\ndirection\ndrop-in\nfar from the madding crowd idiom\nhill\nmadding\nmakerspace\nMecca\nmulti-location\nmulti-site\nsituation\nspot\nstronghold\nsubsite\ntechnology park\nvenue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClass & class-consciousness in general\nIdiom\nout of station\nto cause especially soldiers to be in a particular place to do a job: I hear your son's in the army - where's he stationed? The regiment was stationed in Singapore for several years. Armed guards were stationed around the airport. Synonyms\npost\nsend\nSMART Vocabulary: related words and phrases\nThe armed forces generally\nanti-military\narmy\nAWOL\nbarracks\nCAO\ncasualty assistance officer\ncasualty notification officer\ncasualty officer\ndog tag\nechelon\nguard\nmufti\nparamilitary\npsych ops\nquarter\nquick march! idiom\nsoldierly\ntemporary duty\nthe armed forces\nthe SBS\nSee more results »\nstation noun [C]\n(BUILDING)\nAdd to word list\nAdd to word list\na building or buildings and the surrounding area where a particular service or activity takes place: a train/bus station a gas station a police/fire station\nstation noun [C]\n(BROADCAST ORGANIZATION)\na place or organization that sends out radio or television broadcasts, or the broadcasts sent out: At our house in the mountains we only get two TV stations. I can’t tune in that radio station.\nstation noun [C]\n(POSITION)\na particular position that someone has been ordered to move into or stay in: The honor guard took their stations at the side of the road.\nstation verb [T]\n(POSITION)\nto cause someone, esp. a soldier, to be in a particular place to do a job: I hear your son’s in the army – where’s he stationed?\nAdd to word list\nAdd to word list\nWORKPLACE the place or desk where someone does their work: The guard was away from his station when the alarm sounded. You will usually find the receptionist at her station in the lobby.\nTRANSPORT a place where trains or buses stop for people to get on or off: a bus/subway/train station The firm's offices are near Euston station.\nCOMMUNICATIONS a company that sends out radio or television broadcasts: a radio/television/TV station It is part of a stable of five major FM stations owned by the Pacifica Radio Foundation.\na building or place used for a particular service or type of work: a fire/police/polling station a petrol/gas station See also\ndocking station\npower station\nworkstation"}