{"id":343323,"name":"state","type":"noun","us_sound":"steɪt","us_link":"../audio/s/state.mp3","uk_sound":"steɪt","uk_link":"../audio/s/ukstarg028.mp3","content":"state noun\n(CONDITION)\nAdd to word list\nAdd to word list\nB2 [ C ] a condition or way of being that exists at a particular time: a state of The building was in a state of disrepair.state (of mind) She was found wandering in a confused state (of mind). Give me the keys - you're not in a state to drive.state of shock After the accident I was in a state of shock.state of affairs I came home to an unhappy state of affairs (= situation). The kitchen was in its original state, with a 1920s sink and stove. the state of play UK\nthe present situation: the state of play in The article provides a useful summary of the current state of play in the negotiations.\nSee more\nMore examplesFewer examplesExercise can make a big difference to your state of health.The old railway cottages were in a state of dereliction.The whole office was in a state of disorder.Over the years the church has fallen into a state of neglect.I was in a state of shock for about two weeks after the accident.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\naspect\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nstate noun\n(COUNTRY)\nC1 [ C or U ] a country or its government: The drought is worst in the central African states.member state Britain is one of the member states of the European Union. The government was determined to reduce the number of state-owned industries. Some theatres receive a small amount of funding from the state.affairs/matters of state formal His diary included comments on affairs/matters of state (= information about government activities).\nB1 [ C ] a part of a large country with its own government, such as in Germany, Australia, or the US: Alaska is the largest state in the US Representatives are elected from each state. the States informal\nused to refer to the US: In 1946, Baskin returned to the States and married a local woman.\nSee more in state\nIf a king, queen, or government leader does something in state, they do it in a formal way as part of an official ceremony: The Queen rode in state to the opening of Parliament.\nSee more\nMore examplesFewer examplesAll attempts at diplomacy have broken down and the two states now appear to be on a collision course.Abortion is restricted in some American states.The United States is a federation of 50 individual states.Representatives of the member states will be meeting next week.The creation of independent states has led to a resurgence of nationalism.\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nIdiom\nbe in/get into a state\nB2 to say or write something, especially clearly and carefully: Our warranty clearly states the limits of our liability. [ + (that) ] Union members stated (that) they were unhappy with the proposal. [ + question word ] Please state why you wish to apply for this grant. Children in the stated (= named) areas were at risk from a lack of food, the report said.\nThesaurus: synonyms, antonyms, and examples\nto say somethingsayWhen I say your name, raise your hand.utterShe barely uttered a word all morning.they sayThey say the house is haunted.it is saidIt is said that a chain is only as strong as its weakest link.stateUnion members stated that they were unhappy with the proposal.remarkHe remarked that she was looking thin.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\naccording to the newspapers, records, etc.according toAccording to reports, the ceasefire is holding.as stated by/inAs stated by medical experts, these products are totally safe when used correctly. as maintained byThere is no reason to change your diet, as maintained by some lifestyle experts.as claimed bySo-called superfoods will not make you live longer, as claimed by some advertising.\nSee more results »\nMore examplesFewer examplesHe stated firmly that no concessions will be made to the strikers.The rebel leaders stated that they are willing to enter into dialogue with the government.The police stated that some 50 rounds had been discharged.The assessor stated that the fire damage was not as severe as the hotel's owner had claimed.All recipes in this book, unless otherwise stated, will serve four to five people.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nB2 provided, created, or done by the state (= government of a country): state education/industries state control state funding/pensions/subsidies\nState events are formal official ceremonies that involve a leader of a country or someone who represents the government: the state opening of Parliament a state funeral\nreferring to a part of a large country that has its own government: the state legislature a state sales tax the state superintendent of education for Indiana\nMore examplesFewer examplesHe's a strong advocate of state ownership of the railways.They received state funding for the project.I'm not interested in state handouts - all I want is a job.The governor has denied making improper use of state money.The police couldn't arrest him because he'd fled across the state line.\nSMART Vocabulary: related words and phrases\nPolitics - general words\nanti-capitalism\nanti-capitalist\nanti-communism\nanti-communist\nanti-fascism\ninterparty\ninterpellate\ninterpellation\ninterventionist\nlab\non message\nOrwellian\noverstep\nparliament\nparty politics\nstatesman\nstatesmanlike\nstateswoman\nsubsidiarity\nsuper-conservative\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nstate noun [C]\n(WAY OF BEING)\nAdd to word list\nAdd to word list\na condition or way of being: The stable was preserved in its original state. Your room is in a terrible state. It's a sad state of affairs (= a bad situation) when our rivers are so endangered.\nstate noun [C]\n(PLACE)\npolitics &amp; government one of the political units that some countries, such as the US, are divided into: New York State the State of Arizona\npolitics &amp; government A state is also a country or its government: the member states of the United Nations the States US history\nThe States is another way of referring to the United States: When will you be visiting the States?\nstate verb [T]\n(EXPRESS)\nto express information clearly and carefully: His will states the property is to be sold. Please state your preference.\nstate adjective [not gradable]\n(PLACE)\nprovided, created, or done by the state: a state legislature/law state police\npolitics &amp; government State also refers to formal or official government activities: a state dinner\nAdd to word list\nAdd to word list\n[ C, usually singular ] the condition that someone or something is in at a particular time: The offices were in a state of disrepair. The index for capital goods production is a key indicator of the state of the economy. They commented on the poor state of the company's finances. Some economists are predicting that public finances will return to a healthy state within five years. They are paid a stable, fair price, regardless of the current state of the market.\nstate of affairs\na situation: Poor decisions by the board bear most of the responsibility for this sorry state of affairs.\nthe state of play UK\nthe present situation: The meeting reviewed the state of play in each market.\n[ C ]\n&#160; GOVERNMENT\n&#160; (also State) a country with its own government: the West African State of Ghana The legislation requires the agreement of every one of the EU's member states. In December 1991, the Union of Soviet Socialist Republics was broken up into fifteen independent states.\n[ C ]\n&#160; GOVERNMENT\n&#160; (also State) a part of a large country such as Australia, Germany, or the US that has its own government: The German federal states have a large degree of autonomy. the northern/southern/eastern/western states of the US The company operates hospitals in 12 states, including Texas and California. The Navajo reservation stretches from Arizona into two neighbouring states.\n[ U or S ]\n&#160; GOVERNMENT\n&#160; (also the state); (also the State) the government of a country: funded/provided/run by the state affairs/matters of state The government was determined to reduce the number of state-owned industries. They hope to reduce dependence on the state by paying benefits only to those whose income falls below a new, higher tax threshold.\nthe States [ plural ] informal\nused to refer to the United States of America: If they wish to work in the States again, they must show proof of employment with a US-based employer. See also\ncorporate state\nwelfare state\nto say or write something, especially when it is done clearly and carefully: Our warranty clearly states the limits of our liability.state that The rules state that the directors are required by law to prepare financial statements for each financial period. Make your claim in writing, stating your full name and address.state a fact/opinion I wasn't criticizing the way you run the department; I was merely stating facts.\n[ usually passive ] to give or agree the details of something: a stated commitment/goal The central bank's stated goal is to keep the inflation rate between 1 and 3%. Time deposits are non-negotiable deposits maintained in a banking institution for a specified period of time at a stated interest rate. A fund with a 50% turnover has bought and sold half of the value of its total investment portfolio during the stated period.\nprovided, owned, or done by the government of a country: state companies/enterprises/monopolies The main ports are owned by state economic enterprises. state education/a state school state subsidies\nrelating to a particular state of a country, especially the US: state agencies/employees/legislature"}