{"id":343343,"name":"statement","type":"noun","us_sound":"ˈsteɪt.mənt","us_link":"../audio/s/statement.mp3","uk_sound":"ˈsteɪt.mənt","uk_link":"../audio/s/ukstate004.mp3","content":"Add to word list\nAdd to word list\nB2 something that someone says or writes officially, or an action done to express an opinion: The government is expected to issue a statement about the investigation to the press. He produced a signed statement from the prisoner. He threw paint over the fur coats because he wanted to make a statement about cruelty to animals. [ + that ] We were not surprised by their statement that jobs would be cut. Synonyms\nannouncement\ncomment\ncommunication formal\ndeclaration (ANNOUNCEMENT)\nobservation (NOTICING) formal\nproclamation\npronouncement formal\nutterance formal or specialized\nThesaurus: synonyms, antonyms, and examples\nsomething you say or write that expresses an opinioncommentThe MP could not be reached for comment.remarkHis controversial remarks about race were widely reported.statementIn a statement released earlier today, the team denied allegations of cheating.declarationThe sovereign made a formal declaration of war. observationShe makes some interesting observations about human nature in her book. commentaryI love that sports announcer's commentary - it's always so funny!\nSee more results »\nC2 (also bank statement) a record of the amounts of money paid into and taken out of your bank account during a particular period of time: Check you statement and see if the money has been taken from your bank account. He keeps all his bank statements and files them away.\nThesaurus: synonyms, antonyms, and examples\nan accountaccountThe company's accounts show a loss in the first quarter.the booksI let our accountant do the books.bank statementI receive a monthly bank statement.statementThe bank sends me a statement every month.\nSee more results »\neducation\n&#160; UK specialized (also statement of educational needs) a document that gives details of a the special needs of a child with a particular disability or problem and any extra help he or she should receive at school: Around a quarter of the class has a statement. Our son, who has a statement of educational needs, goes to a mainstream school.\nMore examplesFewer examplesMy original statement has been completely distorted by the media.The statement said there would be no end to the violence until the terrorists' demands were met.The statement excited new speculation that a senior minister may be about to resign.The Palace has issued a statement criticizing the newspaper report.The Vatican released a statement condemning the recent terrorist attacks.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\nknown\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nBanks\nused to refer to a piece of clothing, jewellery, etc. that is designed to be very noticeable and stylish: People don't mind spending £500 for a statement piece.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoluminously\nvoop neck\nwaisted\nwashable\nwasp waist\nSee more results »\neducation\n&#160; specialized to officially give a child with a particular disability or problem a statement of educational needs: My five-year-old grandson has a speech impediment for which he has been statemented. She is specially trained to work with statemented children.\nAdd to word list\nAdd to word list\nsomething that is said, esp. formally and officially: The candidate made a statement to the press.\nA statement is also an act or object that expresses an idea or opinion: a fashion statement They wore the armbands as a political statement.\nA statement is also a piece of paper that lists financial details: a bank/credit card statement\nAdd to word list\nAdd to word list\nCOMMUNICATIONS something that you say or write officially: make/release/issue a statement She thought the executives were likely to make a statement after the meeting.a written/public/joint statement The company put out a written statement but refused requests for press interviews.say sth in a statement 'Business gathered momentum again in Germany following two years of decline,' the company said in a statement.\nBANKING a printed or electronic record of the money that is paid into or taken out of your bank account during a particular period of time: You can log on and read your statements online. See also\nbank statement\nACCOUNTING, FINANCE a printed or electronic document showing that money has been paid or received: Each employee receives a formal annual statement of the monetary value of the benefits they are receiving from the company. A confirmation statement will be sent following all transactions other than those involving a reinvestment of dividends.\nSee also\naverage statement\nbank statement\nchairman's statement\ncompletion statement\nenvironmental impact statement\nfinancial statement\nfunds flow statement\nincome statement\nmission statement\npersonal statement\nView all\nproxy statement\nreconciliation statement\nregistration statement\ntrading statement"}