{"id":343449,"name":"status","type":"noun","us_sound":"ˈsteɪ.t̬əs","us_link":"../audio/s/eus74371.mp3","uk_sound":"ˈsteɪ.təs","uk_link":"../audio/s/ukstate027.mp3","content":"status noun\n(OFFICIAL POSITION)\nAdd to word list\nAdd to word list\nC1 [ C or U ] an accepted or official position, especially in a social group: The association works to promote the status of retired people as useful members of the community. There has been an increase in applications for refugee status. The success of her book has given her unexpected celebrity status. Applicants should have a degree or a qualification of equal status.\nMore examplesFewer examplesFew would dispute his status as the finest artist of the period.They want to elevate the status of teachers.It's a very hierarchical organization in which everyone's status is clearly defined.John Lennon gained iconic status following his death.The school has charitable status.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nseat\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nstatus noun\n(RESPECT)\nthe amount of respect, admiration, or importance given to a person, organization, or object: high/low status As the daughter of the president, she enjoys high status among her peers. The leaders were often more concerned with status and privilege than with the problems of the people.\nSMART Vocabulary: related words and phrases\nImportance - general words\nall that matters\ncentre of gravity\ncornerstone\ncriticality\nfocus\ngrandness\nimport\nmeaning\nmomentousness\noverfocus\npertinence\npre-eminence\nprecedence\nsignificance\nsubstantial\nsupereminence\nsupremacy\ntranscendence\nurgency\nworth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nQuality and standard\nstatus noun\n(SOCIAL MEDIA)\n[ C ] on a social media website, especially Facebook™, a piece of information that you publish about yourself telling people what you are doing, thinking, etc. at a particular time\nstatus noun [U]\n(POSITION)\nAdd to word list\nAdd to word list\nposition or rank, esp. in a social group or legal system: The association works to promote the status of retired people as active and useful members of the community.\nStatus can also mean state or condition at a particular time: The type of treatment used will depend on the patient’s health status.\nstatus noun [U]\n(RESPECT)\nthe position of respect and importance given to someone or something: The leaders often seemed to be more concerned with status and privilege than with the problems of the people.\nAdd to word list\nAdd to word list\n[ S or U ] the official or legal position of a person or organization: Employers are required to check the legal status of their new hires to ensure that they are eligible to work. The group was granted charitable status.change the status of sb/sth He needs to get a permit to change the land's status from agriculture to industrial. The qualification will raise her status to staff nurse.\n[ S or U ] the situation at the present time: Everybody is concerned right now with the financial status of the whole country. Your order status has changed to \"Dispatched\".\n[ S or U ] the level or position of someone or something in relation to others in a group: high/low status We have a much higher number of women workers in low-paid, low-status jobs. They want to improve the status of women.sb/sth's status as sth London's status as Europe's leading aviation hub Developers are cashing in on the area's newly hip status.\n[ U ] a high position within a social group: There is prestige and social status attached to ownership of certain brands. Suits were a sign of status. See also\ncredit standing\nmarital status"}