{"id":342696,"name":"stayed","type":"verb","us_sound":"steɪ","us_link":"../audio/s/stay.mp3","uk_sound":"steɪ","uk_link":"../audio/s/ukstaun005.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nstay\nstay verb\n(NOT LEAVE)\nA1 [ I ] to not move away from or leave a place or situation: They need an assistant who is willing to stay for six months. Stay until the rain has stopped. Can you stay after work to play tennis? Because of the snow, children were told to stay at home.\nThesaurus: synonyms, antonyms, and examples\nto wait waitWe need to wait in line for the tickets.wait forWe're waiting for the bus.awaitWe are awaiting the committee's decision.stayStay there until I get back.remainPlease remain in your seats until the plane has come to a complete stop.hang onHang on, I'll be ready in a minute.\nSee more results »\nMore examplesFewer examplesCan you stay a bit longer?It was cold and wet outside so we stayed at home.You can stay here if you like.Stay and have a drink with us.I'm afraid I can't stay.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nhold\nnon-rotating\nnon-tenured\noutstay\noverstay\noverwinter\nrest\nspot\nstand\nstay on\nstay put idiom\nstick\nstick around\nstop in\ntarry\nSee more results »\nstay verb\n(CONTINUE)\nB1 [ I usually + adv/prep, L ] to continue doing something, or to continue to be in a particular state: Stay away from the edge of the cliff. He decided not to stay in teaching/medicine/the army. The final figures showed that most departments had stayed within budget. It was so warm we stayed (out) in the garden until ten that night. Put a lid on the pan so the food will stay hot. The shops stay open until nine o' clock. They stayed friends after their divorce.\nMore examplesFewer examplesShe manages to stay cheerful despite everything.Many small businesses are struggling to stay afloat.Biscuits will stay crisp if you keep them in an airtight container.This is so boring, it's all I can do to stay awake.Her proposals would allow more people to stay in full-time education.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\nstability\nstabilization\nstabilize\nstably\nstay\nunreformed\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nstay verb\n(LIVE)\nA2 [ I ] to live or be in a place for a short time as a visitor: I stayed in Montreal for two weeks then flew home. They said they'd stay at/in a hotel. My kids usually stay with their grandparents for a week in the summer. stay overnight (also stay the night)\nto sleep somewhere for one night: We've arranged to stay overnight at my sister's house.\n[ I ] Indian English or Scottish English to live somewhere permanently: I still stay with my parents.\nMore examplesFewer examplesI stayed in a marvellous clifftop hotel.We stayed in a fancy hotel near the Champs-Élysées.We stayed on one of the lesser-known Greek islands.The farmhouse we stayed in was completely off the beaten track.They stayed with us for a short time.\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\npopulate\nreoccupation\nrepopulate\nrepopulation\nreside\nresidence\nsettle\nslum\ntenancy\nwarehousing\nSee more results »\nIdioms\nhere to stay\nstay on the sidelines\nstay put\nstay the coursePhrasal verbs\nstay away from someone/something\nstay behind\nstay in\nstay on\nstay out\nstay out of something\nstay over\nstay up"}