{"id":342687,"name":"stay","type":"verb","us_sound":"steɪ","us_link":"../audio/s/stay.mp3","uk_sound":"steɪ","uk_link":"../audio/s/ukstaun005.mp3","content":"stay verb\n(NOT LEAVE)\nAdd to word list\nAdd to word list\nA1 [ I ] to not move away from or leave a place or situation: stay for They need an assistant who is willing to stay for six months.stay until Stay until the rain has stopped. Can you stay after work to play tennis? Because of the snow, children were told to stay at home.\nThesaurus: synonyms, antonyms, and examples\nto wait waitWe need to wait in line for the tickets.wait forWe're waiting for the bus.awaitWe are awaiting the committee's decision.stayStay there until I get back.remainPlease remain in your seats until the plane has come to a complete stop.hang onHang on, I'll be ready in a minute.\nSee more results »\nMore examplesFewer examplesCan you stay a bit longer?It was cold and wet outside so we stayed at home.You can stay here if you like.Stay and have a drink with us.I'm afraid I can't stay.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nhold\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nstop in\nSee more results »\nstay verb\n(CONTINUE)\nB1 [ I usually + adv/prep, L ] to continue doing something, or to continue to be in a particular state: Stay away from the edge of the cliff.stay in He decided not to stay in teaching/medicine/the army. The final figures showed that most departments had stayed within budget.stay (out) It was so warm we stayed (out) in the garden until ten that night. Put a lid on the pan so the food will stay hot. The shops stay open until nine o' clock. They stayed friends after their divorce. To prevent anyone from being hurt, officials told people they had to stay away. Those of a sensitive disposition are advised to stay well away.\nMore examplesFewer examplesShe manages to stay cheerful despite everything.Many small businesses are struggling to stay afloat.Biscuits will stay crisp if you keep them in an airtight container.This is so boring, it's all I can do to stay awake.Her proposals would allow more people to stay in full-time education.\nSMART Vocabulary: related words and phrases\nKeeping and staying the same\nanti-progressive\ncalcification\ncalcify\nconsistency\nconsistent\ncontinuum\ninvariant\ninveteracy\nkept\nleave well alone idiom\nleft\npeg\nstability\nstabilization\nstabilize\nstably\nsteadfast\nwallow\nwallow in something\nwouldn't have it any other way idiom\nSee more results »\nstay verb\n(LIVE)\nA2 [ I ] to live or be in a place for a short time as a visitor: stay in I stayed in Montreal for two weeks then flew home.stay at/in They said they'd stay at/in a hotel.stay with My kids usually stay with their grandparents for a week in the summer. stay overnight (also stay the night)\nto sleep somewhere for one night: We've arranged to stay overnight at my sister's house.\nSee more\n[ I ] Indian English or Scottish English to live somewhere permanently: I still stay with my parents.\nMore examplesFewer examplesI stayed in a marvellous clifftop hotel.We stayed in a fancy hotel near the Champs-Élysées.We stayed on one of the lesser-known Greek islands.The farmhouse we stayed in was completely off the beaten track.They stayed with us for a short time.\nSMART Vocabulary: related words and phrases\nLiving or sleeping somewhere\nabide\nco-resident\nco-residential\ndomiciled\ndwell\ninhospitable\ninhospitably\nlive in\nlive in sin idiom\nlive out\nlodge\npopulate\nreoccupation\nrepopulate\nrepopulation\nreside\nresidence\nsettle\nslum\ntenancy\nSee more results »\nIdioms\nhere to stay\nstay on the sidelines\nstay put\nstay the coursePhrasal verbs\nstay away from someone/something\nstay behind\nstay in\nstay on\nstay out\nstay out of something\nstay over\nstay up\nstay noun\n(VISIT)\nB1 [ C ] a period of time that you spend in a place: stay at/in She planned a short stay at/in a hotel to celebrate their anniversary.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nstop\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nswing by/past (something)\nSee more results »\nstay of execution, deportation, etc. law\n&#160; specialized\nan order by a judge that stops a judgment being performed until new information can be considered: The governor refused to grant a stay of execution.\nSee more\nstay verb\n(NOT LEAVE)\nAdd to word list\nAdd to word list\n[ I ] to not move away from or leave a place: I have a meeting at three so I can’t stay long. They need an assistant who is willing to stay for six months. Can you stay for dinner? James had to stay after school to complete the assignment. Because of the snow, he stayed home from school today. She’s come back home to stay (= She will not move away again).\nstay verb\n(CONTINUE)\nto continue to be in a particular state or position, or to continue doing something: [ I always + adv/prep ] Stay away from the edge of the cliff. [ I always + adv/prep ] His boss asked him to stay on as manager for another year. [ I always + adv/prep ] Mom told me not to stay out/up too late. [ L ] I found it difficult to stay awake/calm/warm. [ L ] The store stays open until 9 p.m. [ L ] They stayed friends, even after they moved to different countries. [ L ] For further news of the hurricane, stay tuned (= keep listening to this program).\nstay verb\n(LIVE TEMPORARILY)\n[ I ] to live in a place for a short time as a visitor, or just sleep there: We stayed in San Francisco for a few days before flying to Hawaii. I’ll be staying overnight at my sister’s house.\nIdiom\nstay put\na period of time that you spend in a place: They plan a short stay at a motel while the house is being painted.\nAdd to word list\nAdd to word list\nto not move away or leave: stay for 2 days/2 weeks/2 years, etc. They need an assistant who is willing to stay for six months.stay at work/home We stayed at work until 10 pm.stay in/on sth She will stay on the board after she steps down as CEO.stay here/there How long do you plan to stay here in Boston?\nto continue doing something, or to continue to be in a particular state: stay open/closed The shops stay open until 9 o' clock.stay in/on/at sth It is becoming too expensive for small dairy farms to stay in business.stay within sth Most departments had stayed within budget. Phrasal verb\nstay on"}