{"id":343564,"name":"stealth","type":"noun","us_sound":"stelθ","us_link":"../audio/s/stealth.mp3","uk_sound":"stelθ","uk_link":"../audio/s/ukstaun017.mp3","content":"Add to word list\nAdd to word list\nmovement that is quiet and careful in order not to be seen or heard: She moved across the field with the stealth of a cat on the prowl. These thieves operate with terrifying stealth - they can easily steal from the pockets of unsuspecting travellers.\nthe quality of carrying an action out secretly, so that people do not know it is happening: It would seem that some politicians would prefer to use financial stealth rather than legislation to produce change. The weapons had been acquired by stealth.\nMore examplesFewer examplesHe can simultaneously run with the ball and cover ground with the stealth of a gazelle.\"It would be helpful to reduce calorific levels by stealth, so people don't notice there's been a change,\" he said.\nSMART Vocabulary: related words and phrases\nMoving to avoid being seen\ncreep\nprowl\nskulk\nslink\nsneak\nspirit\nstalk\nstalking\nsteal\nstealthily\nstealthy\nYou can also find related words, phrases, and synonyms in the topics:\nSecrecy and privacy\nRelated words\nstealthy\nstealthily\nused to refer to aircraft, weapons, etc. that cannot be seen on radar: The stealth fighter can fly 1,500 kilometres per hour without detection. The force relies more heavily on stealth weaponry.\nused to refer to something that is done secretly, so that people do not know it is happening: These products work in stealth mode, so that the people being spied on are totally unaware. See also\nstealth tax\nMore examplesFewer examplesA stealth bomber was detected in the city's airspace.It was the world's first effort to build the world's first stealth aircraft.The jet combines supersonic speed and a radar-baffling stealth technology.The investigators utilize stealth tactics to blend into the environment. People were ignorant of the stealth mining of their personal data by political groups and corporations.\nSMART Vocabulary: related words and phrases\nArms & munitions in general\nair-to-air\nair-to-ground\nammo\nammunition\nanti-aircraft\ncatapult\nchain mail\nchemical weapon\nconventional\ndenuclearize\ngunship\nmustard gas\nnerve gas\noffensively\nordnance\npoison gas\nsarin\nstab vest\nweapons of mass destruction\nWMDs\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\nSecrecy and privacy\nAdd to word list\nAdd to word list\nmovement that is quiet and careful in order to avoid notice, or secret or indirect action stealthily adverb us\nYour browser doesn't support HTML5 audio\n/ˈstel·θə·li/stealthy adjective us\nYour browser doesn't support HTML5 audio\n/ˈstel·θi/\na stealthy burglar"}