{"id":343551,"name":"steal","type":"verb","us_sound":"stiːl","us_link":"../audio/s/steal.mp3","uk_sound":"stiːl","uk_link":"../audio/s/ukstaun016.mp3","content":"steal verb [I or T]\n(TAKE)\nAdd to word list\nAdd to word list\nA2 to take something without the permission or knowledge of the owner and keep it: She admitted stealing the money from her employers. The number of cars which are stolen every year has risen. They were so poor they had to steal in order to eat.\nThesaurus: synonyms, antonyms, and examples\nto steal somethingstealI caught him trying to steal my bike.takeSomeone took their car from outside the house.shopliftHe was caught shoplifting by a security guard.robHe robbed a bank.burgleUK When she got home from work, she discovered that her house had been burgled.pilferEmployees pilfering paper, pens, etc. can cost employers a lot.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\nMore examplesFewer examplesEmployees who steal are dismissed automatically.He knew it was wrong to steal, but the money just lying there was too great a temptation.They stole jewellery valued at £50 000 .Thieves broke into the safe and stole everything in it.She stole the shoes from right under the assistant's nose.\nSMART Vocabulary: related words and phrases\nStealing\nabscond\nabscond with someone/something\naggravated burglary\nanti-burglar\nanti-burglary\neavesdrop\nhome invasion\nhot-wire\nhousebreaking\njemmy\njimmy\njoyriding\nkleptomania\npiracy\npiratical\npiratically\nplunder\npoach\nsnaffle\nsnarf\nSee more results »\nsteal verb [I or T]\n(DO QUICKLY)\nto do something quickly or without being noticed: She stole a glance at her watch. He stole out of the room while no one was looking.\nSMART Vocabulary: related words and phrases\nMoving to avoid being seen\ncreep\nprowl\nskulk\nslink\nsneak\nspirit\nstalk\nstalking\nstealth\nstealthily\nstealthy\nsteal verb [I or T]\n(IN SPORT)\nIn baseball, if you steal a base, you run from one of the bases (= positions on a square that a player must reach to score a point) to the next one while the pitcher is throwing the ball, and reach the base before an opponent can touch you with the ball: He is not a fast runner and has not stolen a base all year. Roberts stole second base easily.\nIn sports such as basketball, rugby, and football, to take the ball from an opponent: Thomas stole the ball and ran the length of the field to score. She stole the ball in the tackle and fed her fly-half.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBasketball, netball & volleyball\nFootball/soccer\nRugby\nGrammar\nRob or steal?Rob and steal both mean ‘take something from someone without permission’. …\nIdioms\nsteal someone's heart\nsteal someone's thunder\nsteal a march on someone\nsteal the limelight\nsteal the show/scene\nsteal noun [C]\n(BARGAIN)\na product that has a very low price, or a price that is much lower than the original cost: I picked up a new iron in the sale - it was a steal.\nSMART Vocabulary: related words and phrases\nCosting little or no money\naffordable housing\nbudget\ncatchpenny\nchargeless\ncheap\ncomp\ncostless\ndownmarket\neconomical\neconomically\nfor a song idiom\nmiserable\noff-peak\nrock bottom\nsmall change\nsupersaver\nultra-cheap\nworthless\nworthlessly\nworthlessness\nSee more results »\nsteal noun [C]\n(IN BASEBALL)\nanother word for\nstolen base\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nsteal verb [I/T]\n(TAKE AWAY)\nAdd to word list\nAdd to word list\nto take something without the permission or knowledge of the owner and keep it or use it: [ T ] They broke into cars to steal the radios. [ T ] He never paid me back, so basically he ended up stealing a hundred dollars from me.\nTo steal is also to do something quickly while trying not to be seen doing it: [ I always + adv/prep ] to steal out of a room [ T ] She stole a glance at her watch.\nsteal noun [C]\n(CHEAP ITEM)\nsomething obtained at a much lower price than its true value: At half the original price, that designer dress is a steal.\nAdd to word list\nAdd to word list\nto take something without the permission of its owner: Employees who steal are dismissed automatically. The number of cars which are stolen every year has risen.steal (sth) from sb She admitted stealing the money from her employers.\nsteal a march on sb\nto get an advantage over someone by acting before they do: Our chief competitor managed to steal a march on us by bringing out their software ahead of ours.\na product that has a very low price, or a price that is much lower than the original cost: The shares may be a steal, but investors should remain wary. Their financial commitment for the land will be around $600,000, which Peter considers a steal."}