{"id":343530,"name":"steady","type":"adjective","us_sound":"ˈsted.i","us_link":"../audio/s/steady.mp3","uk_sound":"ˈsted.i","uk_link":"../audio/s/ukstaun015.mp3","content":"steady adjective\n(GRADUAL)\nAdd to word list\nAdd to word list\nB2 happening in a smooth, gradual, and regular way, not suddenly or unexpectedly: The procession moved through the streets at a steady pace. Orders for new ships are rising, after several years of steady decline.steady flow/stream/trickle Over the last ten years he has produced a steady flow/stream/trickle of articles and papers.slow but steady Progress has been slow but steady.\nThesaurus: synonyms, antonyms, and examples\nslowslowYou're so slow - hurry up!leisurelyWe took a leisurely drive along the quiet coast road.unhurriedI like the unhurried pace of life in the countryside.gentleStart off with a gentle jog, then gradually increase your speed.\nSee more results »\nMore examplesFewer examplesThere has been a steady decrease in the number of visitors.There's been a steady flow of visitors.We're making slow but steady progress with the decorating.The last few years have seen a steady increase in the number of infections.There has been a steady improvement in the situation.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nSee more results »\nsteady adjective\n(FIRM)\nB2 not moving or changing suddenly: hold something steady I'll hold the boat steady while you climb in.hold steady Most rental prices have held steady this year.steady relationship Young people assume that if you are in a steady relationship, you don't have to worry about HIV. Synonyms\ncommitted\ndedicated\ndevoted\nfaithful (LOYAL)\nfirm (CERTAIN)\nloyal\nstalwart (LOYAL)\nstaunch\nsteadfast approving\ntrue (SINCERE)\nunfaltering\nunshakeable mainlyUK\nunswerving\nunwavering\nThesaurus: synonyms, antonyms, and examples\nnot movingstillCan't you just sit still for a moment?motionlessHe stood motionless when he saw the snake.not move a muscleHe sat there the whole time and didn't move a muscle.stock-stillShe stood stock-still as soon as she saw the bear.immobileShe sat immobile, wondering what to do next.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nstaying the sameconstantCheck to make sure your oven maintains a constant temperature.the sameYou look exactly the same as you did ten years ago!same old same oldThe Italian restaurant is under new management, but it's just the same old same old.unchangingHis novel is about the unchanging nature of humanity.unchangeableThe company's position on the matter is absolute and unchangeable.\nSee more results »\nsteady job/work\nC2 work that is likely to continue for a long time and for which you will be paid regularly: Owning your own home and having a steady job will help when applying for a loan.\nSee more\nSMART Vocabulary: related words and phrases\nStraight, even and level\nbe (as) flat as a pancake idiom\nclean\nclean-cut\ncleanly\nconsistency\nflat\nflatness\nplane\nrelax\nrhythm\nseamless\nsleek\nsleekly\nsmooth\nstraight\nstraight edge\nstraightness\nsuper-smooth\ntrue\nultra-smooth\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nKeeping and staying the same\nsteady adjective\n(CONTROLLED)\nB2 under control: a steady voice/look/gazesteady nerves You need steady nerves to drive in city traffic.steady hand Painting these small details needs a steady hand.\nused to describe someone who can be trusted to show good judgment and act in a reasonable way: a steady friend\nSMART Vocabulary: related words and phrases\nLimiting and restricting\nanti-libertarian\nboundary\nbox someone/something in\nchain\nchain someone to something\ncripplingly\ncrowd\ncurb\ncurtail\ncurtailment\nkeep (herself) to herself idiom\nkeep something down\nlimit\nlimitation\nlimitative\nstranglehold\nstunt\nsuffocatingly\ntempered\ntie someone down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWise and sensible\nRelated word\nsteadinessIdioms\ngo steady on something\nsteady on!\nsteady verb [T]\n(STOP MOVING)\nto make something stop shaking or moving: He wobbled around on the bike and then steadied himself. He steadied his rifle on the wall and fired.\nSMART Vocabulary: related words and phrases\nMaking things more or less smooth or straight\nbunch\nbunch (something) up\ncoarsen\ncoarsening\ncollapse\ncreased\ncrinkle\nfold\nfolding\nfurl\ngrooming\ninterfold\nisolator\npucker\nrumple\nsand\nsandpaper\nscrew\nsleek\nsleek back/down\nSee more results »\nsteady verb [T]\n(CONTROL)\nto become calm and controlled, or to make someone do this: Some people say that a drink will steady your nerves.\nSMART Vocabulary: related words and phrases\nCalming and relaxing\nappease\nassuage\nballs-to-the-wall\nbask\nbread\nchill\ncompose\nkick back\nlet/blow off steam idiom\nlie down\nlighten something up\nlull\nmelt\nplacebo\nrelaxation\nrelaxer\nrelaxing\nself-soothe\nsettle down\nshirt\nSee more results »\ngo steady (with someone)\nto have a romantic relationship with one person for a long period: She's been going steady with Mike for six months.\nSee more\nsteady adjective\n(GRADUAL)\nAdd to word list\nAdd to word list\nhappening or developing in a gradual, regular way over a period of time: steady improvement steady growth in profits His recovery has been slow but steady.\nsteady adjective\n(NOT MOVING)\nnot moving or changing suddenly; continuing in the same condition: a steady job/relationship I’ll hold the boat steady while you climb in. We drove at a steady 65 mph for most of the trip.\nsteady adjective\n(CONTROLLED)\ncalm and under control: Her voice was steady as she described the accident.\nsteady verb\n(STOP MOVING)\n[ I/T ] to stop shaking or moving, or to make something do this: [ T ] He wobbled a little on the bike and then steadied himself. [ I ] The stock market has steadied after a sharp fall in prices.\nsteady verb\n(CONTROL)\n[ T ] to make someone calm: He took a deep breath to steady his nerves.\nAdd to word list\nAdd to word list\ncontinuing to happen or change at a gradual and regular rate: steady rise/growth/increase Retail sales showed steady growth through 2010. Orders for new ships are rising, after several years of steady decline. The plant has made steady progress in lowering production costs. steady flow/stream/trickle Over the last 10 years he has produced a steady flow of successful new designs.\nfixed and not moving or changing suddenly: hold/remain steady Most rental prices have held steady this year.steady against sth The dollar was steady against the yen.steady income/supply/revenue The annuity yields a steady income.\na steady job is likely to last for a long time and not be lost suddenly: Her disability makes it difficult for her to keep a steady job. If he finds steady work, his family will move to the area with him.\nsteadiness noun [ U ]"}