{"id":343763,"name":"steer","type":"verb","us_sound":"stɪr","us_link":"../audio/s/steer.mp3","uk_sound":"stɪər","uk_link":"../audio/s/uksteep008.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to control the direction of a vehicle: She carefully steered the car around the potholes. This car is very easy to steer.\n[ I or T ] If a vehicle steers, it follows a particular route or direction: The ship passed Land's End, in Cornwall, then steered towards southern Ireland.\n[ T usually + adv/prep ] to take someone or something or make someone or something go in the direction in which you want him, her, or it: She steered her guests into the dining room. I'd like to steer our discussion back to our original topic. The main task of the new government will be to steer the country towards democracy.\nMore examplesFewer examplesI tried to steer the boat away from the bank.I tried to steer round the rocks on the road.I steered a bit too sharply to the left.I took her arm, and tried to steer her away from Adam.She steered me towards the door.\nSMART Vocabulary: related words and phrases\nOn the road: driving & operating road vehicles\naquaplaning\nback someone up\nbiting point\nboxed in\nbranch off\nchauffeur\ngun\nhandle\njam\nplatooning\npull\npull someone up\npush start\nrange anxiety\nreverse\nroad rage\nskid\nspeeding\nthe RAC\nton\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral words for movement\nTaking someone somewhere or telling them the way\nIdioms\nsteer a course/path\nsteer clear of someone/something\nsteer noun [C]\n(COW)\na young male of the cattle family that has had its sex organs removed, usually kept for meat\nSMART Vocabulary: related words and phrases\nNames for the male & female of animals\nbilly goat\nbitch\nboar\nboomer\nbuck\nbull\nbullock\ncob\ndoe\ndrake\ndrone\newe\ngelding\nhind\nmare\nsire\nsow\nstag\nstallion\ntigress\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCattle & similar animals\nsteer noun [C]\n(ADVICE)\ngive (sb) a steer\nUK to advise someone or give them useful information about something: Here are my questions. Can anyone give me a steer? give (sb) a bum steer\nUS to give someone bad advice: The guy at the information office gave me a bum steer - the restaurant was terrible.\nSMART Vocabulary: related words and phrases\nGiving advice\nadvice column\nadvice columnist\nadvisability\nadvisable\nadvise against doing something\nadviser\nagony uncle\nbrain trust\nclinic\nconsultant\nconsulting\ncounselling\nMonday-morning quarterback idiom\nPrivy Councillor\nrun over/through something\nshoe\nSpAd\ntake someone's advice\ntalk some sense into sb idiom\nwaste\nSee more results »\nsteer verb [I/T]\n(DIRECT)\nAdd to word list\nAdd to word list\nto control the direction of a vehicle: [ T ] It’s not easy to steer the car through these narrow streets. [ I ] fig. The speech steered clear of (= avoided) controversial issues.\nIf you steer someone, you cause the person to go in a particular direction: [ T ] She steered her guests into the dining room.\nIf you steer an activity, you cause it to deal with a particular feature or topic: [ T ] I’d like to steer the discussion back to our original topic. Idiom\nsteer clear of someone/something\nsteer noun [C]\n(MALE COW)\na young male of the cattle family that has had its sex organs removed and that is usually raised for meat\nAdd to word list\nAdd to word list\nto make something or someone go in a particular direction or progress in a particular way: steer sth back to sth I'd like to steer our discussion back to our original topic. steer sth through sth The new CEO will have to steer the company through choppy waters.\nMANAGEMENT to be in charge of a company, organization, etc.: We have done a lot of long-term thinking about how we will steer the company.\nsteer a course/path\nto take a series of actions carefully in order to achieve a particular thing: The government will steer a course of stability for the economy.\nsteer clear\nto avoid someone or something that seems unpleasant, risky, or dangerous: steer clear (of sth/sb) He tries to steer clear of an overdraft on his current account. She has managed to steer clear of any suggestion of a conflict of interest. The risks are high, and careful investors should steer clear.\na piece of information or advice: I need a steer on what to do next.give sb a steer (on/with sth) Can someone please give me a steer on how to install the software?"}