{"id":343679,"name":"steel","type":"noun","us_sound":"stiːl","us_link":"../audio/s/steal.mp3","uk_sound":"stiːl","uk_link":"../audio/s/ukstaun016.mp3","content":"Add to word list\nAdd to word list\nB2 a strong metal that is a mixture of iron and carbon, used for making things that need a strong structure, especially vehicles and buildings: steel girders/rods/struts a steel helmet a steel-plated army truck\nMore examplesFewer examplesa steel millCoke is used in the production of steel.The concrete is strengthened with steel rods.Guitar strings nowadays are made from steel or nylon.The gates were locked with a padlock and a heavy steel chain.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnetism\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nIdiom\nlike a steel trap\nsteel yourself\nto force yourself to get ready to do something unpleasant or difficult: [ + to infinitive ] She steeled herself to jump out of the plane. I had to steel myself to be firm with her. We knew there was likely to be a recession and steeled ourselves for a fall in profits. When he made the announcement, he knew he would have to steel himself for the criticism that would follow. If you apply for jobs at this level, you have to steel yourself against rejection.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\nprep\npreparation\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\nSee more results »\nsteel noun [U]\n(METAL)\nAdd to word list\nAdd to word list\na strong metal that is made by processing iron to remove some of the carbon: steel doors/girders the steel industry\nsteel verb [T]\n(PREPARE)\nto prepare yourself to be able to do something unpleasant or difficult: She steeled herself to face her accusers.\nAdd to word list\nAdd to word list\na strong metal that is a mixture of iron and carbon, used for making things that need a strong structure, especially vehicles and buildings: They have an annual production of about two million tons of steel.steel rod/girder/container The concrete is strengthened with steel rods. steel imports/exports/prices a steel plant/factory\nthe industry that produces steel: The area's main industries are cement, iron, and steel. He asked the U.S Congress to move swiftly to aid the state's ailing steel industry.steel company/group/giant The company has become one of the region's most influential steel giants. steel jobs/workers"}