{"id":343730,"name":"steep","type":"adjective","us_sound":"stiːp","us_link":"../audio/s/steep.mp3","uk_sound":"stiːp","uk_link":"../audio/s/uksteep001.mp3","content":"steep adjective\n(NOT GRADUAL)\nAdd to word list\nAdd to word list\nB1 (of a slope) rising or falling at a sharp angle: a steep slope It's a steep climb to the top of the mountain, but the view is worth it. The castle is set on a steep hill/hillside.\nC1 A steep rise or fall is one that goes very quickly from low to high or from high to low: There has been a steep increase/rise in prices.\nMore examplesFewer examplesShe scrambled up the steep hillside and over the rocks.There's a very steep slope just before you reach the top of the mountain.I had to climb a steep flight of stairs to her front door.The car's speed slackened off as it went up a steep hill.House prices now seem to be levelling off after the steep rises of the last few years.\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\ninclination\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitch\npitched\nrake\nslant\nslanting\nslantingly\nslantwise\nslope\nsloping\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeography: hills & mountains\nNot expected or planned\nChanging\nsteep adjective\n(TOO MUCH)\ninformal (especially of prices) too much, or more than is reasonable: They are having to face very steep taxes. We enjoyed our meal at the restaurant, but the bill was a bit steep. The membership fees at the golf club are pretty steep.\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nSMART Vocabulary: related words and phrases\nCosting too much\na bottomless pit idiom\nbottomless\ncapital intensive\ncheap at half the price idiom\nclobber\ncost an arm and a leg/a small fortune idiom\ncost someone a pretty penny idiom\ncost someone dear idiom\ndaylight robbery\ndear\ngouge\nnon-competitive\noutprice\novercharge\npretty\nprice fixing\nprice someone out\nprice yourself out of the market idiom\nsight\nsky-high\nSee more results »\nRelated word\nsteepness\nto cause to stay in a liquid, especially in order to become soft or clean, or to improve flavour: Leave the cloth to steep in the dye overnight. We had pears steeped in red wine for dessert.\nSMART Vocabulary: related words and phrases\nEnclosing, surrounding and immersing\nbeleaguer\nbeleaguered\nbeset\nborder\nbox someone/something in\ndunk\nenclosure\nfence something off\nflooding\ngather\ngift wrap\ngift-wrapped\ngirdle\nsiege\nsteep something/someone in something\nsubmersion\nsurround\nswaddle\nswallow\nswamp\nSee more results »\nIdiom\nsteeped in bloodPhrasal verb\nsteep something/someone in something\nsteep adjective [-er/-est only]\n(NOT GRADUAL)\nAdd to word list\nAdd to word list\n(of a slope) rising or falling at a sharp angle: The train slowed as it went up a steep incline.\nA steep rise or fall is one that goes very quickly from low to high or from high to low: Yesterday’s steep decline in the value of the dollar was unexpected.\nsteep adjective [-er/-est only]\n(TOO HIGH)\n(esp. of prices) too high; more than is reasonable: We enjoyed our stay at the hotel, but the charges were a bit steep.\nsteep verb [I/T]\n(MAKE WET)\nto stay or cause to stay in a liquid, esp. in order to improve flavor or to become soft or clean: [ I ] Let the tea steep for five minutes. [ T ] This stain will come out if you steep the cloth in cold water.\nTo be steeped in something is to be filled with it or to know a lot about it: [ T ] The college is steeped in tradition.\nAdd to word list\nAdd to word list\nsudden and very big: steep decline/drop/fall With the steep fall in the price of oil, the economy has slowed significantly.steep rise/increase The property market is beginning to decline after years of steep price increases.\nvery high or higher than is reasonable: steep fee/charge/cost Investors are concerned about the steep cost of the banking bail-out. Co-operatives could soon face steep taxes."}