{"id":344033,"name":"step","type":"verb","us_sound":"step","us_link":"../audio/s/step.mp3","uk_sound":"step","uk_link":"../audio/s/uksteep019.mp3","content":"Add to word list\nAdd to word list\nB1 to move by lifting your foot and putting it down in a different place, or to put your foot on or in something: She stepped backwards and fell over a chair.step out They stepped out onto the balcony.step in Be careful not to step in the mud.step on Ow, you stepped on my foot!mainly US Sorry but Mr Taylor has just stepped (= gone) out for a few minutes, but I'll tell him you called.formal Step this way please, sir.\nMore examplesFewer examplesI stepped on a nail sticking out of the floorboards.I slipped as I stepped onto the platform.When it was his turn to dive, he gulped and stepped up onto the diving board.He stepped out into the night and the whirling snow.I stepped out of the building and immediately a bullet whistled past my head.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhiking\nhoof it idiom\nrace walking\nrambler\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\nwalk\nwalkable\nwalkabout\nwalkies\nwalking\nSee more results »\nIdioms\nstep back (in time)\nstep into the breach\nstep on it\nstep out of line\nstep up to the platePhrasal verbs\nstep aside\nstep aside/down\nstep away\nstep back\nstep something down\nstep forward\nstep in\nstep into something\nstep on someone\nstep out on someone\nMore phrasal verbs\nstep up\nstep something up\nstep noun\n(STAGE)\nB2 [ C ] a stage in a process: What's the next step in the process?step ahead We must stay one step ahead of our competitors.step in the right direction Most people believe that the decision to cut interest rates was a step in the right direction.a/one step at a time Let's take things a step/one step at a time (= slowly).next step Following the success of our products in Europe, our logical next step is to move into the American market.\nB2 [ C ] an action in a series of actions taken for a particular purpose: take a step The country is taking its first tentative steps towards democracy.take a step to We need to take drastic steps to reduce pollution.take the step of The president took the unusual step of altering his prepared speech in order to condemn the terrorist attack.\nThesaurus: synonyms, antonyms, and examples\nnecessary actionactionThey are considering legal action.course of actionThey have not yet decided on a particular course of action.measureMeasures are in place to prevent flooding.stepThese simple steps will ensure that infections are not spread.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take actiontake actionIt may already be too late to take action to prevent the loss of habitat these animals face.actThey need to act decisively to prevent further damage to crops.take measuresWe call on the government to take the necessary measures to bring to justice those responsible for this attack.take stepsThe authorities have taken steps to prevent any reoccurrence of the problem. do somethingIt's about time the government did something about it.\nSee more results »\nstep by step\nC1 dealing with one thing and then another thing in a fixed order: step-by-step instructions\nSee more\nMore examplesFewer examplesThis new drug could be an important step in the fight against cancer.The first step in empowering the poorest sections of society is making sure they vote.The recent free elections mark the next step in the country's progress towards democracy.It's a big step, leaving your parents and going off to university.So what's the next step? How do we progress the situation?\nSMART Vocabulary: related words and phrases\nStages & phases\nearly-stage\nearly-term\nhome run\nhome straight\nin phase/out of phase idiom\ninterstage\nlandmark\nleg\nmulti-step\nmultiphasic\npartway\nperiod\nphase\npoint\nshovel-ready\nstage\ntertiary\ntwilight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing and acts\nstep noun\n(STAIR)\nB1 [ C ] one of the surfaces that you walk on when you go up or down stairs: a flight of stepsclimb a step We had to climb some steps to reach the front door.(front) step I asked them to leave the parcel on the (front) step (= outside the door to the house).mind the step Mind the step as you leave the train.negotiate a step It's difficult for people in wheelchairs to negotiate (= move up and down) steps.step on One of the steps on the ladder is broken.\ntimefreeze/RooM/GettyImages steps [ plural ] UK\nanother word for\nstepladder : kitchen steps\nSee more\nMore examplesFewer examplesShe clung to the handrail as she walked down the slippery steps.He dislocated his knee falling down some steps.I can't face walking up all those steps again.There's a long flight of steps ascending to the cathedral doors.She can't walk up all those steps, not with her bad leg!\nSMART Vocabulary: related words and phrases\nParts of buildings: stairs & lifts\nchairlift\nchute\ndrag lift\ndumb waiter\nelevator\nescalator\nfire escape\nflight\nladder\nlift\nrope ladder\nrung\nstair\nstaircase\nstairlift\nstep-free\nstepladder\nstoep\nstoop\ntread\nSee more results »\nstep noun\n(FOOT MOVEMENT)\nB1 [ C ] the act of lifting one foot and putting it down on a different part of the ground, such as when you walk or run: take a step Sophie took her first steps when she was eleven months old.take a step towards He rose to his feet and took a couple of steps towards her.with a step With every step, her feet hurt her more and more.retrace your steps I retraced my steps, looking for my lost keys. See also\nfootstep\n[ C ] the distance you cover when you take a step: I'd only gone a few steps when I realized I'd forgotten to lock the door.\n[ U ] the way you move your feet when you are walking or running, which can sometimes show how you are feeling: a spring in someone's step She walked out of the office with a spring in her step (= in a way that showed she was happy).mind/watch your step The driver told us to mind/watch our step (= walk carefully) as we got off the bus.\n[ C ] a particular movement that you make with your feet when you dance: dance step She's teaching me some basic dance steps. in step\nWhen people walk in step, they lift their feet off the ground and put them down again at the same time: The soldiers marched in step.\nused to say that opinions, ideas, or ways of living that are the same as those of other people: keep in step with Television companies need to keep in step with public opinion.\nSee more out of step\nWhen someone is out of step, they do not lift the same foot and put it down again at the same time as other people: I'm no good at dancing - I always get completely out of step.\nused to say that opinions, ideas, or ways of living that are different from those of other people: out of step with The Republicans are out of step with the country, Williams said.\nSee more\nMore examplesFewer examplesHe took a step backwards to allow her to pass.She took a few faltering steps.He took short mincing steps.She walked slowly with tottering steps.Take a couple of steps forwards.\nSMART Vocabulary: related words and phrases\nWalking and walkers\nbring/call something/someone to heel idiom\ncavalcade\nconstitutional\nfoot traffic\nhiker\nhiking\nhoof it idiom\nrace walking\nrambler\nretread\nshanks's pony\nsleepwalk\nsleepwalking\ntramp\ntread\nwalk\nwalkable\nwalkabout\nwalkies\nwalking\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDance & choreography\nstep noun\n(MUSIC)\n[ C ] the difference in pitch between two notes that are next to each other in the western musical scale\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\nIdioms\na few/couple of steps\nwatch your step\none step forward, two steps back\na step backwards\na step forward\nused with nouns showing a family relationship to show that the person is not your biological (= related by birth) relative, but is part of your stepfamily (= a family that is formed by two people and the child or children of one or both of them from a previous relationship): He has recently remarried and now has three stepchildren and a step-grandson. They have a stepsister and stepbrother nearly their own age from their father's second marriage. His parents had divorced when he was young, and he grew up with his mother, half-sister and stepfather.\nMore examplesFewer examplesI have a step-son who is 12.My step-daughter recently came to live with us.Shewas upset about having to share a bedroom with her new stepsister.\nSMART Vocabulary: related words and phrases\nFamily: non-blood relations\nauntie\nblended family\nbrother-in-law\nco-brother\nco-sister\ngoddaughter\ngodfather\ngodmother\ngodparent\ngodson\nnonbiologically\nsister-in-law\nson-in-law\nstepbrother\nstepchild\nstepmother\nstepmum\nstepparent\nstepsister\nstepson\nSee more results »\nstep verb [I always + adv/prep]\n(MOVE FOOT)\nAdd to word list\nAdd to word list\nto lift one foot and put it down in front of the other foot, as in walking or running: He stepped to his left, picked up the ball, and threw. We stepped carefully along the slippery path. Idiom\nstep on someone’s toesPhrasal verbs\nstep back\nstep down\nstep in\nstep out\nstep up\nstep up something\nstep noun [C]\n(STAGE)\na stage in a process: The first step in fixing our house is to put on a new roof. Let’s make these changes carefully, a step at a time.\nstep noun [C]\n(ACTION)\none action in a series, taken for a particular purpose: As a first step, both sides agreed to a cease-fire.\nstep noun [C]\n(FLAT SURFACE)\na flat surface on which you put your foot when going up or down from one level to another: Mom took a picture of us sitting on the front steps of the house.\nstep noun [C]\n(MUSIC)\n(also tone) the largest difference in sound between two notes next to each other in a musical scale (= series of notes): Tones in a scale are arranged in steps and half steps.\nstep noun [C]\n(MOVE FOOT)\nthe act of lifting one foot and putting it down in front of the other foot, as in walking or running: He took a couple of steps into the room.\nA step is the distance covered by one step: I’d only gone about three steps before I fell.\nA step is also the sound of making such a movement: I heard my father’s step on the stairs.\nA step is also a particular movement that you make with your feet when you dance: I’ve finally learned some dance steps. in step with someone\nIf you move in step with someone , you move your feet at the same time and in the same way: Three angry women marched in step down the hall.\nIdiom\nin step with someone/something\nstep into the breach\nAdd to word list\nAdd to word list\nto do someone else's work when they are unable to do it: Bill's illness meant that Kathy had to step into the breach.\nstep on it informal\nused to tell someone to drive faster or to hurry: Could you step on it? I'm late. If we want to get these orders out on time, we're going to have to step on it.\nstep out of line\nto behave in a way that is unacceptable or not expected: If he steps out of line, he could be fired.\nPhrasal verbs\nstep aside/down\nstep forward\nstep in\nstep into sth\nstep sth up\na stage in a process: the first/next step What's the first step in the programme? Following the success of our products in Europe, the logical next step is to move into the American market.a step ahead/behind We have to stay a step ahead of our competitors.\nan action taken for a particular purpose: take steps to do sth We need to take drastic steps to reduce pollution.\nin step\nhaving opinions or ideas that are the same as those of other people: keep/stay in step with sth/sb Television companies need to keep in step with public opinion.\nout of step\nhaving opinions or ideas that are different from those of other people: out of step with sth/sb Our supervisor seems to be out of step with the rest of management.\na/one step at a time\nslowly and carefully: If we do this one step at a time we won't make any mistakes.\nstep by step\ndealing with one thing and then another thing in a fixed order: Don't worry - I'll go through the procedure with you step by step. She gave me detailed step-by-step instructions.\na step forward/in the right direction\nan improvement or positive development: This may not be a complete solution, but it's a step forward. Most people believe that the decision to cut interest rates was a step in the right direction."}