{"id":344118,"name":"stepwise","type":"adjective","us_sound":"ˈstep.waɪz","us_link":"../audio/s/cdo0319usstep1658.mp3","uk_sound":"ˈstep.waɪz","uk_link":"../audio/s/cdo0319ukstep1503.mp3","content":"stepwise adjective\n(IN STAGES)\nAdd to word list\nAdd to word list\nhappening or changing in a series of regular stages: I took a stepwise approach, figuring out the problem first, then searching for possible solutions.\nMore examplesFewer examplesThe method involves the use of a cooling device for stepwise decrease of the temperature. Oxygen flow was adjusted in a stepwise fashion to decrease the oxygen content from 21% to 16% to 12% to 8%. His drift away from the religion of his birth was stepwise and slow.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nSee more results »\nstepwise adjective\n(MUSIC)\nmusic\n&#160; specialized used to describe a change from a musical note to the note that is next to it in a scale (= a series of notes): The theme of Elgar's Enigma Variations is greatly enhanced by the stepwise movement of the bass. the stepwise motion from C to D\nMore examplesFewer examplesSince stepwise movement is common in most types of music, the practising of scales forms a basic part of an instrumentalist's training.The tenor part proceeds mostly in stepwise motion.The song's stepwise melody is deceptively complex.In common with Part's other music, it has stepwise modulations and an emphasis on cyclic, thematic repetition.\nSMART Vocabulary: related words and phrases\nTechnical music terms\naccidental\nadagio\naleatory\nantiphonal\narpeggio\narr.\ncadence\ngiusto\nglide\ngroove\nharmonic\nharmonic progression\nharmony\nlegato\nsyncopation\ntempered\ntempo\ntimbre\ntime signature\ntonal\nSee more results »\ngradually, in a series of regular stages: He did not try to erase the existing business model entirely; he is changing things stepwise.\nMore examplesFewer examplesWhen significant tumor regression occurred, the medication was eventually decreased stepwise.I like to add the topping stepwise as I eat the sprouts, so it stays really crunchy.The samples further cooled very slowly to 196°C by filling the box stepwise with small amounts of liquid nitrogen over a period of 2 hours.\nSMART Vocabulary: related words and phrases\nSlow and moving slowly\n(as) slow as molasses idiom\nat a snail's pace idiom\nby and by idiom\nby degrees idiom\nclaw your way (somewhere) idiom\ncrawl\nfloat\nhang around\nin ones and twos idiom\ninch by inch idiom\ninfiltrate\ninfiltration\njog\nlabour\nsluggardly\nsluggish\nsluggishly\nsluggishness\nsnail\nwander\nSee more results »"}