{"id":344162,"name":"stereo","type":"noun","us_sound":"ˈster.i.oʊ","us_link":"../audio/s/stereo.mp3","uk_sound":"ˈster.i.əʊ","uk_link":"../audio/s/ukstere001.mp3","content":"Add to word list\nAdd to word list\n[ U ] a way of recording or playing sound so that it is separated into two signals and produces more natural sound: in stereo The concert will be broadcast in stereo.\n[ C ] a piece of electrical equipment for playing music, listening to the radio, etc. that sounds very natural because the sounds come out of two speakers (= parts for playing sound): Loud music was coming from the car stereo.\nGrassetto/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudio & video equipment\nrecording or playing sound in a way that separates it into two signals and produces more natural sound, or relating to this kind of sound: a stereo system The unit's stereo speakers sounded surprisingly good. Tape was the format that introduced stereo sound into the home. Compare\nmono noun (SOUND)\nquadraphonic\nrelating to a process, camera, etc. that creates an image that looks three-dimensional (= having width, height, and depth) by presenting two slightly different images to each eye: The photographs were taken by a high-resolution stereo camera. Stereo photography is a way of capturing an image with two different shots that combine together to create a holographic effect. Compare\nstereoscopic\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmplifiers, microphones & speakers\nPhotography\nAdd to word list\nAdd to word list\na device that plays recorded sound through two or more speakers, or sound produced in this way: [ C ] Music was blaring from her car stereo."}