{"id":344491,"name":"steward","type":"noun","us_sound":"ˈstuː.ɚd","us_link":"../audio/s/steward.mp3","uk_sound":"ˈstjuː.əd","uk_link":"../audio/s/ukstere024.mp3","content":"Add to word list\nAdd to word list\na person whose job it is to organize a particular event, or to provide services to particular people, or to take care of a particular place: Stewards will be inspecting the race track at 9.00. If you need help at any time during the conference, one of the stewards will be pleased to help you.\n(female stewardess) a person who serves passengers on a ship or aircraft\nBarry Winiker/Photolibrary/GettyImages\nUK a person who organizes the supply and serving of food at a club: He's the steward of the City of Wakefield's Working Men's Club.\nSMART Vocabulary: related words and phrases\nPeople who help or serve people professionally\naid worker\nattendant\nau pair\nbagger\nbuddy\nbusboy\ncaregiver\nconcierge\ndemonstrator\nequerry\nFAE\nfamily liaison officer\nFLO\nnon-librarian\nodd-job man\npersonal care assistant\nright-hand man\nroadie\nstylist\nvalet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: workers on/with aircraft & spacecraft\nPeople who work on boats & ships\nPeople who make & serve food\nAdd to word list\nAdd to word list\na person who is responsible for an event or for the management of a place: a race steward He has been a careful steward of our parks.\nA steward is also a person who is responsible for food or drink at a restaurant.\nA steward ( (female stewardess)) on an aircraft, ship, or train is someone who helps and serves passengers.\nAdd to word list\nAdd to word list\na person whose job it is to help people at a particular place or event: If you need help finding a room at the conference, one of the stewards will be pleased to assist you.\nTRANSPORT →\nflight attendant\nTRANSPORT a man who takes care of passengers on a ship or train: Will you have the steward deliver this message to his cabin, please?\nUK a person who organizes the supply and serving of food at a club: He's the steward of Wakefield's Working Men's Club. See also\nshop steward"}