{"id":344578,"name":"stick","type":"noun","us_sound":"stɪk","us_link":"../audio/s/stick.mp3","uk_sound":"stɪk","uk_link":"../audio/s/ukstere028.mp3","content":"stick noun\n(THIN PIECE)\nAdd to word list\nAdd to word list\nB1 [ C ] a thin piece of wood or other material: The old man was carrying a load of sticks. Police said that the child had been beaten with a stick. Find some dry sticks and we'll make a campfire. A lollipop is a sweet on a stick.\nrimglow/iStock/Getty Image Plus/GettyImages\nB1 [ C ] mainly UK (US usually cane) a long, thin wooden pole that especially old or injured people use to help them walk: walking stick He left the clinic looking frail and using a walking stick. At 84 he's still quite active, although he walks with the aid of a stick.\nStockbyte/GettyImages\nB1 [ C ] a long, thin piece of wood used in playing various sports: a hockey/lacrosse/polo stick\nAdam Burn/GettyImages\n[ C ] a long, thin piece of something: carrot/bread sticks a stick of celery/rhubarb/chewing gum/chalk/dynamite\n[ C ] US a car with a stick shift: Do you drive a stick? stick of furniture\ninformal a piece of furniture: When they got married, they didn't have a stick of furniture.\nSee more take a stick to someone/something\nto hit someone or something with a long, thin piece of wood: He said that when he was a boy, his father used to take a stick to him to punish him.\nSee more\nMore examplesFewer examplesa bundle of sticksWe go to the park and I throw sticks for the dog to run and pick up.He managed to fend off his attackers with a stick.The last time I saw Rachel she was hobbling around with a stick.The ball deflected off my hockey stick, straight into the goal.\nSMART Vocabulary: related words and phrases\nPoles, rods, shafts and sticks\nbar\nbargepole\nbaton\nbilly club\nboathook\nbollard\nlathi-charge\nlightning conductor\nlitter grabber\nlitter pick\nlitter picker\nmast\npointer\nshaft\nstake\ntelegraph pole\ntelephone pole\ntent pole\ntotem pole\ntrash grabber\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHockey\nPatterns and shapes\nCars\nstick noun\n(CRITICISM)\n[ U ] UK informal severe criticism: get/take stick I really got/took stick from my boss about being late for work again.give someone stick We gave him some stick for wearing that silly hat.\nSMART Vocabulary: related words and phrases\nDisapproving & criticizing\nanathematize\nanimadversion\naspersion\naw\nbackbite\nbarrel\nboo\ncriticism\ndeprecate\ndim\nfulminate\nniggle\nnot hold with something\nobloquy\nopprobrious\nopprobriously\nopprobrium\npeanut gallery\nsatirize\ntear\nSee more results »\nstick noun\n(COUNTRYSIDE)\nthe sticks [ plural ] informal disapproving\nan area in the countryside that is far from a town or city: in the sticks I'm sick of living in the sticks.\nSee more\nIdioms\na stick to beat someone with\nget the short end of the stick\nhave a stick up your arse\nsticks and stones may break my bones, (but words can never hurt me)\nup sticks\nstick verb\n(FIX)\nB1 [ I or T ] to cause something to become fixed, for example with glue or another similar substance: I tried to stick the pieces together with some glue/tape.stick something up with something He stuck up an announcement on the board with pins. This glue won't stick.be stuck in My car's stuck in the mud.stick to Stir the sauce so that it doesn't stick to the pan.stick together My book got wet and all the pages have stuck together. See also\nnon-stick\nstuck adjective\n[ I ] If a name sticks, it continues to be used: Although her name is Clare, her little sister called her Lali, and somehow the name stuck.\nMore examplesFewer examplesShe licked the stamps and stuck them on the parcel.I stuck a 50p stamp on the envelope.Helga stuck her posters up with Blu-Tack.I stuck the notice up on the board.The glue had set and my hand was stuck fast.\nSMART Vocabulary: related words and phrases\nGlues, gluing & stickiness\nadhere\nadherent\nadhesion\nadhesive\nadhesively\nbinder\ngloop\ngloopy\nglue\nglue gun\nglue stick\npitchy\npropanone\nputty\nScotch tape\nself-adhesive\nSuper Glue\ntackiness\ntreacly\nviscid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\nstick verb\n(PUT)\ninformal to put something somewhere, especially in a not very careful way: \"Where shall I put these books?\" \"Oh, just stick them on the table for now.\" She stuck her fingers in her ears so that she couldn't hear the noise. I'll pay for lunch - I can stick it on my expenses.\n[ T usually + adv/prep ] offensive If you tell someone to stick something or where they can stick something, it means that you do not want to keep that thing: \"I've had enough of working here,\" she said, \"You can stick your job!\"\nMore examplesFewer examplesI'll just stick my bag down.Just stick your bag under the table.I stuck my jacket over the back of my chair.I didn't know what to do with these so I stuck them outside for now.I stuck them in the fridge and left them there.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\nfit\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nsuperimpose\ntranspose\ntransposition\nSee more results »\nstick verb\n(PUSH INTO)\nB2 [ I or T, usually + adv/prep ] to push a pointed object into or through something, or (of a pointed object) to be pushed into or through something and stay there: stick something into something She stuck the needle into my arm.stick something in something We decided where to go for our holiday by closing our eyes and sticking a pin in the map.stick in A thorn stuck in her finger.stick through The metal springs were sticking through the mattress.\nSMART Vocabulary: related words and phrases\nInserting and forcing things into other things\nbed\ncram\ndig\ndig (something) into someone/something\nembed\nembedded\ngouge\ngouging\ninsertion\ninset\ninterlace\ninterpolation\ninterposition\nlodge\nreinsert\nreinsertion\nrethread\nshoehorn\nsquash\nstuck\nSee more results »\nstick verb\n(NOT CONTINUE)\n[ I ] In some card games, if you stick, you say that you do not want to be given any more cards.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nstick verb\n(ACCEPT)\n[ T ] UK informal to bear or accept something or someone unpleasant: I don't think I can stick this job a day longer. [ + -ing verb ] I don't know how you can stick living in this place.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nput up with something/someone\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nstomach\nstruggle\nsweat it out idiom\ntolerance\ntough\ntough something out\nwait\nwait something out\nweather the storm idiom\nSee more results »\nIdioms\nmake something stick\nstick in someone's mind/head/memory\nstick in someone's throat\nstick in someone's craw\nstick the/your landing\nstick to someone like glue\nstick to someone's ribsPhrasal verbs\nstick around\nstick at something\nstick by something/someone\nstick out\nstick (something) out\nstick it out\nstick out for something\nstick to something\nstick together\nstick up\nMore phrasal verbs\nstick something/someone up\nstick up for something/someone\nstick someone with something\nstick with something/someone\nstick noun [C]\n(THIN PIECE)\nAdd to word list\nAdd to word list\na thin piece of wood: The campers collected sticks to start a fire.\nA stick is also a long, thin handle with a specially shaped end, used esp. to play hockey and lacrosse.\nA stick can also be a long, thin piece of something: sticks of dynamite a stick of chewing gum\nstick verb\n(PUSH INTO)\n[ always + adv/prep ] to push something pointed into or through something, or to be pushed into or through something: [ T ] I simply cannot watch when someone sticks a needle in my arm. [ I ] He throws the knife, and the blade sticks in the wall.\nstick verb\n(ATTACH)\n[ I/T ] to attach or become attached: [ T ] Stick the tape to the back of the picture. [ I ] It was so hot that my clothes stuck to me.\nstick verb\n(PUT)\n[ T always + adv/prep ] infml to put something somewhere, usually temporarily: Stick the packages under the table for now. stick out your tongue\nIf you stick out your tongue, you push your tongue out of your mouth, usually as an insult: She stuck her tongue out at him and smiled. Note: This action is usually done by children.\nstick verb\n(BE UNABLE TO MOVE)\n[ I ] to be fixed in position and unable to move: The window sticks, making it hard to shut it. Idioms\nsomething sticks in your mind\nstick your neck out\nstick to your gunsPhrasal verbs\nstick something out\nstick something up\nstick someone with something\nstick around\nstick by someone/something\nstick out\nstick out (something)\nstick to something\nstick together\nstick up\nMore phrasal verbs\nstick up for something/someone\nstick with someone/something\nAdd to word list\nAdd to word list\nto fasten something somewhere, for example with glue: stick sth on/onto sth Stick these labels on the top of the boxes.stick sth up (with sth) He stuck up a notice on the board with pins.\nto stay at the same level or position for a long time: stick/be stuck at sth The bank's main money market rate has been stuck at 4.50% for eight weeks. The needle on the oil gauge keeps sticking."}