{"id":344597,"name":"sticky","type":"adjective","us_sound":"ˈstɪk.i","us_link":"../audio/s/sticky.mp3","uk_sound":"ˈstɪk.i","uk_link":"../audio/s/ukstick005.mp3","content":"sticky adjective\n(NOT DRY/SMOOTH)\nAdd to word list\nAdd to word list\nB1 made of or covered with a substance that stays attached to any surface it touches: a sticky mess sticky fingers The floor's still sticky where I spilled the juice. The children's faces were sticky with chocolate. Compare\nnon-stick\nstuck adjective\nIf the weather is sticky, it is very hot and the air feels wet.\nThesaurus: synonyms, antonyms, and examples\nhaving moisture in the airhumidIt gets so humid in this part of the country.muggyWhat a muggy day!sultryShe kept her bedroom window open to cool off during these long, sultry summer nights.stickyIt's going to be rather sticky outside, with the humidity level at almost 85 per cent and temperatures in the high 20s.\nSee more results »\nMore examplesFewer examplesHe'd left sticky fingermarks all over the glass.The sauce was now a sticky mass at the bottom of the pan.There's sticky stuff all over the chair.You've got sticky little hands!The bottom of the plate felt sticky.\nSMART Vocabulary: related words and phrases\nGlues, gluing & stickiness\nadhere\nadherent\nadhesion\nadhesive\nadhesively\nbinder\ngloop\ngloopy\nglue\nglue gun\nglue stick\npitchy\npropanone\nputty\nScotch tape\nself-adhesive\nSuper Glue\ntackiness\ntreacly\nviscid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSultriness & humidity\nsticky adjective\n(DIFFICULT)\ninformal difficult: There were a few sticky moments during the meeting, but everything turned out all right in the end.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidable\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\nonerous\nonerously\noverdemanding\npainstaking\npicnic\ntrickily\ntricky\ntuff\nultra-sensitive\nunintuitive\nSee more results »\nsticky adjective\n(NOT WILLING)\nUK informal unwilling to agree: Their bank manager was sticky about lending them the money they wanted to borrow.\nSMART Vocabulary: related words and phrases\nUnwilling and reluctant\narsed\nbaulk\nbe blowed if... idiom\nbe in no mood for something/to do something idiom\nbegrudge\ncompassion fatigue\ndeign\ndisinclination\ndisinclined\ndisobliging\nindisposed\nindisposition\nnot have the heart to do something idiom\nnot have the stomach for something idiom\nrather you than me idiom\nreluctance\nreluctant\nunwillingness\nwilly-nilly\nwouldn't\nSee more results »\nsticky adjective\n(BUSINESS)\nused to describe a website or shop where people like to spend a long time: Big media groups are drawn to social networking sites because of their \"sticky\" nature.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nhold\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay behind\nstay in\nstay on\nstay put idiom\nstick\nstick around\nwait something out\nSee more results »\nIdioms\ncome to/meet a sticky end\nhave sticky fingers\nsticky adjective\n(DIFFICULT TO SOLVE)\nAdd to word list\nAdd to word list\ndifficult to deal with or solve: a sticky situation a sticky issue\nsticky adjective\n(TENDING TO STICK)\ntending to stick, or covered with a substance that sticks: You had better wash your sticky fingers.\nIf the weather is sticky, it is hot and the air feels wet.\nAdd to word list\nAdd to word list\nmade of or covered with a substance that stays fixed to any surface it touches: We printed sticky labels to put on the envelopes.\nE-COMMERCE, INTERNET used to describe a website that people like to stay on for a long time: Big media groups are drawn to social networking sites because of their \"sticky\" nature.\nused to describe the slow speed with which a particular cause can have a particular effect: Home prices are a bit sticky right now because demand is down. Change is sticky: enterprises often hang on to existing ways of doing things far too long."}