{"id":344649,"name":"stiff","type":"adjective","us_sound":"stɪf","us_link":"../audio/s/stiff.mp3","uk_sound":"stɪf","uk_link":"../audio/s/ukstick006.mp3","content":"stiff adjective\n(FIRM)\nAdd to word list\nAdd to word list\nB2 firm or hard: stiff cardboard a stiff collar His clothes were stiff with dried mud. This hair spray has made my hair stiff. Mix the powder and water into a stiff paste.\nThesaurus: synonyms, antonyms, and examples\nnot bending or changing shape easilyhardIf you hit your head on a hard surface, see a doctor.stiffPost the picture in a stiff cardboard envelope so it doesn't get crumpled.rigidThe sculpture was a rigid steel and concrete structure.solidDry the clay until it's solid.firmI prefer a firm mattress.\nSee more results »\nB2 not easily bent or moved: The handle on this door is rather stiff.(as) stiff as a board The man's body was (as) stiff as a board when it was found in the snow.\nB2 If you are stiff or part of your body is stiff, your muscles hurt when they are moved: Sitting still at a computer terminal all day can give you a stiff neck.\nMore examplesFewer examplesAfter walking through the snow, my feet were frozen stiff.You'll need a stiff brush to scrape off the rust.Whisk the egg whites until stiff.I'm a bit stiff after that run yesterday.She suffers terribly in the winter when it's cold and her joints get stiff.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisply\ndilatancy\ndilatant\nerect\nfirm\nfirmness\nfossilized\npetrified\nramrod\nrigid\nrigidity\nrock-hard\nsolidly\ntense\nunjointed\nunyielding\nSee more results »\nstiff adjective\n(NOT RELAXED)\nC2 behaving in a way that is formal and not relaxed: stiff manner The general is a tall man with steel spectacles and a stiff, pompous manner.\nSMART Vocabulary: related words and phrases\nManners & levels of formality\nbutton-down\nbuttoned-up\ncasualization\nceremonious\nceremoniously\nformality\ngenteel\ngenteelly\ngenteelness\ngentility\nmannerly\nmind your p's and q's idiom\nnon-formal\nnon-U\nnot the done thing idiom\nU, u\nunbuttoned\nunstuffy\nvalediction\nvaledictory\nSee more results »\nstiff adjective\n(SEVERE)\nC2 severe and difficult: The athlete was given a stiff punishment for using drugs. They are campaigning for stiffer penalties for people who drink and drive.stiff opposition/resistance There has been stiff opposition/resistance to the proposed tax increases. It's a stiff climb to the top of the hill. Some colleges have stiffer entry requirements than others.stiff competition Both companies are worried about losing business in the face of stiff competition. a stiff breeze/wind\na strong wind: We live near the ocean, where stiff breezes cleanse the air.\nSee more a stiff drink, brandy, gin, etc.\nC2 an alcoholic drink that is very strong: A stiff whisky - that's what I need.\nSee more\nA stiff price is very expensive: We had to pay a stiff membership fee to join the health club.\nThesaurus: synonyms, antonyms, and examples\ncosting a lot of moneyexpensiveHe thinks he's special with his expensive suits and fancy shoes.dearUK I find the veg too dear in that supermarket.costlyThey made several costly mistakes, including spending $60 million on shoddy machinery. priceyThe restaurants in town are a bit pricey.exclusiveThey have an apartment in an exclusive part of town.\nSee more results »\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nseriously\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCosting too much\nstiff adverb\n(VERY MUCH)\nvery much, or to a great degree: frozen stiff I got frozen stiff (= very cold) waiting at the bus stop.scared stiff I was scared stiff when I heard someone moving around upstairs.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nstiff adverb\n(GOLF)\nso that the ball comes close to the hole: She won the 17th after hitting it stiff for a birdie. He hit his third shot stiff. Woods played a great bunker shot, coming out stiff.\nSMART Vocabulary: related words and phrases\nGolf\nbogie\ncaddy\nclip\ncrazy golf\ncut\ndriver\ndump\nfade\nfore\nfringe\ngolf\ngolf ball\noutdrive\nouthit\nround\nslice\ntap in\ntee (something) up\ntee someone off\nwood\nSee more results »\nstiff noun [C]\n(PERSON)\nUS informal a person of the type described: a working stiff you lucky stiff\nSMART Vocabulary: related words and phrases\nPeople in general\nbeggar\nbird\nbod\nbody\ncoot\ncreature\ndevil\nfellow man/men\nloiterer\nlubber\nman\nmankind\nnumber\nparty\npeeps\nperson\nperson of interest\nrogue\nsod\nvessel\nSee more results »\nstiff noun [C]\n(BODY)\nslang a dead body: They found a stiff in the river. Synonyms\nbody (PHYSICAL STRUCTURE)\ncadaver specialized\ncarcass\ncorpse\nSMART Vocabulary: related words and phrases\nDeath and dying\nbereave\nbite\nbleed out\nbuy the farm idiom\ncadaveric\ndeath toll\ndepart this life idiom\nfatality\nghost\nmacabre\npredecease\npush\nremains\nsnuff\nstarvation\nsuicidally\nterminally\nthose whom the gods love die young idiom\ntoll\nwatery\nSee more results »\nto not pay someone money that you owe them: She stiffed the cab driver.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nlash out (something)\npay top dollar idiom\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nstiff adjective\n(FIRM)\nAdd to word list\nAdd to word list\n[ -er/-est only ] firm or hard and not bending or moving easily: He had stiff leather shoes on. If the dough is stiff, add more sour cream.\n[ -er/-est only ] If your body is stiff, you cannot move easily and your muscles hurt when moved: He was unable to turn his head because of a stiff neck.\nstiff adjective\n(NOT RELAXED)\n[ -er/-est only ] not relaxed or friendly; formal: The performance was stiff and rather predictable. You can’t be stiff with a guy who takes you into his confidence.\nstiff adjective\n(SEVERE)\n[ -er/-est only ] severe; difficult to deal with or do: The penalties for corruption are stiff. Most of the team’s losses have come against stiff competition.\nstiff adjective\n(STRONG)\nstrong or powerful: A stiff wind beat against the house.\nstiff adverb [not gradable]\n(VERY MUCH)\nvery much; to a great degree: I was scared stiff during the air raids.\nstiff noun [C]\n(PERSON)\na person of the type described: I’m just a working stiff. You lucky stiff!\nslang A stiff is also a dead person’s body.\nstiff verb [T]\n(CHEAT)\nto cheat someone out of money: She stiffed the taxi driver.\nAdd to word list\nAdd to word list\nfirm, hard, or not easily bent: We use stiff cardboard in all our packaging.\nvery strong or difficult to deal with: stiff opposition/resistance/competition There has been stiff opposition to the proposed tax increases.\nvery high: a stiff price/penalty/tariff Companies sometimes pay a stiff price for switching CEOs. The minimum investment is a stiff $25,000.\nto fail to pay someone money that you owe them, or to take more money from them than they owe: stiff sb out of sth Many temporary workers have experienced getting stiffed out of their pay. Who doesn't feel stiffed when they've overpaid?"}