{"id":344805,"name":"still","type":"adverb","us_sound":"stɪl","us_link":"../audio/s/still.mp3","uk_sound":"stɪl","uk_link":"../audio/s/ukstick020.mp3","content":"still adverb\n(CONTINUING)\nAdd to word list\nAdd to word list\nA2 continuing to happen or continuing to be done: I'm still hungry. I still haven't finished writing my essay. There is still no news about the hostages. Do you still work for the government? Hope is fading that the missing child is still alive. There's still time for us to get to the cinema before the film starts.\nMore examplesFewer examplesMy visa still hasn't come through.This shirt still feels a bit damp.I was still writing away when the exam finished.Is the party still on for tomorrow?There's still lots of food on your plate.\nSMART Vocabulary: related words and phrases\nNow\ncarpe diem\ncontemporaneity\ncontemporarily\ncontemporary\ncurrent\ncurrently\neven\nhereupon\nimmediate\nin this day and age idiom\nminute\nmodern-day\nmoment\npresently\nright\nstate\nthe status quo\nthere's no time like the present idiom\nthis minute idiom\ntoday\nSee more results »\nstill adverb\n(DESPITE)\nB1 despite that: You may not approve of what he did, but he's still your brother. I know you don't like her, but you still don't have to be so rude to her. Even though she doesn't really have the time, she still offered to help.\nMore examplesFewer examplesAdmittedly, I could have tried harder but I still don't think all this criticism is fair.I've been carting these letters around with me all week, and I still haven't posted them.Dad might be nearly 90 but he's still young at heart.With all her faults, she's still a really good friend.I've read the instructions twice and I'm still none the wiser.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a contrast\nagain\nany way you slice it idiom\nat any rate idiom\nat least idiom\nbest\nbut\ndisjunctive\ngiven\nhowever\nin the face of something idiom\nin the teeth of something idiom\nmight\nnevertheless\nonly\nrate\nslice\nspite\nthough\ntooth\nwhen\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlso, extra, and in addition\nstill adverb\n(GREATER DEGREE)\nB2 to an even greater degree or in an even greater amount: The number of people killed in the explosion is likely to rise still higher. The company is hoping to extend its market still further. Still more snow fell overnight. I'll meet you at the theatre. No, better still, let's meet for a drink first. I'm worried that his car has broken down, or worse still, that he's had an accident. Why do you have to tell me still (= even) more lies?\nMore examplesFewer examplesCosts are likely to rise still higher.The death toll is set to rise still further.I could call in and see you or, better still, you could come round here.He stands to lose a lot of money and, worse still, his job.Still more people are queueing up to sign the book.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nGrammar\nStillStill is an adverb and an adjective. …\nStill as an adverbWe use still as an adverb to emphasise that something is continuing: …\nStill as an adjectiveWe use still as an adjective to say that something is not moving: …\nStill: typical errorsWe don’t use still after the main verb: …\nB2 staying in the same position; not moving: Children find it difficult to sit/stand/stay still for very long. I can't brush your hair if you don't keep/hold still. She sat perfectly still while I took her photograph. The air was so still (= there was so little wind) that not even the leaves were moving. She dived into the still (= calm and not flowing) water of the lake.\nThesaurus: synonyms, antonyms, and examples\nnot movingstillCan't you just sit still for a moment?motionlessHe stood motionless when he saw the snake.not move a muscleHe sat there the whole time and didn't move a muscle.stock-stillShe stood stock-still as soon as she saw the bear.immobileShe sat immobile, wondering what to do next.\nSee more results »\nB1 mainly UK A still drink is one that is not fizzy (= with bubbles): Would you like still or sparkling water?\nMore examplesFewer examplesShe can't sit still for two minutes.She was so still that I thought she was asleep.There wasn't a breath of wind and the leaves were all still.He wouldn't stand still long enough for me to take his picture.Children can't sit still for long without fidgeting.\nSMART Vocabulary: related words and phrases\nImmobility\nanti-jamming\nbe locked in something\nboxed in\nbudge\ncataleptic\nfreeze\nfrozen\nimmovably\njam\njammed\nlifelessly\nlock\nmotionless\nmotionlessly\nstanding\nstandstill\nstatically\nstationary\nstock-still\ntime stands still idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinks - general words\nRelated word\nstillnessGrammar\nAlready, still or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready or yet?We use already to refer to something which has happened or may have happened before the moment of speaking. Already can sometimes suggest surprise on the part of the speaker, that something is unexpected: …\nAlready, yet or still?We use still not yet or already to refer to the continuation of a situation: …\nNegatives with already, still, yetNegatives with yet mean that something has not happened up to now: …\nStillStill is an adverb and an adjective. …\nStill as an adverbWe use still as an adverb to emphasise that something is continuing: …\nStill as an adjectiveWe use still as an adjective to say that something is not moving: …\nStill: typical errorsWe don’t use still after the main verb: …\nIdiom\nstill waters run deep\nto make something stop moving or become more calm: He tried to still the swaying of the hammock.literary She cuddled her baby to still its cries.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay behind\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nwait something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalming and relaxing\nstill noun\n(NOT MOVING)\n[ C ]\n&#160; theatre &amp; film\n&#160; specialized a photograph of a piece of action in a film\n[ U ] literary a time when it is quiet and calm: In the still of the night, nothing moved.\nSMART Vocabulary: related words and phrases\nPhotography\naerial photograph\nairbrush\nanalogue\naperture\nbokeh\ncamera\nexpose\nglossy\ngolden hour\ngrainy\nhalation\nhappy slapping\nhi-res\npap\nphotojournalist\nphotoshoot\npic\npicture\nPillCam\nPolaroid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nPeaceful and tranquil\nstill noun\n(EQUIPMENT)\n[ C ] a piece of equipment used for making alcohol\nSMART Vocabulary: related words and phrases\nSpirits & distilling\nabsinthe\namaretto\napplejack\nbenedictine\nbitter\ncordial\ncreme\ncrème de menthe\ncuraçao\ndistil\nkirsch\nliqueur\nmalt\nmalt whisky\nmother's ruin\nschnapps\nsloe gin\nsmall-batch\nsotol\nspirit\nSee more results »\nstill adverb [not gradable]\n(UNTIL NOW)\nAdd to word list\nAdd to word list\ncontinuing until now or until a particular time: The universe is still expanding. Two years later she still had scars on her knees.\nstill adverb [not gradable]\n(DESPITE)\ndespite that: He was diagnosed with cancer but still returned to work. I’m a mother of two and I still hold down a job.\nstill adverb [not gradable]\n(EVEN GREATER)\nto an even greater degree or in an even greater amount: Lulu’s apartment is crammed with papers and boxes that hold still more papers.\nstill adjective, adverb [-er/-est only]\n(NOT MOVING)\nnot moving; staying in the same position: Just hold still – you’ve got a little cut on your head. Time seems almost to stand still here, doesn’t it?\nstill noun\n(EQUIPMENT)\n[ C ] a piece of equipment used for making alcohol\nstill noun\n(SILENCE)\n[ U ] quiet; silence: In the still of the night, nothing moved."}