{"id":344930,"name":"stimulate","type":"verb","us_sound":"ˈstɪm.jə.leɪt","us_link":"../audio/s/stimulate.mp3","uk_sound":"ˈstɪm.jə.leɪt","uk_link":"../audio/s/ukstick028.mp3","content":"Add to word list\nAdd to word list\nB2 [ T ] to encourage something to grow, develop, or become active: The government plans to cut taxes in order to stimulate the economy.\nB2 [ I or T ] to make someone excited and interested about something: The show was intended to stimulate and amuse. [ + obj + to infinitive ] Good teachers should ask questions that stimulate students to think. Erotic images are often more sexually stimulating to men than to women.\n[ T ]\n&#160; biology\n&#160; specialized to cause part of the body to operate: The drugs stimulate the damaged tissue into repairing itself. Standing on your head is supposed to stimulate hair growth.\nMore examplesFewer examplesThe athletes had taken pills to stimulate their metabolic rate.This legislation is designed to stimulate the faltering economy.The government is taking steps to stimulate business development in economically distressed areas .It's an artificial device which stimulates the auditory areas of the brain.It's not the sort of movie that stimulates the old grey matter much.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nseed\nspark\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInspiration and inspiring\nMaking people excited and interested\nAnimal & plant biology - general words\nAdd to word list\nAdd to word list\nto encourage something to grow, develop, or become active: Tax cuts will stimulate the economy. Read books to stimulate your child’s imagination. Some vegetables stimulate cells to manufacture a cancer-fighting enzyme. stimulation noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌstɪm·jəˈleɪ·ʃən/\nI need the intellectual stimulation of work.\nAdd to word list\nAdd to word list\n[ T ]\n&#160; ECONOMICS to encourage something to grow, develop, or become active: The government plans to cut taxes in order to stimulate the economy.stimulate growth/investment/trade Liberalization should stimulate growth.stimulate demand/sales/interest We hope the discounts will help stimulate sales.\n[ I or T ] to make someone excited and interested about something: I need to find a job that will stimulate me more. stimulation noun [ U ]"}