{"id":345139,"name":"stitch","type":"noun","us_sound":"stɪtʃ","us_link":"../audio/s/stitch.mp3","uk_sound":"stɪtʃ","uk_link":"../audio/s/ukstimu027.mp3","content":"stitch noun\n(THREAD)\nAdd to word list\nAdd to word list\nC2 [ C ] a piece of thread sewn in cloth, or the single movement of a needle and thread into and out of the cloth that produces this: Secure the two pieces together with a couple of stitches.\nTanja Luther/GettyImages\n[ C ] one of the small circles of wool that you make when you are knitting: cast on a stitch Cast on (= make the first row on the needle) 50 stitches using pink wool.cast off a stitch Cast off the first four stitches (= take them off the needle and finish the edge).drop a stitch If you drop a stitch (= lose a loop of wool from the needle), there's usually someone around who can help you.\nfstop123/iStock/Getty Image Plus/GettyImages\n[ C ] a particular type of stitch made in sewing or knitting, or the pattern that this produces: a pearl/satin stitch The bedspread was embroidered with cross-stitch.\nC2 [ C ] a length of special thread used to join the edges of a deep cut in the flesh: Her head wounds needed 50 stitches.stitch in He got hit with a broken bottle and needed five stitches in his cheek.\nbgwalker/E+/GettyImages not a stitch informal\nwithout any clothes: I don't have a stitch to wear (= I do not have anything suitable to wear) for this party tonight.\nSee more\nMore examplesFewer examplesI was admiring your neat stitches.A couple of stitches would make that more secure.She can do all these fancy stitches.She had a dozen or so stitches on her forehead.He's having his stitches taken out this afternoon.\nSMART Vocabulary: related words and phrases\nKnitting & sewing\nappliqué\nappliquéd\nAran\nBargello\nbaste\nbind\nhandknit\nhandknitted\nhank\nhem\nintarsia\nreknit\nresew\nrib\nrun something up\nrunning stitch\nsampler\nseam\nseamstress\nsew\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical treatment: surgery\nstitch noun\n(PAIN)\n[ C usually singular ] a sharp pain in the side of your stomach or chest, often caused by not breathing enough when running or laughing: get a stitch I got a stitch after running for the bus.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsore\nsting\nthrob\nSee more results »\nIdioms\nin stitches\na stitch in time (saves nine)\n[ I or T ] to sew two things together, or to repair something by sewing: be stitched onto This button needs to be stitched back onto my shirt.stitch something together Stitch the pieces together along the fold.\n[ T ] Indian English to make a piece of clothing: I must discard these old shirts and stitch some before next summer.\nSMART Vocabulary: related words and phrases\nKnitting & sewing\nappliqué\nappliquéd\nAran\nBargello\nbaste\nbind\nhandknit\nhandknitted\nhank\nhem\nintarsia\nreknit\nresew\nrib\nrun something up\nrunning stitch\nsampler\nseam\nseamstress\nsew\nSee more results »\nRelated word\nstitchingPhrasal verbs\nstitch something together\nstitch something/someone up\nstitch someone up\nstitch noun [C]\n(THREAD)\nAdd to word list\nAdd to word list\na piece of thread sewn in cloth, or the single movement of a needle and thread into and out of the cloth that produces this: She sewed neat, firm stitches.\nA stitch is also a length of special thread used to join the edges of a deep cut in the flesh: A cut on his left ankle required six stitches.\nstitch noun [C]\n(PAIN)\na sharp pain in the side of your stomach or chest: I got a stitch while I was running. Idiom\nin stitches\nstitch verb [T]\n(USE THREAD)\nto sew two things together, or to repair something by sewing: His name is stitched onto the back of his boxing trunks.\nSomeone who has been stitched up has had a deep cut closed with stitches: [ M ] The operation started at 8 a.m., and Bobby was stitched up by midafternoon."}