{"id":345195,"name":"stock","type":"noun","us_sound":"stɑːk","us_link":"../audio/s/stock.mp3","uk_sound":"stɒk","uk_link":"../audio/s/ukstock001.mp3","content":"stock noun\n(SUPPLY)\nAdd to word list\nAdd to word list\nC1 [ C or U ] a supply of something for use or sale: It is now halfway through winter and food stocks are already low.stock of The local shop has a good stock of postcards and guidebooks. Much of the city's housing stock (= the number of houses in the city) is over 100 years old.\nB2 [ U ] the total amount of goods or the amount of a particular type of goods available in a shop: This shop sells its old stock at very low prices.stock in We'll be getting our new stock in on Friday.in/out of stock The new edition is in/out of stock (= available/not available) in major bookshops.\nThesaurus: synonyms, antonyms, and examples\nable to be used or hadavailableHand sanitiser is available at every ward entrance.on handThe emergency services were on hand.come inThese shorts come in red, yellow, or blue.in printThe book is still in print after 65 years.in stockDo you have this blender in stock, or do I need to order it?\nSee more results »\nMore examplesFewer examplesShops are currently holding sales to clear their summer stock .They're trying to get old stock off their hands by cutting prices.They're selling off last year's stock at half price.They've got several nice Bordeaux in stock.It's my job to keep a check on stock levels.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\nafford\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nProducts & producers\nstock noun\n(MONEY)\n[ U ] the amount of money that a company has through selling shares to people: They own 20 percent of the company's stock.\n[ C or U ] part of the ownership of a company that can be bought by members of the public: stock price Stock prices fell yesterday in heavy trading.stocks and shares She buys and sells stocks and shares.\n[ C or U ] UK money that people invest in the government, producing a fixed rate of interest: government stock(s)\nMore examplesFewer examplesa stock traderStock prices are slowly rising.How much of the company's stock do they own?She owns a lot of stocks and shares.His company have just announced a $1 billion stock buyback.\nSMART Vocabulary: related words and phrases\nStock markets\nalgo\nanti-city\nanti-dilution\nanti-speculation\nanti-speculative\nbond\nbroker\nbull market\ndead cat bounce\nequity\nfootsie\ngilt\nICO\ninconvertible\ninitial coin offering\nintangible asset\nnon-controlling\nrentier\nrogue trader\nthe Nikkei index\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInterest & capital\nstock noun\n(LIQUID)\n[ U ] a liquid used to add flavour to food, made by boiling meat or fish bones or vegetables in water: vegetable/beef/chicken stock\n/GettyImages\nSMART Vocabulary: related words and phrases\nSauces, dressings, dips & pickles\naioli\naji\nAlfredo\napple sauce\narrowroot\nCumberland sauce\ncustard\ncustard powder\ndashi\ndeglaze\nmignonette\nmint sauce\nmirin\nmiso\nmolasses\nsalad dressing\nsalsa\nsambal\nscalloped\nsecret sauce\nSee more results »\nstock noun\n(ANIMALS)\n[ U ] animals, such as cows or sheep, kept on a farm\nSMART Vocabulary: related words and phrases\nCattle & similar animals\nbison\nbossy\nbovine\nbuffalo\nbull\nbullock\ncalf\ncattle\nFriesian\nGalloway\nheifer\nhighland\nHolstein\nmaverick\nNormande\nox\nox-drawn\nshorthorn\nsteer\nzebu\nSee more results »\nstock noun\n(OPINION)\n[ U ] formal the degree to which a person or organization is popular and respected: stock is high/low At present, the prime minister's stock is high/low.\nSMART Vocabulary: related words and phrases\nLiked, or not liked, by many people\nacquire\nan acquired taste idiom\nanti-popular\nbe the new rock and roll idiom\nbe welcome to idiom\ncult\nhigh-traffic\nin someone's bad books idiom\nin someone's good books idiom\nlimb\nlose ground phrase\nlow-traffic\npopularize\nresurge\nrock and roll\nsought after\ntop-rated\ntrend\nviral\nwell thought of\nSee more results »\nstock noun\n(ORIGIN)\n[ U ] formal the family or group that a person or animal comes from: of Irish, American, etc. stock He's an American of Irish stock.of peasant, noble, etc. stock She's of peasant/noble stock. Some of the animals will be kept as breeding stock.\nSMART Vocabulary: related words and phrases\nFamily: ancestors & descendants\nancestor\nancestral\nancestry\nbe in the/someone's blood idiom\nblood is thicker than water idiom\ndistaff\nfamily tree\nforbear\nforebear\nforefather\ngenealogy\ngeneration\ngenerationally\nheraldic\nheraldically\nheraldry\nprogenitor\nrun in the family idiom\nsandwich generation\nsuccessor\nSee more results »\nstock noun\n(HANDLE)\n[ C ] the support or handle of a tool, especially the part of a gun that rests against your shoulder\nSMART Vocabulary: related words and phrases\nParts of guns\nbanana clip\nbore\nbump stock\nbusiness end\nbutt\nclip\nflint\ngauge\nhammer\nholster\nmuffler\nmuzzle\nplier\nramrod\nsafety catch\nsight\nsilencer\ntampion\ntrigger\nSee more results »\nstock noun\n(FRAME)\nthe stocks [ plural ]\nin the past, a wooden frame that was fixed around someone's feet, hands, and sometimes head, so that they were forced to sit or stand for a long time in public as a punishment: Punishments ranged from an hour in the stocks to a public whipping.\nSee more\nstock noun\n(PLANT)\n[ C ] a garden plant with small pleasant-smelling, brightly coloured flowers\nMARIA MOSOLOVA/SCIENCE PHOTO LIBRARY/ Science Photo Library/GettyImages\nSMART Vocabulary: related words and phrases\nFlowers & flowering plants\naconite\nadam-and-eve\naeonium\nAfrican daisy\nagapanthus\neglantine\nelderflower\nelephant ear\nerythronium\neuphorbia\nloosestrife\nlords-and-ladies\nlotus\nlove-in-a-mist\nlupin\nsego lily\nself-heal\nsenecio\nsensitive plant\nShasta daisy\nSee more results »\nIdioms\nput stock in something\ntake stock\nC1 If a shop or factory stocks something, it keeps a supply of it: Most supermarkets stock a wide range of wines.\nto fill something such as a cupboard or shelves with food or goods: He has a part-time job stocking shelves in the local supermarket.stock something up I always stock up the fridge before my sister comes to stay.\nMore examplesFewer examplesHis shop stocks any number of different kinds of pasta.Our supermarket stocks apples in several different varieties.We stock a wide range of domestic appliances, including fridges, freezers, and dishwashers.We stock the full range of model railway accessories.The larger shops are able to stock a wider selection of goods.\nSMART Vocabulary: related words and phrases\nPlacing and positioning an object\n-based\nappose\naround\nchange something around\ncircle\nconsign\ngone\ninstall\nlie\npile (something) up\nplant\nredeposit\nreinstall\nreinstallation\nrelocate\nreorientate\nstick\nsuperimpose\ntranspose\ntransposition\nSee more results »\nPhrasal verb\nstock up\nstock adjective [before noun]\n(NOT SPECIAL)\n(of an idea, expression, or action) usual or typical, and used or done so many times that it is no longer original: a stock phrase/response \"Don't worry - worse things happen at sea\" is her stock expression for whenever anything goes wrong. Synonyms\nbanal\nhackneyed disapproving\nstereotypical\nthreadbare (WEAK)\ntimeworn\ntired (NOT INTERESTING) disapproving\ntrite disapproving\n(of photographs) supplied by a company or organization for people to use themselves, without having to do their own photography: The article was accompanied by two stock photographs. Today, stock images can be found in searchable online databases.\n(of a product) available for people to buy in a shop and not needing to be ordered: Our delivery times on stock items is 2-3 days. \"Personal tailoring\" usually means that alterations are made to stock sizes after your measurements are taken.\nSMART Vocabulary: related words and phrases\nStandard and routine\naverage\naverage Joe\nbog-standard\nconformance\nconformity\nconventionalized\ndefault\ngiven\ninstitutionalize\nmainline\northodox\nquotidian\nregular\nregularity\nregularization\nregularize\nround\nthe/your average bear idiom\nunchallenging\nunspectacular\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlain and ordinary\nPhotography\nProducts & producers\nstock adjective [before noun]\n(ANIMALS)\n(of an animal) used for moving other animals such as cows and sheep from one place to another: Billy was a great stock dog. Ranchers use stock horses to herd animals, or guide them from place to place.\nSMART Vocabulary: related words and phrases\nAnimal farming - general words\nanimal husbandry\naquaculture\naquaponics\nbedding\nbeekeeping\ndip\ndraft\ndrove\nhand-reared\nheeler\nherd\nhoneycomb\nkept\nshear\nsheep shearing\nsheepdog\nshepherd\nslaughter\nsubtherapeutic\nteaser\nSee more results »\nstock noun\n(SUPPLY)\nAdd to word list\nAdd to word list\n[ C/U ] a supply of something for use or sale: [ C ] New regulations should preserve stocks of haddock and other fish. [ U ] The company won’t let you return unsold stock.\n[ C/U ] Stock is also the total amount of goods or the amount of a particular type of goods available in a store: [ U ] New Video has 4000 titles in stock. [ U ] That CD is out of stock.\nstock noun\n(INVESTMENT)\n[ C/U ]\n&#160; social studies a part of the ownership of a company that people buy as an investment: [ C ] There is more risk with stocks than with bonds. [ U ] Stock prices fell this week.\nstock noun\n(FLAVORED LIQUID)\n[ U ] a liquid made by boiling vegetables or the bones from meat or fish in water which is used to add flavor to soups and other food: vegetable/beef/chicken stock\nstock noun\n(ORIGIN)\n[ U ] the family, country, or group from which a person comes: He’s an American of Irish stock.\nstock noun\n(GUN PART)\n[ C ] the part of a rifle (= long gun) that rests against the shoulder\nto keep a supply of something for use or sale: They stock all sorts of gifts for travelers.\nIdiom\nstock up (on something)\nstock adjective [not gradable]\n(USUAL)\n(of an idea, expression, or action) usual or typical: a stock phrase/response\nstock plural noun\n(ANIMALS)\nshort form oflivestock (= animals, such as cows or sheep, kept on a farm)\nAdd to word list\nAdd to word list\n[ U ]\n&#160; COMMERCE the total amount of goods that a store or business has for sale: They've got warehouses full of stock.be in stock If an item is in stock, it can be supplied the next day.have/keep sth in stock We can't keep enough high-end products in stock.be out of stock If any part of your order is out of stock, we will notify you. Most supermarkets don't have much back-room space to keep a lot of stock.\n[ C or U ]\n&#160; PRODUCTION, COMMERCE, ACCOUNTING goods that a company owns, such as parts, materials, or finished products: Companies will have to run down stocks before production can really pick up again. We have reduced stock levels to reflect lower expectations of demand. Firms should start preparing in January by deciding how much stock they'll need.\n[ C or U ]\n&#160; PRODUCTION a supply of goods or materials: Oklahoma provide up to 50% of the corn stock needed. There is a shortage of housing stock. Coffee prices rose ahead of an expected drop in stocks of beans. World fish stocks are dangerously low.\n[ C or U ]\n&#160; STOCK MARKET, FINANCE\n&#160; ( written abbreviation stk.) part of the ownership of a company that people have as an investment in the form of shares: In November, the company's stock hit $2 a share.stock rises/falls The stock fell 15.5p below the flotation price.invest in/buy/hold stock The plan would allow shareholders to buy stock at a 50% discount. James cashed in his stocks and shares. He received $1.9 million in stock. She purchased three 1,000-share blocks of the stock.\n[ C or U ]\n&#160; FINANCE, GOVERNMENT\n&#160; ( also government stock) a type of low-risk investment sold by the government that produces a fixed rate of interest: Dealers reported a flow of funds out of equities into government stock. Her portfolio of shares and government stocks grew in value. See also\nactive stock\nadvancing share\nall-stock\nauthorized stock\naverage stock\nbarometer stock\nbearer stock\nBig Board stock\nbonus stock\nbuffer stock\nView all\nbuild-to-stock\ncapital stock\nclosing stock\ncommon stock\nConsolidated Stock\nconvertible loan stock\nconvertible stock\ncyclical stock\ndead stock\ndebenture stock\nExchequer stock\nex stock\ngilt stocks\nglamour stock\ngrowth stock\nhousing stock\nincome stock\nirredeemable stock\nlisted stock\nloan stock\nmake-to-stock\nnew stock\nopening stock\nordinary stock\nparticipating preferred stock\npartly-paid stock\npenny stock\npreferred stock\nquoted stock\nredeemable stock\nregistered stock\nrolling stock\nsafety stock\nsleeper stock\nsmall stock\nsplit stock\ntap stock\ntracking stock\ntrading stock\ntreasury stock\nvalue stock\nwatered stock\nwhen-issued stock\nwidow-and-orphan stock\nto keep a supply of a particular type of goods for sale: Stores can't stock every size and cut and color. He decides which movies will be stocked at the chain's 650 stores.\nto provide a supply of something to a store or company: There's so much demand that I can't keep the store stocked.be well stocked (with sth) Manufacturers are well stocked with cheap coffee bought in advance of the quotas. Phrasal verb\nstock up"}