{"id":345378,"name":"stomach","type":"noun","us_sound":"ˈstʌm.ək","us_link":"../audio/s/stomach.mp3","uk_sound":"ˈstʌm.ək","uk_link":"../audio/s/ukstoma001.mp3","content":"Add to word list\nAdd to word list\nA2 an organ in the body where food is digested, or the soft front part of your body just below the chest: He was punched in the stomach. The doctor asked him to lie down on his stomach. The sight of blood always churns/turns my stomach (= makes me feel as if I am going to vomit). She has a very delicate stomach and doesn't eat spicy food. I was hungry and my stomach had started growling/rumbling (= making noises). He felt a knot of nervousness in the pit (= bottom) of his stomach. I suggested that some weak tea might settle (= calm) her stomach.\nWestend61/GettyImages\nMore examplesFewer examplesYou shouldn't go to work on an empty stomach.I do stomach exercises most days.I've got this strange feeling in my stomach.The illness first manifested itself as severe stomach pains.I had my driving test that morning and my stomach was churning.\nSMART Vocabulary: related words and phrases\nDigestive disorders\nachalasia\nacid reflux\nanti-diarrhoea\nanti-diarrhoeal\nAztec two-step\ncolic\ndiarrhoea\nflatulence\nflatus\ngastro-oesophageal reflux disease\ngastroenteritis\ngastroparesis\nGORD\nhyper-catabolism\nindigestion\nregurgitation\nsprue\nstomach flu\nulcerative colitis\nunexplained gastrointestinal bleeding\nSee more results »\nIdioms\nhave a strong stomach\nhave a weak stomach\nnot have the stomach for something\nto be able to accept an unpleasant idea or watch something unpleasant: He can't stomach the idea that Peter might be the next chairman. She found the violence in the film hard to stomach.\nSMART Vocabulary: related words and phrases\nTolerating and enduring\nbear with someone\nbearable\nbearably\nbide\ncome to terms with something idiom\nput up with something/someone\nresign\nresign yourself to something\nresignedly\nride something out\nrough\nsit\nstruggle\nsweat it out idiom\ntolerance\ntough\ntough something out\nwait\nwait something out\nweather the storm idiom\nSee more results »\nAdd to word list\nAdd to word list\nbiology an organ in the body where food is digested\nYour stomach is also the front part of your body near the waist.\nStomach can also mean desire or an interest in doing something: I used to watch the TV news all the time, but I no longer have the stomach for it.\nto accept or be able to deal with something that causes you difficulty: Vernon was simply too unreliable, and after awhile we couldn’t stomach his behavior."}