{"id":345617,"name":"stop","type":"verb","us_sound":"stɑːp","us_link":"../audio/s/stop.mp3","uk_sound":"stɒp","uk_link":"../audio/s/ukstoma022.mp3","content":"stop verb\n(FINISH)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to finish doing something that you were doing: Once I start eating chocolate, I can't stop. [ + -ing verb ] Stop shouting - you're giving me a headache! I couldn't stop laughing. Stop it!/Stop that!\nThesaurus: synonyms, antonyms, and examples\nto end something or cause it to endstopStop pulling your brother's hair this instant!quitQuit poking your sister, will you?haltWe halted the assembly line to check the equipment.discontinueThe lab has discontinued this line of research due to ethical concerns.ceaseAll operations at the company will cease, and the assets will be auctioned off.\nSee more results »\nB1 [ I or T ] to not continue to operate: My watch must have stopped. The air conditioner has stopped working.\nThesaurus: synonyms, antonyms, and examples\nto break downbreak downThe lift has broken down again.stop workingI don’t understand it - my phone just stopped working.crashWhen a computer crashes, you reboot.failThe train’s brakes failed, causing it to derail.\nSee more results »\nB1 [ I or T ] to not move any more or to make someone or something not move any more: Stop the car, I want to get out! I heard him shout, \"Stop, or I'll shoot!\"\nA1 [ I + -ing verb ] to finish doing something that you do regularly or as a habit: Apparently she's stopped drinking. I stopped seeing him last year.\nA2 [ I ] to pause for a short time while travelling or during an activity: Does this train stop at Finsbury Park? Why don't you just stop somewhere and ask for directions? [ + to infinitive ] I stopped to pick up a letter that I'd dropped.\nMore examplesFewer examplesOh, stop moaning!Stop hassling me!She stopped speaking for a moment and looked out of the window.I couldn't stop crying.I've stopped trying to help her.\nSMART Vocabulary: related words and phrases\nCausing something to end\nabandon\nabandonment\nall good things (must) come to an end idiom\nand have done with it idiom\nbe over the hump idiom\nbrake\ncure\nfreeze\nhalt\nhang\njack something in\nkill something stone-dead idiom\nknock\nlid\nsnap\nsnuff something out\nstamp on something\nstamp something out\nstanch\nstaunch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMachines - not functioning\nImmobility\nCancelling and interrupting\nstop verb\n(PREVENT)\nB1 [ T ] to prevent someone from doing something: If she really wants to leave, I don't understand what's stopping her. [ + -ing verb ] They've put barriers up to stop people (from) getting through. Something must be done to stop the fighting.\nThesaurus: synonyms, antonyms, and examples\nto prevent something from happeningpreventVaccination will prevent the spread of the disease.avoidLabel the boxes to avoid confusion.stopThis should stop any further trouble.avertWe had to act quickly to avert disaster.prohibitBehavioural problems in the classroom prohibit learning.checkChildren are being vaccinated in an attempt to check the spread of the disease.\nSee more results »\nstop a cheque UK (US stop a check, stop payment on a check)\nto tell your bank not to deal with a cheque that you have written, so that the money is not paid from your bank account\nMore examplesFewer examplesI can't stop her from seeing him.My mum stopped me from going.Health workers are trying to stop the disease from spreading.We are doing everything we can to stop the situation from getting worse.If he really wants to do it I can't stop him.\nSMART Vocabulary: related words and phrases\nPreventing and impeding\nanti-jamming\navoid\navoidable\navoidably\nbar\nderail\nfireproof\nhave someone/something hanging round your neck idiom\nhead off\nhinder\nhogtie\nhold back\nprejudice\nprevent\npreventable\npreventative\nprevention\nscuttle\nsmother\nsuffocate\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBanks\nstop verb\n(STAY)\n[ I ] UK to stay in a place: Are you coming with me or are you stopping here? I can't stop - Marc is waiting for me outside. Now that you're here, why don't you stop for some tea? I've been out every night this week, so I thought I'd stop in (= stay at home) tonight. We stopped up (= did not go to bed) until two o'clock last night watching the late film.\nMore examplesFewer examplesAfter stopping for a quick drink, they continued on their way.She ambled down the street, stopping occasionally to look in the shop windows.I won't stop - I'm in a bit of a rush.Shall we stop here for a while?We're hoping to make up time on the return journey by not stopping at night.\nSMART Vocabulary: related words and phrases\nStaying and remaining\nabrupt halt\nbe left phrase\ncloseted\nhalt\nhang\nnon-migrant\nnon-rotating\nnon-tenured\noutstay\noverstay\nsit\nspot\nstay behind\nstay in\nstay on\nstay put idiom\nstick\nstick around\nsticky\nwait something out\nSee more results »\nstop verb\n(BLOCK)\n[ T ] to block a hole: We stopped (up) the gap with some rags.\nSMART Vocabulary: related words and phrases\nClosing and blocking\nbarricade\nbatten\nbatten down the hatches idiom\nbe snowed up idiom\nblock something off\nbung\nchoke\ncongest\ncork\ndam\ndam something up\nensconce\nfur\nsandbag\nseal something in\nseal something off\nself-seal\nself-sealing\nsilt\nthe darkest hour is just before the dawn idiom\nSee more results »\nGrammar\nStop + -ing form or to-infinitiveWe use the -ing form after stop to indicate that an action or event is no longer continuing: …\nIdioms\nstop at nothing\nstop short of somethingPhrasal verbs\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nB1 the act of stopping an activity or journey, or a period of time when you stop: Please remain in your seat until the plane comes to a complete stop. We'd have been here sooner, but we made several stops along the way. At the beginning of the project there were a lot of stops and starts. See also\ndoorstop\nA1 a place where vehicles, especially buses, stop in order to allow passengers to get off and on: a bus stop I'm getting off at the next stop. Is this our stop (= where we must get off)?\nCarola Kohler/Corbis/GettyImages\nUK short form of\nfull stop UK\nphonetics\n&#160; specialized a\nplosive (= consonant that is made by completely stopping the flow of air) put a stop to something\nC1 to stop an unpleasant, unwanted activity or habit from continuing: He used to smoke in bed when I first got to know him, but I soon put a stop to that!\nMore examplesFewer examplesThe car came to a stop in front of an old cottage.We had a stop halfway through the journey and got some food.We made a couple of stops on the way so that Milly could go to the toilet.Is this your stop?We had an overnight stop in Singapore.\nSMART Vocabulary: related words and phrases\nPauses & interludes\nabeyance\nadjournment\nasynchronously\nbreak-journey\ncaesura\ncomfort stop\nhiatus\nhold something in abeyance\nin abeyance\ninterlude\nintermission\ninterval\nmoratorium\nnon-continuous\none-stop\npause\nplateau\npostponement\nstoppage\nsuspension\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrain & bus stations & taxi ranks\nPunctuation\nLinguistics: phonology & phonetics\nCausing something to end\nstop verb\n(FINISH)\nAdd to word list\nAdd to word list\n[ I/T ] to finish doing something or end, or to cause someone or something to finish: [ I ] When do you think the snow will stop? [ T ] When will it stop snowing? [ T ] Please stop pushing. [ T ] Fortunately, police stopped the fight before anyone got hurt.\nstop verb\n(PREVENT)\n[ T ] to prevent someone from doing something: Lifeguards stopped them from going into the water because sharks had been spotted in the area.\nstop verb\n(PAUSE)\n[ I/T ] to pause or stay in a place, or cause someone to pause: [ I ] We stopped for gas and had something to eat. [ + to infinitive ] We’d better stop at the next rest area to let the kids go to the bathroom. [ T ] Naomi was stopped at the gate and asked to show identification.\nIdioms\nstop on a dime\nstop (dead) in your tracksPhrasal verbs\nstop by/in/off\nstop over\nstop noun [C]\n(SHORT STAY)\na short period of time when you stay at a place, or the place where you stay: It was a five-hour drive including a 30-minute stop for lunch.\nA stop is a place where a bus or train pauses to allow passengers to get off and on: I’m getting off at the next stop.\nstop noun [C]\n(FINISH)\nthe act of stopping an activity, or the state in which someone or something is not moving or active anymore: Please wait until the plane comes to a complete stop before leaving your seat.\nAdd to word list\nAdd to word list\n[ I or T ] to prevent something from happening or continuing, or to not continue to happen: Are these new environmental laws enough to stop climate change? The government demanded that the payments stop.stop production/publication/trading The board obtained an injunction to stop publication of the documents.stop sb (from) doing sth To stop borrowers switching to another lender once the discount period is over, banks apply a hefty charge.\n[ T ] to finish doing something: The company's flexible pension plan allows women to suspend contributions if they stop work to have a family.stop doing sth The economic climate pressured banks to stop lending to each other.\n[ I or T ] if something such as a machine or system stops, it no longer works and needs to be repaired: I didn't realize the time because my watch has stopped. My TV came with a free radio which has stopped working.\nstop a cheque UK ( US stop payment on a check)\nBANKING to tell your bank not to pay the money relating to a cheque you have written to someone Phrasal verbs\nstop by\nstop off\nstop over\nan instruction to a bank or other financial organization to not pay any money from your account when a cheque, card, etc. is used: Banks do not normally charge for putting a stop on lost cheques.\ncome to a stop\nto stop happening: At one point mail deliveries just came to a stop.\nput a stop to sth\nto stop something bad from happening or continuing: EU regulation has put a stop to huge roaming charges when you use your mobile phone abroad. See also\nnon-stop\none-stop"}