{"id":345679,"name":"store","type":"noun","us_sound":"stɔːr","us_link":"../audio/s/store.mp3","uk_sound":"stɔːr","uk_link":"../audio/s/ukstore001.mp3","content":"store noun [C]\n(SHOP)\nAdd to word list\nAdd to word list\nB1 UK a large shop where you can buy many different types of goods: a department store a DIY/furniture store\nA1 US any type of shop: a clothing/liquor storealso UK a department storealso UK a furniture store a convenience store\nMore examplesFewer examplesHe's got a job demonstrating kitchen equipment in a department store.The company's flagship store is in New York.Bathroom furnishings are in the basement of the store, Sir.After the grocery store I took a left.The store is open for late night shopping on Wednesdays.\nSMART Vocabulary: related words and phrases\nShops & auctions\narmy disposals store\narmy surplus store\narmy-navy store\nart gallery\nauction\ncraft fair\ncraft shop\ncreamery\ndeli\ndelicatessen\nmall\nmart\nmeat market\nmedical hall\nmegastore\nsupermarket\nsuperstore\nswap meet\nsweet shop\ntabletop sale\nSee more results »\nstore noun [C]\n(STH KEPT)\nan amount of something that is being kept for future use: He has an impressively large store of wine in his cellar. Food stores are reported to be running dangerously low in the capital.figurative My grandmothers store of memories was shared over the dinner table.\na building in which things are kept until they are needed: a grain/weapons store\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCollecting and amassing\nBuildings for storing things\nIdioms\nin store\nset great, little, etc. store by something\nB2 to put or keep things in a special place for use in the future: The data is stored on a hard disk and backed up on a CD. I stored my possessions in my mother's house while I was living in Spain. I've stored my thick sweaters and jackets (away) until next winter. Squirrels store (up) nuts for the winter.\nThesaurus: synonyms, antonyms, and examples\nto keep somethingkeepI've kept all my grandmother's jewellery.storeI've stored all Helen's books in the attic.stashHis money was stashed in a cupboard.saveI have some really good chocolates that I've been saving for a special occasion.hang ontoYou should hang onto that picture - it might be worth something.\nSee more results »\nMore examplesFewer examplesWhat we lack in this house is space to store things.It's important to store perishable food in a cool place.Sound and pictures can be stored digitally, as on a CD.The owner's name and address is stored on a microchip and implanted in the dog's body.The gas is stored under pressure .\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstorage\ntrap\nSee more results »\nPhrasal verb\nstore something up\nstore noun [C]\n(PLACE TO BUY THINGS)\nAdd to word list\nAdd to word list\na place where you can buy goods or services: a grocery/hardware/video store convenience/department stores\nstore noun [C]\n(SUPPLY)\na supply of something: She has a store of anecdotes (= a large number of them) that she could draw on whenever she needed one. energy stores Idiom\nin store (for someone/something)\nstore verb [T]\n(KEEP)\nto put or keep things for use in the future: We store the garden tools in a shed in the backyard. All the information is stored on a hard disk.\nAdd to word list\nAdd to word list\nCOMMERCE\n&#160; UK a large building where you can buy many types of goods: The DIY store group has expanded steadily in several main cities. The economic crisis forced the closure of their flagship store. At present, only 6.5% of the group's store managers are women. Compare\ncash-and-carry adjective\nmegastore\nsuperstore\nCOMMERCE a place where people go to buy things: We failed to get the right products into the right stores. a grocery/hardware/record store an online store See also\nshop noun\na large building where things are kept until they are needed: a grain/weapons store\n[ usually plural ] a supply of something that is being kept so it can be used later: Gold remains one of the most reliable stores of wealth. See also\nApp Store\nbookstore\nchain store\nconsignment store\nconvenience store\ncooperative store\ndepartment store\ndestination store\ndime store\ndiscount store\nView all\ndrive-in store\ndrugstore\ngeneral store\ngift shop\nin-store\nmultiple store\npop-up store\nretail store\nsame-store\nten-cent store\nvariety store\nto put or keep something somewhere until it is needed: The fire damaged over 80% of the stock stored in the warehouse. Carbon dioxide produced when burning coal can now be stored underground rather than released into the atmosphere.\nIT to keep information, music, etc. on a computer: The system allows users to retrieve e-mail stored on a remote server.digitally/electronically stored MP3 technology allows a large amount of music to be electronically stored in a relatively compact space."}