{"id":345674,"name":"storage","type":"noun","us_sound":"ˈstɔːr.ɪdʒ","us_link":"../audio/s/storage.mp3","uk_sound":"ˈstɔː.rɪdʒ","uk_link":"../audio/s/ukstoma030.mp3","content":"Add to word list\nAdd to word list\nB2 the putting and keeping of things in a special place for use in the future: storage space We've had to build some cupboards to give us more storage space. in storage\nIf things such as furniture are in storage, they are being kept safe in a special building while they are not needed: There was still a lot of unsold fabric in storage.\nSee more\nMore examplesFewer examplesAll chairs collapse for easy storage.These garden chairs will fold flat for storage.The paper records were microfilmed to save storage space.The new wine is pumped into storage tanks.We follow very strict guidelines on the use and storage of personal details on computers.\nSMART Vocabulary: related words and phrases\nKeeping and storing things\nappropriate\naside\nbank\nbogart\ncapacitance\ncling\ndump\nkeep (something/someone) back\nkept\nlay\nlay something aside\nlay something down\nlay something in\nlodge\nstandby\nstash\nstockpile\nstockpiling\nstore\ntrap\nSee more results »\nAdd to word list\nAdd to word list\nthe act of putting things in a special place for use in the future, or the place where you put things: Fire broke out in a basement storage area. Much of the art they’ve acquired is still in storage (= being kept in a safe place and not yet in use).\nAdd to word list\nAdd to word list\nthe act of keeping things somewhere so that they can be used later, especially goods or energy supplies: storage of energy/goods/waste There must be proper plans in place for the storage of nuclear waste.a storage company/depot/facility A fire put the country's largest gas storage facility out of action. a storage bin/box/tank The contaminated petrol was traced to storage tanks at the terminal. long-term/short-term/temporary storage storage costs/capacity\nin storage\nif things are in storage, they are being kept somewhere until they are needed: There is a large amount of natural gas in storage for winter. Firms could run down the amount of goods kept in storage rather than making new ones.\nIT the process of saving and keeping information, music, etc. on a computer: For that price, customers of the web hosting service get 100 gigabytes of storage.a storage device/system Removable data storage devices have an increasingly large capacity. storage hardware/media/software storage capacity/space data/document/information storage computer/disk storage\nSee also\nself-storage\nvirtual storage"}