{"id":345705,"name":"story","type":"noun","us_sound":"ˈstɔːr.i","us_link":"../audio/s/story.mp3","uk_sound":"ˈstɔː.ri","uk_link":"../audio/s/ukstore008.mp3","content":"story noun [C]\n(DESCRIPTION)\nAdd to word list\nAdd to word list\nA2 a description, either true or imagined, of a connected series of events: Will you read/tell me a story, daddy? Martha chose her favourite book of bedtime stories. He writes children's stories. I don't know if it's true but it's a good story (= entertaining to listen to although probably not true). She gave me her version of what had happened, but it would be interesting to hear his half/side of the story (= the events as described by him). Apparently his first words to her were \"Will you marry me?\" or so the story goes (= that is what people say happened).\nB2 a report in a newspaper or on a news broadcast of something that has happened: The main story in the papers today is the president's speech.\nC2 a lie: He made up some story about having to be at his aunt's wedding anniversary.\nMore examplesFewer examplesIt's an age-old story of love and betrayal.The story is about theft, fraud and deceit on an incredible scale.Throughout the novel, the story is seen through the eyes of a detached observer.We don't know the full details of the story yet.He told the extraordinary story of his escape.\nSMART Vocabulary: related words and phrases\nAccounts and stories\nanecdote\nanother\nanti-narrative\nbe another story idiom\nbrushstroke\ncautionary tale\ncommentary\nlore\nmisdescription\nmulti-stranded\nmyth\nmythic\nplot\nscenario\nsemi-legendary\nshaggy-dog story\nshort story\nsleeping beauty\nstrand\nwrite something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNews reporting & the press\nBroadcasting: programmes & other broadcasts\nLies, lying & hypocrisy\nstory noun [C]\n(LEVEL)\nB2 US (UK storey) a level of a building: a three-story house Their new house has four stories including the attic. Synonyms\nfloor (LEVEL OF BUILDING)\nlevel (FLOOR)\nSMART Vocabulary: related words and phrases\nParts of buildings: floors & parts of floors\nbasement\ncatwalk\nceiling\ndais\ndecking\ngallery\nground level\nlanding\nloft\nlow slung\nmachicolation\nmezzanine\npodium\nrostrum\nrunway\nsoapbox\nsplit-level\nthe ground floor\nthe second floor\nwoodblock\nSee more results »\nIdioms\nit's/that's the story of my life\nthat's my story and I'm sticking to it\nto cut a long story short\nstory noun [C]\n(DESCRIPTION)\nAdd to word list\nAdd to word list\na description of events that actually happened or that are invented: There was a news story on television about flooding on the west coast. My daughter won’t go to bed without hearing a bedtime story.\nA story can also be a lie: Don’t tell me any stories – I want to know what really happened.\nstory noun [C]\n(LEVEL)\na level of a building: She lived on the third floor of a seven-story building."}