{"id":346136,"name":"strategy","type":"noun","us_sound":"ˈstræt̬.ə.dʒi","us_link":"../audio/s/strategy.mp3","uk_sound":"ˈstræt.ə.dʒi","uk_link":"../audio/s/ukstrat003.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] a detailed plan for achieving success in situations such as war, politics, business, industry, or sport, or the skill of planning for such situations: The president held an emergency meeting to discuss military strategy with the Pentagon yesterday. Their marketing strategy for the product involves obtaining as much free publicity as possible. [ + to infinitive ] We're working on new strategies to improve our share of the market.\n[ C ] a way of doing something or dealing with something: Follow this strategy for avoiding minor mistakes. We offer a group therapy session that teaches coping strategies.\nMore examplesFewer examplesWe need to decide soon what marketing strategy we should pursue for these new products.The opposition parties have so far failed to set out an alternative strategy.I think it's time to adopt a different strategy in my dealings with him.This strategy could cause more problems than it solves.We have a strategy for deciding who we pick.There are opportunities to develop vital skills and learning strategies that can be applied across the school curriculum.\nSMART Vocabulary: related words and phrases\nPlans and arrangements\naccommodation\nappointed\narrangement\narranger\nbackstop\nblueprint\ncounter-strategy\ncounter-tactic\ndesign\ndone\nexit strategy\nmaster plan\nnon-programme\npackage deal\nparty line\nplan of action\nplanning\npolicy\npreparation\nwalk-in\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWays of achieving things\nAdd to word list\nAdd to word list\na long-range plan for achieving something or reaching a goal, or the skill of making such plans: [ U ] Chess is a game that requires strategy. strategic adjective us\nYour browser doesn't support HTML5 audio\n/strəˈti·dʒɪk/\nThe hill was of strategic importance for control of the countryside. strategically adverb us\nYour browser doesn't support HTML5 audio\n/strəˈti·dʒɪk·li/\nThe cameras are strategically placed in areas with the most criminal activity.\nAdd to word list\nAdd to word list\nthe way in which a business, government, or other organization carefully plans its actions over a period of time to improve its position and achieve what it wants: Business environments and strategies are constantly changing in response to economic and financial variables. She redefined how companies think about strategy. The group's report represents a fundamental change in strategy.a strategy for doing sth How has the slowdown in the current business cycle affected your strategy for growing the business?a strategy for sth The company president has mapped out a strategy for sustainable growth in the 21st century.a strategy of sth The group's strategy of overseas diversification helped it overcome tough conditions at home.a strategy of doing sth The airline is now reaping the rewards from its strategy of cutting seat numbers and focusing on higher-paying business passengers.develop/design/produce a strategy Companies must develop strategies for adapting their brands to changing trends in the marketplace.outline/formulate/identify a strategy In order to expand your e-business operations, you need to formulate a clear strategy.work on/work out/come up with a strategy CEOs and top government officials should try to come up with a strategy for economic development that isn't simply a series of short-term political payoffs.pursue/follow a strategy They are pursuing a strategy of acquisitions to spread their third-generation mobile technology beyond the domestic marketa long-term/overall strategy Pricing is only one element of an overall strategy to curb congestion. a good/successful/winning strategy an expansion/growth/acquisition strategy marketing/management/investment strategies sales/pricing strategies See also\nbusiness strategy\ncompetitive strategy\ncorporate strategy\nextension strategy\nglobal strategy\nharvesting strategy\noperating strategy\nPorter's generic strategies\npull strategy\npush strategy"}