{"id":345938,"name":"stray","type":"verb","us_sound":"streɪ","us_link":"../audio/s/stray.mp3","uk_sound":"streɪ","uk_link":"../audio/s/ukstrat011.mp3","content":"Add to word list\nAdd to word list\nto travel along a route that was not originally intended, or to move outside a limited area: A herd of cattle had strayed into the road. They got lost when they strayed too far from the path. The ship strayed off course during the storm.\nto start thinking or talking about a different subject from the one you should be giving attention to: I think we've strayed too far from our original plan. Sorry - I've strayed from the subject.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nforfeit\nget to\nkiss\nlose\nloss\nlost\nmislay\nmisplace\nmisroute\nmiss\nslip through someone's fingers idiom\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigressing and being indirect or evasive\na pet that no longer has a home or cannot find its home: a stray dog \"Who owns that cat?\" \"I don't know. I think it must be a stray.\"\nSMART Vocabulary: related words and phrases\nGeneral & informal words for animals\nanti-predator\narthropod\nbeast\nbeastie\nbossy\nbrute\nESA\nfeathered\nfeathered friend idiom\nfour-legged friend\nfur baby\nfurry\nfurry friend\nmyriapod\npest\npet\npredator\nprey\nservice animal\nthing\nSee more results »\nStray things have moved apart from similar things and are not in their expected or intended place: There are still a few stray spots of paint on the window pane. Several journalists have been killed or injured by stray bullets while reporting on the civil war.\nSMART Vocabulary: related words and phrases\nLosing and loss\naction\nastray\nblack hole\ndisappear\nforfeit\nget to\nkiss\nlose\nloss\nlost\nmislay\nmisplace\nmisroute\nmiss\nslip through someone's fingers idiom\nunaccounted for\nunrecoverable\nunrecovered\nwalkabout\nwave\nSee more results »\nstray verb [I]\n(MOVE AWAY)\nAdd to word list\nAdd to word list\nto move away from a place where you should be or from a direction in which you should go: The children were told to stay together and not to stray. The plane disappeared after straying several hundred miles off course.\nstray adjective [not gradable]\n(LOST)\n(of an animal) having no home, or lost: Eric and Lise rescued the stray cat and named her Pashmina.\nStray also means happening by chance and lacking direction: It was just a stray thought I had while washing the dishes.\nstray noun [C]\n(LOST ANIMAL)\nan animal that is lost or has no home: We have given a home to a number of strays."}