{"id":346196,"name":"stratosphere","type":"noun","us_sound":"ˈstræt̬.ə.sfɪr","us_link":"../audio/s/stratosphere.mp3","uk_sound":"ˈstræt.ə.sfɪər","uk_link":"../audio/s/ukstrat007.mp3","content":"Add to word list\nAdd to word list\n[ C ] a layer in the upper atmosphere of a planet where the temperature increases with height: Most other planets in our solar system have stratospheres. For the first time, an exoplanet 880 light-years away was found to have a stratosphere. the stratosphere\n[ S ] the layer of gases surrounding the earth at a height of between 15 and 50 kilometres that is not affected by the weather and in which the temperature increases with height: The ash cloud rose 35km into the stratosphere. During the 1980s, the amount of ozone in the stratosphere above Europe decreased by about eight percent. See also\nasthenosphere\nthe atmosphere\nbiosphere\nexosphere\nhydrosphere\nionosphere\nlithosphere\nmesosphere\nthermosphere\ntroposphere\n[ S ] informal an extremely high level: Property prices have gone into the stratosphere. Speaking engagements are a sideline that could propel her earnings into the stratosphere . We have seen oil prices climb from the lower to the higher stratosphere .\n[ C ] informal an extremely high level of success: The deal propelled his business career into the stratosphere . The success of the rescue operation lifted the president to the political stratosphere . Related word\nstratospheric\nSMART Vocabulary: related words and phrases\nThe Earth & outer space - general words\nablate\nanti-gravity\natmosphere\natmospherically\nauroral\ngeocentric\ngravity\nhorizon\nhydrosphere\nionospheric\nlithosphere\nlithospheric\nmacrocosm\nmesosphere\nmesospheric\nMother Nature\nthe Big Bang\nunderground\nweightlessness\nzero gravity\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIncreasing and intensifying\nSuccess and achievements\nAdd to word list\nAdd to word list\nearth science the layer of gases that surrounds the earth from about seven to 30 miles above it"}