{"id":346095,"name":"strap","type":"noun","us_sound":"stræp","us_link":"../audio/s/strap.mp3","uk_sound":"stræp","uk_link":"../audio/s/ukstrai023.mp3","content":"Add to word list\nAdd to word list\nC2 a narrow piece of leather or other strong material used for fastening something or giving support: Could you help me fasten this strap around my suitcase?\nIsil Yirmibes/EyeEm/GettyImages\nwith this meaning as a combining form: a watch strap shoes with ankle straps\na strong strip of material hanging from the roof of a bus, train, or other public vehicle for passengers to hold onto if they are standing\npaparazzit/E+/GettyImages\nMore examplesFewer examplesTo keep the helmet in position, fasten the strap beneath the chin.The strap had rubbed against his skin and caused irritation.Is the strap on this helmet adjustable?Tighten the straps so they don't rub.It's a frame rucksack with a belt and padded shoulder straps.\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbar\nbinding\nblindfold\nbraid\ncollar\ndog collar\nduct tape\ngag\nloom bands\nmasking tape\nraffia\nriband\nribbon\nstraight edge\nstreamer\nstripe\nsweatband\nthong\nSee more results »\nto fasten something in position by fastening a narrow piece of leather or other strong material around it: Are the kids strapped into their car seats? We strapped the surfboard to the car roof.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nboard something up\nbolt\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap something up\nstrop\ntack\ntape something up\ntether\ntie someone down\nSee more results »\nPhrasal verbs\nstrap someone in\nstrap something up\nAdd to word list\nAdd to word list\na narrow piece of strong material, esp. leather, used for holding or fastening something: Her bag hung from its shoulder strap. I lost my watch when the strap broke.\nto hold or fasten something with a strap: I strapped on my helmet and rode off. We had to strap the mattress to the top of our car."}