{"id":345984,"name":"strain","type":"noun","us_sound":"streɪn","us_link":"../audio/s/strain.mp3","uk_sound":"streɪn","uk_link":"../audio/s/ukstrai004.mp3","content":"strain noun\n(PRESSURE)\nAdd to word list\nAdd to word list\nB2 [ C usually singular or U ] a force or influence that stretches, pulls, or puts pressure on something, sometimes causing damage: put a strain on The hurricane put such a strain on the bridge that it collapsed. As you get older, excess weight puts a lot of strain on the heart. Their constant arguments were putting a strain on their marriage. The recent decline in the dollar has put a bigger strain on the economic system. Migration into the cities is putting a strain on already stretched resources.\nC2 [ C ] an injury to a muscle or similar soft part of the body caused by using that part too much: a groin/hamstring strain See also\neyestrain\nB2 [ C or U ] something that makes you feel nervous and worried: stresses and strains She's a lot better than she was but she's still not ready to face the stresses and strains of a job.under strain He's been under a lot of strain recently.\nMore examplesFewer examplesa groin strainHis muscles knotted with the strain.Jogging puts a lot of strain on the knees.The strain must have been enormous but she bore it well.The events of the last few weeks have put a real strain on him.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnxious and worried\nInjuring and injuries\nAnxiety and worry - general words\nstrain noun\n(TYPE)\n[ C ] a particular type or quality: strain of A strain of puritanism runs through all her work.\n[ C ] an animal or plant from a particular group whose characteristics are different in some way from others of the same group: strain of Scientists have discovered a new strain of the virus which is much more dangerous.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpecies & genders\nstrain noun\n(MUSIC)\nstrains [ plural ]\nthe sound of music being played or performed: strains of I could hear the strains of Mozart in the background.\nSee more\nstrain verb\n(SEPARATE)\n[ T ] to separate liquid food from solid food, especially by pouring it through a utensil with small holes in it: Could you strain the vegetables, please.be strained off The oil in which the fish is fried is strained off and used to cook potatoes.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nstrain verb\n(PRESSURE)\nB2 [ I or T ] to become stretched or to experience pressure, or to make something do or experience this: I've put on such a lot of weight recently - this dress is straining at the seams. I strained a muscle in my back playing squash.strain your eyes Don't watch TV in the dark - you'll strain your eyes! [ + to infinitive ] figurative I really had to strain (= try very hard) to reach those top notes.strain (your ears) figurative I was straining (my ears) (= listening hard) to hear what they were saying.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nsnug\nstiffen\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\nstrain verb\n(MONEY)\nC2 [ T ] to cause too much of something to be used, especially money: Increases in wholesale oil prices have strained the company's finances.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunnecessary\nunwarranted\nweigh someone/something down\nSee more results »\nIdioms\nbe straining at the leash\nstrain after/for effect\nstrain every nerve\nstrain noun\n(WORRY)\nAdd to word list\nAdd to word list\n[ C/U ] something that causes anxiety, worry, or difficulty: [ U ] Loss of funding has put a lot of strain on the day-care center. [ C ] The benefits of keeping our daughter at home make the strains of having only one income worthwhile.\nstrain noun\n(PRESSURE)\n[ U ] physical pressure: The bookcase collapsed under the strain.\nstrain noun\n(INJURY)\n[ C ] an injury caused by working the muscles too hard: Running puts a strain on your heart.\nstrain noun\n(DIFFERENT TYPE)\n[ C ] an animal or plant that is only slightly different from other animals or plants of the same type: A new strain of the virus has been found.\n[ C ] A strain is also a quality that gives something a particular character: There has long been a populist strain in American politics.\n[ C ] A strain is also a particular sound: Strains of piano music drifted across the room.\nstrain verb\n(SEPARATE)\n[ I/T ] to separate solid pieces from a liquid by pouring it through a utensil with small holes at the bottom of it or through a cloth: [ T ] Strain the liquid and discard the vegetables.\nstrain verb\n(CAUSE WORRY)\n[ T ] to cause anxiety or problems: This relationship has been strained almost to the breaking point. These extra costs have strained our financial resources.\nstrain verb\n(CREATE PRESSURE)\n[ I ] to create pressure or use effort: The dog strained at the leash, pulling his master along. [ + to infinitive ] I had to strain to hear the audio.\nstrain verb\n(CAUSE INJURY)\n[ T ] to cause an injury by working the muscles too hard: I strained my back carrying those boxes."}