{"id":345896,"name":"straddle","type":"verb","us_sound":"ˈstræd.əl","us_link":"../audio/s/straddle.mp3","uk_sound":"ˈstræd.əl","uk_link":"../audio/s/ukstore023.mp3","content":"Add to word list\nAdd to word list\nto sit or stand with your legs on either side of something: He pulled on his helmet and straddled the motorbike.\nSomething that straddles a line, such as a border or river, exists on each side of it or goes across it: Our farm straddles the railway line.\nto combine different styles or subjects: It's described as a new kind of dance music which straddles jazz and soul.\nmainly US disapproving to be unable to decide which of two opinions about a subject is better and so partly support both opinions: It's not the first time this year that the president has been accused of straddling an issue.\nSMART Vocabulary: related words and phrases\nBoarding and alighting from modes of transport\naboard\nbestride\nboard\nclimb\ndebark\ndeplane\ndisembark\ndisembarkation\ndismount\nembark\nembarkation\nentrain\nget\nget off\nget on\nget out\nhop\nmount\nreboard\nsettle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCrossing and moving through\nConnecting and combining\nDoubt & ambivalence\nAdd to word list\nAdd to word list\nto have or put your legs on either side of something: Grace straddled her chair.\nTo straddle something is also to be unable to decide which of two opinions about something is better, and so to partly support both opinions: The president has tried to straddle the issue of political fund-raising.\nAdd to word list\nAdd to word list\na situation in which an investor buys or sells both a call option (= agreement to buy shares at a fixed price before or on a fixed date) and a put option (= agreement to sell shares at an agreed price before or on a particular date): There is a lower level of initial margin on straddle positions because the daily price movements are likely to be lower than in the individual contracts.\nlong straddle\na situation in which an investor buys both a call option and a put option on the same shares because they think that there will be a big change in the share price but they do not know if it will go up or down\nshort straddle\na situation in which an investor sells both a call option and a put option on the same shares because they think that the share price will probably stay the same"}