{"id":346436,"name":"stretched","type":"verb","us_sound":"stretʃ","us_link":"../audio/s/stretch.mp3","uk_sound":"stretʃ","uk_link":"../audio/s/ukstrep006.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nstretch\nstretch verb\n(REACH)\nB2 [ T usually + adv/prep ] to cause something to reach, often as far as possible, in a particular direction: I tripped on a piece of wire that someone had stretched across the path. She stretched out her hand and helped him from his chair.\nB2 [ I ] to make your body or your arms and legs straight so that they are as long as possible, in order to exercise the joints (= place where two bones are connected) after you have been in the same place or position for a long time: \"I'm so tired,\" she said, yawning and stretching. It's a good idea to stretch before you do vigorous exercise.\nMore examplesFewer examplesThe plastic cover was stretched tight across the tank.I stretched out and listened to the sound of the rushing stream.The cat was stretching in front of the fire.Yoga is a great way to stretch your body.I get up and walk around every half hour just to stretch my legs.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nrock up\nroll up! idiom\nscene\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStretching the body\nstretch verb\n(SPREAD)\nC2 [ I usually + adv/prep ] to spread over a large area or distance: A huge cloud of dense smoke stretched across the horizon. The Andes stretch for 7,250 km along the west coast of South America. Unsettled weather will stretch from the middle Mississippi Valley to the southern Middle Atlantic States. The refugee camps stretch as far as the eye can see.\nMore examplesFewer examplesThe road stretched into the distance as far as the eye could see.The mountain range stretched away into infinity.A broad sweep of flat countryside stretched to the horizon in all directions.On the eastern horizon, a huge cloud of smoke from burning oil tanks stretched across the sky.A ribbon of road stretched ahead of us across the desert.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndiffuse\ndispersion\ndredge\ndusting\nencroach on/upon something\nfan out\ngo around\nslather\nsmear\nsmudge\nsmudgily\nsmudging\nsmudgy\nsprinkle\nsweep\nSee more results »\nstretch verb\n(GO PAST)\n[ T ] to go as far as or past the usual limit of something: Many families' budgets are already stretched to breaking point. We can't work any harder, Paul. We're already fully stretched. This movie really stretches the patience of the audience to the limit. Normally, people under 18 aren't allowed, but I guess we can stretch the rules for you as it's your birthday tomorrow.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nstretch verb\n(MAKE LONGER)\nB2 [ I or T ] to (cause a material to) become longer or wider than usual as a result of pulling at the edges: an exercise to stretch the leg muscles That elastic band will snap if you stretch it too far. This substance stretches to any shape you want.\nB2 [ I ] If a material stretches, it can become longer or wider when pulled and then return to its original size: to stretch fabrics\nSMART Vocabulary: related words and phrases\nEnlarging and inflating\naugmentation\nballoon\nbloat\nblow\nblow (someone/something) up\nbroaden\nbuild (someone/something) up\nbulk\ndeepen\nexplosively\nfluff something up\nimplacably\ninflate\ninflation\nlengthen\nmaximize\nreinflation\nscale something up\nstretch\nwiden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nstretch verb\n(LONG TIME)\n[ I usually + adv/prep ] to spread over a long period of time: The dispute stretches back over many years. Although we were supposed to finish this month, it looks like the work will stretch well into next year.\n[ T ] (also stretch out) to make a process or task continue for a longer period of time than was originally planned: I'd like to stretch my mortgage payments out over a longer period if possible.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nsoldier\nspan\nspin\nSee more results »\nstretch verb\n(DO MORE)\n[ T ] If jobs or tasks stretch you, they make you learn new things that use your skill and experience more than before: My present job doesn't stretch me, so I'm looking for something more demanding. stretch the brand\nbusiness\n&#160; specialized to use the existing name of a brand (= a type of product or service with a particular name) for new products and services that may not seem related: Previous attempts by the pharmacy to stretch the brand into areas such as dentistry and botox have failed. He said he wanted to stretch the brand into new areas, from selling electronic goods to operating full-service restaurants in stores.\nSMART Vocabulary: related words and phrases\nMaking people excited and interested\nabsorbed\nanimate\nbe someone's bag idiom\nbedazzle\nbreathe\nbreathe (new) life into sth idiom\nengage\nintoxicate\nintrigue\noccupy\noverexcite\noverstimulate\nstir\nstretch\nsweep someone along\ntalk something up\ntantalize\nthe Thames\nthrill\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nBuying & selling - general words\nIdioms\nbe stretching it\nstretch your legs\nstretch a/the point\nstretch the length of something\nstretch the truthPhrasal verbs\nstretch (yourself) out\nstretch to something"}