{"id":346255,"name":"streak","type":"noun","us_sound":"striːk","us_link":"../audio/s/streak.mp3","uk_sound":"striːk","uk_link":"../audio/s/ukstrat012.mp3","content":"streak noun [C]\n(MARK)\nAdd to word list\nAdd to word list\na long, thin mark that is easily noticed because it is very different from the area surrounding it: The window cleaner left dirty streaks on the windows. I dye my hair to hide my grey streaks.streak of Meteors produce streaks of light as they burn up in the earth's atmosphere.\nThesaurus: synonyms, antonyms, and examples\na mark on somethingmarkThe backs of the chairs have left marks on the wall.stainShe had grass stains on her white jeans.smearHe had smears of tomato ketchup on his shirt.smudgeNo matter how often I wash my hands, I leave smudges all over my phone's screen.blotchHe had blotches all over his face.speckShe looked through the old camera lens and saw specks of dust.\nSee more results »\nSMART Vocabulary: related words and phrases\nDirt & untidiness\nbloodstain\nclutter\ncontaminant\ncontamination\ncrud\nfleck\ngrime\ngrunge\ngunge\ngunk\nmuck\npollutant\npolluter\nscrappiness\nscruff\nshambles\nslime\nslob\nslovenliness\nsmear\nSee more results »\nstreak noun [C]\n(CHARACTERISTIC)\nan often unpleasant characteristic that is very different from other characteristics: stubborn streak Her stubborn streak makes her very difficult to work with sometimes.competitive streak You need to have a competitive streak when you're working in marketing.\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe\nSee more results »\nstreak noun [C]\n(SHORT PERIOD)\na short period of good or bad luck: lucky streak I just hope my lucky streak continues until the world championships.losing streak Their longest losing streak has been three games.on a streak After winning a couple of bets, he thought he was on a winning streak.\nSMART Vocabulary: related words and phrases\nGood luck and bad luck\nalign\nbad/hard/tough luck! idiom\nbe bad luck on someone idiom\nbe down on your luck idiom\nbe in/out of luck idiom\nblessing\nfortune cookie\nfortune smiles on someone idiom\nget the short end of the stick idiom\ngodsend\ngrace\nmerciful\nmercifully\nmercy\nmiracle\nmisadventure\nunlucky\nvoodoo\nwith any luck idiom\nyour luck's in! idiom\nSee more results »\nstreak noun [C]\n(SERIES)\nsomething that happens or is done over a period of time without a break: The thunderstorm ended a streak of 90 days without any rain. She asked me if I would start a streak with her on Snapchat.\nSMART Vocabulary: related words and phrases\nContinually & repeatedly\n24/7\nad nauseam\nagain\nalway\nalways\nhour\nhour after hour idiom\nhourly\nimmemorial\njag\nmorning\nnight\npersistently\nprevalently\nquick-fire\nrecurrently\nrepeated\nrumble\nyear\nyear in, year out idiom\nSee more results »\nIdiom\nlike a streak of lightning\nstreak verb\n(MOVE FAST)\n[ I usually + adv/prep ] to move somewhere extremely quickly, usually in a straight line: streak down The motorbike streaked off down the street.streak past Did you see that bird streak past the window?\nThesaurus: synonyms, antonyms, and examples\nto move fastspeedHe ran back to his car and sped off.raceShe raced over and hugged me.flyShe flew across the room just in time to stop the baby falling off the chair.beltUK Traffic was belting along the motorway.tearA fire truck came tearing down the road.streakBullets streaked across the sky.\nSee more results »\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\nton\ntrot\nSee more results »\nstreak verb\n(RUN NAKED)\n[ I ] to run naked through a public place in order to attract attention or to express strong disapproval of something\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nscuttle\nshoot\nton\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot wearing or removing clothes\nAttention-seeking, distracting and showing off\nstreak verb\n(MARK)\nbe streaked\nto have long, thin noticeable lines of a different colour: Doesn't Chris look good with her hair streaked?\nSee more Phrasal verb\nstreak ahead\nstreak noun [C]\n(MARK)\nAdd to word list\nAdd to word list\na mark of a color that is different from what surrounds it, or a thin strip of light: Streaks of gray and black colored the marble. The comet appeared as a dazzling streak in the sky.\nstreak noun [C]\n(CHARACTERISTIC)\nan obvious characteristic in a personality: He seems to have a mean streak that I hadn’t noticed before.\nstreak noun [C]\n(PERIOD)\na period during which a series of things happens: What will the team do after this memorable eight-game winning streak?\nstreak verb\n(MOVE FAST)\n[ I always + adv/prep ] to move quickly: The space shuttle rose from its launching pad and streaked into the sky.\nstreak verb\n(MARK)\n[ T ] to make lines of a different color in or on something: Her cheeks were streaked with sweat and dirt.\nAdd to word list\nAdd to word list\na period of time during which something continues to happen, for example to go up or down in value or to succeed or fail: a streak of sth Stocks tumbled Thursday, ending a three-session streak of record highs.a winning/losing streak Wall Street broke a three-day losing streak as the Dow closed up 137.33 points at 9188.15.\na part of someone's personality: an ambitous/competitive/independent streak a streak of determination/independence/arrogance"}