{"id":346312,"name":"street","type":"noun","us_sound":"striːt","us_link":"../audio/s/street.mp3","uk_sound":"striːt","uk_link":"../audio/s/ukstrat018.mp3","content":"Add to word list\nAdd to word list\nA1 a road in a city or town that has buildings that are usually close together along one or both sides: The streets were strewn with rubbish after the parade. a street mapacross the street Our daughter lives just across the street from us.in/on Main, Cherry, etc. Street Diane's house is in/on Cherry Street.walk down the street Men whistle at us when we're just walking down the street.cross the street Make sure you look both ways when you cross the street.deserted street The town's streets were deserted by dusk.roam the streets At five in the morning, there were still crowds of people roaming the streets.street vendor I bought these sunglasses from a street vendor in Florence.\nModernewWorld/Stone/GettyImages take to the streets\nWhen people take to the streets, they express their opposition to something in public and often violently: Thousands of people have taken to the streets to protest against the military coup.\nSee more\nMore examplesFewer examplesThe street was familiar to me.They live at the bottom of our street .I live in dread of bumping into her in the street.I can't go down that street - there's a 'No entry' sign.Her handbag was snatched from her in the street.\nSMART Vocabulary: related words and phrases\nRoads: urban & residential streets\naccess road\nadopt\nadopted\nalley\narterial\nboulevard\ncrossing guard\ncul-de-sac\nhigh street\nlane\nlollipop lady\nparade\nplaza\nRd\nrow\nrunnel\nsquare\nst\nthe whole street idiom\nunadopted\nSee more results »\nIdioms\nbe streets ahead\nbe up your street\nthe man/woman in the street\non the streets\nthe streets are paved with gold\nthe whole street\nAdd to word list\nAdd to word list\na road in a city or town, usually with buildings along one or both sides: Our daughter lives across the street from us. Look both ways when you cross the street.\nA street sometimes means a road and the sidewalks (= paths) along it: The streets were full of people. A group of laughing children ran down the street.\nAdd to word list\nAdd to word list\nused to refer to Wall Street : The company has missed its profit forecasts and disappointed the Street a number of times."}