{"id":346432,"name":"stretch","type":"verb","us_sound":"stretʃ","us_link":"../audio/s/stretch.mp3","uk_sound":"stretʃ","uk_link":"../audio/s/ukstrep006.mp3","content":"stretch verb\n(REACH)\nAdd to word list\nAdd to word list\nB2 [ T usually + adv/prep ] to cause something to reach, often as far as possible, in a particular direction: I tripped on a piece of wire that someone had stretched across the path. She stretched out her hand and helped him from his chair.\nB2 [ I ] to make your body or your arms and legs straight so that they are as long as possible, in order to exercise the joints (= place where two bones are connected) after you have been in the same place or position for a long time: \"I'm so tired,\" she said, yawning and stretching. It's a good idea to stretch before you do vigorous exercise.\nMore examplesFewer examplesThe plastic cover was stretched tight across the tank.I stretched out and listened to the sound of the rushing stream.The cat was stretching in front of the fire.Yoga is a great way to stretch your body.I get up and walk around every half hour just to stretch my legs.\nSMART Vocabulary: related words and phrases\nArriving, entering and invading\nannex\nannexation\nbe on the scene idiom\nbeen\nbreak\nbreak someone in\nhit\ningress\ninterloper\nintrude\nintrusion\ninvade\njump\nland\nrock up\nroll up! idiom\nset foot in somewhere idiom\nshow up\ntrespass\nturn\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStretching the body\nstretch verb\n(SPREAD)\nC2 [ I usually + adv/prep ] to spread over a large area or distance: A huge cloud of dense smoke stretched across the horizon. The Andes stretch for 7,250 km along the west coast of South America. Unsettled weather will stretch from the middle Mississippi Valley to the southern Middle Atlantic States. The refugee camps stretch as far as the eye can see.\nMore examplesFewer examplesThe road stretched into the distance as far as the eye could see.The mountain range stretched away into infinity.A broad sweep of flat countryside stretched to the horizon in all directions.On the eastern horizon, a huge cloud of smoke from burning oil tanks stretched across the sky.A ribbon of road stretched ahead of us across the desert.\nSMART Vocabulary: related words and phrases\nSpreading and scattering\nall over the place idiom\nbedaub\nbell\nbestrew\nbillow\ndisseminate\ndistribution\ndredge\ndusting\nencroach on/upon something\nfan out\nramble\nrambling\nscatteringly\nslap something on\nslather\nsmear\nsmudge\nsmudgily\nsprinkle\nSee more results »\nstretch verb\n(GO PAST)\n[ T ] to go as far as or past the usual limit of something: Many families' budgets are already stretched to breaking point. We can't work any harder, Paul. We're already fully stretched. This movie really stretches the patience of the audience to the limit. Normally, people under 18 aren't allowed, but I guess we can stretch the rules for you as it's your birthday tomorrow.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nseek\nshoot\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nstretch verb\n(MAKE LONGER)\nB2 [ I or T ] to (cause a material to) become longer or wider than usual as a result of pulling at the edges: an exercise to stretch the leg muscles That elastic band will snap if you stretch it too far. This substance stretches to any shape you want.\nB2 [ I ] If a material stretches, it can become longer or wider when pulled and then return to its original size: to stretch fabrics\nSMART Vocabulary: related words and phrases\nEnlarging and inflating\naugmentation\nballoon\nbloat\nbroaden\nbuild (someone/something) up\nbulk\nexpand\nexplosively\nflare\nfluff something up\nimplacably\ninflatable\ninflation\nlengthen\npuff\npump someone up\nreinflate\nreinflation\nscale something up\nwiden\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming bigger\nstretch verb\n(LONG TIME)\n[ I usually + adv/prep ] to spread over a long period of time: The dispute stretches back over many years. Although we were supposed to finish this month, it looks like the work will stretch well into next year.\n[ T ] (also stretch out) to make a process or task continue for a longer period of time than was originally planned: I'd like to stretch my mortgage payments out over a longer period if possible.\nSMART Vocabulary: related words and phrases\nContinue & last\n(it's) business as usual idiom\nbash on\ncarry (something) on\ncease\ncont.\ncontd\ndrag\necho\nimmortally\nin the making idiom\ninsist on doing something\nisochronous\nleg\nprotract\nprotraction\npush ahead\npush on\nrun on\nspan\nspin\nSee more results »\nstretch verb\n(DO MORE)\n[ T ] If jobs or tasks stretch you, they make you learn new things that use your skill and experience more than before: My present job doesn't stretch me, so I'm looking for something more demanding. stretch the brand\nbusiness\n&#160; specialized to use the existing name of a brand (= a type of product or service with a particular name) for new products and services that may not seem related: Previous attempts by the pharmacy to stretch the brand into areas such as dentistry and botox have failed. He said he wanted to stretch the brand into new areas, from selling electronic goods to operating full-service restaurants in stores.\nSMART Vocabulary: related words and phrases\nMaking people excited and interested\nabsorbed\nanimate\nbe someone's bag idiom\nbedazzle\nbreathe\nbreathe (new) life into sth idiom\nengage\nentrance\nintoxicate\nintrigue\noccupy\noverexcite\noverstimulate\nstir\nsweep someone along\ntalk something up\ntantalize\nthe Thames\nthrill\nwhip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvertising and marketing\nBuying & selling - general words\nIdioms\nbe stretching it\nstretch your legs\nstretch a/the point\nstretch the length of something\nstretch the truthPhrasal verbs\nstretch (yourself) out\nstretch to something\nstretch noun\n(PART)\nC1 [ C usually singular ] a continuous area of land or water: This particular stretch of coast is especially popular with hikers. Traffic is at a standstill along a five-mile stretch of the ring-road. Some very rare birds inhabit our stretch of the river.\n[ C usually singular ] a stage in a race, or a part of a racetrack: She looked certain to win as she entered the final stretch. He fell as he galloped down the home stretch (= towards the finish).\nMore examplesFewer examplesThere has been a collision on the southbound stretch of the motorway.This stretch of land was once covered with luxuriant forest, but is now bare.This stretch of water is heavily used by shipping.There have been many shipwrecks along this dangerous stretch of coastline.The car was dumped in a stretch of wasteland in the south of the city.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\necoregion\nenclosure\nground\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntransect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInland waters\nSurfaces on which sports take place\nstretch noun\n(REACH)\n[ C ] an act of stretching: I always have a good stretch when I get up in the morning. This is a really good stretch for your hip flexors.\nSMART Vocabulary: related words and phrases\nStretching the body\nakimbo\ncrane\ndistend\ndistension\nextend\noutstretched\nreach\nspread\nstretch (yourself) out\nstretch noun\n(GO PAST)\n[ C usually singular ] the fact that something has gone past its usual limits: His idea may be a stretch, but it's not outside the realm of possibility.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nspread\nstring\nSee more results »\nstretch noun\n(MAKE LONGER)\n[ U ] the degree to which a material can be made longer or wider by pulling: This fabric doesn't have much stretch in it, does it?\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\nsuppleness\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nstretch noun\n(TIME)\n[ C usually singular ] a continuous period of time: The elderly generally need far less rest than the young, and tend to sleep in several short stretches.\n[ C usually singular ] informal a period of time that a criminal spends in prison: Her brother's doing a ten-year stretch for armed robbery. at a stretch\ncontinuously or without any interruptions: There's no way I could work for ten hours at a stretch.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nrest\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPutting people in prison\nContinuous & permanent\nstretch noun\n(DIFFICULT JOB)\n[ C usually singular ] a job, task, or role that is difficult for someone because it is very different from what they usually do: Playing a budding opera star was not much of a stretch for this classically trained singer.\nSMART Vocabulary: related words and phrases\nCinema & theatre: acting, rehearsing & performing\nact out\namateur theater\nappear\nappearance\nblocking\ncamp\nchew\nchew the scenery idiom\nimprovisation\ninterpreter\nre-enact\nre-enactment\nrecreation\nrep\nstage business\nstage fright\nunderstudy\nvoice acting\nwalk\nwalk through something\nSee more results »\nIdiom\nby no stretch (of the imagination)\nstretch verb\n(BECOME LONGER)\nAdd to word list\nAdd to word list\n[ I/T ] to reach across a distance or become longer or wider, or to cause something to do this: [ I ] Rubber stretches when you pull it. [ T ] The banner was stretched across the street. [ M ] He removed his hat and stretched out his arms to embrace her.\n[ I/T ] If you stretch your body, your arms, or your legs, you straighten them so that they are as long as possible: [ T ] \"I’m so tired,\" she said, yawning and stretching her arms.\nstretch verb\n(BREAK LIMITS)\n[ T ] to go beyond, or almost beyond, the usual limit of something: Buying a new dishwasher will really stretch our budget. We try to stretch ourselves in our reading group, picking books we wouldn’t ordinarily read.\nstretch verb\n(SPREAD OVER AREA)\n[ I always + adv/prep ] to spread over a large area or distance: A huge cloud of dense smoke stretched across the sky.\nstretch verb\n(EXIST OVER TIME)\n[ I always + adv/prep ] to spread over a long period of time: [ I ] The dispute stretches back over many years. [ M ] I’d like to stretch my mortgage payments out for 30 years. Idiom\nstretch your legs\nstretch noun\n(UNUSUAL SITUATION)\n[ C usually sing ] an unusual and sometimes difficult situation: Playing two games in two days is a bit of a stretch for us, but I think we’ll make it.\nstretch noun\n(AREA)\n[ C usually sing ] an area of land or water: Traffic is at a standstill along a five-mile stretch of Route 17 just south of Bridgeport.\nstretch noun\n(BECOMING LONGER)\n[ C ] the act of straightening your body, your arms, or your legs so that they are as long as possible: Before jogging, you should always do some stretches.\nstretch noun\n(TIME)\n[ C usually sing ] a continuous period of time: We had a long stretch of days with sub-zero temperatures last month. Idioms\nat a stretch\nnot by any stretch of the imagination\nAdd to word list\nAdd to word list\n[ I ] if money or other resources stretch to something, they are enough to buy or pay for something: MPs and many within the pensions industry are concerned £400m will not stretch far enough.stretch to sth Our budget won't stretch to hiring any new workers.\n[ T ] to make money or resources last longer than was originally planned: City officials are currently struggling with how to stretch limited water supplies.\n[ T ] if something stretches money or other resources, it uses nearly all the money or resources available so that there is very little left: be stretched to breaking point/the limit The aviation infrastructure has been stretched to breaking point.be stretched thin When people and funding are stretched thin, companies may find they're not putting enough resources behind the ideas that promise the greatest shareholder returns.stretch a budget/finances The takeover will stretch the company's finances.\n[ T ]\n&#160; MARKETING to use a brand that already exists to sell new and different products and services: The company is trying to stretch its brand to cover anything that can be sold online.\n[ T ] to force someone to use all their intelligence or skills: My current job isn't really stretching me enough.\na stretch\nused to describe something that you think will be very difficult to achieve, very expensive, etc.: The price tag on the business may prove to be a stretch.\n20 hours/5 days/6 weeks, etc. at a stretch\nif you do something for 20 hours, etc. at a stretch, you do it continuously for that period of time: Workers on an oil rig often do 12-hour days for 14 days at a stretch.\nwork/be at full stretch\nto be working as hard as you possibly can: OPEC members are at full stretch and cannot pump more oil."}