{"id":346270,"name":"stream","type":"noun","us_sound":"striːm","us_link":"../audio/s/stream.mp3","uk_sound":"striːm","uk_link":"../audio/s/ukstrat015.mp3","content":"stream noun [C]\n(SMALL RIVER)\nAdd to word list\nAdd to word list\nB1 water that flows naturally along a fixed route formed by a channel cut into rock or ground, usually at ground level: a mountain stream underground streamsstream flows There's a bubbling stream that flows through their property.\nMilton Cogheil/EyeEm/GettyImages\nMore examplesFewer examplesThis little stream can become a deluge when it rains heavily.The stream was quite shallow so we were able to walk across it.The stream glinted in the moonlight.She hitched her skirt up before wading across the stream.With one leap he crossed the stream.\nSMART Vocabulary: related words and phrases\nWatercourses & waterfalls\namazon\narroyo\nbeck\nbourne\nbrook\ncascade\ncataract\nCongo\ncrick\nEuphrates\ngulch\nmaelstrom\nplunge pool\nraceway\nrapids\nrill\nriverbed\nriverine\nwaterfall\nwaterway\nSee more results »\nstream noun [C]\n(CONTINUOUS FLOW)\nany current of water or liquid: blood stream the level of cholesterol in your blood stream Synonyms\ndribble (SLOW FLOW)\ndrip (LIQUID)\nflow (MOVEMENT)\nrivulet literary\ntrickle (LIQUID)\nthe direction in which water is moving: She stopped rowing and let the boat float with the stream.\nB2 a continuous flow of things or people: steady stream There has been a steady stream of phone calls from worried customers.constant stream I had a constant stream of visitors while I was ill.\nMore examplesFewer examplesA steady stream of students came out of the room.He hurled a stream of abuse at her.A steady stream of tourists emerged from the cathedral.Airport officials received a stream of verbal abuse from angry passengers whose flights had been delayed.Parties, drugs, and a stream of glamorous women - his was a life in the fast lane.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWatercourses & waterfalls\nMasses and large amounts of things\nstream noun [C]\n(STUDENTS)\nUK (US track) a group of school students with similar ability who are approximately the same age and are taught together: I'm in the A stream for maths, and the B stream for English. the top/bottom stream\nSMART Vocabulary: related words and phrases\nStudents & pupils\n-grader\nalum\nalumna\nalumnae\nalumni\nalumnus\napprentice\nentrant\nformer\nfrosh\ngraduate\nhomeschooler\nhouseman\nsalutatorian\nscholar\nschool-leaver\nschoolboy\nschoolchild\ntheologian\nyear\nSee more results »\nIdiom\non stream\nstream verb\n(FLOW)\n[ I usually + adv/prep ] to flow somewhere or produce liquid, quickly and in large amounts without stopping: tears stream down someone’s face There were tears streaming down his face.blood streams from One woman was carried from the scene of the accident with blood streaming from her head.UK I've got a terrible cold and my nose has been streaming all week. stream in, out, through, etc.\nto move continuously in one direction: stream out of We were all very excited as we streamed out of our final exam.\nSee more\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\nstream verb\n(INTERNET)\n[ T ] to send or receive sound or video directly over the internet as a continuous flow: On YouTube, millions of videos are streamed every day. To pick up this signal, you will need a high-speed internet connection to stream it to your computer.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\nstream verb\n(STUDENTS)\n[ T ] UK (US track) to group and teach together school students with similar abilities who are approximately the same age: In Britain, we start to stream the children in year 10.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nstream noun [C]\n(SMALL RIVER)\nAdd to word list\nAdd to word list\na small river that flows on or below the surface of the ground: Rivers are wider, deeper, and longer than streams.\nstream noun [C]\n(FLOW)\na continuous flow: The faucet leaked in a steady stream. An endless stream of traffic clogged the roads today.\nstream verb\n(SEND)\n[ T ] to send continuous sound or moving images using computers: Wi-fi networking allows you to stream music from a PC to the device.\nstream verb\n(FLOW)\n[ I ] to move continuously: Record numbers of applications were streaming into our offices. Tears streamed down her cheeks. Sunlight was streaming through the window.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; FINANCE a regular flow of money: Utilities have a steady stream of cash coming in from their customers. Fees for advising on acquisitions represent a large part of big banks' income streams.\n[ C, usually singular ] a large number of things or people of a similar type that happen or are seen one after the other: a/the stream of sth A bankruptcy filing would add to the stream of business failures that have plagued corporate America.a steady/constant/continuous stream of sth/sb At the moment, we're seeing a steady stream of people in trouble from refinancings.\ncome on stream\nPRODUCTION to start to be used to produce or manufacture something: New power plants need to come on stream by 2016-17.\nto listen to or watch sound or video on a computer, mobile phone, etc. directly from the internet rather than downloading it and saving it first, or to send sound or video in this way: stream video/music/files You can now use your home wi-fi wireless network to stream music from your PC. Streaming channels to individual handsets takes up a lot of network capacity. Although TV and other video can be streamed over 3G networks, it is not a broadcast technology."}