{"id":346419,"name":"stress","type":"noun","us_sound":"stres","us_link":"../audio/s/stress.mp3","uk_sound":"stres","uk_link":"../audio/s/ukstrep003.mp3","content":"stress noun\n(WORRY)\nAdd to word list\nAdd to word list\nB1 [ C or U ] great worry caused by a difficult situation, or something that causes this condition: under stress People under a lot of stress may experience headaches, minor pains, and sleeping difficulties.combat stress Yoga is a very effective technique for combating stress.stress and strain How do you recover from the stresses and strains of the day?stress-related Massage therapy is good for all stress-related conditions.\nMore examplesFewer examplesAll that stress at work had begun to drag him down.People often behave irrationally when they are under stress.She's been under a lot of stress recently and it's starting to tell.Extreme stress had driven him to the brink of a nervous breakdown.She seems to thrive on stress.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nangst\nanti-stress\nanxiety\napprehension\njitters\nnerve\nnervousness\noppression\noverwork\npanic attack\nstrain\ntension\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nSee more results »\nstress noun\n(DIFFICULTY)\n[ C or U ] a difficult situation caused by too much being needed or expected from a system, resource, etc. : stress on The city is finding it hard to cope with stress on its housing supply. Adding 32 million people is going to put stresses on all of our systems. under stress Emergency food supplies are under stress as a result of widespread famine and war. See also\nwater stress\nSMART Vocabulary: related words and phrases\nDifficult situations and unpleasant experiences\na (heavy) cross to bear idiom\na rough ride idiom\nabyss\nadversity\nat your worst idiom\nAugean\nbad hair day\ncrunch\nemergence\ngenie\nhardness\nhave a bumpy ride idiom\nhave someone over a barrel idiom\nhell\nrabbit hole\nreversal\nrigour\nrollercoaster\nthe Augean Stables idiom\nvortex\nSee more results »\nstress noun\n(PRONUNCIATION)\nB2 [ C or U ] the way that a word or syllable is pronounced with greater force than other words in the same sentence or other syllables in the same word: The meaning of a sentence often depends on stress and intonation.stress is on When \"insert\" is a verb, the stress is on the second syllable, but when it is a noun, the stress is on the first syllable.\nMore examplesFewer examplesIn this dictionary, stress in compounds is indicated by stress markers.I can never remember which syllable the stress is on.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nstress noun\n(FORCE)\n[ C or U ]\n&#160; physics, engineering\n&#160; specialized a force that acts in a way that often changes the shape of an object: Computers work out the stresses that such a craft will encounter in flight.put stress on Jogging puts a lot of stress on your knee joints.\nSMART Vocabulary: related words and phrases\nPhysics: energy, force & power\nanimal magnetism\nanti-gravity\nattract\nattraction\nballistic\nerg\nexcited\nfrictional\nfrictionless\nfundamental force\ngeothermal\ninertia\njet propulsion\nradiant energy\nself-propulsion\nsine curve\nsinusoid\nsolarize\nthe sound barrier\nthermodynamics\nSee more results »\nstress noun\n(EMPHASIS)\nC1 [ U ] emphasis: lay stress on During his speech, he laid particular stress on the freedom of the press.\nSMART Vocabulary: related words and phrases\nStressing & emphasizing\naccentuate\naccentuation\nall day long idiom\nbelieve\ndeadass\ndrive your message/point home idiom\ndrive/hammer something home idiom\nexactly\ninsistence\ninsistency\ninsistently\nintensely\nlike blazes idiom\nmisemphasis\npercent\nram\nthemselves\nvaunt\nwork/laugh/freeze, etc. your arse off idiom\nwork/laugh/freeze, etc. your ass off idiom\nSee more results »\nstress verb\n(EMPHASIZE)\nB2 [ T ] to give emphasis or special importance to something: [ + (that) ] He is careful to stress (that) the laboratory's safety standards are the best in the country.stress the importance of I'd just like to stress the importance of neatness and politeness in this job.\nMore examplesFewer examplesThe bishop stressed the importance of faithfulness in marriage.I must stress that these are only preliminary findings.I stressed that this was our policy.He stressed the importance of fresh fruit and vegetables in the diet.The government repeatedly stressed its support for parental choice in the selection of a child's school.\nSMART Vocabulary: related words and phrases\nStressing & emphasizing\naccentuate\naccentuation\nall day long idiom\nbelieve\ndeadass\ndrive your message/point home idiom\ndrive/hammer something home idiom\nexactly\ninsistence\ninsistency\ninsistently\nintensely\nlike blazes idiom\nmisemphasis\npercent\nram\nthemselves\nvaunt\nwork/laugh/freeze, etc. your arse off idiom\nwork/laugh/freeze, etc. your ass off idiom\nSee more results »\nstress verb\n(PRONOUNCE)\nB2 [ T ] to pronounce a word or syllable with greater force than other words in the same sentence or other syllables in the same word, or to play a musical note with greater force than others in a group: In the word \"engine\" you should stress the first syllable.\nMore examplesFewer examplesIn the word \"dessert\" the second syllable is stressed.Stress the second syllable in the word \"bizarre\".\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nstress verb\n(WORRY)\n[ I ] to feel worried and nervous: Don't stress over it - we'll soon get it sorted out.\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nwired\nworried\nworriedly\nworrier\nworrywart\nSee more results »\nstress verb\n(CAUSE DIFFICULTIES)\n[ T ] to make a system, resource, etc. experience difficulties by needing or expecting too much from it: You can only stress the system so much before it starts to break down. Rural landscapes, stressed by drought, are turning brown.\nSMART Vocabulary: related words and phrases\nCausing difficulties for oneself or others\nask questions of someone/something idiom\nbe a tall order idiom\nbe asking for trouble idiom\nbe your own worst enemy idiom\nbother someone with something\ncatch\ndig\nmake heavy weather of something idiom\nobduracy\noverburden\npitchfork someone into something\nplunge\nsand\nshoot\nsuicidal\nswamp\ntall\nthrow sand in the gears idiom\ntoughness\nwrong-foot\nSee more results »\nPhrasal verb\nstress someone out\nstress noun\n(WORRY)\nAdd to word list\nAdd to word list\n[ C/U ] worry caused by a difficult situation, or something that causes this condition: [ U ] Luis is under a lot of stress right now. [ C ] It’s hard to cope with the stresses of raising a family.\nstress noun\n(FORCE)\n[ C/U ] a force that tends to change the shape or strength of an object: [ U ] If a metal object experiences constant stress, it may bend or break.\nstress noun\n(PRONOUNCING WORD)\n[ C/U ]\n&#160; English the pronouncing of a word or syllable with greater force than other words in the same sentence or other syllables in the same word: [ C ] The main stress in the word \"command\" is on the second syllable.\nstress noun\n(IMPORTANCE)\n[ U ] special importance or emphasis that is given to something: There’s constant stress on status in this community. stressful adjective us\nYour browser doesn't support HTML5 audio\n/ˈstres·fəl/\nWorking in the emergency room of a major hospital is highly stressful work.\nstress verb [T]\n(GIVE IMPORTANCE)\nto give special importance or emphasis to something: I’d like to stress the differences between our opinions.\nstress verb [T]\n(PRONOUNCE)\nEnglish to pronounce a word or syllable with greater force than other words in the same sentence or other syllables in the same word: In the word \"engine,\" you should stress the first syllable.\nAdd to word list\nAdd to word list\n[ C or U ] a feeling of worry and unhappiness because you have too much work or too many problems to deal with: Successful managers need to be able to make tough decisions under stress. She was off work for four weeks with a stress-related illness. More women are now working full-time, with all the stresses and strains that brings. Workplace culture is an important factor in levels of stress. stress management/reduction work/workplace/occupational stresscope with/deal with/handle stress Firms need to find ways of helping executives deal with stress.experience/suffer from stress According to the survey, over half a million workers believed they suffered from stress.reduce/relieve/ease stress Flexible work policies can reduce stress.be under stress People who are under stress are more likely to have accidents at work.cause (sb) stress Delays in payment cause stress and financial hardship.a cause/source of stress Work is the third most frequent cause of stress.take the stress out of sth Satellite-navigation systems take the stress out of driving.\n[ C or U ] problems caused by a difficult situation: financial/fiscal stressbe under stress Many of our businesses are under stress right now because of the slow economy.stress(es) on sth Disappointing figures have once again highlighted stresses on the public finances.place/put/reduce stress on sth A new transmission line would reduce stress on electricity systems across the mid-Atlantic region.\nplace/lay/put stress on sth\nif an official speech or report places, lays, or puts stress on something, it emphasizes it: We should develop a more dynamic conception of equality, placing more stress on opportunity.\n[ T ] to emphasize something: We want to stress how careful we are when assessing credit risk. It is important to stress that economic and social cohesion is a political priority of the European Union. With the growth of the Internet, I cannot stress how important it is for new businesses to act fast in registering trademarks. The report stressed that by proactively dealing with climate-change issues, companies can earn a voice in planning policy.stress the importance/need The group has spent much of its time stressing the need for debt relief for Africa.be keen/at pains/quick to stress After the budget, the Chancellor was keen to stress how the average earner with two children will be better off.\n[ I ] informal to become very worried or unhappy because you have too much work or too many problems to deal with: Try not to stress too much about things."}