{"id":346346,"name":"strength","type":"noun","us_sound":"streŋθ","us_link":"../audio/s/strength.mp3","uk_sound":"streŋθ","uk_link":"../audio/s/ukstrat025.mp3","content":"strength noun\n(POWER)\nAdd to word list\nAdd to word list\nB2 [ U ] the ability to do things that need a lot of physical or mental effort: She had the strength and stamina to take the lead and win the gold medal. Admitting you've made a mistake is a sign of strength, not weakness. He showed great strength of character when he refused to accept the bribes. We will struggle on, drawing our strength from the courage of others. Much of the country's military strength lies in its missile force.\nC2 [ C usually singular ] the degree to which something is strong or powerful: If the two parties joined forces, their combined strength would be 127 seats. You can gauge (= measure) the strength of a democracy by the way it treats its minorities.\nMore examplesFewer examplesI'm not being lazy - I'm just conserving my strength for later.You must eat to keep your strength up.The team will need all the strength they can muster to win this game.This will be a severe test of our strength.They gave him soup to build up his strength.\nSMART Vocabulary: related words and phrases\nAnimal physiology: fit & healthy\nacrobatically\nagility\nagree with something\namazonian\nathleticism\nbe (as) fit as a fiddle idiom\nglow\nhard/tough as nails idiom\nin the pink idiom\nlimber\nmatch fit\nmatch fitness\nmuscled\nnon-disabled\non top form phrase\nrobust\nrude\nthe able-bodied\ntrim\nvirility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPower and intensity\nstrength noun\n(GOOD FEATURE)\nC1 [ C ] a good characteristic: She's well aware of her strengths and weaknesses as an artist. His greatest strengths are his determination and resilience.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nwhat someone is (really) made of idiom\nwheelhouse\nwizardry\nworkmanship\nSee more results »\nstrength noun\n(NUMBER)\n[ U ] the number of people in a group: What's the current strength of the city's police force? in strength\nin large numbers: Demonstrators arrived in strength to protest against the military action. below strength UK\nIf a group is below strength, it consists of fewer people or members than usual: The office will be below strength in August when a lot of people will be away. at full strength\nat the best level of ability possible: He is not expected to be at full strength for the rest of the season.\nwith the complete number of people who are usually in a group: Staff cuts have meant that we haven't been working at full strength for a year.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLarge in number or quantity\nSmall in number and quantity\nGood, better and best\nLinguistics: both, all, each & every\nIdioms\ngive me strength!\ngo from strength to strength\non the strength of something\na tower of strength\nstrength noun\n(PHYSICAL POWER)\nAdd to word list\nAdd to word list\n[ U ] the ability to do things that demand physical effort, or the degree to which something is strong or powerful: After having surgery, it takes a while to get your strength back. Making baskets requires skill more than physical strength. The storm is gathering/gaining strength.\n[ U ] The strength of a drug is its ability to have an effect.\nstrength noun\n(BRAVERY)\n[ U ] bravery in dealing with difficulties: He showed real strength in refusing to change his vote in spite of the call from the president.\nstrength noun\n(GOOD FEATURE)\n[ C/U ] a positive quality that makes you more effective: [ C ] The plan had both strengths and weaknesses. [ C ] Her drive to succeed was a real strength.\n[ C/U ] The strength of a company or economy is its ability to produce goods, profits, and jobs: [ U ] a period of continuing economic strength\nstrength noun\n(NUMBER)\n[ U ] the number of people in a group: Estimates of enemy troop strengths differed. Idiom\non the strength of something\nAdd to word list\nAdd to word list\n[ S or U ] the amount of power or influence that someone or something has: Advertising revenues in the UK have remained flat, although this has been offset by strength in the company's South African and Australasian operations.the strength of sth The outlook is uncertain and we cannot rely on the strength of economic recovery in the near future.the strength of an economy/market/brand After the 110p plunge on Friday, the stock remained at 622p despite the strength of the market generally. We are continuing to build strength in key areas of the business. economic/financial/market strength Both firms have strong cash balances, good relative strength, and are in fast-growing sectors.\n[ C ] a quality that someone or something has that helps them succeed or make progress: One of our strengths as a global brand has been our ability to adapt to local trends.the strength of sb/sth Keeping employee morale high is considered to be the strength of many Japanese organizations. Our Performance Management System identifies strengths and weaknesses in performance.biggest/greatest/key strength A key strength of the internet is that it permits seamless communication without regard to national boundaries.build on/focus on/look to sb's strengths A good branding intiative builds on a firm's strengths.\n[ U ]\n&#160; MONEY how much value one currency has compared to the currencies of other countries: Continuing weakness in Europe has added to sterling's strength against the dollar.the strength of the euro/dollar/pound Many UK tourists have been discouraged from travelling abroad by the strength of the euro.\n[ U ] how strong or well made a product or material is and so how likely it is to be damaged or broken: the strength of sth Amid questions about the strength of newly designed hurricane housing, engineers will evaluate how well the structures are attached to the ground.\n[ U ]\n&#160; COMMUNICATIONS, IT how well electrical or radio waves are received by a radio, television, or mobile phone in order to produce a sound, picture, or message: Laptops and handhelds can lose signal strength as you move from one side of a building to the other.\n[ S or U ]\n&#160; HR the total number of people who work for a company or organization: The strength of the workforce has doubled over the past two years.\ngo from strength to strength\nto become more and more successful: The company has gone from strength to strength, investing heavily in new models and technology.\non the strength of sth\nif something happens on the strength of something else, it is caused by that thing: Shares are up 5.5p to 628p on the strength of higher oil prices.\nplay to sb's strengths\nto use the advantages that you or another person or thing already have in order to achieve something: The globalization of services in international business has played to India's strengths."}