{"id":346620,"name":"stringency","type":"noun","us_sound":"ˈstrɪn.dʒən.si","us_link":"../audio/s/usstrep023.mp3","uk_sound":"ˈstrɪn.dʒən.si","uk_link":"../audio/s/ukstrik011.mp3","content":"stringency noun [U]\n(STRICTNESS)\nAdd to word list\nAdd to word list\nthe quality of being very strict, severe, or limiting: The stringency of the safety regulations threatens to put many manufacturers out of business. Drug use bears no simple relation to the stringency of drug laws.\nMore examplesFewer examplesThe stringency of the rules has irritated some companies.Mishaps are rare, which is testament to the stringency of the regulations.Advance publicity about the stringency of the terms had caused widespread social unrest.\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nseriously\nstringent\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nstringency noun [U]\n(WITH MONEY)\nfinance &amp; economics\n&#160; specialized a situation in which not enough money is available for borrowing as a result of firm controls on the amount of money in an economy: Greater financial stringency is needed to eradicate inflation from the economy. The report called for at least another year of economic stringency.\nMore examplesFewer examplesThe government intends to stick to a policy of continued fiscal stringency.The numbers of part-time teachers have declined in the last few years as a result of financial stringency.In times of severe economic stringency, painful strategic choices about services have to be made.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrenchment\nstagflation\nthe public purse\nSee more results »\nSee\nstringent\nAdd to word list\nAdd to word list\na situation in which a law, test, etc. is extremely severe or limiting and must be obeyed: the stringency of sth The statute prohibits the adoption of environmental protections laws that exceed the stringency of federal regulations.\na situation in which companies or governments can spend only very little money because of difficult economic conditions: financial/fiscal/economic stringency"}