{"id":346661,"name":"strip","type":"verb","us_sound":"strɪp","us_link":"../audio/s/strip.mp3","uk_sound":"strɪp","uk_link":"../audio/s/ukstrik015.mp3","content":"strip verb\n(REMOVE )\nAdd to word list\nAdd to word list\n[ T ] to remove, pull, or tear the covering or outer layer from something: Because of the pollution, the trees are almost completely stripped of bark. The paintwork was so bad that we decided to strip off all the paint and start again. [ + adj ] During the summer months, the sheep strip the mountains bare. Huge areas of land have been stripped of all trees and vegetation.\n[ T ] to remove something from somewhere: When you strip the word from its context, it loses its meaning. She said that these processed foods have been stripped of most of their nutrients.\n[ T ] to take something important, such as a title, away from someone, usually as a punishment: He was attempting to win back the title that was stripped from him in 1967 for refusing to fight in the Vietnam War. He was stripped of his knighthood after he was convicted of stealing from the company.\n[ T ] to take out everything that is not part of the structure of a room or building: The couple first stripped the kitchen of its all units and appliances. The house had been stripped, except for one wall fitting.\n[ T ]\n&#160; business, finance &amp; economics\n&#160; specialized to sell the assets (= valuable parts) of a company: He made his fortune as a young man by buying up large companies and stripping the assets. See also\nasset-stripping\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nPunishing & punishments\nStock markets\nstrip verb\n(REMOVE CLOTHING)\n[ I or T ] (UK also strip off [ I ]) to remove your clothing, or to remove the clothing of someone else: The men were ordered to strip.UK Suddenly he stripped off and ran into the sea. [ + adj ] He had been stripped naked, beaten and robbed.\n[ I ] to remove your clothing in public in a sexually exciting way as an entertainment, and often as a job: The first time we see her character in the film, she is stripping on stage in a club.\nSMART Vocabulary: related words and phrases\nNot wearing or removing clothes\naltogether\nau naturel\nbare\nbare naked idiom\nbarefoot\ngo commando idiom\nimmodest\nimmodestly\nimmodesty\nin your birthday suit idiom\nnudity\nrevealing\nshirtsleeve\nshuck\nshuck something off\nstreaker\ntrou\nunclad\nundress\nundressed\nSee more results »\nstrip verb\n(REMOVE PARTS)\n[ T ] to remove parts of a machine, vehicle, or engine in order to clean or repair it: I've decided to strip down my motorbike and rebuild it.\n[ T ] mainly US to remove the parts of a car, etc. in order to sell them\nSMART Vocabulary: related words and phrases\nEngineering - mechanical\n-engined\nair-cooled\nartificer\nautomative\nbionics\ndolly\ndrive shaft\nengage\ngasman\ngo on\nhorsepower\nmechanical\nmechanize\nneutral\noilcan\noverride\ntick over\ntune (something) up\nunmechanized\nvalve\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\nPhrasal verbs\nstrip something away\nstrip something off\nstrip (down) to something\nstrip something out\nstrip noun\n(PIECE)\nC1 [ C ] a long, flat, narrow piece: a narrow strip of land He didn't have a bandage, so he ripped up his shirt into thin strips. Protect the magnetic strip on your credit card from scratches, heat, or other damage.\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbar\nblindfold\nbraid\ncollar\ndog collar\nduct tape\ngag\nloom bands\nmasking tape\nraffia\nriband\nribbon\nstraight edge\nstrap\nstreamer\nstripe\nsweatband\nwebbed\nSee more results »\nstrip noun\n(CLOTHING)\n[ C usually singular ] UK the clothing worn by a football team that has the team's colours on it: The team will be wearing its new strip at next Saturday's match.\nFuse/Corbis/GettyImages\nSMART Vocabulary: related words and phrases\nFootball/soccer\n18-yard box\n2 3 5\n4 3 2 1\n4 4 2\n4 5 1\nfootball pools\nfooty\nformation\nfoul throw\nfour five one\nfour four two\nfour three two one\nreducer\nrelegation zone\nreserve team\nroute one football\nrow Z\nsweeper\ntreble\nwoodwork\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSportswear & swimwear\nstrip noun\n(REMOVE CLOTHING)\n[ S ] UK an entertainment in which the performer removes all his or her clothing: He jumped up on the table and started to do a strip. Synonym\nstriptease\nSMART Vocabulary: related words and phrases\nNot wearing or removing clothes\naltogether\nau naturel\nbare\nbare naked idiom\nbarefoot\ngo commando idiom\nimmodest\nimmodestly\nimmodesty\nin your birthday suit idiom\nnudity\nrevealing\nshirtsleeve\nshuck\nshuck something off\nstreaker\ntrou\nunclad\nundress\nundressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpectacles & performances\nstrip verb\n(REMOVE COVERING)\nAdd to word list\nAdd to word list\n[ T ] to remove, pull, or tear the covering or outer layer from something: I have this cabinet that had about eight layers of paint on it, and I stripped it down to refinish it.\n[ T ] If you strip someone of something, you remove it from that person: Canada wants to strip Luitjens, a retired University of British Columbia botany instructor, of his citizenship.\nstrip verb\n(REMOVE CLOTHING)\n[ I/T ] to remove your clothes, or to remove the clothes from someone else: [ M ] It was so hot that we stripped off our shirts. [ I ] We were told to strip to the waist (= remove our clothes above the waist). [ I ] The nurse told me to strip down to my underwear (= remove all of my clothes except my underwear).\nstrip noun\n(PIECE)\n[ C ] a long, flat, narrow piece: a strip of land He didn’t have a bandage, so he ripped up his shirt into thin strips. To prolong the working life of your credit card, keep the magnetic strip protected from scratches, heat, and moisture.\nstrip noun\n(REMOVAL OF CLOTHING)\n[ U ] the act of removing your clothes, esp. as an entertainment: I jumped on the table and started to do a strip.\nAdd to word list\nAdd to word list\nFINANCE to remove the interest payments from a bond and sell them separately from the original bond: Certain of these securities may have variable interest rates and others may be stripped.\n(also strip sth down) to separate a machine or piece of equipment into separate parts in order to clean or repair it: Apprentices are taught how to strip and repair machinery. See also\nasset-stripping Phrasal verbs\nstrip sth away\nstrip (sth) down\nstrip sth down\nstrip sth from sb/sth\nstrip sb/sth of sth\nstrip sth off (sth)\nstrip sth out\na row of stores and small businesses built together along the side of a main road: commercial/retail strips See also\nmagnetic strip"}