{"id":346594,"name":"strike","type":"verb","us_sound":"straɪk","us_link":"../audio/s/strike.mp3","uk_sound":"straɪk","uk_link":"../audio/s/ukstrep029.mp3","content":"strike verb\n(STOP WORK)\nAdd to word list\nAdd to word list\nB2 [ I ] to refuse to continue working because of an argument with an employer about working conditions, pay levels, or job losses: the right to strike Democratization has brought workers the right to strike and join a trade union.strike for We're striking for better pay and improved safety standards.\nMore examplesFewer examplesDespite the exhortations of the union leaders the workers voted to strike.The only option available to us is to strike.They are threatening to strike if their demands are not met.There's a very real possibility that they might strike.If the management wouldn't listen to their demands, they would have to force the issue by striking.\nSMART Vocabulary: related words and phrases\nIndustrial action\nabstain\nanti-strike\nblackleg\ncome out\ncooling-off period\ndemarcation dispute\njob action\nlightning strike\nlock\nlock someone out\nlockout\non strike phrase\nsit down\nstoppage\nstrikebound\nstrikebreaker\nstrikebreaking\nstriker\nsympathy\nunion-bashing\nSee more results »\nstrike verb\n(CAUSE SUFFERING)\nC2 [ I or T ] to cause a person or place to suffer severely from the effects of something very unpleasant that happens suddenly: disaster strikes I have a life insurance policy that will take care of my family if disaster strikes. The disease has struck the whole community, sometimes wiping out whole families.earthquake strikes They predict that a large earthquake will strike the west coast before the end of the decade.\nMore examplesFewer examplesTragedy struck when several people were crushed to death in the crowd.Everything was going smoothly until suddenly disaster struck.This is the second time in ten years that a major earthquake has struck in this region.Halfway through the flight, disaster struck.Tragedy then struck for this family of six.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nseismic\nsour\nwreck\nSee more results »\nstrike verb\n(HIT)\nB1 [ I or T ] to hit or attack someone or something forcefully or violently: Her car went out of control and struck an oncoming vehicle. The police have warned the public that the killer could strike again.strike someone on something The autopsy revealed that his murderer had struck him on the head with an iron bar.be struck by lightning Have you ever been struck by lightning? My golf was terrible today - I just didn't strike the ball well.\nThesaurus: synonyms, antonyms, and examples\nto hit someone or somethinghitShe was expelled for hitting another pupil.whackShe whacked the water with her paddle.bashThe swinging door bashed him in the face.strikeShe had been struck on the head with a golf ball.beatHe was cruel to his dog and beat it with a stick.punchHe punched me in the stomach.\nSee more results »\nB1 [ I or T ] to kick a football, especially hard so that it travels a long distance : Beckham struck the ball with precision.\n[ I or T ] When a clock strikes, its bells ring to show what the time is: The clock was striking ten as we went into the church.\n[ I ] When a particular time strikes, a clock's bells ring to tell people what time it is: Midnight had just struck when I went upstairs to bed.\nC2 [ T ] If you strike a match, you cause it to burn by rubbing it against a hard rough surface: She struck a match and lit another cigarette.strike something on something He bent and struck a match on the sole of his boot.\nSMART Vocabulary: related words and phrases\nHitting and beating\nat-risk\nbang away\nbang someone up\nbasher\nbashing\nbunch\nbutt\nfetch\ngut punch\nhammer\nhead-butt\nhell\nkick\nmess\nswing at someone\nswing for someone\ntan someone's hide idiom\ntar\nwallop\nwhop\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFootball/soccer\nGeneral terms used in ball sports\nWatches & clocks\nStarting fires\nstrike verb\n(SUCCEED)\n[ I ] to achieve a sudden success, such as by scoring a goal in football or taking a wicket in cricket : Arsenal struck first, scoring in the twelfth minute. Johnson struck when he had Atapattu caught by Read.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\ntreble\nSee more results »\nstrike verb\n(REMOVE)\n[ T usually + adv/prep ] formal to remove something officially from a document: strike something from something Please strike my name from your mailing list immediately.be struck off Several unreliable dealers have been struck off our list of authorized suppliers.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\ndumping\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nstrike verb\n(DISCOVER)\nC2 [ T ] to discover a supply of oil, gas, or gold underground: strike oil The first person to strike oil in the US was Edwin Laurentine Drake.\nSMART Vocabulary: related words and phrases\nEngineering - mining & quarrying\nanti-mine\nbanksman\nbeneficiation\nbiomining\ncoal\ncoal miner\ncoal mining\ncoalface\nextract\noilfield\nOPEC\npetrodollar\npit pony\npithead\nprospect\nrig\nshaft\nslag heap\nstrip mining\nunworked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFinding and discovering\nstrike verb\n(AGREE)\n[ T ] to reach or make an agreement: strike a deal Do you think the government should try to strike a deal with the terrorists?\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconclusion\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nwithout a murmur idiom\nSee more results »\nstrike verb\n(FEEL/THINK)\nB2 [ T ] to cause someone to have a feeling or idea about something: strike someone as something Doesn't it strike you as odd that he never talks about his family?be struck by I was immediately struck by the similarities between the two murders. So how does my proposition strike you? (= What do you think of it?) [ + (that) ] It strikes me (that) you'd be better off working for someone else.\nB2 [ T ] If a thought or idea strikes you, you suddenly think of it: [ + that ] It's just struck me that I still owe you for the concert tickets. Sitting at her desk, she was struck by the thought that there had to be something more to life.\nSMART Vocabulary: related words and phrases\nAffecting and influencing\nacross-the-board\naffect\napplicability\nbe/fall under someone's influence/spell idiom\nbear on something\nbearing\nconflict\near\ninstrumental\ninstrumentality\ninstrumentally\ninterinfluence\ninvolve\npen\nrail\nsphere of influence\nspill\nspill over\nsportswashing\nstart (something) off\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThinking and contemplating\nstrike verb\n(MOVE BODY)\nstrike a pose/attitude\nto move your body into a particular position: She may be 67, but she can still strike a sexy pose.\nSee more\nstrike verb\n(MAKE COINS)\n[ T ] to make a metal disc-shaped object such as a coin with a machine that quickly presses a picture into a piece of metal: strike a coin When was the first pound coin struck? A special medal has been struck to celebrate the end of the war.\nSMART Vocabulary: related words and phrases\nChemistry: metals & metalworking\nalloy\nanti-tarnish\nbar magnet\nbase metal\nbimetallic\nblacksmith\nbrazen\nbrazier\nbullion\ngold leaf\ngold-plated\nlode\nmagnetism\nscrap\nswage\ntarnished\ntinplated\nuntarnished\nvermeil\nwrought iron\nSee more results »\nstrike verb\n(TENT)\nto take down a tent or a number of tents: strike a tent When the troops had exhausted food and firewood, they struck their tents and moved on.strike camp We struck camp next day and set off down the mountain.\nSMART Vocabulary: related words and phrases\nCamping\nbackpack\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\ntent\nSee more results »\nIdioms\nbe struck dumb\nstrike a balance\nstrike a blow against/at something\nstrike a blow for something\nstrike a chord\nstrike a note\nstrike at the heart of something\nstrike an attitude/attitudes\nstrike fear/terror into someone\nstrike gold\nMore idioms\nstrike home\nstrike it lucky\nstrike it rich\nstrike while the iron is hot\nwithin striking distance\nPhrasal verbs\nstrike back\nstrike someone down\nstrike something down\nstrike someone off (something)\nstrike on/upon something\nstrike out (somewhere)\nstrike out\nstrike someone out\nstrike out (at someone/something)\nstrike something out/through\nMore phrasal verbs\nstrike up (something)\nstrike up something\nstrike noun [C]\n(STOP WORK)\nB2 a period of time when workers refuse to work because of an argument with an employer about working conditions, pay levels, or job losses: After last year's long and bitter strike, few people want more industrial action.call a strike They had to play three games with replacement players after the NFL Players Association called a strike.call for a strike Some miners were calling for a nationwide strike.lightning strike They have voted to stage lightning (= sudden and short) strikes in pursuit of their demands.stage a one-day strike We've voted to stage a series of one-day strikes.wave of strikes A wave of strikes swept the country.strike action Union leaders threatened strike action over the changes.strike ballot The result of the strike ballot will be known tomorrow morning. on strike (UK also out on strike)\ntaking part in a strike: The city's bus drivers have been on strike for three weeks.\nSee more go on strike\nto start to strike: All 2,500 employees went on strike in protest at the decision to close the factory.\nSee more\nMore examplesFewer examplesIn the event of a strike, the army will take over responsibility for firefighting.Volunteers would fill in for teachers in the event of a strike.The company is putting up wages in an attempt to head off a strike.A strike is imminent.Many airline passengers face lengthy delays because of the strike.\nSMART Vocabulary: related words and phrases\nIndustrial action\nabstain\nanti-strike\nblackleg\ncome out\ncooling-off period\ndemarcation dispute\njob action\nlightning strike\nlock\nlock someone out\nlockout\non strike phrase\nsit down\nstoppage\nstrikebound\nstrikebreaker\nstrikebreaking\nstriker\nsympathy\nunion-bashing\nSee more results »\nstrike noun [C]\n(HIT)\na sudden and powerful hit or attack: lightning strike Lightning conductors protect buildings and tall structures from lightning strikes. See also\nstrike force\na hard kick of a football, especially one that makes it travel a long distance: Garner scored with a 30 -yard strike in the 89th minute.\na sudden, short military attack, especially one by aircraft or missiles: air strike The United Nations has authorized the use of air strikes.military strike against The violence is unlikely to stop without military strikes against terrorist bases.nuclear strike Would you support a nuclear strike to bring an end to a war?launch a pre-emptive strike We have no intention of launching a pre-emptive strike, but we will retaliate if provoked. on strike\nIn cricket, the batter who is on strike is the one who the ball is being bowled (= thrown) to: He takes the single to put Edwards back on strike.\nSee more\nMore examplesFewer examplesHe ordered a sustained series of air strikes on the city.Immediate military strikes had been averted.\nSMART Vocabulary: related words and phrases\nHitting against objects accidentally and colliding\nanti-collision\nanti-shock\nbang around\nbowl someone over\ncannon\ncatch\ncollision\ncrash\nhead-on\njog\nplough\nplough into something/someone\npost-crash\nrear-end\nrun (something) into something/someone\nrun someone/something down\nslam\nsmash something up\nstack up\nstub\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFootball/soccer\nGeneral terms used in ball sports\nAttacking & invading\nstrike noun [C]\n(DISCOVERY)\nthe discovery underground of a valuable substance: gold strike The population and settlement of Colorado expanded after the gold strike of 1858.\nSMART Vocabulary: related words and phrases\nEngineering - mining & quarrying\nanti-mine\nbanksman\nbeneficiation\nbiomining\ncoal\ncoal miner\ncoal mining\ncoalface\nextract\noilfield\nOPEC\npetrodollar\npit pony\npithead\nprospect\nrig\nshaft\nslag heap\nstrip mining\nunworked\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFinding and discovering\nstrike noun [C]\n(SUCCESS)\na sudden success, such as a a goal in football or a wicket in cricket: Thanks to a couple of late strikes from Charlie, we won the game 3-2.\nsports\n&#160; specialized in bowling, a first roll of the ball that knocks down all the pins: He'd bowled six consecutive strikes. She bowled poorly, with just one strike and a 130 score.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\ndraw\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBowls, bowling & croquet\nstrike noun [C]\n(FAILURE)\nsports\n&#160; specialized (in baseball) a ball that has been thrown by the pitcher and not been hit successfully when it should have been: A batter is out after three strikes. Only nine of his 22 pitches were strikes.\nUS a failure, mistake, or disadvantage: California's \"three strikes and you're out\" bill means that from now on criminals found guilty of three crimes are jailed for life.strike against One strike against him as a candidate is his perceived lack of charisma.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbottom\nchopper\nfarm\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFailures\nFaults and mistakes\nstrike verb\n(HIT)\nAdd to word list\nAdd to word list\n[ I/T ] to hit or physically attack someone or something: [ T ] A car struck the man trying to cross a major highway. [ T ] She was struck in the back of the head by a ball that was thrown across the field.\n[ I/T ] If you strike a match, you cause it to burn by rubbing it against a rough surface.\nstrike verb\n(CAUSE HARM)\n[ I/T ] past participle stricken us/ˈstrɪk·ən/ to bring sudden harm, damage, or injury to a person or thing: [ T ] It was a disease that struck mainly young people. [ I ] Many public health officials fear that a similar flu virus will one day strike again. [ T ] He was stricken with polio at the age of 13 and lost the use of his legs.\nstrike verb\n(STOP WORK)\n[ I/T ]\n&#160; social studies to refuse to continue working because workers or their labor union (= employees’ organization) cannot come to an agreement with an employer over pay or other conditions of the job: [ I ] Flight attendants are threatening to strike to get more flexible schedules.\nstrike verb\n(CAUSE AN IDEA)\n[ T ] to cause someone to have a feeling or idea about something: From what you’ve said, it strikes me that you would be better off working for someone else. I was struck by her sincerity.\n[ T ] To strike also means to suddenly cause someone to think of something: I was immediately struck by the similarities in their appearance.\nstrike verb\n(DISCOVER)\n[ T ] to discover something such as oil, gas, gold, etc., underground at a particular place: to strike gold/oil\nstrike verb\n(AGREE)\n[ T ] to agree to or achieve a solution: My children and I have struck a deal – they can play any kind of music they want as long as I don’t hear it.\n[ T ] If you strike a balance between two things, you try to give an equal amount of attention or importance to each: It’s a question of striking the right balance between quality and productivity.\nstrike verb\n(SHOW THE TIME)\n[ I/T ] (esp. of a clock) to make a sound or a series of sounds that show the time: [ T ] The clock struck midnight. Idioms\nstrike a chord (with someone)\nstrike it richPhrasal verbs\nstrike back\nstrike down something\nstrike out\nstrike out\nstrike out (someone)\nstrike out at someone/something\nstrike up something\nstrike up (something)\nstrike noun\n(HIT)\n[ C ] a brief military attack: air/military strikes\nstrike noun\n(REFUSAL TO WORK)\n[ C/U ] a period of time when workers refuse to continue working because they cannot come to an agreement with an employer: [ U ] If the teachers go on strike again and close the schools down, I don’t know what I’ll do with the kids.\nAdd to word list\nAdd to word list\na period of time when a group of workers refuse to work because they are not satisfied with their pay, working conditions, etc.: In a statement, the union said there were no plans for a strike. a postal/rail workers'/miners' strike a 24-hour/2-day, etc. strikecall for/call off/avoid a strike Managers sought to avoid a strike by cabin crew over sick leave rules.a strike by sb Fresh moves to stop more strikes by council workers will be made this week.a strike against sth 20% of the workforce has joined a strike against the privatization plans announced yesterday.a strike begins/ends/goes ahead The strike will begin at 6 a.m. Oct. 31 and end 24 hours later.\nbe on strike\nif a group of workers are on strike, they refuse to work because they are not satisfied with their pay, working conditions, etc.: Refuse collectors are on strike and rubbish is now piling up across the region.\ngo (out) on strike (also come/walk out on strike)\nif a group of workers go on strike, they stop working because they are not satisfied with their pay, working conditions, etc.: Around 160 staff are due to go on strike next week in a row over pay.\ncall/take/lead sb out on strike\nif a trade union or official organization calls, takes, or leads a group of workers out on strike, it announces that they are stopping working because they are not satisfied with their pay, working conditions, etc.: The Police Federation has refused to take its members out on strike. See also\nall-out strike\ngeneral strike\nlightning strike\nofficial strike\nsit-down strike\nsympathy strike\ntoken strike\nunofficial strike\nwildcat strike\n[ I ]\n&#160; HR, WORKPLACE if a group of workers strike, they refuse to work because they are not satisfied with their pay, working conditions, etc.: Under current legislation, police and prison officers are not allowed to strike.\nstrike a deal/agreement (with sb/sth)\n[ T ] to agree to do business with another person or company: Takeover money has been deposited in a bank account, in expectation of striking a deal before tomorrow. The media group yesterday released the details of an agreement that it had struck with dissident investors concerning the forthcoming shareholder vote.\nstrike a balance (between sth and sth)\n[ T ] to find a way to satisfy two opposing demands or needs: We have recruited younger members to the board in an effort to strike a balance between popular appeal and innovative experimentation.\nstrike gold [ T ] informal\nto do something that makes you very successful or rich, especially in a way that is unexpected: After a slow start, the carmaker finally struck gold in the US.\nstrike oil/gold\n[ T ]\n&#160; NATURAL RESOURCES to find oil or gold under the surface of the earth: The company announced it had struck oil at one of its wells in Siberia. Phrasal verbs\nstrike sb/sth off\nstrike out\nstrike sth out"}