{"id":346611,"name":"striking","type":"adjective","us_sound":"ˈstraɪ.kɪŋ","us_link":"../audio/s/striking.mp3","uk_sound":"ˈstraɪ.kɪŋ","uk_link":"../audio/s/ukstrik005.mp3","content":"Add to word list\nAdd to word list\nB2 very unusual or easily noticed, and therefore attracting a lot of attention: She bears a striking resemblance to her mother. There's a striking contrast between what he does and what he says he does. The library is a striking example of modern architecture. There are striking similarities between the two cases. Their production of Macbeth was the most visually striking performance I've ever seen.\nmore attractive than usual: He's good-looking, but he's not as striking as his brother.\nThesaurus: synonyms, antonyms, and examples\na beautiful person, painting, sight, etc.beautifulI've never seen a more beautiful view in my life.attractiveHer husband is really attractive.good-lookingI think they're very good-looking.handsomeHe's so handsome.prettyYour daughter is very pretty.gorgeousYou look gorgeous in that dress!\nSee more results »\nMore examplesFewer examplesThere was a striking arrangement of dried flowers on the table.I don't know if you'd call her pretty but she's certainly very striking.There was a very striking fireplace in the main room.The book bears several striking similarities to last year's bestseller.This is a striking example of architecture of the period.\nSMART Vocabulary: related words and phrases\nApparent and obvious\n(from) under your nose idiom\napparent\nbe (as) plain as the nose on your face idiom\nbe (right) under your nose idiom\nbe etched somewhere idiom\nbe writ large idiom\nflagrantly\nforegone conclusion\nglaring\nglaringly\nI need hardly do something idiom\nobtrude\novertly\npalpable\npalpably\nparallax\npatently\nsqueaky\nstand/stick out a mile idiom\nwritten all over someone's face idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttractive\nRelated word\nstrikingly\nAdd to word list\nAdd to word list\nobvious, interesting, and (esp. of a person) often attractive: Perhaps the most striking feature of this computer is that it is so easy to use. There was a striking physical resemblance between the two men. He was a striking figure with full beard and flowing, collar-length hair. strikingly adverb us\nYour browser doesn't support HTML5 audio\n/ˈstrɑɪ·kɪŋ·li/\na strikingly beautiful landscape They came to strikingly different conclusions about what should be done."}