{"id":346511,"name":"strict","type":"adjective","us_sound":"strɪkt","us_link":"../audio/s/strict.mp3","uk_sound":"strɪkt","uk_link":"../audio/s/ukstrep018.mp3","content":"Add to word list\nAdd to word list\nB1 strongly limiting someone's freedom to behave as they wish, or likely to severely punish someone if they do not obey: strict with My parents were very strict with me when I was young.strict controls Stricter controls on air pollution would help to reduce acid rain.strict curfew A strict curfew has been imposed from dusk till dawn.strict guidelines We follow very strict guidelines on the use and storage of personal details on computers.strict laws Do you think stricter gun laws would reduce the murder rate in the United States?strict supervision The drug should only be administered under strict medical supervision.strict secrecy The negotiations took place in strict (= total) secrecy.\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nC2 exactly correct: a strict translation of the textstrict interpretation He would be found guilty under a strict interpretation of the law.\nB2 used to refer to someone who follows the rules and principles of a belief or way of living very carefully and exactly, or a belief or principle that is followed very carefully and exactly: His parents were strict Catholics.strict vegetarian She's a strict vegetarian and refuses to eat any poultry or fish. in the/a strict sense\nin the most limited meaning of a word, phrase, etc.: These were not funerals in the strict sense of the word; there were no caskets or physical remains.\nSee more\nMore examplesFewer examplesSecurity checks have become really strict at the airport.The club has a strict code of conduct.The laws controlling drugs are very strict in this country.He grew up in a strict church-going family.He had been a strict father but was indulgent towards his grandchildren.\nSMART Vocabulary: related words and phrases\nSevere\nan iron hand/fist in a velvet glove idiom\naustere\nausterely\nauthoritarian\nbe heavy on someone idiom\nbrutally\nflaming\nharsh\nharshness\nnonsense\nnot stand any nonsense idiom\npitiless\nseverely\nseverity\nsharp\nsharply\nsharpness\nstern\nsternly\nsternness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccurate and exact\nIdiom\nin the strictest confidence\nAdd to word list\nAdd to word list\nlimiting people’s freedom to behave as they wish beyond what is usual: The school is an old-fashioned institution with strict discipline. Do you think stricter laws would help reduce automobile accidents? He’s not a vegetarian in the strictest sense (= if you are exact about the word’s meaning)."}