{"id":346516,"name":"strictly","type":"adverb","us_sound":"ˈstrɪkt.li","us_link":"../audio/s/strictly.mp3","uk_sound":"ˈstrɪkt.li","uk_link":"../audio/s/ukstrep019.mp3","content":"Add to word list\nAdd to word list\nB2 in a way that would bring severe punishment if not obeyed: The speed limit is strictly enforced on urban roads. The use of cameras in this museum is strictly forbidden.\nin a very limited or limiting way: Should I mark this letter to your accountant \"strictly confidential\"? The proposed change in the law would make abortion illegal except for strictly defined medical reasons. This unrepeatable offer is only available for a strictly limited period.\nB2 exactly or correctly: I have acted strictly in accordance with the regulations at all times. It is essential that the safety procedures are strictly adhered to. Their salaries are not strictly comparable (= cannot be directly compared) because of the differences in UK and US tax rates. Are all these questions strictly (= really) necessary?\nMore examplesFewer examplesThe export of ivory is now strictly controlled.My father was a real authoritarian so we were brought up very strictly.Laws against racial prejudice must be strictly enforced.Parking is strictly prohibited between these gates.The translator has obviously adhered very strictly to the original text.\nSMART Vocabulary: related words and phrases\nSevere\nan iron hand/fist in a velvet glove idiom\naustere\nausterely\nauthoritarian\nbe heavy on someone idiom\nbrutally\nflaming\nharsh\nharshness\nnonsense\nnot stand any nonsense idiom\npitiless\nseverely\nseverity\nsharp\nsharply\nsharpness\nstern\nsternly\nsternness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccurate and exact\nIdiom\nstrictly speaking\nAdd to word list\nAdd to word list\ncompletely or entirely: Photography is strictly forbidden. Public assistance is strictly limited to those who are willing to work. Strictly speaking (= Being completely accurate), pollen is like a virus in that both cannot reproduce independently."}