{"id":346625,"name":"stringent","type":"adjective","us_sound":"ˈstrɪn.dʒənt","us_link":"../audio/s/stringent.mp3","uk_sound":"ˈstrɪn.dʒənt","uk_link":"../audio/s/ukstrik012.mp3","content":"stringent adjective\n(SEVERE)\nAdd to word list\nAdd to word list\nhaving a very severe effect, or being extremely limiting: The most stringent laws in the world are useless unless there is the will to enforce them. We need to introduce more stringent security measures such as identity cards. Stringent safety regulations were introduced after the accident.\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nSMART Vocabulary: related words and phrases\nSerious and severe\nacutely\nacuteness\ncatastrophic\ncatastrophically\nchronic\ncritically\ndire\nfatal\ngrave\ngrievously\nheaviness\nhyperacute\nnon-fatal\nnon-serious\nseriously\nswingeing\nterminal\nterminally\ntoughness\nutmost\nSee more results »\nstringent adjective\n(LIMITING MONEY)\nfinance &amp; economics\n&#160; specialized involving not enough money being available for borrowing as a result of firm controls on the amount of money in an economy: Already low living standards have been worsened by stringent economic reforms.\nSMART Vocabulary: related words and phrases\nEconomics\naccommodative\nanti-economic\nanti-inflation\nanti-inflationary\nanti-recession\ndeindustrialization\ndouble-dip\nGDP\nhuman development index\nindustrialism\ninflation\nKeynesian\nliberal\nmarket economy\nmarketeering\nmonetary\npeace dividend\nretrench\nstagflation\nthe public purse\nSee more results »\nRelated words\nstringency\nstringently\nAdd to word list\nAdd to word list\nextremely limiting or difficult; severe: Members of the organization have to be willing to abide by the stringent rules. The city has stringent fire-safety standards.\nAdd to word list\nAdd to word list\nstringent laws, tests, etc. are extremely severe or limiting and must be obeyed: Stringent security measures have been introduced at all airports. Regulators are forcing issuers to adopt more stringent criteria. stringent rules/regulations/laws stringent conditions/requirements stringent checks/controls/tests\nECONOMICS involving very little money being available for spending or borrowing as a result of firm controls: Stringent cost management is counterproductive when it interferes with a firm's ability to grow.stringent cost-cutting/cuts Prices are now falling slightly after stringent budget-deficit cuts. stringently adverb\nDrugs are the most stringently regulated of all consumer goods."}