{"id":346684,"name":"stripping","type":"noun","us_sound":"ˈstrɪp.ɪŋ","us_link":"../audio/s/cdo0622usstri1733.mp3","uk_sound":"ˈstrɪp.ɪŋ","uk_link":"../audio/s/cdo0622ukstri1884.mp3","content":"stripping noun [U]\n(REMOVING)\nAdd to word list\nAdd to word list\nthe act of removing something from somewhere: Logging companies were guilty of the stripping of jungle mountains and plains of their natural cover. the stripping of the bark from cork oak trees A heat gun is useful if you do a lot of paint stripping. See also\nasset-stripping\nthe act of removing everything that is not part of the structure of a room or building: The stripping of the kitchen, and disposal of all units and appliances, was included in the quoted price.\nthe act of taking something away from someone, usually as a form of punishment: The new Act proposed various sanctions, including the stripping of citizenship from Americans. Positive drug tests would lead to retroactive disqualifications, including stripping of any medals, and two-year bans.\nMore examplesFewer examplesThere were protests about the stripping of vegetation at the construction site.The arrival of new investors is likely to mean the stripping of assets.The construction company said that air samples showed that no asbestos fibres became airborne during the stripping operation.He complained that secularists were asking for the stripping of all conceivable authority from church institutions.\nSMART Vocabulary: related words and phrases\nRemoving and getting rid of things\nabandonment\nbanish\nbe scattered to the four winds idiom\nbin\ncast someone/something aside/away/off\nelimination\nerase\nevacuate\nevacuation\nexorcism\nexpunge\nexpurgate\nshrug\nshrug something off\nshuck\nshuck something off\nshuffle something off\nsling\ntoss\nturf\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking things away from someone or somewhere\nstripping noun [U]\n(REMOVING CLOTHES)\nthe act of taking off all of your clothes, or of taking off all of another person's clothes: Everyone has to go through the process of stripping and showering before they can have any contact with the test animals. No stripping off was involved — everyone remained fully clothed at all times. The report listed a number of abuses including the repeated stripping of prisoners as a punishment.\nthe activity or job of taking off your clothes in public in a sexually exciting way, as a form of entertainment: She wrote an article about her year as a stripper, and described stripping as a branch of show business. Not everyone is suited to a career in stripping.\nSMART Vocabulary: related words and phrases\nNot wearing or removing clothes\naltogether\nau naturel\nbare\nbare naked idiom\nbarefoot\nfling\ngo commando idiom\nimmodest\nimmodestly\nimmodesty\nin your birthday suit idiom\nnudity\nrevealing\nshirtsleeve\nshuck\nshuck something off\nstreaker\nunclad\nundress\nundressed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSpectacles & performances\nstripping noun [U]\n(MATERIAL)\nmaterial in the form of a strip that is placed around something in order to protect it: Ways to deter slugs include copper stripping around young shoots or crushed eggshells on the nearby ground. See also\nweatherstripping\nSMART Vocabulary: related words and phrases\nProtection and protectors\nadopt\nadoptable\naegis\nanti-shark\nanti-skid\nchaperone\ncustodian\ncybersecurity\ndefence mechanism\nden mother\ndoorkeeper\nelder care\nmuzzle\nprecaution\nsafe space\nsafeguarding\nsafekeeping\nsafety net\nsecurity guard\nsentry\nSee more results »\npresent participle of\nstrip"}