{"id":346860,"name":"strop","type":"noun","us_sound":"strɑːp","us_link":"../audio/s/cus01978.mp3","uk_sound":"strɒp","uk_link":"../audio/s/ukstrol007.mp3","content":"strop noun [C]\n(STRAP)\nAdd to word list\nAdd to word list\na strip of leather or other material that you can rub an old-fashioned razor, knife, etc. on in order to make the blade sharp : Use a strop to maintain a sharp edge on your knives and cutting tools. a razor strop\na length of rope, etc., formed into a ring at the end, that is used, for example, for supporting something heavy when it is being moved, or for tying a boat up so that it does not float away: The crane was in position, the strops were on, and the boat was lifted high and then lowered gently onto the waiting low-loader. The mooring strop allows boats to be moored to buoys.\nMore examplesFewer examplesOther materials can be used but strops are most often made of leather. Once you've learned to sharpen with a stone, it's time to maintain your edge with a strop.This extension was designed to avoid the need to connect a recovery strop to a heavy and dangerous chain.\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\ndull\nhone\njag\njaggy\nkeen\npointed\nprickly\nsharp\nsharpen\nsharply\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nsuper-sharp\nwhet\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of ships & boats\nRaising and lowering\nFastening and tying\nstrop noun [C]\n(MOOD)\nUK informal a bad mood, especially one in which a person will not do as they are asked and is unpleasant to other people: Don't go in unless you have to - she's in a (real) strop. He's impossible to talk to when he's having one of his strops. When she didn't get what she wanted she threw a strop. have a strop on\nto be in a bad mood: Why have you got such a strop on - what's happened?\nSMART Vocabulary: related words and phrases\nMoods\n-humoured\nbe in one of your moods idiom\nblack mood\neat\nframe\nmind\nmood\nsomeone's state/frame of mind idiom\nspirit\nsuck\nsucking diesel idiom\nsulk\ntemperament\ntemperamentally\ntemperature\ntone\nup and down idiom\nvolatility\nwhat's eating someone? idiom\nyourself\nSee more results »\nstrop verb\n(MAKE SHARP)\n[ T ] to make a blade, etc. sharp by rubbing it on a strip of leather or other material: The barber's customers miss the familiar sound of a cut-throat blade being stropped on a leather strap.\nMore examplesFewer examplesHe stropped a knife razor-sharp on the inside of his belt.He stood stropping a razor as a rhythmic accompaniment to his friend's guitar playing.\nSMART Vocabulary: related words and phrases\nSharp and blunt\nangularity\nblunt\ndull\nhone\njag\njaggy\nkeen\npointed\nprickly\nsharp\nsharpen\nsharply\nsharpness\nspike\nspiked\nspikily\nspiky\nspiny\nsuper-sharp\nwhet\nSee more results »\nstrop verb\n(BEHAVE ANGRILY)\n[ I usually + ADV/PREP ] UK informal to act or go somewhere in a way that shows you are in a bad mood and angry with other people: She muttered goodbye and stropped off home. All he does is strop around with a grumpy face, complaining about everything.\nMore examplesFewer examplesShe used to strop about like a horrible moody teenager.What did he do if he didn't get his way? He stropped.\nSMART Vocabulary: related words and phrases\nBecoming angry and expressing anger\n(almost) burst a blood vessel idiom\nape\nballistic\nbananas\nbay for blood idiom\nblow\nchip\nfulminating\nfume\nget bent out of shape idiom\nget your knickers in a twist idiom\ngive someone evils idiom\nroof\nsharp\nsplenetic\nsplenetically\nstew\ntemper\ntempered\nthrow\nSee more results »"}