{"id":346804,"name":"strong","type":"adjective","us_sound":"strɑːŋ","us_link":"../audio/s/strong.mp3","uk_sound":"strɒŋ","uk_link":"../audio/s/ukstrol002.mp3","content":"strong adjective\n(NOT WEAK)\nAdd to word list\nAdd to word list\nA2 powerful; having or using great force or control: She must be very strong to carry such a weight on her back. It is surely the duty of the stronger members in a society to help those who are weak.strong influence/effect My grandmother had a strong influence/effect on my early childhood. Strong winds are forecast in the area for the next few days. It's surprising what strong memories a photograph can produce.as strong as an ox Get Carl to lift it - he's as strong as an ox (= very strong).\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of physical or mental strengthstrongHe is a big, strong man.strongTwo thirds of voters see him as a strong leader.powerfulHe is the most powerful fighter I have seen in a boxing ring.muscularHe is tall with a muscular body.muscledShe has worked hard to achieve that muscled body.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nfelt or experienced with a lot of forcestrongI felt a strong urge to hug him.powerfulAnger is one of the most powerful human emotions.intenseShe learned that even intense emotional pain passes.fierceThe people have a fierce pride in their country.deepHe suffered from a deep feeling of inadequacy.deep-seatedHe has a deep-seated loathing of snobbery.\nSee more results »\nB2 effective; of a good quality or level and likely to be successful: We will need strong policies if our economic problems are to be solved. I can give you stronger pain-killing drugs if these aren't strong enough. Strong trading links exist between us and many South American countries.\nThesaurus: synonyms, antonyms, and examples\nhaving a lot of physical or mental strengthstrongHe is a big, strong man.strongTwo thirds of voters see him as a strong leader.powerfulHe is the most powerful fighter I have seen in a boxing ring.muscularHe is tall with a muscular body.muscledShe has worked hard to achieve that muscled body.\nSee more results »\nB2 skilled or good at doing something: Without a doubt, she's the strongest candidate we've interviewed for the job.strong on As a guitarist, he's strong on (= good at) technique but lacks feeling in some pieces.\nMore examplesFewer examplesHe was swept out to sea by the strong current.I'm not a strong swimmer so I prefer not to go out of my depth.You'll need a strong abrasive for cleaning this sink.The strong police presence only heightened the tension among the crowd.A strong wind will favour the bigger boats.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEfficient and effective\nIntelligence\nstrong adjective\n(DETERMINED)\nB2 difficult to argue with; firm and determined: strong opinion She has strong opinions about religion.strong personality He has a strong personality, but don't let him bully you.strong view Most of the group have strong views on the subject of divorce.\nMore examplesFewer examplesHe's a strong advocate of state ownership of the railways.She left home in the face of strong opposition from her parents.Some people put their faith in strong leaders rather than sound policies.What this state needs is really strong government.I don't think that's a very strong argument.\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngoing\ngrittily\ngutsily\ngutsy\ngutty\npersistent\npersistently\npertinacious\npertinaciously\npigheaded\ntough\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nSee more results »\nstrong adjective\n(NOTICEABLE)\nB1 If a taste, smell, etc. is strong, it is very noticeable or powerful: A strong light was shining straight in my eyes. There's a really strong smell of bleach in the corridor. This coffee is too strong for me. The room was decorated in very strong colours. What a strong likeness there is between the brothers!\nMore examplesFewer examplesHe's got a strong French accent.There was a strong smell of burning.The sun was so strong we had to pull down the blinds.The stink of rotting seaweed was strong along the seashore.How do you like your tea - strong or weak?\nSMART Vocabulary: related words and phrases\nHaving a powerful effect\nblazing\ncompelling\ncompellingly\ndevastating\ndevastatingly\nelementally\nfullness\nhigh-impact\nhyperintense\nimpactful\nlife-altering\nlife-changing\npungent\nscalding\nsuper-real\ntake (something) over\ntenaciously\nunconquerable\nunfailing\nvividly\nSee more results »\nstrong adjective\n(DIFFICULT TO BREAK)\nB1 difficult to break, destroy, or make sick, or able to support a heavy weight or force: a strong box/chair The window is made from very strong glass - it won't shatter. It's a serious disease, but he's very strong - I think he'll pull through. See also\nstrength (POWER)\nThesaurus: synonyms, antonyms, and examples\nbreaking easilyweakIf trees do not get enough water they become weak.strongSteel is a very strong material.flimsyThere was only a flimsy inflatable raft between him and the raging riverricketyWe climbed up the rickety wooden stairs.fragileSome objects are too fragile to be moved between the museums.delicateShe carefully wrapped up the delicate glass ornaments.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nnot breaking easilystrongYou will need a strong cardboard box to carry all those books.toughCeramic tiles are tougher than plastic shower screens.sturdyYou'll need sturdy boots for this weather.solidYou will need to build a good solid base for your shed.hard-wearingCotton canvas is the most hard-wearing fabric.\nSee more results »\nMore examplesFewer examplesMind that box - the bottom isn't very strong.He has a very strong constitution.He has good strong digestion.The bags we sell have very strong seams, so they will last for years.These are good strong toys for tiny tots.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nstrong adjective\n(LANGUAGE)\nexpressing something in a forceful way, without trying not to offend people: strong words He used very strong words about the way the federal officials had behaved. The manager had some strong words to say about the team's defensive play. She said that she condemned their actions in the strongest terms. strong language\nlanguage that expresses something in a forceful way, without trying not to offend people: The State Department also used strong language to deny a US policy shift.\nlanguage that uses a lot of swear words (= rude or offensive words): The movie is rated PG for strong language.\nSee more\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\ncadence\nintone\nmispronounce\nnon-verbal\nnon-verbally\northoepy\nparalanguage\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nstrong adjective\n(LIKELY)\nC2 very likely to happen: strong possibility/likelihood There's a strong possibility/likelihood of finding the child within the next few hours.strong chance The treatment's chances of success are stronger if it is started as soon as the disease is diagnosed.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\nstrong adjective\n(IN NUMBER)\n[ after noun ] having the stated number of people, members, etc.: The crowd had grown to be several hundred strong. See also\nstrength (NUMBER)\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nstrong adjective\n(CHEMISTRY)\nchemistry\n&#160; specialized A strong acid, alkali, or chemical base produces many ions (= atoms with an electrical charge) when it is dissolved in water.\nSMART Vocabulary: related words and phrases\nChemistry - general words\nacceptor\naerosol\naerosolize\nallotrope\namphiprotic\nbalanced equation\ndistilled water\nelectrolyte\nendocrine disruptor\nendothermic\nepitaxial\nepitaxially\nepitaxy\ninorganic chemistry\nionic bond\nnonelectrolyte\nnonreactive\npreatomic\nreactive\nreactivity\nSee more results »\nIdioms\nbe going strong\nstrong nerves\ncome on strong\nUK to behave towards another person in a way that is too severe, or that shows a strong sexual interest that the other person does not want: I think you came on a bit strong - it wasn't her fault.\nUS to make an extra effort in order to be successful or to have control in a situation: He came on strong in the early rounds to annihilate the competition.\nSee more\nstrong adjective [-er/-est only]\n(PHYSICALLY POWERFUL)\nAdd to word list\nAdd to word list\nphysically powerful or energetic: You must be strong to be able to lift all that weight. I feel a little stronger every day. Strong winds blew down a number of trees. The doctor prescribed a stronger pain-killer.\nstrong adjective [-er/-est only]\n(DIFFICULT TO BREAK)\nnot easily broken or damaged: The swings are strong enough for any of the kids.\nstrong adjective [-er/-est only]\n(DETERMINED)\nhaving a forceful and determined personality: He has a strong personality, but don’t let him intimidate you.\nstrong adjective [-er/-est only]\n(IMPORTANT)\nhaving a lot of influence or importance: My grandmother had a strong influence on me as a child. He is a strong supporter of the arts in the city.\nstrong adjective [-er/-est only]\n(PERSUASIVE)\nbelieved or expressed without any doubt; persuasive: She has strong opinions about many things. There are strong arguments to support both sides.\nstrong adjective [-er/-est only]\n(OBVIOUS)\neasily noticed, felt, tasted, or smelled; obvious: He bears a strong likeness to his brother. This coffee is too strong! There was a strong smell of gas.\nstrong adjective [-er/-est only]\n(REALISTIC)\nlikely or realistic: There’s a strong possibility that the naval base will close next year.\nAdd to word list\nAdd to word list\nan activity or industry that is strong is growing and becoming more successful: Economic news has been better than expected, with retail sales remaining strong. Worldwide sales benefited from a strong performance in Europe. strong demand/growth/trading a strong economy/market/sector\nhaving or making a lot of money and so in a good financial position: Commodity prices have remained extremely strong this year. The Company maintains a strong financial position, with working capital of $33,500,000. Several technology stocks are continuing to post strong gains on Nasdaq. Nearly all leading markets enjoyed a strong performance during April, led by Wall Street. strong balance sheets/cash flows\nhaving existed for a long time and likely to remain successful: While Europe has developed a strong position in mobile communications, substantial barriers still remain. Owning a strong brand is key to having a successful business. a strong link/relationship/alliance\nused to describe behaviour or opinions that are firm and determined: Scientists have been telling us for years that it is essential for us to take strong action on global warming. Against strong opposition from some CEOs, investors moved to ensure that the roles of chair and CEO were separated. strong leadership/managementstrong commitment/interest/support There has been strong support in Congress for the proposals.\nMONEY a currency that is strong keeps or increases its value in relation to most other currencies: Money experts anticipate the pound will remain strong against the dollar next year. a strong dollar/euro/pound\n-strong\nused after a number to show how many people belong to or are involved in something: The call centre has an 80-strong workforce.\nbe sb's strong point/suit\nto be the thing that someone is particularly good at: Financial planning does not seem to be the strong suit of many consumers in the modern world.\na strong chance/possibility\nused to say that something is likely to happen: A sale of the business in three parts is a strong possibility."}