{"id":346840,"name":"strongly","type":"adverb","us_sound":"ˈstrɑːŋ.li","us_link":"../audio/s/strongly.mp3","uk_sound":"ˈstrɒŋ.li","uk_link":"../audio/s/ukstrol004.mp3","content":"strongly adverb\n(NOT WEAK)\nAdd to word list\nAdd to word list\nB2 very much or in a very serious way: They strongly believe their children should make choices for themselves. Many locals are strongly opposed to the development.\nMore examplesFewer examplesDo you feel very strongly about this?Sex outside marriage is strongly disapproved of in some cultures.The government's proposals have been strongly criticized by the trade unions.It was a strongly worded statement.We, the undersigned, strongly object to the closure of St. Mary's Hospital: Jack James (Dr), Philippa Curry (Dr), Hugh Edwards.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nserious\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nstrongly adverb\n(DIFFICULT TO BREAK)\nin a way or form that is difficult to break: Equipment will have to be strongly made to endure the weather conditions on the ice cap.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nviolent\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nstrongly adverb\n(IN IMPORTANT WAY)\nAdd to word list\nAdd to word list\nin a very important or serious way: Beliefs are strongly tied to culture.\nstrongly adverb\n(IN PERSUASIVE WAY)\n[ not gradable ] in a persuasive or determined way: He is strongly opposed to censorship. Voters strongly supported the candidate.\nstrongly adverb\n(IN WAY THAT IS HARD TO BREAK)\nin a way or form that is difficult to break: The castle walls were strongly constructed of stone.\nAdd to word list\nAdd to word list\nin a way that shows that something is performing well or improving a lot: Markets on both sides of the Atlantic have performed strongly. The FTSE 100 later bounced back strongly to close 134.6 points higher at 4131.\nin a way that shows strong feelings or opinions: The project was strongly opposed by environmental groups. She has strongly denied the allegations."}