{"id":346920,"name":"structuralist","type":"adjective","us_sound":"ˈstrʌk.tʃɚ.əl.ɪst","us_link":"../audio/s/usstron004.mp3","uk_sound":"ˈstrʌk.tʃər.əl.ɪst","uk_link":"../audio/s/ukstrol015.mp3","content":"Add to word list\nAdd to word list\nusing or relating to structuralism (= a way of studying human culture that emphasizes the importance of its basic structures and the relationships between its parts) : His theories on language became an important part of the European structuralist movement. Foucault was a structuralist philosopher noted for his examination of the concepts and codes by which societies operate. See\nstructuralism\nMore examplesFewer examplesStructuralist film-makers were trying to undo our sense of what film could be.The structuralist account portrays structures as relatively unchanging and self-reproducing.Recent structuralist theories contend that patterns of international interaction reflect the needs of capitalist exploitation.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArt history & artistic movements\nArtists\nsomeone who uses structuralism (= a way of studying human culture that emphasizes the importance of its basic structures and the relationships between its parts): Structuralists stressed the uniqueness of language systems. Broadly speaking, structuralists shift the focus from specific objects to the systems to which they belong. See\nstructuralism\nMore examplesFewer examplesIn the words of structuralist Paul Roberts, \"the best reason for studying grammar is that grammar is interesting.\"According to the structuralists, the state is still a dominant actor in international relations. His way of thinking so very different from the art world structuralists for whom criticism was reduced to a pseudo-science.\nSMART Vocabulary: related words and phrases\nLiterature\naccentual\naction hero\nalliterative\nalternative history\nanapest\nfemslash\nfiction\nfictionality\nfictionally\nfictive\nnon-canonical\nnon-character\nnon-literary\nnon-metrical\nnon-poetic\nswashbuckler\nsympathetically\ntanka\ntartan noir\ntheatrics\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArtists\nArt history & artistic movements"}