{"id":346926,"name":"structured","type":"adjective","us_sound":"ˈstrʌk.tʃɚd","us_link":"../audio/s/cald4us2230.mp3","uk_sound":"ˈstrʌk.tʃəd","uk_link":"../audio/s/cald4uk1510.mp3","content":"Add to word list\nAdd to word list\nC2 organized so that the parts relate well to each other; having a clear structure: In today's competitive climate, success is most likely to come to those who understand the need for a structured approach to job hunting. The course provides hands-on experience within a structured programme of study. These product reviews are highly structured so that it is easy to make comparisons.\nfinance &amp; economics\n&#160; specialized Structured financial products are designed to be suitable for the particular needs of the person or organization lending or borrowing money, and usually consist of a range of different choices: The company did not insure complicated structured products such as bonds backed by mortgages and credit card receipts. Until the crisis at least half of the lending in the market consisted of structured credit.\nStructured clothes have a definite shape and do not hang loosely: Update your wardrobe with a structured jacket. They slim the body and look great over dresses. Structured clothes have a distinct shape, and will help you look elegant.\nMore examplesFewer examplesThere are moves to introduce more structured learning for three- and four-year-olds.Our data is obtained by means of questionnaires and structured interviews.They were worried about the potential for losses in complex structured finance transactions.The structured jacket is an important part of power dressing.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBorrowing & lending\nClothing - general words"}