{"id":346939,"name":"struggled","type":"verb","us_sound":"ˈstrʌɡ.əl","us_link":"../audio/s/struggle.mp3","uk_sound":"ˈstrʌɡ.əl","uk_link":"../audio/s/ukstrol020.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nstruggle\nstruggle verb\n(EFFORT)\nB2 [ I ] to experience difficulty and make a very great effort in order to do something: [ + to infinitive ] The dog had been struggling to get free of the wire noose. I've been struggling to understand this article all afternoon. Fish struggle for survival when the water level drops in the lake.\nThesaurus: synonyms, antonyms, and examples\nto try to do somethingtryI'll try to call her again.attemptI have never attempted to run a marathon.endeavourUK Engineers are endeavouring to locate the source of the problem.seekThey sought to reassure the public.battleHe was battling to fix the roof in the rain.striveWith limited resources, they are striving to make the school a better one.\nSee more results »\nstruggle along, through, out, etc.\nto move somewhere with great effort: He struggled along the rough road holding his son. By this time he'd managed to struggle out of bed.\n[ I ] informal to be in danger of failing or being defeated: After the first half, United were really struggling.\nMore examplesFewer examplesI struggle to balance work and family commitments.Many single parents struggle to bring their children up on a low income.He struggled to pedal his bicycle up the hill.We struggled up the slippery ascent .The family is struggling to survive on very little money.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSlow and moving slowly\nUnsafe and insecure\nstruggle verb\n(FIGHT)\nB2 [ I ] to fight, especially with your hands: He struggled with his attacker who then ran away.\nThesaurus: synonyms, antonyms, and examples\nto fightfightAll this is really not worth fighting over.scrapTwo boys were scrapping in the playground.brawlThe football hooligans are out brawling again.clashStudents clashed with police during demonstrations at five universities.struggleSome of the customers struggled with the robbers, but to no avail. come to blowsSupporters nearly came to blows with each other before the match.\nSee more results »\nC2 [ I usually + adv/prep ] to use a lot of effort to defeat someone, prevent something, or achieve something: For years she struggled with/against the establishment to get her theories accepted.\nMore examplesFewer examplesShe struggled with her attacker but he was too strong for her.I tried to pick him up but he struggled and got free.\nSMART Vocabulary: related words and phrases\nFighting\narray\nbellicosity\nblood diamond\nbloodlessly\nblow\nboots on the ground idiom\ncall to arms\ncome close to blows idiom\nconflict\ndogfight\nfracas\nknock-down-drag-out\nlock horns idiom\nsend something in\nshadowbox\nshadowboxing\nshoot it out\nshootout\nskirmish\ntoe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEffort and expending energy\nPhrasal verb\nstruggle on"}