{"id":346925,"name":"structure","type":"noun","us_sound":"ˈstrʌk.tʃɚ","us_link":"../audio/s/structure.mp3","uk_sound":"ˈstrʌk.tʃər","uk_link":"../audio/s/ukstrol018.mp3","content":"structure noun\n(ARRANGEMENT)\nAdd to word list\nAdd to word list\nB2 [ C or U ] the way in which the parts of a system or object are arranged or organized, or a system arranged in this way: the grammatical structure of a sentence The structure of this protein is particularly complex. They have a very old-fashioned management structure. Some people like the sense of structure that a military lifestyle imposes.\nMore examplesFewer examplesThe company has a complex organizational structure.We have a differential salary structure based on employees' experience.The report homed in on the weaknesses in the management structure.Microscopy is an invaluable technique for studying the structure of cells.Many organizations have a pyramid structure .\nSMART Vocabulary: related words and phrases\nFrames & structures\nanatomy\narmature\nassembly\nbezel\nclothes hanger\nclothes horse\ncoat hanger\nframework\nframing\ngantry\nhanger\nhomeschool\nmatrix\nphoto frame\npicture frame\nrack\nreframe\nsafety gate\nskeleton\nstair gate\nSee more results »\nstructure noun\n(BUILDING)\nC2 [ C ] something that has been made or built from parts, especially a large building: The proposed new office tower is a steel and glass structure 43 storeys high. Synonyms\nbuilding\nconstruction (BUILDING)\nedifice formal\nerection (BUILDING)\nMore examplesFewer examplesa two-tiered structurea rigid steel and concrete structureLightning conductors protect buildings and tall structures from lightning strikes.There was a large, ball-like structure on top of the building.In a two-stage operation, the multi-spoked steel structure will be raised to the vertical.\nSMART Vocabulary: related words and phrases\nBuildings in general\n-bedroomed\nbeach hut\nbuilding\nbunkhouse\ncampanile\nfour-square\ngeodesic dome\nhalf-timbered\nheritage\nheritage-listed building\nnew-build\nnon-residential\nnon-structural\nNorman\nobservation tower\nresidential\nstructurally\ntower\nturreted\nwarren\nSee more results »\nstructure noun\n(BODY PART)\n[ C ]\n&#160; medical\n&#160; specialized an organ in the body, or part of an organ, that does a particular job\nSMART Vocabulary: related words and phrases\nSubstances & structures in the body\nabductor\naccessorius\nadductor\nadenoid\nagonist\nglomerulus\nGnRH\ngonadotropin\ngracilis\ngrey matter\nnotch\norigin\noxytocin\npapilla\npapillary\nventriculus\nvesica\nvesical\nvesicle\nvestibular\nSee more results »\nC2 to plan, organize, or arrange the parts of something: We must carefully structure and rehearse each scene. a well-structured argument\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nbracket\nconcordance\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nstructure noun\n(ARRANGEMENT)\nAdd to word list\nAdd to word list\n[ C/U ] the arrangement or organization of parts in a system: molecular structure [ U ] Grammatical structure changes from language to language. [ C ] When the United States broke away from England, the social structure did not change very much.\nstructure noun\n(BUILDING)\n[ C ] something built, such as a building or a bridge: The bridge is the longest steel structure in the world.\nto arrange or organize something: Office hours are structured to accommodate individual workers’ needs.\nAdd to word list\nAdd to word list\n[ C ] the way in which the parts of a system are arranged or organized, or the system itself: The company attributed the strong growth to a decentralized corporate structure.pricing/charging/fee structure The phone uses a simplified pricing structure based on minutes of talk time.pay/tax/rate structure A new regional pay structure has been introduced.the structure of sth Market forces will inevitably bring about changes in the structure of the wholesale sector.\n[ C ] an object such as a building, that has been built or arranged in a particular way: Their new head office is an impressive glass and steel structure.\n[ C or U ] the condition of being well arranged or organized: have/lack/need (a) structure His financial plans lack structure.\nSee also\ncapital structure\ncareer structure\ncorporate structure\ncost structure\nfinancial structure\nmatrix structure\nto plan, organize, or arrange the parts of something: Serious questions will be asked about the way they have chosen to structure the company. There are ways to structure the deal that will get around these problems. The funds are all structured slightly differently."}