{"id":347035,"name":"stubborn","type":"adjective","us_sound":"ˈstʌb.ɚn","us_link":"../audio/s/stubborn.mp3","uk_sound":"ˈstʌb.ən","uk_link":"../audio/s/ukstrol030.mp3","content":"Add to word list\nAdd to word list\nB2 disapproving A stubborn person is determined to do what he or she wants and refuses to do anything else: They have huge arguments because they're both so stubborn.\nThesaurus: synonyms, antonyms, and examples\nrefusing to change your actions or opinionsstubbornShe's so stubborn, she'll never admit that she was wrong.be as stubborn as a muleAh, she's as stubborn as a mule. You might as well give her what she wants.mulishHe was generally an easy-going child, but could be mulish when upset.headstrongShe's too headstrong to listen to reason.\nSee more results »\nThings that are stubborn are difficult to move, change, or deal with: He was famed for his stubborn resistance and his refusal to accept defeat. Stubborn stains can be removed using a small amount of detergent. Synonyms\ndurable\nenduring\nimperishable literary\nindelible\nineradicable formal\ningrained\nlasting\nlong-lasting\npermanent\nMore examplesFewer examplesEven as a small child, he could be stubborn.He's very stubborn and it drives me mad sometimes.What infuriates me is his stubborn refusal to admit that he's ever wrong.If he thinks he's in the right he can be very stubborn.Her stubborn streak makes her very difficult to work with sometimes.\nSMART Vocabulary: related words and phrases\nStrong-willed\nadamancy\nadamant\nadamantine\nadamantly\naggressive\ngoing\ngrittily\ngutsily\ngutsy\ngutty\npersistent\npersistently\npertinacious\npertinaciously\npigheaded\ntough cookie\nultra-competitive\nultra-militant\nultra-serious\nunbending\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComplicated and difficult to do\nRelated words\nstubbornly\nstubbornnessIdiom\nbe as stubborn as a mule\nAdd to word list\nAdd to word list\nopposed to change or suggestion: He’s sick, but he’s too stubborn to see a doctor.\nIf something is stubborn, it is hard to fix or deal with: stubborn stains a stubborn problem"}