{"id":347060,"name":"stuck","type":"verb","us_sound":"stʌk","us_link":"../audio/s/stuck.mp3","uk_sound":"stʌk","uk_link":"../audio/s/ukstubb006.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of stick\nSMART Vocabulary: related words and phrases\nGlues, gluing & stickiness\nadhere\nadherent\nadhesion\nadhesive\nadhesively\nbinder\ngloop\ngloopy\nglue\nglue gun\nglue stick\npitchy\npropanone\nputty\nScotch tape\nself-adhesive\ntackiness\ntacky\ntreacly\nviscid\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nContinue & last\nPlacing and positioning an object\nInserting and forcing things into other things\nB2 unable to move, or set in a particular position, place, or way of thinking: This door seems to be stuck - can you help me push it open?stuck in Seven of us were stuck in the lift for over an hour. I hate being stuck (= having to be) behind a desk - I'd rather work outside. Synonyms\nblocked\ngridlocked\njammed (STUCK)\nin a difficult situation, or unable to change or get away from a situation: We'd be stuck if your sister hadn't offered to come over and look after the children tonight.\nC1 not able to continue reading, answering questions, etc. because something is too difficult: I'm really stuck - do you have any idea how to answer these questions? be stuck with someone/something\nC2 to have to deal with someone or something unpleasant because you have no choice or because no one else wants to: We were stuck with him for the entire journey!\nSee more\nMore examplesFewer examplesI got stuck in a traffic jam for half an hour.When you're stuck in traffic, a mobile phone's an absolute life-saver.I tried to push the door open but it was stuck.She told me a hilarious story about the time she got stuck in an elevator.A fish bone got stuck in my throat.\nSMART Vocabulary: related words and phrases\nNot able to be changed\nbe no hard and fast rules idiom\nburn your boats/bridges idiom\ncongenital\ncontinuity\ndeep-seated\nincorrigible\nincurably\ninelastic\ninelasticity\ninflexible\nirreversible\nirreversibly\nirrevocable\nirrevocably\nleopard\nsb's way or the highway idiom\nunchangeable\nuncompromising\nuncompromisingly\nunredeemable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing difficulties\nConfusion, confusing and feeling confused\nIdioms\nbe stuck on someone/something\nget stuck in\nstuck\n(STICK)\nAdd to word list\nAdd to word list\npast simple and past participle of stick\nunable to move from a particular position or place, or unable to change a situation: This door seems to be stuck. I hate being stuck at a desk all day. Ty got stuck with doing the laundry. Idiom\nstuck on someone"}