{"id":347102,"name":"studio","type":"noun","us_sound":"ˈstuː.di.oʊ","us_link":"../audio/s/studio.mp3","uk_sound":"ˈstjuː.di.əʊ","uk_link":"../audio/s/ukstubb013.mp3","content":"studio noun [C]\n(RECORDING ROOM)\nAdd to word list\nAdd to word list\nB1 a room with special equipment where television or radio programmes or music recordings are made: She spent three months in the studio working on her latest album. a studio audience (= people who watch a programme while it is being made in the studio)\nB1 a building or place where films are made, or a company that makes them: Ealing Studios made some famous British comedies in the 40s and 50s.\na room or building where dancing is taught or practised: a dance studio\nMore examplesFewer examplesa soundproof studioLater in this bulletin we will be going over to our Westminster studio for an update on the situation.Andy shuts himself away in his studio for hours on end when he's recording a song.Most of the scenes were filmed in a studio.The studio is using all sorts of marketing tricks to squeeze as much profit from the movie as they can.\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nremix\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\nParts of buildings: rooms\nDance & choreography\nstudio noun [C]\n(ARTIST'S ROOM)\nB2 a room in which an artist works, especially a painter or photographer\na company making artistic or photographic products: The firm grew to be one of Europe's foremost graphics studios.\nSMART Vocabulary: related words and phrases\nParts of buildings: rooms\nantechamber\nanteroom\natelier\nattic\nballroom\ndressing room\nefficiency room\nen suite\neyrie\nfamily room\nmaster bedroom\nmeat locker\nmulti-chambered\nmulti-room\nobservation lounge\ntwin-bedded\nutility room\nvestibule\nwaiting room\nwet room\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nstudio noun [C]\n(HOME)\n(also studio apartment); (UK also studio flat) a small apartment designed to be lived in by one or two people, usually with one large room for sleeping and living in, a bathroom and sometimes a separate kitchen\nSMART Vocabulary: related words and phrases\nHouses & homes\nA-frame\nADU\naffordable housing\nalmshouse\napartment\ndorm\ndormitory\ndosshouse\nduplex\nefficiency\nmulti-unit\nmultifamily\nNissen hut\nnon-housing\nold people's home\ntollhouse\ntower block\ntown house\ntownhouse\ntract house\nSee more results »\nstudio noun [C]\n(ROOM)\nAdd to word list\nAdd to word list\na room where an artist paints or a musician practices: an artist’s studio\nstudio noun [C]\n(RECORDING PLACE)\na specially equipped place where television or radio programs are made or music is recorded\nstudio noun [C]\n(MOVIE PRODUCTION)\na place where movies are produced, or a company that produces movies: Most of the big studios are in Hollywood.\nAdd to word list\nAdd to word list\na room with special equipment where television or radio programmes or music recordings are made: television/radio/recording studio I work in a television studio in Boston. They filmed the interview in front of a studio audience.\na building or place where films are made for the cinema, or a company that makes films: A major studio is said to have bought the film rights to her book. a film/movie/Hollywood studio"}