{"id":347092,"name":"study","type":"verb","us_sound":"ˈstʌd.i","us_link":"../audio/s/study.mp3","uk_sound":"ˈstʌd.i","uk_link":"../audio/s/ukstubb018.mp3","content":"study verb\n(LEARN)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to learn about a subject, especially in an educational course or by reading books: to study biology/chemistry Next term we will study plants and how they grow.study for She's been studying for her doctorate for three years already.\nThesaurus: synonyms, antonyms, and examples\nto learn somethinglearnI'm learning how to play the piano.studyI'm studying Italian right now.masterShe lived in Italy for several years but never quite mastered the language.pick upWhen you live in a country, you soon pick up the language.familiarize yourself withHe prepared for the interview by familiarizing himself with the company's work.get the hang of something\"I've never used this software before.\" \"Don't worry, you'll soon get the hang of it.\"\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto study somethingstudyWhat do you plan on studying at university?majorUS She majored in philosophy at Harvard.cramShe's cramming for her history exam.reviseUK I'm revising for tomorrow's test.reviewUS We're going to review for the test tomorrow night. researchScientists are researching possible new treatments for cancer.\nSee more results »\nMore examplesFewer examplesShe couldn't study with the children chasing around the house.One of the main reasons I came to England was to study the language.You'll need peace and quiet to study.Richard studied engineering at Manchester University.I studied music at college.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nstudy verb\n(EXAMINE)\nB2 [ T ] to examine something very carefully: I want time to study this contract thoroughly before signing it. [ + question word ] Researchers have been studying how people under stress make decisions. Synonyms\ncheck (EXAMINE)\ncheck something out (EXAMINE) informal\nexamine (LOOK AT CAREFULLY)\ninspect\nperuse formal\nscan (LOOK)\nsurvey (LOOK AT) formal\nMore examplesFewer examplesYou can take the documents home and study them at your leisure.The committee studied the minutiae of the report for hours.She studied the document.She studied the pale skin of his face in the dim lamplight.I've been studying village records in the local archive.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nPhrasal verb\nstudy under someone\nstudy noun\n(EXAMINING)\nB2 [ C ] the activity of examining a subject in detail in order to discover new information: a five-year study of the relationship between wildlife and farming Some studies have suggested a link between certain types of artificial sweetener and cancer.\n[ C ] a drawing that an artist makes in order to test ideas before starting a painting of the same subject\nSMART Vocabulary: related words and phrases\nJudgments and analyses\nanalysis\nanatomy\nappraisal\nappraisee\nassessment\ncognizable\nconstruction\nforensics\nimpact assessment\nimpact statement\ninterpretation\njob evaluation\nprognosticate\nprognostication\nrap\nrating\nre-evaluation\nre-review\nvalue judgment\nverdict\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nstudy noun\n(LEARNING)\nB2 [ U ] the act of learning about a subject, usually at school or university: the study of English literature studies A2 [ plural ]\nstudying or work involving studying: Adam doesn't spend enough time on his studies.\nused in the names of some educational subjects and courses: business/media studies Michaela is doing a degree in business/media studies.\nSee more\nB1 [ C ] a room, especially in a house, used for quiet work such as reading or writing\nMore examplesFewer examplesthe study of molecular biologyAfter years of study, Tim is now a fully-fledged architect.The room is dedicated to study.If we clear out the spare room, you can use it as a study.Our spare bedroom doubles up as a study for Dan when he's working at home.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nParts of buildings: rooms\nIdiom\na quick study\nstudy verb\n(LEARN)\nAdd to word list\nAdd to word list\n[ I/T ] to learn a particular subject or subjects, esp. in a school or college or by reading books: [ T ] Next semester we’ll be studying biology. [ I ] I’ve got to study tonight.\nstudy verb\n(EXAMINE)\n[ T ] to look at something carefully to learn about it: She studied the embroidery to see how it was done.\nstudy noun\n(LEARNING)\n[ C/U ] the activity of studying: [ U ] He began the study of violin when he was only three.\n[ C/U ] A study is a room used for reading and writing in a person’s home.\nstudy noun\n(EXAMINING)\n[ C ] a report that examines a subject in detail in order to discover new information: Studies show that exercise is important to health.\nAdd to word list\nAdd to word list\n[ I or T ] to learn about a subject, especially at a school or university or by reading books: study for sth He's studying for a master's degree at Yale University. She studied economics and politics. What do you plan to do when you finish studying?\n[ T ] to examine something very carefully: The group of economists studied the regional market. A committee will study the links between the two industries.\n[ C ] a detailed examination of a subject in order to discover new information: The study calls for about $86.7 million in emergency repairs.a study of/on sth She published a study on strategic financial management.carry out/conduct/undertake a study AON consulting conducted a study to identify causes of absenteeism. A recent study of 300 executives found that many wanted more high-tech training. a major/large/national study an independent/in-depth study\n[ U ] the activity of making a detailed examination of a subject: The recommendations are based on the detailed study of banking profitability. He called for more study of the oceans' role in climate change.\n[ U ] the activity of learning about a subject, usually at school or university: She switched from Economics to the study of human behaviour.\nstudies [ plural ]\nthe work someone does that involves studying: pursue/neglect/continue your studies He left full-time employment to continue his studies at university.\nused in the names of some educational subjects and courses: Business Studies management/environmental/women's studies\nSee also\ncase study\nfeasibility study\nmarket survey\nmethod study\ntime and motion study\ntracking study\nwork-study"}