{"id":347114,"name":"stuff","type":"noun","us_sound":"stʌf","us_link":"../audio/s/stuff.mp3","uk_sound":"stʌf","uk_link":"../audio/s/ukstubb019.mp3","content":"stuff noun\n(THING(S))\nAdd to word list\nAdd to word list\nB1 [ U ] informal a substance, especially when you do not know or say exactly what it is: There's sticky stuff all over the chair. What's this black stuff? He drinks gallons of tea - he loves the stuff.\n[ U ] informal things that someone says or does, when you are referring to them in a general way without saying exactly what they are: All that stuff she has been saying about Lee is just not true. We did some really interesting stuff today. I have to go now - I've got stuff to do. I've read all her books - I really like her stuff.\n[ U ] informal someone's possessions or things that they take somewhere with them: We'll have to carry all our camping stuff. Do you want help bringing your stuff in from the van? We can't move to a smaller place - we've got too much stuff. and stuff\nused to refer to more things of a similar kind to ones you have mentioned, when you do not say exactly what they are: This is the drawer where I keep paper and envelopes and stuff. The classrooms all have computers and interactive whiteboards and stuff. I was embarrassed because he wanted to talk about love and stuff.\nMore examplesFewer examplesThe kids always clutter the hall up with school bags and coats and stuff.I love milk - I drink gallons of the stuff.I've got some stuff to do at home, so I'm going to take off now.I like modern art to a certain extent, but I don't like the really experimental stuff.He leaves all the difficult stuff for me to do and it really annoys me.\nSMART Vocabulary: related words and phrases\nGroups and collections of things\nage bracket\nagglomerate\nagglomeration\nAladdin's cave\nanthology\nbasket\ncrop\ndataset\nempty set\nensemble\nfamily\nfeast\npackage\npermutation\npool\nportfolio\nselection\nsheaf\nsheaves\nstarter pack\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral\nBelongings and possessions\nSimilar and the same\nstuff noun\n(QUALITY)\n[ U ] US someone's skill or great abilities: Avery had great stuff, total command of all three of his pitches. An interview is a chance to show your stuff.\nSMART Vocabulary: related words and phrases\nBaseball & rounders\naround the horn idiom\nbag\nball\nballgame\nballplayer\nbase hit\nbases\nbeat\nbottom\nchopper\nflare\nfoul\nglove\nhomer\nsafe\nsecond base\nshag\nshortstop\nslider\nthe World Series\nSee more results »\nGrammar\nThing and stuffWe use the general noun thing more commonly in speaking than in writing. …\nThingWe use the general noun thing more commonly in speaking than in writing. …\nStuffStuff is one of the most common nouns in speaking. It is more informal than thing. It is not at all common in writing. …\nIdioms\ndo your stuff\ngood/great/lovely stuff!\nstuff and nonsense\nthe stuff of something\nstuff verb\n(FILL)\n[ T ] to completely fill a container with something: Stuff the pillow and then sew up the final seam. Under her bed, they found a bag stuffed with money.\nC2 [ T ] informal to push something into a small space, often quickly or in a careless way: This suitcase is absolutely full - I can't stuff another thing into it.\n[ T ] to fill the body of a dead animal with special material so that it looks as if it is still alive\n[ T ] mainly UK offensive (of a man) to have sex with a woman\nMore examplesFewer examplesI stuffed it into my bag and quickly left.I just stuffed everything in boxes.He pulled out a big fat wallet stuffed with bank notes.Every bit of the house was stuffed with souvenirs of their trips abroad.He stuffs all his magazines and books under the bed.\nSMART Vocabulary: related words and phrases\nFilling and completing\nbackfill\nbow\nbox ticking\nbrick\nbrick something up\nbrim\nfill\njam\novercrowd\noverrun\npack something/somewhere out\npermeate\npermeation\nplug\nsaturable\nsqueeze (someone/something) in/squeeze (someone/something) into something\nstuffing\nsuffuse\nsupersaturated\ntank\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlacing and positioning an object\nBurying, cremating and preserving bodies\nstuff verb\n(FOOD)\n[ T ] to fill food with stuffing: Stuff the turkey, then put it into a pre-heated oven.\nSMART Vocabulary: related words and phrases\nPreparing food\nbatch cooking\nbiga\nboil\nbutter\nbuttered\ncan't boil an egg idiom\nclarify\nglaze\nglazed\ngrate\ningredient\njerk\nre-season\nrecipe\nrehydrate\nrestuff\nrice\ntailgate\ntoss\nzap\nSee more results »\nstuff verb\n(EAT)\nstuff yourself informal\nto eat a lot: They'd been stuffing themselves with snacks all afternoon, so they didn't want any dinner.\nThesaurus: synonyms, antonyms, and examples\nto eat foodeatWhat do you want to eat for lunch?haveI'll just have one more piece of chocolate cake.consumeHe consumes vast quantities of bread with every meal.devourThe children devoured a whole packet of biscuits.bolt (down)Don't bolt down your food - you'll make yourself ill!gobble (up/down)The children gobbled their sweets.\nSee more results »\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\nIdioms\nget stuffed!\nstuff it, them, you, etc.\nstuff your face\nstuff noun [U]\n(SUBSTANCE)\nAdd to word list\nAdd to word list\na substance or material: What’s the black stuff on the rug? This stuff tastes good.\nstuff noun [U]\n(THINGS)\na group of different things, activities, or matters: We helped him move his stuff to the new apartment. I’ve got a lot of stuff to do this weekend. They’d heard all this stuff before.\nstuff verb [T]\n(FILL)\nto fill the inside of something: I can’t stuff another thing into this suitcase.\nTo stuff a turkey, or other meat or vegetable, is to fill it with other food before cooking it.\nIf you stuff yourself, you eat a large amount of food: The kids stuffed themselves with snacks."}