{"id":347161,"name":"stumbling","type":"adjective","us_sound":"ˈstʌm.bəl.ɪŋ","us_link":"../audio/s/cdo0623usstum3871.mp3","uk_sound":"ˈstʌm.bəl.ɪŋ","uk_link":"../audio/s/cdo0623ukstum3897.mp3","content":"stumbling adjective\n(WALKING)\nAdd to word list\nAdd to word list\nwalking in a way that is awkward or not controlled: A stumbling figure weaved its way through the shadows. He walked with an awkward, stumbling gait.\nMore examplesFewer examplesAn unexpectedly large stone tripped her progress, bringing her to a stumbling halt. They both broke into a stumbling run.He took one stumbling step forward, struggling to keep his balance.\nSMART Vocabulary: related words and phrases\nMoving unsteadily or with difficulty\nblunder\nbumble\ndodder\ndodderer\ndoddery\nfavour\nhobble\ninflexibly\nlimp\nlollop\nlumber\nlumpily\nreel\nsqueeze\nteeter\ntoddle\ntoil\ntotter\ntottering\ntumble\nSee more results »\nstumbling adjective\n(WITH DIFFICULTY)\ninvolving mistakes when speaking, such as repeating something or pausing for too long: They appear foolish as they offer stumbling, inarticulate responses. Their conversation is inevitably stumbling, and more of an effort.\ndone with difficulty, or involving repeated problems or mistakes: A stumbling economy means fewer jobs. I made my first stumbling attempts to start writing poetry.\nMore examplesFewer examplesHer words came out in a stumbling, heavy voice.He gathered himself and launched into a stumbling explanation. The campaign got off to a stumbling start.The team never recovered from their stumbling opening match.\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\nfluent\nintone\nnon-verbal\nnon-verbally\northoepy\nparalanguage\nplummy\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaking mistakes\nExperiencing difficulties\nRelated words\nstumble\nstumblingly"}