{"id":347246,"name":"stupid","type":"adjective","us_sound":"ˈstuː.pɪd","us_link":"../audio/s/stupid.mp3","uk_sound":"ˈstjuː.pɪd","uk_link":"../audio/s/ukstun_014.mp3","content":"Add to word list\nAdd to word list\nB1 silly or unwise; showing poor judgment or little intelligence: She was really stupid to quit her job like that. Whose stupid idea was it to travel at night? He now thinks that retiring early was a stupid thing to do. How could you be so stupid?\nThesaurus: synonyms, antonyms, and examples\nstupidstupidSome people are too stupid to realize what's bad for them.foolishShe was really foolish to quit her job like that.sillyIt was silly of you to go out in the sun without a hat.crazyYou'd be absolutely crazy to marry that man.dumbUS She was terrified of asking dumb questions.\nSee more results »\ninformal annoying, or causing a problem: Have your stupid book back if it's so important to you. I hate doing this stupid exercise, I just can't get it right.\nMore examplesFewer examplesThat was a really stupid thing to do.How could he be so stupid?I'm sorry! That was a stupid thing to say - I don't know what came over me.Don't be so stupid.She told me it was brand new and I was stupid enough to believe her.\nSMART Vocabulary: related words and phrases\nStupid and silly\nabsurd\nabsurdity\nabsurdly\nadolescent\nagainst your better judgment idiom\ndopily\ndorky\ndottiness\ndotty\ndozily\nin his/her/their wisdom idiom\nin someone's infinite wisdom idiom\ninadvisable\ninjudicious\ninjudiciously\nundiscriminating\nunintelligent\nunreasonable\nunreasonably\nunsmart\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnoying\nRelated word\nstupidly\nused when talking to someone who does something stupid, to refer to them: Don't lock it, stupid! Not that one, stupid.\nSMART Vocabulary: related words and phrases\nStupid and silly people\nairhead\nberk\nbirdbrain\nblithering idiot\nblockhead\ndullard\ndumb-ass\ndummy\ndunce\ndunderhead\nmuppet\nmutt\nneed\nneed your head examined idiom\nnimrod\nsimpleton\nthicko\ntosser\ntroglodyte\nturkey\nSee more results »\nAdd to word list\nAdd to word list\nlacking thought or intelligence: I just made another stupid mistake.\ninfml You might say something is stupid because it annoys you: Turn off that stupid program! stupidity noun [ U ] us\nYour browser doesn't support HTML5 audio\n/stuˈpɪd·ɪ·t̬i/\nCan you believe my stupidity? I locked my keys in the car!"}