{"id":347312,"name":"stuttering","type":"adjective","us_sound":"ˈstʌt̬.ɚ.ɪŋ","us_link":"../audio/s/ussturg003.mp3","uk_sound":"ˈstʌt.ər.ɪŋ","uk_link":"../audio/s/ukstun_024.mp3","content":"stuttering adjective\n(NOT REGULAR)\nAdd to word list\nAdd to word list\nhappening in a way that is not regular, for example by being sometimes good and sometimes bad, or sometimes moving or changing and sometimes not : Stuttering (= sometimes good and sometimes bad) productivity figures over the last two years have made the industry unattractive to investors.\nMore examplesFewer examplesThe stuttering start underscored the shambolic state of hockey as the lockout took effect. The beats are stuttering and recalcitrant instead of hard and throbbing.The unidentified official who leaked the papers reportedly decided to go public with the information out of impatience with the stuttering pace of political reform here.He walked with a stuttering lurch. It is a confident, if slightly stuttering start.\nSMART Vocabulary: related words and phrases\nChanging frequently\ncapricious\ncapriciously\ncapriciousness\nchangeable\nchangeful\ninconsistency\ninconsistent\ninconsistently\ninconstant\ninconstantly\ninflammable\npatchiness\npatchy\nping-pong\nprotean\nraggedly\nvariability\nvolatility\nyo-yoing\nzigzag\nSee more results »\nstuttering adjective\n(SPEAKING)\n: saying something, especially the first part of a word, with difficulty, for example pausing before it or repeating it several times: Jason's stuttering voice sounded louder than he liked, and he generally refrained from speaking in class. See\nstutter\nMore examplesFewer examples a kind of slightly stuttering man, usually more ready to listen than speak\"S…sorry…sorry pet.” The stuttering voice and gentleness of the hands made him relax.\nSMART Vocabulary: related words and phrases\nSpeech impediments\ndisfluency\ndisfluent\nlisp\nnon-verbal\nspeech and language therapist\nspeech and language therapy\nspeech impediment\nstammer\nstammerer\nstammeringly\nstutter\nstutterer\nstutteringly\nthe act of saying something, especially the first part of a word, with difficulty, for example pausing or repeating a sound several times: During the 1970s and 1980s, rival theories about what causes stuttering came into vogue. See\nstutter\nMore examplesFewer examplesTrue stuttering will most likely be accompanied by frustration, anxious mannerisms, or embarrassment. He eventually overcame his stuttering and turned up his voice's volume to a legendary level.Researchers have embarked on a mission to identify possible genetic causes of stuttering.How stuttering should be treated is the point at which speech experts stop agreeing.I get worried about with my stuttering.\nSMART Vocabulary: related words and phrases\nSpeech impediments\ndisfluency\ndisfluent\nlisp\nnon-verbal\nspeech and language therapist\nspeech and language therapy\nspeech impediment\nstammer\nstammerer\nstammeringly\nstutter\nstutterer\nstutteringly"}