{"id":348629,"name":"subjunctive","type":"noun","us_sound":"səbˈdʒʌŋk.tɪv","us_link":"../audio/s/eus75952.mp3","uk_sound":"səbˈdʒʌŋk.tɪv","uk_link":"../audio/s/uksubhe012.mp3","content":"Add to word list\nAdd to word list\nin some languages, a verb form that refers to actions that are possibilities rather than facts: In the sentence \"I wish I were rich\", the verb \"were\" is in the subjunctive. In the edited version, virtually all subjunctives were replaced by indicatives. Compare\nindicative\nMore examplesFewer examplesHe used the difficult Italian subjunctive perfectly.Can you explain the use of the subjunctive here?She enjoyed the conversation because it was in French, and she was able to use her subjunctives and conditionals.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\ngerund\ninfinitive\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nin or relating to the verb form in some languages that refers to actions that are possibilities rather than facts: Learning when to use the subjunctive mood can be difficult. Studies identify early instances of correct usage of the subjunctive form. Compare\nindicative\nMore examplesFewer examplesThe teacher asked for an example of a subjunctive relative clause.They clearly had knowledge of subjunctive form, but not of its use with relative clauses.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\ngerund\ninfinitive\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nprogressive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nAdd to word list\nAdd to word list\ngrammar the mood (= form) of a verb used to refer to actions that are possibilities rather than facts: In the sentence \"I wish I were rich,\" the verb \"were\" is in the subjunctive."}