{"id":348568,"name":"subject","type":"noun","us_sound":"ˈsʌb.dʒekt","us_link":"../audio/s/subject.mp3","uk_sound":"ˈsʌb.dʒekt","uk_link":"../audio/s/uksubhe003.mp3","content":"subject noun [C]\n(AREA OF DISCUSSION)\nAdd to word list\nAdd to word list\nB1 the thing that is being discussed, considered, or studied: Our subject for discussion is homelessness.on the subject of She has made a series of documentaries on the subject of family relationships.take something as your subject The guest lecturer took as her subject (= decided to speak about) \"punishment and imprisonment in modern society\".the subject of The number of planes flying over the town has been the subject of (= has caused) concern since last summer.\nMore examplesFewer examplesBooks on every conceivable subject lined one wall.Several experts are to give evidence on the subject.The school offers courses in every subject imaginable.She's got some very interesting things to say on the subject.Food, like sex, is a subject of almost universal interest.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nsubject noun [C]\n(AREA OF STUDY)\nA1 an area of knowledge that is studied in school, college, or university: My favourite subjects at school were history and English.mainly UK Her subject (= special area of study) is low-temperature physics. change the subject\nB2 to start talking about a different subject: I'd tried to explain the situation, but he just changed the subject.\nSee more\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\n-ological\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfunctional skills\nfuturology\nGermanist\nglaciology\nhard science\nology\nontology\noology\norientalist\nsports scientist\nstem\nsubscience\nsuicidology\ntechnical\nSee more results »\nsubject noun [C]\n(STORY/PAINTING)\nC2 a person, thing, or situation that is written about in a book, article, etc. or shown in a picture, etc.: The mill by the bridge was the subject of an unfinished painting by J. M. W. Turner.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\ntalk\ntalking point\ntheme\nthemed\ntopically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPainting, drawing & printing\nLiterature\nsubject noun [C]\n(GRAMMAR)\nB1 language\n&#160; specialized the person or thing that performs the action of a verb, or is joined to a description by a verb: \"Bob\" is the subject of the sentence \"Bob threw the ball.\" Compare\nobject noun (GRAMMAR) specialized\nMore examplesFewer examples'Clare' is the subject of the sentence 'Clare drank all the milk'.'He' is the subject of the sentence 'He lost his job'.\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nsubject noun [C]\n(PERSON)\na person who lives in or who has the right to live in a particular country, especially a country with a king or queen: He is a British subject. Compare\ncitizen\nSMART Vocabulary: related words and phrases\nCountries, nationalities & continents: country & nation\nbirthright citizenship\nbody politic\nBRICS\ncitizen\ncompatriot\ndenaturalize\ndomestic\ndomestically\ndual\nfatherland\ninternationalism\nnative\nnaturalization\nnon-country\nnon-domestic\nnon-indigenous\nnon-national\noverseas\nstatehood\nstateless\nSee more results »\nGrammar\nDummy subjectsEnglish clauses which are not imperatives must have a subject. Sometimes we need to use a ‘dummy’ or ‘empty’ or ‘artificial’ subject when there is no subject attached to the verb, and where the real subject is somewhere else in the clause. It and there are the two dummy subjects used in English: …\nIt as a dummy subjectWe often use it as a dummy subject with adjectives and their complements: …\nThere as a dummy subjectThere operates as a dummy subject in the construction there is or there are. There is/are indicates that something or someone exists or is in a particular place or situation: …\nSubjectsA subject is one of the five major elements of clause structure. The other four are: verb, object, complement and adjunct. Subjects are essential in declarative, negative and interrogative clauses. …\nSubject positionIn statements (declarative clauses), the subject comes before the verb: …\nDummy subjectsThe subject is an essential part of a clause. Sometimes we need to use a ‘dummy’ subject where there is no other subject to put in the subject position. We use it or there as subjects: …\nNo subjectIn very informal speaking we can leave out the pronoun in declarative clauses (statements), particularly I with verbs like hope and know: …\nSubjects: typical errorsWe don’t omit the subject in declarative and interrogative clauses: …\nSubject–verb agreementThe person and number of the subject of the clause determine the person and number of the verb of the clause. This is called subject–verb agreement or concord: …\nSubject complementsA subject complement gives us more information about the subject. It usually comes after linking verbs and sense verbs (including be, seem, smell, taste), and after change of state verbs (including go, get, become). …\nSubject complements: parts of speechSubject complements can be adjective phrases, noun phrases, adverb phrases or prepositional phrases: …\nPronouns as subject complementsWhen we use a pronoun as a subject complement after be, we usually use an object pronoun (e.g. me, him, us): …\nto defeat people or a country and then control them against their wishes and limit their freedom: The invaders quickly subjected the local tribes.\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernment-sponsored\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\noppress\noppression\noppressively\noppressiveness\novergovern\nstatesmanship\nsubjection\nsubjugate\nsubjugation\nsuper-government\nSee more results »\nPhrasal verb\nsubject someone/something to something\nsubject adjective\n(HAVING)\nbe subject to something\nC1 to have or experience a particular thing, especially something unpleasant: Cars are subject to a high domestic tax.\nSee more\nsubject adjective\n(DEPEND)\nsubject to something\nC2 only able to happen if something else happens: We plan to go on Wednesday, subject to your approval.\nSee more\nsubject adjective\n(GOVERN)\n[ before noun ] under the political control of another country or state: subject peoples/states\nSMART Vocabulary: related words and phrases\nRuling & governing\nadministration\naffairs of state\nascend\nascend the throne idiom\nbipartisanship\ngovernment-sponsored\ngovernmental\ngovernmentally\ngovernorate\nhard Brexit idiom\noppress\noppression\noppressively\noppressiveness\novergovern\nstatesmanship\nsubjection\nsubjugate\nsubjugation\nsuper-government\nSee more results »\nsubject noun [C]\n(AREA OF DISCUSSION)\nAdd to word list\nAdd to word list\nsomething that is being discussed or considered: School officials broached the subject of extending the school year. It seemed like a good idea to change the subject.\nsubject noun [C]\n(SCHOOL COURSE)\nan area of knowledge that is studied in school or college: My favorite subjects are history and geography.\nsubject noun [C]\n(PERSON)\na person who lives or who has the right to live in a particular country, esp. a country with a king or queen: a British subject\nsubject noun [C]\n(GRAMMAR)\ngrammar the person or thing that performs the action of a verb, or which is joined to a description by a verb: \"Bob\" is the subject of the sentence, \"Bob threw the ball.\"\nsubject to sth\nAdd to word list\nAdd to word list\nlikely to have or experience a particular thing, especially something unpleasant: be subject to a charge/fee/tariff You may be subject to additional bank charges for currency conversion. The company could be subject to a hostile takeover. Income from investment of the capital will be subject to tax.\ndepending on the stated thing happening: The $1.14 billion project is subject to approval by the board. Outline planning permission has been granted, subject to a public inquiry, for a new 10,000-seat stadium on the land. Tax laws are subject to change. The notice period for clients to leave the agency are subject to contract.\nunder the political control or authority of something: The casinos are located on tribal lands not subject to state or local laws.\nsubject to average\nINSURANCE used about an insurance agreement when the amount of insurance on a property is less than the real value of the property, so the amount paid out by the company will be reduced: You must adequately insure yourself otherwise you may find yourself subject to average."}