{"id":348675,"name":"sublet","type":"verb","us_sound":"ˌsʌbˈlet","us_link":"../audio/s/sublet.mp3","uk_sound":"ˌsʌbˈlet","uk_link":"../audio/s/uksubhe013.mp3","content":"Add to word list\nAdd to word list\nto allow someone to rent all or part of a house or other building that you are renting from someone else: Our rental contract states that we are not allowed to sublet the house. The tenant cannot sublet without the owner's permission and cannot charge more than the regulated rent. We have to inform the housing association if we sub-let a room.\nMore examplesFewer examplesFamilies often sublet a room to help pay the rent.The party may move to cheaper offices and sublet its spacious headquarters.If you can't afford the rent on your flat, why don't you sub-let part of it?\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nfreehold\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nrent strike\nrental\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\na room or other part of a building, or all of a building, that is being rented by someone and that they in turn rent to another person: It was a working-class district of immigrants, many of them living in illegal sublets. We have a house, a sub-let for the summer, up in the Berkeley hills.\nMore examplesFewer examplesHe used the internet to find a sublet where his dog would be welcome.He once lived on the Upper West Side in an illegal sublet before moving to Brooklyn.She is based in Los Angeles but lives in sub-lets and carts her possessions around in boxes.\nSMART Vocabulary: related words and phrases\nRenting property\nabsentee landlord\nBTL\nco-tenant\nfiefdom\nflatshare\nfreehold\nkey money\nlease\nleasehold\nlessee\nletting\nlodge\nrent strike\nrental\nrenter\nsitting tenant\nsubtenant\ntenancy\ntenanted\nuntenanted\nSee more results »\nAdd to word list\nAdd to word list\nto rent all or part of a rented apartment, house, or other building to someone else sublet noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈsʌb·let/\na summer sublet\nAdd to word list\nAdd to word list\nto allow someone to rent all or part of a building that you are renting from someone else: They have instructed us to sub-let 20,000 sq ft of offices.\nto rent all or part of a building from another person who rents it from the owner: We sublet the offices from the principal tenant. sublet noun [ C ] (also sublease)\nThe financial services company was renting a sublet in Chelsea. sublet adjective [ before noun ]\nsublet offices/space"}