{"id":348852,"name":"submission","type":"noun","us_sound":"səbˈmɪʃ.ən","us_link":"../audio/s/submission.mp3","uk_sound":"səbˈmɪʃ.ən","uk_link":"../audio/s/uksubhe027.mp3","content":"submission noun\n(GIVING)\nAdd to word list\nAdd to word list\n[ C or U ] the act of giving something for a decision to be made by others, or a document formally given in this way: No date has yet been set for the submission of applications. The final deadline for submissions is 21 February. [ + that ] formal The judge will hear the defence's submission (= suggestion) that the case be dismissed.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nsubmission noun\n(ACCEPTING)\n[ U ] the act of allowing someone or something to have power over you: They thought the country could be bombed into submission. The teachers agreed to a special meeting, in submission to parents' demands.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakling\nweakly\nweakness\nweedy\nwetly\nSee more results »\nsubmission noun\n(ACCEPTING AUTHORITY)\nAdd to word list\nAdd to word list\n[ U ] the act of accepting the power or authority of someone else : We raised our arms in submission.\nsubmission noun\n(GIVING SOMETHING)\n[ C/U ] the act of offering something for a decision to be made by others, or the thing that is offered : [ C ] The films were chosen from 350 submissions.\nAdd to word list\nAdd to word list\n[ U ] the act of formally sending a document, plan, etc. to a person or group in authority so that they can make a decision about it: submission to sb/sth The Audit Committee has reviewed the financial statements prior to submission to the Board for approval.submission of sth The treaty stipulates basic standards for electronic submission of patents.\n[ C ] a document, plan, etc. that is formally sent to a person or group in authority so that they can make a decision about it: The budget submission from the Trades Union Congress calls for the cash to be channelled to manufacturers via regional development agencies. The deadline for bid submissions is May 12th.\n[ C ]\n&#160; LAW a suggestion or request that is given to a judge who is asked to make a decision about it: The judge upheld that submission, and the respondents were found not guilty."}