{"id":348861,"name":"submit","type":"verb","us_sound":"səbˈmɪt","us_link":"../audio/s/submit.mp3","uk_sound":"səbˈmɪt","uk_link":"../audio/s/uksubmi001.mp3","content":"submit verb\n(GIVE)\nAdd to word list\nAdd to word list\nB2 [ T ] to give or offer something for a decision to be made by others: You must submit your application before 1 January. The developers submitted building plans to the council for approval.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\n[ T + that ] formal to suggest: In conclusion, I submit that the proposal will not work without some major changes.\nMore examplesFewer examplesPlease submit your claim for travelling expenses to the accounts department.Applicants interested in applying for the position should submit their CVs to the Anatomy Department no later than February 15.South Africa has submitted an application to host the World Cup.Invoices must be submitted by the 24th of every month.I submitted a report of the theft to the insurance company.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nsubmit verb\n(ALLOW)\nC2 [ I or T ] to allow another person or group to have power or authority over you, or to accept something unwillingly: We protested about the changes for a long time, but in the end we had to submit. She decided to resign from the party rather than submit herself to the new rules.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing reluctantly\nsubmit verb\n(OFFER FOR DECISION)\nAdd to word list\nAdd to word list\n[ T ] to give or offer something for a decision to be made by others: Companies are required to submit monthly financial statements to the board.\nsubmit verb\n(GIVE POWER)\n[ I/T ] to give power or authority over a person or group to someone, or to accept something unwillingly: [ T ] He had never been able to submit himself to that sort of discipline. [ I ] All newly hired employees must submit to a background check.\nAdd to word list\nAdd to word list\n[ T ] to formally send a document, plan, etc. to a person or group in authority so that they can make a decision about it: submit a bid/plan/proposal The consortium has yet to submit a bid.submit a letter/report/request They submitted the report after the retailer said that it might choose a replacement ad agency last year. Applications must be submitted by December 5.\n[ T ]\n&#160; LAW\n&#160; formal or to suggest or say something: In conclusion, I submit that the proposal will not work without some major changes.\nsubmit your resignation\nHR to tell your employer that you are leaving your job or position: He was given the choice on Wednesday to either submit his resignation, or be fired.\n[ I or T ] to allow another person or group to have authority or control over you, or to accept something unwillingly: They were required to agree that future industrial disputes would be submitted to arbitration."}