{"id":349005,"name":"subordinate","type":"adjective","us_sound":"səˈbɔːr.dən.ət","us_link":"../audio/s/subordinate.mp3","uk_sound":"səˈbɔː.dɪ.nət","uk_link":"../audio/s/uksubmi004.mp3","content":"Add to word list\nAdd to word list\nhaving a lower or less important position: a subordinate role subordinate status The individual's needs are subordinate to those of the group.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nhonorary\nopposite number\nrank\nreach\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOf little or less importance\nsubordinate noun [C]\n(PERSON)\na person who has a less important position than you in an organization: He left the routine checks to one of his subordinates.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nhonorary\nopposite number\nrank\nreach\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOf little or less importance\nsubordinate noun [C]\n(WORD)\nlanguage\n&#160; specialized a word whose meaning is included in the meaning of another word: \"Dog\" is a subordinate of the category \"pet\". Compare\nsuperordinate\nto put someone or something into a less important position: Her personal life has been subordinated to her career.\nSMART Vocabulary: related words and phrases\nPromoting staff\naggrandizement\nanointment\nascend\nascension\ncareer-limiting\nelevation\nexalt\nfast track\nfree transfer\nglass cliff\nhand off\npromote\npromotion\nreinstall\nreinstallation\nrelegate\nsecondment\nvault\nwilderness\nwilderness years idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOf little or less importance\nAdd to word list\nAdd to word list\nhaving a lower or less important position: I’m happy in a subordinate role. subordinate noun [ C ] us\nYour browser doesn't support HTML5 audio\n/səˈbɔr·dən·ət/\nYou need to assign this job to a subordinate.\nto treat someone or something as less important than something else: Japan has a tradition of subordinating individual desires to group goals. subordination noun [ U ] us/səˌbɔr·dənˈeɪ·ʃən/\nShe studies patterns of domination and subordination among orangutans.\nAdd to word list\nAdd to word list\nWORKPLACE having less power or a lower position than someone else in a company or an organization: subordinate to sb The condition of motherhood often makes women subordinate to men in the workplace.a subordinate employee/position/role Before reaching the level of head chef, there was the hard work and subordinate positions in kitchens. Women are in the minority in the office and are of subordinate status to most of their male colleagues.\nless important than something else: Primary legislation can be amended; subordinate legislation cannot.subordinate to sth The institute will make the acquired debt subordinate to any new bank lending.\n[ before noun ]\n&#160; FINANCE →\nsubordinated\nWORKPLACE a person who has a less important position than you in a company or an organization: Senior managers had to convince their colleagues and subordinates of the value of this approach.\nto put someone or something into a less important position: Management found itself subordinated to the markets."}