{"id":349147,"name":"subpoena","type":"verb","us_sound":"səˈpiː.nə","us_link":"../audio/s/subpoena.mp3","uk_sound":"səˈpiː.nə","uk_link":"../audio/s/uksubmi007.mp3","content":"Add to word list\nAdd to word list\nto order someone to go to a law court to answer questions: A friend of the victim was subpoenaed as a witness by lawyers representing the accused. [ + to infinitive ] They were subpoenaed to testify before the judge.\nto order that documents must be produced in a law court\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecution\nprosecutorial\nreindict\nreindictment\nretry\nsummons\nSee more results »\na legal document ordering someone to appear in a law court: Subpoenas were issued to several government employees.\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecution\nprosecutorial\nreindict\nreindictment\nretry\nsummons\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies to order someone to go to a court of law to answer questions, or to order the appearance of documents in a court of law: to subpoena a witness subpoena noun [ C ] us\nYour browser doesn't support HTML5 audio\n/səˈpi·nə/\nlaw The judge issued a subpoena.\nAdd to word list\nAdd to word list\nto order someone to go to a court of law to answer questions: The State Attorney has subpoenaed 10 companies that make and distribute calling cards in Florida.subpoena sb to do sth Several former employees of the company have been subpoenaed to testify before the grand jury.\nto order that documents must be produced in a court of law: subpoena documents/records Company records were subpoenaed in the investigation into malpractice.\na legal document ordering someone to appear in a court of law or to produce documents: issue/receive/serve a subpoenasubpoena for sth The company received subpoenas for documents and testimony about its marketing practices worldwide\nsubpoena power\nthe power of a court, committee, etc. to order someone to appear and give evidence or documents to be produced: give/grant/have subpoena power Federal mine safety officials have subpoena power similar to other federal agencies."}