{"id":349362,"name":"subscribe","type":"verb","us_sound":"səbˈskraɪb","us_link":"../audio/s/subscribe.mp3","uk_sound":"səbˈskraɪb","uk_link":"../audio/s/uksubmi008.mp3","content":"Add to word list\nAdd to word list\nto pay money to an organization in order to receive a product, use a service regularly, or support the organization: 2.3 million people subscribe to this online music service. She subscribes to several women's magazines. [ T ] UK I subscribe €10 a month to the charity.\nfinance &amp; economics\n&#160; specialized to offer to buy something or pay an amount for something as part of your business activities: Existing shareholders subscribed to only 49 percent of the new share issue.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nBuying\nPhrasal verb\nsubscribe to something\nAdd to word list\nAdd to word list\nto pay money to an organization in order to receive a product or use a service regularly: She subscribes to a couple of magazines. subscriber noun [ C ] us\nYour browser doesn't support HTML5 audio\n/səbˈskrɑɪ·bər/\ncable TV subscribers subscription noun [ C ] us\nYour browser doesn't support HTML5 audio\n/səbˈskrɪp·ʃən/\na magazine subscription Phrasal verb\nsubscribe to something\nAdd to word list\nAdd to word list\n[ I ]\n&#160; COMMERCE to pay to receive a newspaper or magazine regularly or to use a phone line or internet service: subscribe to sth 58% of television owning households subscribe to a cable TV network.subscribe to an internet service provider/a magazine/a newspaper Every time we subscribe to a magazine, we unleash bits of personal information in return for convenience. To listen to the show or subscribe to our podcast, visit our website. Compare\nunsubscribe\n[ I ]\n&#160; STOCK MARKET to formally ask to buy particular shares when they are issued : subscribe for sth Since you have to subscribe for a minimum of 200 shares, you will have to pay £380.subscribe to sth Investors can subscribe to shares in the public offer until 13 November.\n[ I or T ] to pay money regularly to an organization in order to support its work: subscribe (sth) to sth The company subscribes €1000 a month to the charity."}