{"id":349635,"name":"substitution","type":"noun","us_sound":"ˌsʌb.stəˈtuː.ʃən","us_link":"../audio/s/substitution.mp3","uk_sound":"ˌsʌb.stɪˈtʃuː.ʃən","uk_link":"../audio/s/uksubsp011.mp3","content":"Add to word list\nAdd to word list\nC1 the use of one person or thing instead of another: It looks as though the coach is going to make a substitution (= change one player for another in the game).\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitutive\nsucceed\nsuccession\nsupersede\nSee more results »\nGrammar\nSubstitutionIn speaking and in writing, we try to avoid repeating words, phrases or clauses. We use substitute forms to do this: …\nSubstitution: purposeIn speaking and in writing, we try to avoid repeating words, phrases or clauses. We use substitute forms to do this: …\nSubstitution: what forms can we use?We can use many different words and phrases in substitution, including words such as both, either, some (indefinite quantifying pronouns), do and so, and expressions such as the same and thus. …\nSubstitution for nounsWe mostly use one and some/ones to substitute for countable nouns: …\nAdd to word list\nAdd to word list\nthe act of using someone or something instead of another person or thing, or the person or thing used: [ U ] Substitution of less costly materials for bricks will hurt brick-makers. [ C ] People who have difficulty digesting beans can make substitutions.\nAdd to word list\nAdd to word list\nthe act of using something new or different instead of something else, or the new thing that is used: the substitution of sth (for sth) The government plans to encourage the substitution of cheap generic drugs for expensive brand-name ones. Telecommuting is not a substitution for child care. See also\nproduct substitution"}