{"id":349630,"name":"substituted","type":"verb","us_sound":"ˈsʌb.stə.tuːt","us_link":"../audio/s/substitute.mp3","uk_sound":"ˈsʌb.stɪ.tʃuːt","uk_link":"../audio/s/uksubsp010.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nsubstitute\nsubstitute verb\n(USE INSTEAD)\nB2 [ T ] to use something or someone instead of another thing or person: You can substitute oil for butter (= use oil instead of butter) in this recipe. You can substitute the wheat flour with almond flour (= use almond flour instead of wheat flour). He made his film debut when he was substituted for the actor who was originally cast. I took out the words \"he\" and \"his\" and substituted them with \"they\" and \"their\". substitute for someone/something\nto perform the same job as another thing or person or to take their place: Gas-fired power stations will substitute for less efficient coal-fired equipment. The soprano first appeared on stage when she substituted for someone who was ill.\nMore examplesFewer examplesYou can always substitute tofu for meat, if you like.I use that recipe but substitute the cream with coconut milk.Is it possible for you to substitute someone else to do your work?Computers can't substitute for human interaction.Of course, no book or course of study can substitute for experience.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nsubstitute verb\n(IN SPORT)\n[ T usually passive ]\n&#160; sports\n&#160; specialized in sports, to use a player for part of a game after removing another player from the game: Ronaldo was substituted early in the second half. Dayton was substituted for Williams in the second half of the game. I don't know why the coach substituted me.\nMore examplesFewer examplesShe showed her anger at being substituted.The striker was substituted at half-time during the 1-1 draw.The manager had no alternative but to substitute him.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\ncompensation\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitors & participants in sports & games"}