{"id":349372,"name":"subscription","type":"noun","us_sound":"səbˈskrɪp.ʃən","us_link":"../audio/s/subscription.mp3","uk_sound":"səbˈskrɪp.ʃən","uk_link":"../audio/s/uksubmi010.mp3","content":"subscription noun\n(REGULAR PAYMENT)\nAdd to word list\nAdd to word list\n[ C ] an amount of money that you pay regularly to receive a product or service: I decided to take out (= pay for) a subscription to a gardening magazine. Your business can be listed on the website for a low monthly subscription.\nUK (informal sub) an amount of money that you pay regularly to be a member of an organization or club: We bought our niece an annual subscription to the tennis club.\n[ C ] (also subscription ticket) a season ticket (= a ticket that can be used many times within a limited period) for cultural events: His parents had a subscription to the local philharmonic orchestra.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTickets\nsubscription noun\n(SHARES)\n[ C or U ] an opportunity to buy shares in a company: You will soon have the opportunity to purchase stock through a subscription offering.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; STOCK MARKET, FINANCE an occasion when shares in a company are issued , or the number of shares involved: You will soon have the opportunity to purchase stock through a subscription offering. The subscription price was 287p. Rights issues require a minimum subscription period of 3 weeks.\n[ U ]\n&#160; STOCK MARKET, FINANCE the act of asking or agreeing to buy shares in a company: Preferential subscription rights are offered to existing shareholders.\n[ C or U ]\n&#160; COMMERCE, COMMUNICATIONS\n&#160; ( informal sub) an amount of money paid regularly to receive a newspaper or magazine, to use a phone line or internet service, or to be a member of an organization, or the act of paying this money: charge/pay a subscription cancel/renew a subscription I've taken out a subscription to the gym. a membership subscription subscription charges/fees/prices an online music subscription service An annual subscription to the magazine costs £32.50. These government publications are available on subscription.\n[ C ] (also subscription ticket) a season ticket for cultural events: a subscription concert Theatregoers who bought subscriptions did not receive refunds when the playhouse closed."}