{"id":349660,"name":"substratum","type":"noun","us_sound":"səbˈstræt̬.əm","us_link":"../audio/s/cdo0318ussubs4813.mp3","uk_sound":"səbˈstrɑː.təm","uk_link":"../audio/s/cdo0318uksubs1365.mp3","content":"substratum noun [C]\n(LOWER LAYER)\nAdd to word list\nAdd to word list\ngeology\n&#160; specialized a layer of rock, soil, or similar material that is below another layer: A substratum of clay kept moisture close to the topsoil. They planned to sink over twenty-five deep boreholes into the ground to assess the substrata.\na part or layer of something that is below another part or layer: Apply a substratum of lash powder and then quickly seal with a stroke of mascara. \"Underclass\" is used by sociologists to mean a substratum of society somewhere below the working class.\nMore examplesFewer examplesThe spade dug up three inches of black soil with a substratum of yellow mud and clay.The rich alluvial soils provide an ideal substratum for growing rice. The Valmiki community is a substratum of the Dalit caste.There's a whole substratum of administrative positions.\nSMART Vocabulary: related words and phrases\nCoverings and layers\na blanket of something idiom\nbeeswax wrap\nblanket\nbrazen\ncasing\ndiaphragm\ninterstratification\ninterstratify\nlagging\nlayer\nlayered\nseam\nsheath\nstrata\nstratum\nsuperstratum\ntar paper\ntarpaulin\nuncover\nvein\nSee more results »\nsubstratum noun [C]\n(BASIS)\nsomething important from which something else develops, but that is not immediately obvious: There is a broad substratum of truth in what she says. Would a jury conclude that a sufficient factual substratum existed for the comment?\nMore examplesFewer examplesMany of the ancient mythical tales have a substratum of historical fact.There was a substratum of good feeling in her.The novel has a solid substratum of well-conceived minor characters.\nSMART Vocabulary: related words and phrases\nBeing based on or depending on something\nas the case might be phrase\nbase something on something\nbases\nbasis\nboil down to something\nentail\nfooting\nfound\nfoundational\nground\nhinge\nrest with someone\nresult from something\nride\nride on something/someone\nrooted\nspring from something\nstrength\nunderstanding\nwake\nSee more results »"}