{"id":350091,"name":"succeed","type":"verb","us_sound":"səkˈsiːd","us_link":"../audio/s/succeed.mp3","uk_sound":"səkˈsiːd","uk_link":"../audio/s/uksubur010.mp3","content":"succeed verb\n(ACHIEVE SOMETHING)\nAdd to word list\nAdd to word list\nB1 [ I ] If you succeed, you achieve something that you have been aiming for, and if a plan or piece of work succeeds, it has the results that you wanted: She's been trying to pass her driving test for six years and she's finally succeeded. You need to be pretty tough to succeed in the property world. The campaign has certainly succeeded in raising public awareness of the issue.humorous Richard succeeded in offending (= managed unintentionally to offend) just about everybody in the room!\nThesaurus: synonyms, antonyms, and examples\nto achieve something aimed forsucceedIf you work hard, you'll succeed.thriveUniversity is a place where she will thrive.flourishHe tried journalism, but flourished as a novelist. triumphThe Labour Party triumphed in the election.bring something offShe's one of the few singers who can bring off such a difficult piece of music.\nSee more results »\nMore examplesFewer examplesHe has a desperate desire to succeed.She has the drive to succeed.There is no reason why we shouldn't succeed.Most couples would agree that for a marriage to succeed, both parties have to work at it.He is unlikely to succeed in getting his bill through Congress, however worthy it is.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngrade\nkill\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nsucceed verb\n(FOLLOW)\n[ I or T ] to take an official job or position after someone else: He succeeded his father as editor of the paper. When the Queen dies, her eldest son will succeed to the throne.\nto come after another person or thing in time: In the weeks that succeeded, five more patients showed similar symptoms. Almost from its beginnings, New York has produced succeeding generations of intellectuals.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsuccession\nsupersede\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOccurring and happening\nIdiom\nif at first you don't succeed, try, try again\nsucceed verb\n(ACHIEVE SOMETHING)\nAdd to word list\nAdd to word list\n[ I ] to achieve something that you have been aiming for, or (of a plan or piece of work) to have the desired results: She’s been trying to pass her driving test for years and she finally succeeded. He succeeded in building the business into one of the leaders in its field.\nsucceed verb\n(FOLLOW)\n[ T ] fml to take the place of another person or thing: [ T ] Kamen was named company chairman, succeeding Robert Schwartz, who is retiring after 44 years.\nAdd to word list\nAdd to word list\n[ I ] if you succeed, you achieve something that you have been trying to do or get, and if a plan or a piece of work succeeds, it has the results that you wanted: succeed in sth He is determined to succeed in the property market.succeed in doing sth The new exchange rate succeeded in bringing inflation down.\n[ T ] to take an official job or position after someone else: succeed sb as sth Karl Smith will succeed him as chief executive."}