{"id":350111,"name":"succession","type":"noun","us_sound":"səkˈseʃ.ən","us_link":"../audio/s/succession.mp3","uk_sound":"səkˈseʃ.ən","uk_link":"../audio/s/uksubur014.mp3","content":"Add to word list\nAdd to word list\n[ S ] a number of similar events or people that happen, exist, etc. after each other: succession of A succession of scandals and revelations has undermined the government over the past year. Life was just an endless succession of parties and dinners. in succession\nhappening one after another: in rapid succession She had her first three children in rapid succession.\nSee more\n[ U ] a process in which someone automatically takes an official position or job after someone else: succession to His divorce will not prevent the Prince of Wales's succession to the throne.line of succession Who comes after the vice-president in the presidential line of succession?\nSMART Vocabulary: related words and phrases\nOrder and sequence - general words\nalphabetize\naround\nback end\nbe a chapter of accidents idiom\ncatalogue\nchapter\ncycle\ninconsecutive\ninline\nlinearity\nlinearly\nlitany\nprecedence\npriority\nprocession\nsecondly\nsequence\nstring\ntrain\nwave\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReplacing and exchanging\nAdd to word list\nAdd to word list\na series of things coming one after another: [ C ] a succession of scandals [ U ] In rapid succession he lost his job, his wife, and his health. [ U ] fml At that time, the secretary of state followed the vice president in line of presidential succession (= the order of taking over a position of authority).\nAdd to word list\nAdd to word list\n[ S ] a number of similar people or events that exist or happen one after another: a succession of sth The company has been involved in a succession of accounting scandals. They employ their seasonal workers on a succession of fixed-term contracts.\n[ U ]\n&#160; HR, WORKPLACE the process by which someone takes an official position or job after someone else has been doing it: He was elected Chairman in succession to Brooke. a succession announcement/arrangement/issue\nin succession\nhappening one after another: Crops have failed for the third year in succession. The company lost two chief executives in quick succession.\nSee also\nmanagement succession"}