{"id":350106,"name":"success","type":"noun","us_sound":"səkˈses","us_link":"../audio/s/success.mp3","uk_sound":"səkˈses","uk_link":"../audio/s/uksubur011.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the achieving of the results wanted or hoped for: The success of almost any project depends largely on its manager. I've been trying to persuade her to take on more people, but so far without success. I'm not having much success in communicating with him at the moment. The success rate for this operation is very low.\nB1 [ C ] something that achieves positive results: Both films have been a big box-office success. She's determined to make a success of this project. That salmon dish was a success, wasn't it?\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that becomes popular, wealthy, or has achieved a lotsuccessThe new TV series was a wild success. a roaring successHer third album was a roaring success and went platinum.hitDinner was a hit with the kids.triumphThe court verdict was a triumph for all abuse victims.winWhat can we do to get a win out of this situation?\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nsomeone or something that is not successfulfailureThe shuttle launch was a complete failure.successThe operation was a success.turkeyI really wanted to like it, but that show ended up being a real turkey.clunkerUS That pitch was a real clunker. bombUS His website was one of the biggest dotcom bombs in the history of the internet.dudMy charger doesn't work - I think I've got a dud.\nSee more results »\nMore examplesFewer examplesHe tried, albeit without success.They hope to emulate the success of other software companies.The success of our campaign has exceeded our wildest expectations.The operation proved a complete success.The plan was a resounding success.\nSMART Vocabulary: related words and phrases\nSuccess and achievements\na feather in your cap idiom\na roaring success idiom\naccomplishment\nachievement\nachievement test\nascension\nascent\nbelt\nboom\nevery dog has its day idiom\nfeat\nfruition\nhave something under your belt idiom\nlaugh\nprospect\nquantum leap\nsecret sauce\nsellout\nsense of achievement\ntear\nSee more results »\nAdd to word list\nAdd to word list\nthe achieving of desired results, or someone or something that achieves positive results: [ U ] We’ve tried to contact him, but so far without success. [ C ] The dinner party was a great success.\nAdd to word list\nAdd to word list\n[ U ] the achieving of the results that were wanted or hoped for: The company's success is a result of its business model.success in sth Knowledge workers are essential for success in technology-driven industries. business/commercial/economic success Our salesmen have a 70% success rate.\n[ C ] something that achieves good results: The buyout has clearly been a success. She is determined to make a success of this project."}