{"id":350108,"name":"successful","type":"adjective","us_sound":"səkˈses.fəl","us_link":"../audio/s/successful.mp3","uk_sound":"səkˈses.fəl","uk_link":"../audio/s/uksubur012.mp3","content":"Add to word list\nAdd to word list\nB1 achieving the results wanted or hoped for: a successful operation My second attempt at making bread was a little more successful. This year's harvest was one of the most successful since the record crop of 1985. Opposite\nunsuccessful\nThesaurus: synonyms, antonyms, and examples\nachieving the results that are hoped forsuccessfulThe operation was successful, and the tumour was removed.effectiveThis cream is one of the most effective acne treatments you can find.efficaciousDetractors claim the new law won't be any more efficacious than current legislation is. productiveWe had a productive conversation, and he's back on track now.\nSee more results »\nB2 having achieved a lot, become popular, and/or made a lot of money: a successful career She runs a very successful computer business. He's the author of several hugely successful children's books (= books which have been bought by a lot of people). The Birmingham Royal Ballet has had a highly successful season. Opposite\nunsuccessful\nThesaurus: synonyms, antonyms, and examples\nachieving a lot, becoming popular, or making a lot of moneysuccessfulShe's one of the most successful athletes in the franchise's history.flourishingOur little town was a flourishing seaport in the 1600s.thrivingShe had a thriving career.triumphantIt was a triumphant victory for a struggling Manchester United. boomingBusiness is absolutely booming this month.\nSee more results »\nMore examplesFewer examplesYou have to be tough to be successful in politics.During a successful business career, she accumulated a great amount of wealth.Well, who'd have thought Joey was going to become so successful?He was a successful businessman before becoming a writer.Our soldiers carried out a successful attack last night.\nSMART Vocabulary: related words and phrases\nSuccessful (things or people)\na head of steam idiom\nachiever\nalive\nalpha male\narrive\nascendant\nballer\nhave something in your pocket idiom\nhave the world at your feet idiom\nhealthily\nheavy hitter idiom\nhigh-flyer\npocket\nrail\nrepresent\nstorming\nsuccessfully\nsuperachiever\nsuperhit\nsuperseller\nSee more results »\nRelated word\nsuccessfully\nAdd to word list\nAdd to word list\nachieving desired results, or achieving the result of making a lot of money: a successful architect/doctor/lawyer Fortunately, my second attempt at starting a business was more successful than my first. successfully adverb us\nYour browser doesn't support HTML5 audio\n/səkˈses·fə·li/\nA number of patients have been successfully treated with the new drug.\nAdd to word list\nAdd to word list\nachieving the results that were wanted and hoped for: successful in sth/doing sth The company was successful in its bid. The successful applicants must show their projects are economically viable.\nhaving achieved a lot, become popular, or made a lot of money: She runs a very successful computer business. a successful career/entrepreneur/product"}