{"id":350388,"name":"suffer","type":"verb","us_sound":"ˈsʌf.ɚ","us_link":"../audio/s/suffer.mp3","uk_sound":"ˈsʌf.ər","uk_link":"../audio/s/uksucro012.mp3","content":"suffer verb\n(FEEL PAIN)\nAdd to word list\nAdd to word list\nB1 [ I ] to experience physical or mental pain: I think he suffered a lot when his wife left him. She suffers in the winter when it's cold and her joints get stiff. She's been suffering from (= been ill with) cancer for two years. Johnny suffers from (= is often ill with) asthma. Do you suffer from (= do you have) any allergies? If you're not happy with it, you should complain. Don't just suffer in silence (= without saying anything).\nThesaurus: synonyms, antonyms, and examples\nto accept or continue in a situation that is difficult or unpleasantbearI will bear the responsibility for whatever happens.endureShe endured years of hip pain before seeing a surgeon.sufferShe suffers from severe asthma. acceptI have finally accepted that I can't change who he is.resign yourself toI have resigned myself to the fact that I'll never work again.become resigned toPeople have become resigned to the fact that increased security means much longer wait times at airports.\nSee more results »\nMore examplesFewer examplesIt's some comfort to know that he died instantly and didn't suffer.We cannot stand idly by while these people suffer.If he is suffering, he certainly shows no outward sign of it.She'd suffered terribly over the years but it hadn't made her bitter.It's terrible to see the children suffer.\nSMART Vocabulary: related words and phrases\nBeing & falling ill\nacquire\nbe a martyr to something idiom\nbe green around the gills idiom\nbe hanging idiom\nbe laid up idiom\nbreak\nbring\nKO\nmartyr\nnot a hundred percent idiom\npick\npick someone/something up\npredisposed\npresent\nrelapse\nserious\nshiver\nsicken\nstrike\nsuccumb\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nsuffer verb\n(EXPERIENCE)\nB2 [ I or T ] to experience or show the effects of something bad: The Democrats suffered a crushing defeat in the last election. 25 policemen suffered minor injuries during the riots. The city suffered another blow last month with the closure of the local car factory. If you go and eat three helpings of dessert, you'll just have to suffer the consequences! [ + obj + -ing verb ] I had to suffer her father moaning for half an hour on the phone last night! When you're working such long hours, it's inevitable that your marriage will start to suffer. Like a lot of his films, it suffers from being too long.\nMore examplesFewer examplesPregnant women often suffer from iron deficiency.No one should have to suffer such degrading treatment.Do you suffer from migraine?She was admitted to hospital suffering from shock.He has helped patients suffering from anxiety, depression, and eating disorders.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nIdiom\nnot suffer fools gladly\nsuffer verb\n(EXPERIENCE)\nAdd to word list\nAdd to word list\n[ I/T ] to experience or show the effects of something bad: [ T ] About 50,000 bicyclists suffer serious head injuries each year. [ T ] Block’s own farm has suffered large financial setbacks. [ I ] If you and your husband have jobs in different cities, your marriage is likely to suffer.\nsuffer verb\n(FEEL PAIN)\n[ I ] to experience physical or mental pain: She suffers in cold weather when her joints get stiff. He suffers from migraine headaches."}