{"id":350421,"name":"suffix","type":"noun","us_sound":"ˈsʌf.ɪks","us_link":"../audio/s/suffix.mp3","uk_sound":"ˈsʌf.ɪks","uk_link":"../audio/s/uksucro020.mp3","content":"Add to word list\nAdd to word list\nB2 a letter or group of letters added at the end of a word to make a new word: The suffix \"-ness\" added to the end of the word \"sweet\" forms the word \"sweetness\", changing an adjective into a noun. Compare\naffix\ninfix\nprefix\nMore examplesFewer examplesIn the word \"slowly\", 'ly' is a suffix.The suffix \"less\" changes a noun into an adjective, meaning \"without\".\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\ncontraction\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nGrammar\nSuffixesA suffix is a letter or group of letters added at the end of a word which makes a new word. …\nSuffixes: spellingOften, the suffix causes a spelling change to the original word. In the table above, the -e ending of complicate and create disappears when the -ion suffix is added. Other examples of spelling changes include: …\nCommon suffixes and examplessuffix …\nWord formationThere are four main kinds of word formation: prefixes, suffixes, conversion and compounds. …\nPrefixesWe add prefixes before the base or stem of a word. …\nSuffixesWe add suffixes after the base or stem of a word. The main purpose of a suffix is to show what class of word it is (e.g. noun or adjective). …\nConversionConversion involves the change of a word from one word class to another. For example, the verbs to email and to microwave are formed from the nouns email and microwave: …\nCompoundingWhen we use compounding, we link together two or more bases to create a new word. Normally, the first item identifies a key feature of the second word. For example, the two bases back and ache can combine to form the compound noun backache, and the two bases post and card combine to form the compound noun postcard. …\nAbbreviationAbbreviation involves shortening a word. We do this in three main ways: clipping, acronyms and blends. …\nBack-formationWe form words with back-formation when we remove part of a word, usually something which we think is a suffix (or occasionally a prefix). We do this commonly when we form verbs from nouns. …\nlanguage\n&#160; specialized to add a letter or group of letters to the end of a word to make a new word: suffixed with \"Generalize\" is a verb because it is suffixed with \"-ize\" and \"generalization\" is a noun because it is suffixed with \"-tion\".suffixed to In Arabic, possessive pronouns are suffixed to nouns that have the structural status of possessed nouns.\nto use a word after the word for something, for example to describe it : suffix something with something It's difficult to write \"pensions\" these days without suffixing the word with \"mis-selling\".\nto add a group of numbers, letters, or symbols to the end of an internet address or piece of computer code: suffixed with The program searches the hard drive for files that are suffixed with .jpeg or .jpg. The base URL is suffixed with a unique numeric code.\nto add something to another thing: suffixed to The data has been collected online and the anonymous texts have been suffixed to this report.\nSMART Vocabulary: related words and phrases\nLinguistics: morphology & parts of words\n-athon\naffix\naffixation\nagglutinate\nagglutinative\nanalytic\ncontraction\nion\nism\nlibfix\nmonomorphemic\nmonosyllabic\nmorpheme\nmorphological\npolysyllabic\nsyllabify\nsynthetic\nthat'd\nthat'll\nthat's\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAugmenting and supplementing\nEnds and endings\nAdd to word list\nAdd to word list\ngrammar a letter or group of letters added at the end of a word to make a new word: In the word \"quickly,\" \"-ly\" is a suffix meaning \"in the specified manner.\""}