{"id":350544,"name":"suggesting","type":"verb","us_sound":"səˈdʒest","us_link":"../audio/s/suggest.mp3","uk_sound":"səˈdʒest","uk_link":"../audio/s/uksugar002.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsuggest\nsuggest verb [T]\n(MENTION)\nB1 to mention an idea, possible plan, or action for other people to consider: I suggested an Italian restaurant near the station for the party. formal Might I suggest a white wine with your salmon, sir? [ + (that) ] I suggest (that) we wait a while before we make any firm decisions. Liz suggested (that) I try the shop on Mill Road. [ + -ing verb ] I suggested putting the matter to the committee. [ + question word ] Can you suggest where I could buy a dozen roses?\nMore examplesFewer examplesI suggest we use Barkers as our main suppliers - they're good and furthermore they're cheap.I suggested that we should meet, and they agreed .She suggested half-jokingly that they should sell the family car and all buy bikes instead.They'd laugh in your face if you suggested me for the post.They suggested we meet up at Mustafa's.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nimply\nmake noises idiom\nmaybe\nmove\nmover\nnomination\non the table idiom\nproposition\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nresubmission\ntable\nSee more results »\nsuggest verb [T]\n(SHOW/EXPRESS)\nB2 to communicate or show an idea or feeling without stating it directly or giving proof: [ + (that) ] There's no absolute proof, but all the evidence suggests (that) he's guilty. Are you suggesting (that) I look fat in these trousers? Something about his manner suggested a lack of interest in what we were doing.\nMore examplesFewer examplesThe latest opinion polls suggest that his days as leader are numbered.Current demographic trends suggest that there will be fewer school leavers coming into the workforce in ten years' time.There is no scientific evidence to suggest that underwater births are dangerous.Studies suggest that regular intake of the vitamin significantly improves brain function.Laboratory tests suggest that the new drug may be used to treat cancer.\nSMART Vocabulary: related words and phrases\nShowing and demonstrating\nact out\nattest\nbespeak\nbetray\nbreastbeating\nbring\ndefine\ndemonstrative\nindicate\nostensively\npoint (something/someone) out\npoint the way idiom\npoint to/towards something\nprobatory\nproduce\nspeak\nvirtue signalling\nvisualization\nwear\nwhiff\nSee more results »\nsuggest verb [T]\n(PRODUCE AN IDEA)\nformal to produce an idea in the mind: Does anything suggest itself? (= Do you have any ideas about what we should do?)\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nimply\nmake noises idiom\nmaybe\nmove\nmover\nnomination\non the table idiom\nproposition\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nresubmission\ntable\nSee more results »\nGrammar\nSuggestWe can use the verb suggest with a noun phrase, a that-clause, the -ing form of a verb or a wh-question word (where, what). …"}