{"id":350546,"name":"suggestion","type":"noun","us_sound":"səˈdʒes.tʃən","us_link":"../audio/s/suggestion.mp3","uk_sound":"səˈdʒes.tʃən","uk_link":"../audio/s/uksugar004.mp3","content":"Add to word list\nAdd to word list\nB1 an idea, plan, or action that is suggested or the act of suggesting it: I don't know what to wear tonight - do you have any suggestions? She made some very helpful suggestions but her boss rejected them all. [ + that ] They didn't like my suggestion that we should all share the cost. I have a few favourite restaurants that I tend to go back to, but I'm always open to new suggestions (= willing to try new ones that people suggest). I went to the Park Street dentist's at Ann's suggestion (= as a result of Ann suggesting it) and I was really impressed.\nThesaurus: synonyms, antonyms, and examples\nan ideaideaI've got an idea - why don't we ask John for help?planThe plan is to hire a car when we get there.thoughtHave you had any thoughts on presents for your mother?suggestionHave you got any suggestions for improvements?brainwaveUK I wasn't sure what to do and then I had brainwave - I could ask Anna for help.brainstormUS She was stuck until she had a brainstorm and the solution came to her.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\ncommunication of an idea without stating it directly: the suggestion of his guilt Synonyms\nhint (INDIRECT STATEMENT)\nimplication\nimputation formal\nindication (SIGN)\ninsinuation\nintimation formal\na very small amount of something: a suggestion of an Irish accent\nMore examplesFewer examplesThey treated his suggestion with derision.Although they said nothing, she could sense their disapproval of her suggestion.I'd like to think I'm open to any reasonable suggestion.Every time I make a suggestion at work, my boss overrides it.My suggestion that we all play tennis sank like a stone.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmove\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDigressing and being indirect or evasive\nWords meaning small pieces and amounts\nSmall in number and quantity\nGrammar\nSuggestionsIf we make a suggestion, it means that we mention a possible course of action to someone. There are a number of expressions which we can use to make suggestions. …\nsuggestion noun\n(IDEA MENTIONED)\nAdd to word list\nAdd to word list\n[ C/U ] an idea, possible plan, or action that is mentioned for other people to consider: [ C ] She made some helpful suggestions on how to cut our costs. [ C ] They didn’t like my suggestion that we should all share the cost. [ U ] We’re open to suggestion (= willing to listen to other people’s ideas).\nsuggestion noun\n(SOMETHING THAT SHOWS)\n[ C ] something that shows the existence of something but is not obvious: Police said there was no suggestion of foul play and that the death was the result of an accident."}