{"id":350611,"name":"suit","type":"noun","us_sound":"suːt","us_link":"../audio/s/suit.mp3","uk_sound":"suːt","uk_link":"../audio/s/uksugar009.mp3","content":"suit noun\n(SET OF CLOTHES)\nAdd to word list\nAdd to word list\nA2 [ C ] a jacket and trousers or a jacket and skirt that are made from the same material: All the businessmen were wearing pinstripe suits. She wore a dark blue suit.\nIndeed/GettyImages\n[ C ] a set of clothes or a piece of clothing to be worn in a particular situation or while doing a particular activity: a diving/protective/ski, etc. suit a swimsuit a spacesuit a suit of armour\nMore examplesFewer examplesShe wore a classic navy suit.Could you pick up my suit from the cleaner's for me, please?He was dressed in a dark grey suit.She always looks very professional in her smart suits.It's regulation to wear suits at the office.\nSMART Vocabulary: related words and phrases\nDresses, suits & gowns\nabaya\nballgown\nbandage dress\nbandeau dress\nblack tie\nghillie suit\ngown\nhimation\njilbab\njumpsuit\npinafore\npinstripe\nplaysuit\nrobe\nrompers\ntea dress\nthree-piece suit\ntoga\ntrouser suit\ntunic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClothing - general words\nsuit noun\n(LEGAL PROBLEM)\n[ C ] (also lawsuit) a problem taken to a law court by an ordinary person or an organization rather than the police in order to obtain a legal decision: He brought (US also filed) a $12 million libel suit against the newspaper, claiming his reputation had been damaged. a malpractice/negligence/paternity suit\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nsuit noun\n(PLAYING CARDS)\n[ C ] any of the four types of card in a set of playing cards, each having a different shape printed on it: The four suits in a pack of cards are hearts, spades, clubs, and diamonds.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nflush\nhonour\njack\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstraight\nSee more results »\nsuit noun\n(PERSON)\n[ C often plural ] informal disapproving a man who works in an office and wears a suit, especially a man with a high position in a company who is considered not to have human feelings and good ideas\nsuit verb [T]\n(BE RIGHT)\nB2 to be right for a particular person, situation, or occasion: A lot of corn is grown in this area - the soil seems to suit it very well. The city lifestyle seems to suit her - she looks great.\nB2 (usually of a colour or style of clothes) to make someone look more attractive: You should wear more red - it suits you. Short skirts don't really suit me - I don't have the legs for them.\nMore examplesFewer examplesThe software can be modified to suit the particular needs of the end user.How does family life suit you?\"Will a loan of $500 be sufficient?\" \"That will suit me fine.\"I don't suppose I have any books that would suit your sophisticated tastes.Couldn't you contrive a meeting between them? I think they'd be ideally suited.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nanswer\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ncompatibly\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nlevel\nmisdirection\norder\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nunworthy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWearing clothes\nDecorating or making something attractive\nAttractive\nsuit verb [T]\n(BE CONVENIENT)\nB2 to be convenient and cause the least difficulty for someone: We could go now or this afternoon - whatever time suits you best. \"How about eight o'clock at the cinema?\" \"That suits me fine.\"\nMore examplesFewer examplesThe opposition leader accused government ministers of manipulating the statistics to suit themselves.Which evening would suit you best for the party?Part-time work would suit me right down to the ground.Which time suits you better - 12.30 or one o'clock?We can go to the seven o'clock performance or the eight - whichever suits you best.\nSMART Vocabulary: related words and phrases\nBeing suitable or unsuitable\nage-barred\nanswer\nappropriately\nbe made for someone/something idiom\nbecome\nbefit\ncompatibly\ndress/look/act the part idiom\nextravagantly\nface\nfill/fit the bill idiom\nlevel\nmisdirection\norder\nout of order idiom\nsomeone's face doesn't fit idiom\nsuit someone (right) down to the ground idiom\ntopic\nunsympathetically\nunworthy\nSee more results »\nGrammar\nFit or suit?If something fits you or fits into a place, it is the right size or shape for you or for that place: …\nIdioms\nsuit yourself!\nsuit someone (right) down to the groundPhrasal verb\nsuit up\nsuit verb [T]\n(WORK WELL)\nAdd to word list\nAdd to word list\nto be convenient or work well for someone or something: What time suits you best? The job of a salesman seems to suit him.\nTo suit also means to make someone look more attractive: That new hairstyle really suits you – you look terrific. Phrasal verb\nsuit up\nsuit noun [C]\n(CLOTHES)\na set of clothes made of the same material and usually consisting of a jacket and pants or skirt\nA suit is also a set of clothes or a piece of clothing to be worn in a particular situation or for a particular activity: a bathing suit\nslang A suit is also someone in business, esp. when compared with an artist or ordinary worker: The network suits don’t care about the fans who show up at the ballpark.\nsuit noun [C]\n(LEGAL CASE)\na lawsuit: She brought a suit against the HMO for medical malpractice.\nsuit noun [C]\n(CARD TYPE)\nany of the four types of cards in a set of playing cards, each having a different symbol printed on it: The four suits in a deck of cards are hearts, spades, clubs, and diamonds.\nAdd to word list\nAdd to word list\nLAW\n&#160; (also lawsuit) a problem or complaint taken for a decision to a court of law by a person or organization rather than by the police or the government: bring/file a suit They have brought a suit for damages against the company. a civil/class-action/libel suit\nfile suit\nLAW to take a problem or complaint to a court of law for a decision: 30 people have filed suit against the company.\na jacket and trousers or a jacket and skirt that are made from the same material: a business/pinstripe suit She wore a smart grey business suit to work.\n[ usually plural ] informal an executive, especially in advertising, the film industry, etc., rather than a creative (= writer, artist, etc.) working in one of these industries: We'll leave the suits in the boardroom to worry about this. Compare\ncreative noun"}