{"id":351163,"name":"sum","type":"noun","us_sound":"sʌm","us_link":"../audio/s/some.mp3","uk_sound":"sʌm","uk_link":"../audio/s/uksolip024.mp3","content":"sum noun\n(AMOUNT OF MONEY)\nAdd to word list\nAdd to word list\nB1 [ C ] an amount of money: sum of Huge sums of money are spent on national defence.tidy sum He sold the house for a tidy (= large) sum.princely sum humorous I worked for three whole weeks for which I received the princely (= very low) sum of $100.\nMore examplesFewer examplesWe were awarded a derisory sum.Having sold the house she had a large sum of money at her disposal .She left a large sum of money in her will to found a wildlife sanctuary.Her divorce settlement included a lump sum of $2 million.She was paid the mind-boggling sum of ten million pounds for that film.\nSMART Vocabulary: related words and phrases\nAmounts of money\nappropriation\nbank\nbounty\nbuck\ncapital\ncircumstance\ncoin\nfisc\nfloat\nholdback\nliving wage\nmeans\nmoney supply\nnut\npayout\npool\nsub\ntrough\nwherewithal\nyour daily bread idiom\nSee more results »\nsum noun\n(TOTAL)\n[ S ] the whole number or amount when two or more numbers or amounts have been added together: The sum of 13 and 8 is 21.\nThesaurus: synonyms, antonyms, and examples\nto add up numbersaddAdd 24, 63, and 55.add upMy job was to add up the scores at the end. totalTotal the daily payments for a month and you arrive at your monthly expenditure. find the sumFind the sum of the following numbers.find the totalFind the total of £26.33, £55.09, and £109.65.add up toThe figures add up to a huge amount.\nSee more results »\nin sum formal\nconsidered as a whole: The meeting was, in sum, a disaster.\nSee more the sum of something\nall of something, especially when this is not very much: And that's the sum of my knowledge on the subject!\nSee more\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nroot\nsum total\nwork something out\nSee more results »\nsum noun\n(CALCULATION)\n[ C ] a calculation, especially a simple one, using such processes as adding, taking away, multiplying, or dividing: do a sum I remember how much I hated doing sums when I was at school.\nSMART Vocabulary: related words and phrases\nCalculations & calculating\nalgebraic\nalgebraically\nalgo\nalgorithmic\namount\ncalculate\nguesstimate\ninterpolate\ninverse function\nlinear equation\nmathematical\nmatrix\nmiscalculate\nmiscalculation\nmiscount\nmultigrid\noperator\nroot\nsum total\nwork something out\nSee more results »\nIdioms\nget/have your sums right/wrong\nmore/greater/bigger etc. than the sum of its parts\nsum noun\n(AMOUNT OF MONEY)\nAdd to word list\nAdd to word list\n[ C ] a particular amount of money: The sum involved in the sale was not reported.\nsum noun\n(TOTAL)\n[ U ]\n&#160; mathematics a total found by the addition of two or more numbers: The sum of seven and twelve is nineteen. in sum\nIn sum is said before giving a final, brief statement describing something: In sum, the American public did not perceive global warming as urgent.\nAdd to word list\nAdd to word list\n[ C ]\n&#160; MONEY, FINANCE an amount of money: Share price slid by 1p to 142p fuelled by concerns that the company might offer too generous a sum for the proposed venture in India. The sale of Germany's biggest commercial TV operator for an undisclosed sum follows a bidding contest. Banks may not be prepared to open an account if the sum involved is too small.large/huge/enormous sums Restrictions have been imposed by the government on the movement of large sums of money out of the country.a small/modest/substantial sum A substantial sum has been set aside for litigation relating to the construction project.an additional/cash/final sum The final sum an investor receives from a pension is dependent on the rate of investment growth. vast/huge/considerable sumsa sum of $8/£2,000/€1.2m, etc. Legislation approved yesterday will raise a much-needed sum of £300,000 for use on the roads.pay (out)/spend/invest a sum Deposits are non-recoverable cash sums paid just to reserve a property, with a further sum payable when contracts are exchanged.earn/receive/owe a sum Victims of an explosion at a chemical works are set to receive large sums in compensation.borrow/lend a sum First-time buyers are having to borrow huge sums to buy a home.\n[ S ] (also sum total) the number or amount that is the result of adding together two or more numbers or amounts: sum of sth In 2006, the sum of all income for residents of Colorado rose by 6.5%.\n[ C ] UK a calculation that involves adding, subtracting, multiplying, or dividing numbers: You need to do your sums before deciding whether you would benefit more from a fixed-rate or a tracker mortgage. Amid the pressure to get their sums right, many funds have closed to new business.\n[ S ] (also sum total) the whole of something after all the different features or parts of it are considered: the sum of sth We believe that the sum of our business principles maximizes our chances of success.\nmore/greater than the sum of its parts\nmore powerful, effective, etc. as a whole than you would think if you considered the different features or parts that it consists of: The claimed logic of this latest merger is that the whole will be more than the sum of the parts.\nin sum\nused at the end of a report or discussion before giving a short description of the main ideas or facts: We're looking, in sum, for a major player who believes in newspapers as a serious business.\na princely/tidy sum\na large amount of money: She sold her story to the tabloids for a princely sum. We have made a tidy sum on our investments.\nthe princely sum of sth\nused in a humorous way to refer to an unexpectedly small amount of money: The book was first published in the UK in 1972 for the princely sum of 40p. See also\ncapital sum\nlump sum"}