{"id":351275,"name":"summoning","type":"verb","us_sound":"ˈsʌm.ən","us_link":"../audio/s/summon.mp3","uk_sound":"ˈsʌm.ən","uk_link":"../audio/s/uksulta017.mp3","content":"Add to word list\nAdd to word list\npresent participle of\nsummon\nsummon verb [T]\n(ORDER)\nC2 to order someone to come to or be present at a particular place, or to officially arrange a meeting of people: General Rattigan summoned reinforcements to help resist the attack. On 20 July, the town council was summoned to hear an emergency report on its finances. We were summoned to the headmaster's office.\nThesaurus: synonyms, antonyms, and examples\nto ask someone to come to youcallThe children called for him at night.call outPlease avoid calling out the doctor unless it is an emergency.send forSomeone has already sent for a doctor.summonI was summoned to the headmaster's office.summonsIf you are summonsed and do not attend court, you may be found guilty of contempt of court. hailShe walked to the corner and hailed a cab.\nSee more results »\nMore examplesFewer examplesLate last night, the French ambassador was summoned to the Foreign Office to discuss the crisis.After her month's sick leave, she was summoned to see the company's welfare officer.He summoned his troops.We were summoned to the headmaster's office.She summoned us to admire her new greenhouse.\nSMART Vocabulary: related words and phrases\nInviting & summoning\nask\nask someone in\nask someone out\ncall\ncall (something) out\ncall someone in\nconvene\nconvoke\nfriend\ninvite\ninvite someone over\ninvitee\nplus one\nrecall\nresummon\nsend\nsummon\nsummons\nuncalled\nuninvited\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPlanning, expecting and arranging\nsummon verb [T]\n(PRODUCE STRENGTH)\nC2 to increase your courage or strength, especially with an effort: It took me six months to summon (up) the courage to ask him out for a drink.\nSMART Vocabulary: related words and phrases\nTrying and making an effort\nA game\nassault\nattempt\nattempted\nbackwards\nbid\ncommitment\ncrack\ngo for it idiom\ngo out of your way idiom\ngo the extra mile idiom\ngo to great lengths idiom\nGod helps those who help themselves idiom\nnose\nseek\nsquare the circle idiom\nstep on the gas idiom\nstick at something\nstick to something\nstick-to-itiveness\nSee more results »"}