{"id":351224,"name":"summer","type":"noun","us_sound":"ˈsʌm.ɚ","us_link":"../audio/s/summer.mp3","uk_sound":"ˈsʌm.ər","uk_link":"../audio/s/uksulta009.mp3","content":"Add to word list\nAdd to word list\nA1 the season of the year between spring and autumn when the weather is warmest, lasting from June to September north of the equator and from December to March south of the equator: We have breakfast on the balcony in (the) summer. Last summer they went to Australia, and two summers ago they went to Brazil. That year it was a hot, dry summer. summer weather/sun a summer/summer's day Synonym\nsummertimeSee also\nIndian summer (WEATHER)\nMore examplesFewer examplesShops are currently holding sales to clear their summer stock .Every summer thousands of people flock to the countryside.What time does it get dark in the summer?He managed to eke out a living one summer by selling drinks on a beach.At the end of a hot summer, violence erupted in the inner cities.\nSMART Vocabulary: related words and phrases\nThe seasons\nautumn\nautumnal\nautumnally\ndead\nestival\nfall\nin the dead of night/winter idiom\nmidsummer\nmonsoon\nrain\nseason\nseasonal\nseasonality\nseasonally\nspring\nspring fever\nturn the clocks forward phrase\nvernal\nwinter\nwintertime\nSee more results »\nto spend the summer in a particular place: If your cactus has summered outdoors, move it into the garage or house when overnight temperatures drop below 65°F.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\ncaravanning\necotourism\nescape\nhigh season\nlayover\nmini-break\npackage tour\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\nSee more results »\nAdd to word list\nAdd to word list\nthe season of the year between spring and fall, lasting from June to September north of the equator and from December to March south of the equator, when the weather is warmest: [ C ] We always spend our summers on the island."}