{"id":351193,"name":"summary","type":"noun","us_sound":"ˈsʌm.ɚ.i","us_link":"../audio/s/summary.mp3","uk_sound":"ˈsʌm.ər.i","uk_link":"../audio/s/uksulta006.mp3","content":"Add to word list\nAdd to word list\nB2 a short, clear description that gives the main facts or ideas about something: At the end of the news, they often give you a summary of the main stories. In summary, they decided against the proposal.\nMore examplesFewer examplesI only asked for a summary of the main points but she's making a real meal out of it.He gave us a short summary of the meeting.Our teacher asked us to write a summary of the story.In summary, the whole affair was a fiasco.This document gives a summary of the relevant items of law.\nSMART Vocabulary: related words and phrases\nSummaries and summarizing\nabridgment\nabstract\nbiodata\ncatch-all\ncurriculum vitae\nexecutive summary\ngist\nhandout\nin short idiom\nrecapitulation\nresume\nshorthand\nshorthand for something idiom\nstory\nsum (something/someone) up\nthe long and the short of it idiom\nTLDR\nto cut a long story short idiom\ntrot\nupsum\nSee more results »\ndone suddenly, without discussion or a legal process: summary arrest/dismissal/execution\nSMART Vocabulary: related words and phrases\nNot expected or planned\nabrupt end\nabrupt halt\nabruptly\nabruptness\nad hoc\nimprovidently\ninadvertence\ninadvertency\ninadvertent\ninadvertently\nreckon without something\nrudely\nsharpness\nsine die\nspirit\nunstarry\nunsuspected\nuntimely\nuntoward\nunwilled\nSee more results »\nRelated word\nsummarily\nAdd to word list\nAdd to word list\na brief, clear statement giving the most important facts about something: The assignment was to write a summary of the news. in summary\nIn summary is said before giving a final, brief statement: In summary, Chen’s book is a good introduction to the subject.\nAdd to word list\nAdd to word list\na short statement of the main ideas or facts in a report, discussion, etc.: a summary of sth The article offers a summary of best practices. Many of these problems could have been avoided according to a summary of the study released yesterday. a brief/short/written summaryprovide/produce/publish a summary Table 12.4 provides a summary of how management perspectives have changed over the last 50 years.\nFINANCE, ACCOUNTING a list of the different amounts of money that have been spent and received, for example, on a bank statement\nin summary\nan expression used at the end of a report or discussion before stating its main ideas or facts: In summary, we must aim to maintain a stable supply of crude oil while protecting the environment.\nSee also\nexecutive summary\nmanagement summary\ngiving the main ideas or facts of a discussion, report, etc., but not the details: summary information/reports/observations\nLAW done suddenly, without discussion or the usual or accepted processes: summary arrest/execution/proceedings"}