{"id":351277,"name":"summons","type":"noun","us_sound":"ˈsʌm.ənz","us_link":"../audio/s/summons.mp3","uk_sound":"ˈsʌm.ənz","uk_link":"../audio/s/uksulta019.mp3","content":"Add to word list\nAdd to word list\nlaw\n&#160; specialized an official demand to appear in a court of law: He was given/served with a summons to appear in court. Mr Clarke's insurance company had issued a summons for unpaid mortgage repayments.\nformal an order to come and see someone: They sat there as if they were waiting for some sort of summons.\nSMART Vocabulary: related words and phrases\nTaking legal action\nabatement order\nambulance-chasing\nappear for someone\nbring\nbring an action\ncomplainant\nindict\nindictment\ninstruct\nlegal action\nlitigant\nlitigate\nlitigation\nlitigious\npetitioner\nprosecution\nprosecutorial\nreindict\nreindictment\nretry\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInviting & summoning\nto order someone to come to a person or place: The police mobile rapid response unit was summonsed to the scene shortly before 10pm. Children were summonsed into school by a bell.\nThesaurus: synonyms, antonyms, and examples\nto ask someone to come to youcallThe children called for him at night.call outPlease avoid calling out the doctor unless it is an emergency.send forSomeone has already sent for a doctor.summonI was summoned to the headmaster's office.summonsIf you are summonsed and do not attend court, you may be found guilty of contempt of court. hailShe walked to the corner and hailed a cab.\nSee more results »\nlaw\n&#160; specialized to officially order someone to appear in a court of law: A student was summonsed to court for putting her feet up on a train seat. It is not unusual for only half of the people summonsed to present themselves to the court.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexpect\nharry\nlay down the law idiom\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\ntask\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTaking legal action\nAdd to word list\nAdd to word list\na demand to appear in a particular place, esp. in a court of law: I received a summons to appear in court on June 25th.\nAdd to word list\nAdd to word list\nan order for someone to appear in a court of law: One newspaper reporter was given a summons for disorderly conduct. They will be issued a summons to appear before the U.S. District Court in Richmond. Service of the summons does not have to be effected in person; postal service is likely to be sufficient.issue/serve/send a summons Proctor will be served a summons with a date to appear in court to answer the charges.receive/get/be given a summons Approximately half of defendants receive a summons rather than being brought into custody. See also\noriginating summons\nwitness summons\nwrit of summons\nto order someone to appear in a court of law: Prosecutors summonsed several residents to the Grafton County grand jury. I have been summoned for jury service and must appear at Middlesex Crown Court on July 31."}