{"id":351317,"name":"sun","type":"noun","us_sound":"sʌn","us_link":"../audio/s/son.mp3","uk_sound":"sʌn","uk_link":"../audio/s/uksomet012.mp3","content":"Add to word list\nAdd to word list\nA1 the star that provides light and heat for the earth and around which the earth moves: sun rises/sets The sun rises in the east and sets in the west. The sun's rays are at their most powerful at midday.sun shines We thought we'd go out for a walk while the sun was shining.\nheibaihui/iStock/Getty Images Plus/GettyImages\nA1 the light or heat that the earth receives from the sun: I think I've had too much sun today - I have a headache.in the sun Let's go and sit out in the sun.\nThesaurus: synonyms, antonyms, and examples\nbrightness that allows you to seelightLight streamed in through the window.brightnessThe brightness of the sun hurt his eyes.illuminationFor professional-quality photos, it is best to use several sources of illumination. sunThis plant needs to be in full sun.sunlightSunlight streamed in through the windows.daylightHow much daylight does this room get?\nSee more results »\nMore examplesFewer examplesThe sun climbed higher in the sky.They're advising that children be kept out of the sun altogether.The clouds finally parted and the sun came out.She left the midday sun for the cool of the shade.Now I know it won't look very cool, but this hat will keep the sun out of your eyes.\nSMART Vocabulary: related words and phrases\nLight\nbeam\nbrilliance\ncandlelight\ncoruscation\ndaylight\nfluorescence\nhelio-\nillumination\nincandescence\nincident light\ninfrared\nlamplight\nmoonbeam\nphosphene\nphosphorescence\nphoto\nshininess\nstarlight\nsunlight\ntorchlight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAstronomy\nIdioms\neverything under the sun\nthe sun sets on something\nthink the sun shines out (of) someone's arse/backside\nsun yourself\nto lie or sit somewhere where there is a lot of sun, especially in order to make your skin darker: I sat on the balcony sunning myself. We could see Miranda sunning herself on the dock. Most afternoons, we would sun ourselves on the beach. We were all working hard while you were sunning yourself in the Caribbean. We watched a small lizard sunning itself on the trunk of a tree. Synonym\nsunbathe\nSMART Vocabulary: related words and phrases\nBeauty treatments\naesthetic\naesthetician\nbeautician\nbeauty\nbeauty salon\nelectrolysis\nexfoliation\neye mask\nfake tan\nfiller\nFrench manicure\nFrench tip\nmicroneedling\nnail art\nrasul\nsauna\nself-tan\nsunbathe\nsunbed\nwaxing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe skin, & skin colour\nwritten abbreviation for Sunday\nSMART Vocabulary: related words and phrases\nDays, & parts of the week\nat the weekend phrase\nat weekends phrase\ncalends\nFri.\nFriday\nMon.\nMonday\nnones\nsat\nSaturday\nschool night\ntoday\ntomorrow\nTue.\nTuesday\nwed\nweekend\nweekend warrior\nweeknight\nyesterday\nSee more results »\nAdd to word list\nAdd to word list\nthe star around which the earth moves and that provides light and heat for the earth: The sun is the center of our solar system.\nSun also means the light or heat that the earth receives from this star: Sit in the sun where it’s a lot warmer.\nto lie or sit somewhere where there is a lot of sun, esp. in order to make your skin darker: [ T ] All morning, the cat sunned herself on the stone wall.\nabbreviation for Sunday"}