{"id":351491,"name":"sunset","type":"noun","us_sound":"ˈsʌn.set","us_link":"../audio/s/ussunbl020.mp3","uk_sound":"ˈsʌn.set","uk_link":"../audio/s/uksunbu024.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the time in the evening when you last see the sun in the sky: The fishermen set out at sunset for a night's fishing.\nB1 [ C ] the appearance of the sky in the evening before the sun goes down: We sat on the beach watching a spectacular sunset.\nVicente Soler/EyeEm/GettyImages\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwhite night\nwine o'clock\nworkday\nworking day\nSee more results »\nIdiom\nride, drive, walk, etc. (off) into the sunset\nbusiness , law\n&#160; mainly US specialized used to describe a part of a law or contract that states when it will end, or the conditions under which it will end: She added a sunset clause that nullified the agreement after 10 years of marriage.\nbusiness , law\n&#160; mainly US specialized used to describe a date by which something must legally end: Proposed changes include eliminating a lower charge for companies, moving the charge's sunset date from 2012 to 2025.\nMore examplesFewer examplesAs a precaution, the senators put a five-year sunset clause on the bill before it passed to end the practice if it was costing too much.He will propose abolishing the \"sunset clause\" that would block new countries from entering HIPC if they have not met the entry criteria by the end of this year.He said he thought the fee proposal came with a sunset provision that would eliminate the increases on June 30, 2015, unless the legislation was extended.If approved, the program is slated to last for four years, with a sunset date in 2020.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\nbylaw\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nself-regulation\nunenforceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComing to an end\nto end a law or legal agreement or allow it to end, or to come to an end: He is looking at the possibility of sunsetting some of these regulations. The provision lasts just four years - starting in 2022 and sunsetting in 2026.\nSMART Vocabulary: related words and phrases\nFinished & over\nall over\nbar\nbe (all) over bar the shouting idiom\nbe done and dusted idiom\ncan\nclose\nclosed\nfinished\nfinito\nin the can idiom\nit's a wrap idiom\njig\nlapsed\nmic\nout\nover\nsee\nsee the last of something/someone idiom\nto the last idiom\nwrap\nSee more results »\nsunset noun\n(EVENING)\nAdd to word list\nAdd to word list\n[ U ] (also sundown, us/ˈsʌnˌdɑʊn/) the time in the evening when you last see the sun\nsunset noun\n(SKY APPEARANCE)\n[ C ] the appearance of the sky when the sun goes down: a brilliant purple sunset"}