{"id":352444,"name":"superior","type":"adjective","us_sound":"səˈpɪr.i.ɚ","us_link":"../audio/s/eus74431.mp3","uk_sound":"suːˈpɪə.ri.ər","uk_link":"../audio/s/uksuper004.mp3","content":"superior adjective\n(BETTER)\nAdd to word list\nAdd to word list\nC1 better than average or better than other people or things of the same type: This is clearly the work of a superior artist. She was chosen for the job because she was the superior candidate. For babies, breastfeeding is superior to bottle-feeding. The government troops were superior in numbers (= there were more of them). Opposite\ninferior\nThesaurus: synonyms, antonyms, and examples\ngood or important because of unusual qualities specialAre you doing anything special for your birthday?exceptionalTheir standard of acting was very high but there was one exceptional performance.outstandingHe accepted an award for outstanding achievement in baseball.extraordinaryHer capacity to remember things is extraordinary.deluxeThe salesman tried to sell us the deluxe model.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nof high qualitygoodBuy a really good foundation and cultivate a healthy glow.good/high qualityWe have a real commitment to high-quality ingredients.qualityWe are working hard to produce a quality product.fineThey have a well-stocked cellar full of fine wines.superiorThe food and service here are superior to any other restaurant in the city.\nSee more results »\nC2 disapproving A superior person believes that or acts as if they are better than other people: a superior manner/smile I can't stand Amanda - she's so superior. Synonyms\narrogant\nconceited disapproving\ncondescending disapproving\nhaughty disapproving\nhubristic literary\nimperious\nlordly\noverbearing disapproving\npatronizing\npompous disapproving\nproud (FEELING IMPORTANT) disapproving\nself-important disapproving\nsneering disapproving\nsnooty informal\nsupercilious disapproving\nThesaurus: synonyms, antonyms, and examples\nacting as if you are more important than other peoplearrogantI can't stand how arrogant he is!proudDon't be too proud to admit you're wrong.pompousWhat a pompous jerk!self-importantThe room was filled with self-important politicians. superiorHer superior and smug manner made conversation unbearable.\nSee more results »\nMore examplesFewer examplesAlthough badly out-numbered by the enemy, we had vastly superior firepower.She thinks she's morally superior to the rest of us.This cheese is vastly superior to the other.They only employ a very superior kind of nanny.They make superior outdoor products.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing arrogance and conceit\nFeeling morally superior\nsuperior adjective\n(HIGHER)\nhigher in rank or social position than others: The soldier was reported to his superior officer for failing in his duties.\nmedical\n&#160; specialized closer to the head, further from the feet: The head is superior to the shoulder.\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImportant people and describing important people\nRelating to particular parts of the body\nC1 a person or group of people who are higher in rank or social position than others: I will pass your complaint on to my superiors. Synonym\nhigher-up informal\nSMART Vocabulary: related words and phrases\nOrganizations - position & status\nambassador\nanti-elite\nanti-elitist\napparatchik\nback seat\nbrother\ncounterpart\nfish\ngrassroots\nhigh-ranking\nopposite number\nrank\nreach\nspokeswoman\nsuper-elite\nsuperboard\nsuperiority\nsuperordinate\nthane\ntitularly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nImportant people and describing important people\nsuperior adjective [not gradable]\n(BETTER)\nAdd to word list\nAdd to word list\nbetter than average, or better than others of the same type: They were clearly the superior team. Some people think acoustic recordings are superior to digital ones.\ndisapproving A person who is superior or behaves in a superior way believes that he or she is better than other people: I can’t stand Bill’s superior attitude.\nsuperior adjective [not gradable]\n(HIGHER)\nhigher in rank or position than others: When your superior officer gives you an order, you do it.\nsuperior noun [C]\n(HIGHER PERSON)\na person or group of people who are higher in rank or position than others : We will need a letter of recommendation from one of your superiors.\nAdd to word list\nAdd to word list\nbetter in quality than other things of a similar type: We pride ourselves on having achieved a corporate culture of superior performance. superior products/brands superior customer/after-sales service superior value/results/returnsbe superior to sth The firm's technology is widely regarded as being superior to that of its rivals.far/vastly superior (to sth) The school system was far superior when he left than it was when he was elected mayor.\nWORKPLACE having a higher position than someone else in a company or organization: superior officers\nsomeone who has a higher position than another employee or group of employees in a company or organization: 71% of workers surveyed said they had been insulted, ignored, or otherwise treated discourteously by their superiors. Conflicts can usually be contained if dealt with by an immediate superior. Any unusual incidents should be reported to your superior. Travel expenses must be authorized and approved by your superiors."}