{"id":353180,"name":"supervision","type":"noun","us_sound":"ˌsuː.pɚˈvɪʒ.ən","us_link":"../audio/s/supervision.mp3","uk_sound":"ˌsuː.pəˈvɪʒ.ən","uk_link":"../audio/s/uksuper101.mp3","content":"Add to word list\nAdd to word list\nC1 the act of watching a person or activity and making certain that everything is done correctly, safely, etc.: Students are not allowed to handle these chemicals unless they are under the supervision of a teacher. Synonym\noversight\nMore examplesFewer examplesIn cases of severe mental handicap, constant supervision is recommended.The drug should only be administered under strict medical supervision.The children were running around with no supervision.The machine should only be used with adult supervision.Never operate the machinery without supervision.\nSMART Vocabulary: related words and phrases\nPower to control\nahold\nall-powerful\nascendancy\nauthoritarianism\nbe above someone's pay grade idiom\nbig beast\ncradle\ndiscretionary\ngrip\nhe who pays the piper calls the tune. idiom\nhegemonic\nhegemonism\nimplant\npower structure\npower struggle\npower vacuum\npower-sharing\npredominance\nsway\nthe hand that rocks the cradle rules the world idiom\nSee more results »\nAdd to word list\nAdd to word list\nthe activity of managing a department, project, etc. and of making sure that things are done correctly and according to the rules: supervision of sb/sth Supervision of capital markets will help to mobilize resources for investment in the least-developed countries. Central banks need operational independence from politicians if regulation and supervision are to be effective. banking/financial/regulatory supervision government/state/federal supervision under the supervision of sb/sth Cleaning-up operations are taking place under the supervision of the EPA, but progress has been slow.under supervision Students on the course have the opportunity to do legal work under supervision.close/direct/strict supervision All repair work is being performed cautiously and with close supervision."}