{"id":353175,"name":"supervise","type":"verb","us_sound":"ˈsuː.pɚ.vaɪz","us_link":"../audio/s/supervise.mp3","uk_sound":"ˈsuː.pə.vaɪz","uk_link":"../audio/s/uksuper030.mp3","content":"Add to word list\nAdd to word list\nB2 to watch a person or activity to make certain that everything is done correctly, safely, etc.: The UN is supervising the distribution of aid by local agencies in the disaster area. The children play while two teachers supervise (= make certain that they behave correctly and are safe). Synonyms\nmanage (CONTROL)\noversee\nsuperintend formal\nMore examplesFewer examplesThe United Nations is to supervise the handover of the prisoners of war.With 20 kids running round and only two adults to supervise, it was complete mayhem.Foreign officials are supervising the elections.He was employed to supervise the computerization of records.I supervise a team of ten customer relations staff.\nSMART Vocabulary: related words and phrases\nControlling and being in charge\naggrandize\nassert your authority\nassume\nassumption\nauthoritative\ncommanding\ncynical\nget the better of someone idiom\nget your hooks into someone/something idiom\nget/fall into the wrong hands idiom\ngovern\nguiding principle\npaternalistic\npaternalistically\nperemptorily\nperemptory\nplay God idiom\ntame\nwrangle\nwrangler\nSee more results »\nAdd to word list\nAdd to word list\nto be responsible for the good performance of an activity or job, or for the correct behavior or safety of a person: The Red Cross supervised the distribution of food to refugees. She supervises 75 employees in our order department. supervision noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌsu·pərˈvɪʒ·ən/\nCity schools were placed under state supervision last week. supervisory adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌsu·pərˈvɑɪ·zə·ri/\nHe applied for a supervisory position in the bank. supervisor noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈsu·pərˌvɑɪ·zər/\na nursing/construction supervisor I have to get off the phone – my supervisor just walked into the office.\nAdd to word list\nAdd to word list\nto manage a department, project, etc. and make sure that things are done correctly and according to the rules: The Financial Services Authority (FSA) is responsible for supervising Britain's banking system. Our facilities management team supervises work at the construction site on a daily basis. A $650,000 fine was imposed against the Minneapolis-based company for failure to supervise its brokers. The role of any President is to supervise.supervise workers/employees/staff Companies should provide special training for managers who supervise remote workers.supervise a project/program/operations As chief of staff, he supervised the operations of the California Department of Justice.be supervised by sb/sth All fund operations are supervised by a board of trustees.adequately/properly/reasonably supervise It is the responsibility of the general contractor to properly supervise the work of all subcontractors."}