{"id":351784,"name":"supercarrier","type":"noun","us_sound":"ˈsuː.pɚˌker.i.ɚ","us_link":"../audio/s/cdo0622ussupe1790.mp3","uk_sound":"ˈsuː.pəˌkær.i.ər","uk_link":"../audio/s/cdo0622uksupe1942.mp3","content":"supercarrier noun [C]\n(SHIP)\nAdd to word list\nAdd to word list\na very large aircraft carrier (= a large ship that carries military aircraft and has a long, flat surface where they take off and land): The nuclear-powered supercarrier will take part in exercises in the north Atlantic. The crew of the super-carrier shares meals and bathrooms for six months at a time.\nMore examplesFewer examplesThis supercarrier is the most advanced vessel in our navy.He is commander of air operations for a supercarrier.An international battle fleet, led by an American supercarrier, is currently off the coast of Ireland.\nSMART Vocabulary: related words and phrases\nThe Navy\nadmiralty\naircraft carrier\narmada\nbroadside\ncruiser\ndestroyer\nfleet\nfrigate\ngunboat\nHMS\nminesweeper\nnaval\npocket battleship\nRFA\nRN\nseaborne\nsubmarine\nthe Navy Seals\nthe USN\ntransport ship\nSee more results »\nsupercarrier noun [C]\n(AIRLINE )\na very large company that operates aircraft : There is no guarantee that a new supercarrier could operate on the key routes from the city's main airport. The proposal would create a super-carrier that can compete with foreign airlines.\nMore examplesFewer examplesThe government believes that enough traffic comes through the region to support a new supercarrier.This takeover may be the first step in the development of a new European super-carrier.\nSMART Vocabulary: related words and phrases\nEnterprises\nacquiree\nacquirer\nacquiror\nagency\nagribusiness\nanswering service\nclicks and mortar idiom\nconglomerate\nconsortium\nfintech\nfirm\nfranchise\nfranchisee\nfranchiser\norganizationally\npacker\nparent company\npartner up\npartnership\nplc\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAir travel: aviation"}