{"id":353270,"name":"suppleness","type":"noun","us_sound":"ˈsʌp.əl.nəs","us_link":"../audio/s/ussuper104.mp3","uk_sound":"ˈsʌp.əl.nəs","uk_link":"../audio/s/uksuper114.mp3","content":"suppleness noun [U]\n(ABILITY TO BEND)\nAdd to word list\nAdd to word list\nthe quality of being able to bend easily or be bent easily: She tried a form of massage therapy that slowly improved her suppleness.\nMore examplesFewer examplesThe rate at which you slow down is determined only by the suppleness of your legs - and your nerve.Knox performs specialized foot and ankle exercises to maintain the suppleness required for the piece and to avoid injury.Stay active and your body will reward you with suppleness and agility. It's a non-oily liquid wax which cleans as it waterproofs and penetrates deeply giving a natural sheen to leather equipment and increases suppleness in the leather.An enriched conditioning creme which restores softness, suppleness and shine to hair.\nSMART Vocabulary: related words and phrases\nFlexible, loose and yielding\nadrift\nbendable\nbendy\nductile\nductility\nfloppiness\nflowing\nfullness\njointed\nlimply\nlimpness\npliant\npliantly\nrelax\nrubbery\nsemi-flexible\ntensile\nunstayed\nunstuck\nyielding\nSee more results »\nsuppleness noun [U]\n(ABILITY TO CHANGE)\nliterary the ability to change quickly and successfully to suit different situations: the suppleness of his voice See\nsupple\nMore examplesFewer examples That integration has been carried out with remarkable suppleness.The staging never develops the emotional suppleness to authenticate the plights of Ibsen's characters.She's got to prove she can handle the job, that she's got the presence and suppleness of mind to be a heartbeat away from the presidency.\nSMART Vocabulary: related words and phrases\nAdapting and attuning to something\naccustom yourself to something\naccustomed\naccustomed to something\nadaptability\nadaptable\nbearing\nfind your feet idiom\nget into the swing of it/things idiom\nget into your stride idiom\nhabituate\nhabituated\nlearn to live with something idiom\nmanner\nplug (something/someone) into something\nsecond nature\nsettle\nsettle down\nswing\nused\nweaned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdapting and modifying"}