{"id":353316,"name":"support","type":"verb","us_sound":"səˈpɔːrt","us_link":"../audio/s/support.mp3","uk_sound":"səˈpɔːt","uk_link":"../audio/s/uksuper122.mp3","content":"support verb [T]\n(ENCOURAGE)\nAdd to word list\nAdd to word list\nB2 to agree with and give encouragement to someone or something because you want him, her, or it to succeed: My father supported the Labour Party all his life. The majority of people in the town strongly support the plans to build a new school. I think it's important to support local businesses by buying locally. [ + obj + to infinitive ] We will always do our best to support our students to succeed.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nB1 mainly UK (US usually root for) If you support a sports team or a sports player, you want them to win, and might show it by going to watch them play: Which team do you support?\nMore examplesFewer examplesI don't support the death penalty, but if people are to be executed, it should be done humanely.The mass of the people support the government's reforms.All those who support this proposal say \"Aye\".Although I support the project in public, my private opinion is that it will fail.Her speech failed to sway her colleagues into supporting the plan.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\nsupport verb [T]\n(HELP)\nB1 to help someone emotionally or in a practical way: Alcoholics Anonymous is a group which supports people who are trying to stop drinking too much alcohol. My family has always supported me in whatever I've wanted to do.\nMore examplesFewer examplesJudging by what he said, I think it's very unlikely that he'll be able to support your application.I thought he wasn't going to support me, but I misjudged him.Many Americans felt it was their patriotic duty to buy bonds to support the war effort.I felt a sense of betrayal when my friends refused to support me.The organization has peddled the myth that they are supporting the local population.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nsupport verb [T]\n(PROVIDE)\nB1 to give a person the money they need in order to buy food and clothes and pay for somewhere to live: He has a wife and four children to support.\nB2 If you support an activity or a habit, you provide the money needed to pay for it: The drug company is supporting cancer research. I don't know how they manage to support their expensive lifestyle. Some drug addicts turn to crime in order to support their habit.\nto provide the right conditions, such as enough food and water, for life: The land is so poor here that it cannot support any crops.\nMore examplesFewer examplesThe great and the good are calling on the government to support the arts.She needs a pretty high income to support her lifestyle.My starting salary as a newly qualified teacher wasn't enough to support a family.Charities depend on people supporting their activities.This play is supported by a grant from the local arts council.\nSMART Vocabulary: related words and phrases\nTrusts & funds\nannuity\nblind trust\nescrow\nfiduciary\nfund\nholding company\ninheritance\nkitty\nmutual fund\nnon-discretionary\npension fund\npension plan\nslush fund\nsuper\nsyndic\nthe Consolidated Fund\ntrust fund\ntrustee\ntrusteeship\nunit trust\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nPaying money\nsupport verb [T]\n(STOP FROM FALLING)\nC2 to hold something firmly or carry its weight, especially from below to stop it from falling: The church dome is supported by/on marble pillars. When babies first learn to stand, they hold on to something to support themselves (= to stop themselves from falling). My ankle is weak, so I always put a bandage on it to support it when I play tennis.figurative The Bank of England has taken measures to support the pound (= to stop it from being reduced in value).\nMore examplesFewer examplesThe frame needs to be strong enough to support the engine assembly .Use bamboo canes to support tomato plants.The stakes are pushed or hammered into the ground and can be used for marking an area, supporting a plant or forming part of a fence.Carefully tighten the clamp until it firmly supports the pipette in a vertical position.A row of reinforced concrete pillars supports the bridge.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npier\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nsinew\nunderpin\nweight-bearing\nSee more results »\nsupport verb [T]\n(PROVE)\nC1 to help to show something to be true: These figures support my argument. You can't make a statement like that without any supporting documentation.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »\nsupport verb [T]\n(ACCEPT)\nUK formal to accept something and allow it to happen: The headteacher told the boys that he would not support that kind of behaviour.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTolerating and enduring\nsupport noun\n(ENCOURAGEMENT)\nB2 [ U ] agreement with and encouragement for an idea, group, or person: Environmental groups are fast gaining support among young people. We've succeeded in drumming up a lot of local support for our attempt to stop the superstore being built. I signed a petition in support of the campaign to end the marketing of baby formula in developing countries.\nMore examplesFewer examplesThe Labour Party has lost a lot of support among the working class.The postal workers have come out in support of their pay claim.The government's concentration on tax reduction has won them a lot of support.There is a growing current of support for green issues among voters.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nsupport noun\n(HELP)\nB1 [ C or U ] emotional or practical help: Liz gave me a lot of support when I lost my job. You've been a great support to my mum in this difficult time. Synonyms\nto someone's aid\nassistance\nhelp\nrelief\nsuccour UK literary\nMore examplesFewer examplesOur success is contingent upon your support.The president's support is critical (to this project).Can I bank on your support?There was a quaver in her voice as she thanked her staff for all their support.I'm reckoning on your continued support.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nsupport noun\n(MONEY)\nB2 [ U ] the money someone needs in order to buy food and clothes and pay for somewhere to live: He is dependent on his father for support .\nMore examplesFewer examplesThe annual cost of income support to unmarried mothers amounted to £700 million in that year.Farmers are eligible for government support if they let a certain amount of land lie fallow.Will financial support for the theatre project be forthcoming?Is there any hope of getting financial support for the project?They are young inexperienced parents and need support.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrusts & funds\nsupport noun\n(HOLDING)\n[ C or U ] something that holds something firmly or carries its weight, especially from below to stop it from falling: The floor is held up by wooden supports. I've hurt my wrist, so I've bandaged it to give it some support.\n[ C ] a device worn to hold part of the body, especially a weak part, firmly in position: Jim always wears a knee support when he goes running.\ndreamsquare/iStock/Getty Image Plus/GettyImages\nMore examplesFewer examplesBecause of an unusually strong current, the bridge's central support gave way, tipping a coach into the river.When restoring the building, the first priority was to underpin the exterior walls by adding wooden supports along the foundations.The mattress has hundreds of small springs to provide extra support for the back.Always provide support for the baby's head.The shelf was held in place by two brick supports.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npier\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nsinew\nunderpin\nweight-bearing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMedical dressings, supports & devices\nsupport noun\n(PROOF)\n[ U ] something that shows that a fact is true: This new evidence lends support to the theory that she was murdered. We had to send a doctor's report in support of our claim to the insurance company.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »\nsupport noun\n(PERFORMER)\n[ S or U ] a performer or band (= group of musicians) that performs before the main one in a concert or other performance: The band toured Australia in December 2001 as the support for Judas Priest. The concert will start at 8pm prompt and there is no support. Synonyms\nopener\nsupport act\nsupport band\nSMART Vocabulary: related words and phrases\nGroups of musicians\nband\nbig band\nboy band\nbrass band\nbrass section\nensemble\ngamelan\ngroup\nmarching band\noctet\npipe band\npop group\nquartet\nquintet\nrhythm section\nsupport act\nsupport band\nsymphony orchestra\ntribute band\ntrio\nSee more results »\nsupport verb [T]\n(ENCOURAGE)\nAdd to word list\nAdd to word list\nto give encouragement and approval to someone or something because you want the person or thing to succeed: The president strongly supported Egypt’s role in the negotiations.\nsupport verb [T]\n(HELP)\nto help someone or something in an emotional or practical way: My family always supported me in whatever I wanted to do. Many companies support public television very generously.\nsupport verb [T]\n(PROVIDE)\nto provide someone with money or physical things that are needed: She has to work at two jobs to support her family.\nsupport verb [T]\n(PROVE)\nto show or seem to prove something to be true: New research supports the theory.\nsupport verb [T]\n(STOP FROM FALLING)\nto hold something firmly or bear its weight, esp. from below, to stop it from falling: The pole is supported by wires.\nsupport noun\n(HELP)\n[ U ] emotional or practical help: I got a lot of support from my friends and colleagues.\nsupport noun\n(PROVIDING MONEY)\n[ U ] money or physical things that are provided to someone who needs them: The government promised financial support to the areas affected by the flooding.\nsupport noun\n(PROOF)\n[ U ] information or facts that prove something to be true; proof: He produced charts and graphs in support of his argument.\nsupport noun\n(ENCOURAGEMENT)\n[ U ] approval and encouragement given to someone or something: The senator voiced his support for making health care available to all.\nsupport noun\n(HOLDING THINGS UP)\n[ C/U ] something that holds something firmly or bears its weight, to stop it from falling: [ C ] The floor is held up by wooden supports. [ U ] You may have to use crutches for support while your ankle heals.\nAdd to word list\nAdd to word list\nto show that you agree with someone or something and want to encourage them: If your boss raises any objections, I'm willing to support you. I don't support the idea of outsourcing the work.\nto help someone, or offer help with something, when this is needed: Unfortunately the company can no longer support this software. We offer insight into how to build a service strategy to support your growth objectives. We'll do all we can to support our customers during this difficult period.\nto give a person the money they need in order to buy food and clothes and pay for somewhere to live: My starting salary wasn't enough to support a family.\nif you support an activity, you provide money for it: The drug company is supporting cancer research. I don't know how they manage to support their expensive lifestyle. We are calling on the Government to support the arts.\nto hold something firmly or carry its weight, especially from below to stop it from falling: The frame needs to be strong enough to support the engine assembly.\nto stop something from falling in value, or becoming less strong: The Bank of England has taken measures to support the pound.\nto help to show that something is true: These figures support my argument. You can't make a statement like that without any supporting documentation.\nagreement with and encouragement for an idea, group, or person: support for sb/sth There was little support for the proposal among the Board members present.in support of sth The postal workers have come out on strike in support of their pay claim. Environmental groups are fast gaining support among young people. The new legislation received widespread support.\nemotional or practical help: We are going to need a lot of support if we want to get this job done on time.support for sb/sth Is there any hope of getting financial support for the project?\nthe act of stopping something falling in value or becoming less strong: support for sth The Bank has promised support for the ailing currency.\nsomething that helps to show that something is true: support for sth These new facts gave me some support for my interpretation.in support of sth Do you have any data in support of your theory? See also\ncustomer support\nprice support\ntechnical support"}