{"id":353325,"name":"supporter","type":"noun","us_sound":"səˈpɔːr.t̬ɚ","us_link":"../audio/s/supporter.mp3","uk_sound":"səˈpɔː.tər","uk_link":"../audio/s/uksuper124.mp3","content":"Add to word list\nAdd to word list\nB2 someone who supports a particular idea, group, or person: He is one of the president's strongest supporters within industry.\nB1 UK (US fan) someone who wants a particular team to win and might show it by going to watch the team play: Thousands of supporters have travelled to London for the cup final.\nThesaurus: synonyms, antonyms, and examples\nan audienceaudienceThe audience went wild after every song she sang.viewerThe show attracts millions of viewers every week.listenerListeners tune in regularly for his cheery banter.crowdThose New Yorkers can be a tough crowd to please.houseIt's a full house tonight.spectatorThe spectators cheered when the balloon went up.\nSee more results »\nMore examplesFewer examplesHe is a declared supporter of the scheme.I'd marked her down as a Labour Party supporter, but I was completely wrong.Coventry City football club counted their millionth supporter through the gates last Saturday.She's a self-professed supporter of prison reform.She has been a stalwart supporter of the party for many years.\nSMART Vocabulary: related words and phrases\nSupporters, members & defenders\nallyship\nanti-evolution\nanti-evolutionary\nanti-evolutionist\napologist\napostle\nbooster\ncadre\ncard-carrying member\ncustodian\ndefender\nnew/fresh blood idiom\nnon-member\nnon-membership\npatroness\nprotagonist\nrecruit\nseconder\nsidekick\nupholder\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAudiences and spectators\nSpectators & commentators at sports events\nsupporter noun [C]\n(PERSON WHO HELPS)\nAdd to word list\nAdd to word list\na person who actively helps someone: Supporters of the bill expect it to pass.\nsupporter noun [C]\n(PERSON WHO ENCOURAGES)\na person who gives encouragement and approval to someone or something: He is a strong supporter of states’ rights."}