{"id":353342,"name":"suppose","type":"verb","us_sound":"səˈpoʊz","us_link":"../audio/s/suppose.mp3","uk_sound":"səˈpəʊz","uk_link":"../audio/s/uksuper129.mp3","content":"suppose verb\n(THINK LIKELY)\nAdd to word list\nAdd to word list\nA2 [ T ] to think that something is likely to be true: [ + (that) ] Dan didn't answer his phone, so I suppose (that) he's busy. He found it a lot more difficult to get a job than he supposed it would be. [ + (that) ] Do you suppose (that) Gillian will marry him? It is widely supposed (that) the CEO will be forced to resign. [ + to infinitive ] We all supposed him to be German, but in fact he was Swiss. Her new book is supposed to be (= generally people think it is) very good.\nThesaurus: synonyms, antonyms, and examples\nto believe someone or somethingbelieveCan we believe a word of what this man says?acceptMost people accept what the newspapers say as being correct.creditUK It’s hard to credit that she’s 87.swallowI personally find it hard to swallow the official narrative.buyWhen it comes to global warming, he doesn't buy it, and is out to discredit the whole theory.\nSee more results »\n[ + (that) ] used to show that you think something is true, although you wish that it were not: I suppose (that) all the tickets will be sold by now.\n[ + (that) ] used when you are annoyed: I suppose (that) you're going to be late again. I suppose (that) you think that's funny. Well, I certainly don't.\nB1 used to show unwillingness to agree: \"Can I go out tonight?\" \"Oh, I suppose so.\" [ + (that) ] I don't agree with it, but I suppose (that) it's for the best.\n[ + (that) ] used in making polite requests: I don't suppose (that) you could lend me £5 till tomorrow?\nMore examplesFewer examplesResponsibility, I suppose, is what defines adulthood.I suppose his criticism was fair comment .I suppose I could get on with the ironing while I'm waiting.I don't suppose there's any left-over pie going, is there?I didn't realize that Melanie hadn't been to college - I suppose I just took it for granted.\nSMART Vocabulary: related words and phrases\nGuessing, supposing and suspecting\napproximate\nas much idiom\nconjecture\nconsider\ndeem\ndraw\nfall\nguess\nhypothesize\nimagine\njump\njump to conclusions idiom\nmark someone down as something\nmisjudge\nmisjudgment\npresumptive\npresumptively\npresuppose\nsupposably\nsurmise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTalking angrily\nAccepting & agreeing reluctantly\nPolite expressions\nsuppose verb\n(NEED)\n[ T ] formal to expect and need: Investment of this kind supposes (= would not be possible without) an increase in the company's profits this year. See also\npresuppose\nSMART Vocabulary: related words and phrases\nBeing based on or depending on something\nas the case might be phrase\nbase something on something\nbases\nbasis\nboil down to something\nentail\nfooting\nfound\nfoundational\nground\nhinge\nrest with someone\nresult from something\nride\nride on something/someone\nrooted\nspring from something\nstrength\nunderstanding\nwake\nSee more results »\nC1 used at the beginning of a sentence or clause to mean 'what would happen if': Suppose we miss the train - what will we do then? We'd love to come and see you on Saturday, supposing (= if) I don't have to work that day.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which express a condition\nassuming (that)\nat\nat the risk of doing something idiom\nby\nceteris paribus\neven\ngranted\nif\nlest\nlong\nprovided (that)\nrisk\nunless\nwhether\nGrammar\nSupposingSupposing may be used with a conditional meaning. It can be used in first, second or third conditional sentences. The speaker invites the listener to imagine a situation: …\nSuppose, supposing and what ifWe use suppose, supposing and what if + present verb form to make suggestions about what might happen: …\nSuggestionsWe use suppose, supposing and what if + present verb form to make suggestions about what might happen: …\nPossibilityWhen we are less certain, we use suppose, supposing and what if + past form to talk about future possibility: …\nsuppose verb [I/T]\n(THINK LIKELY)\nAdd to word list\nAdd to word list\nto expect or believe: [ I ] \"Will you be going with them?\" \"Yes, I suppose (so).\" [ + (that) clause ] \"You don’t suppose (that) they forgot about meeting us, do you?\"\nSuppose can also show that you are guessing about something: [ T ] I suppose it’s about six months since I last had the brakes checked.\nsuppose conjunction\n(WHAT IF)\n(used at the beginning of a sentence or clause) what would happen if: Suppose we miss the train – what would we do then? Supposing that you had that opportunity, Mrs. Gallagher, what would you say?"}