{"id":353309,"name":"supplier","type":"noun","us_sound":"səˈplaɪ.ɚ","us_link":"../audio/s/supplier.mp3","uk_sound":"səˈplaɪ.ər","uk_link":"../audio/s/uksuper118.mp3","content":"Add to word list\nAdd to word list\nB2 [ C ] a company, person, etc. that provides things that people want or need, especially over a long period of time: supplier of They used to be a leading supplier of military equipment. He said that he had got the drugs from his usual supplier (= person who sells drugs illegally). Synonyms\npurveyor formal\nretailer\nseller\nvendor formal or specializedCompare\nacquirer mainly US specialized\nbuyer\npurchaser formal suppliers [ plural ]\na company that sells something: the suppliers I'll contact the suppliers and see if I can get the paint you want by Friday.\nSee more\nMore examplesFewer examplesHe has some cosy arrangement with his supplier, which means he's able to sell his goods more cheaply.He is out main supplier of frozen food.They are the country's main supplier of gas.Our supplier has let us down so we have no paper plates.We need to buy a load of Christmas trees - can you recommend a local supplier?\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople who sell things\nAdd to word list\nAdd to word list\na person, company, or country that provides goods of a particular kind: They are the world’s largest supplier of baby foods.\nAdd to word list\nAdd to word list\n[ C ] a company that provides a product, or the materials to make a product: supplier of sth to sb/sth The company is a supplier of software to the film industry.leading/main/key supplier They used to be a leading supplier of medical equipment. Most energy suppliers are doing well in the current economic climate.\nthe suppliers\n[ plural ] the company that sells something: I'll contact the suppliers and see if I can get the paint you want by Friday. See also\nfirst-tier supplier\npreferred supplier\nsecond-tier supplier"}