{"id":353343,"name":"supposed","type":"adjective","us_sound":"səˈpoʊzd","us_link":"../audio/s/supposed.mp3","uk_sound":"səˈpəʊzd","uk_link":"../audio/s/uksuper130.mp3","content":"supposed adjective\n(DUTY)\nbe supposed to\nAdd to word list\nAdd to word list\nB2 to have to; to have a duty or a responsibility to: The children are supposed to be at school by 8.45 a.m.\nSee more\nsupposed adjective\n(INTENDED)\nbe supposed to\nB1 to be intended to: These batteries are supposed to last for a year.\nSee more\nsupposed adjective\n(OTHERS' OPINION)\n[ before noun ] used to show that you do not believe that something or someone really is what many other people consider them to be: a supposed genius The costs of the programme outweigh its supposed benefits.\nMore examplesFewer examplesOlder people tend to be quite conservative and a bit suspicious of any supposed advances.The supposed trickle-down effect of lower taxes for the rich has not yet resulted in greater prosperity for society as a whole.The supposed advantages of city living meant nothing to him.They were all eager for a share in his supposed fortune.Her supposed good looks were legendary at the time.\nSMART Vocabulary: related words and phrases\nSeeming and purporting to be\napparent\nappear\nappearance\nas if/though idiom\nby the look(s) of things idiom\ncome across\ncome off\nformal\noutward\noutwardly\noutwardness\nparallax\npass\npass for sb/sth\nseemingly\nsemblance\nsuperficial\nsuperficiality\nsuperficially\nsurface\nSee more results »\nGrammar\nBe supposed toBe supposed to is used to talk about obligations and arrangements: …\nsupposed adjective\n(RESPONSIBLE)\nAdd to word list\nAdd to word list\n[ not gradable ] responsible: The children are supposed to be at school by 8:45 a.m.\nsupposed adjective\n(INTENDED)\nintended: These batteries are supposed to last for a year. not supposed to\nIf you are not supposed to do something you are not allowed to do it: You're not supposed to park here.\nsupposed adjective\n(CONSIDERED)\n[ not gradable ] considered by many people: Her new book is supposed to be excellent.\nbelieved by many people to be true, but not proven and often doubted by the person who is speaking or writing: Nighttime experiments demonstrated that supposed eyewitnesses could not have seen anyone clearly enough to identify them at the distances described. The cost of the plan far outweighs its supposed benefits."}