{"id":353258,"name":"supplement","type":"noun","us_sound":"ˈsʌp.lə.mənt","us_link":"../audio/s/eus74437.mp3","uk_sound":"ˈsʌp.lɪ.mənt","uk_link":"../audio/s/uksuper111.mp3","content":"Add to word list\nAdd to word list\nC2 something that is added to something else in order to improve it or complete it; something extra: The doctor said she should be taking vitamin supplements. The money I get from teaching eveningnight classes provides a supplement to my main income. We paid a supplement (= an extra amount of money) so that we could have a cabin on board the ship.\nThesaurus: synonyms, antonyms, and examples\nsomething that is addedadditionBlueberries make a delicious addition to your smoothies.additionUS The addition doesn't match the old part of the house.extensionUK They're building a new extension.add-onYou can install add-ons such as toolbars and ad blockers to this browser.accessoryYou can buy various accessories for your phone.attachmentThe tool comes with useful cutting attachments.\nSee more results »\na part of a magazine or newspaper, either produced separately or as part of the magazine or newspaper: The newspaper publishes a sports supplement every Monday.\nan extra part of a book, either produced separately or included at the end of the book, containing information that was not available when the book was first published: There is a supplement to the dictionary containing new words.\nSMART Vocabulary: related words and phrases\nAugmenting and supplementing\naccrete\naccrue\nadd\nadd something in\naddendum\naddition\nbolt\nbulk up\nextension\ngain\nhorizon\nincremental\ninterpolate\ninterpolation\nnew\ntag something on\ntop something up\ntransfuse\nweight\nwrite something into something\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBooks & parts of books\nC2 to add something to something to make it larger or better: He supplements (= adds to) his income by working in a bar at night. Some vegetarians like to supplement their diets with iron.\nSMART Vocabulary: related words and phrases\nAugmenting and supplementing\naccrete\naccrue\nadd\nadd something in\naddendum\naddition\nbolt\nbulk up\nextension\ngain\nhorizon\nincremental\ninterpolate\ninterpolation\nnew\ntag something on\ntop something up\ntransfuse\nweight\nwrite something into something\nSee more results »\nAdd to word list\nAdd to word list\nsomething that is added to something else in order to improve it or complete it; something extra: hormone/vitamin supplements\nA supplement is also an extra part of a magazine or newspaper: an advertising supplement\nto add to something: She got a second job to supplement her income.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a part of a newspaper, report, etc. that is published in addition to the main part: In this supplement we look at how companies can measure their carbon footprint. a Sunday/monthly/quarterly supplement\na medicine that contains substances that you need to stay healthy in addition to what you get in your food: dietary/nutritional/food supplements\nMARKETING an additional amount that you pay for a particular service, a better place to stay, etc.: a supplement of sth We paid a supplement of €40 for a room with a balcony.\nHR, WORKPLACE an amount that you earn in addition to your basic salary: The income from the investments supports universities by paying for scholarships and salary supplements.\nsomething that is done as an addition to an activity or process in order to improve it: a supplement to sth The measures were introduced as a supplement to the state's disaster plan.\nto add more people or things to an activity or process in order to improve it: During especially busy periods, around 175 temporary workers supplement a production workforce of 3,500. Legal controls have been supplemented by financial controls, especially over capital expenditure.\nHR, WORKPLACE to earn or receive extra money in addition to your basic salary or pension: Base pay of all executives is £125,000, supplemented by bonuses linked to individual output.supplement your income/earnings/pension They decided to use the equity in their home to supplement their income."}