{"id":353324,"name":"supported","type":"verb","us_sound":"səˈpɔːrt","us_link":"../audio/s/support.mp3","uk_sound":"səˈpɔːt","uk_link":"../audio/s/uksuper122.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nsupport\nsupport verb [T]\n(ENCOURAGE)\nB2 to agree with and give encouragement to someone or something because you want him, her, or it to succeed: My father supported the Labour Party all his life. The majority of people in the town strongly support the plans to build a new school. I think it's important to support local businesses by buying locally. [ + obj + to infinitive ] We will always do our best to support our students to succeed.\nThesaurus: synonyms, antonyms, and examples\nto say yes to a suggestion or ideaagreeI suggested they seek legal counsel and they agreed.acceptI have no choice but to accept the ruling of the court.acquiesceThe police acquiesced to the rebels' demands.assentBy signing, you assent to the terms of the contract.consentI consent to a search of my vehicle.\nSee more results »\nB1 mainly UK (US usually root for) If you support a sports team or a sports player, you want them to win, and might show it by going to watch them play: Which team do you support?\nMore examplesFewer examplesI don't support the death penalty, but if people are to be executed, it should be done humanely.The mass of the people support the government's reforms.All those who support this proposal say \"Aye\".Although I support the project in public, my private opinion is that it will fail.Her speech failed to sway her colleagues into supporting the plan.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEncouraging and urging on\nsupport verb [T]\n(HELP)\nB1 to help someone emotionally or in a practical way: Alcoholics Anonymous is a group which supports people who are trying to stop drinking too much alcohol. My family has always supported me in whatever I've wanted to do.\nMore examplesFewer examplesJudging by what he said, I think it's very unlikely that he'll be able to support your application.I thought he wasn't going to support me, but I misjudged him.Many Americans felt it was their patriotic duty to buy bonds to support the war effort.I felt a sense of betrayal when my friends refused to support me.The organization has peddled the myth that they are supporting the local population.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nbet\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick together\nsympathetic\nSee more results »\nsupport verb [T]\n(PROVIDE)\nB1 to give a person the money they need in order to buy food and clothes and pay for somewhere to live: He has a wife and four children to support.\nB2 If you support an activity or a habit, you provide the money needed to pay for it: The drug company is supporting cancer research. I don't know how they manage to support their expensive lifestyle. Some drug addicts turn to crime in order to support their habit.\nto provide the right conditions, such as enough food and water, for life: The land is so poor here that it cannot support any crops.\nMore examplesFewer examplesThe great and the good are calling on the government to support the arts.She needs a pretty high income to support her lifestyle.My starting salary as a newly qualified teacher wasn't enough to support a family.Charities depend on people supporting their activities.This play is supported by a grant from the local arts council.\nSMART Vocabulary: related words and phrases\nTrusts & funds\nannuity\nblind trust\ncovenant\nescrow\nfiduciary\nfund\ninheritance\nmutual fund\nnon-discretionary\npension fund\npension plan\nslush fund\nsuper\nsuperannuation\nsupport\nthe Consolidated Fund\ntrust\ntrustee\ntrusteeship\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBacking, supporting & defending\nPaying money\nsupport verb [T]\n(STOP FROM FALLING)\nC2 to hold something firmly or carry its weight, especially from below to stop it from falling: The church dome is supported by/on marble pillars. When babies first learn to stand, they hold on to something to support themselves (= to stop themselves from falling). My ankle is weak, so I always put a bandage on it to support it when I play tennis.figurative The Bank of England has taken measures to support the pound (= to stop it from being reduced in value).\nMore examplesFewer examplesThe frame needs to be strong enough to support the engine assembly .Use bamboo canes to support tomato plants.The stakes are pushed or hammered into the ground and can be used for marking an area, supporting a plant or forming part of a fence.Carefully tighten the clamp until it firmly supports the pipette in a vertical position.A row of reinforced concrete pillars supports the bridge.\nSMART Vocabulary: related words and phrases\nPhysical supports and supporting\nabutment\nbearing\nbolster\nbookend\nbuoy\nburden\nbuttress\ngroan\nmodillion\npier\npile\npillar\nprop\nprop something up\nrafter\nrunner\nscaffold\nsinew\nunderpin\nweight-bearing\nSee more results »\nsupport verb [T]\n(PROVE)\nC1 to help to show something to be true: These figures support my argument. You can't make a statement like that without any supporting documentation.\nSMART Vocabulary: related words and phrases\nProving and disproving\nactions speak louder than words idiom\nanti-sexist\nattest\nauthenticate\ndemonstrable\ndemonstrably\ndispel\ndisprove\ndo justice to someone/something idiom\nnon-evidence\nprobatory\nproof positive\nprovability\nprovable\nthe acid test\nverification\nverify\nvindicate\nvindication\nvindicative\nSee more results »\nsupport verb [T]\n(ACCEPT)\nUK formal to accept something and allow it to happen: The headteacher told the boys that he would not support that kind of behaviour.\nSMART Vocabulary: related words and phrases\nAllowing and permitting\nadmission\nadmit of something\nallow of something\nallowable\nauthorization\nauthorize\nclearance\nconsent\nentrance\ngiven the chance/choice idiom\ngreen-light\nhall pass\nhospital admission\nimprimatur\nliberty\nrelicense\nrelicensure\nsay-so\nsecurity clearance\nsee your way (clear) to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTolerating and enduring"}