{"id":353280,"name":"supply","type":"verb","us_sound":"səˈplaɪ","us_link":"../audio/s/supply.mp3","uk_sound":"səˈplaɪ","uk_link":"../audio/s/uksuper121.mp3","content":"Add to word list\nAdd to word list\nB2 to provide something that is wanted or needed, often in large quantities and over a long period of time: Electrical power is supplied by underground cables.supply something to someone Three people have been arrested for supplying arms to the terrorists. The company has supplied the royal family (= provided them with something they need) for years.be supplied with At the beginning of termthe semester, students are supplied with a list of books that they are expected to read.\nThesaurus: synonyms, antonyms, and examples\nto give something to someonegiveGive me that dirty plate.offerYour doctor should be able to offer advice.provideThis booklet provides useful information about local services.supplyThe lake supplies the whole town with water.donateFour hundred dollars has been donated to the school book fund.\nSee more results »\nMore examplesFewer examplesA healthy diet should supply all necessary vitamins and minerals.We supply systems for clients on the Pacific rim.The proposed tidal barrage would generate enough electricity to supply between 60 000 and 80 000 homes.All information supplied will be treated confidentially.All our electric shavers are supplied with a free travel pouch.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\n[ C or U ] an amount of something that is available for use: supply of Whenever she goes out with her baby, she always takes a large supply of baby food with her. In the capital, demand for cheap housing far outstrips supply (= what is provided). supplies B2 [ plural ]\nfood or other things necessary for living: The refugees are urgently in need of food and medical supplies.\nB2 an amount of something available: supplies of Extensive mining has reduced the supplies of coal in the area.\nSee more the gas, electricity, etc. supply\nthe system used for supplying gas, electricity, etc. to people: Someone has turned off the electricity supply.\nSee more in short supply\nIf something is in short supply, there is little of it available: Strawberries are in short supply this summer.\nSee more\nMore examplesFewer examplesThe water supply is being tested for contamination .The clinic provides a free supply of contraceptives on request.The world's supply of agricultural land is shrinking fast.If this bill is not paid within five days, your gas supply will be cut off.He seems to think that I have an endless supply of money.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nIdiom\nsupply and demand\nAdd to word list\nAdd to word list\nto provide something that is needed or wanted, or to provide someone with what the person needs or wants: Fran Gebus supplied the recipe for these muffins. The dam supplies San Francisco with water and power.\nan amount of something that is available for use: [ U ] In New York, demand for housing far outstrips supply. [ C ] Medical supplies were desperately needed in the war zone.\nAdd to word list\nAdd to word list\nPRODUCTION, COMMERCE to provide materials, or goods and services: supply sth to sb/sth They supply parts to the automotive industry. Electrical power is supplied by underground cables. We supply systems for clients on the Pacific rim.\nto give something that is needed to someone or something: supply sb/sth with sth All employees are supplied with safety equipment. They were not able to supply us with the relevant data.\n[ C or U ] an amount of something that is available for use: a supply of sth The world's supply of agricultural land is shrinking fast. We do not have an unlimited supply of money available for this project. Extensive mining has reduced the supplies of coal in the area. a limited/unlimited supply to ensure/boost/restrict the supply Across the economy, it seems that demand for viable CEO candidates exceeds supply. Compare\ndemand noun\n[ U ] the act of providing something: They have been asked to tender for the supply of cleaning materials to all the company's offices.\ngas/electricity/water supply\nthe system used for supplying gas, electricity, etc. to customers: The energy storage system tops up the peak electricity supply.\nsupplies [ plural ]\nfood or other things that are necessary for living: The refugees are urgently in need of food and medical supplies.\nthings that are necessary for a particular purpose: office supplies\nSee also\nexcess supply\ninelastic supply\nin short supply\nmoney supply"}