{"id":353655,"name":"sure","type":"adjective","us_sound":"ʃʊr","us_link":"../audio/s/shore.mp3","uk_sound":"ʃɔːr","uk_link":"../audio/s/ukshodd029.mp3","content":"Add to word list\nAdd to word list\nA2 certain; without any doubt: \"What's wrong with him?\" \"I'm not really sure.\"sure (that) I'm sure (that) I left my keys on the table.feel sure (that) I feel absolutely sure (that) you've made the right decision.seem sure (that) It now seems sure (that) the election will result in another victory for the government. Shaun isn't sure whether/if he'll be able to come to the party or not.sure of/about Is there anything you're not sure of/about?sure of We arrive early to be sure of getting a good seat. There is only one sure way (= one way that can be trusted) of finding out the truth. See also\ncocksure informal disapproving\nThesaurus: synonyms, antonyms, and examples\ncertain about somethingcertainI feel certain that this change will be for the best. know/say for certainI can't say for certain, but I think he's coming to the party.sureDon't worry - I'm sure it won't be a problem.positive\"Are you sure you let the cat in?\" \"I'm positive.\"\nSee more results »\nfor sure\nB1 certain or certainly: I know for sure that I won't be able to go to the party.\nSee more be sure of yourself\nB2 to be very or too confident: She's become much more sure of herself since she got a job.\nSee more be sure of something\nB2 be confident that something is true: He said that he wasn't completely sure of his facts.\nSee more be sure of/about someone UK (US be sure about someone)\nto have confidence in and trust someone: Henry has only been working for us for a short while, and we're not really sure about him yet.\nSee more be sure to\nC1 to be certain to: She's sure to win.\nSee more make sure (that)\nA2 to look and/or take action to be certain that something happens, is true, etc.: Make sure you lock the door when you go out.\nSee more\nIf you have a sure knowledge or understanding of something, you know or understand it very well: I don't think he has a very sure understanding of the situation.\nMore examplesFewer examplesIf you don't hear from the builders this week, make sure you chase them up.My wife checks on our elderly neighbour every few days to make sure that he's alright.I'm not sure of the chronology of events.A bit of gentle coaxing is all that's required and he'll come, I'm sure.I'm sure my views on marriage are coloured by my parents' divorce.\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsolidly\nsquarely\nwould\nyou can bet your life idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nConfidence & self-assurance\nIdioms\n(as) sure as eggs is eggs\n(as) sure as hell\na sure thing\nsure enough\nsure thing\nto be sure\nA2 certainly: \"Do you want to come swimming with us?\" \"Sure.\"mainly US \"Will you help me with this?\" \"Sure I will.\"US I sure am hungry.US \"I can't do it!\" \"Sure you can. I'll help you.\"\nUS said when someone has thanked you: \"Thanks for helping us out.\" \"Sure, any time.\"\nMore examplesFewer examplesSure I'll help you.'Are you coming to the park?' ' Sure!''Do you fancy a pizza?' 'Sure. Let's ask Andy too.'\nSMART Vocabulary: related words and phrases\nCertainty\n(as) clear as day idiom\n(as) sure as eggs is eggs idiom\nand that's flat! idiom\nassure someone of something\nassured\ndecidedly\ndeffo\ndefinite\ndefinitely\ndefinitive\nirrefutably\nmake no mistake (about it) idiom\nmistake\nnail something on\nnailed on\nsolidity\nsolidly\nsquarely\nwould\nyou can bet your life idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPolite expressions\nAdd to word list\nAdd to word list\ncertain; without any doubt: \"No more dessert for me, thank you.\" \"Are you sure?\" [ + (that) clause ] I’m sure (that) I left my keys on the table. [ + question word ] I’m not sure where they live. If there’s anything you’re not sure of/about, just ask. He said that he wasn’t completely sure of his facts (= not certain that his information was correct). We arrived early, to be sure of getting a good seat. [ + to infinitive ] She’s sure to win.\nIf you are sure of yourself, you are confident: She’s much more sure of herself since she started work. Idiom\nsure enough\ncertainly: \"Do you want to come swimming with us?\" \"Sure.\" I sure am hungry (= I am very hungry)."}