{"id":353735,"name":"surge","type":"noun","us_sound":"sɝːdʒ","us_link":"../audio/s/surge.mp3","uk_sound":"sɜːdʒ","uk_link":"../audio/s/ukseren009.mp3","content":"Add to word list\nAdd to word list\nC1 a sudden and great increase: An unexpected surge in electrical power caused the computer to crash. There has been a surge in house prices recently. Compare\nresurgence formal\nThesaurus: synonyms, antonyms, and examples\nan increaseincreaseThere has been an sharp increase in municipal taxes this year.riseLast month saw a rise in the rate of inflation.gainWe are not seeing the gains in productivity that we expected.boostWe are hoping for a boost in sales this year.\nSee more results »\na sudden and great movement forward: At the end of the game, there was a surge of fans onto the field. A tidal surge (= sudden and great rise in the level of the sea) caused severe flooding in coastal areas.\na sudden increase of an emotion: She was overwhelmed by a surge of remorse.\nMore examplesFewer examplesThe surge in the power supply knocked out all the computers.The surge in US share prices reverberated across the globe.A special system prevents the circuitry being tripped accidentally by a power surge or lightning strike.This new surge of interest in religion is perhaps a reaction to the the spiritual wasteland of the 1980s.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAdvancing and moving forward\nC1 to increase suddenly and strongly: The company's profits have surged.\nto move quickly and powerfully: An angry crowd surged through the gates of the president's palace. A few metres before the end of the race, Jenkins surged into the lead.\n(of an emotion) to develop strongly and quickly: She felt a wave of resentment surging (up) inside her.\nMore examplesFewer examplesThe dollar surged against the yen in the final half hour of trading.A feeling of love surged in his breast.Sales of these cosmetics have surged in recent months.The mob surged towards the castle.\nSMART Vocabulary: related words and phrases\nIncreasing and intensifying\naccretion\naccumulate\naccumulative\naccumulatively\nadd fuel to the fire idiom\nblaze\ncrank\ngo up\ngrowing\ngrowingly\nheighten\nhot up\ninflation\nmushroom\nramp something up\nratchet something up/down\nre-escalate\nre-escalation\nredouble\nstake\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving quickly\nMaking progress and advancing\nAdd to word list\nAdd to word list\na sudden and great increase: a surge in sales a surge in the stock market The young American’s victory touched off a surge of interest in golf across the country.\n(of a large group) to move suddenly forward: The crowd surged onto the field after the game ended.\nAdd to word list\nAdd to word list\na sudden large increase: surge in sth An unexpected surge in electrical power caused the computer to crash. There has been a surge in house prices recently. The surge in defaults has led to charges the mortgage industry engaged in predatory lending practices.\nto increase suddenly and by a large amount: The company's profits have surged.surge ahead/forward The eurozone economy surged ahead in the second quarter."}