{"id":353752,"name":"surgery","type":"noun","us_sound":"ˈsɝː.dʒər.i","us_link":"../audio/s/surgery.mp3","uk_sound":"ˈsɜː.dʒər.i","uk_link":"../audio/s/uksurge001.mp3","content":"surgery noun\n(MEDICAL OPERATION)\nAdd to word list\nAdd to word list\nB2 [ U ] the treatment of injuries or diseases in people or animals by cutting open the body and removing or repairing the damaged part: The patient had/underwent surgery on his heart. He made a good recovery after surgery to remove a brain tumour.\n[ C ] US an occasion when a medical operation involving cutting open the body is performed on someone : He has had three surgeries on his wrist in the past two years.\nMore examplesFewer examplesWith something as delicate as brain surgery, there is little margin for error .Heart surgery exacts tremendous skill and concentration.In the 1870s and 1880s, doctors began to follow the principles of antiseptic surgery.Ligatures are used in surgery to stop the flow of a bleeding artery.Without surgery, this animal will die slowly and painfully.\nSMART Vocabulary: related words and phrases\nMedical treatment: surgery\nablate\nadrenalectomy\namputation\namputee\nanaesthesiology\nanaesthetize\nharvesting\nhave something out\nhysterectomy\nimplantable\nimplantation\nincision\ninteroperative\nlaughing gas\nliposuction\nreplacement\nresected\nresection\nrhino\nrhinoplasty\nSee more results »\nsurgery noun\n(ADVICE)\nB2 [ C or U ] UK (US office) a place where you can go to ask advice from or receive treatment from a doctor or dentist: If you come to the surgery at 10.30, the doctor will see you then. On Saturday mornings, surgery (= the period of opening of the place where you can go to see your doctor) is from 9.00 to 12.00.\n[ C ] UK the regular period of time when a person can visit their Member of Parliament to ask advice: Our MP holds a weekly surgery on Friday mornings.\nSMART Vocabulary: related words and phrases\nMedical places & organizations\nA &amp; E\naccident and emergency\naid station\nbiotech\nbirth centre\nblood bank\nclinic\nconsulting room\ndispensary\ninstitutional\nmadhouse\nmaternity ward\nNICU\nNIH\nnon-hospital\nout of hours idiom\noutpatients\nPICU\nsocialized medicine\nward\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUK politics: local government & politics\nAdd to word list\nAdd to word list\nthe treatment of injuries or diseases by cutting open the body and removing or repairing the damaged part, or an operation of this type: [ U ] He had undergone open-heart surgery two years ago. [ U ] I’m recovering from back surgery, so it’s going to be awhile before I can ride a horse again. [ C ] She has undergone several surgeries and will require more.\nBr The surgery is a doctor’s office where you go to be examined. surgical adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈsɜr·dʒɪ·kəl/\nsurgical equipment/procedures"}