{"id":353837,"name":"surplus","type":"noun","us_sound":"ˈsɝː.pləs","us_link":"../audio/s/surplus.mp3","uk_sound":"ˈsɜː.pləs","uk_link":"../audio/s/uksurge016.mp3","content":"Add to word list\nAdd to word list\nC2 (an amount that is) more than is needed: The world is now producing large food surpluses. We are unlikely to produce any surplus this year. The government has authorized the army to sell its surplus weapons.UK The store is selling off stock that is surplus to requirements (= more than they need to have).\nthe amount of money you have left when you sell more than you buy, or spend less than you own: a budget/trade surplus Fortunately the company's bank account is currently in surplus.\nMore examplesFewer examplesA surplus of corn has helped depress the grain market.The chemical industry has a large and growing trade surplus.There is no surplus capacity in our transport system.We produce enough vegetables for our community, and any surplus is sold to local shops.\nSMART Vocabulary: related words and phrases\nToo much and unnecessary\nado\nbe up to your neck (in something) idiom\nbellyful\nbinge\ncarry/take coals to Newcastle idiom\ndrown\ngush\nhave your (fair) share of something idiom\nhyper\nimmoderate\nimmoderately\ninappeasable\nplay gooseberry idiom\nplenty\npleonasm\npleonastic\nplethora\nunnecessary\nunwarranted\nweigh someone/something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAmounts of money\nAdd to word list\nAdd to word list\nan amount that is more than is needed: The world is now producing large food surpluses. The government is forecasting a budget surplus this year (= all the money available to be spent will not be spent).\nA surplus is also the amount of money you have left when you sell more than you buy: a trade surplus surplus adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˈsɜr·plʌs, -pləs/\nFarmers are feeding their surplus wheat to pigs.\nAdd to word list\nAdd to word list\nan amount that is more than is needed: a surplus of sth The plant had a surplus of components.\nACCOUNTING, ECONOMICS the amount of money that you have left when you sell more than you buy, or spend less than you receive: The savings will create a surplus of a little more than $24 million. The overall gap continues to reflect a deficit in the trade of goods and a surplus in services. Compare\ndeficit\nin surplus\nused to describe a situation when a business or country has spent less money than it has received: This year the budget will be in surplus.\nSee also\nbudget surplus\nbuyer's surplus\nconsumer surplus\nstructural surplus\ntrade surplus\nmore than is needed or used: As the economy slowed, companies that had invested surplus funds in the stock market found their returns dwindling. The form of the payout of surplus cash to investors will be revealed in May."}