{"id":353849,"name":"surprise","type":"noun","us_sound":"sɚˈpraɪz","us_link":"../audio/s/surprise.mp3","uk_sound":"səˈpraɪz","uk_link":"../audio/s/uksurge017.mp3","content":"surprise noun\n(EVENT)\nAdd to word list\nAdd to word list\nA2 [ C ] an unexpected event: Don't tell Anne we've arranged a party for her - I want it to be a surprise. It was a wonderful/nasty surprise to get home and find the letter. Last night's heavy snow came as a complete surprise. You're always full of surprises (= doing unexpected things). I wish you wouldn't keep springing surprises on me (= telling me unexpected things or causing unexpected things to happen). They mounted a surprise attack at dawn. My uncle paid us a surprise visit yesterday. Compare\nshock noun (SURPRISE)\nThesaurus: synonyms, antonyms, and examples\na surprisesurpriseThe announcement that she was leaving the post was a surprise to us all.shockIt will be a terrible shock if their income is cut.kickerUS The kicker is that even after six rounds of interviews, she still wasn't a finalist for the job.a rude awakeningShe'll be in for a rude awakening when she has to pay her own bills.eye-openerHis unauthorized biography was a real eye-opener. news to meSarah is leaving? Well that's news to me.\nSee more results »\nMore examplesFewer examplesClose your eyes - I've got a surprise for you.I tried to conceal my surprise when she told me her age.Her confession was no surprise to him, - just the confirmation of a long-held suspicion.The dizzying pace of political change in the country caught many people by surprise.The people showed no surprise or anger at their treatment.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namaze\namazing\namazingly\nastonish\nblinding\ndumbfounding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\npull\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nstagger\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings of surprise and amazement\nsurprise noun\n(FEELING)\nB2 [ U ] the feeling caused by something unexpected happening: He looked at her in/with surprise. To my great surprise, they agreed to all our demands.\nSMART Vocabulary: related words and phrases\nFeelings of surprise and amazement\namazement\nastonishment\nbewilderment\nfuture shock\nincredulity\nshock\nstupefaction\nwonder\nwonderment\nIdiom\nsurprise, surprise\nB1 to make someone feel surprise: The news surprised everyone. [ + that ] It doesn't surprise me that their parents don't want them to get married. [ + to infinitive ] It will not surprise anyone to learn that the offer has been rejected. [ + question word ] Janet was surprised how quickly the time passed.\nto find, catch, or attack someone when they are not expecting it: The robbers had just opened the safe when they were surprised by the police. [ + -ing verb ] His mother surprised him helping himself to her gin.\nMore examplesFewer examplesIt won't surprise you to learn that she has left the company.They surprised their father by cleaning the house from top to bottom.Their generosity surprised me.It often surprises people that we don't charge money for our service.I wanted to surprise my parents, so I turned up with my hair dyed black.\nSMART Vocabulary: related words and phrases\nSurprising and shocking\nagainst all expectations phrase\namaze\namazing\namazingly\nastonish\nblinding\ndumbfounding\ndumbfoundingly\ndynamite\nearth-shaking\nearth-shattering\npull\npull something out of the bag/hat idiom\nraise (a few) eyebrows idiom\nreality check\nsensationalist\nstagger\nwalk\nwalk in on someone\nworld-shattering\nSee more results »\nAdd to word list\nAdd to word list\nan unexpected event, or the feeling caused when something unexpected happens: [ C ] Don’t tell Ann we’re having a party for her – I want it to be a surprise. [ C ] Last night’s heavy snow came as a complete surprise. [ U ] To my great surprise, they gave us everything we asked for. surprise adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/sərˈprɑɪz, sə-/\nThe basketball player paid a surprise visit to the campus on Thursday.\n(of an event you did not expect) to cause you to feel excitement over a sudden discovery: She surprised a lot of tennis fans by winning the Canadian Open.\nIf you say that you are not surprised or would not be surprised if something happened, you mean that you almost expect it: I’m not surprised that their parents don’t want them to get married. I would not be surprised to see the economy slow down next year.\nTo surprise someone is also to find the person unexpectedly: She jumped out and surprised her sister, who ran out into the hall."}