{"id":353890,"name":"surrender","type":"verb","us_sound":"səˈren.dɚ","us_link":"../audio/s/surrender.mp3","uk_sound":"sərˈen.dər","uk_link":"../audio/s/uksurge026.mp3","content":"surrender verb\n(ACCEPT DEFEAT)\nAdd to word list\nAdd to word list\nC2 [ I ] to stop fighting and admit defeat: They would rather die than surrender (to the invaders).\n[ I ] If you surrender to an experience or emotion, you stop trying to prevent or control it: I finally surrendered to temptation, and ate the last piece of chocolate.\nMore examplesFewer examplesThe rebels' ammunition is almost finished and it is only a matter of time before they surrender.After their defeat in battle, the soldiers surrendered.They laid down their weapons and surrendered.The troops in front of us either surrendered or offered only token resistance.\nSMART Vocabulary: related words and phrases\nStopping fighting\nanti-militarist\nanti-militaristic\narm\narmistice\nbeat/turn swords into ploughshares idiom\nceasefire\ndemilitarization\ndemilitarize\nfall\nfall back\nlay\nlay something down\nnon-combat\npacification\npacify\npull\npull back\npullout\nsword\ntruce\nYou can also find related words, phrases, and synonyms in the topics:\nAccepting & agreeing reluctantly\nsurrender verb\n(GIVE)\n[ T ] to give something that is yours to someone else because you have been forced to do so or because it is necessary to do so: The police demanded that the gang surrender their weapons. Neither side is willing to surrender any territory/any of their claims.\nSMART Vocabulary: related words and phrases\nGiving, providing and supplying\naccommodate\naccommodate someone with something\naccord\nadminister\nadministration\narm someone with something\ndish\nhand off\nhand something down\nhand something in\nhand something out\nhand something over\ninvest\noutfit\nreassign\nreassignment\nrebid\nregift\nregive\nspare\nSee more results »\nthe act of stopping fighting and officially admitting defeat: The rebels are on the point of surrender.\nSMART Vocabulary: related words and phrases\nStopping fighting\nanti-militarist\nanti-militaristic\narm\narmistice\nbeat/turn swords into ploughshares idiom\nceasefire\ndemilitarization\ndemilitarize\nfall\nfall back\nlay\nlay something down\nnon-combat\npacification\npacify\npull\npull back\npullout\nsword\ntruce\nsurrender verb\n(ACCEPT DEFEAT)\nAdd to word list\nAdd to word list\n[ I ] to stop fighting and accept defeat: They would rather die than surrender.\nsurrender verb\n(GIVE)\n[ T ] to give something that is yours to someone else, usually because you have been forced to do so: U.S. Magistrate Celeste Bremer restricted Gruenwald’s travel and ordered that he surrender his passport.\nan agreement to stop fighting and accept defeat: [ C ] Robert E. Lee’s surrender, which ended the Civil War, was one of the most important events in American history.\nAdd to word list\nAdd to word list\nto give up something or control over something: Generally, the amount paid by the lessee to surrender the lease will be liable to capital gains tax. Britain may be forced to surrender at least some of its voting power in the IMF.surrender sth to sb He was granted bail, on condition that he surrender his passport to the authorities.\nINSURANCE to end an insurance policy early, before its original end date: Policy-holders who need to dispose of their policies can see if they would do better to sell rather than surrender the policy.\nFINANCE to lose value: Yesterday on the money markets the euro surrendered its earlier gains against the dollar.\nthe act of giving up something, or giving control of something to someone else: The penalty for early surrender of pensions remains at 25%. The union was forced into a surrender of some recent gains in the latest round of negotiations.\nINSURANCE the act of ending an insurance policy early, before its original end date: You will have to pay a fee for the early surrender of your policy."}