{"id":353962,"name":"survival","type":"noun","us_sound":"sɚˈvaɪ.vəl","us_link":"../audio/s/survival.mp3","uk_sound":"səˈvaɪ.vəl","uk_link":"../audio/s/uksurro013.mp3","content":"Add to word list\nAdd to word list\nB2 [ U ] the fact of a person, organization, etc. continuing to live or exist: The doctors told my wife I had a 50/50 chance of survival. His main concern is to ensure his own political survival. England are fighting for survival (= trying not to be defeated) in this game.\n[ C ] something that has continued to exist from a previous time: Most of these traditions are survivals from earlier times.\nMore examplesFewer examplesHumans, he argues, are amoral and what guides them is not any sense of morality but an instinct for survival.Two months ago, results from a European study questioned whether early treatment with the drug really improved survival.Fish struggle for survival when the water level drops in the lake.The survival of whales is intimately bound up with the health of the ocean.What are her chances of survival?\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThings remaining\ncontinuing to exist or wanting to continue to exist: We all have a strong survival instinct. The survival rate for people who have this form of cancer is now more than 90 percent.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nAdd to word list\nAdd to word list\nthe state of continuing to live or to exist, esp. after a dangerous event: Doctors told my wife I had a 50/50 chance of survival. Idiom\nsurvival of the fittest\nAdd to word list\nAdd to word list\nthe state of continuing to exist, and not to fail or be destroyed: His main concern is to ensure his own political survival. The survival of the company in such difficult economic times is very uncertain.\nsurvival of the fittest\nthe idea that only the strongest can succeed: Unfettered competition has led to survival of the fittest, with a few large companies reaping huge profits while small companies have been driven out of business."}