{"id":353940,"name":"survey","type":"noun","us_sound":"ˈsɝː.veɪ","us_link":"../audio/s/survey_01_00.mp3","uk_sound":"ˈsɜː.veɪ","uk_link":"../audio/s/uksurro009.mp3","content":"survey noun [C]\n(QUESTIONS)\nAdd to word list\nAdd to word list\nB2 an examination of opinions, behaviour, etc., made by asking people questions: A recent survey found/revealed/showed that 58 percent of people did not know where their heart is. to conduct/carry out/do a survey\nMore examplesFewer examplesThe survey is only concerned with women of childbearing age.In the survey politicians came out overwhelmingly in favour of capital punishment.We are conducting a survey to find out what our customers think of their local bus service.The survey found no correspondence between crime and unemployment rates.The findings of this survey are demonstrative of the need for further research.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nthe third degree idiom\ntrick question\nSee more results »\nsurvey noun [C]\n(EXAMINING)\nthe measuring and recording of the details of an area of land: a geological survey\na description of the whole of a subject: His new book is a survey of European theatre in the 19th century.\nUK (US and Australian English inspection) an examination of the structure of a building by a specially trained person\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMaps & map-making\nDefining & explaining\nAnalysing and evaluating\nsurvey verb\n(LOOK AT)\nC1 [ T ] formal uk\nYour browser doesn't support HTML5 audio\n/səˈveɪ/ us\nYour browser doesn't support HTML5 audio\n/ˈsɝː.veɪ/ to look at or examine all of something, especially carefully: He got out of the car to survey the damage. She has written a book which surveys (= describes in detail) the history of feminism. Synonyms\ncheck (EXAMINE)\ncheck something out (EXAMINE) informal\nexamine (LOOK AT CAREFULLY)\ninspect\nperuse formal\nscan (LOOK)\nstudy (EXAMINE)\n[ T ] uk\nYour browser doesn't support HTML5 audio\n/səˈveɪ/ us\nYour browser doesn't support HTML5 audio\n/ˈsɝː.veɪ/ to measure an area of land, and to record the details of it, especially on a map: Before the new railway was built, its route was carefully surveyed.\n[ T often passive ] UK uk\nYour browser doesn't support HTML5 audio\n/səˈveɪ/ us\nYour browser doesn't support HTML5 audio\n/ˈsɝː.veɪ/ (US and Australian English inspect) If a building is surveyed, it is examined carefully by a specially trained person, in order to discover if there is anything wrong with its structure.\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncorner\ndiscern\nfix\nglare\nglass\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMeasuring & weighing\nMaps & map-making\nAnalysing and evaluating\nsurvey verb\n(QUESTIONS)\nC1 [ T ] uk\nYour browser doesn't support HTML5 audio\n/ˈsɜː.veɪ/ us\nYour browser doesn't support HTML5 audio\n/ˈsɝː.veɪ/ to ask people questions in order to find out about their opinions or behaviour: The researchers surveyed the attitudes of 2,500 college students. Many of the listeners surveyed said that they were not satisfied with the station's programming.\nSMART Vocabulary: related words and phrases\nQuestioning people & asking questions in general\nask after someone\nask questions of someone/something idiom\nbe someone's for the asking idiom\nbeat\nbeat something out of someone\nbombard\nconsultative\ninquire within idiom\ninterviewer\nply someone with something\npoll\npry\nput someone through the mill idiom\nput someone through the wringer idiom\nput someone to something idiom\nQ, q\nrhetorical question\nroll\nthe third degree idiom\ntrick question\nSee more results »\nIdiom\nlord/master/mistress/king/queen of all you survey\nsurvey noun [C]\n(QUESTIONS)\nAdd to word list\nAdd to word list\na set of questions people are asked to gather information or find out their opinions, or the information gathered by asking many people the same questions: A recent survey found that working women want better child care and flexible hours.\nsurvey noun [C]\n(MEASURING)\nthe measuring and recording of the details of an area of land: Geological surveys are an important tool used in locating oil reserves.\nsurvey noun [C]\n(EXAMINING)\na description of the whole of a subject: His new book is a survey of contemporary Latin American architecture.\nsurvey verb [T]\n(LOOK AT)\nto look at or examine all of something: After we’d finished painting the kitchen, we stood back and surveyed our work.\nsurvey verb [T]\n(MEASURE)\nto measure and describe the details of an area of land: The property must be surveyed before you can buy it.\nsurvey verb [T]\n(ASK QUESTIONS)\nto ask people questions in order to find out about their opinions and behavior: Researchers surveyed the political opinions of 2000 college students.\nAdd to word list\nAdd to word list\nMARKETING an examination of people's opinions, behaviour, etc. made, for example, by asking them questions: a survey finds/reveals/shows A survey of 584 companies has found that there is no relationship between a company's sales incentive plan structure and its gain or loss in market share.conduct/carry out/do a survey We should conduct a survey to find out what our customers really want.\nPROPERTY the measuring and recording of the details of an area of land: A detailed survey of the building plot has already been carried out.\nPROPERTY\n&#160; UK (US inspection) an examination of the structure of a building by a specially trained person to check what condition it is in: We should schedule an independent survey of the property before we agree to buy it. The survey revealed a number of problems that will have to be repaired.\nMARKETING to ask people questions in order to find out about their opinions or behaviour: The researchers surveyed the attitudes of 2,500 night shift workers.\nto look at or examine all of something in detail: She has written a book which surveys the history of the PR industry.\nPROPERTY to measure an area of land and to record the details of it: The land will have to be surveyed in detail before the building project can begin.\nPROPERTY\n&#160; UK (US inspect) when a building is surveyed, it is examined carefully by a specially trained person, to see what condition it is in: We had the house surveyed."}