{"id":353969,"name":"survive","type":"verb","us_sound":"sɚˈvaɪv","us_link":"../audio/s/survive.mp3","uk_sound":"səˈvaɪv","uk_link":"../audio/s/uksurro014.mp3","content":"Add to word list\nAdd to word list\nB2 [ I or T ] to continue to live or exist, especially after coming close to dying or being destroyed or after being in a difficult or threatening situation: The baby was born with a heart problem and only survived for a few hours. These plants cannot survive in very cold conditions. None of Shakespeare's plays survives in its original manuscript form. The family are struggling to survive on very little money. The front passengers were lucky to survive the accident. The chairman of the board succeeded in surviving the challenge to his authority. \"How are you?\" \"Oh, (I'm) surviving (= life is satisfactory, but not very good).\"\n[ T ] to continue to live after someone, especially a member of your family, has died: He is survived by his wife and four children.\nMore examplesFewer examplesThere's only a fifty-fifty chance that she'll survive the operation.Friendless and jobless, he wondered how he would survive the year ahead.Fugitive families who have fled the fighting in the cities are now trying to survive in the mountains.A large amount of money will have to be injected into the company if it is to survive.A small dog had somehow managed to survive the fire.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nAdd to word list\nAdd to word list\nto continue to live or to exist, esp. after a dangerous event: [ I ] The baby was born with a defective heart and survived for only a few hours. [ T ] The building survived the earthquake with little damage.\nIf someone is survived by family members, those family members are still alive when that person dies: [ T ] He is survived by his wife and two children.\nAdd to word list\nAdd to word list\nto continue to exist, and not to fail or be destroyed: The family is struggling to survive on a very reduced income. A large amount of money will have to be injected into the company if it is to survive. The director succeeded in surviving the challenge to his authority.\nINSURANCE, LAW to live longer than someone else: If the wife survives the husband, she will be entitled to a share of his pension. The booklet gives details on how to claim benefits for a surviving spouse."}