{"id":353978,"name":"survivorship","type":"noun","us_sound":"sɚˈvaɪ.vɚ.ʃɪp","us_link":"../audio/s/cdo0623ussurv3935.mp3","uk_sound":"səˈvaɪ.və.ʃɪp","uk_link":"../audio/s/cdo0623uksurv3961.mp3","content":"survivorship noun [U]\n(IN LAW)\nAdd to word list\nAdd to word list\nlaw\n&#160; specialized When two people own a property together and one of them dies, survivorship is the legal right of the survivor (= the person who is still living) to own the property: If two people purchase a home together and one dies, the contract would grant the remaining person survivorship. Joint tenancy of the property provides the right of survivorship, and in this case is available only to a husband and wife.\nMore examplesFewer examplesWhen a property is owned by joint tenants with rights of survivorship, the assets automatically pass to the survivor.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInheriting & bequeathing\nCourt cases, orders & decisions\nsurvivorship noun [U]\n(BIOLOGY)\nbiology\n&#160; specialized the number of a particular type of plant or animal that lives to a given age: In recent years, the survivorship of the African elephant has improved quite dramatically. This year’s late rain has not seriously affected the survivorship and performance of the 610 rice varieties on the farm.\nthe fact or condition of being a survivor (= a person who continues to live, despite nearly dying), especially from a disease such as cancer: cancer survivorship He set up the foundation to raise awareness about issues related to cancer survivorship. I was involved in planning the memorial from the beginning, partly because of my survivorship.\nMore examplesFewer examplesThere isn't any evidence to suggest that creating more habitat reserves will alter adult owl survivorship.We now know a lot more about cancer survivorship and what survivors can do to improve their health and quality of life.There is support available to help you through every stage: diagnosis, treatment, and survivorship.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRecovering from illness\nRelated word\nsurvivor"}