{"id":353964,"name":"survivalist","type":"noun","us_sound":"sɚˈvaɪ.vəl.ɪst","us_link":"../audio/s/cdo0319ussurv1695.mp3","uk_sound":"səˈvaɪ.vəl.ɪst","uk_link":"../audio/s/epd26992.mp3","content":"Add to word list\nAdd to word list\nsomeone who practises survivalism (= preparing for future emergencies by, for example, collecting large amounts of food and learning how to live outdoors): In the movie he plays a would-be survivalist who has supposedly retreated from the world to live in the woods.\nMore examplesFewer examples The meal-in-a-pouch military rations are being marketed to campers, survivalists and bachelors.The film-maker goes in search of the weird and wonderful universe of survivalists, flat-earthers, and end-of-the-world prophets.Many people think of a survivalist as an armed loner with extreme views, but there are many more in America who are simply involved in preparing for lean times, or disaster.The story was relocated to a survivalists' camp in modern America.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\npreparation\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\ntune\nSee more results »\nrelating to people who practise survivalism (= preparing for future emergencies by, for example, collecting large amounts of food and learning how to live outdoors): survivalist groups He told his lawyers that his views were influenced by the survivalist movement.\nMore examplesFewer examplesHomer is paired with Mr Burns on a survivalist team-building exercise.His parents were fugitives from a doomsday survivalist cult.I read an interesting article about a rise in the number of survivalist communities cropping up around the country.\nSMART Vocabulary: related words and phrases\nPreparing\nbatten\nbatten down the hatches idiom\nbreak someone in\nbug-out bag\nbuild (someone/something) up\ndig\nget/have your ducks in a row idiom\ngird\ngird yourself idiom\ngo bag\ngrab bag\nlay\npreparation\nroll up your sleeves idiom\nset something up\nset the scene/stage idiom\nsuit\nsuit up\ntee\ntune\nSee more results »"}