{"id":353975,"name":"survivor","type":"noun","us_sound":"sɚˈvaɪ.vɚ","us_link":"../audio/s/survivor.mp3","uk_sound":"səˈvaɪ.vər","uk_link":"../audio/s/uksurro016.mp3","content":"Add to word list\nAdd to word list\nB2 a person who continues to live, despite nearly dying: He was the sole (= only) survivor of the plane crash. She's a cancer survivor/a survivor of cancer.\na person who is able to continue living their life successfully despite experiencing difficulties: He's one of life's survivors. a survivor of child abuse\nUS A person's survivors are the members of his or her family who continue to live after he or she has died.\nMore examplesFewer examplesOne survivor described his torturers as devils incarnate.The sole survivor of the accident was found in the water after six hours.A ceasefire has been called to allow the survivors to bury their dead.The earthquake survivors are in desperate need of help.Rescue teams searched among the wreckage for survivors.\nSMART Vocabulary: related words and phrases\nLife and living\nalive\nanimate\nborrow\ncheat\ncheat death idiom\nco-exist\ncradle\nhold\nimmortal\nlast out\nlife cycle\nlife expectancy\nlife form\nlife history\nraise\nraise someone from the dead idiom\nrevenant\nsocial life\nstay alive\nsubsist\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nInheriting & bequeathing\nAdd to word list\nAdd to word list\na person who continues to live, esp. after a dangerous event: He was the sole survivor of the crash. Business is bad, but she’s a survivor, she’ll deal with it.\nA survivor is also a person who continues to live after a close relative dies: Her survivors include two children and five grandchildren.\nAdd to word list\nAdd to word list\na person or organization that continues to exist, especially after suffering difficulties: Only the most careful small businesses will remain as survivors of the city's economic crisis.\nINSURANCE, LAW a person who continues to live after someone else has died: The life insurance benefits will be paid out to the survivor by check."}