{"id":354026,"name":"suspend","type":"verb","us_sound":"səˈspend","us_link":"../audio/s/suspend.mp3","uk_sound":"səˈspend","uk_link":"../audio/s/uksurro024.mp3","content":"suspend verb\n(STOP)\nAdd to word list\nAdd to word list\nC1 [ T ] to stop something from being active, either temporarily or permanently: The ferry service has been suspended for the day because of bad weather. The country's president has suspended the constitution and assumed total power. When you go to the theatre, you have to be willing to suspend disbelief (= to act as if you believe that what you are seeing is real or true, although you know that it is not). I'm suspending judgment (= not forming an opinion) on the book I'm reading until I've finished it. Mr Young was given a six-month jail sentence, suspended for two years (= if he commits another crime within two years, he will have to go to prison for six months for his original crime).\nThesaurus: synonyms, antonyms, and examples\nto cancel somethingcancelSorry, I have to cancel our plans tonight.call offThe game has been called off because of the weather.offThe meeting's off because James is ill.scrapWe've scrapped our plans for a trip to France.suspendThe ferry service has been suspended for the day because of bad weather.postponeWe've postponed the wedding until next year.\nSee more results »\nB2 [ T ] If someone is suspended from work, school, etc., they are temporarily not allowed to work, go to school, or take part in an activity because of having done something wrong: She was suspended from school for fighting. He was suspended for four games after arguing with the referee.\nMore examplesFewer examplesHostilities were suspended during the talks.When he suspended the constitution and dissolved Congress, he had the imprimatur of the armed forces.Flights were suspended pending an investigation of the crash.It was bedlam at the football ground after the match was suspended.Flights to Paris were suspended.\nSMART Vocabulary: related words and phrases\nCancelling and interrupting\nadjourn\nadjourn to somewhere\narrest\nbreak\ncall someone/something off\ncancellable\ndiversion\nhalt\nin midstream idiom\ninterrupt\nkick\nkick something into touch idiom\nrain\nscratch\nscrub\nshut\nshut (something) off\nsuspensive\ntake a break\nuncancelled\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot going to school\nsuspend verb\n(HANG)\n[ T usually + adv/prep ] to hang: The builders worked on wooden platforms, suspended by ropes from the roof of the building. It was very uncomfortable lying on the hospital bed with my legs suspended in the air.\n[ T usually + adv/prep ] If small pieces of solid material are suspended in a gas or a liquid, they hang or float in the gas or liquid: The drug is suspended in a saline solution. A cloud of smoke was suspended in the air.\nSMART Vocabulary: related words and phrases\nHanging and suspending\nbe dripping with something idiom\ncascade\ndangle\ndangly\ndrape\ndrip\ndroop\ndroopingly\ndroopy\nfall\nflow\nhang\nhung\npendant\npendent\nrehang\nsag\nsaggy\nstring\nstring someone up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhysical & chemical processes\nsuspend verb\n(STOP)\nAdd to word list\nAdd to word list\n[ T ] to stop doing an activity: Relief agencies suspended aid yesterday.\n[ T ] A person who is suspended from a job, school, or an activity is not allowed to be involved in it, usually as a punishment: Two students were suspended for damaging school property.\nsuspend verb\n(HANG)\n[ T always + adv/prep ] to hang down from something: The lights were suspended from long cords.\nAdd to word list\nAdd to word list\nto stop something, either temporarily or permanently, from happening or continuing: The group's shares were suspended at 199p while the takeover deal was finalized.suspend production/service/trading The Stock Exchange will suspend trading in the group's shares if they do not secure financing over the next two weeks.suspend accounts/payments If users ignore messages warning them not to download files illegally, their accounts could be suspended. indefinitely/permanently/temporarily suspended\nHR, POLITICS if an organization suspends an employee or member, it temporarily stops them from working or from being a member, often because they have done something wrong: suspend sb from sth/doing sth She was suspended from her £150,000-a-year job for six months. Pakistan was suspended from the Commonwealth for failing to lift emergency rule by the deadline.be suspended for 6 days/2 weeks/3 months, etc. Mr Morris, who has been suspended for a year, expects to return to his job after a meeting of governors. The director was suspended on full pay pending the outcome of the investigation.\nLAW to give someone a punishment, especially a prison sentence, that will not be carried out if they do not do anything else illegal within a particular period: She was given an 18-month suspended sentence for her part in the fraud. He pleaded guilty and was given a 12-month sentence suspended for 12 months."}