{"id":354065,"name":"suspicious","type":"adjective","us_sound":"səˈspɪʃ.əs","us_link":"../audio/s/suspicious.mp3","uk_sound":"səˈspɪʃ.əs","uk_link":"../audio/s/uksurro030.mp3","content":"suspicious adjective\n(SEEM GUILTY)\nAdd to word list\nAdd to word list\nB2 making you feel that something illegal is happening or that something is wrong: Her behaviour was very suspicious. The fire at the bank is being treated as suspicious. It's a little suspicious that no one knows where he was at the time of the murder. There were some suspicious characters hanging around outside. There's a suspicious-looking van parked at the end of the street. His new book bears a suspicious resemblance to a book written by someone else. (= His book is so similar to the other book that it seems as if he has copied it.)\nMore examplesFewer examplesShe died in suspicious circumstances.The public were warned to be on the alert for suspicious packages.There was something furtive about his behaviour and I immediately felt suspicious.His reticence about his past made them very suspicious.He looks very suspicious hanging around by the bins - I'm sure he's up to something.\nSMART Vocabulary: related words and phrases\nStrange, suspicious and unnatural\naberrant\naberrantly\nabnormal\nabnormally\nadd\nfreakishly\nfreakishness\nfunnily\nfunnily enough idiom\nghostliness\nperv\nperverse\nperversely\nperversity\nperverted\nunearthly\nunhealthily\nunorthodox\nwack\nwackadoodle\nSee more results »\nsuspicious adjective\n(DOUBT)\nB2 feeling doubt or no trust in someone or something: His colleagues became suspicious (= thought that there was something wrong) when he did not appear at work, since he was always punctual. They are deeply/highly (= very) suspicious of one another/of each other's motives. My mother has a very suspicious nature (= does not trust people).\nMore examplesFewer examplesOlder people tend to be quite conservative and a bit suspicious of any supposed advances.She allowed that she might have been too suspicious.Of course I'm telling the truth - you've got such a suspicious mind!I was becoming increasingly suspicious of his motives.We became suspicious when the letter did not arrive.\nSMART Vocabulary: related words and phrases\nSuspecting & questioning\nask questions of someone/something idiom\ncall into question idiom\nchallenge\nchallengingly\ncynic\ncynical\ncynically\ncynicism\ndoubt\ndoubter\nfisking\nmisgiving\nquery\nreserve\nsceptical\nskeptic\nskeptically\nsuspected\nsuspiciously\nunchallengeable\nSee more results »\nsuspicious adjective\n(FEELING DOUBT)\nAdd to word list\nAdd to word list\nfeeling doubt or a lack of trust: Many of the workers were suspicious of the labor agreement.\nsuspicious adjective\n(FEELING SOMEONE IS GUILTY )\nmaking you feel that something illegal is happening or that something is wrong: Last night’s fire at the bank is being treated as suspicious. Neighbors were asked if they had noticed anything suspicious."}