{"id":354043,"name":"suspension","type":"noun","us_sound":"səˈspen.ʃən","us_link":"../audio/s/suspension.mp3","uk_sound":"səˈspen.ʃən","uk_link":"../audio/s/uksurro028.mp3","content":"suspension noun\n(STOP)\nAdd to word list\nAdd to word list\n[ U ] the act of stopping something happening, operating, etc. for a period of time: The suspension of fighting is to take effect at 6 a.m. on Monday. There have been calls for the drug's immediate suspension, following reports that it has dangerous side effects.\n[ C or U ] a punishment in which a person is temporarily not allowed to work, go to school, or take part in an activity: The union is protesting about the suspension of a restaurant worker. The player is likely to receive a three-game suspension following an incident in yesterday's game.\nMore examplesFewer examplesThere were calls for the suspension of parliament.The suspension of hostilities allowed both sides to come to the negotiating table.Staff are furious about a suspension of their flexible working scheme.The school allows a partial suspension of its rules on the last day of term.\nSMART Vocabulary: related words and phrases\nPauses & interludes\nabeyance\nadjournment\nasynchronously\nbreak\nbreak-journey\ncaesura\ncomfort stop\nhiatus\nhold something in abeyance\nin abeyance\ninterlude\nintermission\ninterval\nmoratorium\nnon-continuous\none-stop\npause\nplateau\npostponement\nstoppage\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot going to school\nsuspension noun\n(VEHICLE)\n[ U ] equipment attached to the wheels of a vehicle that reduces the uncomfortable effects of going over road surfaces that are not even\nSMART Vocabulary: related words and phrases\nThe engine & engine parts\nair filter\nalternator\nanti-roll\nantifreeze\nbiting point\nbrake\ncam\ncarburation\ncarburettor\nchoke\ndisc brake\ndistributor\ninternal combustion engine\nmanual transmission\nmuffler\nneutral\nplug\ntailpipe\ntappet\nwater-cooled\nSee more results »\nsuspension noun\n(LIQUID)\n[ C ] a liquid in which small pieces of solid are contained, but not dissolved: a suspension of fine cornflour in corn oil\nSMART Vocabulary: related words and phrases\nPhysical & chemical processes\nabsorbable\nabsorptive\nabsorptive capacity\nabsorptivity\nacidification\ndegradable\nexcitability\nexcitation\nexcite\nexergonic\nexothermic\nexothermic reaction\nimpregnate\nre-emission\nre-emit\nreabsorb\nreact\nreboil\nscald\nvaporize\nSee more results »\nAdd to word list\nAdd to word list\nthe act of making someone leave a job or school or stop doing an activity, usually as a punishment: [ C ] Stevens will begin his three-day suspension Tuesday. [ U ] Students who are warned twice may face suspension.\nAdd to word list\nAdd to word list\nan act of stopping something from happening or continuing either temporarily or permanently: suspension of sth Suspension of foreign economic aid would have a crippling effect on the country. The group has seen the value of its shares fall by more than 95% in the six months leading up to last week's suspension of trading. indefinite/permanent/temporary suspension\nHR an act of temporarily stopping an employee from working, often because they have done something wrong: two-week/six-month/one-year, etc. suspension She intends to appeal against her six-month suspension."}