{"id":354087,"name":"sustainable","type":"adjective","us_sound":"səˈsteɪ.nə.bəl","us_link":"../audio/s/ussurin022.mp3","uk_sound":"səˈsteɪ.nə.bəl","uk_link":"../audio/s/uksuspi005.mp3","content":"Add to word list\nAdd to word list\nC1 able to continue over a period of time: That sort of extreme diet is not sustainable over a long period. Solutions put in place now must be sustainable.\nC1 environment\n&#160; specialized causing, or made in a way that causes, little or no damage to the environment and therefore able to continue for a long time: A large international meeting was held with the aim of promoting sustainable development in all countries. The website encourages sustainable fashion through swapping.\nMore examplesFewer examplesIt would not be sustainable in the long term.The restructuring is key to any sustainable recovery.We must improve the built environment through sustainable design and greener buildings.Developing environmentally sustainable products and services requires significant research.\nSMART Vocabulary: related words and phrases\nLasting for a long time\nall-night\nancient\nbe going strong idiom\nchangeless\ndateless\nfull time\nimmemorial\nimmemorially\nincorruptibility\nincorruptible\nlong-time\nlongevity\nman and boy idiom\nnever-ending\nnondurable\nsustainedly\ntime-consuming\ntimeless\ntimelessly\ntimelessness\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnvironmental issues\nZoology: zoos & wildlife reserves\nRelated word\nsustainability\nAdd to word list\nAdd to word list\nable to be maintained or continued: The growth momentum is likely to be sustainable into next year. sustainability noun [ U ] us/səˌsteɪ·nəˈbɪl·ɪ·t̬i/\nWe remain committed to ensuring sustainability of our social security system.\nAdd to word list\nAdd to word list\nable to continue at the same level for a period of time: Marketing plays a key role in a company's plan for sustainable business development.sustainable/growth/success/value The question of how to achieve long-term sustainable growth in shareholder value is re-emerging.\nENVIRONMENT, NATURAL RESOURCES using methods that do not harm the environment so that natural resources are still available in the future: The ethical brand donates 10% of profits to support sustainable development. sustainable communities/energy sources"}