{"id":354086,"name":"sustain","type":"verb","us_sound":"səˈsteɪn","us_link":"../audio/s/sustain.mp3","uk_sound":"səˈsteɪn","uk_link":"../audio/s/uksuspi003.mp3","content":"sustain verb [T]\n(CONTINUE)\nAdd to word list\nAdd to word list\nC2 to cause or allow something to continue for a period of time: The economy looks set to sustain its growth into next year. He seems to find it difficult to sustain relationships with women.US The judge sustained (= accepted) the lawyer's objection.\nC2 to keep alive: The soil in this part of the world is not rich enough to sustain a large population.\nMore examplesFewer examplesIt proved particularly difficult to sustain the interest of the older children.This year's harvest is insufficient to sustain a growing population.Economic growth cannot be sustained without a rise in inflation.This planet is unable to sustain human or plant life.The team were finally victorious after a sustained effort to succeed.\nSMART Vocabulary: related words and phrases\nPreserving and saving\naspic\nco-processing\nconserve\ndeliverer\ndocumentalist\ndocumentarily\nlifeguard\nreclaim\nrecycle\nrecycled\nrenewal\nreprieve\nrescue\nrescuer\nreusable\nunadopted\nunappropriated\nunassigned\nundesignated\nupcycle\nSee more results »\nsustain verb [T]\n(SUFFER)\nformal to suffer or experience, especially damage or loss: She sustained multiple injuries in the accident. Most buildings sustained only minimal damage in the earthquake. The company has sustained heavy losses this year.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\ntaste\nSee more results »\nsustain verb [T]\n(SUPPORT)\nto support emotionally: She was sustained by the strength of her religious faith. The love of my family and friends sustained me through my ordeal.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nsustain verb [T]\n(MAINTAIN)\nAdd to word list\nAdd to word list\nto keep something in operation; maintain: It is hard to see what will sustain them when they have no income.\nsustain verb [T]\n(SUFFER)\nfml to suffer or experience damage or loss: She sustained serious injuries in the accident.\nsustain verb [T]\n(SUPPORT)\nto support someone emotionally: Throughout the ordeal, he was sustained by the belief that he would get home.\nAdd to word list\nAdd to word list\nto make or allow something to continue for a period of time: The board accepted that the growth rates could not be sustained indefinitely.\nto experience loss, injury, or damage: As a result of the oil spill, BP sustained heavy losses. The port sustained severe damage in the storm.\nto provide support for an idea, statement, legal argument, etc.: The data meant the government could not sustain its argument that lower duty on fuel would lead to lower spending on schools and hospitals. Only in one case could the auditors find evidence to sustain a claim of criminal behaviour."}