{"id":354395,"name":"swap","type":"verb","us_sound":"swɑːp","us_link":"../audio/s/swap.mp3","uk_sound":"swɒp","uk_link":"../audio/s/uksuspi027.mp3","content":"Add to word list\nAdd to word list\nC1 to give something and be given something else instead: When you've finished reading your book, and I've finished mine, can we swap? We swapped addresses with the people we met on holiday. When he got a job in a bank, he had to swap his jeans and T-shirt for a suit (= he had to wear formal clothes instead of informal ones). [ + two objects ] I'll swap you my chocolate bar for your peanuts. We spent the evening swapping (= telling each other) stories/jokes. Synonyms\nexchange\ntrade (EXCHANGE)\nMore examplesFewer examplesWould you mind swapping those plates over?We swapped houses during the children's school holidays.Do you want to swap places?If you prefer to sit next to Chris, I'll swap seats with you.They've swapped their old car for a much larger one.\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nan exchange, or something that is going to be or has been exchanged: I thought Sam's lunch looked better than mine, so we did a swap.UK This comic is a swap (= something that was exchanged) that I got from Nick. Synonyms\nexchange (GIVING AND GETTING)\ntrade Compare\nbarter noun\nSMART Vocabulary: related words and phrases\nReplacing and exchanging\nalternate\nalternatively\nbargain something away\nbehalf\nchange over\nmake up for something\nname\nnovate\npart exchange\npinch-hit\nrefresh\nshoe\nsing\nsomeone's answer to someone/something idiom\nspare\nsubstitutable\nsubstitution\nsubstitutive\nsucceed\nsuccession\nSee more results »\nAdd to word list\nAdd to word list\nto exchange one thing for another: [ T ] The two computers can easily swap data. swap noun [ C ] us\nYour browser doesn't support HTML5 audio\n/swɑp/\nThey proposed a straight swap of food for tools.\nAdd to word list\nAdd to word list\nFINANCE to exchange one investment for another: Lenders agreed to swap part of Eurotunnel's £8.8 billion debt for shares.\nFINANCE to exchange payments on a loan in one currency for those in another: The county will swap its variable-rate interest payments for the certainty of a fixed rate payment.\nto exchange something you have for something else: John and Marla agreed to swap offices.swap sth for sth Most consumers said they wouldn't swap the product for a cheaper own-label brand.swap sth with sb Do you want to swap seats with me?\nFINANCE a situation in which one investment is exchanged for another: Many investors carry out debt-for-equity swaps.\nFINANCE a situation in which payments on a loan in one currency are exchanged for those in another: A firm that wants a US dollar loan can arrange with a firm that wants a floating rate Yen loan for an interest rate swap.\na situation in which someone exchanges something they have for something else: Her boss suggested they do a job swap for a day.\nSee also\ncurrency swap\ndebt-equity swap\ninterest rate swap\ncredit default swap"}