{"id":354506,"name":"sweat","type":"noun","us_sound":"swet","us_link":"../audio/s/sweat.mp3","uk_sound":"swet","uk_link":"../audio/s/ukswast009.mp3","content":"sweat noun\n(LIQUID)\nAdd to word list\nAdd to word list\nB2 [ U ] the clear, salty liquid that you pass through your skin: dripping with/pouring with sweat The dancers were dripping with/pouring with sweat after a morning's rehearsal.covered in sweat By the time we'd climbed to the top of the hill, we were covered in sweat.bead of sweat She wiped the beads (= drops) of sweat from her forehead.figurative The cathedral was built by human toil and sweat (= effort).\nedelmar/E+/GettyImages\nMore examplesFewer examplesThe athletes were drenched in sweat.The sweat was pouring down her face by the end of the race.Beads of sweat stood out on his forehead.I can feel trickles of sweat running down my neck.He sat down and wiped the sweat off his forehead.\nSMART Vocabulary: related words and phrases\nAnimal physiology: bodily fluids & their production\nbilirubin\nbodily fluid\nbogy\nbooger\nbucket\ndribbling\ngob\nlather\npus\nsaliva\nsalivation\nsemen\nserous\nslag\nslobber\nslobbery\nsnotty\nspittle\nsputum\nsweatily\nSee more results »\nsweat noun\n(CLOTHES)\nsweats [ plural ] US (UK tracksuit)\na loose top and trousers, worn either by people who are training for a sport or exercising, or as informal clothing: Sweats are certainly comfortable, but you can get bored with wearing them every day.\nSee more See also\nblood, sweat, and tearsIdioms\nget in a sweat\nno sweat\nsweat verb\n(PRODUCE LIQUID)\nB2 [ I ] to pass sweat through the skin because you are hot, ill, or frightened: It was so hot when we arrived in Tripoli that we started to sweat as soon as we got off the plane.sweat with The prisoners were sweating with fear.sweat like a pig informal I was so afraid, I was sweating like a pig (= sweating a lot).\n[ I ] If something sweats, it produces drops of liquid on the outside: sweat with The walls in older houses sometimes sweat with damp.\nMore examplesFewer examplesSomeone who is suffering from sunstroke feels dizzy and has a high temperature, but does not sweat.It was my first interview and I was sweating buckets.This jumper always makes me sweat.The heating was turned up so high that I was beginning to sweat.We were sweating buckets sleeping under a really thick duvet.\nSMART Vocabulary: related words and phrases\nAnimal physiology: bodily fluids & their production\nbilirubin\nbodily fluid\nbogy\nbooger\nbucket\ndribbling\ngob\nlather\npus\nsaliva\nsalivation\nsemen\nserous\nslag\nslobber\nslobbery\nsnotty\nspittle\nsputum\nsweatily\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWet weather & wetness\nsweat verb\n(WORK HARD)\n[ I ] to work very hard to achieve something: Volunteers sweated to get the room ready for the dance.\nSMART Vocabulary: related words and phrases\nSucceeding, achieving and fulfilling\nA game\naccomplish\nachieve\nacquit\nactualize\nbear\nget to/reach first base idiom\ngo (like/down) a bomb idiom\ngo far idiom\ngo from strength to strength idiom\ngo into orbit idiom\ngrade\nkill\nrise\nscale the heights idiom\nscrape through (something)\nsew something up\nslam dunk\nsmash it idiom\nstand out\nSee more results »\nsweat verb\n(WORRY)\n[ T ] mainly US informal to worry about something: He is a great boss, focused on managing the big picture and rarely sweating the details. don't sweat it!\nmainly US informal used to tell someone not to worry about something: Can't make the gig? Don't sweat it; you'll have plenty more chances.\nSee more sweat the small stuff\nmainly US informal to worry about things that are not important: don't sweat the small stuff Be positive, don't sweat the small stuff, and stop doing things you don't like.\nSee more\nSMART Vocabulary: related words and phrases\nAnxious and worried\n(all) hot and bothered idiom\naflutter\nagitated\nangsty\nanxious\nfrightened\nfuss\nget in a sweat idiom\ngoosey\ngrim\npreoccupied\nprey\nprey on sb's mind idiom\nprey on something\nqueasily\nwired\nworried\nworriedly\nworrier\nworrywart\nSee more results »\nIdioms\nmake someone sweat\nsweat blood\nsweat bullets\nsweat it outPhrasal verb\nsweat over something\nAdd to word list\nAdd to word list\nto excrete a salty, colorless liquid through the skin, esp. when you are hot or frightened: He was sweating profusely.\nIf something sweats, it has drops of liquid on the outside: The soda cans sweat in this humidity.\nYou may say you sweat if you feel worried: We have to sweat about money because we don’t have much of it.\nthe salty, colorless liquid that you excrete through your skin: beads of sweat\nSweat is also effort or work: They lived off the sweat and toil of others."}