{"id":354499,"name":"swear","type":"verb","us_sound":"swer","us_link":"../audio/s/swear.mp3","uk_sound":"sweər","uk_link":"../audio/s/ukswast008.mp3","content":"swear verb\n(USE RUDE WORDS)\nAdd to word list\nAdd to word list\nB2 [ I ] to use words that are rude or offensive as a way of emphasizing what you mean or as a way of insulting someone or something: It was a real shock, the first time I heard my mother swear. When the cab driver started to swear at him, he walked away.\nMore examplesFewer examplesPlease don't swear in front of the children.I swear quite a lot but even I draw the line at saying certain words.He was so angry he forgot himself and swore loudly.We could hear him cursing and swearing as he tried to get the door open.He was sent off for swearing at the referee.\nSMART Vocabulary: related words and phrases\nSwearing and blasphemy\nblaspheme\nblasphemous\nblasphemously\nC-word\ndamn\neffing\nfour-letter word\nimprecation\noath\nprofane\nstrong\nstrong language phrase\nswear like a trooper idiom\nswear word\nsworn\nthe air is blue idiom\nthe F-word\ntrooper\nwash\nwash your mouth out (with soap/soapy water) idiom\nSee more results »\nswear verb\n(PROMISE)\nB2 [ I or T ] to promise or say firmly that you are telling the truth or that you will do something or behave in a particular way: I don't know anything about what happened, I swear (it). [ + (that) ] You might find it difficult to believe, but I swear (that) the guy just came up to me and gave me the money.UK informal She swore blind (= promised definitely) (that) she didn't know what had happened to the money. [ + to infinitive ] New gang members must swear to obey the gang leaders at all times. In some countries, witnesses in court have to swear on the Bible. I swore an oath to tell the truth, the whole truth, and nothing but the truth. A few of us knew what was going to happen, but we were sworn to secrecy (= we were made to promise to keep it a secret). I think his birthday is on the 5th, but I wouldn't/couldn't swear to it (= I am not completely certain about it).\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nMore examplesFewer examplesHe swore he would avenge his brother's death.He swore he'd pay her back for all she'd done to him.Soldiers must swear allegiance to the Crown.I swear to God I didn't know about it.I want you to swear that you will never try to see her again.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nvow\nwarranty\nSee more results »\nGrammar\nSwearing and taboo expressionsSwear words and taboo words can intensify what is said, but they can shock or give offence. Swearing and the use of taboo words and expressions is quite common in speaking. We often hear and use it both in private and in public settings and in films, on television and on the radio. …\nPhrasal verbs\nswear by something\nswear someone in\nswear off something"}