{"id":354747,"name":"swindle","type":"verb","us_sound":"ˈswɪn.dəl","us_link":"../audio/s/swindle.mp3","uk_sound":"ˈswɪn.dəl","uk_link":"../audio/s/uksweet022.mp3","content":"Add to word list\nAdd to word list\nto get money dishonestly from someone by deceiving or cheating them: They swindled local businesses out of thousands of dollars. The wealthy banker was ultimately convicted of swindling investors. Synonyms\ncheat\ncon informal\ndefraud\ndiddle (TRICK) informal\ngyp US informal old-fashioned\nrook old-fashioned informal\nThesaurus: synonyms, antonyms, and examples\nto deceive someonedeceiveThe cigarette companies deceived the public about the health risks of cigarettes.deceive yourselfYou'd be deceiving yourself if you believed that.trickShe felt they had tricked her into saying more than she intended.foolYou don't fool me with your innocent act.take inThey claimed to be destitute, but we weren't taken in.pull the wool over someone's eyesI'm not stupid. You can't pull the wool over my eyes like that.\nSee more results »\nMore examplesFewer examplesHe accused the government of swindling taxpayers.Henry can't help seducing and swindling everyone he meets.The conman swindled thousands of euros from travellers after spinning them sob stories about his dead wife.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimpersonation\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nnobble\npyramid scheme\nsiphon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCheating & tricking\nRelated word\nswindler\na situation in which someone gets money dishonestly from another person by cheating them: Fraud squad officers are investigating a £5.6 million swindle. He masterminded a massive swindle involving $750 million in loans. Synonyms\ncon (TRICK) informal\nfraud (CRIME)\nMore examplesFewer examplesHe made his fortune by way of a major swindle.He pleaded guilty to conspiring to launder money from a complicated stock swindle.Federal authorities have been tracking what they describe as a brazen swindle of some of New York's savviest investors.\nSMART Vocabulary: related words and phrases\nFraud & corruption\nanti-bribery\nanti-corruption\nanti-counterfeiting\nanti-fraud\nAugean\nbribe\ndark money\ndefalcation\ndefraud\ndolus\nembezzle\nimpersonation\nimposture\ninsider dealing\nlaunder\nmalfeasance\nmalpractice\nnobble\npyramid scheme\nsiphon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCheating & tricking\nAdd to word list\nAdd to word list\nto cheat or trick someone in order to get money from them: swindle sb out of sth A Web-based company swindled customers out of $15 million. Compare\ncon verb swindler noun [ C ]\nVictims of the swindler are seeking up to £80 million in damages.\nthe action of cheating or tricking someone in order to get money from them: He masterminded a hi-tech swindle that emptied customers' bank accounts. Compare\ncon noun"}