{"id":354834,"name":"swirl","type":"verb","us_sound":"swɝːl","us_link":"../audio/s/swirl.mp3","uk_sound":"swɜːl","uk_link":"../audio/s/ukswipe002.mp3","content":"Add to word list\nAdd to word list\n[ I or T, usually + adv/prep ] to move quickly with a twisting, circular movement, or to make something do this: The fog swirled thickly around us. Swirl a little oil around the frying pan. Synonym\neddy\n[ I ] If ideas or stories about somebody or something swirl, they are often heard but may not be based on fact or may not always say the same thing: Rumours have swirled for years that he is on the point of retiring. Much of the controversy that swirls around her ignores the actual content of her work. Compare\nspread verb\nMore examplesFewer examplesThick cigar smoke swirled as the men drank whisky.The overflowing river swirled around them.Try swirling some cream into scrambled eggs.Accusations swirled around Washington last week of partisan vendettas and turf wars. Already, speculation is swirling that the company is a takeover target.Conflicting reports have swirled around the status of the Secretary of State.\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\nbleed\ncounter-stream\ndecant\ndrainage\ndrip\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirling\ntop something up\ntrickle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRevolving, rotating and spinning\nGossip and rumour\nthe act of moving quickly with a twisting, circular movement, or something that moves in this way: With a swirl of his black cloak, he leaves the stage. The truck went by in a swirl of dust. Synonym\neddy\na twisting, circular shape: A swirl of cream will make a dish look more fancy. The green plastic has a black swirl pattern set over the top. Compare\nspiral noun\n/GettyImages\nthe sharing and repeating of ideas or stories about somebody or something that may not be true: The swirl of rumours and speculation never stopped.\nMore examplesFewer examplesThere was a sudden swirl of wind.the swirl of a dust devilGarnish each serving of soup with a swirl of yogurt.She wears a pair of cowboy boots decorated with pink swirls.The report is a swirl of half-truths.The real woman has been all but forgotten in the swirl of tabloid speculations.\nSMART Vocabulary: related words and phrases\nRevolving, rotating and spinning\naround\naround and around idiom\nbackspin\nbirl\ncentrifugal\ncircuit\nrevolving\nrotary\nrotate\nrotation\nrotative\nspan\nspin\nswim\nswing\ntwirl\ntwirling\ntwirly\nunderspin\nwheel round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPatterns and shapes\nGossip and rumour\nAdd to word list\nAdd to word list\nto move quickly with a twisting circular movement, or to cause something to move this way: [ I ] Snowflakes swirled down from the sky. [ I ] fig. Accusations continue to swirl around him. [ T ] I swirled cocoa through the dough. swirl noun [ C ] us\nYour browser doesn't support HTML5 audio\n/swɜrl/\nWe arrived in a swirl of jet fumes."}