{"id":354859,"name":"switch","type":"noun","us_sound":"swɪtʃ","us_link":"../audio/s/switch.mp3","uk_sound":"swɪtʃ","uk_link":"../audio/s/ukswipe006.mp3","content":"switch noun\n(DEVICE)\nAdd to word list\nAdd to word list\nB1 [ C ] a small device, usually pushed up or down with your finger, that controls and turns on or off an electric current: a light switch Can you flip the switch?\nartpartner-images/The Image Bank/GettyImages switches [ plural ] US (mainly UK points)\na place on a railway track where the rails (= metal bars on which the trains travel) can be moved to allow a train to change from one track to another: The train rattled as it went over the switches.\nDinodia Photo/Corbis NX/GettyImages\nMore examplesFewer examplesYou turn the television on by flipping the switch at the side.Mysteriously, the light came on, although no one was near the switch.An additional power switch for the radio is handily located next to the steering wheel.She flicked the on-off switch.All these machines operate at the flick of a switch.\nSMART Vocabulary: related words and phrases\nElectrical switches & connections\nadapter\nclicker\ncoaxial\ncorded\ndimmer\ndimmer switch\njunction box\noutlet\noverride\npatch\npatch someone through\npause\nplug\nplug (something) in/plug (something) into something\nplug-in\npowerbank\nshaver point\nspark plug\nswitchboard\nterminal\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRailways & railway lines\nswitch noun\n(CHANGE)\n[ C ] a sudden or complete change, especially of one person or thing for another: When did the writer make the switch from fiction to non-fiction? The switch to new accounting software greatly improved the organization's bookkeeping.\nSMART Vocabulary: related words and phrases\nChange and changes\nadjustment\nalteration\nanti-evolutionism\nbe ahead of the curve idiom\nblip\nevolutionism\nflatten\nflip-flop\nfluctuation\ngyrate\nreinterpretation\nretransformation\nreversal\nreversion\nrevolution\nunsteady\nuntick\nvariation\nvicissitudes\nyouthquake\nSee more results »\nswitch verb [T, I usually + adv/prep]\n(DEVICE)\nB1 to use a switch to change a device from one state or type of operation to another: switch the TV off/on\nMore examplesFewer examplesAre you positive that you saw me switch the iron off?By toggling this key, you can switch the italics on and off.Could you switch on the radio?She switched to another channel to watch the football.The computer takes a few seconds to power up after it's been switched on.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nswitch verb [T, I usually + adv/prep]\n(CHANGE)\nB2 to change suddenly or completely, especially from one thing to another, or to exchange by replacing one person or thing with another: She started studying English, but switched to History in her second year. In 1971, Britain switched over (= changed completely) to a decimal currency. After the bank robbery, the gang switched cars (= left one car and got into another).\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nMore examplesFewer examplesThe robbers switched the painting for a fake.We used to have oil-fired central heating, but now we've switched to gas.Many European countries have now switched over to the Euro.He's decided to switch the meeting from Monday to Thursday.Will you switch shifts with me on Friday?\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nPhrasal verbs\nswitch off\nswitch something on\nswitch out something\nswitch up\nswitch something up\nswitch noun [C]\n(DEVICE)\nAdd to word list\nAdd to word list\na device that controls an electric current and turns it on or off: Flip a switch and the coffee makes itself.\nswitch noun [C]\n(STICK)\na thin stick that bends easily and is used esp. for hitting animals\nswitch noun [C]\n(CHANGE)\na sudden or complete change from one thing to another, or an exchange of one person or thing for another: The team made a switch to a smaller, quicker lineup.\nswitch verb [I/T]\n(CHANGE)\nto change suddenly or completely from one thing to another, or to exchange one person or thing with another: [ T ] Jeff decided to switch his major from engineering to medicine. [ I ] I used to have tapes, but I switched to CDs. Idiom\nswitch gearsPhrasal verbs\nswitch on/off something\nswitch over\nAdd to word list\nAdd to word list\na complete change of one thing for another: a switch from/to sth The switch to a flat rate of tax could boost spending. Banks are encouraging customers to make the switch from paper to electronic statements.\nCOMMUNICATIONS, IT a piece of equipment in a network that receives electronic data and sends it to the right place\na small part or object that you move or press to make a light come on, make a machine start working, etc.: press/flick the switch\nSee also\nbait-and-switch\n[ I or T ] to change from one thing, system, etc. to another, or make something do this: switch to sth Internet users should consider switching to a web-based bank.switch from sth to sth The charity has switched from TV advertising to direct mail.switch provider(s)/supplier(s) You could save money by switching energy suppliers. The report found that only about 6% of current account customers switch banks each year. switch brand/mortgage/service See also\npacket switching Phrasal verb\nswitch sth off/on"}