{"id":354868,"name":"switched","type":"verb","us_sound":"swɪtʃ","us_link":"../audio/s/switch.mp3","uk_sound":"swɪtʃ","uk_link":"../audio/s/ukswipe006.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nswitch\nswitch verb [T, I usually + adv/prep]\n(DEVICE)\nB1 to use a switch to change a device from one state or type of operation to another: switch the TV off/on\nMore examplesFewer examplesAre you positive that you saw me switch the iron off?By toggling this key, you can switch the italics on and off.Could you switch on the radio?She switched to another channel to watch the football.The computer takes a few seconds to power up after it's been switched on.\nSMART Vocabulary: related words and phrases\nElectricity & electronics\nanodize\nanti-static\narc\nbitstream\nbrownout\ncapacitance\nchargeable\nelectricity\nhigh-voltage\nhoming\ninduction\ninsulating tape\nlinesman\nmagnet\nmultimeter\nnegatively\nnon-electric\nnon-electrical\nnon-electronic\nsolid-state\nSee more results »\nswitch verb [T, I usually + adv/prep]\n(CHANGE)\nB2 to change suddenly or completely, especially from one thing to another, or to exchange by replacing one person or thing with another: She started studying English, but switched to History in her second year. In 1971, Britain switched over (= changed completely) to a decimal currency. After the bank robbery, the gang switched cars (= left one car and got into another).\nThesaurus: synonyms, antonyms, and examples\nto make differentchangeShe'll always be like that - you can't change her.alterWe've had to alter our plans.varyTry to vary the children's diet a little.convertWe're going to convert the spare bedroom into an office.turn intoThere are plans to turn his latest book into a film.transformThe riverside area has been transformed into a shopping and sports complex.\nSee more results »\nMore examplesFewer examplesThe robbers switched the painting for a fake.We used to have oil-fired central heating, but now we've switched to gas.Many European countries have now switched over to the Euro.He's decided to switch the meeting from Monday to Thursday.Will you switch shifts with me on Friday?\nSMART Vocabulary: related words and phrases\nChanging\nabout-face\nabout-turn\nalterable\naltered\nalternate\nchurn\ndisturb\ndrip\nmeta\nmetamorphose\nmodulate\nmodulation\nmorph\nmove on\npervert\nsanitization\nsemi-domesticated\nshake someone out of something\nshake someone up\nstead\nSee more results »\nPhrasal verbs\nswitch off\nswitch something on\nswitch out something\nswitch up\nswitch something up"}