{"id":354948,"name":"swoop","type":"verb","us_sound":"swuːp","us_link":"../audio/s/swoop.mp3","uk_sound":"swuːp","uk_link":"../audio/s/ukswipe020.mp3","content":"Add to word list\nAdd to word list\nto move very quickly and easily through the air, especially down from a high position in order to attack: The eagle swooped down to snatch a young rabbit.\ninformal to make a sudden attack on a place or group of people in order to surround and catch them: Undercover police swooped on three houses in the city at 5.00 this morning.\nSMART Vocabulary: related words and phrases\nMovement through the air\nairborne\nbuoyantly\nbuzz\nflight\nflit\nfloat\nfly\nglide\nhover\nlevitate\nlevitation\nmid-air\nnon-flying\nsoar\nsoaring\nsomersault\nswishy\nwaft\nwheel\nwing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoving quickly\nAttacking & invading\ninformal an occasion when a place is suddenly attacked in order to surround or catch someone: He was arrested in an early morning swoop on his home. Anti-terrorist police launched a massive swoop on suspected terrorist cells.\nthe act of moving quickly and easily through the air, especially down from a high position in order to attack: The bird lifted off for a graceful swoop below the ridge top.\nMore examplesFewer examplesThe king's men made a swoop on Bernard, who narrowly escaped. There was a swoop by hundreds of riot police on opposition protesters attempting to hold a rally.I saw the graceful swoop of a condor above the ridge.He snatched up the keys with a swoop of his hand.\nSMART Vocabulary: related words and phrases\nMoving quickly\nagility\nbeetle\nbob up\nbowl down/along something\ncareen\ngallop\ngun\nleg\noutrush\noutsail\npelt\nrush\nscamper\nscoot\nscorch\nscrabble\nshoot\nstampede\nton\ntrot\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAttacking & invading\nMovement through the air\nAdd to word list\nAdd to word list\nto move quickly in a smooth path, esp. through the air: Swarms of birds swooped down from the sky. swoop noun [ C ] us\nYour browser doesn't support HTML5 audio\n/swup/\nHe lifted the baby up in one swoop."}