{"id":331058,"name":"symbol","type":"noun","us_sound":"ˈsɪm.bəl","us_link":"../audio/s/cymbal.mp3","uk_sound":"ˈsɪm.bəl","uk_link":"../audio/s/ukcyber021.mp3","content":"Add to word list\nAdd to word list\nB2 a sign, shape, or object that is used to represent something else: A heart shape is the symbol of love. The wheel in the Indian flag is a symbol of peace. Compare\nemblem\nKevinop/iStock/Getty Image Plus/GettyImages\nsomething that is used to represent a quality or idea: Water, a symbol of life, recurs as an image throughout her poems.\na number, letter, or sign used in mathematics, music, science, etc.: The symbol for oxygen is O.\nAn object can be described as a symbol of something else if it seems to represent it because it is connected with it in a lot of people's minds: The private jet is a symbol of wealth.\nMore examplesFewer examplesFor many people the horseshoe is a symbol of good luck.The Berlin Wall was a potent symbol of the Cold War.The red cross symbol was painted on each side of the vehicle.He described sport as a symbol of peace and a means of promoting fraternity between nations.The symbol © shows that something is protected by copyright.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nSOS\nstatus symbol\nthe all-clear\ntorch\ntotem pole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFigurative use of language\nGrammar\nSymbols and typographic conventions. …\nAdd to word list\nAdd to word list\nanything used to represent something else, such as a sign or mark, a person, or an event: Five interlocking rings is the symbol of the Olympic games. She’s a symbol of hope for people living with this condition.\nSymbols are used in mathematics, music, and science and also have various practical uses: The symbol on this label means that the shirt is washable. symbolic adjective us\nYour browser doesn't support HTML5 audio\n/sɪmˈbɑl·ɪk/\nThe Oval Office in the White House has come to be regarded as symbolic of the presidency. symbolically adverb us/sɪmˈbɑl·ɪk·li/\nAdd to word list\nAdd to word list\na sign, shape, or object that is used to represent something else: The Nike tick is an instantly recognizable symbol.\nsomething that shows someone's position in society: The BlackBerry and the iPhone, initially symbols of high status, have become popular choices in the marketplace. Owning a car has become a symbol of success in China's main cities.\nSTOCK MARKET →\nticker\nSee also\nstatus symbol"}