{"id":331077,"name":"symbolist","type":"noun","us_sound":"ˈsɪm.bəl.ɪst","us_link":"../audio/s/usswitc026.mp3","uk_sound":"ˈsɪm.bəl.ɪst","uk_link":"../audio/s/uksybar022.mp3","content":"Add to word list\nAdd to word list\na writer or an artist connected with symbolism (= a type of art and literature developed in the late 19th century that tries to express ideas or states of mind rather than represent the real world): He was an eccentric symbolist who painted colourful but sinister scenes from ancient mythology. The French Symbolists were his principal poetic model.\nMore examplesFewer examplesHis influences included symbolists as well as the American abstract expressionists. Klimt was regarded as a minor Austrian symbolist at that time.What preoccupied the Symbolists was myth and the symbolism of gods, heroes, elves and fairies.\nSMART Vocabulary: related words and phrases\nPeople who write for work or pleasure\nautobiographer\nbelletrist\nblogger\nBraillist\nchronicler\ncolumnist\ncorrespondent\nhumorist\npoet laureate\nsatirist\nscribbler\nscribe\nscriptwriter\nscrivener\nShakespeare\nsongwriter\nspeechwriter\nstenographer\nstylist\ntweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArtists\nrelating to symbolism (= a type of art and literature developed in the late 19th century that tries to express ideas or states of mind rather than represent the real world) or to artists or writers connected with it: Adolphe Monticelli was a symbolist painter. symbolist poets\nMore examplesFewer examplesHölderlin's difficult symbolist poetry has been revalued this century. He links his work to symbolist artists such as Arnold Bocklin.His portraits depict figures connected to the symbolist movement of the late 19th century.\nSMART Vocabulary: related words and phrases\nPhilosophy\naesthete\naesthetic\naesthetically\nanthropocentric\nanthropocentrism\nessentialism\nexistential\nexistentialism\nexistentialist\nexistentialistic\nnon-deterministic\nnon-philosophical\nnotional\nontological\nontologically\nsolipsistically\nspatio-temporal\nspatiotemporally\nsuperorganic\nsupersensible\nSee more results »"}