{"id":331225,"name":"sympathetic","type":"adjective","us_sound":"ˌsɪm.pəˈθet̬.ɪk","us_link":"../audio/s/sympathetic.mp3","uk_sound":"ˌsɪm.pəˈθet.ɪk","uk_link":"../audio/s/uksybar027.mp3","content":"sympathetic adjective\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\nB2 used to describe someone who shows, especially by what they say, that they understand and care about someone else's suffering: He suffers from back trouble too, so he was very sympathetic about my problem. She just needed someone who would lend a sympathetic ear to her (= listen to her in a kind and understanding way) once in a while. Opposite\nunsympathetic\nThesaurus: synonyms, antonyms, and examples\ncalm and nice to othersgentleShe's so sweet and gentle with the children.mildHer grandmother is such a kind, mild person.mild-manneredHe's a mild-mannered diplomat known for his measured responses to crisis. genteelThey're lovely, genteel people who sent flowers when her father passed away.wouldn't hurt a flyOh, she's so nice, she wouldn't hurt a fly.\nSee more results »\nIf a character in a book or film is sympathetic, they are described or shown in such a way that you are able to understand the character's feelings, with the result that you like them: She comes across as a more sympathetic character in the movie.\nMore examplesFewer examplesYou'd think his children would be more sympathetic towards him after all he's gone through .She tried to use a sympathetic tone of voice.Never having been ill himself, he wasn't a sympathetic listener.I tried to tell her about the awful day I'd had, but she wasn't very sympathetic.Claire's always one to lend a sympathetic ear if you have problems.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nrelate\nsensitivity\nsympathize\nsympathy\ntoo bad idiom\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmpathy and sensitivity\nLiterature\nsympathetic adjective\n(SUPPORT)\nC2 agreeing with or supporting: The party is considered to be sympathetic to/towards welfare reform. Did he give your proposal/complaints a sympathetic hearing?\nMore examplesFewer examplesThe current government are very sympathetic towards environmental issues.The former president was considered sympathetic to the nationalist cause.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nflag-waving\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nreinforce\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nSee more results »\nRelated word\nsympatheticallyGrammar\nNice or sympathetic?Nice is an adjective meaning ‘pleasant’, ‘enjoyable’ or ‘satisfactory’: …\nsympathetic adjective\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\nshowing, esp. by what you say, that you understand and care about someone’s problems or suffering: He suffers from back trouble too, so he was sympathetic.\nA sympathetic character in a book or movie is one whose actions are understandable and who is therefore likable.\nsympathetic adjective\n(SUPPORTING)\nshowing your support and agreement: We are sympathetic to that point of view and have the same goals."}