{"id":331227,"name":"sympathetically","type":"adverb","us_sound":"ˌsɪm.pəˈθet̬.ɪ.kəl.i","us_link":"../audio/s/usswitc028.mp3","uk_sound":"ˌsɪm.pəˈθet.ɪ.kəl.i","uk_link":"../audio/s/uksybar028.mp3","content":"sympathetically adverb\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\nin a way that shows you understand and care about someone else's suffering: She listened sympathetically, nodding her head now and again.\nIf a character in a book or film is shown sympathetically, they are described or shown in such a way that you are able to understand the character's feelings, with the result that you like them: The character is sympthetically portrayed.\nMore examplesFewer examplesI go up to her and say sympathetically, \"You must be very hot and uncomfortable.\" Towards the end of the book, the authors seem to portray her more sympathetically, as a victim.The sympathetically drawn characters must deal with the types of tragedies every family endures - which makes their story resonate.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nrelate\nsensitivity\nsympathetic\nsympathize\nsympathy\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEmpathy and sensitivity\nLiterature\nsympathetically adverb\n(SUPPORT)\nin a way that shows you agree with or support someone or something: Their request was dealt with sympathetically. See\nsympathetic\nMore examplesFewer examples I want three things for him: a school where he will flourish, where faith traditions will be treated sympathetically, and where he will receive education of a high standard.He had put his case openly, and it had been treated sympathetically, without any detailed investigation.McIntyre is hoping their case will be dealt with sympathetically.\nSMART Vocabulary: related words and phrases\nBacking, supporting & defending\nadopt\nadvocacy\naffirmation\nally yourself to/with someone\nargumentation\nbadge\nbailout\nchampion\nkeep the flag flying idiom\npatronage\nrecommended\nred carpet\nreinforce\nright behind someone idiom\nroll out the red carpet idiom\nroot\nroot for someone\nstick\nstick together\nsympathetic\nSee more results »\nsympathetically adverb\n(STYLE)\nin a style that is suitable, goes well with other things that are in the same place, and considers the feelings and needs of people who use that place: The house has been sympathetically restored.\nMore examplesFewer examplesAfter a fire in the 1960s the pub was sympathetically restored. Barns can be sympathetically transformed for a range of uses.Windows were replaced with more sympathetically proportioned ones in softwood, painted blue. Concert halls, arts centres or community centres, if sympathetically designed, can be important landmarks.\nSMART Vocabulary: related words and phrases\nEmpathy and sensitivity\nattuned\ncommune\ncommunicate\ncommunion\ncompathy\nemotional intelligence\nempathically\nempathize\nempathy\nidentify\nidentify with someone\nput\nself-communion\nself-discovery\nsensitive\nsensitively\nsensitiveness\ntheory of mind\nunderstand\nunderstanding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture"}