{"id":331234,"name":"sympathy","type":"noun","us_sound":"ˈsɪm.pə.θi","us_link":"../audio/s/sympathy.mp3","uk_sound":"ˈsɪm.pə.θi","uk_link":"../audio/s/uksympa002.mp3","content":"sympathy noun\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\nB2 [ U ] (an expression of) understanding and care for someone else's suffering: The president has sent a message of sympathy to the relatives of the dead soldiers.sympathy for I don't have much sympathy for her - I think she's brought her troubles on herself. Compare\nempathy offer/send your sympathies formal\nto express your sadness to someone because a relation or friend of theirs has recently died: I went along to the funeral in order to offer my sympathies.\nSee more\nMore examplesFewer examplesShe said that she was deeply moved by all the letters of sympathy she had received.I have absolutely no sympathy for people who get into debt by overspending.George was a wonderful man - you have my greatest sympathy.It's your own fault Colin, you'll get no sympathy from me!I feel a lot of sympathy for him, it can't be easy bringing up three children on your own.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nrelate\nsensitivity\nsympathetic\nsympathize\ntoo bad idiom\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nsympathy noun\n(SUPPORT)\nC2 [ U ] support and agreement: sympathy with I must confess I have some sympathy with his views. sympathies [ plural ]\nsupport: sympathies are with Of those people questioned, 93 percent said their sympathies were with the teachers.\nSee more come out in sympathy with someone UK\nto stop working in order to show your support for other workers who are on strike: The railway workers came out in sympathy with the miners.\nSee more\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nsympathy noun [U]\n(UNDERSTANDING)\nAdd to word list\nAdd to word list\na feeling or expression of understanding and caring for someone else who is suffering or has problems that have caused unhappiness: When Robert died, I sent a letter of sympathy to his wife.\nsympathy noun [U]\n(SUPPORT)\na feeling or expression of support and agreement: She tends to be in sympathy with the left wing of the party. [ pl ] On the subject of wilderness, her sympathies were clearly pro-environmental.\nAdd to word list\nAdd to word list\nthe act of showing understanding for someone or for a particular situation: sympathy for sb The prime minister expressed his sympathy for those injured in the attacks.have great/little/no sympathy for sth Locals have little sympathy for the chemical company following the toxic waste disaster.\ncome/walk out in sympathy\nHR, WORKPLACE to stop working in order to show your support for a group of workers who are on strike : The airline's ground staff walked out in sympathy with catering contractors.\nin sympathy\nif prices on a market rise or go down in sympathy with others, they do this as a result of the others rising or going down: Gilts advanced 23p in sympathy with the overnight rise in US treasury bonds."}