{"id":331635,"name":"sync","type":"noun","us_sound":"sɪŋk","us_link":"../audio/s/sink.mp3","uk_sound":"sɪŋk","uk_link":"../audio/s/uksineq027.mp3","content":"in sync\nAdd to word list\nAdd to word list\nmoving or happening at the same time and speed as someone or something else: The robot moves in sync with the doctor's motions. These types of investments don't move in sync with stocks and bonds. Throughout the album, the music struggles to get in synch with the words. The birds winter apart, but return in sync. The camerawork is jerky and the dialogue is never in synch.\nagreeing with or the same as something or someone else: The changes will put the US in sync with Europe and Asia. He's putting himself forward as a president whose ideas are in sync with a nation demanding change. When it comes to upholding international law, our two nations are totally in synch. As a couple we are very much in sync. out of sync\nnot moving or happening at the same time and speed as someone or something else: The brass section was out of sync with the rest of the orchestra. As the bells rang, one of them seemed completely out of synch. If the two generators get out of sync, they will both be damaged.\nnot agreeing with or not the same as someone or something else: After looking on the internet I quickly realized it was my attitudes, not my daughter's, that were out of sync with society. We've been feeling a little out of synch with each other lately. Their words and their deeds are badly out of sync. Related words\nsynchronize\nsynchronization\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSimilar and the same\nAccepting & agreeing\nBefore, after and already\nDifferent and difference\nDenying & contradicting\ninformal for\nsynchronize : The action on the screen syncs perfectly with the music.\nto connect two electronic devices so that they both have the latest information or files: How do I sync my phone to my computer?\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOccurring and happening\nConnecting and combining\nAdd to word list\nAdd to word list\na state in which things happen at the same time or in the same way, or are suited to each other: The president and Senate majority leader are in sync (= think the same way) on the big issues. She found that the job was out of sync (= not a good match) with her principles, and she had to leave.\nbe in sync (with sth/sb)\nAdd to word list\nAdd to word list\nto work well together, to be in agreement, or to match well with something or someone else: As a tax cutter, the mayor is in sync with his party on economic issues. We commissioned a study to see if supply and demand are in sync.\nbe out of sync (with sth/sb)\nto fail to work well together , or to fail to agree or match with something or someone else: The government's ideas are out of sync with a nation demanding change."}