{"id":331831,"name":"syndicate","type":"noun","us_sound":"ˈsɪn.də.kət","us_link":"../audio/s/syndicate.mp3","uk_sound":"ˈsɪn.dɪ.kət","uk_link":"../audio/s/uksympa019.mp3","content":"syndicate noun [C, + sing/pl verb]\n(BUSINESS)\nAdd to word list\nAdd to word list\na group of people or companies who join together in order to share the cost of a particular business operation for which a large amount of money is needed: A syndicate of banks is/are financing the deal.\nMore examplesFewer examples The enterprise was owned and operated by a syndicate of ten leading citizens of Louisville.The bank led the banking syndicate that funded construction of the Panama Canal.\nSMART Vocabulary: related words and phrases\nMergers & acquisitions\nacqui-hire\nacquirable\nacquire\nacquisition\nacquisitive\nbuy someone out\nbuyout\nconglomerate\ncounterattack\ndenationalization\ndenationalize\nfire sale\nhostile\nleveraged buyout\nmonopolize\nmonopoly\nnon-hostile\noligopoly\nparent\nwhite knight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nsyndicate noun [C, + sing/pl verb]\n(MEDIA)\nan organization that supplies articles and photographs to different newspapers and magazines for publishing: His cartoons are distributed by United Press Syndicate.\nMore examplesFewer examplesAs part of an extended free trial, The New York Times Syndicate is offering three articles per week.\nSMART Vocabulary: related words and phrases\nPeople who work in publishing\nagent\nanthologist\nbinder\nbookbinder\nco-editor\nco-publisher\ncompositor\nconcierge\neditor\neditor-at-large\nillustrator\nproofreader\npublisher\nreader\nreviewer\nsensitivity reader\nsuperagent\nvanity press\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations, Societies & clubs\nto sell newspaper or magazine articles, photographs, television shows, etc. to other organizations so that they can be published or shown in several places: Freelance writer Ellen Kanner is better known to Miami Herald readers as the syndicated food columnist Edgy Veggie. His new three-hour syndicated show airs on 38 stations.\nto give a debt or loan to a group of people or organizations so they can control or manage it: His businesses ranged from investment banking to syndicating corporate loans and managing wealth for private clients. The report notes that big banks are having trouble \"syndicating\" their deals, or repackaging them into bundles to be sold to investors. Related word\nsyndication\nMore examplesFewer examplesThe network has turned to syndicating its streaming content to popular Web portals.The bank was due to begin syndicating $700m of debt this week for a major production company.\nSMART Vocabulary: related words and phrases\nNews reporting & the press\nambulance chaser\nbreaking news\nbury the lede idiom\ncitizen journalism\ncorrespondent\ndispatch\nhot off the press idiom\ninvestigative journalism\ninvestigative journalist\njournalism\njournalist\njournalistic\nphotojournalism\nphotojournalist\npress baron\npress conference\nscoop\nspoiler\nthe Associated Press\nthe Press Association\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting: programmes & other broadcasts\nMergers & acquisitions\nBorrowing & lending\nAdd to word list\nAdd to word list\na group of people or companies that join together in order to share the cost of a business operation, such as the buying and publishing of newspaper stories, photographs, etc.\nAdd to word list\nAdd to word list\na group of people or organizations who join together to share the financial risk involved in achieving something: A syndicate of banks is financing the deal. a banking/property syndicate See also\nLloyd's syndicate\nloan syndicate\nunderwriting syndicate\nFINANCE to provide or manage a large loan together with other financial organizations who share the risk: The bank was prepared to lend as much as $5.75 billion, though it would syndicate the debt.\nCOMMERCE, COMMUNICATIONS to sell television programmes, newspaper articles, etc. to companies around the world: syndicate sth to sb The Oscars ceremony is syndicated to broadcasters worldwide."}