{"id":331824,"name":"syndic","type":"noun","us_sound":"ˈsɪn.dɪk","us_link":"../audio/s/cdo1121ussynd4144.mp3","uk_sound":"ˈsɪn.dɪk","uk_link":"../audio/s/cdo1121uksynd4076.mp3","content":"Add to word list\nAdd to word list\nin some countries, a person with an official position in government, local government, etc.: Municipal presidents, aldermen (regidores), and syndics (síndicos), chosen by direct popular election, may not be reelected for the term immediately following.\nin the UK, a person who helps deal with the business affairs of a university or other large public organization: He left to the Fitzwilliam Museum, of which he had been a syndic from 1934 to 1957, twenty-four works by Degas.\na member of a committee (= a small group of people that makes decisions or collects information for a larger organization) at the University of Cambridge who deals with matters affecting Cambridge University Press, for example as to which books are published: The syndics of the Cambridge press were proposing to re-edit Thomas Stanley's Aeschylus.\nMore examplesFewer examplesIn 1739 a syndic was even elected to take charge of the fence around the village common.He was invited simultaneously to become syndic and orator to the town of Metz and to a post with the Papal legate at Avignon.The last half of the sixteenth century saw the emergence of figures like the Mayor of Bremen and Syndic of the Hanseatic League, Henry Kreffting.Chadwick also served as a Delegate to the Oxford University Press throughout his time in Oxford (and at Cambridge served as a Syndic to its University Press).\nSMART Vocabulary: related words and phrases\nGovernment ministers & civil servants\naide\nam\nattorney general\nbackbencher\ncabinet\nForeign Secretary\nfunctionary\ngovernment\nHome Secretary\ninterministerial\npress secretary\nprivate member\nprivate secretary\nPrivy Councillor\nprocurator\nsupervisor\nSurgeon General\ntown clerk\nundersecretary\nvizier\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nEnterprises\nUniversity & college education\nTrusts & funds"}