{"id":331836,"name":"syndication","type":"noun","us_sound":"ˌsɪn.dəˈkeɪ.ʃən","us_link":"../audio/s/ussymph012.mp3","uk_sound":"ˌsɪn.dɪˈkeɪ.ʃən","uk_link":"../audio/s/uksympa021.mp3","content":"Add to word list\nAdd to word list\nthe act of selling newspaper or magazine articles, photographs, television shows, etc. to other organizations so that they can be published or shown in several places, or an instance of this: a syndication company The series, created in the late 1990s, first ran in syndication (= having been sold to other organizations) in 2010. Through television, book club deals, and other syndications, the publishers got their money back.\nthe act of giving a debt or loan to a group of people or organizations so they can control or manage it, or an instance of this: They have put the debt syndication on hold until markets have stabilized. The company has launched the syndication of a loan of up to $3 billion. See\nsyndicate\nMore examplesFewer examplesAs I understand it, they're waiting to sell the show into syndication.Broadcasting rights to the sport are held by Austrian TV, which is asking such a high syndication fee that many networks have refused to pay up.National Air Traffic Services completed a year-long financial restructuring with the syndication of a five-year £346m loan. He previously led a loan syndications team for Bank of America.\nSMART Vocabulary: related words and phrases\nSharing\nallocate\nallocation\nallot\nallotment\nallotted\ncollective\ncorporately\ndistribute\ndistribution\ndistributive\ndistributively\njoint\nmate\nportion\nportion something out\nration\nration something out\nredistribute\nsplit\nspread\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBroadcasting in general\nGiving, bringing or getting back\nAdd to word list\nAdd to word list\nFINANCE an arrangement between several financial organizations to share the investment risk of providing a large loan: The Bank of America led syndication of a $150 million loan to the project.\nCOMMUNICATIONS, COMMERCE the selling of television programmes, newspaper articles, etc. to companies around the world so that they can be shown or published in several different places: syndication deal/revenue/rights The company is looking for syndication deals to run services on the mobile TV market. The entertainment company's net income rose 13% last year due to the growth in syndication of its television shows."}