{"id":332814,"name":"system","type":"noun","us_sound":"ˈsɪs.təm","us_link":"../audio/s/system.mp3","uk_sound":"ˈsɪs.təm","uk_link":"../audio/s/uksynta015.mp3","content":"system noun\n(SET)\nAdd to word list\nAdd to word list\nB1 [ C ] a set of connected things or devices that operate together: a central heating system\nB1 [ C ] a set of computer equipment and programs used together for a particular purpose: The system keeps crashing and no one is able to figure out why.\nC2 [ C ] a set of organs or structures in the body that have a particular purpose: the immune system the nervous system\n[ C ] the way that the body works, especially the way that it digests food and passes out waste products: A run in the morning is good for the system - it wakes the body up and gets everything going.\nMore examplesFewer examplesHot water circulates through the heating system.There appears to be a problem with the patient's respiratory system.A heavy fall of snow had disrupted the city's transport system.The accident was caused by the failure of the reactor's cooling system.Drink a lot of water to flush the toxins out of your system.\nSMART Vocabulary: related words and phrases\nClassifying and creating order\nalphabetize\nanti-hierarchical\narrange\narrangement\narranger\nconcordance\ndescribe\nmacrocosm\nmiscatalogue\nmisclassification\nmisclassify\nmiscode\nmislabel\npigeonhole\nset something up\nshake someone down\nshort-list\nshortlist\nsort\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nSubstances & structures in the body\nThe body\nsystem noun\n(METHOD)\nB2 [ C ] a way of doing things: We'll have to develop a better filing system. Under this system, many people were prevented from voting. The legal system operates very differently in the US and Britain.\nB2 [ C ] a particular method of counting, measuring, or weighing things: the metric system of measuring and weighing\n[ U ] approving the intentional and organized use of a system: There doesn't seem to be any system to the books on these shelves - they're certainly not in alphabetical order. the system disapproving\nunfair laws and rules that prevent people from being able to improve their situation: He has his own ways of beating the system, making sure that he has good relationships with influential people.\nMore examplesFewer examplesAfter the trial, his family said they had lost all faith in the judicial system.Pregnant women are exempt from dental charges under the current health system.Do you understand the system of classification used in ornithology?The present voting system distorts the wishes of the electorate.The present tax system penalizes poor people.\nSMART Vocabulary: related words and phrases\nWays of achieving things\nactively\nanother\navenue\nbases\nbasis\ndevice\nformula\nmedia\nmethod\nmethodological\nmethodologically\nmethodologist\nprocedure\nstandard operating procedure\nstrategy\nstyleless\nstylistic\nstylistically\nthus\nvehicle\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nClassifying and creating order\nMeasuring & weighing\nRules & laws\nIdiom\nget something out of your system\nsystem noun [C]\n(SET)\nAdd to word list\nAdd to word list\na set of connected items or devices that operate together: the system of interstate highways We’re having a new computer system installed.\nIn the body, a system is a set of organs or structures that have a particular job to do: the digestive system\nsystem noun [C]\n(METHOD)\na way of doing things; a method: My assistant will explain the system for filing a medical claim. Under the US legal system, an accused person is innocent until proven guilty.\nA system is also a particular method of counting, measuring, or weighing things: the metric system\nAdd to word list\nAdd to word list\na particular set of actions for doing something: They designed a system that tracks results.a system for (doing) sth The bank has streamlined systems for switching accounts.a system of (doing) sth The core of the fraud was a system of double billing. a complaints/tax/trading system The quota system limits the volumes of clothing that China can ship to the US.\na group of organizations that work together for a particular purpose, or have similar activities: the criminal justice system the legal/financial system Countries with better banking systems should have easier access to money at lower interest rates than those that do not.\nMEASURES a particular method of counting, measuring, or weighing things: the metric system\na set of connected machines, etc. that operate together: They design and build solar electric systems. We need to install a sprinkler system.\nIT a set of computer equipment and programs used together for a particular purpose: At the moment, the company spends around €1million a year on its IT systems. I can't process the order right now because our systems are down. You need a password to get onto the system. See also\naccounting system\ncomputer system\ndecision support system\ndigital nervous system\ndisk operating system\neconomic system\nenvironmental management system\nexpert system\nfiling system\nfixed instalment system\nView all\nthe Hay system\nhub-and-spoke system\nhuman resource information system\nimputation system\ninformation system\nkanban\nlegal system\nmanagement information system\nmanufacturing information system\nmonetary system\nopen system\noperating system\npull system\npush system\nreward system\nstrategic information system"}