{"id":396643,"name":"vacation","type":"noun","us_sound":"veɪˈkeɪ.ʃən","us_link":"../audio/v/vacation.mp3","uk_sound":"veɪˈkeɪ.ʃən","uk_link":"../audio/v/epd33233.mp3","content":"Add to word list\nAdd to word list\nA1 [ C or U ] US (UK holiday) a time when someone does not go to work or school but is free to do what they want, such as travel or relax: We're taking a vacation in June. They went to Europe on vacation. I've still got some vacation time left before the end of the year.\n[ C ] mainly US (UK informal vac) a period of the year when schools or colleges are closed, or when law courts do not operate: the Christmas/Easter/summer vacationUK the long vacation (= in the summer)\nMore examplesFewer examples\"Are you looking forward to your vacation?\" \"Am I ever!\"He injured himself on the next-to-last day of his vacation.She always returns from vacation with a few souvenirs, even if they're only cheap trinkets.We're going upstate for our vacation.The Caribbean is a popular vacation destination.\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\necotourism\nescape\nhigh season\nlayover\nmini-break\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\ntrailer park\nyouth hostel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTime off\nNot going to school\nto travel to a place in order to relax, when you are not at work or school: Remember that time we were vacationing in Vermont? Earlier this summer, the family vacationed in Austria. The town is popular with vacationing Americans.\nMore examplesFewer examplesThey planned to vacation in Hawaii.She has canceled an upcoming trip to a California spa because it doesn't seem right to vacation now. a vacationing couple\nSMART Vocabulary: related words and phrases\nTourism & holidays\nair bridge\nair corridor\namenity kit\naparthotel\nawayday\necotourism\nescape\nhigh season\nlayover\nmini-break\nphrase book\npost-holiday\nput something up\nranger station\nsightsee\nstopover\ntourism\ntourist trap\ntrailer park\nyouth hostel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTime off\nAdd to word list\nAdd to word list\na period of time to relax or travel for pleasure instead of doing your usual work or school activities: [ C ] The family had just left for a vacation in the Bahamas. [ U ] We always went on vacation in August. vacation verb [ I always + adv/prep ] us\nYour browser doesn't support HTML5 audio\n/veɪˈkeɪ·ʃən, və-/\nHe was vacationing in San Francisco. vacationer noun [ C ] us\nYour browser doesn't support HTML5 audio\n/veɪˈkeɪ·ʃə·nər, və-/\nTourists and winter vacationers are now key to the economy.\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; HR\n&#160; US a holiday from work, especially when you are travelling away from home: I'm planning to take a vacation in the spring. The President is on vacation with his family. Benefits include 28 days of paid vacation.vacation days/pay/time The job comes with a pension plan and vacation pay. a week's/month's/10-day vacation\n[ C ] a period at particular times of the year when courts of law are closed, and universities and colleges are closed for teaching: I did work experience with a local company during the summer vacation."}