{"id":396630,"name":"vacant","type":"adjective","us_sound":"ˈveɪ.kənt","us_link":"../audio/v/vacant.mp3","uk_sound":"ˈveɪ.kənt","uk_link":"../audio/v/ukutter010.mp3","content":"vacant adjective\n(EMPTY)\nAdd to word list\nAdd to word list\nB2 not filled or occupied; available to be used: The hospital has no vacant beds. Compare\nengaged (IN USE)\nB2 A vacant job is one that no one is doing and is therefore available for someone new to do: The position fell (= became) vacant when Rodman was promoted.\nSMART Vocabulary: related words and phrases\nEmpty\nbare\nbarrenly\nbarrenness\nblank\nclear\ncleared\ndead\ndeserted\nemptiness\nempty\nflat\nforlorn\nhollow\nlow-traffic\nnothingness\nuninhabited\nunobstructed\nunoccupied\nuntenanted\nvacuum\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAvailable and accessible\nvacant adjective\n(NOT RESPONDING)\nshowing no interest or mental activity: She had a vacant look/expression on her face.\nSMART Vocabulary: related words and phrases\nLacking interest and enthusiasm\napathetic\napathy\naridity\nblah\nblankly\nhalf-hearted\nhalf-heartedly\nhell\nincurious\nnonchalance\nnonchalant\nnonchalantly\nnonconcern\npassionless\nunmotivated\nunromantically\nunserious\nunseriousness\nvacantly\nyour heart isn't in it idiom\nSee more results »\nvacant adjective\n(EMPTY)\nAdd to word list\nAdd to word list\n[ not gradable ] (of a place) not being lived in or used, or (of a job or office) available for someone to do: We have three vacant apartments in our building.\nvacant adjective\n(NOT AWARE)\nnot showing much awareness or interest in the world around you: There was a sad, vacant look in his eyes.\nAdd to word list\nAdd to word list\nHR, WORKPLACE if a job is vacant, someone needs to be employed to do it: The position had been vacant for more than a year.become/be left/fall vacant Neither post looks likely to fall vacant within the next few months. a vacant job/position/post\nsituations vacant\nHR the name of the part of a newspaper, website, etc. where jobs are advertised: He replied to an advert in the situations vacant column of the local paper.\nPROPERTY empty and available to be used, rented, or bought: Property developers have been left with many vacant apartments since the downturn in the housing market. be/become/remain vacant\nPROPERTY a building that is empty and available to buy or rent: Baltimore has announced plans for reducing the number of vacants in the city."}