{"id":396665,"name":"vaccinated","type":"adjective","us_sound":"ˈvæk.sə.neɪ.t̬ɪd","us_link":"../audio/v/cdo0123usvacc2594.mp3","uk_sound":"ˈvæk.sɪ.neɪ.tɪd","uk_link":"../audio/v/cdo0123ukvacc2933.mp3","content":"Add to word list\nAdd to word list\nIf a person or animal is vaccinated, they have been given a vaccine (= a substance that is put into your body to prevent you from getting a disease or from being badly affected by it): The results showed that regular flu vaccines protect 75 percent to 90 percent of vaccinated adults. Children who are not vaccinated may get measles and respiratory infections.\nMore examplesFewer examplesThe study found that the vaccinated animals developed fewer metastases in the liver and lung.The illness has been reported in both vaccinated and unvaccinated children.They used electronic health records to compare the incidence of shingles in the vaccinated and unvaccinated populations.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunology\nimmunosuppressed\ninoculate\ninoculation\nunvaccinated\nvaccinate\nvaccination\nvax\nSee more results »\nthe vaccinated\npeople or animals who have been vaccinated (= have been given a vaccine to prevent them from getting a disease or from being badly affected by it): The study that showed increased risk among the vaccinated was discredited. Even the vaccinated are advised to take precautions against being bitten by a tick.\nMore examplesFewer examplesThe results showed 4 infections among the vaccinated, compared with 11 who received the placebo.Of the animals, all of the vaccinated remained well, but 21 of the unvaccinated sheep and the unvaccinated goat died.For elderly residents, expected winter death rates among the vaccinated have fallen by 50 percent or more.\nSMART Vocabulary: related words and phrases\nImmunology & vaccination\nactive immunity\nanti-vax\nantibody\nantigen\nantigenic\nantiserum\nantivaxxer\nherd immunity\nimmune response\nimmunity\nimmunization\nimmunocompromised\nimmunology\nimmunosuppressed\ninoculate\ninoculation\nunvaccinated\nvaccinate\nvaccination\nvax\nSee more results »\nRelated word\nvaccinateCompare\nunvaccinated"}