{"id":398723,"name":"verbosity","type":"noun","us_sound":"vɚˈbɑː.sə.t̬i","us_link":"../audio/v/eus74827.mp3","uk_sound":"vɜːˈbɒs.ə.ti","uk_link":"../audio/v/ukventr018.mp3","content":"verbosity noun [U]\n(WORDS)\nAdd to word list\nAdd to word list\nformal disapproving the quality of being verbose (= using too many words): Knowing they wouldn't welcome too much verbosity, he simplified his talk. The message is clear and concise and displays no verbosity.\nMore examplesFewer examples\"I wouldn't use that word,\" he would tease, challenging my occasional verbosity.He gave a one-word reply - \"Yes\" - when asked whether he could overcome his famous verbosity.She tolerates his verbosity with some amusement.\nSMART Vocabulary: related words and phrases\nDifficult to understand\nabstruse\nabstrusely\nambiguity\nambiguous\nambiguously\nequivocal\nequivocally\nesoteric\nesoterically\nfathomless\nintangibly\ninvolved\nit beats me idiom\nit's all Greek to me idiom\nlabyrinthine\nunintuitive\nunintuitively\nunreadable\nverbiage\nverbosely\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTalking too much\nverbosity noun [U]\n(COMPUTING)\ncomputing\n&#160; specialized a measurement of the amount of information that a computer operating system gives about the tasks it is carrying out, or of the number of words and symbols that a computer language uses to express something or to do something : Unix delivers the file contents without such verbosity as spacing or headers between the files.\nMore examplesFewer examplesI don't like the verbosity that the XML schemas require. A schema for a given structure is at least twice as large as the roughly equivalent DTD.Java has C++'s verbosity , but lacks some of its power.There has been concern regarding the verbosity of the XML document structure and the amount of processing power it takes to read and write XML.First set the build output verbosity to Normal or higher.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nSee\nverbose"}