{"id":398747,"name":"verdict","type":"noun","us_sound":"ˈvɝː.dɪkt","us_link":"../audio/v/verdict.mp3","uk_sound":"ˈvɜː.dɪkt","uk_link":"../audio/v/ukventr020.mp3","content":"Add to word list\nAdd to word list\nC2 an opinion or decision made after judging the facts that are given, especially one made at the end of a trial: The jury reached/returned a unanimous verdict of (not) guilty. Voters gave their verdict on the government's economic record last night by voting overwhelmingly for the opposition. See also\nopen verdict UK specialized\nMore examplesFewer examplesThe jury passed a verdict of guilty, with an appeal to the judge for clemency.Protestors gathered outside the court to await the verdict.After five days of deliberations, the jury decided on a verdict of not guilty.The coroner recorded a verdict of death by misadventure.Many politicians and members of the public expressed outrage at the verdict.\nSMART Vocabulary: related words and phrases\nCourt cases, orders & decisions\nactionable\nactionably\nadminister\nadmissibility\nadmissible\ncontributory negligence\ndiminished responsibility\nextrajudicial\nextrajudicially\nfatal accident inquiry\nfederal case\nfinding\npleading\npower of attorney\nprecedent\npretrial\nprobate\nthe Webster ruling\nwitness to something\nwobbler\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nJudgments and analyses\nAdd to word list\nAdd to word list\na decision by a jury as to whether someone is guilty after having heard the facts given at a trial: The jury reached/returned a verdict of not guilty after six hours of deliberation.\nA verdict is also any judgment or opinion given after considering the facts of a situation: City planners think it’s a good idea to ban traffic from downtown streets, but the public’s verdict is that it’s a stupid idea.\nAdd to word list\nAdd to word list\nLAW an official decision made in a court at the end of a trial: We disagree with this jury's verdict. a verdict of guilty/not guiltyreach/record/return a verdict The jury reached a verdict of not guilty.a verdict against/for sb Today's verdict for the defense reflects recognition by the jury that the company acted responsibly. a majority/unanimous verdict\nsomeone's opinion or judgement about something: deliver/give/issue your verdict on sth Shares in the oil giant plummeted as investors gave their verdict on the environmental disaster. The voters delivered their verdict on the administration's policies, with a resounding defeat of the party."}