{"id":398957,"name":"vernacular","type":"noun","us_sound":"vɚˈnæk.jə.lɚ","us_link":"../audio/v/eus75987.mp3","uk_sound":"vəˈnæk.jə.lər","uk_link":"../audio/v/ukverit010.mp3","content":"Add to word list\nAdd to word list\nthe form of a language that a particular group of speakers use naturally, especially in informal situations: The Spanish I learned at school is very different from the local vernacular of this Mexican village. Many Roman Catholics regret the replacing of the Latin mass by the vernacular.\narchitecture\n&#160; specialized a local style in which ordinary houses are built: For most houses concrete is the vernacular. We can adapt the house types to fit the vernacular.\nart, music\n&#160; specialized dance, music, art, etc. that is in a style liked or performed by ordinary people: The second movement had extremes of refined string sound and robust wind playing, positioning high art next to the vernacular.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njargonistic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\npatois\npidgin\nplain English\nPolari\nrhyming slang\nshibboleth\nslang\ntongue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture\nOrdinary people\nThe visual arts in general\nusing the form of a language that a particular group of speakers use naturally, especially in informal situations: His lively vernacular style goes down well with younger viewers. The folk tale is told in a vernacular dialect.\narchitecture\n&#160; specialized in the local style of ordinary houses: old stone vernacular buildings Wright's prairie houses derived from American vernacular traditions.\nart, music\n&#160; specialized in a style that is liked or performed by ordinary people: He went on to raise the vernacular practice of animal painting to extraordinary heights. B.B. King was a musical genius who soaked up the multiple influences of America's vernacular music.\nSMART Vocabulary: related words and phrases\nForms of languages & specialist dialects\nacrolect\nargot\nbasilect\ncant\ncolloquialism\ndemotic\njargonistic\njournalese\nlegalese\nlingo\nlingua franca\nmetalanguage\npatois\npidgin\nplain English\nPolari\nrhyming slang\nshibboleth\nslang\ntongue\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nArchitecture\nThe visual arts in general\nAdd to word list\nAdd to word list\nthe form of a language commonly spoken by the people of a particular region or by a particular group, esp. when it is different from the standard language: [ U ] Much of his poetry derives from the American pop vernacular. vernacular adjective us\nYour browser doesn't support HTML5 audio\n/vərˈnæk·jə·lər, vəˈnæk-/\na vernacular expression"}