{"id":399137,"name":"versus","type":"preposition","us_sound":"ˈvɝː.səs","us_link":"../audio/v/versus.mp3","uk_sound":"ˈvɜː.səs","uk_link":"../audio/v/ukverit019.mp3","content":"Add to word list\nAdd to word list\nC1 (written abbreviation vs, vs., UK also v) used to say that one team or person is competing against another: Tomorrow's game is Newcastle versus Arsenal.\n(written abbreviation v, vs, vs.) used when naming the two sides in a legal case: Abortion was legalized nationally in the United States following the Roe versus Wade case.\nC1 (written abbreviation vs, vs., UK also v) used to compare two things or ideas, especially when you have to choose between them: private education versus state education\nMore examplesFewer examplesEngland versus Brazil - bring it on!He gave the judgment in the Smith versus the Crown case.OK, adults versus children for football!When we were trying to get treatment for our son, we felt like it was us versus the medical establishment.\nSMART Vocabulary: related words and phrases\nCompeting in sport\nbring\nbring someone on\nbye\nbye week\ncatchup\nclash\nduel\nexplosive\nfield\nflying start\ngo the distance idiom\nmatch\noutduel\npark the bus idiom\npartner\npartner up\nplay big idiom\nplay sb on idiom\nrun\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPeople appearing in court\nOpposing & against\nAdd to word list\nAdd to word list\n(used to show the names of two teams or sides) against: The next soccer match is Mexico versus the United States. fig. It was a question of artistic integrity versus love of money, and money won.\nAdd to word list\nAdd to word list\nused when comparing two ideas, opinions, etc.: Economists were forecasting another sharp decline in the dollar versus the euro before year end.\nused to show that two different people, groups, organizations, etc. are against each other in a competition, legal case, etc.: A father versus son battle for control of one of Britain's largest home builders is under way at the construction group. The Supreme Court's Brown vs. Board of Education decision is one of the most famous in US legal history."}