{"id":399121,"name":"version","type":"noun","us_sound":"ˈvɝː.ʒən","us_link":"../audio/v/version.mp3","uk_sound":"ˈvɜː.ʃən","uk_link":"../audio/v/cdo0123ukvers2939.mp3","content":"Add to word list\nAdd to word list\nB2 a particular form of something that is slightly different from other forms of the same thing: The official version of events is that the police were attacked and were just trying to defend themselves. You can make a reduced fat version of the cheesecake by using cottage cheese instead of cream cheese. An English-language version of the book is planned for next year. The TV series is a watered-down version of the movie, especially designed for family viewing.\nMore examplesFewer examplesHis story of what happened that night didn't correspond with the witness's version.Some of the language in the original play has been toned down for the television version.The film version of the novel received a lot of criticism.He's listened to an abridged version of the Lord of the Rings trilogy on tape.His version of events just doesn't fit with the facts.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nform\ngenre\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nAdd to word list\nAdd to word list\na particular form of something that varies from other forms of the same thing: They’re producing several versions of the TV commercial to see which one works best.\nA version can also be a translation: Originally published in German, it was published in New York in an English-language version.\nSomeone’s version of an event is that person's description of it: Her version of the accident was completely different from that given by the driver of the other car.\nAdd to word list\nAdd to word list\na product, computer program, document, etc. that is slightly different from its previous or later forms: A trial version of the program can be downloaded from our website. The system has a built-in tool to help with version control. the current/latest/new version an electronic/online version an amended/edited/updated version version verb [ T ]\nEverything in the system is versioned to make workflow easier to manage. See also\nalpha version\nbeta version\ndemonstration version"}