{"id":399139,"name":"vert","type":"adjective","us_sound":"vɜ˞ːt","us_link":"../audio/v/cdo1121usvert4451.mp3","uk_sound":"vɜːt","uk_link":"../audio/v/cdo1121ukvert4320.mp3","content":"Add to word list\nAdd to word list\nused to describe something that is green on a coat of arms (= a special shield or shield-shaped pattern that is the sign of a family, university, or city): The shield is argent with a bear sable supported on a strawberry tree vert.\nMore examplesFewer examplesThe Queen's University's arms has in sinister a sea-horse vert.In heraldry the acorn is usually vert (green) but it can also be other colours.The usual crest is the one depicted in the book Crests by Fairbairn: A dexter hand holding a branch of a rose tree argent, leaved vert.upon a mount vert two lions rampant combatant gules supporting the trunk of an oak tree\nSMART Vocabulary: related words and phrases\nSpecific signs and symbols\nargent\narrow\nbadge\nbrand\nBritannia\ncheck something off\nchevron\ncoat of arms\ncrested\ncross\ndot\nhallmark\nMaltese cross\nMorse code\nregistered trademark\nsable\nsemaphore\nservice mark\nshield\nunderscore\nSee more results »\n[ C usually singular ]\n&#160; sports\n&#160; specialized a structure with very steep or almost vertical sides used in the sports of skateboarding, snowboarding, skiing and cycling to perform jumps, etc. on: The vert is a semi-circle shaped ramp that is 12 feet high on each end.\nDaniel Milchev/The Image Bank/GettyImages\n[ U or S ]\n&#160; sports\n&#160; specialized an activity or event in which people skateboard, ski, etc. on a structure with very steep or almost vertical sides: The world's best vert, dirt, and street BMX riders gather in Denver, Colorado this week. We also see him on his skateboard, riding with Hawk at an indoor vert ramp in California. He went for a new trick in the Vert finals and landed it.\nMore examplesFewer examplesBam Margera was once described by MTV as \"a skate guru who's skidded face-first down the vert ramp one too many times\".These venues are for so-called vert skating, where skaters use custom-built ramps, or half pipes, that curve upwards to a height of around 12ft, the last few feet being vertical.At the California State Junior Olympic Games last July, he won the gold medal in vert and bronze medals in pool and street.I think when I was younger I didn't care for Tony Hawk as much, because I felt like I wasn't into vert as much, and I wasn't as into his style, maybe.\nSMART Vocabulary: related words and phrases\nSports venues\nall-seater\namphitheatre\narena\nbowling green\nbullring\ncommentary box\ncrush barrier\ncurva\ncycle track\ndirectors' box\ndojo\nfitness centre\nice rink\nmezzanine\nrink\nrow Z\nstand\ntrack\ntunnel\nvelodrome\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompetitions, & parts of competitions\nSpecific sporting events"}