{"id":399174,"name":"vertical","type":"adjective","us_sound":"ˈvɝː.t̬ə.kəl","us_link":"../audio/v/vertical.mp3","uk_sound":"ˈvɜː.tɪ.kəl","uk_link":"../audio/v/ukverit026.mp3","content":"Add to word list\nAdd to word list\nC1 standing or pointing straight up or at an angle of 90° to a horizontal surface or line: vertical lines/stripes She looked over the cliff and found she was standing at the edge of a vertical drop. Compare\nhorizontal adjective\nMore examplesFewer examplesCarefully tighten the clamp until it firmly supports the pipette in a vertical position.In tin mining today, workers excavate tunnels horizontally from a vertical shaft.Rotate it slowly from the horizontal into a vertical position.Plot distance on the vertical Y-axis against time on the horizontal X-axis.This vertical section of the soil shows four basic soil layers.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUp and upward\nRelated word\nvertically\nvertical noun [C usually singular]\n(LINE)\na vertical line, surface, or position: In a two-stage operation, the steel structure will be raised to the vertical.\nSMART Vocabulary: related words and phrases\nGeometry: describing angles, lines & orientations\nangle of incidence\nangularity\nantinode\nasymptote\nasymptotic\ndiagonal\ngradient\ninterior angle\nmultiaxial\nnon-coplanar\nnon-intersecting\nnon-planar\nreflex\nscalene triangle\nshallow\nsupplementary\ntransversal\ntriangulate\nvanishing point\nvertically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUp and upward\nvertical noun [C usually singular]\n(BUSINESS)\nbusiness\n&#160; specialized (also vertical market, uk/ˌvɜː.tɪ.kəl ˈmɑː.kɪt/ us/ˌvɝː.t̬ə.kəl ˈmɑːr.kɪt/) a market consisting of businesses that supply products and services to each other: Their strategy is to focus on software and services for vertical markets. tech verticals\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nAdd to word list\nAdd to word list\nstanding or pointing straight up or at an angle of 90 to a horizontal surface or line: Water that had leaked from above formed a vertical line down one wall.\nAdd to word list\nAdd to word list\nGRAPHS &amp; CHARTS a vertical line, column, etc. goes straight up or down rather than across: The vertical columns of the table were headed with the months of the year.\nHR used to describe the different ranks of managers and workers in an organization: The vertical structures of the past are less popular now that decision-making and innovation are encouraged at all operating levels. If there are more than five levels of management, the organization is said to be high in vertical differentiation.\nCOMMERCE, FINANCE used to describe the different stages of an industrial or commercial process, and the organizations involved: vertical agreement/market/restraint Vertical restraints can be used to isolate national markets, particularly where there are price differences between EU Member States.\nCompare\nhorizontal"}