{"id":398808,"name":"very","type":"adverb","us_sound":"ˈver.i","us_link":"../audio/v/very.mp3","uk_sound":"ˈver.i","uk_link":"../audio/v/ukverve002.mp3","content":"Add to word list\nAdd to word list\nA1 (used to add emphasis to an adjective or adverb) to a great degree or extremely: The situation is very serious. We're very, very sorry about what's happened. Think about it very carefully before deciding. How very childish of her to refuse to speak to me! \"Are you tired?\" \"No, not very.\" Thank you very much. \"Did you enjoy the play?\" \"Very much so.\" (= Yes.) I can't very well (= it would not be right for me to) say sorry when I didn't do anything wrong.\nused to add force to a superlative adjective or to the adjectives \"own\" or \"same\": This is the very best chocolate cake I've ever tasted. She always leaves her homework to the very last moment. We now have our very own library in the village. This is the very same (= exactly the same) place we sat the last time we came.\nMore examplesFewer examplesWe were very tired after our climb.The surname 'Smith' is very common in Britain.The laws controlling drugs are very strict in this country.It's very convenient that you live near the office.He was very upset that you didn't reply to his letters.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nGrammar\nVeryWe use very before adverbs and adjectives to add emphasis. It means ‘to a great degree’: …\nIdioms\nall very well/fine/good\nvery good\nvery well\nvery adjective [before noun]\n(EXACT)\nC2 (used to add emphasis to a noun) exact or particular: This is the very book I've been looking for all month. You're the very person we need for the job. What ended up happening was the very thing we feared the most. The letter was sent on Monday from Berlin and arrived in Hamburg the very same/next day. The very idea/thought of having her friends to stay fills me with dread.\nMore examplesFewer examplesShe walked in wearing the very dress the hostess had on.I would like to have come, but that's the very day my niece is coming to stay with me.While claiming to promote positive images of women, advertisers are in fact doing the very opposite.He was sitting in the very spot where I had first seen him, all those years before.Ah, there you are - the very woman I was hoping to see!\nSMART Vocabulary: related words and phrases\nParticular and individual\nbe the very thing idiom\nbiomarker\ncalling card\ncapita\ncertain\nespecially\nindividualistic\nindividualistically\nindividuality\nindividualized\nindividually\nmatter\npeculiarity\nper capita\npersonally\npet\nprivate\nregard\nrespectively\nseparately\nSee more results »\nvery adjective [before noun]\n(FURTHEST POINT)\nused to describe or emphasize the furthest point of something: He found the piece of paper he had lost at the very bottom of the pile. We were at the very end of the queue, so we didn't manage to get any tickets.\nSMART Vocabulary: related words and phrases\nLinguistics: very & extreme\nabjectly\nabsolutely\nabundantly\nabundantly clear\nbeyond\nbiblical\ndownright\nextraordinarily\nextremely\ninfinitely\nparticularly\nprofoundly\nstupefyingly\nsuper\nsuper-duper\nsuper-spectacular\nsuperabundantly\ntotally\nviolently\nwhatever\nSee more results »\nIdiom\nbe the very thing\nvery adverb [not gradable]\n(EXTREMELY)\nAdd to word list\nAdd to word list\n(used to add emphasis to an adjective or adverb) to a great degree, or extremely: I was working very hard, but I enjoyed it. It’s very easy to find our house. She was a very good teacher. People didn’t like him very much. Idiom\nvery well\nvery adjective [not gradable]\n(EXACT)\n(used to add emphasis to a noun) exact or particular: I’d heard stories about him and now here he was, the very person I now accompanied. This very moment was what he had been waiting for. He found the missing paper at the very bottom of the pile."}