{"id":399349,"name":"vest","type":"noun","us_sound":"vest","us_link":"../audio/v/vest.mp3","uk_sound":"vest","uk_link":"../audio/v/ukverve005.mp3","content":"Add to word list\nAdd to word list\nC1 UK (US undershirt) a type of underwear, often with no sleeves, that covers the upper part of the body, worn for extra warmth: a cotton/wool/string vest She always wore a long-sleeved thermal vest in the winter.\nDave King/Dorling Kindersley/GettyImages\nUK (also vest top) a shirt without sleeves, usually made out of cotton, that is worn in the summer or for sport: The cyclists were all dressed in tight lycra shorts and the official team vest. He wore a vest top and a pair of luminous shorts to the beach party.\nMarisaLia/iStock/Getty Image Plus/GettyImages\nC2 US (UK waistcoat) a piece of clothing that covers the upper body but not the arms and usually has buttons down the front, worn over a shirt\nAH86/iStock/Getty Image Plus/GettyImages\nmainly US (UK also gilet, bodywarmer) a piece of clothing like a jacket without sleeves, that is worn over other clothes for warmth or protection: Wear something warm, like a fleece jacket or a down vest.\nNAKphotos/iStock / Getty Images Plus/GettyImages\nMore examplesFewer examplesI always wear a vest in cold weather.We wore scratchy woollen vests when I was a boy.We stripped down to our vests.\nSMART Vocabulary: related words and phrases\nUnderwear\nbase layer\nBasque\nbinder\nbloomer\nbodice\nfalsies\nFrench knickers\nG-string\ngirdle\nhipster\nshapewear\nshorts\nsinglet\nskivvy\nslip\nunmentionables\nuplift\nVPL\nwedgie\nwifebeater\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSportswear & swimwear\nJumpers, shirts & tee-shirts\nCoats, jackets & cloaks\nvest noun [C]\n(CLOTHING)\nAdd to word list\nAdd to word list\na piece of clothing like a coat without sleeves that reaches to the waist: My grandfather always wore his vest buttoned up. The state requires that there be a life vest for each person in the boat.\nBr A vest is an undershirt.\nvest verb [T]\n(GIVE POWER TO)\nto give someone or something the power to do something: Political power is now vested in an elected parliament.\nAdd to word list\nAdd to word list\nif an employee's shares, payments to a pension plan, etc. vest or are vested, there is an agreed period that an employee must work for the company before they can use or sell them: When an employee has worked for the company for five years, their benefits shall be fully vested. Even before restricted shares vest, the employee receives ongoing dividends. Phrasal verbs\nvest in sb/sth\nvest sth in sb/sth\nvest sb with sth"}