{"id":399462,"name":"veto","type":"noun","us_sound":"ˈviː.t̬oʊ","us_link":"../audio/v/eus74837.mp3","uk_sound":"ˈviː.təʊ","uk_link":"../audio/v/ukverve015.mp3","content":"Add to word list\nAdd to word list\nan official power or right to refuse to accept or allow something: The president has the power of veto over any bill that comes across his desk. In theory the British government could use its veto to block this proposal. The Senate voted to override the president's veto of the proposed measures.mainly UK My parents put a veto on our watching television for more than two hours each evening.\nMore examplesFewer examplesOpponents are unlikely to be able to muster enough votes to override the veto.The president used his veto to override the committee's decision.The chairwoman used her veto to block the appointment.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nunsanctioned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefusing & rejecting\nto refuse to allow something: In 1961, President De Gaulle vetoed Britain's entry into the Common Market. [ + -ing verb ] My boss vetoed my taking any more time off this year. Synonyms\ndisallow\nnix US informalCompare\nproscribe formal\nThesaurus: synonyms, antonyms, and examples\nto forbid someone or somethingforbidHe grew up in a strict household where dating was forbidden.disallowUpon review, the goal was disallowed.banThe government has banned the sale of lead-based paint.prohibitVehicles are prohibited from parking on the grass.\nSee more results »\nMore examplesFewer examplesThe president has the power to veto the imposition of sanctions.Managers vetoed proposals for a shorter working week.My father vetoed our plans for a trip to Turkey.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\ntravel ban\nunapproved\nunauthorized\nunkosher\nunsanctioned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRefusing & rejecting\nAdd to word list\nAdd to word list\npolitics &amp; government the power to refuse to allow something to be done, or such a refusal: [ C ] The president has promised a veto if Congress passes that bill. [ U ] The mayor will have no veto over zoning.\npolitics &amp; government to refuse to allow something to be done: The governor said she would veto the bill unless certain parts were changed. Cory wanted to drive the car, but her mom vetoed it.\nAdd to word list\nAdd to word list\nan official power or right to refuse to accept or allow something even if most of the other people or organizations involved approve of it: have/use/threaten a veto The British government could use its veto to block the proposal. A two-thirds majority of the Senate would be needed to override the governor's veto of the bill. The permanent members of the Security Council all have veto powers. presidential veto the power/right of veto\nto refuse to allow or accept something such as a vote even if most of the other people or organizations involved approve of it: veto a bill/deal/plan The President vetoed a bill that would have provided the program with an additional $35 billion over five years. The bid was vetoed by European competition authorities."}