{"id":399521,"name":"viable","type":"adjective","us_sound":"ˈvaɪ.ə.bəl","us_link":"../audio/v/viable.mp3","uk_sound":"ˈvaɪ.ə.bəl","uk_link":"../audio/v/ukvia__003.mp3","content":"Add to word list\nAdd to word list\nC2 able to work as intended or able to succeed: In order to make the company viable, it will unfortunately be necessary to reduce staffing levels. I am afraid your plan is not commercially/economically/financially/politically viable.\nThesaurus: synonyms, antonyms, and examples\nachievableachievableMake sure your weight-loss goals are achievable.attainableEmployees benefit from having attainable goals.doableIt's a big ask, but it's doable.feasibleGiven the lack of funding, is this plan really feasible?\nSee more results »\nbiology\n&#160; specialized able to continue to exist as or develop into a living being: There is a continuing debate about the age at which a human foetus can be considered viable.\nMore examplesFewer examplesThe project is not financially viable .We have concerns about whether the government will be able to provide viable social services for poorer families/provide poorer families with viable social services.The government wants to encourage viable self-contained rural communities.It was not viable to support ourselves on such as small plot of land.We hope to provide a viable alternative to car travel.\nSMART Vocabulary: related words and phrases\nUseful or advantageous\na place in the sun idiom\nadvantageous\nadvantageously\nall-singing\namiss\nasset\nfecund\nfodder\nfoil\nfruitfully\nfruitfulness\ngainfully\npracticality\npreferential\nproductive\nproductively\nwholesomely\nwholesomeness\nwin-win\nworthwhile\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSuccessful (things or people)\nLife and living\nPotential\nRelated word\nviably\nAdd to word list\nAdd to word list\nable to exist, perform as intended, or succeed: The company had to seek other ways to remain viable. He would be a viable candidate for any office he wanted to run for. viability noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌvɑɪ·əˈbɪl·ɪ·t̬i/\nShe’s going to have to cut costs to maintain the viability of her business.\nAdd to word list\nAdd to word list\nable to be done or likely to succeed: commercially/economically/financially viable Rising oil prices have made alternative energy sources more economically viable.a viable business/company/market The fund exists to provide finance to viable businesses that have been rejected by mainstream lenders. Home-working offers a viable solution to the work/family conflict. a viable alternative/option/proposition"}