{"id":399563,"name":"vibe","type":"noun","us_sound":"vaɪb","us_link":"../audio/v/ca2us104.mp3","uk_sound":"vaɪb","uk_link":"../audio/v/epd33260.mp3","content":"vibe noun\n(MOOD)\nAdd to word list\nAdd to word list\n[ C ] informal the mood of a place, situation, person, etc. and the way that they make you feel: laid-back vibe The city is famous for its laid-back vibe.vibe of I loved the overall vibe of the place but the food wasn't that great. The music has a soothing vibe. I didn't like the place—it had bad vibes. I was getting some weird vibes from him—I don't think he liked me.\nThesaurus: synonyms, antonyms, and examples\nthe character, feeling, or mood of a place or situationatmosphereThe atmosphere in the conference room was tense.ambienceIt looks like an upscale eatery, but it has a real sports-pub ambience to it.vibeThe restaurant has a casual vibe.climateDiscussion took place in a climate of deep hostility.toneHer snarky remark at the outset set the tone for the rest of the visit.feelThe tile work gives the shop a very Moroccan feel.\nSee more results »\nsend vibes\nto communicate good wishes to someone, which you hope will make them feel better or be more successful: Sending vibes for a quick recovery!\nSee more\nSMART Vocabulary: related words and phrases\nConditions and characteristics\n-ance\n-ibility\nability\nadverse conditions\nage\nambience\nappearance\ncharacter\ngood/bad karma idiom\nhave it in you idiom\nhood\nhumanity\npresentation\nrespect\nshape\ntrait\ntrappings\nunaffiliated\nundercurrent\nvibe check\nSee more results »\nvibe noun\n(INSTRUMENT)\nvibes [ plural ]\ninformal for\nvibraphone : a musical instrument consisting of a frame with a set of metal bars in it that you hit. The bars have electrical devices attached to them that make them vibrate (= shake) so that they produce musical notes that seem to shake slightly: play the vibes He would often play the vibes in their recording sessions.\nSee more\n[ I ] to like someone or something and feel comfortable and happy with them: vibe with You can tell by the look on my face how much I was enjoying hanging and vibing backstage with the band. I just wasn't really vibing with any of the clothes she gave me to wear. Consumers might not vibe with the app, especially with so many other sources for news out there.be vibed with If you only speak English, you may be understood but not vibed with.\n[ I ] to enjoy playing, listening to, or dancing to music in a relaxed way: vibe to Nowadays parents and kids are sometimes vibing to the same artist. He already had the dancefloor vibing to his music.\n[ I or T ] to send good wishes to someone: vibe for I'm praying and vibing for you and your family. Here's vibing major vibes for the interview!\n[ I ] to have or create a particular feeling: vibe with The room vibed with tension.\nSMART Vocabulary: related words and phrases\nBeing friends & getting to know them\nbe on speaking terms idiom\nbe/get in with someone idiom\nbe/live in each other's pockets idiom\nbefriend\nbonding\nbuild\nget on like a house on fire idiom\ngo back a long way idiom\nhang\nhang around with someone\nhang out\nmix\nmove\npal up\npresent\npull\npull something on\nrub\nscore\nstrike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFeelings - general words\nPlaying music\nWelcoming, greeting & greetings\nCreating and producing"}