{"id":399730,"name":"victim","type":"noun","us_sound":"ˈvɪk.təm","us_link":"../audio/v/eus74846.mp3","uk_sound":"ˈvɪk.tɪm","uk_link":"../audio/v/ukvicio003.mp3","content":"Add to word list\nAdd to word list\nB2 someone or something that has been hurt, damaged, or killed or has suffered, either because of the actions of someone or something else, or because of illness or chance: to provide financial aid to hurricane/flood, etc. victims victims of crimevictim of The children are the innocent/helpless victims of the fighting. The new drug might help save the lives of cancer victims. We appear to have been the victims of a cruel practical joke. Our local hospital has become the latest victim of the cuts in government spending. fall victim to someone/something\nto be hurt, damaged, or killed because of something or someone: Sea turtles in this region often fall victim to the effects of pollution.\nSee more\nMore examplesFewer examplesThe murderer had lured his victim to a deserted house.She claimed to have been a victim of child abuse.They're launching an appeal to raise money for famine victims.Road accident victims make up almost a quarter of the hospital's patients.The victim had received repeated blows to the head and body.\nSMART Vocabulary: related words and phrases\nMedical treatment: people who receive medical treatment\nasthmatic\ncase\ncasualty\nconvalescent\nday patient\ndonor\nepileptic\ngeriatric\nhealth tourist\ninvalid\nmedical tourist\nnon-responder\norgan donor\noutpatient\npatient\nsick\nsufferer\nunder\nwounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nIdiom\nbe a victim of your own success\nAdd to word list\nAdd to word list\na person who has suffered the effects of violence or illness or bad luck: an accident victim She’s just a victim of circumstances beyond her control. victimization noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌvɪk·tə·məˈzeɪ·ʃən/\nNational reports of victimization show a decline in certain kinds of crime. victimize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈvɪk·təˌmɑɪz/\nOne survey showed the number of companies victimized by computer theft rose to 83 percent this year."}