{"id":399868,"name":"view","type":"noun","us_sound":"vjuː","us_link":"../audio/v/view.mp3","uk_sound":"vjuː","uk_link":"../audio/v/ukvicio027.mp3","content":"view noun\n(OPINION)\nAdd to word list\nAdd to word list\nB1 [ C ] an opinion, belief, or idea, or a way of thinking about something: view about/on Do you have any views about/on what we should do now?in your view In my view, her criticisms were completely justified. [ + that ] It's my view that the price is much too high.have/hold/share/take the view that Many people have/hold/share/take the view that children should not be physically punished.make your views known Everyone will have a chance to make their views known at the meeting.exchange of views We had a friendly exchange of views (= discussion).take a dim/poor view of I take a very dim/poor view of this kind of behaviour (= think that this type of behaviour is unacceptable). world view\na way of thinking about the world: Our world view is quite different from that of writers in the fourth century BC.\nSee more Synonyms\nmentality\nmindset\nopinion\noutlook (OPINION)\npoint of view\nstandpoint\ntake on something\nviewpoint\nMore examplesFewer examplesThe government's view is that raising taxes now would not be in the national interest.His view of the situation is diametrically opposed to mine.My personal view is that the students should be doing more work outside the classroom.The party leader is an extreme left-winger, but her deputy is more moderate in her views.We asked our readers to write in and give us their views.\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nview noun\n(SIGHT)\nA2 [ C or U ] what you can see from a particular place, or the ability to see from a particular place: view from The view from the top of the mountain is breathtaking/magnificent/spectacular.afford a view The rooftop restaurant affords a panoramic view (= allows you to see a wide area) across the bay.block/obstruct someone’s view of something Don't stand in front of me - you're blocking/obstructing my view of the stage.come into view The cloud lifted, and the tops of the mountains suddenly came into view (= could be seen).from/out of view She turned a corner, and disappeared from view/out of view.\n[ C ] a picture of a particular place: He paints rural views (= pictures of the countryside). in view UK\nclose enough to be seen: I always make sure I keep the children in view whenever we're in a public place.\nSee more on view\nIf something is on view, it is arranged so that it can be seen by the public: on view to The plans for the new road will soon be on view to the public in the library.\nSee more\nMore examplesFewer examplesWe had a good view of all the ships coming into/leaving port.Our view of the stage was restricted .The first diagram is a view of the shop from the street, and the second shows it in section.He stood near the front to get a better view.A row of tall fir trees shuts off the view of the street in front.\nSMART Vocabulary: related words and phrases\nGeography: scenery & views\n-scape\na bird's eye view idiom\naspect\nbird\ncityscape\ncloudscape\ncommanding\nforeground\nhellscape\nlandscape\nlookout\noutlook\noverlook\npanorama\npanoramically\nprospect\nroofscape\nscenically\nskyscape\nvantage point\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPictures\nGrammar\nViewView as a noun means a belief, opinion or idea about something: …\nView as a nounView as a noun means a belief, opinion or idea about something: …\nView as a verbWe also use view as a verb to mean ‘hold an opinion’: …\nIdioms\nin view of something\nwith a view to doing something\nview verb\n(HAVE OPINION)\nC2 [ T ] to have a particular opinion or way of thinking about someone or something: A reporter asked the minister how he viewed recent events.be viewed as She is viewed as a strong candidate for the job.view something with something We view these latest developments with concern/suspicion/satisfaction.view something from an angle If we view the problem from a different angle, a solution may become more obvious. How do you view your prospects/chances (= what do you consider your chances to be) in tomorrow's race?\nMore examplesFewer examplesWe view future developments with some trepidation.If you view the situation from her point of view, you may be more sympathetic.I didn't view her as a suitable person to look after my children.He was viewed as the leading authority on Impressionist painters.I view this as a transition phase in my life.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nview verb\n(SEE)\nC2 [ I or T ] to watch something: There's a special area at the airport where you can view aircraft taking off and landing.viewing figures Viewing figures (= the number of people watching) for the show were very low.\n[ I or T ] to look at something in a complete or careful way: We have two people coming to view the house this afternoon. The extent of the flooding can only be fully appreciated when viewed from the air.\nMore examplesFewer examplesWe viewed the performance from a raised platform.You can view the sharks from outside the glass tank.There are hidden huts from where we view the wildlife.We weren't able to view the property before we bought it.Can we view the rocket launching?\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\nGrammar\nViewView as a noun means a belief, opinion or idea about something: …\nView as a nounView as a noun means a belief, opinion or idea about something: …\nView as a verbWe also use view as a verb to mean ‘hold an opinion’: …\nview noun\n(SIGHT)\nAdd to word list\nAdd to word list\n[ C/U ] what you can see from a particular place, or the ability to see from a particular place: [ U ] She turned a corner and disappeared from view. [ C ] Our room had spectacular views of the mountains.\nview noun\n(OPINION)\n[ C ] a way of looking at something; an opinion: It’s our view that it’s time we did something and stopped just talking! He takes a pessimistic view of our chances of success. The meeting was an opportunity for the two leaders to exchange views. Idioms\non view\nin view of something\nview verb [T]\n(OPINION)\nto look at or consider something: How do you view your chances of getting that job?"}