{"id":399872,"name":"viewer","type":"noun","us_sound":"ˈvjuː.ɚ","us_link":"../audio/v/viewer.mp3","uk_sound":"ˈvjuː.ər","uk_link":"../audio/v/ukvicio028.mp3","content":"Add to word list\nAdd to word list\nB2 a person who watches something, especially television: Millions of viewers will be glued to their sets for this match.\nThesaurus: synonyms, antonyms, and examples\nan audienceaudienceThe audience went wild after every song she sang.viewerThe show attracts millions of viewers every week.listenerListeners tune in regularly for his cheery banter.crowdThose New Yorkers can be a tough crowd to please.houseIt's a full house tonight.spectatorThe spectators cheered when the balloon went up.\nSee more results »\na device for looking at slides (= photographs on small pieces of film)\npjgs/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesTelevision confronts the viewer with a succession of glittering and seductive images.Some scenes are violent and may disturb younger viewers.A lot of viewers complained that there was too much gratuitous sex and violence in the movie.This programme contains language that some viewers might find offensive.He may be old hat among the trendy younger generation, but his shows draw more viewers than any other comedian.\nSMART Vocabulary: related words and phrases\nAudiences and spectators\naudience\nbehind closed doors idiom\nbums on seats idiom\nbystander\ncaptive audience\nclosed\nconsumption\nevangelistically\nfan park\nfly on the wall idiom\nflâneur\ngoer\nlooker-on\nnon-viewer\nobserver\nonlooker\npep rally\nspectator\nsupporter\nwatcher\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPhotography\nAdd to word list\nAdd to word list\nsomeone who watches a particular TV broadcast or series of broadcasts, esp. regularly: Millions of viewers watch the Super Bowl on TV every year.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS someone who watches a television programme: The ads were designed to appeal to viewers of home improvement shows.attract/bring in/draw viewers The first episode attracted almost 20 million viewers. television/TV viewers\nIT a piece of equipment or software that allows you to look at images: a picture/photo viewer"}