{"id":399871,"name":"viewed","type":"verb","us_sound":"vjuː","us_link":"../audio/v/view.mp3","uk_sound":"vjuː","uk_link":"../audio/v/ukvicio027.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nview\nview verb\n(HAVE OPINION)\nC2 [ T ] to have a particular opinion or way of thinking about someone or something: A reporter asked the minister how he viewed recent events. She is viewed as a strong candidate for the job. We view these latest developments with concern/suspicion/satisfaction. If we view the problem from a different angle, a solution may become more obvious. How do you view your prospects/chances (= what do you consider your chances to be) in tomorrow's race?\nMore examplesFewer examplesWe view future developments with some trepidation.If you view the situation from her point of view, you may be more sympathetic.I didn't view her as a suitable person to look after my children.He was viewed as the leading authority on Impressionist painters.I view this as a transition phase in my life.\nSMART Vocabulary: related words and phrases\nAnalysing and evaluating\nadjudication\nanalysable\nanalyse\nanalyser\nassign\ndive\nenquiry\ngo through\nhave the measure of someone/something idiom\ninspect\ninspection\ninterpret\ninterpretable\nreinspect\nreinspection\nreinterpret\nreinterpretation\nreinvestigate\nthe acid test\nweigh\nSee more results »\nview verb\n(SEE)\nC2 [ I or T ] to watch something: There's a special area at the airport where you can view aircraft taking off and landing. Viewing figures (= the number of people watching) (= ) for the show were very low.\n[ I or T ] to look at something in a complete or careful way: We have two people coming to view the house this afternoon. The extent of the flooding can only be fully appreciated when viewed from the air.\nMore examplesFewer examplesWe viewed the performance from a raised platform.You can view the sharks from outside the glass tank.There are hidden huts from where we view the wildlife.We weren't able to view the property before we bought it.Can we view the rocket launching?\nSMART Vocabulary: related words and phrases\nUsing the eyes\naccommodate\naccommodation\nall eyes are on someone/something idiom\nastigmatic\nbeholder\ncast\ncorner\ndiscern\nfix\nglare\npenetrating\nperceive\nre-sight\nrest on someone/something\nresurvey\nrubbernecking\nscope\nsighting\nspot\ntab\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnalysing and evaluating\nGrammar\nViewView as a noun means a belief, opinion or idea about something: …\nView as a nounView as a noun means a belief, opinion or idea about something: …\nView as a verbWe also use view as a verb to mean ‘hold an opinion’: …"}