{"id":400267,"name":"vintage","type":"adjective","us_sound":"ˈvɪn.t̬ɪdʒ","us_link":"../audio/v/eus74856.mp3","uk_sound":"ˈvɪn.tɪdʒ","uk_link":"../audio/v/ukvineg005.mp3","content":"vintage adjective\n(FROM THE PAST)\nAdd to word list\nAdd to word list\nproduced in the past, and typical of the period in which it was made: a vintage plane a vintage comic book See also\nvintage car\nused to describe clothing, jewellery, etc. that is not new, especially when it is a good example of a style from the past: She loves buying vintage clothing. The actress turned up at the Oscars in a classic vintage dress. To be called vintage the piece should strongly reflect styles and trends associated with that era.\nSMART Vocabulary: related words and phrases\nOld or old-fashioned\nage-old\nageing\nancient\nantediluvian\nanti-progressive\nfossilization\nfossilize\nfossilized\nfrumpy\nfustily\nout of date\noutdate\noutdated\noutdatedly\noutmoded\nunprogressive\nunreconstructed\nunsmart\nunstylish\nused\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nof high quality and lasting value, or showing the best and most typical characteristics of a particular type of thing: This film is vintage Disney. It has not been a vintage year for the club (= it has not been very successful). His performance was not vintage, but it was capable enough.\nThesaurus: synonyms, antonyms, and examples\ncoming from a time in the pastoldBe careful - that clock is very old.formerHe's a former coworker of mine.ancientWe need to protect ancient monuments.archaic\"Thee\" is an archaic word for \"you\".\nSee more results »\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\ndivine\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nwonderfully\nSee more results »\nvintage adjective\n(WINE)\n[ before noun ] Vintage wine is of high quality and was made in a particular year and can be kept for several years in order to improve it: vintage champagne/port/claret\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfruitiness\nfull-bodied\ngrape\njeroboam\nLambrusco\nplonk\nplummy\nspritzig\nspumante\nsuper-smooth\ntable wine\nterroir\nwiney\nzinfandel\nSee more results »\nvintage noun\n(AGE)\n[ C ] the wine made in a particular year, or a particular year in which wine has been made: The 1983 vintage was one of the best. What vintage is this wine? (= In what year was it made?)\n[ U ] a group of things that were produced, or a group of people who were active, during the same particular period: Cars of recent vintage may not need inspection. You and I are of the same vintage, so we remember this.\nSMART Vocabulary: related words and phrases\nWines & winemaking\n-bodied\nageworthy\namontillado\nblender\nblush\nclaret\nfruitiness\nfull-bodied\ngrape\njeroboam\nLambrusco\nplonk\nplummy\nspritzig\nspumante\nsuper-smooth\ntable wine\nterroir\nwiney\nzinfandel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nGroups and collections of things\nvintage noun\n(OLD CLOTHES)\n[ U ] clothing, jewellery, etc. that is not new, especially when it is a good example of a style from the past: I tend to wear vintage but I have a few new designer pieces. If you want a more interesting watch, consider buying vintage.\nMore examplesFewer examplesI like to buy vintage because you will never see anybody else wearing the same thing.The photo shows Sarah Jessica Parker, in vintage, at a benefit concert.Like every proper student, you wore vintage, of course. Cooking retro is an easy way to score culinary style points - think of it as the equivalent of wearing vintage.Fashion-conscious customers are buying brooches now and they're mostly interested in vintage.\nSMART Vocabulary: related words and phrases\nStyle & appearance of clothes\naesthetic\nalterable\nanti-fur\nAran\nbackless\nfloor-length\nflouncy\nfoppishly\nform-fitting\nFrench tuck\nreversible\nribbed\nribby\nruche\nruched\nvoop neck\nwaisted\nwashable\nwasp waist\nwasp-waisted\nSee more results »\nvintage noun [C]\n(WINE)\nAdd to word list\nAdd to word list\nthe wine made in a particular year, or a particular year in which wine was made\nvintage adjective [not gradable]\n(HIGH QUALITY)\n(esp. of something old) of high quality and lasting value, or showing the best characteristics typical of the person who created it: a vintage pistol/airplane/car \"Sophisticated Lady\" is vintage Duke Ellington.\nvintage adjective [not gradable]\n(USED)\nused but of good quality: vintage clothing\nvintage adjective [not gradable]\n(WINE)\n(of wine) of high quality that was made in a particular year, and that can be kept for several years in order to improve it: vintage champagne"}