{"id":400308,"name":"violation","type":"noun","us_sound":"ˌvaɪ.əˈleɪ.ʃən","us_link":"../audio/v/violation.mp3","uk_sound":"ˌvaɪ.əˈleɪ.ʃən","uk_link":"../audio/v/ukvineg010.mp3","content":"Add to word list\nAdd to word list\nan action that breaks or acts against something, especially a law, agreement, principle, or something that should be treated with respect: He claimed that the way he'd been treated was a gross violation of his civil/constitutional/human rights. The takeover of the embassy constitutes a flagrant/blatant violation of international law. It was clear that they had not acted in violation of the rules. The school is upgrading its alarms and correcting other fire code violations. Synonyms\ninfraction formal\nmisdemeanour UK\nMore examplesFewer examplesThe opposition parties have cried foul at the president's act, seeing it as a violation of democracy.The verdict was a gross violation of justice.She's claiming that her detention by the police was a violation of her human rights.He acted in violation of the law.\nSMART Vocabulary: related words and phrases\nObeying & breaking the law\nabide\nabide by something\nadhere\nadhere to something\nafoul\nbad actor\nbuck\ncommission\ncomply\ndisobey\nenforcer\nfall foul of something idiom\ngo by the book\nguiltiness\nhold someone to something\ninfraction\ninfringement\nobservance\non the right/wrong side of the law idiom\nshalt\nSee more results »\nAdd to word list\nAdd to word list\n[ C or U ]\n&#160; LAW an action that breaks a law, agreement, rule, etc.: The first violation can result in a $150 fine.a violation of sth Unpaid overtime is a violation of corporate policy.in violation of sth It was clear that they had acted in violation of the rules. a traffic/probation/safety violation\n[ C ]\n&#160; SOCIAL RESPONSIBILITY an action that does not show respect for an important principle: a violation of sth He said the leaked report was a violation of the confidentiality of the investigation. The black market for body organs is a violation of human dignity."}