{"id":400319,"name":"violent","type":"adjective","us_sound":"ˈvaɪə.lənt","us_link":"../audio/v/violent.mp3","uk_sound":"ˈvaɪə.lənt","uk_link":"../audio/v/ukvineg013.mp3","content":"violent adjective\n(CAUSING HURT)\nAdd to word list\nAdd to word list\nB2 using force to hurt or attack: He yells a lot but I don't think he's ever been physically violent towards her.\nThesaurus: synonyms, antonyms, and examples\nviolentviolentHer ex-boyfriend was violent.aggressiveShe was very aggressive towards the TV reporters.ferociousA ferocious dog guarded the house.fierceThe battle for the stronghold was fierce, with hundreds of soldiers killed.savageIt was a savage attack.brutalHe was jailed for the brutal crime.\nSee more results »\nB2 used to describe a situation or event in which people are hurt or killed: a violent crime There was a violent clash/confrontation between rival supporters after the match. The more violent scenes in the film were cut when it was shown on television. Her family is still trying to come to terms with her violent death (= death caused suddenly and unexpectedly by the use of physical force, especially murder).\nMore examplesFewer examplesMany football fans are unfairly accused of violent behaviour.Although sexual and violent crimes have increased by 10%, they remain only a tiny fraction of the total number of crimes committed each year.Some scenes are violent and may disturb younger viewers.There were violent confrontations between police and demonstrators.The woman had fled from her violent husband to a women's refuge in Chelmsford.\nSMART Vocabulary: related words and phrases\nViolent or aggressive\nabusively\naggressive\naggressively\naggressiveness\naggro\nferociously\nferocity\nfierce\nfierceness\nfighting words\noffensively\noutrage\nproactive aggression\npugnacious\npugnaciously\nultra-violent\nuntameable\nvicious\nviciously\nviciousness\nSee more results »\nviolent adjective\n(STRONG)\nC2 sudden and powerful: He has a violent temper. violent thunderstorms The speaker launched into a violent attack on (= spoke forcefully against) the president's policies.\n[ before noun ] A violent colour is extremely or unpleasantly bright: She was wearing a violent pink sweater and orange trousers.\nSMART Vocabulary: related words and phrases\nPhysically strong and powerful\n(as) tough as old boots idiom\nbeefy\nbilly-o\nbrute\nbulletproof\nburly\nimpregnably\nindestructible\nindestructibly\nindustrial-strength\nintensely\nruggedly\nshatterproof\nshockproof\nsinewy\nsouped-up\nstalwart\nvengeance\nwashboard stomach\nwith a vengeance idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe qualities of colour\nAdd to word list\nAdd to word list\nusing or involving force to hurt or attack: violent crime The police are concerned about the possibility of violent behavior at the demonstration.\nA violent death is one that is caused suddenly and unexpectedly by the use of physical force, esp. murder.\nViolent can mean very strong: a violent explosion\nA violent person or attitude is one that expresses great anger."}