{"id":400541,"name":"virtually","type":"adverb","us_sound":"ˈvɝː.tʃu.ə.li","us_link":"../audio/v/virtually.mp3","uk_sound":"ˈvɜː.tʃu.ə.li","uk_link":"../audio/v/ukvirgi009.mp3","content":"virtually adverb\n(ALMOST)\nAdd to word list\nAdd to word list\nB2 almost: Their twins are virtually identical. That wine stain on my shirt has virtually disappeared.\nThesaurus: synonyms, antonyms, and examples\nnot completelyalmostWe need to hurry up - it's almost time to go.nearlyIt's nearly midnight.nearHe was near tears (= almost crying).aboutAre you about ready to leave?all butThe concert was all but over by the time we arrived. well-nighIt was well-nigh impossible to get a person on the phone these days.\nSee more results »\nMore examplesFewer examplesBy midnight I was virtually comatose.We can catch the vast majority of people, but hunting down every last tax dodger is virtually impossible.Torn apart by war, its economy virtually destroyed, this country now faces a very uncertain future.A generation ago, home computers were virtually unknown.The hospital had virtually given her up for dead, but she eventually recovered.\nSMART Vocabulary: related words and phrases\nAlmost\na hop, skip, and a jump idiom\nabout\nalmost\nas good as idiom\nas much as idiom\nbe on the way to something idiom\ngoing on\nintent\nmore\nmore or less idiom\nmuch\npart\nscant\nsub\nthat was close! idiom\nto/for all intents and purposes idiom\nup to (doing) something idiom\nverge\nvirtual\nway\nSee more results »\nvirtually adverb\n(BY COMPUTER)\nB2 using computer technology over the internet, and not involving people physically going somewhere: Nowadays all these things can be experienced virtually. I've learned a lot, and met (virtually and in the real world) a lot of great people. Building a relationship with new employees can be difficult when it's done virtually.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDistant in space and time"}