{"id":400580,"name":"virus","type":"noun","us_sound":"ˈvaɪ.rəs","us_link":"../audio/v/virus.mp3","uk_sound":"ˈvaɪə.rəs","uk_link":"../audio/v/ukvirgi019.mp3","content":"virus noun [C]\n(DISEASE)\nAdd to word list\nAdd to word list\nB2 an extremely small piece of organic material that causes disease in humans, animals, and plants: the chickenpox/flu/herpes/mumps virus Evidence suggested that the AIDS virus was spreading very quickly among the heterosexual community.\nB2 a disease caused by a virus: I don't know exactly what's wrong with her - I think she has some kind of virus. Several employees were off work with a vomiting virus.\nMore examplesFewer examplesA local doctor was the first to raise the alarm about this latest virus.The virus is contracted through exchange of bodily fluids.All the tomato plants are infected with a virus.The doctors have attributed the cause of the illness to an unknown virus.It's possible to pass on the virus to others through physical contact.\nSMART Vocabulary: related words and phrases\nBacteria, moulds, germs & viruses\nadenovirus\naerobe\namoeba\namoebic\nanti-HIV\nantimicrobial\ngnotobiotic\nGram-negative\nGram-positive\nGram-variable\nhen of the woods\nlisteria\nmicrobe\nMRSA\nprobiotic\nretroviral\nroot rot\nrotavirus\nRSV\nsaprozoic\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDisease & illness - general words\nvirus noun [C]\n(COMPUTER PROBLEM)\nB1 a computer program or part of a computer program that can make copies of itself and is intended to prevent the computer from working normally\nExamples\nA computer virus may lurk unseen in a computer's memory, calling up and infecting each of the machine's data files in turn.The virus deletes files and corrupts essential core microchips leaving computers unusable.All their customer information was wiped off the computer by a virus.If you think there may be a virus, don't open the attachment.I got a virus alert when I downloaded my email.\nSMART Vocabulary: related words and phrases\nComputer programming & software\nabandonware\nad blocker\nad blocking\nadware\nanalytics\nCD-ROM\nfacial recognition software\nfactory setting\nfeature-limited\nfemtech\nfile system\nfirmware\nmalware\nprogrammer\nsource code\nspam filter\nspambot\nspeech recognition software\nspellchecker\nspyware\nSee more results »\nvirus noun [C]\n(SMALL ORGANISM)\nAdd to word list\nAdd to word list\nbiology a very small organism that causes disease in humans, animals, and plants\nA virus is also a disease caused by a virus: She’s had a virus for several days.\nvirus noun [C]\n(COMPUTER PROBLEM)\na hidden set of instructions in a computer program that is intended to introduce faults into a computer system or cause it to perform actions that were not planned\nAdd to word list\nAdd to word list\na harmful computer program intended to prevent computers from working normally: All their customer information was wiped off the computer by a virus. I got a virus alert when I downloaded my email. Virus attacks are the largest source of financial loss, followed by unauthorized access. Compare\nbug\nTrojan horseSee also\nanti-virus"}