{"id":400717,"name":"visit","type":"verb","us_sound":"ˈvɪz.ɪt","us_link":"../audio/v/visit.mp3","uk_sound":"ˈvɪz.ɪt","uk_link":"../audio/v/ukvisco007.mp3","content":"Add to word list\nAdd to word list\nA1 [ I or T ] to go to a place in order to look at it, or to a person in order to spend time with them: We visited a few galleries while we were in Prague. Will you visit me when I'm in hospital? When did you last visit the dentist/doctor?\nA2 [ T ] to go to a website on the internet\nMore examplesFewer examplesI want to buy a little something to give to Val when I visit her in hospital.There are several places of interest to visit in the area.I've never been to Kenya, but I hope to visit it next year.I have clear memories of visiting my grandfather's farm as a child.He picked up malaria when he was visiting the country on business.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology\nPhrasal verbs\nvisit something on/upon someone\nvisit with someone\nB1 an occasion when you visit a place or person: We had a visit from the school inspector last week.flying visit I can't stop for a coffee - this is just a flying (= very short) visit. pay a visit (also pay someone/something a visit)\nB2 to visit a person or place, usually for a short time: pay a visit to I think I'll pay a visit to the library while I'm in town.\nSee more\nMore examplesFewer examplesThey received a visit from the police.My uncle paid us a surprise visit yesterday.He gave a talk about his visit to America.The timetable for our trip to Paris includes visits to Notre Dame, the Eiffel Tower and the Louvre.The president's official visit marks the start of a more relaxed relationship between the two countries.\nSMART Vocabulary: related words and phrases\nVisiting\nattraction\nbeard the lion (in his/her den) idiom\nbeen\ncall (in) on someone\ncall by\ncome round\nexchange\nhappen along/by (somewhere)\nhaunt\nhave access to someone/something\nhomestay\nhouse-to-house\npay\npop\nround\nstomping ground\nstop by (somewhere)\nstop in\nstop off somewhere\nstop over\nSee more results »\nAdd to word list\nAdd to word list\nto go to a place in order to experience it, or to go to a person in order to spend time together: [ T ] We visited a few galleries while we were in New York. [ T ] When are we going to visit Grandma? [ I ] She’s not staying here – she’s just visiting for the afternoon. visitor noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈvɪz·ɪ·t̬ər/\nEvery summer, this tiny fishing village receives thousands of visitors."}