{"id":400699,"name":"vision","type":"noun","us_sound":"ˈvɪʒ.ən","us_link":"../audio/v/vision.mp3","uk_sound":"ˈvɪʒ.ən","uk_link":"../audio/v/ukvisco005.mp3","content":"vision noun\n(MENTAL IMAGE)\nAdd to word list\nAdd to word list\nB2 [ C ] an idea or mental image of something: We see in his novels his sinister, almost apocalyptic, vision of the future. Johnny was late home and, as usual, I had visions of him lying dead in some alley.\nThesaurus: synonyms, antonyms, and examples\nimaginationimaginationYou’ve always had a very vivid imagination.creativityThe aim of the award is to encourage creativity and innovation.visionHe was a man of great vision.inventivenessHis domestic designs display an unending inventiveness and account for his best work.ingenuityThis housewife's ingenuity led to the creation of a number of great new household products.originalityHer photographic portraits can hardly be accused of lacking originality.\nSee more results »\n[ C ] an experience in which you see things that do not exist physically, when your mind is affected powerfully by something such as deep religious thought or drugs or mental illness: She had visions in which the angel Gabriel appeared to her.\nMore examplesFewer examplesHis vision is of a world that coheres through human connection rather than rules.Say the word 'Australia' and a vision of beaches and blue seas immediately springs to mind.I had visions of her waiting for us at the station.I had a vision of two old men in clown's outfits.She had a vision of a garden full of trees.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe supernatural - general words\nvision noun\n(VIEW OF THE FUTURE)\nC1 [ U ] the ability to imagine how a country, society, industry, etc. could develop in the future and to plan for this: He didn't have the mental agility or vision required for a senior politician. a person of great artistic vision\nMore examplesFewer examplesSimon has a clear-sighted vision of the company's future.The book offers a vision of the future in which there is a great nuclear apocalypse.The annual arts festival is a monument to her vision and hard work.The people who planned Britain's new towns had a vision of clean modern housing for everyone.The author has a vision of an emerging worldwide Christian communion.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nvision noun\n(ABILITY)\nB2 [ U ] the ability to see: She has very little vision in her left eye. Synonyms\neyesight\nsight (ABILITY TO SEE)\nSMART Vocabulary: related words and phrases\nEyesight, glasses & lenses\naccommodative\nafterimage\nage-related macular degeneration\nAMD\nastigmatic\nbespectacled\nboss-eyed\neyestrain\nhorn-rimmed\nlong-sighted\nmacular degeneration\nmonocular\nmultifocal\nmyopically\nnaked\nnearsighted\nocular\nophthalmology\nsightless\nsty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe senses in general\nvision noun\n(BEAUTIFUL SIGHT)\n[ S ] literary or humorous (used when referring to a person) a beautiful and impressive sight: And that vision of loveliness over there is my wife, Sandra. She emerged from the bedroom, a vision in cream silk.\nSMART Vocabulary: related words and phrases\nBeauty and attractiveness\naesthetic\nattractiveness\nbeauty\nchic\ncrowning glory idiom\ngood looks\ngorgeousness\ngrace\ngracefulness\ngrandeur\nlustre\nlustrously\nmagnificence\nmajestically\nmajesty\nshapeliness\nsplendour\nstateliness\nsublimity\nsultriness\nSee more results »\nvision noun\n(SIGHT)\nAdd to word list\nAdd to word list\n[ U ] the ability to see: good/impaired/blurred vision\nvision noun\n(MENTAL IMAGE)\n[ C ] an imagined mental image of something: We lack a vision of what love really is.\n[ C ] A vision can also be something seen in a dream or as a result of a religious experience.\nvision noun\n(VIEW OF THE FUTURE)\n[ U ] the ability to imagine how a country, society, industry, etc., will develop in the future and to plan in a suitable way: The theater’s director is a woman of great artistic vision.\nvisionary noun [ C ] us\nYour browser doesn't support HTML5 audio\n/ˈvɪʒ·əˌner·i/\na person who is able to imagine how a country, society, industry, etc., will or should develop in the future and to plan in a suitable way: She was a social reformer, a true visionary.\nAdd to word list\nAdd to word list\n[ C or U ] the ability to imagine how something could develop in the future, or the ideas that come from imagining in this way: There's a lack of leadership, a lack of vision, and a lack of organization in the industry as a whole.the vision to do sth The company management had the vision to give its employees a share of the profits. The deal will be the first of several pieces needed to achieve the vision. Unless everyone agrees that this is the vision of the company's future, we can't move forward."}