{"id":400690,"name":"visible","type":"adjective","us_sound":"ˈvɪz.ə.bəl","us_link":"../audio/v/visible.mp3","uk_sound":"ˈvɪz.ə.bəl","uk_link":"../audio/v/ukvisco003.mp3","content":"Add to word list\nAdd to word list\nB2 able to be seen: You should wear something light-coloured when you're cycling at night so that you're more visible. The writing on the tombstone was barely visible. There are few visible signs of the illness that kept her in hospital for so long. The comet should be visible to the naked eye.\nThesaurus: synonyms, antonyms, and examples\nto appearappearOne or two clouds appeared in the sky.be/become visibleAs the beach gets darker, the glow of city lights becomes more visible.show itselfHe believes the impact is showing itself clearly already. emergeA slender figure is seen emerging from the darkness.loomClouds of volcanic ash loomed menacingly overhead.\nSee more results »\nC1 able or likely to attract public attention and be noticed: In a very short period of time, she has become a highly visible national leader.\nMore examplesFewer examplesThe farthest landmark visible is about 30 km away.He had a tattoo on every visible appendage.Unlike acid rain or deforestation, global warming has no visible manifestation .The logo was still visible but less obtrusive this time in beige.The pinnacles of the Himalayas were visible above the clouds.\nSMART Vocabulary: related words and phrases\nVisible\ndiscernibly\neye-catching\nfront and centre\nfull\ngoldfish bowl\nhigh-visibility\nintervisibility\nlarge\nnoticeable\nout\nperceivable\nperceivably\nprominent\nprominently\nrelief\nshow\nsore\nstand\nstick out\nvisibility\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nApparent and obvious\nAdd to word list\nAdd to word list\nable to be seen: There are few visible signs of her recent illness. The comet is visible to the naked eye as a fuzzy ball in the western sky.\nVisible also means able or tending to attract public attention: In a very short time, she became a highly visible environmental spokesperson."}