{"id":400778,"name":"visualize","type":"verb","us_sound":"ˈvɪʒ.u.əl.aɪz","us_link":"../audio/v/visualize.mp3","uk_sound":"ˈvɪʒ.u.əl.aɪz","uk_link":"../audio/v/ukvisco014.mp3","content":"Add to word list\nAdd to word list\nto form a picture of someone or something in your mind, in order to imagine or remember them: I was so surprised when he turned up - I'd visualized someone much older. Write down your goals and visualise yourself achieving them. Sometimes you can visualize what you want to do but you just can't do it.\nThesaurus: synonyms, antonyms, and examples\nto imagine somethingimagineYou can just imagine her storing up these anecdotes for her dinner parties.think ofI want you to think of a time when you felt happy.pictureCan you picture yourself at the age of 60 doing what you do now?pictureWhen I say 'your car' you have a picture of that in your head.in your mind's eyeIn my mind's eye, I'm still a uni student and not a middle-aged worker.conceiveI can't conceive why anyone would want to hurt her.\nSee more results »\nscience\n&#160; specialized to make something able to be seen: An echocardiogram can accurately visualise the motion of the heart's walls. Enzyme activity was visualized as a yellowish staining on a green background.\nMore examplesFewer examplesFirst of all, before I have begun to paint, I visualise how the painting will appear.He could visualise a successful future for himself.She explained that good readers visualize what they're reading.Significant improvement in resolution was achieved once the crystals were visualized by cryoelectron microscopy.It wasn't until the 1920s that a feasible technique could be devised for adequately visualizing the urological tract.\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nvision\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nVisible\nScientific techniques\nRelated word\nvisualization\nAdd to word list\nAdd to word list\nto imagine or remember someone or something by forming a picture in your mind: I was so surprised when I saw him – I’d visualized someone much older. visualization noun [ C/U ] us/ˌvɪʒ·u·ə·ləˈzeɪ·ʃən/\nOnce people become aware of how they react, they can develop positive habits through visualization."}