{"id":400797,"name":"vital","type":"adjective","us_sound":"ˈvaɪ.t̬əl","us_link":"../audio/v/eus74876.mp3","uk_sound":"ˈvaɪ.təl","uk_link":"../audio/v/ukvisco017.mp3","content":"vital adjective\n(IMPORTANT)\nAdd to word list\nAdd to word list\nB2 necessary for the success or continued existence of something; extremely important: A strong opposition is vital to a healthy democracy. She had found out some information of vital importance. The kidney plays a vital role/part in the removal of waste products from the blood. [ + that ] It's absolutely vital that you do exactly as I say. [ + to infinitive ] It is vital to get medical supplies to the area as soon as possible.\nMore examplesFewer examplesIt was said that the police concealed vital evidence.The exploration for new sources of energy is vital for the future of our planet.Mr Clinton singled out education as a vital tool in bridging the gap between rich and poor.These monuments are a vital part of the cultural heritage of South America.Trust is a vital ingredient in a successful marriage.\nSMART Vocabulary: related words and phrases\nVery important or urgent\nall-important\nat all costs idiom\nbe a matter of life and/or death idiom\ncardinally\nchief\nimperative\nleading\nlife-altering\nlife-and-death\nlife-changing\nmainly\noverriding\nprimary\nprime\nprincipally\nprior\nprized\nseminal\ntectonic\nweighty\nSee more results »\nvital adjective\n(LIVELY)\nformal approving energetic: He had never felt so vital and full of life.\nformal relating to life\nSMART Vocabulary: related words and phrases\nEnergetic and lively\nalive\nastir\nbarnstorming\nbe alive and well/kicking idiom\nbe as fresh as a daisy idiom\nbe full of beans idiom\nboisterous\ncrackling\nfreshness\nfriskily\nfrisky\nfrolicsome\nfury\nrambunctiously\nre-energize\nrefreshed\nrefreshingly\nrejuvenate\nzestily\nzesty\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLife and living\nRelated word\nvitally\nAdd to word list\nAdd to word list\nnecessary or extremely important for the success or continued existence of something: The existence of a strong opposition is vital to a healthy democracy. The kidneys play a vital role/part in removing waste from the blood. [ + that clause ] It’s vital that you respond at once. vitally adverb us\nYour browser doesn't support HTML5 audio\n/ˈvɑɪ·t̬əl·i/\nIt’s vitally important that we get there by tomorrow."}