{"id":401206,"name":"vocative","type":"noun","us_sound":"ˈvɑː.kə.t̬ɪv","us_link":"../audio/v/cdo0318usvoca5484.mp3","uk_sound":"ˈvɒk.ə.tɪv","uk_link":"../audio/v/cdo0318ukvoca1541.mp3","content":"the vocative\nAdd to word list\nAdd to word list\n[ S ] (also the vocative case) the form of a noun, pronoun, or adjective that is used in some languages when you are talking to someone or something: I cannot remember ever hearing her use my first name in the vocative.\n[ C ] a word in the vocative case, or a word that is used to address someone: We recorded the use of vocatives such as \"Natalie\" in \"I like my tea strong, Natalie\".\nMore examplesFewer examples In Et tu, Brute, the last word is not the English word brute but the vocative case of Latin Brutus.He was the only living person whom she had ever heard using the vocative case.We respond to God with the vocative as we respond to each other.For this purpose utterances starting with vocatives such as Mommy, and negatives such as No, were ignored if they had been transcribed with the vocative comma.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominative\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nrelating to words used in the vocative case: The sentence begins with a vocative phrase, a call upon the deity.\nMore examplesFewer examplesYuan's eyes flickered at the vocative title \"sei-sen\" - \"sword bearer\". The critic borrows a term from classical grammar and calls it Whitman's \" vocative technique.\"\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominative\nparticle\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »"}