{"id":401276,"name":"voice","type":"noun","us_sound":"vɔɪs","us_link":"../audio/v/voice.mp3","uk_sound":"vɔɪs","uk_link":"../audio/v/ukviva_028.mp3","content":"voice noun\n(SOUNDS)\nAdd to word list\nAdd to word list\nB1 [ C ] the sounds that are made when people speak or sing: has a loud/quiet/soft voice She has a loud/quiet/soft voice. a low-pitched/high-pitched voice a booming/breathy/clear/deep/fruity/gravelly/husky/squeaky voice a baritone/soprano singing voice You could tell from her voice that she wasn't pleased.in a quavering voice \"I don't know what you mean,\" said Fran in a quavering voice.lower your voice She lowered her voice to a whisper.raise your voice You'll have to raise your voice (= speak louder) if you want to be heard in here.lose your voice I have a cold and I think I'm losing my voice (= becoming unable to speak).voice is breaking He's at that age when his voice is breaking (= changing from a boy's to a man's).voice-activated She's done a lot of work with voice-activated computers. be in good voice\nto be singing well: The choir seems to be in good voice today!\nSee more\nMore examplesFewer examplesSometimes she speaks in this silly, girly voice.I heard a voice from the cupboard shouting \"Let me out!\"I had to raise my voice to make myself heard over the noise.My mother had a beautiful singing voice when she was younger.I could hear the babble of voices in the next room.\nSMART Vocabulary: related words and phrases\nDescribing qualities of the human voice\nadenoidal\nbe dripping with something idiom\nboomy\nbreathy\nbrittle\nchocolatey\ngruff\nliltingly\nmulti-voiced\nnasally\npitchy\npurringly\nreedy\nsoft-spoken\nstrangled\ntoned\ntoneless\nvocally\nvoiced\nwispily\nSee more results »\nvoice noun\n(OPINION)\nC2 [ C often singular, U ] an expression of opinion, or the right to express your opinion: There was only one dissenting voice during the discussion.make your voice heard Unfortunately a strike was the only way to make our voices heard.the voice of The committee represents the voice of the students. Developing countries are demanding a stronger voice (= right to express opinions) in the debate.give someone a voice Millions of women sit in silence and loneliness. Give them a voice, please. Members themselves say being part of a national union gives them a voice to fight for their rights.\nC2 [ S ] an important quality or opinion that someone expresses, or the person who is able to express it: voice of reason She just won't listen to the voice of reason.voice of experience I wouldn't work for Peter if I were you - this is the voice of experience talking!\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHuman rights\nSpeakers & talkers\nvoice noun\n(GRAMMAR)\n[ S ]\n&#160; language\n&#160; specialized the relationship between the subject of the verb and the action described by the verb, or the forms of a verb that show this relationship: active/passive voice The verb in the first sentence is in the active/passive voice.\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\nIdioms\ngive voice to something\nvoice within you\nwith one voice\nC2 to say what you think about a particular subject, especially to express a doubt, complaint, etc. that you have about it: I have voiced my objections to the plan to management.\nphonetics\n&#160; specialized to produce a sound by making the vocal cords move very quickly several times\nSMART Vocabulary: related words and phrases\nExpressing and asking opinions\namirite\napothegm\ncouch\nday\neditorialize\nexpress\nfar\nmind\nput something across\nput something over/across\nput your head over/above the parapet idiom\nre-poll\nrun something by someone\nsound\nstatement\nultracrepidarian\nventilate\nventilation\nvocalize\nvociferous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLinguistics: phonology & phonetics\nvoice noun [C/U]\n(SOUNDS)\nAdd to word list\nAdd to word list\nthe sound made when people speak or sing, or the ability to make such a sound: [ C ] She spoke in a low, soft voice, and I had to ask her to speak louder. [ C ] I heard the murmur of voices. [ C ] I’ve been talking so much that my voice is getting hoarse. [ U ] I’ve got a cold and I’m losing my voice (= becoming unable to speak).\nvoice noun [C/U]\n(OPINION)\nan expression of opinion, or the right to express an opinion: [ C ] The senator added his voice to the protest. [ U ] The kids want to have a voice in where we go on our vacation.\nvoice noun [C/U]\n(GRAMMAR)\n[ C ]\n&#160; grammar us/vɔɪs/ the relationship between the subject of the verb and the action described by the verb, or the forms of a verb that show this relationship\nvoice verb [T]\n(OPINION)\nto express esp. an opinion or feeling: Opponents also voiced concern about the potential traffic produced by the project."}