{"id":401347,"name":"volatile","type":"adjective","us_sound":"ˈvɑː.lə.t̬əl","us_link":"../audio/v/eus74891.mp3","uk_sound":"ˈvɒl.ə.taɪl","uk_link":"../audio/v/ukvoila003.mp3","content":"volatile adjective\n(CHANGING)\nAdd to word list\nAdd to word list\nlikely to change suddenly and unexpectedly, especially by getting worse: Food and fuel prices are very volatile in a war situation. The situation was made more volatile by the fact that people had been drinking a lot of alcohol.\nThesaurus: synonyms, antonyms, and examples\nalways becoming differentchangingWe must navigate changing attitudes about women in leadership.changeableBritish weather is notoriously changeable.variedHe has had a rich and varied career.fluidOur travel plans are fluid because of the train strike.dynamicThe Japanese economy is much more dynamic than our own.\nSee more results »\nlikely to change emotional state very suddenly, especially by becoming angry: He had a volatile temper and couldn't have been easy to live with. She is volatile and unreliable.\nMore examplesFewer examplesEarnings are very volatile in this business.the danger of getting oil supplies from politically volatile parts of the worldFor now, stock markets remain extremely volatile.She was portrayed as over-sensitive and volatile.\nSMART Vocabulary: related words and phrases\nChanging frequently\ncapricious\ncapriciously\ncapriciousness\nchangeable\nchangeful\ninconsistency\ninconsistent\ninconsistently\ninconstant\ninconstantly\npatchiness\npatchy\nping-pong\nprotean\nraggedly\nunpredictable\nvariability\nvolatility\nyo-yoing\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoods\nAngry and displeased\nvolatile adjective\n(OF SUBSTANCE)\nchemistry\n&#160; specialized A volatile liquid or solid substance will change easily into a gas: The substance is highly volatile. volatile compounds\nMore examplesFewer examplesThere are different rules for ships carrying highly volatile cargo, such as oil.Fruit release volatile compounds which attract animals and insects.\nRelated word\nvolatility\nAdd to word list\nAdd to word list\nlikely to change suddenly and unexpectedly, or suddenly violent or angry: It was a volatile situation, and the police handled it well. The stock market was highly volatile in the early part of the year.\nchemistry If a substance, esp. a liquid, is volatile, it will change easily into a gas: volatile chemicals volatility noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌvɑl·əˈtɪl·ɪ·t̬i/\nVolatility in wheat on Wednesday resulted in a single-day trading record in Kansas City.\nAdd to word list\nAdd to word list\nlikely to change often or suddenly and unexpectedly: American technology shares remain volatile. a volatile fund/investment/market Property has always been less volatile than shares or gilts. volatility noun [ U ]\nSome investors are nervous about market volatility."}