{"id":401512,"name":"volume","type":"noun","us_sound":"ˈvɑːl.juːm","us_link":"../audio/v/volume.mp3","uk_sound":"ˈvɒl.juːm","uk_link":"../audio/v/ukvoila018.mp3","content":"volume noun\n(AMOUNT)\nAdd to word list\nAdd to word list\n[ C or U ] the amount of space that is contained within an object or solid shape: Which of these bottles do you think has a greater volume?\nB2 [ U ] the number or amount of something in general: It's the sheer volume of traffic in the city that is causing the problems.\nMore examplesFewer examplesOne box may look bigger than the other, but in fact they are roughly equal in volume.Local activist groups have become increasingly vociferous as the volume of traffic passing through the village has grown.What is the volume of the water tank?I think this pan has a larger volume than yours.The transport system can't cope with the volume of passengers.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nload\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMass, area, weight & volume in general\nvolume noun\n(SOUND LEVEL)\nB1 [ U ] the level of sound produced by a television, radio, etc., or the switch or other device controlling this: Could you turn the volume down, please, I'm trying to sleep. I'll turn it up if you tell me which one is the volume (= switch).\nMore examplesFewer examplesTurn the little knob to adjust the volume.We told them to crank up the volume.The volume of music from the club has caused complaints.They try to make up for their lack of musical talent by sheer volume.The music will sound better if you adjust the volume of the bass.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\nvolume noun\n(BOOK)\nC2 [ C ] one in a set of related books: The second volume of his memoirs will be published later this year.\nC2 [ C ] formal a book: She took a slim volume down from the shelf. a volume of poetry\nMore examplesFewer examplesHe lifted a fat volume down from the shelf.Waugh's first volume of memoirs dealt with his childhood and youth.He penetrates deeper into the artist's life in the second volume of his autobiography.She picked up a thick volume and began to read out loud.This is the eighth volume in the series, which totals 21 volumes in all.\nSMART Vocabulary: related words and phrases\nBooks: kinds of books\nabridgment\nannual\nanthology\naudiobook\nbacklist\ndigest\ndime novel\ne-reader\neasy read\nexercise book\nmulti-volume\nmust-read\nnovel\nnovelette\nnovelistic\ntome\ntrilogy\nvade mecum\nworkbook\nya\nSee more results »\nvolume noun\n(SPACE)\nAdd to word list\nAdd to word list\n[ C/U ] an amount of space having length, height, and width: [ C ] You need a big air conditioner to cool a large volume of space. [ U ] About 8 percent of the total volume of garbage is plastic packaging.\nvolume noun\n(AMOUNT)\n[ C usually sing ] the number or amount of something having a lot of units or parts: The main difficulty with teaching is the sheer volume of work. The system could not handle the volume of electronic mail. We are looking for a high volume of sales.\nvolume noun\n(SOUND LEVEL)\n[ U ] the level of sound produced by a television, radio, etc., or the switch or other device controlling this: Could you turn the volume down, please – I’m trying to sleep.\nvolume noun\n(BOOK)\n[ C ] a book, esp. one book in a set of related books: a slim volume of poetry I’m missing the last volume of the set.\nAdd to word list\nAdd to word list\nthe amount of space that is contained within an object, or that is filled by an object or substance: What is the volume of the fuel tank?\nthe total number or amount of something: The helpline could not handle the volume of calls from people having problems.by volume The company is now the number one swimwear retailer by volume. Imports of consumer goods have risen in volume by 10%. Retail sales volumes rose by 5.4% in the year to May in Sweden.\nSTOCK MARKET the total number of shares that are bought or sold on a stock market within a particular period of time: Trading volume totaled more than 2.8 million shares. The average daily volume has been 700,860 shares a day for the past three months.heavy/light/moderate volume There could be volatility before year-end due to light volume.\nin volume\nin large quantities: They will not begin manufacturing the laptop in volume unless they have firm commitments from buyers. The company will begin shipping in volume next month. See also\nhigh volume\nlow volume\nsales volume"}