{"id":401549,"name":"volunteer","type":"noun","us_sound":"ˌvɑː.lənˈtɪr","us_link":"../audio/v/volunteer.mp3","uk_sound":"ˌvɒl.ənˈtɪər","uk_link":"../audio/v/ukvoila022.mp3","content":"Add to word list\nAdd to word list\nB2 a person who does something, especially helping other people, willingly and without being forced or paid to do it: The health clinic is relying on volunteers to run the office and answer the phones. Since it would be a highly dangerous mission, the Lieutenant asked for volunteers. It's a volunteer army with no paid professionals. Compare\nconscript verb mainly UK\ndraftee US\nMore examplesFewer examplesAs a volunteer on the childcare project, I really saw life.He emphasized that all the people taking part in the research were volunteers.We're saving money by using volunteers.She placed her name on the list of volunteers.Charities such as Oxfam are always trying to recruit volunteers to help in their work.\nSMART Vocabulary: related words and phrases\nOrganizations - charities\naid\nalms\nbenevolence\nbenevolent\nbenevolent society\nbutton day\ncharity\ncharity begins at home idiom\ncharity box\ndebt relief\nfood pantry\nfoundation\ngoodwill\nnon-profit\nnon-profit-making\nnot-for-profit\nOxfam\nthe Red Crescent\nthe Red Cross\nwalkathon\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFreedom to act\nC1 [ I or T ] to offer to do something that you do not have to do, often without having been asked to do it and/or without expecting payment: [ + to infinitive ] During the emergency many staff volunteered to work through the weekend. He volunteered for the army (= he joined even though he did not have to). I volunteered myself for the position of Health and Safety Representative.humorous My friends volunteered me to do the talking.\n[ T ] to give information without being asked: If I were you, I wouldn't volunteer any details of what happened. [ + speech ] \"I saw her going out of the main entrance half an hour ago,\" he volunteered.\nMore examplesFewer examplesYou can accuse me of cowardice, but I still wouldn't volunteer to fight in a war.I volunteered to do the washing up.Many women volunteered to work as nurses in the war.Did anybody volunteer to tidy up?They all volunteered to help with the digging.\nSMART Vocabulary: related words and phrases\nAccepting & agreeing\nacceptance\naccepting\naccommodation\naccreditation\nagree to something\nagree with something\ncompact\nconcordance\nconsensual\ncurrency\nrapprochement\nratification\nre-establish\nregrant\nrevalidate\nrevalidation\nrise to the bait idiom\nroot\nrule\nwithout a murmur idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying & uttering\nAdd to word list\nAdd to word list\na person who does something, esp. for other people or for an organization, willingly and without being forced or paid to do it: The charity relies on volunteers to run the office and answer the phones.\nto do something, esp. for other people or for an organization, willingly and without being forced or paid to do it: [ + to infinitive ] During the emergency a lot of people volunteered to work through the night. [ T ] Three physicians volunteered their services.\nAdd to word list\nAdd to word list\na person who does a job or some work without being paid or forced to do it: They employ 1,000 people and 23,000 volunteers. I will ask for volunteers to help with the search.\nto offer to do something without being paid for it or without being asked to do it: If they're short of helpers, I could volunteer.volunteer to do sth I volunteered to do the accounting.volunteer for sth He volunteered for early retirement.volunteer sb for/to do sth He volunteered his wife for the job. More residents need to step forward and volunteer time and energy.\nused to describe someone who works without expecting payment, or the work they do: volunteer staff/workersa volunteer doctor/firefighter/lawyer The legal advice centres are staffed by volunteer lawyers. Her volunteer work took up most of her free time. Compare\npaid"}