{"id":401536,"name":"voluntary","type":"adjective","us_sound":"ˈvɑː.lən.ter.i","us_link":"../audio/v/voluntary.mp3","uk_sound":"ˈvɒl.ən.tər.i","uk_link":"../audio/v/ukvoila021.mp3","content":"Add to word list\nAdd to word list\nC1 done, made, or given willingly, without being forced or paid to do it: She does voluntary work for the Red Cross two days a week. They chose to take voluntary redundancy. voluntary workers\nA voluntary organization is controlled and supported by people who give their time and money to it without being paid, and that exists to help other people: The hospital has asked various voluntary organizations to help raise money for the new operating theatre. the voluntary sector\nMore examplesFewer examplesAs a woman of independent means, she spent most of her life in voluntary work.The union remains obdurate that any redundancies must be voluntary.Most of our staff work for us on a voluntary basis .She took voluntary redundancy.Since retiring from the company, she has done voluntary work for a charity.\nSMART Vocabulary: related words and phrases\nFreedom to act\n(as) free as a bird idiom\nagency\nat will idiom\nautonomist\nautonomous\nblank cheque\nfree hand\nfree pass\nfree rein idiom\nfree spirit\nfree time\nno holds barred idiom\nnon-didactic\nnon-directed\nnon-restricted\nnon-restrictive\nthe world is someone's oyster idiom\nwalk free idiom\nwiggle room\nwriggle room\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOrganizations - charities\nRelated word\nvoluntarily\nAdd to word list\nAdd to word list\ndone, made, or given willingly, without being forced or paid to do it: Employees can make voluntary contributions to the savings plan of up to 25% of their earnings. Karyn leads after-school workshops that students attend on a voluntary basis. voluntarily adverb us\nYour browser doesn't support HTML5 audio\n/ˌvɑl·ənˈteər·ə·li/\nShe voluntarily gave up her lunch break to supervise the lab.\nAdd to word list\nAdd to word list\ndone, made, or given without being forced or paid: Currently, recall of products is voluntary. Any staff reductions will be made on a voluntary basis.voluntary service/work She does voluntary work in several hospitals.\nused to describe an organization that is supported by people who give their time and money to it without being paid, and that exists to help other people: He works in the voluntary sector. It is an independent voluntary organisation providing money advice. voluntarily adverb\nDid she leave voluntarily?"}