{"id":401640,"name":"voodoo","type":"noun","us_sound":"ˈvuː.duː","us_link":"../audio/v/voodoo.mp3","uk_sound":"ˈvuː.duː","uk_link":"../audio/v/ukvoila027.mp3","content":"Add to word list\nAdd to word list\na religion, influenced by traditional African religions, that involves magic and attempts to communicate with spirits and dead people, common in parts of the Caribbean, especially Haiti, and in parts of the southern United States : About half of Haiti's population is thought to practise voodoo in some form, although many follow other religious beliefs at the same time. The musical explores Haiti's rich artistic heritage and the religion of Vodou. She is a Haitian voudou priestess who has lived in New York since the 1960s.\nmagic or a curse (= magic words that are intended to bring bad luck to someone): There’s no voodoo involved in cooking juicy, tender steak—just two simple steps. They felt as if there was some sort of voodoo on the band, because everything just went wrong.\nMore examplesFewer examplesHaitian voodoo is a religion that holds memories of Africa and Haiti’s past.They believe that there's a spirit in everything, in every tree, in the sun, in the sea, and that if you understand voodoo, you can talk to these spirits.The witch doctor marked the area with grey powder, a clear warning to believers in voodoo, the nation's dominant religion. There is a current spiritual revival of voodoo in New Orleans.\nSMART Vocabulary: related words and phrases\nReligions & religious groups\nAbrahamic\nAfrican Methodist Episcopal Church\nAME\nanti-Catholicism\nanti-Christianity\nevangelicalism\nfaith-based\nFree Church\nGnosticism\nmulti-religious\nneo-paganism\nnon-established\npaganism\nPentecostalism\nSufism\nSunni\nsuper-church\nTaoism\nTaoist\nthe God squad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMagic\nGood luck and bad luck\nrelating to or used in the practice of the religion voodoo: She claimed that a voodoo curse had forced her to commit the crime. They found a spooky voodoo doll with pins stuck into it. The room also contains a collection of sequined Vodou dolls. I mentioned my trip to Haiti and the voudou ceremonies I saw.\nMore examplesFewer examplesHe is said to have placed a voodoo curse on the director after he was dropped from a movie role.When he was just starting out on his career, he carried out voodoo rituals to bring luck. She was both a devout Roman Catholic and a voodoo priestess.\nSMART Vocabulary: related words and phrases\nReligions & religious groups\nAbrahamic\nAfrican Methodist Episcopal Church\nAME\nanti-Catholicism\nanti-Christianity\nevangelicalism\nfaith-based\nFree Church\nGnosticism\nmulti-religious\nneo-paganism\nnon-established\npaganism\nPentecostalism\nSufism\nSunni\nsuper-church\nTaoism\nTaoist\nthe God squad\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReligious objects\nAdd to word list\nAdd to word list\na religion involving magic that began in Africa and developed in Haiti"}