{"id":401703,"name":"vote","type":"verb","us_sound":"voʊt","us_link":"../audio/v/vote.mp3","uk_sound":"vəʊt","uk_link":"../audio/v/ukvorte004.mp3","content":"Add to word list\nAdd to word list\nB1 to express your choice or opinion, especially by officially writing a mark on a paper or by raising your hand or speaking in a meeting: vote in She was too young to vote in the election.vote on The committee voted on the proposal, and accepted it unanimously.vote for/against Did you vote for or against the motion? Over 55 percent voted Democrat. [ + to infinitive ] Employees voted to accept the offer of an eight percent pay rise. [ + (that) ] I vote (that) we (= I think we should) go to the cinema first and eat afterwards. [ + obj + noun ] The evening was voted a tremendous success (= this was most people's opinion).vote someone onto something It was the younger members who voted Smith onto the committee.be voted into/out of office The Conservative Party was voted into/out of office (= was chosen in an election to become/stop being the government).\nMore examplesFewer examplesCivil rights include freedom, equality in law and in employment, and the right to vote.Only people over 18 are eligible to vote.Now that we've heard all the arguments for and against the proposal, shall we vote on it?Only 40 percent of people bothered to vote in the election.Put a cross next to the name of the candidate you want to vote for.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nIdioms\nvote with your feet\nvote with your wallet\nvote something up or downPhrasal verbs\nvote something down\nvote something through\nvote something up\nB1 [ C ] the act of showing your choice or opinion in an election or meeting by writing an X on an official piece of paper or putting your hand up: The suggestion was approved, with 25 votes in favour, and seven against.cast your vote She cast her vote (= voted) for the Independent candidate.\nB2 [ C usually singular ] a way of making a decision by asking a group of people to vote: take/hold a vote on We called a meeting in order to take/hold a vote on the issue. the vote [ S ]\nthe total number of votes given or received in an election: take ... of the vote The party took 25 percent of the vote.\nC1 the fact of being officially allowed to vote: have the vote In some countries women still don't have the vote. put something to the/a vote\nto vote on something: The proposal was read out and then put to the vote.\nSee more\nMore examplesFewer examplesIn a historic vote, the Church of England decided to allow women to become priests.With nearly all the votes counted, Mr Soto had polled 67 percent of the vote.There were ten votes in favour, six against, and three abstentions.We're still waiting for the votes to be counted up.The proposal to change the rules was narrowly defeated by 201 votes to 196.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote something through\nvoting\nvoting booth\nvoting machine\nvoting slip\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies to express your choice or opinion as one member of a group in order to decide a matter of importance to the whole group or to elect someone to an office: [ I ] I voted early this morning just after the polls opened. [ I ] In a democracy, all adult citizens have the right to vote. [ I ] Local residents have twice voted against raising property taxes. [ I ] Who did you vote for in the last election? [ + to infinitive ] A majority of workers voted to accept the offer of an 8% pay raise. [ T ] She was voted best director at the Cannes Film Festival.\nAdd to word list\nAdd to word list\nto express your choice or opinion, especially by writing a mark on an official paper or by raising your hand: Are you eligible to vote? She was voted Britain's best boss.vote for/against sb/sth They voted for a strike.vote in favour of sth A slim majority of shareholders voted in favor of the changes.vote on sth Union members will vote on the agreement next week.vote to do sth The monetary policy committee voted to keep rates at 3.75%.vote sb in/out He was voted in as president. Phrasal verbs\nvote sth down\nvote sth through\na choice that someone makes in an election or meeting especially by writing a mark on an official paper or by raising their hand: We lost by 524 votes. About 120 million Americans cast a vote in the election.a vote for/against sb/sth He was heavily criticized for his vote against raising the minimum wage. But a president always casts the deciding vote.\na method of making a decision by asking a group of people to vote: The bill still faces a final vote.lose/win a vote The leadership was shocked when they lost this vote.a vote on sth He faces a vote on his future at an annual meeting next week.have/hold/take a vote (on sth) They held a vote on the company's new name.\nthe vote\nthe total number of votes that are made: He won 51% of the vote.\nthe right to vote: As an expatriate I don't have the vote. See also\nblock vote\ncasting vote"}