{"id":401727,"name":"voucher","type":"noun","us_sound":"ˈvaʊ.tʃɚ","us_link":"../audio/v/voucher.mp3","uk_sound":"ˈvaʊ.tʃər","uk_link":"../audio/v/ukvorte008.mp3","content":"Add to word list\nAdd to word list\na piece of paper that can be used to pay for particular goods or services or that allows you to pay less than the usual price for them: The voucher is valid between July and December and entitles you to ten percent off all overseas flights.\n[ usually plural ] (also education voucher, school voucher) in the US, a scholarship (= money to pay for studies) that allows a student to attend a private school rather than a state school: Suburban voters are completely against vouchers.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBills & invoices\nAdd to word list\nAdd to word list\na piece of paper that is a record of money paid or one that can be used to pay for particular goods or services: Just present your travel voucher to the airline ticket agent, and she will give you the tickets.\nAdd to word list\nAdd to word list\na printed piece of paper used to pay for particular goods or services, or to pay less than the usual price: Anyone spending $25 or more will get a $5 voucher to spend. The company will pay most of the settlement in shares and discount vouchers. a clothing/food/housing/travel voucher The Inland Revenue wants to know about employee benefits, including vouchers for food and drink.\nACCOUNTING a piece of paper that shows that money has been paid for something or that someone's accounts are correct: You should keep all copies of sales vouchers to check off against statements. He demanded that they go back until each overtime voucher could be matched with a specific job. Unfortunately the payroll vouchers weren't being reviewed by managers. See also\ngift voucher"}