{"id":401752,"name":"vow","type":"verb","us_sound":"vaʊ","us_link":"../audio/v/vow.mp3","uk_sound":"vaʊ","uk_link":"../audio/v/ukvorte010.mp3","content":"Add to word list\nAdd to word list\nC2 to make a determined decision or promise to do something: [ + (that) ] The guerrillas vowed (that) they would overthrow the government. [ + to infinitive ] After the awful meals we had last Christmas, I vowed to do more of the cooking myself.\nThesaurus: synonyms, antonyms, and examples\nto promise someone somethingpromiseI promise that I'll be home before dark.guaranteeI can't guarantee that the operation will be successful.give (someone) your wordHe gave me his word that the job would be finished on time.assure\"Don't worry, your car will be ready tomorrow\", the mechanic assured him.swearI didn't know what happened, I swear.pledgeWe are asking people to pledge their support for our campaign.\nSee more results »\nMore examplesFewer examplesFrom that day on, she vowed never to trust him again.After a lengthy and painful divorce, she vowed never to remarry.She has vowed to stand by her husband during his trial.She has vowed to remain true to the president whatever happens.Tamir, one of several sons of the exiled ruler, vowed he would liberate his country from the tyrant.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nwarranty\nwelch\nSee more results »\nC2 a serious promise or decision: [ + to infinitive ] She took/made a vow never to lend money to anyone again. Synonyms\nassurance (PROMISE)\nbond (PROMISE)\ncommitment\nguarantee\noath (PROMISE)\npledge\npromise (SAY CERTAINLY)\nundertaking (PROMISE) formal\nword (PROMISE)\nMore examplesFewer examplesCistercian monks and nuns take a vow of silence.He took a vow to abstain from alcohol.As a monk, he took vows of chastity, poverty and obedience.They decided to renew their wedding vows.\nSMART Vocabulary: related words and phrases\nMaking & breaking promises & commitments\nbe on your honour idiom\nbond\nbreach\nbreach of contract\ncovenant\ncross my heart (and hope to die) idiom\ndeliver\nfink\ngo back on something\nHippocratic oath\npromise\nrepledge\nswear someone in\nundeliverable\nundelivered\nundertake\nundertaking\nunkept\nwarranty\nwelch\nSee more results »\nAdd to word list\nAdd to word list\nto make a firm promise or decision to do something: [ + (that) clause ] They vowed (that) they would never forget her kindness. [ + to infinitive ] After my illness I vowed to exercise every day. vow noun [ C ] us\nYour browser doesn't support HTML5 audio\n/vɑʊ/\nThey exchanged marriage vows in a Manhattan courthouse."}