{"id":401861,"name":"vulgarity","type":"noun","us_sound":"vʌlˈɡer.ə.t̬i","us_link":"../audio/v/eus74903.mp3","uk_sound":"vʌlˈɡær.ə.ti","uk_link":"../audio/v/ukvorte024.mp3","content":"vulgarity noun [U or C]\n(BAD TASTE)\nAdd to word list\nAdd to word list\n[ U ] the quality of not being suitable, simple, or beautiful, or not in the style preferred by rich or well- educated people: He despised modern culture for its commercialism and vulgarity. Popular movies often have a kitschy vulgarity that can be irresistibly entertaining. See\nvulgar\nMore examplesFewer examplesThis toy is for design-conscious adults who would never allow kitsch vulgarity into their house.You could see young women producing embroidered pictures of such extreme vulgarity you wanted to cry.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngopping\ngracelessly\nhatchet-faced\nhave a face like the back end of a bus idiom\nhideous\nhideousness\npretty\npretty-pretty\nputridly\nreptilian\nscrappily\nunshapely\nunsightly\nvulgarly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nUnsuitable and unacceptable\nvulgarity noun [U or C]\n(RUDENESS)\n[ C or U ] the quality of being rude and likely to upset or anger people, especially by referring to sex or the body, or something such as a phrase that is rude in this way: We will not post any comments that contain vulgarity. The restaurant established a standard of behaviour for employees, prohibiting extreme vulgarities. See\nvulgar\nMore examplesFewer examplesQuick to anger, he calls both his aides and political enemies unprintable vulgarities.He isn't coarse or vulgar; he uses coarseness and vulgarity for a purpose.I hated the idea of going in there among all those journalists with their good-natured vulgarity.\nSMART Vocabulary: related words and phrases\nRude and cheeky\ncheekily\ncheekiness\nchurlishly\nchurlishness\ncoarse\ncoarsely\nfruity\ngall\ngraceless\nincivility\nobnoxiously\nobnoxiousness\noffensively\noffensiveness\npertly\npresume\nscatological\nunpleasant\nunprintable\nunrepeatable\nSee more results »"}