{"id":401885,"name":"vulnerable","type":"adjective","us_sound":"ˈvʌl.nɚ.ə.bəl","us_link":"../audio/v/vulnerable.mp3","uk_sound":"ˈvʌl.nər.ə.bəl","uk_link":"../audio/v/ukvorte027.mp3","content":"Add to word list\nAdd to word list\nC2 able to be easily physically or mentally hurt, influenced, or attacked: I felt very vulnerable, standing there without any clothes on. It is on economic policy that the government is most vulnerable. Tourists are more vulnerable to attack, because they do not know which areas of the city to avoid. Opposite\ninvulnerable\nThesaurus: synonyms, antonyms, and examples\nnot physically strongweakShe was too tired and weak to finish the race. feebleMany of the pensioners were so feeble they had to be stretchered onto the ship.punyHe was puny as a child.weedyUK I was just this weedy guy who always had his head in a book.frailA frail, grey-haired lady walked slowly down the street.\nSee more results »\nMore examplesFewer examplesAlison's story is a reminder of how vulnerable women can be in what is still essentially a man's world.Start-ups are very vulnerable in the business world.Small companies such as ours are very vulnerable in a recession.These schools are known to be vulnerable to vandalism.We provide a place of safety for vulnerable children.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nRelated word\nvulnerability\nthe vulnerable\npeople who can be easily physically or mentally hurt, influenced, or attacked: She called on all members to condemn this outrageous attack on the vulnerable.\npeople who can be badly affected by a disease because they already have health problems: Our Covid vaccination strategy is designed to protect the vulnerable, who are most at risk.\nMore examplesFewer examplesHuman rights groups claim that the business preys on the poor and the vulnerable. In the story she highlights the very real impact of the drug trade on the vulnerable. People said that the new law was going to exploit the vulnerable and marginalize the poor.It takes some courage to champion the vulnerable, the sick, and the weak.\nSMART Vocabulary: related words and phrases\nWeakness and vulnerability\nAchilles heel\nat a low ebb idiom\nbe (only) flesh and blood idiom\nbe someone's poodle idiom\nbrittle\nfrail\nhelpless\nhelplessly\nhelplessness\nhouse of cards idiom\nshakiness\nshaky\nsitting duck\nsitting target\nsoft target\nweakly\nweakness\nweedy\nwetly\nwetness\nSee more results »\nAdd to word list\nAdd to word list\nable to be easily hurt, influenced, or attacked: Older people are especially vulnerable to cold temperatures even inside their homes. He casts himself as a naive, vulnerable young poet. vulnerability noun [ U ] us\nYour browser doesn't support HTML5 audio\n/ˌvʌl·nər·əˈbɪl·ət̬·i/\nYou want a doctor who understands the patient's vulnerability."}