{"id":355036,"name":"tab","type":"noun","us_sound":"tæb","us_link":"../audio/t/tab.mp3","uk_sound":"tæb","uk_link":"../audio/t/uksynta023.mp3","content":"tab noun [C]\n(SMALL OBJECT)\nAdd to word list\nAdd to word list\na small piece of paper, metal, etc. that is attached to something larger and is used for giving information, fastening, opening, etc.: Make a file folder for these documents and write \"finance\" on the tab. Insert Tab A into Slot A and glue, before standing the model upright.\nUS the small piece of metal, often joined to a ring, that is pulled off or pushed into the top of a can (= metal drink container) to open it: We pulled the tabs on the beer, and toasted the gods of travel. The tabs from soda cans often end up as litter. See also\npull-tab\nring pull\nLaura Preusser/EyeEm/GettyImages\nNorthern English a cigarette\ninformal (also tab of acid) a small piece of paper containing the drug LSD\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbar\nblindfold\nbraid\ncollar\ndog collar\nduct tape\ngag\nloom bands\nmasking tape\nraffia\nriband\nribbon\nstraight edge\nstrap\nstreamer\nstripe\nsweatband\nwebbed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLids, covers and stoppers\nTobacco & smoking\nSpecific types of drug\ntab noun [C]\n(COMPUTER)\na small symbol on a computer screen or website that allows you to open different documents or pages: Move between pages by clicking on the tabs at the top of the screen.\na fixed position on a line of text that can be reached by pressing the tab key on a keyboard\nSMART Vocabulary: related words and phrases\nInternet terminology\n.plc.uk\n2FA\n2SV\nabove/below the fold idiom\naddress bar\naffiliate link\nhybrid\ninternet-enabled\ninterweb\nIP\nkeyboard warrior\nlanding page\nping\npodcast\nservice provider\ntweeter\ntweetstorm\ntwitterati\nTwitterer\ntwittering\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\ntab noun [C]\n(BILL)\nthe tab informal\nthe total money charged in a restaurant or hotel for food, drinks, etc.: He kindly offered to pick up the tab (= pay).\nSMART Vocabulary: related words and phrases\nBills & invoices\nbilling\nbond\ncharge\nchit\nclaim form\ncounterfoil\ncredit note\nmischarge\npassbook\npayslip\npro forma\nreceipt\nsales slip\nsavings bond\nticket\ntill roll\ntoll\ntolled\nunbilled\nwater bill\nSee more results »\nIdiom\nkeep tabs on something/someone\ntab noun [C]\n(SMALL PIECE)\nAdd to word list\nAdd to word list\na small piece of material on a box, can, or container that is pulled to open it\nA tab is also a small piece of paper or plastic attached to a paper or file so it can be found easily.\ntab noun [C]\n(AMOUNT CHARGED)\nan amount charged for a service or for a meal in a restaurant: He offered to pick up the tab for lunch (= pay for it).\nAdd to word list\nAdd to word list\na small piece of paper, metal, or cloth that is attached to the edge of something: The metal tabs at one end are where the wires fasten.\nIT, INTERNET a small symbol on a website that gives you information about the different pages you can open on that website: Move between pages by clicking on the tabs at the top of the screen.\nIT\n&#160; (also tab stop) a fixed position on a line of text that you are writing on a computer, etc. that can be reached by pressing the tab key\ninformal the amount of money that is charged for something: The committee will reimburse the state $70,000 of the $105,000 tab for a recent trade mission to Ireland. The tab to clean up the mess caused by the oil spill has already hit $9 million.pick up the tab (for sth) The state picks up the health care tab for many low-income clients.pay the tab (for sth) Pharmaceutical companies pay most of the tab for the trials.\na record of what you have ordered or used but not yet paid for, especially in a bar or restaurant: put sth on the/your tab Just put it on the tab, please.on sb's tab I ordered drinks for everyone, even though this was all going on my tab. They were put up in hotels on the state's tab.\nto think or say that someone or something should have a particular job or use: tab sb to do sth He was tabbed to restore glory and dignity to USA Basketball.tab sb as sth The CEO unofficially tabbed him as his successor.tab sb/sth for sth She was tabbed for a seat on the Board.\nto put tabs on something: tab sth with sth There was a stack of mail-order catalogues tabbed with sticky labels."}