{"id":355120,"name":"table","type":"noun","us_sound":"ˈteɪ.bəl","us_link":"../audio/t/table.mp3","uk_sound":"ˈteɪ.bəl","uk_link":"../audio/t/uksynta027.mp3","content":"table noun\n(FURNITURE)\nAdd to word list\nAdd to word list\nA1 [ C ] a flat surface, usually supported by four legs, used for putting things on\ns-cphoto/E+/GettyImages\n[ + sing/pl verb ] the people sitting at a table: There was a really noisy table behind us celebrating someone's birthday.\n[ C ] Indian English a table that you work at in an office See also\ndesk (TABLE) set the table\nB1 (UK also lay the table) to put a cloth, knives, and forks, etc. on the table in preparation for a meal: set the table for Could you set the table for lunch, please?\nSee more\nMore examplesFewer examplesThey sat round the dinner table, arguing about politics.Come to the table everybody - supper's ready.He came in with four shopping bags and dumped them on the table.He lived in a room with only two chairs, a bed and a table.I'll just get a sponge and wipe the crumbs off the table.\nSMART Vocabulary: related words and phrases\nTables & desks\nbedside table\nbench\nbenchtop\nbooth\nbreakfast bar\nbureau\ncard table\ndrafting table\ndressing table\ndrop-leaf table\nhigh table\nleaf\nrolltop desk\nstanding desk\ntabletop\nthe dinner table\ntrestle\ntrestle table\nworktop\nwriting desk\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\ntable noun\n(INFORMATION)\nB1 [ C ] an arrangement of facts and numbers in rows or blocks, especially in printed material\n[ C ] a\nmultiplication table table of contents\na list of the information that is contained in a book: Make sure you include a table of contents and an acknowledgments section.\nSee more\nMore examplesFewer examplesHe consulted a table of tide times.All the figures are arranged in this table.We learned about the table of elements.This table shows population increase.\nSMART Vocabulary: related words and phrases\nTables, graphs & diagrams\nabscissa\nasymptote\nasymptotic\nbar chart\nbar graph\nblock graph\ncoordinate\ndiagram\nflowchart\ngraph\ngraph paper\nMind Map\nnormal distribution\norganigram\npictogram\nreplot\nscatter diagram\ntabular\nvertical axis\ny-axis\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\nIdioms\non the table\nunder the table\nUK to suggest something for discussion: An amendment to the proposal was tabled by Mrs James.\nUS to delay discussion of a subject: The suggestion was tabled for discussion at a later date.\nSMART Vocabulary: related words and phrases\nSuggestions & proposals\nabout\napproach\nbounce something off someone\ncan't\nco-sponsor\nco-sponsorship\ndrop\nif you take my meaning idiom\nimplication\nmake noises idiom\nmaybe\nmover\nnod\nnomination\nput ideas into someone's head idiom\nput someone to something idiom\nput something in\nput something up\nput something/someone forward\nsuggest\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDelaying and wasting time\ntable noun [C]\n(FURNITURE)\nAdd to word list\nAdd to word list\na piece of furniture that has a flat top supported by legs: We ate our meals sitting around a large dining room table.\nThe table also means all the people at a table: The whole table had a very good time.\ntable noun [C]\n(INFORMATION)\nan arrangement of facts and numbers, usually in rows on a page, that makes information easy to understand table of contents\nA table of contents is a list of what is in a book. Idiom\non the table\ntable verb [T]\n(NOT DISCUSS)\nto leave something for discussion or consideration at a later time: We’ll have to table these last two items until our next meeting.\nAdd to word list\nAdd to word list\nGRAPHS &amp; CHARTS an arrangement of facts or numbers in rows or columns, especially in printed material, on computer screens, etc.: The table can help you evaluate the potential risks of investing in the Fund. Building societies dominate the best-value tables for mortgages. This table represents export sales.\nMEETINGS a place or opportunity for people to meet and discuss something: When they get to the bargaining table, there will be a fight over union membership. In countries where women are denied a seat at the table, democracy remains a hollow promise.\noff the table\nno longer being considered: A dividend payment this year is definitely off the table.\non the table\nhaving been offered or suggested so that it can be considered: Management said that there were important new benefits on the table. The deal appears to be still on the table.\nUS not going to be discussed until later: If you have an important matter to raise, don't leave it on the table. See also\nlife table\nmortality table\nthe negotiating table\nround table\nUK to suggest or offer something for discussion: table an offer/bid/proposal The company has been looking for a buyer for several months but so far no offer has been tabled.table a motion/amendment/resolution MPs tabled 118 last minute amendments.\nUS to leave a subject or idea to be discussed later: The motion has been tabled. I propose tabling this for the time being."}