{"id":355174,"name":"taboo","type":"noun","us_sound":"təˈbuː","us_link":"../audio/t/taboo.mp3","uk_sound":"təˈbuː","uk_link":"../audio/t/uktable010.mp3","content":"Add to word list\nAdd to word list\na subject, word, or action that is avoided for religious or social reasons: In this society there is a taboo on/against any sort of public display of affection. He would not hesitate to break any taboo.\nMore examplesFewer examplesBetty Ford bravely broke the taboo and spoke out about her breast cancer.Discussing money has always been a social taboo in Britain.There's a big taboo around homosexuality in some communities.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\nunapproved\nunauthorized\nunkosher\nunsanctioned\nverboten\nSee more results »\nGrammar\nSwearing and taboo expressionsSwear words and taboo words can intensify what is said, but they can shock or give offence. Swearing and the use of taboo words and expressions is quite common in speaking. We often hear and use it both in private and in public settings and in films, on television and on the radio. …\navoided for religious or social reasons: For some people, death is a taboo subject. He believes that nothing should be taboo in films.\nMore examplesFewer examplesWords which were once taboo have become everyday expressions. Sex is no longer a taboo subject at nursing homes.In the early 1970s the topic of death began to emerge from its taboo status.\nSMART Vocabulary: related words and phrases\nForbidding and banning things\nabolish\nabolition\nabolitionist\nanti-censorship\nban\ndebar\ndecertification\ndecertify\ndisallow\ndisqualification\nnon-valid\noff-limits\nout of bounds idiom\noutlaw\nprohibit\nunapproved\nunauthorized\nunkosher\nunsanctioned\nverboten\nSee more results »\nAdd to word list\nAdd to word list\nsomething that is avoided or forbidden for religious or social reasons: Dealing with mental illness is a sensitive issue, with a lot of taboos. taboo adjective [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/təˈbu, tæ-/\nThe article analyzes the ways in which English speakers deal with taboo words."}