{"id":355525,"name":"tag","type":"noun","us_sound":"tæɡ","us_link":"../audio/t/tag.mp3","uk_sound":"tæɡ","uk_link":"../audio/t/uktacti013.mp3","content":"tag noun\n(SMALL PART)\nAdd to word list\nAdd to word list\n[ C ] a small piece of paper, cloth, or metal with information on it, tied or stuck onto something larger: a price tag\nImage Source/Image Source/GettyImages\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\ntag noun\n(ELECTRONIC DEVICE)\nan electronic device that is fastened to a person, animal, or object, so that police, scientists, or other people can know where they are or find other information about them: He was released from jail early wearing a tag and was later caught dealing drugs. High-value items in stores often have security tags attached. See also\nankle tag\nelectronic tag\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\nprospectus\nPSA\npush notification\nradiogram\nreadout\nsubtlety\ntelemetry\nSee more results »\ntag noun\n(ON CAR)\nUS a sign on a road vehicle that shows the official set of numbers and letters that identifies it: Delaware's license tags bear the slogan \"The First State\". A state trooper observed the red Toyota with Tennessee tags and stopped the vehicle in Alabama. License plate scanners record tags entering the city. Synonym\nlicence plate\nSMART Vocabulary: related words and phrases\nThe exterior of vehicles\narticulated\ncab\ncoachwork\ncrumple zone\nfifth wheel\nfinny\nfog light\nfootboard\nfrunk\nhigh beams\nL-plate\nnearside\nrear light\nrunner\nsidelight\nsunroof\ntailgate\ntire\ntow bar\nturn signal\nSee more results »\ntag noun\n(GAME)\n[ U ] a game played by two or more children in which one child chases the others and tries to touch one of them. This child then becomes the one who does the chasing.\nSMART Vocabulary: related words and phrases\nChildren's games\nblind man's buff\nconker\ndingbat\ndouble Dutch\ndress-up box\ndressing-up box\nFrench cricket\ngo fish\nhide-and-seek\nhopscotch\njack\nmagnet fishing\nmarble\npainting\npainting by numbers idiom\npeekaboo\npig Latin\npiggy in the middle\npiggyback\nwarm\nSee more results »\ntag noun\n(GRAMMAR)\n[ C ]\n&#160; language\n&#160; specialized a phrase such as \"he is\" or \"isn't it?\", added on to a sentence for emphasis, or to turn it into a question, usually to get agreement or to check information\nSMART Vocabulary: related words and phrases\nLinguistics: grammatical terms\nablative\napposition\nappositive\nappositively\nattributively\ncollocate\nconcord\ndative\nfeminine\ngenitive\ninflected\nnominal\npost-modifier\npostposition\npostpositional\npostpositive\npostpositively\nquantifier\nsingular\nsyntax\nSee more results »\ntag noun\n(MARK)\n[ C ] a type of graffiti (= words and pictures drawn in public places on walls, etc.) that shows who has drawn it and that represents a signature : The tag is the most commonly seen graffiti in any urban setting.\nejs9/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nSigning & signatures\nanon\nautographically\nco-sign\nco-signatory\nco-signer\ncountersign\ninitial\nJohn Hancock\nnotarize\nsign\nsign (something) off\nsign for something\nsign for/with someone\nsign in\nsign on\nsign something away\nsignature\nsigning\nthe undersigned\nunsigned\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWriting & typing\ntag noun\n(SOCIAL MEDIA)\na link to someone's profile from a photo or comment on a website such as Instagram or Facebook: You can remove your tag from a photo on Facebook.\nSMART Vocabulary: related words and phrases\nInternet, email and texting conventions\na/s/l\nafaik\nafk\nbak\nBC\nf2f\nhth\nICYMI\nidk\niirc\nikr\nOOO\notoh\npersonalization\npita\npmji\nttfn\nunfollow\nunmute\nYOLO\nSee more results »\nGrammar\nTagsTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: usesTags are either questions, statements or imperatives added to a clause to invite a response from the listener: …\nTags: formTags consist of one of the auxiliary verbs be, do or have, or the main verb be, or a modal verb, plus a subject, which is most commonly a pronoun: …\nQuestion tagsQuestion tags turn statements into yes-no questions. There are two types. …\nImperative tagsA tag after an imperative clause softens the imperative a little. The tag verb is most commonly will but we can also use would, could, can and won’t: …\nStatement tagsWe can use a statement tag to emphasise or reinforce an affirmative statement. The tag is also affirmative. They typically invite the listener to agree or sympathise in some way, or to offer a parallel comment. Statement tags are very informal: …\nUniversal tags: right, yeahWe can use right and yeah in very informal situations instead of question tags: …\ntag verb [T]\n(SMALL PART)\nto put a tag on something\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\nstamp\ntagging\ntell something/someone apart\ntraceable\nSee more results »\ntag verb [T]\n(COMPUTING)\ncomputing\n&#160; specialized to mark computer information to be processed in a particular way\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntap\ntoolbar\nvectorization\nvectorize\nvirtualization\nvirtualize\nwake word\nzip file\nSee more results »\ntag verb [T]\n(SOCIAL MEDIA)\nto add a link to someone's profile from a photo or comment on a website such as Instagram or Facebook: I don't mind if people tag me without asking. You don't want a potential employer seeing those Friday night pictures your friend has tagged you in.\nSMART Vocabulary: related words and phrases\nInternet, email and texting conventions\na/s/l\nafaik\nafk\nbak\nBC\nf2f\nhth\nICYMI\nidk\niirc\nikr\nOOO\notoh\npersonalization\npita\npmji\nttfn\nunfollow\nunmute\nYOLO\nSee more results »\nPhrasal verbs\ntag along\ntag something on\ntag noun\n(SIGN)\nAdd to word list\nAdd to word list\n[ C ] a small piece of paper, cloth, or metal attached to an item and containing information about it: Did you check the price tag on that sweater?\ntag noun\n(GAME)\n[ U ] a game for children in which one child chases the others and tries to touch one of them, who then is the one who chases the children\ntag verb [T]\n(GAME)\nto touch someone in the game of tag: I tagged you, now you’re it!\ntag verb [T]\n(ATTACH SIGN)\nto put a tag on something: The items are tagged and stacked on shelves. Phrasal verb\ntag along\nAdd to word list\nAdd to word list\na small piece of paper, plastic, cloth, etc. attached to something that shows some information about it: Many of the bibs have a tag sewn into the lining that contains the UPC number. Valuable pieces are marked with a tag describing the item's age and pedigree. The clerks wear black shirts and name tags.\nCOMMERCE\n&#160; (also smart tag) a small electronic object that is attached to a product in order to give its position, or to stop people from stealing it: Track your deliveries inventories with smart tags. In agriculture, tags are used to track livestock.\nIT a series of letters, numbers, or symbols before or after a piece of electronic data that tells the computer how to treat it: The tag is a link that takes you to a web page. To put anything complicated in a web page you have to put it in tags.\nSee also\nprice tag\nto put a tag on something: The legal staff are being required to print, tag and collate the documents themselves. Ranch hands will tag and track these cattle throughout the two years before they reach the packing plant.tag sth with sth Each item is tagged with a price and where to buy it.\nIT to mark electronic data with a series of letters or numbers: tag sth with sth Each download is tagged with an icon that identifies the type of file."}