{"id":355552,"name":"tagging","type":"noun","us_sound":"ˈtæɡ.ɪŋ","us_link":"../audio/t/usa31469.mp3","uk_sound":"ˈtæɡ.ɪŋ","uk_link":"../audio/t/uka31469.mp3","content":"tagging noun [U]\n(ATTACHING LABEL)\nAdd to word list\nAdd to word list\nthe act of putting a small piece of paper, cloth, or metal on something in order to identify it (= say what it is): The tagging of baggage to and from Macau will provide guests a convenient check-in experience. The individual tagging of sheep would result in an annual bill of around £20m.\n(also electronic tagging) the act of putting electronic devices on goods, etc., or animals, in order to know where they are: The electronic tagging of household items such as lawn mowers and power drills would enable them to be searchable via the internet.\nmainly UK (also mainly UK electronic tagging, usually US electronic monitoring) the act of attaching an electronic device to a person who is guilty of a crime to make sure they do not leave an area or go to a particular place: The case will bring into question the efficacy of electronic tagging of offenders. We support the tagging of certain prisoners.\nSMART Vocabulary: related words and phrases\nIdentifying\nascribe something to something\nascription\nbadged\nbadging\nband\ndistinguish\ndistinguishable\ndistinguishably\ndistinguishing\ngeotag\nidentity\nidentity card\nmicrochip\nmicrochipped\nmisidentification\nmisidentify\npassport\nstamp\ntell something/someone apart\ntraceable\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\ntagging noun [U]\n(MARKING DATA)\nthe activity of marking computer information to be processed dealt with in a particular way: XML tagging of manuscripts\nthe activity of marking digital information with a name, etc. to show that it is of a particular type or is connected with a particular person, group, or subject: Of the three programs, this one let me do the most extensive tagging of my tracks before exporting them. Are you confused by Facebook's tagging feature? Not sure you want to even be tagged at all? Here's everything you need to know.\nSMART Vocabulary: related words and phrases\nOperating computers\nadmin\nadministrator\naliasing\nalways-on\nback someone up\ncrack\ndrag\ndrill down\nlogout\nmalicious\nmaximize\nmiswrite\nmouse over something\ntoolbar\nvectorize\nvirtualization\nvirtualize\nwake word\nwhite hat\nzip file\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer concepts\nSound and image recordings\ntagging noun [U]\n(ON BUILDINGS)\nthe illegal act of writing your name or a special mark on buildings, or the writing and marks that are put on buildings: The walls have stayed clean because in the tagging culture murals are respected as art. It costs the city $250,000 a year to remove tagging. See\ntagger"}