{"id":355730,"name":"taint","type":"verb","us_sound":"teɪnt","us_link":"../audio/t/taint.mp3","uk_sound":"teɪnt","uk_link":"../audio/t/uktacti027.mp3","content":"Add to word list\nAdd to word list\nto spoil something or give it an unpleasant quality: His reputation was permanently tainted by the financial scandal. He warned of toxins such as mercury tainting some fish.\nMore examplesFewer examplesHis first term of office was tainted by scandal.We don't want people out there tainting our reputation.It was found that the groundwater had been tainted with a string of toxins.\nSMART Vocabulary: related words and phrases\nDamaging and spoiling\nadulterate\nadulterated\nadulteration\napplecart\nat-risk\nbutcher\neat\neat away at something\nerode\nflaw\nfoul\nfoul (something) up\ngloss\nqueer\nrain on someone's parade idiom\nrampage\nravage\nravages\nsour\nwreck\nSee more results »\nthe act or result of spoiling something or giving it an unpleasant quality: He managed to escape the worst taint of the Watergate scandal. The enquiry cleared him of any taint of suspicion/dishonesty.\nMore examplesFewer examplesPeople caught with less than an ounce of marijuana might avoid the taint of a criminal record.The air bore the taint of oily air-conditioning.As deaths among those taking the drug mounted, the FDA discovered the taint and banned the contaminated drug.\nSMART Vocabulary: related words and phrases\nDamaging reputation\nanti-defamation\naspersion\nbesmirch\nblack mark\nblacken\nblot\ndefame\ndemonize\ndog\ndrag someone's name through the mire/mud idiom\ngive a dog a bad name idiom\nscurrilous\nscurrilously\nself-immolation\nshow someone in a bad light idiom\nslander\nslur\nsmear\nstab\ntarnish\nSee more results »\nAdd to word list\nAdd to word list\nto damage the quality, taste, or value of something: Bacteria had tainted the meat. His reputation was permanently tainted by the scandal. taint noun [ U ] us\nYour browser doesn't support HTML5 audio\n/teɪnt/\nThe taint of scandal followed him for years."}