{"id":355787,"name":"takeaway","type":"noun","us_sound":"ˈteɪk.ə.weɪ","us_link":"../audio/t/ustable030.mp3","uk_sound":"ˈteɪk.ə.weɪ","uk_link":"../audio/t/uktajik003.mp3","content":"takeaway noun\n(INFORMATION)\nAdd to word list\nAdd to word list\n[ S ] mainly US a main message or piece of information that you learn from something you hear or read: The takeaway from the conference was how competitive the tourism industry has become. At the end of the class, the teacher gives us the takeaway points.\nSMART Vocabulary: related words and phrases\nInformation and messages\nadvance notice\nadvance warning\nadvertisement\naide-mémoire\nammunition\nbumper sticker\ncredential\nflier\nguideline\nhandout\ninfo\ninfodemic\ninfodump\npostscript\nprospectus\nPSA\npush notification\nradiogram\nreadout\ntelemetry\nSee more results »\ntakeaway noun\n(FOOD)\nB1 [ C or U ] UK (US takeout, carryout) a meal cooked and bought at a shop or restaurant but taken somewhere else, often home, to be eaten, or the shop or restaurant itself: a Chinese takeaway We were too tired to cook so we ordered takeaway.\nMore examplesFewer examplesWe decided to get a takeaway.He ordered a takeaway from the Indian restaurant.\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntapas\ntea\ntea party\nteatime\ntiffin\nSee more results »\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a shop or restaurant that cooks and sells food for people to eat somewhere else: Curry houses and Indian takeaways account for £2.5bn of trade.\n[ C or U ]\n&#160; COMMERCE\n&#160; (US also takeout) a meal cooked and bought at a shop or restaurant but taken somewhere else to be eaten: He had a weekend job delivering Chinese takeaways.\n[ C or U ] something that you get or learn from an experience, activity, etc.: the takeaway from sth What's the key takeaway from this survey?\n(US also takeout) bought from a shop or restaurant and eaten somewhere else: In New York you can get a huge range of takeaway food cheaper than cooking at home. takeaway pizza/sushi/curry\nlearned or gained from an experience, activity, etc.: What is the takeaway message from that? So here are the takeaway points from these ten books."}