{"id":355800,"name":"takeover","type":"noun","us_sound":"ˈteɪkˌoʊ.vɚ","us_link":"../audio/t/takeover.mp3","uk_sound":"ˈteɪkˌəʊ.vər","uk_link":"../audio/t/uktajik007.mp3","content":"Add to word list\nAdd to word list\nC1 a situation in which a company gets control of another company by buying enough of its shares: They were involved in a takeover last year. make a takeover bid (for something)\nto try to get control of something: The company made a takeover bid for one of its rivals.\nSee more\nMore examplesFewer examplesIt has emerged that secret talks had been going on between the two companies before the takeover was announced.The bank fought off a takeover by another bank recently.The takeover battle is between two of America's industrial/retail giants .The company has decided not to go through with the takeover of its smaller rival.The company spent much effort in avoiding takeover bids from predatory competitors.\nSMART Vocabulary: related words and phrases\nMergers & acquisitions\nacqui-hire\nacquirable\nacquire\nacquisition\nacquisitive\nbuy someone out\nbuyout\nconglomerate\ncounterattack\ndenationalization\ndenationalize\nfire sale\nhive\nhostile\nleveraged buyout\nmonopolize\nmonopoly\nnon-hostile\noligopoly\nparent\nSee more results »\nAdd to word list\nAdd to word list\nan act of taking control of something: Huge corporate takeovers were the big financial news this year.\nAdd to word list\nAdd to word list\nFINANCE the act of taking control of a company by buying enough of its shares to do this: The company has agreed an $11.5bn takeover.friendly/hostile takeover In hostile takeovers, the employees of the target firm are often concerned about losing their jobs. takeover of sth the takeover of British toymakers by American multinationals takeover candidate/target The dramatic rise in the stock price made it a less attractive takeover target.takeover attempt/proposal They are expected to receive a takeover proposal from a US-based multinational. The company announced it was in takeover talks. Compare\nmergerSee also\nanti-takeover\nleveraged takeover\nreverse takeover\nunfriendly takeover"}