{"id":355785,"name":"take","type":"verb","us_sound":"teɪk","us_link":"../audio/t/take.mp3","uk_sound":"teɪk","uk_link":"../audio/t/uktajik002.mp3","content":"take verb\n(REMOVE)\nAdd to word list\nAdd to word list\nB1 [ T ] to remove something, especially without permission: Has anything been taken (= stolen)? Here's your pen - I took it by mistake. All her possessions had been taken from her.\nThesaurus: synonyms, antonyms, and examples\nto steal somethingstealI caught him trying to steal my bike.takeSomeone took their car from outside the house.shopliftHe was caught shoplifting by a security guard.robHe robbed a bank.burgleUK When she got home from work, she discovered that her house had been burgled.pilferEmployees pilfering paper, pens, etc. can cost employers a lot.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nB2 [ T ] to subtract a number (= remove it from another number): If you take 4 (away) from 12 you get 8. See also\ntake something away (CALCULATE)\nMore examplesFewer examples\"Did you take any money out of my purse?\" \"Certainly not!\"When they got divorced, his wife took everything.They took blood and urine specimens for analysis.OK, very funny - who took my clothes?If anyone found out that I took the money, I'd die of shame.\nSMART Vocabulary: related words and phrases\nTaking things away from someone or somewhere\nappropriate\nbear away\nconfiscate\nconfiscation\ncream something/someone off\ndebug\ndrain\nexpropriate\nexpropriation\nextractive\nget off\nimpound\nrelieve\nroot something/someone out\nrout someone out\nseize\nshelf\nstripping\nsuck\nsweep\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAddition, subtraction, multiplication & division\ntake verb\n(MOVE)\nA1 [ T ] to move something or someone from one place to another: The weather forecast said rain, so take your umbrella (with you) when you go out. The suitcases were taken to San Antonio by mistake. Take the book up/down to the third floor of the library. [ + two objects ] I suggested that he should take her some chocolates/take some chocolates to her (= bring them to her as a present).\nThesaurus: synonyms, antonyms, and examples\nto take something somewheretakeAre you allowed to take your phone to school?bringCould someone bring me a cup of coffee?takeSomeone's taken my pen.removeCan someone please remove this ugly plant?take awayWhen you've finished your meal, the waiter takes the plates away.take outShe opened her bag and took out a small notebook.\nSee more results »\nMore examplesFewer examplesTake the vase off the shelf.Could you take this letter to John, please?I took some food from the table.I took some of the flowers for Mrs Bright.I took several books with me for the journey.\nSMART Vocabulary: related words and phrases\nTransferring and transporting objects\nbear\nbearer\nbike\nborne\nbring\nbudge\ncall for someone\ncarry\nchauffeur\nconvey\nhump\nimport\npayload\npickup\nportable\nportage\npost-delivery\nput something/someone down\ntransplant\ntruck\nSee more results »\ntake verb\n(ACCEPT)\nB1 [ T ] to accept or have: Do they take credit cards here? Do you take milk in your coffee? This container will take (= has room for) six litres.UK Which newspaper do you take (= regularly buy)? He continually abuses her, and she just sits there and takes it. If you think I'm going to take that lying down (= accept it without complaining), you're very much mistaken. I take the/your point (= accept the argument), but I still don't think you should have gone.\nThesaurus: synonyms, antonyms, and examples\nto accept something that is offeredacceptThey were charged with accepting illegal contributions. takeShe offered him the job and he took it.say yes (to)I asked him to marry me and he said yes.take someone up onThank you – I’d like to take you up on your offer.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto take something from someonetakeHe offered her the microphone but she wouldn't take it.take hold ofGet ready to take hold of the baton as the next runner approaches.snatchHe snatched the letter out of my hands before I could read it.stealThe car was stolen from right outside our house.pinchA thief pinched his wallet and phone.seizeFederal agents seized two computers.\nSee more results »\n[ T ] used when you want to mention something as a particular example of what you are talking about: I've been very busy recently. Take last week, I had meetings every night after work, except Friday. take to be/take for something\nIf you take someone or something to be something, or if you take someone or something for something, you accept or believe that they are that thing: [ + to infinitive ] These creatures are generally taken to be descended from primitive fishes. I could have taken him for (= believed that he was) your brother. I'm not going to forge his signature for you! What do you take me for? (= You should not believe I could do a thing like that.) can't take something\nB2 to not be able to deal with an unpleasant situation: I can't take it any more. I'm leaving. take it or leave it\naccept or refuse the offer completely: That's my final offer - you can take it or leave it.\nMore examplesFewer examplesDo you usually take a morning/afternoon break?I took this new job because I felt that the career prospects were much better.The director took a risk in giving the movie's main role to an unknown actor.She took a few spoonfuls of soup but left her main course untouched.He took a drop in salary when he changed jobs.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypifying, illustrating and exemplifying\nBelieving\nNot liking\nLinguistics: interjections\ntake verb\n(HOLD)\nB1 [ T ] to move in order to hold something in the hand(s): Can you take this bag while I open the door? He took my arm and led me outside. Take an egg and break it into the bowl. He took hold of the plant's root and pulled.\nMore examplesFewer examplesThe baby took my finger in its tenacious little fist.Take my hand as we cross the road.Each player takes three cards.The doctor had to take my shoulder and click the joint back into place.He took my arm and guided me to the bar.\nSMART Vocabulary: related words and phrases\nHaving in your hands\nahold\narm\nchokehold\nclasp\nclench\ncling\ncup\ndandle\ngrasp\ngrip\nhand in hand idiom\nhandle\nhang\nhang on\nhang/hold on like grim death idiom\nnurse\nonto\npurchase\nseize\ntaken\nSee more results »\ntake verb\n(GO WITH)\nA1 [ T ] to go somewhere with someone, often paying for that person or being responsible for them: We're taking the kids to the zoo on Saturday. [ + to infinitive ] I took my elderly parents to look at some new houses. [ + -ing verb ] Will you take me swimming tomorrow?\nThesaurus: synonyms, antonyms, and examples\nto take someone somewheretakeI have to take my mother to the doctor today.go withI offered to go with him to the police station.come withCan you come to the hospital with me?accompanyChildren under 12 must be accompanied by an adult.driveMy husband usually drives the kids to school.give someone a liftCan you give me a lift into town?\nSee more results »\n[ T ] to show someone how to get to somewhere by going there with them: Let me take you to your room.\n[ T ] to go to a social event with someone: Who's taking you to the dance?\nMore examplesFewer examplesAs a special treat, I'll take you to my favourite tea-shop.I had to get up early to take her to the airport.If he gets any worse I'll take him to the doctor's.Three days after the birth, Paul and Sandra took their precious bundle of joy home.I took my two-year old nephew down to the beach with his bucket and spade.\nSMART Vocabulary: related words and phrases\nTaking someone somewhere or telling them the way\naccompanied by someone/something\naccompany\naccompany someone to something\nbring\nbring someone/something along\nchaperone\nconvoy\ndirect\ndrop\nlead\nrefer to someone/something\nride\nsee someone off\nshepherd\nshow someone around (something)\nshow someone over something\nstick\nusher\nusherette\nwalk\nSee more results »\ntake verb\n(TRANSPORT)\nA2 [ T ] to travel somewhere by using a particular form of transport or a particular vehicle, route, etc.: I always take the train - it's less hassle than a car. She took the 10.30 flight to Edinburgh. If you take the road on the left, you'll come to the post office.\nMore examplesFewer examplesWe took a bus to Mexico City.From Heathrow, you can take a taxi.I took the 6.30 train to Manchester.Why don't you take the train to Paris?We took a flight to Denver.\nSMART Vocabulary: related words and phrases\nTravelling\naround Robin Hood's barn idiom\nbackpack\nbag drop\nbourne\nbum\nbum around\ncommunication\ncommuting\nconnection\nhitch\nmove\nnegotiate\npublic transport\nRobin Hood\nshuttle\nsuper-commuting\ntaken\ntransoceanic\nvisa\nwell travelled\nSee more results »\ntake verb\n(NEED)\nB2 [ T ] to need: Parachuting takes a lot of nerve. Transitive verbs take a direct object. [ + -ing verb ] His story took some believing (= was difficult to believe).\nB1 to wear a particular size of clothes or shoes: What size shoes do you take?\nA2 [ L only + noun ] If something takes a particular time, that period is needed in order to complete it: The cooking process only takes ten minutes. [ + to infinitive ] How long does this paint take to dry? [ + obj + noun ] It took us all day to drive home. not take long\nA2 to act or happen over a short period of time: I'm just going to the shops - I won't take long. take time\nto need a long time: Broken bones always take time to heal.\nMore examplesFewer examplesThey took two hours to discuss the plans and considered it time well spent.It took a lot of courage to do what she did.The insurance company took months to settle my claim.The jury took four days to reach a verdict.This recipe takes four cloves of garlic.\nSMART Vocabulary: related words and phrases\nLacking things\nbankrupt\nbankruptcy\nbe hard up (for something) idiom\nbereft\ncry out for something\ninappeasable\nlack\nlacking\nminus\nneed\nneed something like you need a hole in the head idiom\nscrape\nscream\nshortage\nshy\nskimpily\nstarve someone/something of something\nstarved\ntaken\nunaccompanied\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWearing clothes\nSpending time & time passing\nHurrying and doing things quickly\nLasting for a long time\ntake verb\n(MEASURE)\nC2 to measure something: Nurses took my temperature and blood pressure.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\ntake verb\n(DRUG/MEDICINE)\nA2 to swallow or use a medicine or drug, especially in a regular way: Take this medicine three times a day. Do you think she takes drugs?\nSMART Vocabulary: related words and phrases\nDrugs - general words\nabstinence\nabstinence-only\nbindle\nbiosimilar\nchase\nmultidrug\nnon-intoxicant\nnon-intoxicating\nnondrug\npeddler\nperformance-enhancing\npill-popping\nsolvent abuse\nspike\nspliff\nsubstance\nsubstance abuse\nwasted\nwhacked\nwiped out\nSee more results »\ntake verb\n(ACT)\nB1 [ T ] to do or perform: Shelley is taking (= studying) economics at university.UK The Archbishop took our service of thanksgiving.UK Mr Marshall takes us for (= teaches us) physics.\nB1 [ T ] used with many nouns to make a verb phrase that is equal in meaning to the related verb: I think we'll take a break (= we'll stop for a break) there. If you're tired you should take a rest (= you should rest). I always like to take a walk (= to walk) after lunch.\nMore examplesFewer examplesI usually take a nap after lunch.Who takes this class on Tuesdays?I agreed to take Nicola's aerobics class for her next week.I'm going to take some French lessons.After the next song, we'll take a break.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\nwork\nwork a treat idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nActing and acts\ntake verb\n(THINK ABOUT)\nB2 [ T ] to think about something or someone in a particular way: We're taking the bomb threats very seriously.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\ntake verb\n(UNDERSTAND)\nC2 to understand something in a particular way: I was just teasing him, but he took it the wrong way. I'm not sure whether to take that as a compliment or an insult. She gave a nod, which we took to mean that she agreed.\nSMART Vocabulary: related words and phrases\nUnderstanding and comprehending\nappreciation for something\napprehend\napprehensible\napprehension\nastutely\nbear\ncatch\ncolour\nhandle\nkeep someone up\nknow a hawk from a handsaw idiom\nknow the score idiom\nknow/see where someone is coming from idiom\nlatch\ntease something apart\nto get a handle on something idiom\nto have a handle on something idiom\ntumble to something\ntune in\nunderstanding\nSee more results »\ntake verb\n(REACTION)\nB2 [ T ] to have or come to have a particular feeling or opinion: He doesn't take any interest in his children. Don't take any notice of the cameras. She takes offence too easily. They took pity on the stray cat and fed it. I take the view that fuel should be heavily taxed to reduce road use. take someone by surprise (also take someone unawares)\nto surprise someone: The sudden noise took her by surprise.\nMore examplesFewer examplesShe took offence when we offered to help her.Don't take any notice of what they say.She never took any notice of her critics.He takes the view that children should not be allowed in pubs.I took pity on her and bought her some clothes.\nSMART Vocabulary: related words and phrases\nFeelings - general words\natmospherically\naura\nbreast\ncharged\nemotional\nemotionalism\nemotionally\nfeeling\ngut\nhimself\nnon-emotional\nnon-material\nsensibility\nsentience\nsentient\nspirited\nsusceptibility\nteam spirit\nthirsty\nvibe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExpressing and asking opinions\nSurprising and shocking\ntake verb\n(MONEY)\n[ T ] mainly UK (US usually take in) to receive money from sales or as payment for entrance to an event: The show took an astonishing $100,000 in its first week. See also\ntakings\nMore examplesFewer examplesThe restaurant took a lot of money that night.How much do you usually take in an evening?\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\ntake verb\n(CATCH)\nB2 [ T ] to get possession of something or someone: Rebels ambushed the train and took several prisoners.UK The Liberals need just 200 more votes to take the seat from Labour. With these wins, the Democrats have now taken the House back from the Republicans. Centre-left parties look set to take power. Adam, I'd like you to take control of the aircraft now.\nMore examplesFewer examplesHis party took control from the Communists.UK We'll take a lot of Labour's vote over the issue of fox hunting.The terrorists have taken hundreds of hostages.The soldiers were taken behind enemy lines.\nSMART Vocabulary: related words and phrases\nCapturing or taking possession of things\n-grabbing\napprehend\napprehension\narrogate\nat bay idiom\ncage\ncapture\ncatch\nclutch\ncollar\nget/lay/put your hands on someone idiom\ngrab\ngrabber\ngrasp at something\nrepossess\nseize\nsequester\nsequestration\nsnag\nsnatch\nSee more results »\ntake verb\n(WRITE)\nB1 [ T ] to write: I hope you're all taking notes.\nSMART Vocabulary: related words and phrases\nWriting & typing\nannotate\nasemic\nbang\nbang something out\nbash something out\nborrow\nborrow something from something\nchart\ndot\ninscribe\nkeyboard\nre-registration\nreadability\nrecompose\nreformulate\nrekey\nsemiotics\nspeller\ntab\ntranscribe\nSee more results »\ntake verb\n(PERFORM WELL)\n[ I ] to work or perform as expected: These new plants haven't taken - they don't like this dry soil.\nSMART Vocabulary: related words and phrases\nPerforming a function\nact\nact as something\ndischarge\nfunction as something/someone\nfunctional\nfunctionalist\nhigh-performance\nhyperfunction\nmake\nman\nmanned\nmultifunction\nmultifunctional\non\non it idiom\noperate\npurpose\nserve\nwork\nwork a treat idiom\nSee more results »\nGrammar\nPhrases with takeWe use take in a lot of phrases, especially with nouns. In these cases, the meaning of take depends on the noun: …\nTakeTake means ‘move with something or someone from where the speaker or listener is to a different place’: …\nTake: other meaningsTake can mean ‘remove without permission’: …\nBring, take and fetchBring means moving something or someone. The movement is either from where the listener is to where the speaker is, or from the speaker to the listener. …\nBringBring means moving something or someone. The movement is either from where the listener is to where the speaker is, or from the speaker to the listener. …\nTakeTake means movement with something or someone from where the speaker or listener is to a different place: …\nBring or take?seen from the viewpoint of the doer – she …\nFetchFetch means to go to another place to get something or someone and return with the thing or the person. We use it for people and things that are not here but that we need or are due to be here. We can usually use get instead of fetch: …\nBring, take and fetch: typical errorsWe don’t use take when something is seen from the receiver’s viewpoint: …\nIdioms\nbe like taking candy from a baby\ncan take it or leave it\nI take it\nif you take my meaning\npoint taken\ntake it upon yourself to do sth\ntake your time\ntake one (thing) at a time\ntake something as it comes\ntake that!\nMore idioms\ntake the time\ntake a walk!\nwill not take no for an answer\nPhrasal verbs\ntake someone aback\ntake after someone\ntake against someone\ntake something apart\ntake someone apart\ntake something away\ntake something back\ntake someone back\ntake someone down\ntake something down\nMore phrasal verbs\ntake something from someone\ntake something in\ntake someone in\ntake something off\ntake off\ntake someone off\ntake something on\ntake on something\ntake someone on\ntake something out\ntake someone out\ntake someone/something out\ntake it out of someone\ntake someone out of himself/herself\ntake something out on someone\ntake (something) over\ntake someone round (something/somewhere)\ntake someone through something\ntake to someone/something\ntake to something\ntake to somewhere\ntake something up\ntake someone up on something\ntake up with someone\ntake noun\n(MONEY)\n[ U ] money that is received from sales or as payment for entrance to an event: The box office take was huge for the new show.\nSMART Vocabulary: related words and phrases\nProfits & losses\nanti-profiteering\nanti-speculative\nbe a licence to print money idiom\nbuoyancy\nbuoyant\ncash cow\ndeficit\nka-ching\nlose your shirt idiom\nmargin\nout-of-pocket\npi\npocket\nprofit from something\nprofit warning\nprofitability\nrake-off\ntrade surplus\nwinnings\nyield\nSee more results »\ntake noun\n(FILM)\n[ C ] the filming of a scene (= small part of a film): This scene needed ten takes before we felt it was right.\nSMART Vocabulary: related words and phrases\nCinema - general words\n12A\nanimation\nanimator\naudio described\naudio description\ncomputer-generated imagery\nfade\nfilmic\nfilmically\nfilming\nfilmstrip\nflick\nfootage\nRambo\nremake\nrerelease\nrescreen\nreshoot\nsting\ntheatrical\nSee more results »\ntake noun\n(OPINION)\ntake on something\nan opinion about something: We'd love to hear your take on this issue. Synonyms\nmentality\nmindset\nopinion\noutlook (OPINION)\npoint of view\nstandpoint\nview (OPINION)\nviewpoint\nSMART Vocabulary: related words and phrases\nOpinions, beliefs and points of view\nAfrocentric\nagnosticism\nanti-ideological\narticle of faith\nascription\nbubble\ncreed\nhelicopter view\nheretical\nheretically\nhot take\nidea\npole\npolitics\nposture\npretension\nprism\nproposition\nredistributionist\ntick\nSee more results »\ntake noun\n(VERSION)\ntake on something\na version of something that shows someone's attitude towards it: The restaurant offers a new take on traditional French cooking.\nSMART Vocabulary: related words and phrases\nCategories and varieties\nbad/big boy idiom\nbrand\nbreed\ncategoric\ncategorical\ncategory\nclassification\nderivative\nhue\nmark\nmisclassification\nmodel\npolymorphism\nrun\nshade\nsort\nstratification\nsubcategory\nsubstance\nupdate\nSee more results »\nIdiom\non the take\ntake verb [T]\n(MOVE)\nAdd to word list\nAdd to word list\npast participle taken us/ˈteɪ·kən/ to move something or someone from one place to another: Please, take me with you! It may rain, so take your umbrella. The suitcases were taken to Madrid by mistake. I thought I’d take her some chocolates. I take home about $200 a week.\ntake verb [T]\n(REMOVE)\npast participle taken us/ˈteɪ·kən/ to remove something: Here’s your pen – I took it by mistake. A radio was taken from the car. take someone’s life\nTo take someone’s life is to kill someone: The fire took her life.\ntake verb [T]\n(ACCEPT)\npast participle taken us/ˈteɪ·kən/ to accept something, or to receive something willingly: I tried to phone him, but he refused to take my call. Does this restaurant take credit cards? Take this medicine three times a day. I can take three more people in my car. It’s a girls’ school that has now started taking boys. Bob took a lot of criticism for his decision. I refuse to take responsibility for what’s happened.\ntake verb [T]\n(THINK OF)\npast participle taken us/ˈteɪ·kən/ to think of someone or understand something in a particular way; perceive: [ + to infinitive ] I took him to be more honest than he really was. The police are taking the robberies very seriously. In the dim light I could have taken them for brothers. I’m not going to forge his signature! What do you take me for?\npast participle taken us/ˈteɪ·kən/ Take is sometimes used to introduce an example of what you mean: It’s been really busy. Take last week – we had meetings every day.\ntake verb [T]\n(HOLD)\npast participle taken us/ˈteɪ·kən/ to hold something: He took my arm and led me to my seat. Can you take this bag while I open the door?\ntake verb [T]\n(CATCH)\npast participle taken us/ˈteɪ·kən/ to catch, win, or get possession of something: Rebels ambushed the train and took several prisoners. My roses took first prize at the flower show.\ntake verb [T]\n(NEED)\npast participle taken us/ˈteɪ·kən/ to have as a necessary condition; need: Parachuting takes a lot of nerve. I take a size 9 shoe. Transitive verbs take a direct object. It didn’t take much persuasion to get her to go with us. How long does this paint take to dry? Broken bones always take time to mend. takes forever\nIf something takes forever, it happens very slowly: In rush-hour traffic, it takes forever to get home.\ntake verb [T]\n(ACT)\npast participle taken us/ˈteɪ·kən/ to do something: I’ve started taking piano lessons. The government urged both sides to take steps to end the strike.\npast participle taken us/ˈteɪ·kən/ Take is used with many nouns to make a verb phrase: We can’t delay any longer – we have to take action (= to act). In the evening I like to take a walk (= to walk). If you’re tired, you need to take a nap (= to sleep). take effect\nto take effect means to start working: The medicine should take effect quite quickly. take turns\nIf you take turns, you and other people do the same thing, one after the other: The mothers in our group take turns driving the children to school.\ntake verb [T]\n(MEASURE)\npast participle taken us/ˈtei·kən/ to measure something: Better take the baby’s temperature – she may have a fever.\ntake verb [T]\n(REACT)\npast participle taken us/ˈteɪ·kən/ to have or cause to have a particular feeling or opinion: He takes little interest in current events. She takes offense too easily. take someone by surprise\nTo take someone by surprise means to do something that is completely unexpected: His sudden proposal took her totally by surprise.\ntake verb [T]\n(CHEAT)\ninfml past participle taken us/ˈteɪ·kən/ to cheat someone: You paid $500 for that thing? I think you got taken.\ntake verb [T]\n(WRITE)\npast participle taken us/ˈteɪ·kən/ to write information provided by someone or something: Take notes as you read. Journalists took down every word he said during the interview.\ntake verb [T]\n(PHOTOGRAPH)\npast participle taken us/ˈteɪ·kən/ to make a photograph of someone or something: We took lots of pictures of the new baby.\ntake verb [T]\n(TRAVEL ON)\npast participle taken us/ˈteɪ·kən/ to travel on something to get from one place to another: I always take the train. Take the road on the left to get to my house. Idioms\nnot take something lying down\ntake a deep breath\ntake a dim view of something\ntake advantage of something\ntake advantage of someone\ntake a hike\ntake a hint\ntake a joke\ntake a shine to\ntake a turn for the worse\nMore idioms\ntake someone/somewhere by storm\ntake care (of yourself)\ntake care of someone/something\ntake charge (of something)\ntake something for granted\ntake heart\ntake hold\ntake something in (your) stride\ntake something into account\ntake issue with someone/something\ntake it easy\ntake it or leave it\ntake its toll\ntake it upon yourself to do something\ntake notice (of something)\ntake (great) pains to do something\ntake part in something\ntake your pick\ntake place\ntake sides\nsomething takes the cake\ntake stock (of something)\ntake the bull by the horns\ntake the initiative\ntake the plunge\ntake the time to do something\ntake the wraps off something\ntake your time\ntake someone to task for something\ntake something with a grain of salt\ntake someone’s word for it\nPhrasal verbs\ntake someone back\ntake something off\ntake something out on someone\ntake someone through something\ntake something through something\ntake someone up on something\ntake something up with someone\ntake after someone\ntake apart something\ntake away something\nMore phrasal verbs\ntake back something\ntake down something\ntake down someone\ntake down something\ntake in something\ntake in someone\ntake in something\ntake in someone\ntake in something\ntake in something\ntake off\ntake off\ntake off something\ntake on something\ntake on someone/something\ntake out something\ntake out someone\ntake out something/someone\ntake over (something)\ntake to something/someone\ntake to something\ntake to somewhere\ntake up something\ntake up something\ntake up something\ntake up something\ntake up with someone\ntake noun\n(FILMING)\n[ C ] the filming of a small part of a movie: That scene needed ten takes before they got it right.\ntake noun\n(MONEY)\n[ U ] the amount of money received from an activity: The box office take has been huge for the new show.\ntake noun\n(OPINION)\n[ C ] a particular feeling, opinion, or reaction: What’s your take on the new proposals for new health care?\nAdd to word list\nAdd to word list\n(also take away) to subtract one number or amount from another: take sth from sth You'll need to take $2,000 from the $8,000 to allow for tax.\nto remove something or someone from somewhere: take sth/sb off (sth) What are we left with after we take off our costs? I asked for her name to be taken off the list. They decided to take him off the job and assign him to another department.take sth away The police took away all of the files for investigation.\nto accept or receive something: Do you take credit cards?take an order We're taking 5,000 orders a day. Top executives will take a 10% pay cut. He took a job as salesman in a local company. Are you going to take the job if you get offered it?\nCOMMERCE\n&#160; (US also take in) to receive money from sales or as payment for something: They took an astonishing $100,000 in their first week. The company will make money by taking 5% from each bet.\nCOMMERCE to buy or choose something: The good news is that they have decided to take 200 units a year. 50% of our total production is taken by just three customers.\nto need something: It takes determination to succeed in a new business venture.\nif something takes a particular amount of time, that time is needed in order to finish it: They estimated that the project would take about 6 months to complete.\nhave (got) what it takes\nto have the necessary qualities or abilities to do something: Have you got what it takes to be in charge of a department? If you don't have what it takes, you're not going to last long.\ntake it or leave it\nused when you are offering something to someone to say that you will not improve your offer: And that's our final offer. Take it or leave it.\ntake part (in sth)\nto be involved in something with other people: Most of the board members took part in the discussions.\ntake stock\nto think carefully about a situation or event and form an opinion about it, so that you can decide what to do: When markets touch new highs, investors need to take stock. I am currently taking stock of our position.\nACCOUNTING →\nstocktake\ntake time\nto need a lot of time: It's going to take time to get this department running smoothly again. Phrasal verbs\ntake sth away\ntake sth back\ntake sth forward\ntake sth in\ntake off\ntake sth off\ntake sb on\ntake sth on\ntake sth out\ntake over\nMore phrasal verbs\ntake sb through sth\ntake sth up\n[ U ]\n&#160; FINANCE, COMMERCE money that is received from sales or as payment for something: The players now get 75% of the take. Tour operators had come to rely on the commission from insurance to increase their take. Last weekend's take was down over 50%.\nbe on the take disapproving informal\nto accept money for helping someone to do something illegal: They vowed to punish officials on the take."}