{"id":355884,"name":"talent","type":"noun","us_sound":"ˈtæl.ənt","us_link":"../audio/t/eus75962.mp3","uk_sound":"ˈtæl.ənt","uk_link":"../audio/t/uktajik012.mp3","content":"talent noun\n(NATURAL ABILITY)\nAdd to word list\nAdd to word list\nB1 [ C or U ] (someone who has) a natural ability to be good at something, especially without being taught: Her talent for music showed at an early age. His artistic talents were wasted in his boring job. Synonyms\naptitude\nflair\ngift (ABILITY) Related word\ntalentless\nMore examplesFewer examplesShe has loads of natural talent as a runner and with rigorous training she could be a world-beater.I play the piano tolerably well, though I have no particular talent for it.Musically speaking , this band has a lot of talent.She has a God-given talent as a painter.Creativity, ingenuity and flair are the songwriter's real talents.\nSMART Vocabulary: related words and phrases\nSkill, talent and ability\nability\naccomplishment\naccuracy\nacumen\nadroitness\nendowment\nflair\nforte\nfunctional skills\nfunctioning\ngenius\nnon-technical\npolish\nprestidigitation\nproficiency\nprowess\nspeciality\nwheelhouse\nwizardry\nworkmanship\nSee more results »\ntalent noun\n(ATTRACTIVE PEOPLE)\n[ U ] UK slang mainly humorous people who are sexually attractive: There was plenty of talent at the party last night.\ntalent noun\n(UNIT OF WEIGHT)\n[ C ] an ancient unit of weight: She is believed to have given Solomon 120 talents of gold. The Mesopotamian talent weighs 30.8 kilograms.\nSMART Vocabulary: related words and phrases\nMeasurements of weight & mass\natomic mass\nBMI\nbody mass index\ncarat\ncentigram\nct\ncwt\nG, g\ngm\ngrammage\nhundredweight\nmg\nmicrogram\nmilligram\nounce\noz\npound\nst\nton\nweigh\nSee more results »\nAdd to word list\nAdd to word list\na special natural ability to do something well, or people who have this ability: [ C ] His talents are being wasted in that job. [ U ] The baseball scouts are looking for new talent. talented adjective us\nYour browser doesn't support HTML5 audio\n/ˈtæl·ən·tɪd/\nA very young and talented violinist was the guest soloist.\nAdd to word list\nAdd to word list\na natural skill or ability: The successful candidate will have both talent and drive. The company benefited from her expertise and talents in sales.a talent for sth He had a great talent for business.\nHR a person or people with a natural skill or ability: The company has shown that it can attract and retain top talent. Other industries facing a talent shortage can easily outsource jobs overseas. He's considered one of the greatest talents in the programming world."}