{"id":355933,"name":"talk","type":"verb","us_sound":"tɑːk","us_link":"../audio/t/talk.mp3","uk_sound":"tɔːk","uk_link":"../audio/t/uktajik017.mp3","content":"talk verb [I]\n(SAY WORDS)\nAdd to word list\nAdd to word list\nA1 to say words aloud; to speak to someone: We were just talking about Gareth's new girlfriend. My little girl has just started to talk. She talks to her mother on the phone every week.\nThesaurus: synonyms, antonyms, and examples\nto talk to someonetalkA group of men were talking in the street.speakCould I speak to you privately?sayI couldn't hear what they were saying.chatWe were just chatting about the party.have a chatWe had a little chat over the garden wall.chatterThey spent the morning chattering away.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\nto talk about somethingtalk aboutI don't like talking about my feelings.speak aboutHe is often asked to speak about the decline of global energy supplies.discussWe need to discuss arrangements for next week.talk overI need to talk it over with my wife before I accept the job.talk throughWe're used to talking things through, so we don't have many arguments.debateThe bill will be debated in parliament next week.\nSee more results »\nMore examplesFewer examplesYou're not allowed to talk during the exam.The argument was upsetting for us all - I don't want to talk about it.Could I talk to you about a personal matter?He didn't talk about his exam results in case people thought he was boasting.She waves her hands around a lot when she's talking.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nSee more results »\ntalk verb [I]\n(DISCUSS)\nB2 to discuss something with someone, often to try to find a solution to a disagreement: The two sides have agreed to talk. talk business, politics, etc.\nC1 to discuss a particular subject: Whenever they're together, they talk politics.\nSMART Vocabulary: related words and phrases\nDebate & discussion\nagent provocateur\nargue\nargue against something\nargue for something\nbargain\nbargainer\nbat around\ncontroversial\ncontroversialist\nfloat\nhash\nout-debate\noutbargain\npalaver\npanel discussion\npolarized\nsophism\ntendentious\nwash (something) up\nwell argued\nSee more results »\ntalk verb [I]\n(LECTURE)\nB2 to give a lecture on a subject: The next speaker will be talking about endangered insects.\nSMART Vocabulary: related words and phrases\nLecturing & addressing\nco-present\ndiscourse\neunoia\nextemporize\njawbone\nlead off\nlightning talk\nmaiden speech\nmonologue\nonto\noratorically\npresentation\nsermon\nsermonize\nslide\nspeak\nspeech\nspeechify\ntalk at someone\nvalediction\nSee more results »\nGrammar\nSpeak or talk?The verbs speak and talk both generally mean ‘say words’, but there are some small differences in how they are used. Speak is more formal than talk. …\nSpeak and talk: usesThe verbs speak and talk both generally mean ‘say words’, but there are some small differences in how they are used. Speak is more formal than talk. …\nSpeak and talk with prepositionsWe usually use to after speak and talk. In more formal situations, people sometimes use with: …\nIdioms\nbe like talking to a brick wall\ngive someone something to talk about\nlook who's talking!\ntalk someone's head off\ntalk a blue streak\ntalk about ...\ntalk dirty\ntalk nonsense\ntalk sense\ntalk shop\nMore idioms\ntalk some sense into sb\ntalk smack\ntalk the hind leg(s) off a donkey\ntalk the talk\ntalk the talk ... walk the walk\ntalk through your hat\ntalk tough\ntalk turkey\ntalk your way out of something\ntalking of someone/something\nPhrasal verbs\ntalk about something/doing something\ntalk at someone\ntalk around something\ntalk back\ntalk something down\ntalk someone down\ntalk down to someone\ntalk someone into something\ntalk something out\ntalk someone out of something\nMore phrasal verbs\ntalk something over\ntalk someone round\ntalk something through\ntalk something up\nB1 [ C ] a conversation between two people, often about a particular subject: I asked him to have a talk with his mother about his plan.\nB2 [ C ] a speech given to a group of people to teach or tell them about a particular subject: He gave a talk about/on his visit to Malaysia.\nThesaurus: synonyms, antonyms, and examples\na talktalkShe will give a talk on keeping kids safe on the internet.lectureThe lecture is entitled \"War and the Modern American Presidency\".presentationWe were given a presentation of progress made to date.speechYou might have to make a speech when you accept the award.addressHe took the oath of office then delivered his inaugural address.orationIt was to become one of the most famous orations in American history.\nSee more results »\ntalks C2 [ plural ]\nserious and formal discussions on an important subject, usually intended to produce decisions or agreements: Talks were held in Madrid about the fuel crisis.\nC2 [ U ] the action of talking about what might happen or be true, or the subject people are talking about: Talk won't get us anywhere. The talk/Her talk was all about the wedding.\nMore examplesFewer examplesHe gave a talk on the representation of women in 19th-century art.We need to have another talk about this - can we meet later this afternoon?Our talk soon veered onto the subject of football.She was nervous about giving a talk to her colleagues, but she carried it off very well.I had to have a talk to her about a complaint that was made about her work.\nSMART Vocabulary: related words and phrases\nInformal talking & conversation\na problem shared is a problem halved idiom\nbanter\nbantering\nbanteringly\nbants\nbloviate\nbull session\nbuzz\ncatch\nconversation\nconversational\nexchange\ngambit\nintercourse\npass\nput the world to rights idiom\ntake/lead someone on/to one side idiom\ntalk some sense into sb idiom\ntête-à-tête\nultra-casual\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLecturing & addressing\nInternational relations: diplomacy & mediation\nDebate & discussion\nIdioms\nbe all talk (and no action)\nbe the talk of somewhere\nbe the talk of the town\ntalk verb [I/T]\n(SAY WORDS)\nAdd to word list\nAdd to word list\nto say words aloud, usually to give or exchange information; to speak: [ I ] I talked with Carol on the phone yesterday. [ I ] We talked about books. [ T ] The candidates want to talk taxes (= discuss this subject). Idioms\ntalk about something\ntalk shop\ntalk some sense into someone\ntalk the talk\ntalk toughPhrasal verbs\ntalk someone/yourself into something\ntalk someone/yourself out of something\ntalk back\ntalk down someone\ntalk down something\ntalk down to someone\ntalk out something\ntalk over something\ntalk up something/someone\ntalk noun [C/U]\n(SAY WORDS)\na conversation between two people, often about a particular subject; the act of talking: [ U ] Talk won’t get us anywhere. [ C ] I had a talk with my boss. [ C ] Sarah gave a talk (= a speech before a group of people) on skyscrapers. [ U ] I’ve heard talk of a layoff (= unofficial information about it).\nTalks are official discussions between organizations or countries: [ C ] Contract talks between the airline and the union began today.\nAdd to word list\nAdd to word list\nto say things or speak to someone: talk about/of sth In Tokyo markets, the only thing people want to talk about is the budget problem.talk to/with sb I need to talk to the Sales Manager directly. She was talking on the phone to her co-worker.\ntalk business/politics, etc.\nto discuss a particular subject: At the dinner table, everyone was talking interest rate hikes and unemployment numbers.\nbe talking sth informal\nused to emphasize that you are referring to something serious or important, a large amount of money, etc.: We're talking big money here - £200 an hour. How long - are we talking five years or are we talking 30 years?\ntalk shop\nto talk about work with people you work with when you are not at work: I hate those office parties where everyone talks shop.\ntalk the talk informal\nto be able to speak with the confidence and knowledge of someone who knows a lot about a particular subject: He can certainly talk the talk, but will he get the deal done?\ntalk turkey US informal\nto discuss something in a direct way without avoiding difficult issues: Few politicians are willing to talk turkey about immigration.\nPhrasal verbs\ntalk sb around\ntalk sth down\ntalk down to sb\ntalk sb into sth\ntalk sb out of sth\ntalk sth over\ntalk sb through sth\ntalk sth up\n[ C ] an occasion when someone speaks to a group of people about a particular subject: A speaker is coming in to give a talk to the sales team.a talk about/on sth We listened to a talk about resources in the local economy.\ntalks [ plural ]\nGOVERNMENT, MANAGEMENT, HR serious and formal discussions on an important subject usually intended to produce decisions or agreements: contract/merger/takeover talks The latest round of talks ended today.begin/have/hold talks We held talks with the union about pay increases.in talks The two companies are in talks about a merger.talks about sth The studio broke off talks about a movie distribution deal.talks between sb Talks between the two nations have resulted in a new trade deal.\n[ U ] things people are saying about what might happen or be true: talk of sth She dismissed the talk of her resignation as nonsense. There has been talk of closing some regional offices.\nSee also\npay talks"}