{"id":355977,"name":"tally","type":"verb","us_sound":"ˈtæl.i","us_link":"../audio/t/tally.mp3","uk_sound":"ˈtæl.i","uk_link":"../audio/t/uktajik028.mp3","content":"Add to word list\nAdd to word list\nto match or agree with something else: The numbers on your spreadsheet don't tally with ours.\nSMART Vocabulary: related words and phrases\nBalance and imbalance\naccord with something\nalign\naxisymmetric\nbalance (something) out/up\nbalance of power\nharmonious\nharmonization\nharmonize\nharmony\nimbalance\nin accord with someone/something\nnon-symmetrical\nnonequilibrium\noff balance\non an even keel idiom\none man's loss is another man's gain idiom\nunbalance\nunharmonious\nwell balanced\nwell rounded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing or appearing similar or the same\nPhrasal verb\ntally (something) up\na record or count of a number of things: Make sure to keep a tally of the number of customers going in and out.\nSMART Vocabulary: related words and phrases\nLists and catalogues\nagenda\narchivist\nbibliographical\nbibliographically\nbirthday honours\nglycaemic index\nhit list\nhonor roll\nhonours list\nindices\nquestionnaire\nrecital\nregistrable\nroll of honour\nroster\nthe White Pages\nwait list\nwaiting list\nwedding list\nwhitelist\nSee more results »\ntally noun [C usually sing]\n(COUNT)\nAdd to word list\nAdd to word list\na record or count of a number of items: The final tally was 21 for and 16 against.\ntally verb [I/T]\n(AGREE)\nto match or agree: [ T ] I need to finish tallying the receipts. [ I ] His statement doesn’t tally with the other witnesses’.\ntally verb [I/T]\n(COUNT)\nto count or calculate something: [ T ] The judges are tallying the scores. [ T ] Zolga tallied (= scored) 16 points. [ M ] She tallies up our expenses each month.\nAdd to word list\nAdd to word list\n[ I ] to match or agree with something else: tally with sth Make sure the amount coming off your mortgage tallies with what's going out of your bank account. The two accounts of the incident do not tally.\n[ T ] (also tally sth up) to calculate something: To tally up the taxes you paid during the period, use Form 8913.\n[ T ] to reach a total number or amount of things or people: The bookstore has tallied 1,700 advance orders.\n(also running tally) a continuous record or count of a number of things or people: He kept a tally of his paydays on an envelope. The website publishes a running tally of the sums customers have won in refunds.\nthe total number or amount of things or people: the tally for sth The final tally for biodiesel production in 2012 should be between 220 and 275 million gallons. the second-highest tally on record"}