{"id":356347,"name":"tangible","type":"adjective","us_sound":"ˈtæn.dʒə.bəl","us_link":"../audio/t/tangible.mp3","uk_sound":"ˈtæn.dʒə.bəl","uk_link":"../audio/t/uktalmu021.mp3","content":"Add to word list\nAdd to word list\nC2 real and not imaginary; able to be shown, touched, or experienced: We need tangible evidence if we're going to take legal action. Other tangible benefits include an increase in salary and shorter working hours.\nSMART Vocabulary: related words and phrases\nTrue, real, false, and unreal\nactual\nactuality\nactually\nall that glitters is not gold idiom\nanger\nfalse flag\nfalsely\nfantastical\nfever dream\nfictional\nnon-material\nnon-realistic\nnot so much idiom\nnothing could be further from the truth idiom\nnothing could have been further from my mind/thoughts idiom\nuntrue\nuntruly\nunverifiable\nurban myth\nvalidity\nSee more results »\nRelated word\ntangibly\nAdd to word list\nAdd to word list\nreal and able to be shown or touched: Drivers will see tangible improvements on major roadways.\nAdd to word list\nAdd to word list\nreal, existing; able to be shown or experienced: tangible evidence/proof/signs We can now see tangible evidence of economic renewal and growth.a tangible achievement/benefit/effect Rewards can include financial payments, promotions, and other tangible benefits.tangible improvement/progress/results They hope the meeting will achieve tangible results.\nECONOMICS able to be touched or felt: A key difference between tangible cash and almost any other form of money lies in traceability.tangible goods/products The company buys and sells services as well as tangible goods. tangibly adverb /ˈtændʒəbli/\nThe summit will bring the area some useful publicity and, more tangibly, a huge building boom. Compare\nintangible\n[ C, usually plural ]\n&#160; ECONOMICS a real thing that exists in a physical way: Quality standards for tangibles like food are easier to assess than for intangibles such as service or waiting times. Compare\nintangible noun\ntangibles\n[ plural ]\n&#160; FINANCE physical things that you can invest in, such as gold, oil, or works of art, rather than financial investments: The price of precious metals and other tangibles should appreciate over the following years.\n[ C, usually plural ]\n&#160; ACCOUNTING, FINANCE →\ntangible asset"}