{"id":356439,"name":"tanking","type":"adjective","us_sound":"ˈtæŋ.kɪŋ","us_link":"../audio/t/cdo0123ustank2352.mp3","uk_sound":"ˈtæŋ.kɪŋ","uk_link":"../audio/t/cdo0123uktank2695.mp3","content":"Add to word list\nAdd to word list\nsuddenly failing or becoming less successful or lower in value: Soaring fuel prices and a tanking economy will encourage many people to stay closer to home this year. In theory, a tanking pound can help UK exporters.\nMore examplesFewer examplesA tanking economy is going to mean state budget cuts.They are very aware of the harsh economic environment that has resulted from the tanking housing market.He wrote an article about the tanking auto industry.International trade has dwindled amid economic strife and a tanking technology sector.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\ntanking noun [U]\n(LESS SUCCESSFUL)\ninformal the fact of suddenly failing or becoming less successful or lower in value: Her taking out a loan coincided with the tanking of the housing market. There was a meltdown in the banking sector and the tanking of the local currency.\ninformal the act of intentionally losing a game or sports event: If a sporting event has been compromised by the tanking of a game, trust will be lost for ever. The driver was fined for blatant tanking.\nMore examplesFewer examplesThey were willing to put the country through a brutal and protracted recession - with a corresponding tanking of the president's popularity. Given the tanking of the market in the past year, this type of contract was a very bad idea.\nSMART Vocabulary: related words and phrases\nFailing and doing badly\nabjectly\nat-risk\nbackbencher\nballs (something) up\nbe on your beam ends idiom\nblow (someone/something) up\nbomb\negg\nflog\nflog a dead horse idiom\nflop\nflub\nflunk out\nfounder\nrot\nrunning on empty idiom\nsclerotic\nscrew\nsmoke\nthe rot sets in idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWinning, losing & scoring in sport\ntanking noun [U]\n(PROTECTING BUILDING)\nUK the act of covering a wall, etc. with a special substance or material in order to keep it dry, or the substance or material that is used to do this: The work will not be cheap because the tanking will usually be done with a lead lining. The architect had specified full fibreglass tanking in one client's bathroom.\nMore examplesFewer examples The back wall does not get damp, and so tanking seems inappropriate in this case.I cannot see the tanking as the walls are heavily plastered.\nSMART Vocabulary: related words and phrases\nBuilding: construction work & workers\nbanksman\nblaster\nbreak ground idiom\nbrick\nbrick something up\nelectrician\nerection\nflip\nfound\nglazier\njoiner\nreface\nrefurb\nrefurbish\nrefurbished\nrefurbishment\ntiler\nwell built\nworkman\nwright\nSee more results »"}