{"id":356581,"name":"tap","type":"verb","us_sound":"tæp","us_link":"../audio/t/tap.mp3","uk_sound":"tæp","uk_link":"../audio/t/uktanke018.mp3","content":"tap verb\n(HIT)\nAdd to word list\nAdd to word list\nB2 [ I or T ] to hit something gently, and often repeatedly, especially making short, sharp noises: tap against The branches tapped against the window. I could hear him tapping his fingers on the desk. I was tapping my feet (= hitting the floor gently with my feet) to the music.tap someone on the shoulder Someone tapped me on the shoulder.\n[ I or T ] to touch the screen of a phone, tablet computer, etc. in order to give an instruction for something to happen : You can manage the repeat and shuffle options by tapping the screen once and swiping to the left.tap on When I tapped on the update button, the screen went blank.\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntouch\nSee more results »\ntap verb\n(GET)\n[ T ] to get or make use of something: For more than a century, Eastern cities have expanded their water supplies by tapping ever more remote sources. There is a rich vein of literary talent here just waiting to be tapped by publishers.\nSMART Vocabulary: related words and phrases\nUsing and misusing\nadopt\nadoption\navail\navail yourself of something\nbe/go heavy on something idiom\ndraw\nexhaust\ngo through\ngobble something up\nmake capital out of something idiom\nmax\nmax out\nspare\nspent\nswallow\nturn over\nturn to someone/something\nturn/use something to good account idiom\nunblock\nunderuse\nSee more results »\ntap verb\n(PHONE)\n[ T ] to use a small device attached to a phone in order to listen secretly to what people are saying: tap a phone He suspected that his phone had been tapped.\nSMART Vocabulary: related words and phrases\nAmplifiers, microphones & speakers\namplifier\nbalance\nbass\nbullhorn\nearphone\nelectrophone\nheadphone\nheadphones\nheadset\nhot mic\nloudhailer\nmegaphone\nmic\nmicrophone\nmike\nmike check\npa\npublic address system\nsoundbase\nTannoy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: spying and espionage\nPhrasal verbs\ntap someone for something\ntap in\ntap something in\ntap into something\ntap out\ntap something out\ntap noun\n(DEVICE)\nB1 [ C ] (also US faucet) a device that controls the flow of liquid, especially water, from a pipe: the hot/cold tapturn the tap on She turned the tap on and filled up the kettle.turn the tap off You can save water by turning the tap off while you're brushing your teeth.\nSam Edwards/OJO Images/GettyImages\n[ C ] (also US faucet) something that allows a supply of something such as money, information, or people to flow: Banning organizations from giving contributions to individuals would turn off the tap of money flowing to corrupt politicians. The industry requires huge financial support and it looks as though the government is willing to turn on the tap.\n[ C ] UK a device that controls the flow of gas from a pipe\n[ C ] a device that controls the flow of beer from a barrel, or from a pipe connected to a barrel: Some beer taps produced more foam than beer. on tap\nused to describe beer that is served from a barrel through a tap: Our favorite pub kept kegs of Guinness on tap.\navailable for use at any time: Working in a library as I do, I have all this information on tap.\nSee more\nMore examplesFewer examplesThe water was barely dribbling out of the tap.I still haven't got round to fixing that tap.Some idiot left the tap running in the bathroom and there's water everywhere.The hot tap is running cold !There's a tray under each tap to catch the beer slops.\nSMART Vocabulary: related words and phrases\nBuilding: plumbing, pipes & sewage\nballcock\ncaulking\ncesspit\ncistern\nconduit\nhydrant\ninfluent\nisolator\nmixer tap\noutfall\nplumb\nplunger\nsewage\nsewage works\nsewer\nsiphon\nspigot\nstandpipe\nsyphon\nwaterworks\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGiving, providing and supplying\nSelling & serving alcoholic drinks\ntap noun\n(HIT)\nB2 [ C ] a gentle knock or touch, or the noise made by knocking something gently: I gave her a tap on the shoulder and she turned around. There was a tap on the window - Dad was outside!\nSMART Vocabulary: related words and phrases\nTouching & feeling\narm\ndab\nfelt\nfiddle\nfiddle (around) with something\nget to second base idiom\nget to third base idiom\ngraze\nhandle\nkiss\nnudge\npaw\npet\nretexture\nsecond base\ntactile\ntactilely\ntactility\ntexturally\ntouch\nSee more results »\ntap noun\n(DANCE)\n[ U ] →\ntap dancing : He teaches tap and ballroom.\n4x6/iStock/Getty Images Plus/GettyImages\nSMART Vocabulary: related words and phrases\nDance & choreography\narabesque\nbacking dancer\nbackspin\nbackup dancer\nballerina\ncountry dancing\ncut a rug idiom\ndabbing\ndance\ndance studio\nmodern dance\nmoonwalk\nmoonwalking\nmorris dance\nmorris dancer\ntap dancing\ntarantella\nTerpsichore\nterpsichorean\nthrow shapes idiom\nSee more results »\ntap noun\n(PHONE)\n[ C ] a small piece of equipment that can be attached to a phone in order to listen secretly to someone's phone calls: phone tap He claims that he knew nothing of government phone taps on journalists during those years.\nSMART Vocabulary: related words and phrases\nInternational relations: spying and espionage\nagent\nagent provocateur\nanti-bug\nasset\ndebug\nindustrial espionage\ninsider\nintel\nintelligence\nMI5\noperative\nscout\nsecret service\nsleuthing\nsnoop\nsnoopy\nspook\nspy\ntail\nthe CIA\nSee more results »\ntap noun\n(SPEECH SOUND)\n[ C ]\n&#160; phonetics\n&#160; specialized a sound made by the tongue moving upwards and downwards very quickly and hitting the alveolar area\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\napheresis\naphesis\nassonance\ndiphthong\nintrusive\nlabial\nlabialize\nlabiodental\nmispronounce\nplosive\npostalveolar\npostconsonantal\nretroflex\nrhotic\nthe International Phonetic Alphabet\nunpronounceable\nunrepeatable\nSee more results »\ntap verb [I/T]\n(HIT)\nAdd to word list\nAdd to word list\nto hit something lightly and quickly, or to make a sound by doing this: [ T ] She tapped the back of his hand. [ I ] Casey is tapping away at his computer.\nTo tap is also to tap-dance.\ntap verb [I/T]\n(OBTAIN)\nto obtain or make use of something: [ T ] Their try to tap the students’ natural abilities. [ I ] I can tap into computers all over the world.\ntap verb [I/T]\n(TELEPHONE)\nto wiretap a telephone\nPhrasal verbs\ntap out something/someone\ntap out something\ntap noun [C]\n(DEVICE)\na device that controls the flow of liquid, esp. water; a faucet: Please turn off the tap. on tap\nBeer that is on tap is served from a barrel (= large container) through a tap.\ntap noun [C]\n(HIT)\na quick and light hit, or the sound that this makes : She gave him a tap on the shoulder. There was a tap at the door.\ntap noun [C]\n(TELEPHONE)\na wiretap: They put a tap on her phone.\nIdiom\non tap\nAdd to word list\nAdd to word list\n[ I or T ] to get or make use of something that exists, such as money, skills, information, energy, etc.: The company has tapped a $8750 general fund surplus to pay for the building projects. Ultra-deep water drilling techniques allow them to tap energy reserves once thought to be out of reach.tap into sth They are driven by a desire to tap into this lucrative commercial market.tap sth for sth Do we have any assets that can be tapped for capital?\n[ T ] US informal to choose someone for a job: tap sb to do sth The board tapped him to lead the company through bankruptcy reorganization.\n[ T ]\n&#160; IT\n&#160; informal to put information, numbers, etc. into a computer, telephone, etc. by pressing buttons: tap away at/on sth When I came in, she was tapping away at her computer.tap sth into sth He tapped his password into the computer.tap sth in Shoppers may also be asked to tap in identity numbers at tills.tap sth out SMS allows people to send messages tapped out on the telephone keypad.\n[ C ] a piece of equipment that controls the flow of liquid or gas from a pipe: Water was pouring out of all the taps. a gas tap\non tap informal\navailable for use at any time: With the internet, firms have all this information on tap.\nUS ready or likely to happen at a future date: Many investors are worried about what's on tap when the markets reopen tomorrow morning. The company has about 115 new stores on tap for 2012."}