{"id":356601,"name":"tape","type":"noun","us_sound":"teɪp","us_link":"../audio/t/tape.mp3","uk_sound":"teɪp","uk_link":"../audio/t/uktanke020.mp3","content":"tape noun [C or U]\n(RECORDING)\nAdd to word list\nAdd to word list\nthin plastic in a long, narrow strip with a magnetic covering that allows sounds or sounds and pictures to be recorded and played again, especially one on which sound is recorded: magnetic tapeon tape I've got that film on tape (= recorded) if you want to borrow it.blank tape If you give me a blank tape (= one with nothing on it) I'll record it for you.\n/GettyImages\nMore examplesFewer examplesYour tape deck has chewed up my cassette!The course comprises a class book, a practice book and an audio tape.Now the data is being transferred from magnetic tape to hard disk.The tape jammed while I was fast-forwarding it.We couldn't hear what they were saying on the tape - there was too much background noise.\nSMART Vocabulary: related words and phrases\nAudio & video equipment\n78\naudiocassette\naudiotape\nbody cam\nboom box\nbox set\nDAT\ndigital audio tape\nequalizer\nhi-fi\njukebox\nPDC\nradiogram\nstereo\nsubwoofer\ntweeter\nVCR\nvideo technology\nvideocassette\nwire\nSee more results »\ntape noun [C or U]\n(STRIP)\na long, narrow strip of material that is sometimes sticky on one side: I need some tape and scissors to wrap the present.UK sticky tape\nJoKMedia/E+/GettyImages the (finishing) tape\na tape stretched across the finishing line of a race that the winner breaks as they finish: She pumped her fist in the air as she broke the finishing tape.\nSee more\nSMART Vocabulary: related words and phrases\nBands, straps and strips\narmband\nband\nbar\nblindfold\nbraid\ncollar\ndog collar\nduct tape\ngag\nloom bands\nmasking tape\nraffia\nriband\nribbon\nstraight edge\nstrap\nstreamer\nstripe\nsweatband\nwebbed\nSee more results »\ntape verb [T]\n(RECORD)\nto record something on tape\nSMART Vocabulary: related words and phrases\nRecording sounds and images\nanalogue\naudiovisual\nbalance\ncut\ndeepfake\ndigitally\ndistort\ndistorted\nfast-forward\nmisrecord\nmix\nplay something back\npostproduction\nprerecord\nre-record\nremaster\nresynthesis\nsample\nsampler\nvideotape\nSee more results »\ntape verb [T]\n(USE STICKY STRIPS)\nto use strips of sticky material, especially to fix two things together or to fasten a parcel: She taped a note to the door.\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nIdiom\nhave someone tapedPhrasal verb\ntape something up\ntape noun\n(STICKY MATERIAL)\nAdd to word list\nAdd to word list\n[ U ] a long, narrow strip of plastic, cloth, or paper that is sticky on one side and is used to attach things: masking/duct tape packing/electrical tape trademark Scotch tape\ntape noun\n(RECORDING MATERIAL)\n[ C/U ] a long, narrow strip of plastic or thin metal used to record and play sound or sound and pictures; a cassette or videotape: [ C ] Did you make a tape of Tyler’s concert? [ U ] Is that movie available on tape yet?\ntape noun\n(strip)\n[ C ] a long, narrow strip of cloth, paper, or thin metal: a tape measure\ntape verb [T]\n(USE STICKY MATERIAL)\nto use a thin strip of material to attach or join things: I taped a note on her door. He taped the pages back together.\ntape verb [T]\n(RECORD)\nto record sound and pictures on a long, narrow strip of plastic or thin metal: This song was taped live in concert.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS, IT a narrow, very long strip of plastic with a magnetic covering for storing information, pictures, or sounds: Evidence from the tapes showed that the sales director was involved in corrupt negotations.on tape They admitted on tape that they were working for a tabloid newspaper. magnetic tape\nWORKPLACE a narrow, very long strip of material that is sticky on one side and can be used to fix things together: Attach the mat to the backboard with tape. See also\nred tape\nsticky tape\nticker tape"}