{"id":356620,"name":"taper","type":"verb","us_sound":"ˈteɪ.pɚ","us_link":"../audio/t/taper.mp3","uk_sound":"ˈteɪ.pər","uk_link":"../audio/t/uktanke021.mp3","content":"taper verb [I or T]\n(GET NARROWER)\nAdd to word list\nAdd to word list\nto become gradually narrower at one end, or to make something do this: The cave tapered to a narrow passageway. Taper your brows slightly at the end. The table was mounted on slender, tapering legs.\nMore examplesFewer examplesThe creature had a cone-shaped body covered with loose, shaggy hair, tapering to a small head.The top of the building tapers into a cone.She wore loose silky pants gathered into a deep, fitted waistband and tapering at her ankles.Roll the dough into a thick sausage about 15cm long, tapering it to a point at one end.Taper the path to make it appear longer.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\nshave\ntelescope\ntumble\nSee more results »\ntaper verb [I or T]\n(REDUCE AMOUNT)\nto gradually become less in amount, or to make something do this: The new tax credit will gradually taper for higher earners. It is important to taper medication to prevent narcotic withdrawal syndrome.\nsports\n&#160; specialized to gradually reduce the amount of training that you do, especially in the last stage of preparing for an important race or competition: When tapering for a race, the athlete's heart rate should be steadier. They tapered the workout in the last two weeks before the event.\nMore examplesFewer examplesBolton's form has tapered with four losses in the past four games.The allowance will taper for those with higher incomes.She tapers the drugs so that mothers will be off medication at the time of delivery.There was no evidence that quitting cold turkey was more difficult than tapering the number of cigarettes smoked per day.It's important to stay mobile after the marathon; taper your activity, don't stop abruptly.\nSMART Vocabulary: related words and phrases\nBecoming and making smaller or less\nabridgment\nattenuate\nattenuated\nattenuating\nattenuation\nboil\ndamp\nfall off\nfall off a cliff idiom\nfalling\nfalling-off\nforeshorten\nrightsizing\nroll back something\nrollback\nrun someone/something down\nrundown\nshave\ntelescope\ntumble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExercising & training\nRelated word\ntaperingPhrasal verb\ntaper off\na very thin candle or a very thin strip of wood, used especially in the past for lighting candles, fires, etc.\n/GettyImages\nSMART Vocabulary: related words and phrases\nLighting & light fittings in the home\ncandelabra\ncandle\ncandlestick\ncandlewick\nchandelier\nhalogen lamp\nhead torch\nheadlamp\nhurricane lamp\nlamp\nluminaire\nnightlight\npenlight\npillar candle\nrope light\ntable lamp\ntea light\ntiki torch\nunlit\nuplighter\nSee more results »\nAdd to word list\nAdd to word list\nto become gradually narrower: [ T ] The drill bit is tapered on one end. Phrasal verb\ntaper off"}