{"id":356868,"name":"target","type":"noun","us_sound":"ˈtɑːr.ɡɪt","us_link":"../audio/t/target.mp3","uk_sound":"ˈtɑː.ɡɪt","uk_link":"../audio/t/uktarge001.mp3","content":"target noun\n(OBJECT SHOT AT)\nAdd to word list\nAdd to word list\nB2 [ C ] an object shot at during shooting practice, often a circle with a pattern of rings, or any object or place at which bullets, bombs, etc. are aimed: I had four shots but I didn't even hit the target. Any major airport or station is potentially a terrorist target.\nJacobs Stock Photography Ltd/DigitalVision/GettyImages\nMore examplesFewer examplesAim for the dead centre of the target.Aim the arrow a little above the target.When you've aligned the notch on the gun with the target, fire!They received intelligence that the factory was a target for the bombing.The missile strike was devastating - the target was totally obliterated.\nSMART Vocabulary: related words and phrases\nTarget sports\naim\narcher\narchery\narrow\narrowhead\nbullseye\nclay pigeon\ndart\ndartboard\nend\nmarksmanship\nquiver\nriflery\nringer\nshooter\nshooting\nshooting gallery\ntarget practice\ntoxophilite\ntrapshooting\nSee more results »\ntarget noun\n(PERSON/GROUP)\nC2 [ C usually singular ] a person or a particular group of people that something is directed at, or that something is intended for: The target audience for the TV series is young people aged 13 to 18.\nC1 [ C usually singular ] one or more people who are criticized or laughed at, or who experience unpleasant treatment from others: Recently she has been the target of a series of obscene phone calls.\nMore examplesFewer examplesThey flew into heavy flak over the target area.Major tourist attractions are a soft target for pickpockets.We must decide on our target market, then zero in on it.The target of these new laws is people whose dogs foul the streets.\nSMART Vocabulary: related words and phrases\nGetting, receiving and accepting\nacquirable\nacquire\nacquisition\nawardee\ncarve\ndraw\nearn\nget back\nget out of something\nget/lay/put your hands on someone idiom\nglom onto something/someone\ngo to someone\npocket\nscore\nscrew\nscrew something out of someone\nsecure\nseize\nseize on/upon something\nsnap something up\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\ntarget noun\n(AIM)\nB2 [ C ] a level or situation that you intend to achieve: The government's target of 3.5 percent annual growth seems easily attainable. Synonyms\naim (INTENTION)\nambition\naspiration (HOPE)\ndream (HOPE)\ngoal (AIM)\nhope\nintent formal or specialized\nintention\nobject (PURPOSE)\nobjective\nThesaurus: synonyms, antonyms, and examples\nsomething you want to do or achieveaimOur aim in protesting is to raise awareness of the unfairness of the system.goalMy goal in life has always been to be financially independent.objectiveOne of my objectives for this year is to increase sales.targetIf you meet your sales targets you will receive a generous bonus.dreamWhen I was growing up my dream was to perform in front of millions of people.hopeMy hope is that there will be some kind of positive outcome to this process.\nSee more results »\nMore examplesFewer examplesDo you think we will be able to meet our target?He's set himself the goal/target of making his first million by the time he's 30.We set ourselves a target of becoming self sufficient within four years.Government targets for waiting lists are beginning to be met.\nSMART Vocabulary: related words and phrases\nGoals and purposes\naffordance\nambition\navail\ncause\ndedicated\ndeflect\ndream\neye\nfunction\nit's the thought that counts idiom\nkey performance indicator\nKPI\nmoonshot\nobjective\npoint\ntarget setting\nthought\ntowards\nundedicated\nundirected\nSee more results »\nIdiom\non target\ntarget verb [T]\n(DIRECT)\nC2 to direct advertising, criticism, or a product at someone: The advert for the energy drink is targeted specifically at young people.\nMore examplesFewer examplesThe adverts target yoof culture.These adverts are designed to target young people.High repayment loans are often targeted at the people who can least afford them.Cigarette manufacturers have been criticized for targeting youngsters.\nSMART Vocabulary: related words and phrases\nAiming and aim\naim\ncrosshairs\ndirect\nhome\nhome in on something/someone\nlevel\nlevel something at someone\nretarget\ntrain\nzero\nzero in on something/someone\ntarget verb [T]\n(ATTACK)\nto aim an attack, or a bullet, bomb, etc., at a particular object, place, or person: It is hoped that civilians will not be targeted during the war.\nSMART Vocabulary: related words and phrases\nAiming and aim\naim\ncrosshairs\ndirect\nhome\nhome in on something/someone\nlevel\nlevel something at someone\nretarget\ntrain\nzero\nzero in on something/someone\ntarget noun [C]\n(OBJECT AIMED AT)\nAdd to word list\nAdd to word list\nan object aimed and fired at during shooting practice, often a circle with a pattern of rings, or any object or place at which arrows, bullets, bombs, and other missiles are aimed: I missed the target. The plane passed over the target.\nA target is also a person or group attacked in some way: The president was the main target of the senator’s speech.\ntarget noun [C]\n(INTENDED RESULT)\na result or situation that you intend to achieve: We met our sales target for the year. Your calculations were on target (= accurate).\ntarget verb [T]\n(AIM)\nto direct an action, advertising, or a product at a particular person or group: The paper is targeted at young people.\ntarget verb [T]\n(AIM ATTACK)\nto direct an attack or criticism against someone or something: The candidate targeted his opponent's comments on the policy.\nAdd to word list\nAdd to word list\nMANAGEMENT, FINANCE, ECONOMICS, GOVERNMENT a result, level, or situation that an organization or group wants or plans to achieve: The company gave employees the details of performance targets for bonuses. economic/financial targets emissions/production/sales targets earnings/inflation/budget targetshit/meet/reach a target The French economy is on track to meet its growth targets. lower/raise/reduce a targetexceed/miss/set a target The company has set a target of 10 million wholesale broadband connections by 2014.a target date/level/price They plan to finish the manufacturing process by the new target date of October 31st.\nMARKETING, POLITICS a person, place, etc. that an action is directed at or intended for: a/the target for sb/sth The abundance of resources makes these areas aprime target for development. Savers have replaced borrowers as the priority target for banks and building societies.a/the target of sth Their chief executive officer is the target of an investigation into fraud.\nFINANCE\n&#160; (also target company) a company that another company wants to buy: an acquisition/bid/buyout target Their plan is to be a buyer rather than a buyout target. The City has tipped the group as a takeover target.\nFINANCE, MARKETING\n&#160; (also target price) the price at which someone wants to buy or sell something: Prices have remained below the $21 target because demand growth has been slow. The investment house has a 1,125p target price on the shares.\nan easy target (for sb/sth)\nsomeone or something that is easy to attack or criticize, often because they cannot defend themselves: Advertisers view themselves as an easy target for regulators. Big oil companies make easy targets for politicians anxious to take the heat off their own taxation policies.\non target\nif you are on target with a project, etc., you are likely to achieve what you planned at the time you intended: The company's ambitious growth plans are on target.on target to do sth We are on target to meet our sales goals for the coming year.\nSee also\non target earnings\nMARKETING, POLITICS to direct something, especially advertising or a product, at a particular group of people or a particular area: aggressively/carefully/specifically target sb/sth The marketing campaign is specifically targeting a different type of customer.target sth at sb/sth We need government restrictions on ads targeted at children.target sth to sb/sth They plan to target the tax cut to the middle classes.\nMANAGEMENT, FINANCE to choose someone or something for a particular type of treatment: target sb/sth for sth They have targeted the failing retailing group for takeover.target sb/sth as sth Certain areas of manufacturing have been targeted as priorities. See also\ntargeted"}