{"id":356893,"name":"tariff","type":"noun","us_sound":"ˈter.ɪf","us_link":"../audio/t/eus75963.mp3","uk_sound":"ˈtær.ɪf","uk_link":"../audio/t/uktarge002.mp3","content":"Add to word list\nAdd to word list\na charge or list of charges either for services or on goods entering a country Synonym\ndutyCompare\ntax noun\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBills & invoices\nAdd to word list\nAdd to word list\nsocial studies a government charge on goods entering or leaving a country: import tariffs\nAdd to word list\nAdd to word list\nTAX, ECONOMICS, COMMERCE a tax on goods coming into or going out of a country: Prices and tariffs change all the time, so it's difficult to say what you will get for your money.a tariff on sth The tariff on optical cables is 8.4%.impose/set/reduce tariffs The US has imposed new tariffs on chocolate from Brazil.cut/eliminate/remove tariffs An agreement was reached to eliminate tariffs on information technology products.high/low/steep tariffs on sth High tariffs on furniture imports are still imposed by some developing countries to protect local carpenters.tariff barriers/protection/rates The protectionist wall of high tariff barriers and import restrictions is being breached. an increase/a reduction in tariffs agricultural/industrial tariffs customs/export/import tariffs tariff concessions/cuts/reductions\nCOMMERCE a list of fixed prices charged by a company for services, by a hotel for rooms, etc.: Many smaller competitors have entered the market to undercut the company's telephone tariffs. Environment Energy offers a no-premium green electricity tariff. See also\nad valorem\ncompound tariff\nmultiple tariff\nprotective tariff\npunitive tariff\nretaliatory tariff\nrevenue tariff"}