{"id":357177,"name":"task","type":"noun","us_sound":"tæsk","us_link":"../audio/t/task.mp3","uk_sound":"tɑːsk","uk_link":"../audio/t/uktarge023.mp3","content":"task noun\n(WORK)\nAdd to word list\nAdd to word list\nB2 [ C ] a piece of work to be done, especially one done regularly, unwillingly, or with difficulty: perform a task We usually ask interviewees to perform a few simple tasks on the computer just to test their aptitude.daunting task The government now faces the daunting task of restructuring the entire health service.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nmoonlight\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\ntask noun\n(SPEAK ANGRILY)\ntake someone to task\nto criticize or speak angrily to someone for something that they have done wrong: take someone to task for/over something She took her assistant to task for/over her carelessness.\nSee more\nto give someone a task: be tasked with We have been tasked with setting up camps for refugees.\nSMART Vocabulary: related words and phrases\nGiving orders & commands\nall-points bulletin\nboss someone around\nbossily\nbossiness\nbossyboots\ncommanding\ndecree\ndemand\ndictate\nexact\nexpect\nharry\ninstruct\nprescribe\npush someone around\nput something on\nshove\nshove someone around\nstick\nstick out for something\nSee more results »\nAdd to word list\nAdd to word list\na piece of work to be done, esp. one done regularly, unwillingly, or with difficulty: Our first task after we moved was to find a doctor. Making these pastries is no easy task. They face the daunting task of rebuilding their economy.\nAdd to word list\nAdd to word list\nWORKPLACE a piece of work that needs to be done, especially one that is a regular part of someone's job: The new team's first task will be to ensure a smooth handover of power.carry out/complete/do a task Those in charge of planning the relocation will need to decide what tasks need to be carried out.assign/give/set sb a task A small team at head office has been assigned the task of setting up a central database. perform/undertake a task a big/important/major task a crucial/key/main task time-consuming/urgent tasks easy/menial/simple tasks administrative/creative/sales tasks\na difficult thing that must be done: a challenging/daunting task The government faces the daunting task of restructuring the pension system.a difficult/hard/impossible task With the cost-cutting complete, the bank is faced with the more difficult task of generating increased revenues to convert into profit.\nIT an action done by a computer such as starting a program, checking email, saving files, etc.: By automating repetitive tasks, software programs can save people a lot of time.do/execute/perform a task A mainframe's speed is measured in the number of tasks it can perform in a millisecond.\ntake sb/sth to task (over sth)\nto criticize a person, group of people, or an organization for doing something that you think is very wrong: Farmers took the large supermarket chains to task over their ruthless pricing. See also\nmultitasking\nto give someone a difficult job to do: task sb with (doing) sth The parent company is being tasked with turning around two new acquisitions.task sb to do sth The company completed only a small fraction of the 150 health clinics it was tasked to build."}