{"id":357239,"name":"tastelessly","type":"adverb","us_sound":"ˈteɪst.ləs.li","us_link":"../audio/t/ustanne028.mp3","uk_sound":"ˈteɪst.ləs.li","uk_link":"../audio/t/uktaste002.mp3","content":"tastelessly adverb\n(LIKELY TO UPSET)\nAdd to word list\nAdd to word list\nin a way that is likely to upset or offend someone: a tastelessly cruel joke\nMore examplesFewer examplesthe person who tastelessly broadcasts the intimate details of his personal life by talking too loudly on his cellphone A sidebar analysis is headlined, somewhat tastelessly, \"An Issue that Won't Die.\" It would have been better if they'd said nothing rather than boasting tastelessly about our smaller infant mortality figures.'Not even clapped-out old ex-wives?' I quipped - tastelessly, no doubt.\nSMART Vocabulary: related words and phrases\nCausing feelings of anger and displeasure\naggravate\naggrieve\nalienate\nanger\nannoy\nbend\ngive someone the shits idiom\ngo too far idiom\ngoat\ngrate\nhack someone off\njoke\nnark\nrile\nrub\nrub someone up the wrong way idiom\nruffle\nruffle someone's feathers idiom\ntit\ntroll\nSee more results »\ntastelessly adverb\n(NOT STYLISH)\nin a way that is not stylish: tastelessly decorated rooms See\ntasteless\nMore examplesFewer examplesa sweet-faced woman, badly and tastelessly dressed Certainly he had a busy life once he was safely installed in his lavishly modernised, tastelessly extended former labourer's hovel in the most picturesque part of rural Surrey. En route, you also get to see the tastelessly decorated rooms in which the future Queen Victoria spent her unhappy childhood.under covers of cream and blue (so tastelessly passe!) A minor convent, converted rather tastelessly into a hotel.\nSMART Vocabulary: related words and phrases\nNot attractive to look at\nback end\nbe no oil painting idiom\nbe not much to look at idiom\nbleakly\nbleakness\nexcrescence\ngopping\ngracelessly\nhatchet-faced\nhave a face like the back end of a bus idiom\nhideous\nhideousness\npretty\npretty-pretty\nputridly\nreptilian\nscrappily\nunsightly\nvulgarity\nvulgarly\nSee more results »"}