{"id":357228,"name":"taste","type":"noun","us_sound":"teɪst","us_link":"../audio/t/taste.mp3","uk_sound":"teɪst","uk_link":"../audio/t/uktarge028.mp3","content":"taste noun\n(FLAVOUR)\nAdd to word list\nAdd to word list\nB1 [ C or U ] the flavour of something, or the ability of a person or animal to recognize different flavours: taste of I love the taste of garlic.acquired taste Olives are usually an acquired taste (= you only like them after you have become familiar with their taste).sense of taste When you have a cold you often lose your sense of taste. See also\naftertaste a taste for something\nC2 the fact of liking or enjoying something: She came home from Europe with a taste for art and the finer things in life.\nSee more\n[ S ] a small amount of food: Have a taste of the sauce and tell me if it needs salt.\nMore examplesFewer examplesWhen preparing meals, you need to think about variety and taste as well as nutritional value.Lemons have a sharp taste.This wine has a light, fresh taste.Aniseed has a very distinctive taste - I don't like it personally.We value herbs for their taste, but we forget that they also have medicinal properties.\nSMART Vocabulary: related words and phrases\nFlavours & tastes\nacidic\nacidulous\nacridly\naftertaste\nageusia\nflavourfully\nflavourless\nflavoursome\nfruitily\nfruitiness\nsaltily\nsaltiness\nsalty\nsavory\nsavoury\numami\nunseasoned\nunsweetened\nvelvety\nvinous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nThe senses in general\nFood - general words\ntaste noun\n(JUDGMENT)\nB2 [ C or U ] a person's approval of and liking for particular things: I'm not really into new cars - old vintage cars are more to my taste (= what I like).\nB2 [ U ] approving a person's ability to judge and recognize what is good or suitable, especially relating to such matters as art, style, beauty, and behaviour: have good/terrible/etc. taste He has terrible taste so you can probably imagine what his house looks like.taste in His taste in clothes leaves a little to be desired. tastes B2 [ plural ]\nthe things a person likes: have expensive tastes I have expensive tastes (= I like expensive things) so I need to have a well-paid job.\nSee more\nMore examplesFewer examplesShe has a rather esoteric taste in clothes.She's always had execrable taste in men.She has exquisite taste.They've got those curtains that tie up with big bows - they're a bit fussy for my taste.I don't think garden gnomes are in very good taste.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ndig\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntight\nwarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFlavours & tastes\ntaste noun\n(EXPERIENCE)\nB2 [ S ] a short experience of something: have a taste of I had a taste of office work during the summer and that was enough.\nSMART Vocabulary: related words and phrases\nSamples and examples\nadvertisement\naliquot\narchetype\nbenchmark\nbenchmarking\ncore\ncross-section\nflavour\nfor instance idiom\nforerunner\nillustration\nincarnation\ninstance\nprototype\nqua\nquintessence\nrole model\nsample\nshowpiece\nspecimen\nSee more results »\nIdioms\nbe in good, the best possible, etc. taste\nbe in bad, poor, the worst possible, etc. taste\ntaste verb [T]\n(FOOD/DRINK)\nB1 to put food or drink in your mouth to find out what flavour it has: Taste this sauce and tell me if it needs seasoning. What is this? I've never tasted anything like it. taste good, bad, sweet, etc.\nB1 to have a particular flavour: This sauce tastes strange.\nSee more\nMore examplesFewer examplesTaste the stew to see if it has enough salt.How do you know you don't like it if you won't even taste it?We all tasted the cake.If you've ever tasted Carmen's cooking, you'll know what I mean.She drew off a little of her home-made wine just to taste.\nSMART Vocabulary: related words and phrases\nEating\nal desko\nbinge\nbinge eating\nbite\nbreak bread idiom\ncram\ndevour\nfeast\nfeast on something\nfeeder\nfeeding\nfinish\ngulp\ninhale\nmainline\npicnic\npig\npig out\npostprandial\npostprandially\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDrinking\ntaste verb [T]\n(EXPERIENCE)\nto experience something for a short time: Once you've tasted luxury it's very hard to settle for anything else.\nSMART Vocabulary: related words and phrases\nExperiencing and suffering\n(straight) from the horse's mouth idiom\nafflict\naffliction\nalmost/nearly die of something idiom\nbe a martyr to something idiom\nbe a victim of your own success idiom\nbear\ncount\ndepth\nget the short end of the stick idiom\ngo through\ngrip\nhands-on\nhit someone where they live idiom\nhorse\npractical\nrun up against something\nseat-of-the-pants\nsee life idiom\nstricken\nSee more results »\ntaste noun [C/U]\n(FLAVOR)\nAdd to word list\nAdd to word list\na flavor and feeling produced by food or drink in your mouth that tells you what it is and lets you appreciate it, or the ability to have this feeling: [ U ] Sugar has a sweet taste and lemons have a sour taste. [ U ] I’ve lost my taste for (= stopped enjoying the taste of) spicy foods.\nA taste is also a small amount: [ C usually sing ] Have a taste of this sauce and tell me if it’s too salty. [ C usually sing ] fig. I had a taste of (= I briefly experienced) factory work last summer, and I didn’t like it at all.\ntaste noun [C/U]\n(JUDGMENT)\na person’s ability to judge and appreciate what is good and suitable, esp. in art, beauty, style, and behavior: [ U ] Barbara has good/poor taste in clothes.\nTaste is also a person’s liking for or appreciation of something: [ C ] My son and I have very different tastes in music.\ntaste verb\n(HAVE FLAVOR)\nto have a particular flavor: [ L ] Coffee always tastes good in the morning. [ I always + adv/prep ] This tastes as if/as though/like it has pepper in it. [ T ] I hope you can taste the garlic. [ T ] Taste (= try a little of) this and tell me if you like it."}