{"id":357355,"name":"taunt","type":"verb","us_sound":"tɑːnt","us_link":"../audio/t/taunt.mp3","uk_sound":"tɔːnt","uk_link":"../audio/t/uktaste020.mp3","content":"Add to word list\nAdd to word list\nto intentionally annoy and upset someone by making unkind remarks to them, laughing unkindly at them, etc.: The other kids used to taunt him in the playground because he was fat and wore glasses. The youngest in the group was taunted mercilessly. Synonym\nbait\nMore examplesFewer examplesSome of the boys singled him out, laughing at him and taunting him.United's away fans enjoyed taunting their rivals.Opposing fans taunted him with chants and signs declaring him a drug cheat.\nSMART Vocabulary: related words and phrases\nMocking and taunting\ncaricature\nderide\nderision\nderisive\nderisively\nhaze\nlampoon\nlay yourself open to ridicule idiom\nmake a mockery of something idiom\nmake a monkey out of someone idiom\nmimic\nmimicry\nmock\nmockery\npiss\nridicule\nsardonic\nsardonically\nscoff\nscoffer\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing feelings of anger and displeasure\nunkind remarks made to intentionally annoy and upset someone: The protesters shouted taunts at the police. He had to endure the nastiest of racist taunts.\nMore examplesFewer examplesThe children would often come home in tears because of schoolyard taunts.Occasionally, they had to endure the cruel taunts of other children.He had silenced the taunts from opposition fans that had greeted so many of his appearances.\nSMART Vocabulary: related words and phrases\nMocking and taunting\ncaricature\nderide\nderision\nderisive\nderisively\nhaze\nlampoon\nlay yourself open to ridicule idiom\nmake a mockery of something idiom\nmake a monkey out of someone idiom\nmimic\nmimicry\nmock\nmockery\npiss\nridicule\nsardonic\nsardonically\nscoff\nscoffer\nSee more results »\nAdd to word list\nAdd to word list\nto try to make other people angry or upset by insulting them, laughing at them, etc.: The movie is about a criminal who taunts the police with phone calls. taunt noun [ C ] us\nYour browser doesn't support HTML5 audio\n/tɔnt, tɑnt/\nAt school, he had received jeers and taunts because of his size."}