{"id":357566,"name":"tax","type":"noun","us_sound":"tæks","us_link":"../audio/t/tax.mp3","uk_sound":"tæks","uk_link":"../audio/t/uktawny003.mp3","content":"Add to word list\nAdd to word list\nB1 (an amount of) money paid to the government that is based on your income or the cost of goods or services you have bought: They're increasing the tax on cigarettes. Tax cuts (= reductions in taxes) are always popular. What do you earn before/after tax (= before/after you have paid tax on the money you earn)? See also\ntaxation\nMore examplesFewer examplesA person's gross income is the money they earn before tax is deducted from it.The government have promised that they'll reduce taxes.The government will pay for the new schools by increasing the tax on luxury goods.Do you pay less tax if you're self-employed?The Chancellor has increased the tax on alcohol again.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\ntax verb [T]\n(MONEY)\nC1 to make someone pay a tax: Husbands and wives may be taxed jointly/separately.\nMore examplesFewer examplesThere was great opposition to plans to tax books.All subjects were taxed by the king.Any amount over this figure will be taxed.She is not taxed on these earnings because they are so low.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\ntax verb [T]\n(NEED EFFORT)\nto need someone to make a lot of effort, either physical or mental: He only has to read a short report - it shouldn't tax him too much.\nSMART Vocabulary: related words and phrases\nComplicated and difficult to do\nadvanced\nambitious\nambitiously\nanother\narduous\nformidable\nformidably\nget blood out of/from a stone idiom\ngrail\ngruelling\nonerous\nonerously\noverdemanding\npainstaking\npicnic\ntricky\ntuff\nultra-sensitive\nunintuitive\nunresolvable\nSee more results »\ntax noun [C/U]\n(MONEY)\nAdd to word list\nAdd to word list\nsocial studies (an amount of) money paid to the government, usually a percentage of personal income or of the cost of goods or services bought: [ C ] income/sales/Social Security tax [ C ] a property/gasoline tax [ U ] The senator proposed a tax increase/cut. tax refund social studies\nA tax refund is money returned to you from the government because you have paid more than you needed to for a particular year.\ntax verb [T]\n(NEED EFFORT)\nto be difficult for someone or use too much of something: All he has to do is wash a few dishes – that shouldn’t tax him too much. Round-the-clock nursing care severely taxed her resources.\ntax verb [T]\n(REQUIRE TO PAY)\nto require a person or organization to pay a tax: He maintained that corporations were not being taxed enough.\nAdd to word list\nAdd to word list\nan amount paid to the government based on a person's income, a company’s profits, the value of goods and services, etc, or this money considered together: Offshore trading companies are liable to pay tax at a rate of 5%.avoid/evade/escape tax Huge companies have the money to pay lawyers who advise them on ways to avoid tax.a tax on sth The law states that foreign businesses must pay taxes on business conducted in the US.increase/put up/raise taxes Many of the opposition's proposals will be very difficult to achieve without raising taxes.introduce/impose/levy a tax (on sth) The city has levied a tax of €1,000 on any SUVs registered to city-center addresses. abolish/cut/reduce a tax lift/remove a taxtax cuts/increases/rises The government must tighten its budget next year to offset poorly timed tax cuts. If you do not make the tax payment by February 28, an additional 5% surcharge is imposed.after/before tax The bank's bad debt provision forced profits before tax down to €152.7m.exclusive/inclusive of tax(es) The hotel failed to provide room rates inclusive of taxes.high/low tax(es) The area has very low property taxes. basic-rate/higher-rate tax a tax accountant/adviser/consultant a tax authority/agency/office See also\nad valorem\nafter-tax\nback tax\ncapital gains tax\ncapital tax\nconsumption tax\ncorporation tax\ncouncil tax\ndeath tax\ndeferred tax\nView all\ndegressive tax\ndirect tax\ndiscriminatory tax\nEBIT\nestate tax\nexcise tax\nexpenditure tax\nfederal tax\nflat tax\ngift tax\ngoods and services tax\ngraduated tax\nhead tax\nhypothecated taxes\nincome tax\nindirect tax\ninheritance tax\ninput tax\nlocal tax\nluxury tax\noutput tax\npayroll tax\npersonal income tax\npre-tax\nprogressive tax\nproperty tax\nproportional tax\npurchase tax\nreal estate tax\nregressive tax\nroad tax\nsales tax\nsin tax\nsocial security tax\nspecific tax\nstate tax\nstealth tax\nsupertax\nsurtax\ntransaction tax\nturnover tax\nunitary tax\nvalue-added tax\nwealth tax\nwindfall tax\nwithholding tax\nto make people or businesses pay an amount of money to the government from the money they earn, or when they buy goods or services: The state does not tax food or clothing.tax sth as sth The profits from these investments are taxed as ordinary income.tax sth at (a rate of) sth Earnings above the current threshold are taxed at 50%.tax sb on sth Homeowners who sell land for development are taxed on the profit.tax sb/sth heavily/lightly The government may tax housing more heavily. Non-electrical machines are lightly taxed."}