{"id":357585,"name":"taxed","type":"adjective","us_sound":"tækst","us_link":"../audio/t/cdo0123ustaxe2353.mp3","uk_sound":"tækst","uk_link":"../audio/t/cdo0123uktaxe2696.mp3","content":"taxed adjective\n(MONEY)\nAdd to word list\nAdd to word list\nIf something is taxed, someone has paid, or will pay, tax on it: Tobacco is heavily taxed, in the hopes that it will deter smokers. The car involved in the accident was not taxed or insured. You can take up to a quarter of your pension as a tax-free lump sum. The rest must be taken as taxed income. Compare\nuntaxed\nMore examplesFewer examplesI didn't realize pensions were taxed.Black-market drugs would undercut heavily taxed legal supplies.Investors rushed into tax shelters to convert highly taxed income into lightly taxed capital gains.\nSMART Vocabulary: related words and phrases\nTaxation\namortizable\nanti-dumping\nanti-progressive\nanti-tax\nat source phrase\nfinancial year\nfiscal year\nflat tax\ngas tax\nHMRC\nregressive\nregressively\nroad tax\nsales tax\nself-assessment\ntaxpayer\ntithe\ntop rate\nunprogressive\nuntaxed\nSee more results »\ntaxed adjective\n(EFFORT)\nhaving to make a lot of effort, either physical or mental, and finding this difficult: If they spend a lot of time outdoors, youngsters are less taxed by the emotional stresses of childhood. The study found that workers taking care of elderly parents feel more taxed than those with dependent children.\nMore examplesFewer examplesWhat we have been seeing recently is that people feel taxed physically and emotionally, and don't have much energy left to give.One of the staffers felt taxed when she had to process nearly 30 people in a day.This procedure helps people who are on dialysis, and are taxed by the dialysis process.\nSMART Vocabulary: related words and phrases\nExperiencing difficulties\nbe\nbe (caught) between a rock and a hard place idiom\nbe climbing the walls idiom\nbe for the high jump idiom\nbe/come up against a brick wall idiom\nembattled\nfall into something\nflounder\nfrying pan\nfumble\njungle\nleg\nnot have a leg to stand on idiom\non a razor edge idiom\nout of the frying pan into the fire idiom\npickle\npressed\nrocky\nsticky\nweed\nSee more results »\nRelated word\ntax"}