{"id":357705,"name":"tea","type":"noun","us_sound":"tiː","us_link":"../audio/t/t.mp3","uk_sound":"tiː","uk_link":"../audio/t/uksynta021.mp3","content":"tea noun\n(DRINK)\nAdd to word list\nAdd to word list\nA1 [ C or U ] (a drink made by pouring hot water onto) dried and cut leaves and sometimes flowers, especially the leaves of the tea plant: China/Indian tea iced/lemon tea a selection of herbal teas The waitress brought us two steaming cups of tea. \"Shall I pour the tea?\" \"No, let it brew (= get stronger) a while.\" How do you like your tea - strong or weak? We sat in the shade of a tree, sipping tea and eating scones. I'm not much of a tea drinker.UK Tea and biscuits will be provided at eleven o'clock.UK informal How about a nice cup of tea? That'll make you feel better.\n[ C ] a cup of tea: Two teas, please.\nclubfoto/E+/GettyImages\nMore examplesFewer examplesThis tea is very hot, so sip it carefully.Caffeine, which is found in coffee and tea, is a mild stimulant.I can't stand weak tea.India grows tea for export.Could I have two cups of coffee and a tea, please?\nSMART Vocabulary: related words and phrases\nWarm drinks\nAmericano\narabica\nAssam\nbabyccino\nbed-tea\ncoffee maker\ncongou\ncrema\ncuppa\nDarjeeling\ninfusion\nIrish coffee\njasmine tea\njoe\nKeepCup\nrobusta\nrooibos\nRosie Lee\nsencha\nstewed\nSee more results »\ntea noun\n(MEAL)\nB1 [ U or C ] mainly UK a small meal eaten in the late afternoon, usually including cake and a cup of tea\n[ U or C ] UK a meal that is eaten in the early evening and is usually cooked\nExamples\nWe had baked beans for tea.Adam invited a few friends round for tea.What time are we having tea?\nSMART Vocabulary: related words and phrases\nMeals & parts of meals\naccompaniment\nafternoon tea\nafters\namuse-bouche\nantipasto\nelevenses\nEnglish breakfast\nfeast\nfeeding\nfinger buffet\nplat du jour\nplate meal\nploughman's lunch\npostprandial\npot luck\ntakeout\ntapas\ntea party\nteatime\ntiffin\nSee more results »\nIdioms\ntea and sympathy\nwould not do something for all the tea in China\nAdd to word list\nAdd to word list\nthe dried and cut leaves of esp. the tea plant, or a drink made by pouring hot water onto these: [ U ] I’d love a nice cup of hot tea. [ C ] We have a variety of herbal teas.\nBr Tea is also a light meal eaten in the late afternoon or early evening."}