{"id":357776,"name":"team","type":"noun","us_sound":"tiːm","us_link":"../audio/t/team.mp3","uk_sound":"tiːm","uk_link":"../audio/t/uktawny030.mp3","content":"Add to word list\nAdd to word list\nA2 a number of people or animals who do something together as a group: a basketball/hockey/netball team a team of investigators Team GB (= the athletes representing Great Britain in a sport)\nused in a number of phrases that refer to people working together as a group in order to achieve something: It was a real team effort - everyone contributed something to the success of the project.\n(also Team) used to refer to a group of people who support a particular person or a particular point of view: In this discussion, we're on Team Marisa.\nMore examplesFewer examplesOur team came third in the competition.She's part of a team of scientists who are engaged on cancer research.They are keen followers of their local football team.Rescue teams searched among the wreckage for survivors.John is captain of the cricket team this year.\nSMART Vocabulary: related words and phrases\nAnimal groupings\nbevy\nbiomass\nbrood\ncolony\ncolony collapse\ncolony collapse disorder\nflight\nflock\ngaggle\nherd\nhive\nmenagerie\nmurder\npack\npair\npod\nschool\nshoal\nskein\nswarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGroups of people\nCompetitors & participants in sports & games\nSupporters, members & defenders\nIdiom\ntake one for the team\nto act together to achieve something: Lang teamed with Draper to develop the vaccine.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntogether\ntow\ntwin\ntwo-way\nunison\nSee more results »\nPhrasal verb\nteam up\nAdd to word list\nAdd to word list\na number of people who act together as a group, either in a sport or in order to achieve something: a baseball/basketball/football team the legal/medical team My favorite team is the New York Giants.\nA team is also two or more horses or other animals working together to pull a load: a team of oxen\nto act together to achieve something: Lang teamed with Draper to develop the vaccine. Williamson and Erving teamed to give the Nets another championship. Phrasal verb\nteam up\nAdd to word list\nAdd to word list\nHR, WORKPLACE a group of people who work together on a particular activity, project, etc.: When I came back from holiday we had a new team in charge.head/lead/manage a team She led a team developing a new marketing initiative. Every member of the team has an important contribution to make. the management/finance/marketing team We need to consult our legal team on this. a team of lawyers/sales people/experts\na number of sports players who play together under a particular name: a football/baseball/basketball team Her ambition was to play for her national team.\nwork as a team\nto work together in order to achieve a shared aim, rather than trying to achieve things just for yourself or working against others: Working as a team will enable us to achieve things we never could alone.\nto get together with another person, group, or organization to do a job: team (up) with sb Some small community hospitals are looking to team up with bigger health care providers.team (up) with sb to do sth The shop is teaming with high-end manufacturers to offer exclusive products to its customers.team up to do sth The two companies have teamed up to provide a new class of multimedia services."}