{"id":357812,"name":"teardown","type":"noun","us_sound":"ˈter.daʊn","us_link":"../audio/t/cdo0318ustear4975.mp3","uk_sound":"ˈteə.daʊn","uk_link":"../audio/t/cdo0318uktear1406.mp3","content":"teardown noun\n(BUILDING)\nAdd to word list\nAdd to word list\n[ C or U ] the act of pulling down a house or other property so that another property can be built in its place: Nearly 100 years old, the home was an ideal teardown candidate, preservationists feared. The site offers news about home and building teardowns before they happen.\n[ C ] a house or property that is bought and then pulled down so that another property or properties can be built in its place: The historic house was being offered for sale as a teardown.\nMore examplesFewer examplesThe developer has a plan to see a historic neighborhood declared blighted, opening the way to federal money and a teardown.Teardown preparations are under way at the two sites, a spokesman said on Monday.The house was the first teardown project on the block, where a new home replaced an older one.The once grand department store may be the ultimate Beverly Hills teardown.He estimated that he had six houses in various stages of completion; two of them were teardowns.\nSMART Vocabulary: related words and phrases\nDestroying and demolishing\nannihilate\nannihilation\napocalypse\nbash\nbash through (something)\nbe sacrificed on the altar of something idiom\nerosionally\nerosive\nextirpate\nextirpation\nfall in\nsack\nsacking\nsacrifice\nscarred\nself-destruct\nself-devouring\nsink\ntear\nwipe\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nHouses & homes\nPublic buildings\nteardown noun\n(INSPECTION)\n[ C or U ] the act of taking something apart so that it is in separate pieces and can be examined: NASCAR officials watched as the car went through a post-race teardown, an intricate inspection.\nMore examplesFewer examplesNASCAR requires the winning team, plus up to five other teams, to go through \"teardown.\" A group of engineers performed a \"teardown analysis\" on the company's video game player.The portfolio of services includes concept design, advanced analysis, product quality improvement, idea generation, and product teardown.\nSMART Vocabulary: related words and phrases\nTearing and breaking into pieces\napart\nasunder\nbobble\nbobbly\nbreak into pieces\ncatch\ncrack\ndismantle\nfall apart\nfall to pieces idiom\nfragment\nfragmentation\nfragmented\nrip\nsnag\nsplinter\nsplit\nsunder\ntear something apart\ntear something up\nSee more results »"}