{"id":357855,"name":"tease","type":"verb","us_sound":"tiːz","us_link":"../audio/t/tease.mp3","uk_sound":"tiːz","uk_link":"../audio/t/ukteams010.mp3","content":"tease verb [I or T]\n(MAKE FUN OF)\nAdd to word list\nAdd to word list\nB2 to laugh at someone or say unkind things about them, either because you are joking or because you want to upset that person: be teased about I used to hate being teased about my red hair when I was at school. I was just teasing - I didn't mean to upset you.\nThesaurus: synonyms, antonyms, and examples\nto tease someoneteaseThe boys teased her mercilessly on the playground.jokeI've lost your passport. Only joking!kidI'm sorry, I forgot to get you a birthday present. Just kidding!pull someone's legIs that really your car or are you pulling my leg?ribHis brothers were ribbing him about his new girlfriend.make fun ofThe other children made fun of him because he wore glasses.\nSee more results »\nMore examplesFewer examplesDon't tease him about his weight - it's cruel.He said he was going to leave us there, but I think he was only teasing.They teased him mercilessly about his accent.\nSMART Vocabulary: related words and phrases\nTeasing\nchaff\njoke\njosh\nkid\nkiddingly\nleg\nonly joking! idiom\npull someone's leg idiom\nrag\nrag on someone\nraillery\nrib\nribbing\nroast\nspoof\nstanding joke\nteaser\nteasingly\nwind\nwind something up\ntease verb [I or T]\n(INTEREST)\nto give a small amount of information about a subject, product, etc. in order to make people interested in seeing or hearing more about it later: The announcement teased a possible European tour the following year. He refused to give specifics but teased that \"people are going to love it.\" Related word\nteaser\nSMART Vocabulary: related words and phrases\nAbsent\nabsence\nabsent\nabsentee\nabsenteeism\nanywhere\nAWOL\nduring someone's absence\ngo AWOL idiom\nin absentia\nin someone's absence\nin the absence of someone/something\nmiss\nmissing\nmissing person\nnegative\nno-show\nnot anywhere to be found idiom\nnowhere\nstation\nunrepresented\nSee more results »\ntease verb [I or T]\n(HAIR)\nUS (UK backcomb) to hold your hair away from your head and brush it towards your head with a comb, in order to make it look thicker\nSMART Vocabulary: related words and phrases\nHairstyles\nAfro\nAfro puff\nbandeau\nBantu knots\nbarnet\nblow-dry\nbowl cut\nchignon\nfade\nhair extension\nhairdo\nkiss curl\nplait\npony\npudding basin\nrelaxed\nshake out\nsidelock\nskinhead\nundercut\nSee more results »\nPhrasal verbs\ntease something apart\ntease something out\nsomeone who is always teasing people: Johnny, don't be such a tease - leave your sister alone!\nslang disapproving someone who enjoys causing sexual excitement and interest in people she or he does not intend to have sex with\nSMART Vocabulary: related words and phrases\nTeasing\nchaff\njoke\njosh\nkid\nkiddingly\nleg\nonly joking! idiom\npull someone's leg idiom\nrag\nrag on someone\nraillery\nrib\nribbing\nroast\nspoof\nstanding joke\nteaser\nteasingly\nwind\nwind something up\nAdd to word list\nAdd to word list\nto intentionally annoy a person or animal by saying something that is not true or pretending to do something, often in a playful way: [ T ] Don’t tease the dog by showing her the treat if you’re not going to give it to her. [ I ] I was only teasing (= joking), I didn’t mean anything by it.\na person who likes to annoy other people by saying false things or pretending to do something"}