{"id":357948,"name":"technically","type":"adverb","us_sound":"ˈtek.nɪ.kəl.i","us_link":"../audio/t/technically.mp3","uk_sound":"ˈtek.nɪ.kəl.i","uk_link":"../audio/t/ukteams023.mp3","content":"Add to word list\nAdd to word list\nC2 according to an exact understanding of rules, facts, etc.: Technically, the country's economic problems are over, but recovery will be slow. young people who are technically still children\nC1 in a way that relates to the knowledge, machines, or methods used in science and industry: technically advanced weapons\nin a way that relates to practical skills and methods that are used in a particular activity: It was a technically brilliant performance.\nMore examplesFewer examplesThe coda is often more technically difficult than the rest of the piece.Tamsin Palmer gave an impressive and technically adept performance on the piano.Technically, a building on this scale is very problematic.Their civilization was technically very advanced.\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntightness\ntruly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSubjects & disciplines\nInventing, designing and innovation\nSkill, talent and ability\nAdd to word list\nAdd to word list\naccording to rules or to the law: Technically, lamprey are fish, though they are seen by many as snakelike monsters.\nAdd to word list\nAdd to word list\naccording to an exact understanding of the rules, facts, etc.: Independent auditors have declared that the country's central bank is now technically bankrupt. Exit penalties - technically known as market value reductions - can mean policyholders lose up to 28% of their current fund value. Technically speaking, your tea breaks are your employer's time rather than yours.technically accurate/illegal/true Although technically illegal, copying of music for personal use is extremely common.\nin a way that relates to the knowledge, machines, or methods used in science and industry: Construction of the digital communications network will be technically challenging.technically advanced/feasible/possible Provided that the correct incentives are in place, it should be technically and economically feasible to stabilize greenhouse gas concentrations."}