{"id":357941,"name":"technical","type":"adjective","us_sound":"ˈtek.nɪ.kəl","us_link":"../audio/t/technical.mp3","uk_sound":"ˈtek.nɪ.kəl","uk_link":"../audio/t/ukteams021.mp3","content":"Add to word list\nAdd to word list\nB2 relating to the knowledge, machines, or methods used in science and industry: a few technical problems\nrelating to the knowledge and methods of a particular subject or job: Personally, I found some parts of the book a little too technical to follow.\nB2 relating to practical skills and methods that are used in a particular activity: In her performance as the Snow Queen she showed great technical brilliance.\nMore examplesFewer examplesThe space shuttle remained earthbound because of a technical fault.The instruction booklet is written in very technical language which is almost impossible to understand.Before she could begin the project she had to work her way through the huge amount of technical papers.There are still a few technical problems to be dealt with before the product can be put on sale to the public.He currently holds the position of technical manager.\nSMART Vocabulary: related words and phrases\nSubjects & disciplines\n-ological\nAfrocentrism\nandragogy\nAP\napplicative\napplied\nfunctional skills\nfuturology\nGermanist\nglaciology\nhard science\nology\nontology\noology\norientalist\nsports scientist\nstem\nsubscience\nsuicidology\ntechnically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInventing, designing and innovation\nEfficient and effective\nAdd to word list\nAdd to word list\ninvolving or needing special skills or knowledge, esp. in science or engineering (= the design and building of machines, equipment, and structures): The computer company ran into some last-minute technical problems with its new disk drives.\nAdd to word list\nAdd to word list\nrelating to science or industry: They have both the best entrepreneurs and the best technical people. a technical company/the technical sector Only 3% of the workforce has gone through technical education.\nrelating to the knowledge used in a particular subject or type of work: The undergraduate programs in Economics and Accounting emphasize technical expertise.\na technical subject, word, etc. is difficult to understand without special knowledge of a subject: The language is too technical for most people to understand. Try to avoid too many technical terms if possible.\nrelating to machines, systems, etc. or to the practical way in which something works: technical problems/errors/glitches He's head of our technical support team. Please consult the technical manual.\nbased on a very exact and detailed way of understanding a law or a rule: It is an overly technical interpretation of the regulations that has caused this problem. The technical definition of a multinational fails to convey the scope and diversity of global business.\ntechnicals\n[ plural ]\n&#160; STOCK MARKET signs relating to the way markets typically behave, rather than those relating to the real profits of companies whose shares are traded, the real economy, etc.: The technicals suggest we should sell. The technicals are very bullish. Compare\nfundamentals\n→\ntech noun"}