{"id":357981,"name":"technology","type":"noun","us_sound":"tekˈnɑː.lə.dʒi","us_link":"../audio/t/technology.mp3","uk_sound":"tekˈnɒl.ə.dʒi","uk_link":"../audio/t/uktechn001.mp3","content":"Add to word list\nAdd to word list\nB1 (the study and knowledge of) the practical, especially industrial, use of scientific discoveries: computer technology Modern technology is amazing, isn't it? What this country needs is a long-term policy for investment in science and technology. See also\nbiotechnology\nMore examplesFewer examplesThere were huge advances in aviation technology during the Second World War.Satellite technology offers the opportunity, as never before, for continuous television coverage of major international events.With computer technology, even people working on their own can produce professional-looking documents.Although the technology originated in the UK, it has been developed in the US.Company profits have doubled since the introduction of new technology.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nAdd to word list\nAdd to word list\nsocial studies the methods for using scientific discoveries for practical purposes, esp. in industry: [ U ] computer/medical/space technology\nsocial studies Technology is also a particular method by which science is used for practical purposes: [ C ] Dairy producers are experimenting with new technologies to reduce the cholesterol in milk. technological adjective us\nYour browser doesn't support HTML5 audio\n/ˌtek·nəˈlɑdʒ·ɪ·kəl/\nWe live in an era of rapid technological change. technologically adverb us\nYour browser doesn't support HTML5 audio\n/ˌtek·nəˈlɑdʒ·ɪ·kli/\nThe new cars will be energy efficient, environmentally friendly and technologically advanced.\nAdd to word list\nAdd to word list\n[ C or U ] the use of scientific knowledge or processes in business, industry, manufacturing, etc.: The fast pace of technology presents enormous implications for sustainable business development. All our products are backed up by cutting-edge technology. computer/wireless/audio technology stem-cell/gene technology a technology company/firm/industry the technology sector/market/boom technology stocks/sharesnew/advanced/existing technologies Basic economic relations are changing as new technologies and markets emerge.developments/advances/changes in technology Changes in technology drive changes in business models.create/develop/upgrade technologies Cleaner technologies are being developed to cut pollution from coal-burning power plants.\n[ C ] new machinery and equipment that has been developed using scientific knowledge or processes: Roll-out of the new technology has been dogged by technical problems and secrecy.use/trial/test technologies Companies always trial their technologies before putting them on the market. Fuel-cell technologies are being used to generate power for telecom and industrial customers. See also\ndisruptive technology\nhigh technology\ninformation technology\nintermediate technology\nniche technology"}