{"id":357927,"name":"tech","type":"adjective","us_sound":"tek","us_link":"../audio/t/usteal_011.mp3","uk_sound":"tek","uk_link":"../audio/t/ukteams019.mp3","content":"Add to word list\nAdd to word list\nshort for\ntechnical : relating to the knowledge, machines, or methods used in science and industry : We offer 24-hour online tech support for your device. Configuration refers to the technical specifications, known as \"tech specs\" of the computers and it includes processor speed, the amount of RAM, etc. He was worried that the tech rehearsal had been too brief - for example, the smoke machine wasn't working correctly.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\n[ U ] short for\ntechnology , used especially to refer to digital technology, and the activities and businesses connected with it : The company produces an annual report on the state of European tech. the tech sector/industry tech entrepreneurs/start-ups/companies/stocks He worked for several years at one of the Silicon Valley tech giants. The recession and the bursting of the tech bubble account for many of the job losses. See also\nbiotech\ncleantech\ndeep tech\nedtech\nfemtech\nfintech\nhigh-tech\nlow-tech\n[ U ] devices that use computer technology: They have all the latest tech. wearable tech such as fitness trackers It's wise to pack all your tech in your carry-on baggage.\n[ C ] mainly US short for\ntechnician : a worker trained in special skills, especially in science or engineering : He ended up as a lab tech in the department, using his chemistry degree from Alabama State College. Most vet techs work in veterinary clinics caring for domestic animals. Many pharmacy techs gain this certification because the added knowledge can give them an advantage when applying for jobs.\n[ C ] short for\ntechnical school : a school or college that specializes in teaching technical or practical subjects: I did my A level exams at the local tech. You could take a plumbing course at the tech.\nSMART Vocabulary: related words and phrases\nInventing, designing and innovation\nabsorptive capacity\narchitect\nartificer\nbionics\nblueprint\ndesign\ndesigner\ndevise\ndream something up\nergonomic\nlead time\nmodularization\nnanotechnology\nnon-imitative\noperational research\nthink outside the box idiom\nthink something up\ntrailblaze\nwhole cloth\nwind tunnel\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nComputer hardware\nCommunications - general words\nExperts and specialists\nTypes of school\nAdd to word list\nAdd to word list\nabbreviation for technical or technological: used to describe a company, system, area of work, etc. that does or makes something involving technology: tech industry/sector/economy There has been a huge expansion of business for our tech companies. There's been a boom in the market for tech stocks. See also\ntechnical\ntechnological\na company that works in the area of technology: They bought shares in two of the world's biggest techs.\n[ usually plural ] shares in companies that work in the area of technology: Stocks went lower but techs remained high."}