{"id":358353,"name":"telegraphing","type":"verb","us_sound":"ˈtel.ə.ɡræf","us_link":"../audio/t/telegraph.mp3","uk_sound":"ˈtel.ɪ.ɡrɑːf","uk_link":"../audio/t/ukteleg004.mp3","content":"Add to word list\nAdd to word list\npresent participle of\ntelegraph\ntelegraph verb [T]\n(SEND BY TELEGRAPH)\nto send a message to someone using the telegraph system: The story was immediately telegraphed to New York. He managed to telegraph the men's wives, who arrived to find their husbands nearly dead.\nMore examplesFewer examplesOne story says Mrs. Faulkner telegraphed Lincoln and he promptly overruled the order. U. S. Senators Charles Culberson and Joseph Weldon Bailey telegraphed Secretary of War William Howard Taft a day after the shootings.The first telegraphed messages were transmitted in 1916 through an underground copper wire.\nSMART Vocabulary: related words and phrases\nCommunications - general words\nanti-satellite\napp\nautodial\nautodialler\nbar\nhack\nmulti-line\nmultimode\nmultipath\nnoise\nnon-computer\nnon-network\nreplay\nsilent\ntrace\nwatch party\nwebchat\nZoom bomb\nZoombomber\nZoombombing\nSee more results »\ntelegraph verb [T]\n(SEND MESSAGE)\nto communicate a message or impression to someone, or make it clear what you are going to do, often by the way you act: The bank has been telegraphing the move to investors for months. Their poses in the pictures telegraph dignity.\nMore examplesFewer examplesWith special operations in dangerous countries, if you telegraph what you're going to do, it might cause a lot of deaths.For months he had telegraphed his inclination to veto the plan. The museum's president telegraphed with his bike tours the idea that the museum was a friendly as well as an erudite place.His eyes downcast and tone sullen, he telegraphed in every way possible that he didn't want to discuss the defeat.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing and demonstrating"}