{"id":358605,"name":"television","type":"noun","us_sound":"ˈtel.ə.vɪʒ.ən","us_link":"../audio/t/television.mp3","uk_sound":"ˈtel.ɪ.vɪʒ.ən","uk_link":"../audio/t/ukteleg028.mp3","content":"Add to word list\nAdd to word list\nA1 a device shaped like a box with a screen that receives electrical signals and changes them into moving images and sound, or the method or business of sending images and sound by electrical signals: a 3D/an HD television Could you turn the television down? It's one of the few television programmes that I still watch. Is there anything good on television tonight? Clare has worked in television since she left college. Your problem is that you watch too much television.\nGeorge Mdivanian/EyeEm/GettyImages\nMore examplesFewer examplesOur new television has a very clear picture.You said we could watch television when we've finished our homework.The news on television tonight was very depressing, as usual.I wish they'd show more dramas and documentaries on television, instead of all these quizzes and reality TV shows.\nSMART Vocabulary: related words and phrases\nBroadcasting: television\naerial\nautotune\nbest boy\nboob tube\nbreakfast television\nbroadcast\ngaffer\nghost image\ngoggle-box\nHD\nHDTV\nplasma screen\nreceiver\nreveal\nshout-out\nsmart TV\nsquare-eyed\nsubtitler\nsweep\nthe small screen phrase\nSee more results »\nAdd to word list\nAdd to word list\na large box with a viewing screen which receives electrical signals and changes them into moving pictures and sound: [ C ] Most homes have televisions.\nTelevision is also the programs that you watch, or the business of broadcasting them: [ U ] Is there anything interesting on television tonight? [ U ] Your problem is that you watch too much television.\nAdd to word list\nAdd to word list\nCOMMUNICATIONS a system of broadcasting images and sound using electrical signals, and the programmes that are shown: on (the) television Consumer programmes on the television have enjoyed a rise in popularity. The ads were first shown on television five years ago.watch television How much television does the average American watch a week? It was broadcast on live television. The company has combined online services with interactive television for the mass market. digital/satellite/terrestrial television national/local/network television television advertising/advertisements/commercials a television network/channel/station television audiences/viewers See also\ncable television\nclosed circuit television\npay-per-view\nprime time"}