{"id":358379,"name":"telemark","type":"noun","us_sound":"ˈtel.ə.mɑːrk","us_link":"../audio/t/cdo1121ustele4187.mp3","uk_sound":"ˈtel.ɪ.mɑːk","uk_link":"../audio/t/cdo1121uktele4114.mp3","content":"Add to word list\nAdd to word list\na style of skiing wearing boots that are only fastened to your skis at the front, so you can lift your heels: Many experienced skiers turn to telemark as a way to explore backcountry areas. the Scandinavian \"Nordic\" style, now known as Telemark Compare\nAlpine skiing\ncross-country skiing\ndownhill skiing\nNordic skiing\nMore examplesFewer examplesTelemark is more difficult than alpine skiing, and requires a lot of strength in the legs.We offer courses in both telemark and alpine skiing.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\npiste\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »\nrelating to a style of skiing wearing boots that are only fastened to your skis at the front, so you can lift your heels: She learned telemark skiing rather than join the snowboarding craze. telemark skis/skiers\nin the sport of ski jumping, relating to a way of landing on the ground in which one foot is in front of the other and the knees are bent: He made a perfect telemark landing. See also\ntelemark turn\nMore examplesFewer examplesWearing ski boots, snow shoes or telemark skis, they went looking for the perfect spots untouched by the others before them. Telemark skiers can be prone to tendonitis because it is hard on the knees.Telemark skiing involves both downhill and cross-country travel.Points are deducted if the competitor fails to land in the telemark position.\nSMART Vocabulary: related words and phrases\nWinter sports\nairboard\nairboarder\nairboarding\nAlpine skiing\naprès-ski\ngroom\nice skater\nice skating\ninbounds\nluge\nmogul\nmush\npiste\nsled\nsnow groomer\nsnowblade\nsnowblading\nsnowboard\nsnowboarder\ntuck\nSee more results »"}