{"id":358655,"name":"teller","type":"noun","us_sound":"ˈtel.ɚ","us_link":"../audio/t/teller.mp3","uk_sound":"ˈtel.ər","uk_link":"../audio/t/uktelex003.mp3","content":"teller noun [C]\n(IN BANK)\nAdd to word list\nAdd to word list\nUS and Australian English a person employed in a bank to receive and pay out money: A man was detained when a bank teller called the police. See also\nautomated teller machine\nMore examplesFewer examplesThe prosecution called four witnesses including the manager and teller of the bank.Cashier's checks, teller's checks, and money orders should be made payable to the facility where you are making the payment.He served there for 17 years, first as a teller and ultimately as chief underwriter for the bank's California residential lending division.Early on, people were afraid to use the ATM; they wanted to go in and talk to a teller.\nSMART Vocabulary: related words and phrases\nBanks\nanti-city\napex\nbancassurance\nbank\nbank manager\nbank statement\nbuilding society\ncash drawer\nchallenger bank\nclearing bank\ndebit\nelectronic banking\ngiro\ninvestment bank\npay\nsafe deposit box\nstatement\nstress test\nsuperbank\nthe Square Mile\nSee more results »\nteller noun [C]\n(AT ELECTION)\na person who counts votes at an election or other vote, for example in a parliament: The picture shows tellers counting ballot papers at a voting station in Conakry on June 27, 2010.\nMore examplesFewer examplesOne system relied on election tellers comparing signatures manually. They took five hours to check 200 ballots.Tellers are appointed to verify the count when there is a division in the Commons or the Lords and to report the result back to the House.The election count in the London constituency of Kensington was suspended on Friday morning after council tellers were sent home exhausted following two recounts.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nteller noun [C]\n(OF STORY)\na person who tells a story, a joke, etc. : Bill was a great teller of jokes and teller of stories. He had great timing. See also\nstoryteller\nfortune teller\nMore examplesFewer examplesJean-Paul Sartre tells us that a man is always a teller of stories, he lives surrounded by his own stories and those of other people.She was an optimist, a teller of amusing and amazing stories.While the memory itself would not last the day, he would be sure to repeat it to others and that memory would not fade, for either the teller or listener.He is a known teller of untruths... it's been proven time and time throughout his political career.\nSMART Vocabulary: related words and phrases\nDescribing & telling stories\ndream sequence\nframing\ngriot\nnarrate\nnarrative\nnarratively\nnarrator\nomniscient narrator\npaint\npaint a picture (of something) idiom\npersonalize\npersonification\npersonify\nrecitation\nrecount\nrelate\nreport\nretell\nspin\nworld-building\nSee more results »\nAdd to word list\nAdd to word list\na person in a bank who receives and pays out money to customers\nAdd to word list\nAdd to word list\nBANKING →\nbank teller See also\nautomated teller machine"}