{"id":358650,"name":"tell","type":"verb","us_sound":"tel","us_link":"../audio/t/tell.mp3","uk_sound":"tel","uk_link":"../audio/t/uktelex002.mp3","content":"tell verb\n(SPEAK)\nAdd to word list\nAdd to word list\nA1 [ T ] to say something to someone, often giving them information or instructions: Tell me about your holiday then. [ + two objects ] Can you tell me how to get to the library? [ + obj + (that) ] Did you tell anyone (that) you were coming to see me? [ + obj + speech ] \"I'm leaving you,\" she told him. [ + obj + to infinitive ] I told her to go home.formal He told us of his extraordinary childhood. I can't tell you how grateful I am for your help (= I am extremely grateful).\nThesaurus: synonyms, antonyms, and examples\nto tell someone somethingtellMy friend told me you were looking for me.let someone knowLet me know if you'd like to come.giveCan you give the message to Jo?communicateA 60-second TV commercial isn't always the best way to communicate a complex medical message.informThe relatives of the injured have been informed of the accident.notifyThe school has to notify parents if their children do not arrive at school.\nSee more results »\ntell a lie/lies\nto say something/things that are not true: She's always telling lies.\nThesaurus: synonyms, antonyms, and examples\nto say something not true in order to deceivelieAll she does is lie - you can't believe a word she says.tell a lieI cannot tell a lie: I chopped down the cherry tree.lie through your teethHe lied through his teeth that he didn't go to the cinema, though he was still holding the ticket stub in his hand as he said it.fibI don't like fibbing, but I didn't want to hurt his feelings by saying his gift was awful.misleadI'm afraid you've been misled. She is, in fact, married.deludeHe's deluding himself if he thinks that he's getting that promotion.\nSee more results »\ntell it like it is informal\nto tell the facts without hiding anything tell tales disapproving\nIf someone, usually a child, tells tales, they tell someone such as a teacher about something bad that someone else has done: Your classmates won't trust you if you're always telling tales, Alvin. See also\ntelltale tell the truth\nto speak honestly: How do you know she's telling the truth? to tell (you) the truth\nto be honest: To tell (you) the truth, I didn't understand a word of what he was saying.\nMore examplesFewer examplesThey wouldn't tell me how they had got my address.I felt it was my duty to tell them the truth.Gather (a)round, children, and I'll tell you a story.The doctor told me to avoid fatty foods.No-one told me she was ill.\nSMART Vocabulary: related words and phrases\nAnnouncing, informing & stating\nacquaint someone/yourself with something\nannunciation\napprise someone of something\navowedly\nawaken someone to something\nbreak\nbreathe/say a word idiom\ndisseminate\nimpart\non the record idiom\npass\nproclaim\npropagate\nput something before someone\nput something out\nput something out of its misery idiom\nrapporteur\nreportable\nreported\nstatement\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLies, lying & hypocrisy\nBlunt and direct in speech & behaviour\nRevealing secrets & becoming known\nHonesty, openness & sincerity\ntell verb\n(KNOW)\nB2 [ I or T ] to know, recognize, or be certain: \"He's Dutch.\" \"How can you tell?\" [ + (that) ] I could tell (that) you were unhappy.\nB2 [ T ] If something tells you something, it gives you information: What does the survey tell us about the lives of teenagers? tell the difference\nC1 to notice a difference in quality between two things: This coffee is about half the price of that one and yet you really can't tell the difference. tell someone's fortune (also tell fortunes)\nto say what will happen in someone's future: At the fair, there was a lady who told your fortune. tell the time UK (US tell time)\nto be able to understand a clock: My daughter has just learned to tell the time. there is no telling\nthere is no way of knowing: There is no telling what the future will hold for them. you never can tell B2 (also you can never tell)\nsaid to mean that you can never know or be certain: Who knows what will happen to Peter and me in the future - you can never tell.\nMore examplesFewer examplesI could tell from her expression that something serious had happened.You can tell it's autumn because the leaves have started to fall.Who can tell what the future holds?Can you tell the the difference between poisonous mushrooms and edible varieties?I could tell he was really upset, though he tried not to show it.\nSMART Vocabulary: related words and phrases\nLearning & knowing\nabsorptive capacity\nacquirable\nacquire\nacquisition\nassimilate\nbone\nfamiliar\nhit the books idiom\nminor\nmislearn\nmug (something) up\nnon-academic\nnon-library\nrecognition\nshadow\nsubspecialty\nswot up (something)\nteachable\nthose\nuncultivated\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnnouncing, informing & stating\nIdentifying\nPredicting things and intuition\nWatches & clocks\nUncertainty\ntell verb\n(HAVE AN EFFECT)\n[ I ] to have an effect: She's been under a lot of stress recently and it's starting to tell.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nGrammar\nSay or tell?Say and tell are irregular verbs. The past simple of say is said, the past simple of tell is told: …\nSay and tell with objectsBoth say and tell take a direct object. The object is most commonly the reported clause (the report of what someone said). …\nTell + indirect object + to-infinitiveWe use tell with an indirect object and a to-infinitive to report a command or an instruction. We don’t normally use say in this way: …\nIdioms\nI'm telling you\n(I) told you (so)!\n(I'll) tell you what\ntell me about it!\ntell me another one!\nyou're telling me!Phrasal verbs\ntell against someone/something\ntell something/someone apart\ntell someone off\ntell on someone\n(in the game of poker) something that a player does without thinking about it that may give the other players information about what he or she intends to do, etc. : If you are good at reading poker tells, you can usefully store them in your memory for future use.\nsomething that someone does without thinking that shows what they are really thinking, especially if they are trying to deceive you: My boss, like so many company leaders, has a tell when he is about to announce bad news — he smiles weakly.\nMore examplesFewer examplesI don't think he was a good enough player to pick up on the fact that I had noticed his tell.She was eventually alerted to her tell and then she had to try to stop herself doing it.He soon realized that his tell had been spotted.Her tell was that she looked away when she was about to say something disappointing.\nSMART Vocabulary: related words and phrases\nCard games\nall in\nbidding\nblackjack\nbridge\nbusted flush\ncanasta\ncard sharp\ndeal\ndiamond\nhonour\npool\nqueen\nre-raise\nrebid\nrecut\nrookie card\nsolitaire\nspade\nstick\nstraight\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLies, lying & hypocrisy\ntell verb\n(SAY)\nAdd to word list\nAdd to word list\n[ I/T ] to say something to someone, esp. to give instructions or information; report: [ T ] Can you tell me how to get to the bus station? [ I ] She told about her travels overseas.\ntell verb\n(SHOW)\n[ T ] to show or give information in ways other than talking: This light tells you when the battery is low.\ntell verb\n(ORDER)\n[ T ] to order someone to do something: I told you to be home by eleven.\ntell verb\n(KNOW)\n[ I/T ] to know or recognize: [ I ] It’s hard to tell which is better. [ T ] It’s easy to tell a robin by its red breast. [ + (that) clause ] I could tell that you were unhappy. [ T ] This one is supposed to be better, but how can you tell the difference? Idioms\nI’m telling you\ntell it like it is\ntell me about it\ntell (someone) the truth\n(I) tell you what\ntell time\nto tell (you) the truthPhrasal verbs\ntell someone/something apart\ntell off someone\ntell on someone"}