{"id":358888,"name":"temporary","type":"adjective","us_sound":"ˈtem.pə.rer.i","us_link":"../audio/t/temporary.mp3","uk_sound":"ˈtem.pər.ər.i","uk_link":"../audio/t/uktelex027.mp3","content":"Add to word list\nAdd to word list\nB1 not lasting or needed for very long: The ceasefire will only provide a temporary solution to the crisis. temporary staff Compare\npermanent adjective\nThesaurus: synonyms, antonyms, and examples\ntemporarytemporaryThis is just a temporary solution.disposableI bought a disposable camera at the airport.makeshiftWe built a makeshift shelter under the trees.short-livedI had a few relationships at university, most of which were fairly short-lived.provisionalAfter the war, a provisional government was set up.\nSee more results »\nMore examplesFewer examplesThe salaries of temporary employees ought to be brought into line with those of permanent staff.Don't worry, his depression is only temporary - it'll soon pass.She has managed to obtain a temporary residence permit.The injection provided a temporary reprieve from the pain.I rigged up a temporary radio aerial from a coat hanger.\nSMART Vocabulary: related words and phrases\nTemporary\nbe a nine days' wonder idiom\ncasual\ncasually\neddy\nephemeral\nfugacious\nfugitive\nhere\nhere today, gone tomorrow idiom\nimpermanence\nnon-established\nplaceholder\npro tem\nprovisional\nprovisionary\nsticking plaster\ntransient\ntransiently\ntransitorily\ntransitory\nSee more results »\nRelated word\ntemporarily\nAdd to word list\nAdd to word list\nnot lasting or permanent: a temporary condition a temporary contract temporarily adverb [ not gradable ] us\nYour browser doesn't support HTML5 audio\n/ˌtem·pəˈrer·ə·li/\nThe player was temporarily suspended from the tournament.\nAdd to word list\nAdd to word list\nnot lasting or needed for a long time: Renting space in another office building is only a temporary measure.\na temporary job or contract lasts only for a short period of time: According to the report, over 6% of the labour force are working on a temporary basis. temporary jobs/contracts/work\na temporary worker is employed only for a short period of time: The temporary team will be looking to resolve conflicts among relevant executives. temporary workers/staff Compare\npermanent"}