{"id":358795,"name":"temp","type":"noun","us_sound":"temp","us_link":"../audio/t/temp.mp3","uk_sound":"temp","uk_link":"../audio/t/uktelex009.mp3","content":"Add to word list\nAdd to word list\na person employed to work for a short period, especially in an office while another person is absent or when there is extra work: I worked as a temp for a while before I got my first permanent job. Many companies are relying more on temps and part-timers.\nMore examplesFewer examplesI could do nothing except carry out the work myself or employ a temp.Forty-seven temps were hired in late September.Some nurses like working as temps because they are often paid more and can refuse night and weekend work.\nSMART Vocabulary: related words and phrases\nWorkers in general\na man/woman of action idiom\nanti-labour\nbeaver\ncontract worker\ncutter\ndrudge\nlabour force\nlabour market\nmachinist\nmanpower\nrelay\nrouseabout\nsalaryman\nskeleton staff\nslogger\nthe shop floor\nworkforce\nworkhorse\nworking group\nworking party\nSee more results »\ninformal to work as a temp: I decided to temp for a while so that I could try different kinds of jobs. The company she was temping for offered her a permanent job.\nMore examplesFewer examplesI've been temping since I left college.I decided to temp for a while until I found a role that really appealed to me.When I returned from travelling, I temped, which honed my office skills.\nSMART Vocabulary: related words and phrases\nWork, working and the workplace\nact as something\nall work and no play (makes Jack a dull boy) idiom\nassignment\nbandh\nbe at work idiom\ngrind\nhoop\nhot-desking\nhotelling\nhousekeeping\nin the line of duty idiom\ninduction\nindustry\nlabour\nskivvy\nslave\nslog\nslouch\nspadework\nsweat\nSee more results »\nAdd to word list\nAdd to word list\na person employed to work temporarily for a business temp verb [ I ] us\nYour browser doesn't support HTML5 audio\n/temp/\ninfml I temped for a long time.\nAdd to word list\nAdd to word list\nsomeone who is employed to work for a company or organization for a short time, for example, when a permanent employee is away, or when there is a lot of work: During busy times, the firm can hire more than 3,000 temps. She started work as a temp in the London branch of an investment bank in 2009.\nto work temporarily for a company or organization: I've just started temping as a secretary for a local company. How long were you temping before you got a permanent job?"}