{"id":358800,"name":"temper","type":"noun","us_sound":"ˈtem.pɚ","us_link":"../audio/t/temper.mp3","uk_sound":"ˈtem.pər","uk_link":"../audio/t/uktelex010.mp3","content":"Add to word list\nAdd to word list\nB2 [ C often singular ] the tendency to become angry very quickly: have a temper She has a real temper. He's got a really bad temper.\nThesaurus: synonyms, antonyms, and examples\nangerangerHe vented his anger by kicking the door.annoyanceSmoke can cause annoyance by making clothes and hair smell unpleasant.irritationShe expressed irritation with her son's attitude.frustrationA lot of children's behaviour problems are caused by sheer frustration.furyThe speech provoked fury in some parts of the world.rageHe was filled with jealous rage when he saw his girlfriend talking to another man.\nSee more results »\nlose your temper\nB2 to suddenly become angry: The children behaved so badly that I lost my temper.\nSee more keep your temper\nC2 to succeed in staying calm and not becoming angry: I found it hard to keep my temper with so many things going wrong.\nSee more be in a bad, foul, etc. temper\nmainly UK to be feeling angry: I'd stay away from her if I were you - she's in a foul temper.\nSee more\n[ S or U ] formal or literary mood or emotional state: He appears to be a man of calm and even temper.\nMore examplesFewer examplesYou're going to have to learn to control your temper.Her temper hasn't improved with age!His detractors claim that his fierce temper makes him unsuitable for party leadership.She has an explosive temper.In a fit of temper he hurled the book across the room.\nSMART Vocabulary: related words and phrases\nBecoming angry and expressing anger\n(almost) burst a blood vessel idiom\nape\nballistic\nbananas\nbay for blood idiom\nblow\nchip\nfulminating\nfume\nget bent out of shape idiom\nget your knickers in a twist idiom\ngive someone evils idiom\nroof\nsharp\nsplenetic\nsplenetically\nstew\nstrop\ntempered\nthrow\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMoods\nIdiom\ntempers get frayed\ntemper verb [T]\n(REDUCE)\nformal to make something less strong, extreme, etc.: My enthusiasm for the venture was tempered by my knowledge of the hard work that would be involved. I learned to temper my criticism.\nSMART Vocabulary: related words and phrases\nBecoming and making less strong\nabate\nabatement\nadulterate\nadulterated\nadulteration\ndecline\nenervate\nenervating\nenervatingly\nenfeeble\nenfeebled\nfade\nmelt\nrelieve\nsink\nundimmed\nunsubdued\nwane\nwaste away\nwater something down\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBecoming and making smaller or less\ntemper verb [T]\n(METAL/GLASS)\nto heat and then cool a metal in order to make it hard: tempered steel\nto change the physical nature of a substance, using heat or a chemical process: Toughened or tempered glass used in car windscreens is usually made by cooling molten glass very rapidly to make it much harder.\nSMART Vocabulary: related words and phrases\nHard and firm\n(as) stiff/straight as a ramrod idiom\nadamantine\ncast iron\ncongealed\ncrisp\ncrisply\ndilatancy\ndilatant\nerect\nfirm\nfirmness\nfossilized\npetrified\nramrod\nrigid\nrigidity\nrock-hard\nsolidly\ntense\nunyielding\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCookery terms\nPhysical & chemical processes\ntemper verb [T]\n(FOOD)\nfood &amp; drink\n&#160; specialized to heat spices, usually in hot oil, in order to release their flavour: She tempered the spices in a separate pan and added them to the dhal at the end.\nfood &amp; drink\n&#160; specialized to heat and then cool chocolate in order to give it a smooth texture and shiny appearance: When chocolate is tempered, it is subject to temperatures and techniques that alter its chemistry.\nSMART Vocabulary: related words and phrases\nPreparing food using heat\nair fryer\nbain-marie\nbaking\nbaking parchment\nbarbecue\nblanch\nboil\ncooking\ndeep fat fryer\ndeep-fried\ndeep-fry\ndone\noverdone\npan-fry\nparboil\npoach\npoaching\nsear\nwarm (someone/something) up\nwood-fired\nSee more results »\ntemper noun [C/U]\n(STATE)\nAdd to word list\nAdd to word list\nthe state of your mind or feelings: [ C ] John has a bad temper.\nTemper is also strong emotion, esp. anger: [ U ] a fit of temper [ C ] You need to learn to control your temper.\nA temper tantrum is a sudden show of great anger.\ntemper verb [T]\n(LESSEN)\nto lessen the force or effect of something: Perhaps you should temper your language."}