{"id":359064,"name":"tenderness","type":"noun","us_sound":"ˈten.dɚ.nəs","us_link":"../audio/t/tenderness.mp3","uk_sound":"ˈten.də.nəs","uk_link":"../audio/t/uktempt021.mp3","content":"tenderness noun [U]\n(GENTLE)\nAdd to word list\nAdd to word list\nC2 the quality of being gentle, loving, or kind: She treated the children with great tenderness. Synonyms\naffection\nfondness\nwarmth (FEELING)\nMore examplesFewer examplesShe said the tenderness and care of the staff helped her immeasurably.The surroundings help bring out the tenderness in the youths, who talk readily about how much it means to have a teddy bear.There is tenderness as he holds his wife and whispers to her.The only time she shows love and tenderness is with her young daughter.\nSMART Vocabulary: related words and phrases\nTender & gentle\ncaressing\ncaressingly\nfly\ngentle\ngentleness\ngently\nmeekly\nmeekness\nmild\nmild-mannered\nmildness\nnon-critical\nsoft\nsoftness\nsofty\ntender\ntender-hearted\ntenderly\nTLC\nSee more results »\ntenderness noun [U]\n(PAIN)\na feeling of pain or soreness when touched: The disease causes pain and tenderness in the muscles.\nMore examplesFewer examplesAbout 25 percent of patients complain of muscle pain and tenderness. Antibiotics should be limited to patients whose symptoms of facial tenderness or pain aren't getting better after seven days.A physical exam is also performed, during which the doc will check your testicles for signs of tenderness or swelling.HRT may cause side effects such as bloating, migraines, or breast tenderness in some women.\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsore\nsting\nstitch\nthrob\ntingle\nSee more results »\ntenderness noun [U]\n(OF FOOD)\n(of meat or vegetables) the quality of being easy to cut or chew (= crush with the teeth): For the best flavour and tenderness you should use a slow cooker.\nMore examplesFewer examplesOur steaks are aged a minimum of four weeks for flavour and tenderness. Marinades add tenderness and flavour to meats and poultry. Tenderloins and rib cuts are favoured for their tenderness. Peas, extolled by advertisers for their tenderness, in fact contain more than four times the fibre of celery, weight for weight.\nSMART Vocabulary: related words and phrases\nPleasant to eat or drink\nambrosia\nambrosial\nappetizing\nappetizingly\ncooked/done to a turn idiom\njuicy\nlekker\nlip-smacking\nluscious\nlusciously\nquaffable\nscrumptious\nscrumptiously\nslap-up\nsmoothness\nultra-smooth\nuncloying\nwarming\nyummy\nzestily\nSee more results »\ntenderness noun [U]\n(OF PLANT)\n(of a plant) the quality of being easily damaged by cold weather: Its tenderness means that it can't be grown as a garden plant in the UK.\nMore examplesFewer examplesThere were variations in tenderness among the four plants tested.\nSMART Vocabulary: related words and phrases\nTypes of plant\nacanthus\nair plant\namaranth\nAndromeda\nangiosperm\nearly\nemergent\nevergreen\nfiddlehead\ngrower\nmoss\nmossy\nmugwort\nmustard\nnon-hardy\nspiderwort\nspleenwort\nstarter plug\nsucculent\nsundew\nSee more results »\nSee\ntender"}