{"id":359027,"name":"tender","type":"adjective","us_sound":"ˈten.dɚ","us_link":"../audio/t/tender.mp3","uk_sound":"ˈten.dər","uk_link":"../audio/t/uktempt017.mp3","content":"tender adjective\n(GENTLE)\nAdd to word list\nAdd to word list\nC2 gentle, loving, or kind: a tender look/smile What you need is some tender loving care.\nThesaurus: synonyms, antonyms, and examples\nshowing love and affectionaffectionateShe was an affectionate child.lovingHe grew up in a loving family.caringYou're a very caring person.warmHe had a warm smile.\nSee more results »\nSMART Vocabulary: related words and phrases\nTender & gentle\ncaressing\ncaressingly\nfly\ngentle\ngentleness\ngently\nmeekly\nmeekness\nmild\nmild-mannered\nmildly\nmildness\nnon-critical\nsoft\nsoftness\nsofty\ntender-hearted\ntenderly\ntenderness\nSee more results »\ntender adjective\n(PAINFUL)\n(of part of the body) painful, sore, or uncomfortable when touched: My arm was very tender after the injection.\nThesaurus: synonyms, antonyms, and examples\npainfulpainfulHer ankle was still painful if she put weight on it.soreMy feet are sore from walking around all day.tenderThe glands in my neck feel really tender.sensitiveMy face was bright red and sensitive to the touch.excruciatingHis injury caused excruciating headaches.\nSee more results »\nSMART Vocabulary: related words and phrases\nPain & painful\n-racked\naches and pains\nachy\nagonizing\nanalgesia\nbe murder on something idiom\nbrain freeze\ncluster headache\ndull\nexcruciating\ngrief\nneuralgia\npain reliever\npainlessly\npang\nprick\nrawness\nsting\nstitch\nthrob\nSee more results »\ntender adjective\n(SOFT)\nC2 (of meat or vegetables) easy to cut or chew (= crush with the teeth): My steak was beautifully tender.\nTender plants are easily damaged by cold weather.\nThesaurus: synonyms, antonyms, and examples\nbreaking easilyweakIf trees do not get enough water they become weak.strongSteel is a very strong material.flimsyThere was only a flimsy inflatable raft between him and the raging riverricketyWe climbed up the rickety wooden stairs.fragileSome objects are too fragile to be moved between the museums.delicateShe carefully wrapped up the delicate glass ornaments.\nSee more results »\nSMART Vocabulary: related words and phrases\nPleasant to eat or drink\nambrosia\nambrosial\nappetizing\nappetizingly\ncooked/done to a turn idiom\njuicy\nlekker\nlip-smacking\nluscious\nlusciously\nquaffable\nscrumptious\nscrumptiously\nslap-up\nsmoothness\ntoothsome\nultra-smooth\nuncloying\nwarming\nyummy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTypes of plant\ntender adjective\n(YOUNG)\nC2 literary young: He was sent off to boarding school at the tender age of seven.\nSMART Vocabulary: related words and phrases\nDescribing people who are young\nadolescent\nadolescently\nat your mother's knee idiom\nbe knee-high to a grasshopper idiom\nflower\nfresh-faced\njuvenile\njuvenility\nknee-high\nmother\npre-puberty\npubescent\nteenage\ntweenager\nunderage\nya\nyoof\nyoung\nyouthfulness\nyute\nSee more results »\nRelated words\ntenderly\ntenderness\n[ I ] If you tender for a job, you make a formal offer to do it for a stated price: Five companies have tendered for the hospital contract.\n[ I ]\n&#160; finance &amp; economics\n&#160; specialized If you tender for something such as shares, you make a formal offer to buy them for a stated price.\n[ T ] formal to give or offer something: Please tender the exact fare. The health minister has tendered her resignation (= has offered to leave her job).\nSMART Vocabulary: related words and phrases\nApplying for a job\nacqui-hire\nadvertisement\nanoint\nanointed\napplicant\nassign\nelect\nemploy\nemployable\nemployment\nemployment agency\nequality, diversity and inclusion\nnomination\nreferee\nreinstate\nreinstatement\nrelocation expenses\nresume\nretain\ntestimonial\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCompeting and contending (non-sporting)\nGiving, providing and supplying\ntender noun [C]\n(OFFER)\nmainly UK (US usually bid) a written or formal offer to supply goods or do a job for an agreed price: The council has invited tenders for the building contract.\nfinance &amp; economics\n&#160; specialized, mainly UK (US usually bid) a written offer to buy or sell shares in a company put something out to tender UK\nIf you put work out to tender, you ask people to make offers to do it: Education departments in all the prisons are being put out to tender.\nSMART Vocabulary: related words and phrases\nBusiness - general words\naddressable\naddressable market\nAge of Exploration\namortizable\nanti-commercial\ncontract something out\ncontractual\ncontractually\ncoopetition\ncop\ninitial public offering\nIPO\nlean\nleanly\nlock something in\ntrade secret\ntransact\nuberization\nultra-commercial\nunbranded\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStock markets\nBuying & selling - general words\nMaking appeals & requests\nGiving, providing and supplying\ntender noun [C]\n(CONTAINER)\nengineering\n&#160; specialized a vehicle used for transporting water, wood, or coal, especially one that is pulled behind a railway engine or used by the fire service\nSMART Vocabulary: related words and phrases\nFire service\nbeat something out\nextinguisher\nfire alarm\nfire blanket\nfire department\nfire engine\nfire extinguisher\nfire hydrant\nfire marshal\nfirebreak\nfirefighter\nfirehouse\nfireplug\nfiretrail\nfiretrap\nflameproof\nhose\nJaws of Life\nquench\nsmoke detector\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTrucks, vans & caravans\ntender noun [C]\n(BOAT)\nsailing\n&#160; specialized a small boat that is used for transporting people or goods from the land to a larger boat or from the larger boat to the land: The SS Nomadic was a tender to the ill-fated liner, Titanic.\nSMART Vocabulary: related words and phrases\nBoats & sailing craft\namphibious\nbuoy\ncabin cruiser\ncanoe\ncoracle\ncutter\ndhow\ndragon boat\ndredger\ndugout\nflatboat\ninflatable\nkayak\nketch\npunt\nrubber dinghy\nsloop\ntall ship\nwater taxi\nyacht\nSee more results »\ntender noun [C]\n(CHICKEN)\nUS a small piece of chicken breast meat, usually breaded and fried, or a cut of chicken from the tenderloin: chicken tenders\nSMART Vocabulary: related words and phrases\nCuts of meat\nbaby back ribs\nbaron of beef\nbavette\nboneless\nbottom round\nfilet\nfillet\nfillet steak\nflank steak\nflanken\nrasher\nrib roast\nrib-eye steak\nriblet\nround steak\nT-bone steak\ntenderloin\ntomahawk\ntop round\ntournedos\nSee more results »\ntender adjective\n(GENTLE)\nAdd to word list\nAdd to word list\ngentle, caring, or sympathetic: He gave her a tender kiss.\ntender adjective\n(PAINFUL)\neasily hurt; painful: My arm was very tender after the injection.\ntender adjective\n(SOFT)\n(of food) easily cut or chewed: My steak was juicy and tender.\ntender adjective\n(YOUNG)\n[ not gradable ] young and not experienced: At the tender age of 17, he joined the army.\ntender verb [T]\n(OFFER)\nto offer something, usually in writing, or to make an offer in writing to do something: The Secretary wants to leave but has not yet tendered his resignation. This is the richest contract ever tendered to a baseball player.\ntender noun [C]\n(OFFER)\na formal offer, esp. to buy something\nAdd to word list\nAdd to word list\n[ C ]\n&#160; COMMERCE a written or formal offer to supply goods or do a job for an agreed price: receive a tender Competitive tenders must be received by 1 p.m.invite tenders (to do/for sth) Morocco is inviting tenders to build two wind farms.submit a tender (to do/for sth) The company said it will submit tenders to develop three oil fields in the area.\n[ C or U ]\n&#160; COMMERCE a method of choosing the best company to supply goods or do a job by asking several companies to make offers for the work: win a tender (for/to do sth) The company won a tender to start an analogue cellular network.put sth out to tender The drilling rights have been put out to tender.\n[ C ]\n&#160; FINANCE, STOCK MARKET\n&#160; (also tender offer) an occasion when a company sells new shares to those who make offers for them above a particular lowest price. The company calculates the strike price (= final price to be paid) in relation to the total demand and the prices offered: All tenders above the strike price will be accepted. Shares in the insurance group will be sold through tenders. They made a cash tender of $15.50 per share. The share tender was over-subscribed. If you buy shares in the retail tender offer, they will be free of transfer charges for up to 42 days after allocation.\nSee also\nlegal tender\nsealed-bid tender\nself-tender\n[ I or T ]\n&#160; COMMERCE to make a formal offer to supply goods or do a job for an agreed price: It will be better still if competitors in poor countries can tender successfully.tender to do sth The company is tendering to clean the Millennium Dome.tender for sth Next month companies will be invited to tender for a new international telecommunications system.\n[ I or T ]\n&#160; FINANCE, STOCK MARKET to make a formal offer to buy or sell shares at a stated price: Unit holders are under no obligation to tender their shares. About 7 million of their shares had been tendered under the offer.tender sth to sb/sth The company tendered its shares to BP for 500p cash.tender into sth They gave security holders an additional opportunity to tender into the offer.\n[ T ] formal to give or offer something: You will have no option but to tender your resignation. He tendered a delivery note for signature. She tendered a plea of no contest.tender sth as sth A check was tendered as payment."}