{"id":359272,"name":"tenseness","type":"noun","us_sound":"ˈtens.nəs","us_link":"../audio/t/ustenab011.mp3","uk_sound":"ˈtens.nəs","uk_link":"../audio/t/uktense004.mp3","content":"tenseness noun [U]\n(WORRY)\nAdd to word list\nAdd to word list\nthe quality of being worried or nervous: There was an underlying tenseness in his manner.\nthe quality of making people feel worried or nervous: the tenseness of life during the war\nMore examplesFewer examplesA tenseness gripped Lisbon as people waited to see what would happen. He feels tenseness and may think that it is difficult to cure this so-called 'simple' problem.There was a fair degree joking in order to take the tenseness out of the situation. A massage takes the tenseness of the day away.\nSMART Vocabulary: related words and phrases\nAnxiety and worry - general words\nagita\nagitation\nalarm\nangst\nanti-stress\nanxiety\napprehension\njitters\nnervousness\noppression\noverwork\npanic attack\nstrain\nthe collywobbles\nthe heebie-jeebies\ntizzy\ntrepidation\nuneasiness\nvexation\nyip\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCausing anxiety and worry\ntenseness noun [U]\n(STRETCHED MUSCLES)\na state in which the muscles in your body or in a part of your body are stretched tight and stiff: Nina could see by the tenseness of his neck that he was worried.\nMore examplesFewer examplesHe could feel the tenseness of her fingers, as if she was clutching at crystal straws.She could tell from the tenseness in his body that there were moments when he had to fight his feelings. Permanent tenseness had withered her neck slightly.Suddenly she released all the tenseness from her muscles and he relaxed his hold slightly.I was conscious of an aching tenseness in all my muscles.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntight\ntight-fitting\ntighten\ntighten something up\ntightly\ntightness\nSee more results »\ntenseness noun [U]\n(PHONETICS)\nphonetics\n&#160; specialized the quality of being made with more force than other speech sounds: errors of tenseness and phonetic length See\ntense\nMore examplesFewer examplesKloeke actually argues that the term 'final consonant devoicing' is inaccurate because the feature in question is tenseness, rather than voice. It is not implausible to think that children may begin by commanding one feature before the other, that is, tenseness before length, length before tenseness. In the phonetic transcription, we code separately errors of tenseness and phonetic length.\nSMART Vocabulary: related words and phrases\nLinguistics: phonology & phonetics\naccommodation\nalliterative\nalveolar\napheresis\naphesis\nassonance\ndiphthong\nhomonym\nintrusive\nlabial\nlabialize\nlabiodental\nplosive\npostalveolar\npostconsonantal\nretroflex\nrhotic\nthe International Phonetic Alphabet\nunpronounceable\nunrepeatable\nSee more results »"}