{"id":359310,"name":"tent","type":"noun","us_sound":"tent","us_link":"../audio/t/tent.mp3","uk_sound":"tent","uk_link":"../audio/t/uktense007.mp3","content":"Add to word list\nAdd to word list\nB1 a shelter made of canvas or a similar material and supported by poles and ropes, that you can fold up and carry with you\nAndy Crawford/Dorling Kindersley/GettyImages\nExamples\nHow does it feel to be back in civilization after all those weeks in a tent?Rain had dampened the tent so we left it to dry in the afternoon sun.Outside the tent I could hear the constant drone of insects.We thought we'd insure against rain by putting a tent up where people could take shelter.We pitched our tent in the shade.\nSMART Vocabulary: related words and phrases\nCamping\nbackpack\nbivvy\nbivvy sack\nboondocking\ncamp stove\ncamper\ncamping ground\ncamping site\ncaravan site\nflysheet\ngroundcloth\ngroundsheet\nlatrine\nlean-to\npop-up tent\nPrimus stove\npup tent\nridge pole\nridge tent\nsleeping bag\nSee more results »\nto make something form a shape that is raised in the middle, like a tent: Cover the pan with aluminium foil that you have tented to allow for steam. He tented his fingers and rested his chin on them.\nto cover something with a tent or similar structure: Crews were hurriedly tenting the red carpet. The house has been tented and sprayed with insecticide. After the concert, guests went into the garden which had been completely tented over for supper.\nSMART Vocabulary: related words and phrases\nPatterns and shapes\namorphous\narabesque\nargyle\nasymmetrically\nasymmetry\nfigure of eight\nfishbone\nfishhook\nflecked\nformless\npalmate\nreticulation\nrhomboid\nscissor\nsemilunaris\nshapeable\nshaped\nshapeless\nwillow pattern\nzigzag\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCovering and adding layers\nAdd to word list\nAdd to word list\na movable shelter, usually made of a strong cloth supported by poles and held in position by ropes fixed to the ground: We pitched our tents near the stream."}