{"id":359639,"name":"term","type":"noun","us_sound":"tɝːm","us_link":"../audio/t/term.mp3","uk_sound":"tɜːm","uk_link":"../audio/t/uktense020.mp3","content":"term noun\n(TIME)\nAdd to word list\nAdd to word list\n[ C ] the fixed period of time that something lasts for: serve a term for He served a short term for drunk driving.be sentenced to a prison/jail term He was sentenced to a 150-year prison term for cheating thousands of ordinary people out of their savings. term of office The government's term of office (= the period in which they have power) expires at the end of the year.\nA2 [ C ] one of the periods into which a year is divided at school, college, or university: In Britain, the spring term starts in January and ends just before Easter.US Our college has three terms that we call trimesters.term-time UK We're very busy in term-time (= during the term). Compare\nquarter\nsemester\n[ C ] formal the period of time that a legal agreement lasts for: The lease on our house is near the end of its term.\n[ U ]\n&#160; biology\n&#160; specialized the end of a pregnancy when a baby is expected to be born: to term Her last pregnancy went to term (= the baby was born after the expected number of weeks). a full-term pregnancy in the long/medium/short term\nB2 for a long, medium, or short period of time in the future: This decision will cost us more in the short term, but will be beneficial in the long term.\nSee more\nMore examplesFewer examplesThe government is elected for a five-year term of office.The school term ends on the ninth of July.Next term we shall study plants and how they grow.At the beginning of term, students are supplied with a list of books that they are expected to read.He served a 13-year jail term.\nSMART Vocabulary: related words and phrases\nPeriods of time - general words\nage\nat/in one sitting idiom\nchapter\nday\ndigital age\nduration\nleeway\nlength\nlife cycle\nlifetime\nmaking\nme time\nperiod\nsession\nsleep\nspasm\ntide\ntime lag\ntime span\ntimescale\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSchools in general\nUniversity & college education\nObstetrics: pregnancy\nterm noun\n(EXPRESSION)\nB2 [ C ] a word or expression used in relation to a particular subject, often to describe something official or technical: \"Without let or hindrance\" is a legal term that means \"freely\".\n[ C ]\n&#160; mathematics\n&#160; specialized a number or symbol used in a mathematical series or calculation: terms of We then use the same rule to compute the terms of the equation. The terms of a geometric series form a geometric progression, meaning that the ratio of successive terms in the series is constant. term of abuse\nan unkind or unpleasant name to call someone: In the playground, this was about the worst term of abuse you could use.\nSee more term of endearment\na kind or friendly name to call someone: It was certainly meant as a term of endearment.\nSee more in terms of (also in ... terms)\nB2 used to describe which particular area of a subject you are discussing: In financial terms, the project was not a success.\nSee more in no uncertain terms\nC2 in a very clear way: She told him what she thought of his behaviour in no uncertain terms (= she made her disapproval very clear).\nSee more in strong, mild, etc. terms\nusing language that clearly shows your feelings: He complained in the strongest terms.\nSee more\nMore examplesFewer examples\"Speed bump\" now seems to be the generally accepted term for those ridges in the road that slow traffic down.Some people think that \"fireman\" is a sexist term, and prefer the term \"firefighter\".The terms \"drinking problem\" and \"alcohol abuse\" are often interchangeable.There is a useful glossary of technical terms at the back of the book.\"Idiot!\" is a mild term of abuse.If you know what each of the terms in the equation means, you can go further and expand your model.\nSMART Vocabulary: related words and phrases\nLinguistics: terminology & vocabulary\nabbreviated form\naccommodation\nalphabetic\nAmericanism\nAnglicism\nantonymous\nbuzzword\ncognate\ncoinage\nhomographic\nhomography\nhomonymic\nhomonymy\nhomophonic\npalindrome\npragmatics\nproductive\nproductively\nreceptive\nreceptively\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCalculations & calculating\nNumerical relationships\nterm noun\n(RULES)\nterms B2 [ plural ]\nthe conditions that control an agreement, arrangement, or activity: under the terms of Under the terms of their contract, employees must give three months' notice if they leave.\nSee more on easy terms\nUK If you buy something on easy terms, you pay for it over a period of time: Loans were given on easy terms, with very low interest charges and up to 50 years to repay.\nSee more on equal terms (also on the same terms)\nhaving the same rights, treatment, etc.: All companies will compete for the government contract on equal terms.\nSee more terms of reference formal\nthe matters to which a study or report is limited: There were complaints that the work that had been done did not fit the terms of reference.\nSee more\nIdioms\ncome to terms with something\nbe on good, friendly, etc. terms (with someone)\nto give something a name or to describe it with a particular expression: Technically, a horse that is smaller than 1.5 metres at the shoulder is termed a pony.\nSMART Vocabulary: related words and phrases\nDefining & explaining\naccount (to someone) for something\naccountability\nadumbrate\nadumbration\nannotation\nannotator\nbelabour\ndemythologize\ndisabuse\nexcuse\nextenuate\ninexpressibly\njustificatory\nlay something out\nlimn\nmansplaining\noutline\nsketch\nspell\nundefinable\nSee more results »\nlong/medium/short-term\nlasting a long/medium/short time: The project will have long-term benefits.\nSMART Vocabulary: related words and phrases\nIn the future & soon\nahead\nahead of\nall in good time idiom\nanon\nASAP\naway\ndue\nfuturistically\ngonna\nhereon\nin\nin for something idiom\nPDQ\nposterity\npresently\nrun\nshortly\nsomeday\nspace\nyet\nSee more results »\nterm noun [C]\n(TIME)\nAdd to word list\nAdd to word list\na period of time during which something lasts: Watson’s term as chairman expired last month. He served a prison term for robbery. This budget plan is good for the long term but it hurts in the short term.\nA term can be one of the periods into which a year is divided at a school or college: I’m taking computer programming during the fall term.\nterm noun [C]\n(EXPRESSION)\na word or phrase used in relation to a particular subject: Erikson is said to have coined the term \"identity crisis.\"\nmathematics A term is also any number, variable (= symbol), or product (= result of mutiplying).\nterm verb [T]\nto give something a name or to describe it with a particular expression: None of the problems was termed serious.\nAdd to word list\nAdd to word list\n[ C ] the period of time that something lasts for: Friendly society bonds run for a minimum term of 10 years. They proposed to increase the term of copyright. The current interest rate of 7.75% is fixed for the term of the loan. Conventional gilts promise to pay a fixed income over a fixed term. The policy didn't reach its full term.\n[ C ] the period of time during which someone is in a job or position, or that a government is in power: The appointments are for a fixed term of 12 months. We're in the eighth month of our term of office.\n[ C ]\n&#160; FINANCE the period of time before something becomes due for payment: They are seeking bonds with a term of 10 years. Compare\ntenor\n[ C or U ] the end of a period of time, for example when an agreement ends: The endowed fund will reach term next year.\n[ C ] a word or expression used in relation to a particular subject, often for something official or technical: legal/medical/technical term Labor negotiations had reached an \"impasse,\" a legal term in labor law. His favourite word was \"loyal\", a general term of approval. We use the term \"burn-out\" to mean that they grow bored and lose the drive to improve and innovate.\n[ C ] one of the conditions of an agreement, arrangement, or activity: There may be a term in the contract that excludes this. We have agreed compensation terms. Employers know that if they do not offer attractive terms and conditions, they cannot expect to recruit the best.under the terms of an agreement/a contract/a deal Under the terms of the merger agreement, the company becomes a wholly owned subsidiary of the larger firm.\nterms\n[ plural ] the conditions for payment that you agree to when you buy or sell something: Their payment terms are sixty days.on attractive/favourable/good terms The South Africans rescheduled Mozambique's debt on favourable terms.\nbe on good/bad/excellent terms (with sb)\nto have a good, etc. relationship with sb: He's on excellent terms with all of the sales staff.\nin real terms\nused to describe the real level or amount of something, when you consider all the things that affect it, especially inflation: In the past 10 years, gross income has increased by 22% in real terms. Total expenditure will rise in real terms by 3.3% a year.\nin ... terms\nsaying something in a particular way: She made her disagreement clear, in the strongest possible terms. They spoke in glowing terms of his achievements.\nin terms of sth (also in ... terms)\nused to describe which particular area of a subject you are discussing: In terms of emissions cleanliness, sugar ethanol is considered superior. World-wide, stock prices rose in dollar terms. Employees evaluate their salary not in absolute terms but relative to their co-workers.\nin the long/medium/short term\nfor a long, medium or short period of time in the future: In the long term, universities will cut jobs. The business seeks to do very well in the short term and in the long term.\non equal terms (with sb/sth)\nhaving the same rights or getting the same treatment as someone else: They felt that they were not being allowed to compete on equal terms with local companies. See also\ncredit terms\ndelivery terms\neasy terms\nexpress term\nfixed term\nfleet terms\nimplied term\nlong-term\nmedium-term\nnear-term\nView all\npayment terms\nprice terms\nsettlement terms\nshort-term\nterms of employment\nterms of engagement\nterms of reference\nterms of trade\ntrade terms\nto use a particular word or expression to describe something: term sth sth The CEO spent the past year on what he termed \"gardening leave\".term sb sth Some people might term her mean.term sth as sth He sought to play down what he termed as \"mere speculation\"."}