{"id":359915,"name":"terror","type":"noun","us_sound":"ˈter.ɚ","us_link":"../audio/t/terror.mp3","uk_sound":"ˈter.ər","uk_link":"../audio/t/uktermi027.mp3","content":"Add to word list\nAdd to word list\nB2 [ C or U ] extreme fear: They fled from the city in terror. There was sheer/abject terror in her eyes when he came back into the room. What he said struck terror in my heart (= made me very frightened). Heights have/hold no terrors for me (= do not frighten me).\nThesaurus: synonyms, antonyms, and examples\nfearfearI have a dreadful fear of heights.terrorShe fled from the attacker in terror.dreadThe thought of giving a speech filled me with dread.alarmI don't want to cause you any alarm, but there's a rattlesnake in the path ahead of you.frightThe family ran from their home in fright when the earthquake struck.panicPanic spread through the crowd when someone shouted \"Fire!\"\nSee more results »\n[ U ] violent action or threats designed to cause fear among ordinary people, in order to achieve political aims: The separatists started a campaign of terror to get independence. We need to form global partnerships to fight terror. a terror suspect/attack/plot Synonym\nterrorism\n[ C ] informal someone, especially a child, who behaves badly and is difficult to control: My brother is a little terror.\nMore examplesFewer examplesThey clung together in terror as the screams grew louder.Her terror was compounded by the feeling that she was being watched.Nearly every new parent feels an amalgam of joy and terror.The political repression in this country is enforced by terror.She felt panic and terror rise in her whenever she thought of the future.\nSMART Vocabulary: related words and phrases\nFear & phobias\nacrophobia\naerophobia\nagoraphobic\naquaphobia\narachnophobia\nbogie\ncatastrophize\ncold sweat\ndread\nhomophobia\nhomophobic\nhydrophobia\nhydrophobic\nIslamophobia\nmisophonia\nmortal\nscare\nwillie\nxenophobe\nxenophobically\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTerrorism & political crime\nChildren & babies\nIdiom\nin terror of your life\nAdd to word list\nAdd to word list\nextreme fear, or violent action that causes fear: [ U ] She was screaming in terror as the flames got closer. [ C ] You can’t hide from the terrors of the world.\nA terror is also a child who behaves badly and is difficult to control: [ C ] My brother is a little terror. terrorize verb [ T ] us\nYour browser doesn't support HTML5 audio\n/ˈter·əˌrɑɪz/\nWild dogs terrorized the neighborhood."}