{"id":359896,"name":"territory","type":"noun","us_sound":"ˈter.ə.tɔːr.i","us_link":"../audio/t/territory.mp3","uk_sound":"ˈter.ɪ.tər.i","uk_link":"../audio/t/uktermi026.mp3","content":"territory noun [C or U]\n(AREA)\nAdd to word list\nAdd to word list\nB2 (an area of) land, or sometimes sea, that is considered as belonging to or connected with a particular country or person: He was shot down in enemy territory. The UN is sending aid to the occupied territories.\n(also Territory) (especially in Australia, Canada, and the United States) a large area that has some local government but fewer rights than a province or a state : Here are some top tips for travel in Canada's Yukon Territory. Puerto Rico, an island in the Caribbean Sea, has been a territory of the United States since 1898. Australia's Northern Territory (NT) could become the country's seventh state.\nB2 an area that an animal or person tries to control or thinks belongs to them: The robin keeps other birds off that part of the garden - that's his territory.\nMore examplesFewer examplesWe can't afford to make any false moves once we're in enemy territory.The planes fly low across enemy territory.Missiles have been launched from their pads deep in enemy territory.The government prohibits the passage of foreign troops and planes across its territory.For years the two nations battled over territory.\nSMART Vocabulary: related words and phrases\nGeography: areas of land in general\nberm\nbioregion\ncircuit\ncurtilage\ndemesne\necoregion\nenclosure\nground\ninterlacustrine\nintermountain\nlandbank\nnon-desert\norography\nparcel\npatch\npocket\nreach\nswathe\nsweep\ntransect\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nTowns & regions: parts of countries\nterritory noun [C or U]\n(SUBJECT)\nC2 a subject that you know about or have experience in: The director is back on familiar territory with his latest film.\nSMART Vocabulary: related words and phrases\nHabitual and customary\naccustomed\nall in a day's work idiom\nas a (general) rule idiom\nas a matter of course idiom\nas per usual/normal idiom\ninveterate\ninveterately\nknee-jerk\nmainstream\nmainstreaming\nmake it a rule idiom\nmechanical\nninety\noften\nordinarily\nper\nprevail\npro forma\nregulation\nsurprise, surprise idiom\nSee more results »\nIdiom\ngo/come with the territory\nAdd to word list\nAdd to word list\nan area of land, sea, or space, esp. when it belongs to or is connected with a particular country, person, or animal: [ U ] Maryland gave up territory to form Washington, DC. [ C ] The UN is sending aid to the occupied territories. Idiom\ngo with the territory\nAdd to word list\nAdd to word list\n[ C or U ] an area of a town, country, etc. that someone has responsibility for in their job: A salesman's failure to achieve apparently realistic targets might be due to a change in the size of his territory. Europe has been very fertile territory for our products.\n[ C or U ] land that belongs to a particular country: The island is a territory of Australia. The four new oil contracts will amount to a half billion dollars worth of foreign investment in their territory.\n[ C or U ] an area of knowledge or activity: This is a territory that lies somewhere between mainstream sport and video games. Online selling was new territory for us.\n[ U ]\n&#160; FINANCE the general level of a price, amount, value, etc.: Crude oil prices are approaching unchartered territory. Persistent production problems helped drive oil prices further into record territory yesterday.\nsth comes/goes with the territory\nsomething always or often happens in a particular situation and you must accept it: It is never easy to accept criticism, but it comes with the territory. See also\nnegative territory\npositive territory"}