{"id":360211,"name":"tethered","type":"adjective","us_sound":"ˈteð.ɚd","us_link":"../audio/t/usteryl016.mp3","uk_sound":"ˈteð.əd","uk_link":"../audio/t/uktetch004.mp3","content":"tethered adjective\n(TIED)\nAdd to word list\nAdd to word list\ntied to a post or fixed to the ground with a rope or chain: a tethered goat tethered balloon rides See\ntether\nMore examplesFewer examplesHave a sweeping view of the magnificent Angkor temples from a tethered helium balloon. Every morning I walked through a dusty olive grove past a tethered donkey to fetch the hard crusty bread.So, this balloon stayed tethered and held down by a strong group of volunteers. I reached a great plain where a grazing horse was tethered.\nSMART Vocabulary: related words and phrases\nLack of freedom to act\nbe in bondage to something idiom\nbe locked in something\nbondage\nbound\nboxed in\ndisempowered\ndisempowering\ndisenfranchisement\nheel\nlock\nnon-voluntary\nparalytic\nqualified\nregimented\nservitude\nshackle\nsomeone's hands are tied idiom\nthumb\ntie\nunder someone's thumb idiom\nSee more results »\ntethered adjective\n(MOBILE PHONE)\ninternet &amp; telecoms\n&#160; specialized using a mobile phone as a wireless internet connection to which you can connect other devices: an unlimited smartphone plan with a 5GB tethered option\nMore examplesFewer examplesA tethered iPhone offloads its 3g \"unlimited\" bandwidth to the tethered device.Tethered data doesn't cost the company anymore than what I use normally.The ipt3 is tethered. The updates will be made over the air or through a tethered PC client.I'm hoping there will be a way to use a tethered iPhone for the internet connection.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethering\ntexturing\nthreading\ntick box\ntimesharing\nSee more results »\nAdd to word list\nAdd to word list\nattached to something: tethered to sth Once the data loggers are tethered to a computer, they track data at whatever interval they're set at.\nclosely connected with something, and changing when it changes: tethered to sth The interest rate charged will be tethered to the prime rate."}