{"id":360672,"name":"text","type":"noun","us_sound":"tekst","us_link":"../audio/t/text.mp3","uk_sound":"tekst","uk_link":"../audio/t/uktetch009.mp3","content":"Add to word list\nAdd to word list\nB1 [ U ] the written words in a book, magazine, etc., not the pictures: The book has 500 pages of text.\nA2 [ C ] a\ntext message : I'll send you a text as soon as I have any news. the text of something\nthe exact words of a speech, etc.: Can we see the full text of your speech before Tuesday?\nSee more\nB1 [ C ] UK a book or piece of writing that you study as part of a course: set text \"Ulysses\" is a set text for the exam.\n[ C usually singular ] a sentence or piece of writing from the Bible that a priest or minister reads aloud in church and talks about\nMore examplesFewer examplesThe spelling mistakes in the text had been highlighted in green.The text is finished, but the pictures will have to be pasted in later.You need to demonstrate to the examiners that you have more than a literal understanding of the text.The students are reading \"Lord of the Flies\" as one of their set texts this year.At this point in the speech, the minister departed from his prepared text.\nSMART Vocabulary: related words and phrases\nPieces of writing\nannotation\nbiographic\nblog post\ncaption\nChyron\ncreative writing\ncutting\ndraft\nfanfiction\nfemslash\nintertextual\nintertextuality\nintertextually\nlegend\npassage\nself-portrait\nsubheading\ntranscript\ntypescript\nversification\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCommunications - messaging\nBooks & parts of books\nThe Bible - people, events & places\nA2 to send someone a text message by phone: I texted her to arrange a time to meet.\nMore examplesFewer examplesShe spends hours texting her boyfriend.He texted me when he set off.\nSMART Vocabulary: related words and phrases\nCommunications - messaging\nbeep\nbleeper\ndirect message\nDM\nfacsimile\nfax\nintercom\nMailgram\nmessage\nmessaging\np.m.\npage\npager\nresend\nTelemessage\ntelex\ntext message\nthnq\ntweet\ntweetstorm\nSee more results »\nRelated word\ntexting\ntext noun [C/U]\n(writing)\nAdd to word list\nAdd to word list\nwritten or printed material: [ U ] The text is based on Irish legends.\ntext verb [T]\n(send)\nto send a text message: If I texted him and didn't see a response within 15 minutes, I would worry.\nAdd to word list\nAdd to word list\n[ U ] the written words in a book, on the internet, etc., rather than the pictures: There's still space on the ad for a further piece of text. We give the address of the website in several places in the printed text. You can highlight horizontal blocks of text by clicking and dragging the mouse.\n[ C ]\n&#160; COMMUNICATIONS a short written message that you send or receive using a mobile phone; a text message: get/receive/send a text A third of teenagers send more than 100 texts every day. This package gives users 300 minutes and 500 texts a month.\nthe text of sth\nthe exact words of a speech, an article, etc.: Attached is the full text of the speech\nto send someone a written message on a mobile phone: After texting a code number, users will be able to launch the web-based application on their mobile screen. Text me when you get out of the interview.text sth to sb/sth Order your copy now by texting PROMO to this number."}