{"id":360933,"name":"that","type":"determiner","us_sound":"ðæt","us_link":"../audio/t/that.mp3","uk_sound":"ðæt","uk_link":"../audio/t/uktetch026.mp3","content":"Add to word list\nAdd to word list\nA1 used to refer to a person, object, idea, etc. that is separated from the speaker by space or time: I've never liked that cousin of hers. Who's that? Is that the girl you told me about? How much are those shoes?formal His handwriting is like that (= the writing) of a much younger child.\nA1 used to refer to something that has been mentioned or was involved earlier, or to something that is already known about: Where's that pen (= the one I was using earlier) gone? She lives in that house at the end of Jeremy's street (= you know which one I mean).\nMore examplesFewer examplesI closed that bank account when I came to London.Don't get too close to that dog, Rosie.They frequently hold conferences at that hotel.I'm a bit confused. Was that her husband or her son she was with?What's that concrete and metal construction over there?\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusive\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nquotable\nquotably\nquote\nquote... unquote idiom\nref\nrefer to someone/something\nreference\nreferent\nreported speech\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIsolating and separating\nLearning & knowing\nGrammar\nIt, this and that in paragraphsWe use it, this and that to introduce further information about a topic already mentioned. However, the words have different uses. …\nThatThat is a very common word in both writing and speaking. We use it as a determiner, a demonstrative pronoun and a relative pronoun. We also use it as a conjunction to introduce that-clauses. …\nThat: determiner and pronounWe use that most commonly to point to a thing or person. We use it with singular nouns. The thing or person is often distant from the speaker and sometimes closer to the listener, or not visible to either the speaker or listener: …\nThat: relative pronounWe use that to introduce defining relative clauses. We can use that instead of who, whom or which to refer to people, animals and things. That is more informal than who or which: …\nThat-clausesWe also use that to introduce that-clauses after some verbs, adjectives and nouns: …\nThat: other usesWe use that’s + adjective (e.g. that’s lovely, that’s good, that’s great, that’s terrible, that’s awful) to respond to something that someone is telling us, to show that we are listening: …\nThis, that, these, thoseThis, that, these and those are demonstratives. We use this, that, these and those to point to people and things. This and that are singular. These and those are plural. We use them as determiners and pronouns. …\nThis, that, these, those as determinersWe use this and that with singular and uncountable nouns: …\nThis, that, these, those as pronounsWe normally use this, that, these and those as pronouns to refer to things or ideas: …\nThis and these, that and those: usesWe use this and these most commonly to point to things and people that are close to the speaker or writer, or things that are happening now: …\nSubstitution with that, thoseIn formal contexts, we can use that and those as substitutes meaning ‘the one(s)’: …\nIdioms\n... at that\nthat is (to say)\nthat will do\nthat's it\nthat's that\nA2 used to introduce a clause that reports something or gives further information, although it can often be left out: She said (that) she'd pick it up for me after work. Is it true (that) she's gone back to teaching? We'll be there at about 7.30, provided/providing (that) there's not too much traffic. It was so dark (that) I couldn't see anything.\nMore examplesFewer examplesThe water in the lake is so clear that you can see the bottom.It was predicted that a comet would collide with one of the planets.She confessed to her husband that she had sold her wedding ring.I'm sorry that I wasn't able to phone you yesterday.The light was so bright that I had to cover my eyes.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nThatThat is a very common word in both writing and speaking. We use it as a determiner, a demonstrative pronoun and a relative pronoun. We also use it as a conjunction to introduce that-clauses. …\nThat: determiner and pronounWe use that most commonly to point to a thing or person. We use it with singular nouns. The thing or person is often distant from the speaker and sometimes closer to the listener, or not visible to either the speaker or listener: …\nThat: relative pronounWe use that to introduce defining relative clauses. We can use that instead of who, whom or which to refer to people, animals and things. That is more informal than who or which: …\nThat-clausesWe also use that to introduce that-clauses after some verbs, adjectives and nouns: …\nThat: other usesWe use that’s + adjective (e.g. that’s lovely, that’s good, that’s great, that’s terrible, that’s awful) to respond to something that someone is telling us, to show that we are listening: …\nThat-clausesWe use that as a conjunction to link a verb, adjective or noun with the following clause. …\nVerb + that-clauseVerbs commonly followed by that include reporting verbs (say, tell, admit, etc.) and mental process verbs (believe, think, know, hope, etc.): …\nAdjective + that-clauseWe use be + adjective + that-clause to express opinions and feelings. Some adjectives commonly used in this way are sure, certain, right, important, afraid, pleased, sorry, surprised, worried. We can omit that with no change in meaning: …\nNoun + that-clauseWe use a noun + that-clause to express opinions and feelings, often about certainty and possibility. We also use that with reporting nouns. Some nouns commonly used in this way are belief, fact, hope, idea, possibility, suggestion, statement, claim, comment, argument: …\nVerb patterns: verb + that-clauseSome verbs connected with reporting can be followed by a that-clause acting as the direct object (underlined in the examples): …\nReporting verbs + that-clauseSome verbs connected with reporting can be followed by a that-clause acting as the direct object (underlined in the examples): …\nVerbs followed by an indirect object and a that-clauseSome verbs (generally those connected with reporting) can be followed by an indirect object (underlined) plus a that-clause acting as the direct object: …\nVerbs followed by a prepositional phrase and a that-clauseSome verbs can be followed by a prepositional phrase (underlined) and a that-clause acting as the direct object: …\nthat pronoun\n(USED TO REFER)\nB1 used as the subject or object of a verb to show which person or thing you are referring to, or to add information about a person or thing just mentioned. It is used for both people and things. It can often be left out: I can't find the books (that) I got from the library. Is this the train that goes to Braintree? Have you been to the restaurant that's just opened in town?\nMore examplesFewer examplesThe letters that people wrote after his death gave me a lot of comfort.He was sent to prison for a crime that he didn't commit.Where's the cord that ties back the curtains?The work that the students do during the year will count towards their final degrees.The yogurt that you bought was really nice - where did you get it?\nSMART Vocabulary: related words and phrases\nLinguistics: relative forms\nhowsoever\nor\nwhat\nwhatever\nwhence\nwhenever\nwhere\nwhereby\nwhereof\nwheresoever\nwherever\nwhichever\nwho\nwhom\nwhomever\nwhose\nwhosoever\nwot\nSee more results »\nthat pronoun\n(CONNECTING WITH EARLIER STATEMENT)\nA2 used to make a connection with an earlier statement: My car broke down. That's why I'm so late. Lucy worked out how to fix it. That's Lucy for you (= She can fix anything).\nB2 used to express a reaction to something: I didn't know she'd been so ill. That's terrible. Turn the engine on, then put the car in gear. That's right (= you are doing it correctly). Smile for the camera. That's more like it (= that smile is better than before).\nMore examplesFewer examplesCharles had told her off. That's why she was so upset.\"Jim didn't even turn up.\" \"That's Jim for you.\"\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words which introduce a cause or reason\nas\nat\ncase\ncourtesy\ncuz\ndint\ndue\nexcept\nexcept that idiom\nherein\ninasmuch as\ninsofar as\nlight\nnecessarily\nnow\nsince\nthing\nview\nwhat\nwith a view to doing something idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nReacting and responding\nGrammar\nIt, this and that in paragraphsWe use it, this and that to introduce further information about a topic already mentioned. However, the words have different uses. …\nRelative pronounsRelative pronouns introduce relative clauses. The most common relative pronouns are who, whom, whose, which, that. The relative pronoun we use depends on what we are referring to and the type of relative clause. …\nRelative pronouns: thatWe use that instead of who, whom or which in relative clauses to refer to people, animals and things. We use it to introduce defining clauses only. That is more informal than who, whom or which: …\nNo relative pronounIn informal styles, we often leave out the relative pronoun. We only do this in defining relative clauses, and when the relative pronoun is the object of the verb. We don’t leave out the relative pronoun when it is the subject of the verb nor in non-defining relative clauses: …\nThatThat is a very common word in both writing and speaking. We use it as a determiner, a demonstrative pronoun and a relative pronoun. We also use it as a conjunction to introduce that-clauses. …\nThat: determiner and pronounWe use that most commonly to point to a thing or person. We use it with singular nouns. The thing or person is often distant from the speaker and sometimes closer to the listener, or not visible to either the speaker or listener: …\nThat: relative pronounWe use that to introduce defining relative clauses. We can use that instead of who, whom or which to refer to people, animals and things. That is more informal than who or which: …\nThat-clausesWe also use that to introduce that-clauses after some verbs, adjectives and nouns: …\nThat: other usesWe use that’s + adjective (e.g. that’s lovely, that’s good, that’s great, that’s terrible, that’s awful) to respond to something that someone is telling us, to show that we are listening: …\nThis, that, these, thoseThis, that, these and those are demonstratives. We use this, that, these and those to point to people and things. This and that are singular. These and those are plural. We use them as determiners and pronouns. …\nThis, that, these, those as determinersWe use this and that with singular and uncountable nouns: …\nThis, that, these, those as pronounsWe normally use this, that, these and those as pronouns to refer to things or ideas: …\nThis and these, that and those: usesWe use this and these most commonly to point to things and people that are close to the speaker or writer, or things that are happening now: …\nSubstitution with that, thoseIn formal contexts, we can use that and those as substitutes meaning ‘the one(s)’: …\nB2 as much as suggested: She's too young to walk that far. It wasn't (all) that (= very) good.\nMore examplesFewer examplesI'm not feeling that well at the moment.I can't really eat that much.I don't think the medicine will help that much.We haven't got that much time.\nSMART Vocabulary: related words and phrases\nGeneral words for size and amount\n-sized\namount\nbulk\ncontent\nelement\nextent\nfootprint\ngood things come in small packages idiom\nhaul\nlevel\nlot\nmeasure\nmuch\norder\npercent\nquantity\nquota\nration\nsmall-scale\nstrong\nSee more results »\nGrammar\nThatThat is a very common word in both writing and speaking. We use it as a determiner, a demonstrative pronoun and a relative pronoun. We also use it as a conjunction to introduce that-clauses. …\nThat: determiner and pronounWe use that most commonly to point to a thing or person. We use it with singular nouns. The thing or person is often distant from the speaker and sometimes closer to the listener, or not visible to either the speaker or listener: …\nThat: relative pronounWe use that to introduce defining relative clauses. We can use that instead of who, whom or which to refer to people, animals and things. That is more informal than who or which: …\nThat-clausesWe also use that to introduce that-clauses after some verbs, adjectives and nouns: …\nThat: other usesWe use that’s + adjective (e.g. that’s lovely, that’s good, that’s great, that’s terrible, that’s awful) to respond to something that someone is telling us, to show that we are listening: …\nthat pronoun, adjective [not gradable]\n(SOMETHING NOT HERE)\nAdd to word list\nAdd to word list\nused to refer to a person, object, event, etc., separated from the speaker by distance or time, or to something that has been referred to before, or to point to a particular thing: This peach isn’t ripe – can I have that one (= the one farther away) on the table? Put that box (= the particular box referred to) down before you drop it. Where’s that pen (= the one I was using earlier)? If she could play like that (= the way she is now playing) every day, she’d be a star. She called him an imbecile, and at that (= immediately after that) he stormed out of the room.\nThat is also used to make a connection with an earlier statement: My usual train was canceled. That’s why I’m late. I didn’t know she’d been so ill. That’s terrible. that is\nYou say that is when you want to give further details or be more exact about something: I should be there by seven, that is, unless there’s a lot of traffic. Idioms\nthat's (about) it\nthat’s life\nthat's more like it\nthat conjunction\n(INTRODUCING A CLAUSE)\nused to introduce a clause reporting something or giving further information, although it can often be omitted: She said (that) she’d pick up Michael after work. It’s possible (that) there’ll be a job opening in a few weeks. It was so dark (that) I couldn’t see anything.\nthat pronoun\n(USED TO REFER)\nused to show what particular thing is being referred to: Have you been to the new restaurant that just opened? That’s the guy I was talking about.\nthat adverb [not gradable]\n(AS MUCH)\nas much as suggested: It cost at least that much, if not more. The movie really wasn’t that good (= was not very good)."}