{"id":360985,"name":"the","type":"determiner","us_sound":"ðiː","us_link":"../audio/t/the_01_00.mp3","uk_sound":"ðiː","uk_link":"../audio/t/epd33125.mp3","content":"the determiner\n(PARTICULAR)\nAdd to word list\nAdd to word list\nA1 used before nouns to refer to particular things or people that have already been talked about or are already known or that are in a situation where it is clear what is happening: I just bought a new shirt and some new shoes. The shirt was pretty expensive, but the shoes weren't. Please would you pass the salt. I'll pick you up at the airport.\nA1 used before some nouns that refer to place when you want to mention that type of place, without showing exactly which example of the place you mean: We spent all day at the beach. Let's go to the movies this evening. I have to go to the bank and get some Euros.\nA1 used before noun phrases in which the range of meaning of the noun is limited in some way: I really enjoyed the book I've just finished reading. Do you like the other kids in your class?\nA1 used to refer to things or people when only one exists at any one time: What will happen in the future? After I leave college, I want to travel around the world. They live in the north of Spain. Ed Koch was for many years the mayor of New York. When we went to Paris, we went up the Eiffel Tower.\nA2 used before superlatives and other words, such as \"first\" or \"only\" or numbers showing something's position in a list, to refer to only one thing or person: That was one of the best films I've ever seen. What's the highest mountain in Asia? I will never forget the first time we met. You're the fifth person to ask me that question.\nused to say that the particular person or thing being mentioned is the best, most famous, etc. In this use, \"the\" is usually given strong pronunciation: Harry's Bar is the place to go. You don't mean you met the Will Smith (= the film star), do you?\nused before some adjectives to turn the adjectives into nouns that refer to one particular person or thing described by the adjective: It seems that the deceased (= this particular dead person) had no living relatives. I suppose we'll just have to wait for the inevitable (= the particular thing that is certain to happen).\nused before some adjectives to turn the adjectives into nouns that refer to people or things in general that can be described by the adjective: She lives in a special home for the elderly. The French were defeated at Waterloo in 1815.\nused before a singular noun to refer to all the things or people represented by that noun: The panda is becoming an increasingly rare animal. The car is responsible for causing a lot of damage to our environment.\nused before a family name to refer to two people who are married or to a whole family: The Jacksons are coming to visit on Saturday.\nused before some nouns referring to musical instruments or dances to mean the type of instrument or dance in general: Nico is learning to play the piano. Can you do the waltz?\nused before a noun to represent the activity connected with that noun: I'm going under the knife (= having a medical operation) next week. It's not a good idea to spend more than three hours at the wheel (= driving a vehicle) without a break.\nB2 used before numbers that refer to periods of ten years: the 60s\nB2 used before each of two comparative adjectives or adverbs when you want to show how one amount gets bigger or smaller in relation to the other: The sooner I get this piece of work done, the sooner I can go home.\nused before comparative adjectives or adverbs when you want to show that someone or something has become more or less of a particular state: She doesn't seem to be any the worse for her bad experience.\nused for emphasis when you are expressing a strong opinion about someone or something: André's got a new job, the lucky devil.\nMore examplesFewer examplesDon't sit on that bag - you'll squash the sandwiches.I dropped him at the library and went shopping.She followed me into the kitchen.\"How many children are there in the school?\" \"About three hundred.\"The children are always hungry when they get home from school.\nSMART Vocabulary: related words and phrases\nExtremely good\nadmirable\namazing\namazingly\nask for someone\naward-winning\nfirst-rate\nfive-star\ngold-plated\ngourmet\ngreatness\nhave no parallel phrase\npar excellence\nsensational\nshining\nsock\nsplendid\nsplendidly\nstellar\nsuperiority\nwonderfully\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDecades, centuries & the millennium\nExpressing and asking opinions\nthe determiner\n(YOUR)\nB1 used instead of a possessive adjective such as your, her, or my: He held his daughter by the arm (= her arm). I can't remember where I parked the (= my) car.\nMore examplesFewer examplesShe took me by the hand and led me into the cave.She grabbed the cat by the tail - which was a rather stupid thing to do!\"Cheer up, \" she said and chucked the little girl under the chin.They cracked him over the head with a baseball bat.Always remember to bend at the knees when you're picking up anything heavy.\nSMART Vocabulary: related words and phrases\nLinguistics: possessive forms\nhers\nhis\nits\nmine\nmy\nour\nours\nS, s\ntheir\ntheirs\nthine\nthy\nus\nyer\nyour\nyours\nthe determiner\n(ENOUGH)\nenough: I'd like to go out tonight, but I don't think I have the energy. [ + to infinitive ] I don't have the time to talk to you now.\nMore examplesFewer examplesI can't do fiddly jobs like that - I don't have the patience.She never seems to have the time to sit down and talk any more.I'd love to do a parachute jump, but I can't pluck up the courage.If we can raise the money, I'd like to get the treatment done privately.He hardly had the strength to lift his head off the pillow.\nSMART Vocabulary: related words and phrases\nEnough\nadequacy\nadequate\nadequately\ncover\nfill\ngo\ngo round\ngood\nhold out\nrespectable\nrespectably\nsatiable\nsatisfiable\nsay\nsay when idiom\nsufficiency\nsufficient\nsufficiently\nthat\nthat will do idiom\nSee more results »\nthe determiner\n(EACH)\neach; every: It does 30 miles to the gallon.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthrow\nto\nwhole\nGrammar\nA/an and theA/an and the are articles. They are a type of determiner and they go before a noun. …\nA/an and the: meaningA/an and the are articles. They are a type of determiner and they go before a noun. …\nWhen do we use a and when do we use an?In speaking, we use a /ə/ before a consonant sound: …\nHow do we pronounce the?We pronounce the in two ways depending on whether the sound which comes after the is a vowel or a consonant: …\nWhen do we use articles? …\nA/an and the: typical errorsWe don’t use the with plural nouns when we are referring to things in general: …\nThe thing, the one thing, somethingWe can use the thing in front position plus a form of the verb be to bring attention to an item in the clause. It means the same as what plus be, but it is more informal (the focus in each sentence is underlined below): …\nthe definite article\n(PARTICULAR)\nAdd to word list\nAdd to word list\nused before a noun to refer to a particular thing because it is clear which thing is intended: I just bought a new shirt and tie. The shirt was expensive, but the tie wasn’t. There’s someone at the front door. I’ll pick you up at the airport at 6 o’clock.\n\"The\" is used before some nouns to refer to a type of activity or thing intended: Let’s go to the movies.\n\"The\" is used to refer to things or people when only one exists at any one time: the Statue of Liberty\n\"The\" is also used before superlatives and other words, such as first or only or numbers: What’s the highest mountain in North America? She’s leaving on the 24th of May.\n\"The\" can mean each or every: My car gets 30 miles to the gallon.\nWhen used before some adjectives, \"the\" changes the adjective into a noun to refer to all of what is described: the homeless/poor/rich\nYou can use \"the\" before a singular noun to refer to all the things or people represented by that noun: Nicole is learning to play the piano.\nYou use \"the\" before numbers that refer to periods of 10 years: the 1930s\nthe definite article\n(YOUR)\nused instead of your, my, his, her, etc.: He tapped me on the (= my) shoulder. How are Grace and the (= her) kids?\nthe definite article\n(ENOUGH)\nenough: He hasn’t got the experience for this kind of work."}