{"id":361036,"name":"theatrically","type":"adverb","us_sound":"θiˈæt.rɪ.kəl.i","us_link":"../audio/t/usteryl029.mp3","uk_sound":"θiˈæt.rɪ.kəl.i","uk_link":"../audio/t/uktheat006.mp3","content":"theatrically adverb\n(PERFORMING ARTS)\nAdd to word list\nAdd to word list\nin a way that belongs or relates to the theatre, or to the performance or writing of plays, opera, films, etc.: How can theatrically talented kids be nurtured and developed? She writes theatrically exciting plays.\nUS in cinemas : His latest film opens theatrically next month. \"Persuasion\" was made for British TV before being released theatrically.\nMore examplesFewer examplesThis is a very exciting time for this community theatrically. It is an overwhelming experience, musically and theatrically.Her new play is an emotionally and theatrically ambitious work.\nSMART Vocabulary: related words and phrases\nTheatre - general words\naudio described\naudio description\nbreak\nbreak a leg idiom\ncommunity theatre\ndiegetic\ndouble bill\nhold\nkabuki\nmusical\nNoh\nnon-theatrical\nnondramatic\npremiere\npreview\npuppetry\nscenography\nslapstick\nthespian\nvaudeville\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\ntheatrically adverb\n(BEHAVIOUR)\nin a way that is very extreme and not sincere, and is intended to attract attention: She tossed her head theatrically and stalked off. The player fell theatrically in a vain attempt to win a penalty. See\ntheatrical\nMore examplesFewer examplesHe was drumming his fingers on the table and rolling his eyes theatrically.Joan raised her arm and touched the back of her hand theatrically to her forehead.The scene on French television last week was theatrically grotesque.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nstudiedly\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\nSee more results »"}