{"id":361025,"name":"theatrical","type":"adjective","us_sound":"θiˈæt.rɪ.kəl","us_link":"../audio/t/theatrical.mp3","uk_sound":"θiˈæt.rɪ.kəl","uk_link":"../audio/t/uktheat004.mp3","content":"theatrical adjective\n(PERFORMING ARTS)\nAdd to word list\nAdd to word list\nbelonging or relating to the theatre, or to the performance or writing of plays, opera, etc.: theatrical make-up He translated \"Romeo and Juliet\" into Arabic for a theatrical production he plans to direct. The festival features visual art, theatrical performances and music at various Austin venues. The singer has made her theatrical debut on the West End stage.\nUS in a cinema: The film will have its theatrical release in San Francisco, New York and a few other large cities in August. The wait for the film's theatrical debut has been a long one - more than a year.\nMore examplesFewer examplesMidnight Society is a theatrical adaptation of Pierre Choderlos de Laclos' 1782 novel, Les Liaisons Dangereuses.The film is scheduled for TV, not a theatrical release.The film won't have a regular theatrical run in Atlanta until May.\nSMART Vocabulary: related words and phrases\nTheatre - general words\naudio described\naudio description\nbreak\nbreak a leg idiom\ncommunity theatre\ndiegetic\ndouble bill\ndramatize\nhold\nkabuki\nmusical\nnon-theatrical\nnondramatic\npremiere\npreview\npuppetry\nscenography\nslapstick\nthespian\nvaudeville\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCinema - general words\ntheatrical adjective\n(BEHAVIOUR)\nbehaving in an extreme way that is intended to attract attention, rather than being sincere: He tends to be a little theatrical. a theatrical gesture\nMore examplesFewer examples\"She was very theatrical,\" he said. \"She had a wild imagination.\"You may be accused of being theatrical, but that's better than allowing the moment to pass without comment.\nSMART Vocabulary: related words and phrases\nAffected & insincere\naffectation\naffected\naffectedly\narchly\nartificial\nfeyness\nforced\nforcedly\nfustian\nglib\npiously\nponce\nponce about/around\nposey\npreciously\nstudiedly\nsugary\nsuper-smooth\nsuperslick\ntalk the talk ... walk the walk idiom\nSee more results »\nRelated words\ntheatricality\ntheatrically\nAdd to word list\nAdd to word list\nof or relating to the public performance of plays: theatrical performances\nTheatrical also means intended to attract attention, as if acting in a play: He threw out both arms to greet me in a theatrical gesture."}