{"id":361147,"name":"theist","type":"noun","us_sound":"ˈθiː.ɪst","us_link":"../audio/t/cdo0318usthei5033.mp3","uk_sound":"ˈθiː.ɪst","uk_link":"../audio/t/cdo0216theiuk2039.mp3","content":"Add to word list\nAdd to word list\nsomeone who believes in the existence of a god or gods, especially a god who created the world and who acts to influence events: The task of the theist, as stated in this book, is to define what he or she means by the word \"God\", and to give some evidence for believing that this deity exists. Theists regard nature as being the creation of God. Compare\nagnostic\natheist\ndeist\nmonotheist\nnontheist\npantheist\nMore examplesFewer examplesAtheists and theists interpret information about the cosmos in radically different ways.Darwin's own personal agnosticism, even if it had been known publicly, might have made little difference to theists. Some theists and atheists can talk to one another; others cannot.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nmystic\nsecular humanist\nsecularist\nthe laity\ntheistic\nunbelief\nunbeliever\nSee more results »\nbelieving in the existence of a god or gods, especially a god who created the world and who acts to influence events, or relating to such a belief: I read an article by a prominent theist philosopher in Australia. We do not accept the theist argument that science and reason are also based on faith. Compare\nagnostic\natheist\ndeist\nmonotheist\nnontheist\npantheist\nMore examplesFewer examplesWe're not deist, we're theist - we believe God is involved in the workings of our lives.He called on them to discard their theist ideas. She doesn't depict believers as simpletons but offers a more complex portrait of the theist psyche.\nSMART Vocabulary: related words and phrases\nReligious people: believers & non-believers\nanti-evolution\nanti-evolutionary\nanti-evolutionist\nanti-humanist\nantichrist\nconverted\ndeist\nevolutionist\nfaithful\nfaithless\nirreligiously\nlibertine\nmonotheist\nmystic\nsecular humanist\nsecularist\nthe laity\ntheistic\nunbelief\nunbeliever\nSee more results »"}