{"id":361182,"name":"them","type":"pronoun","us_sound":"ðem","us_link":"../audio/t/them.mp3","uk_sound":"ðem","uk_link":"../audio/t/uktheat012.mp3","content":"Add to word list\nAdd to word list\nA1 used, usually as the object of a verb or preposition, to refer to people, things, animals, situations, or ideas that have already been mentioned: I've lost my keys. I can't find them anywhere. It's them. They're here.\nB1 used to refer to one person whose gender is not known or not important in the situation: When each passenger arrives, we ask them to fill in a form.\nused to refer to one person whose gender is not simply male or female: I am non-binary and use they/them pronouns. I interviewed them about their work as an LGBTQ activist.\nMore examplesFewer examplesWhen you've finished your work sheets, clip them together and hand them in to me.Babies are curious about everything around them.Don't bother drying the pans - just leave them to drain.If anyone rings for me, please tell them I'll be back in the office at four o'clock.Her family invited me to stay with them for a few weeks.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthemself\nthey\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nIdiom\nthem and us\nnot standard for\nthose : Who gave you them cookies?\nAdd to word list\nAdd to word list\nthe things or people being spoken about, who have already been mentioned; the objective form of they: I lost my keys and I can’t find them anywhere.\nThem is also used to refer to a person whose sex is not known: As each person arrives, we ask them to fill out a form."}