{"id":361189,"name":"theme","type":"noun","us_sound":"θiːm","us_link":"../audio/t/theme.mp3","uk_sound":"θiːm","uk_link":"../audio/t/uktheat015.mp3","content":"theme noun [C]\n(MAIN SUBJECT)\nAdd to word list\nAdd to word list\nB2 the main subject of a talk, book, film, etc.: The theme of loss runs through most of his novels.\nMore examplesFewer examplesThe theme of freedom recurs throughout her writing.The father-daughter relationship is a recurring theme in her novels.On the surface it's a very funny novel but it does have a more serious underlying theme.The movies she makes are all variations on the same theme.Unfortunately, I had to leave just as the speaker was warming to his theme.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\ntheme noun [C]\n(TUNE)\na song or tune that is played several times in a film, etc. and represents a character, situation, etc.: a theme song/tune\nmusic\n&#160; specialized a short, simple tune on which a piece of music is based theme and variation\na musical form in which a theme is played and then repeated several times with small changes: theme and variations for violin and piano\nSee more\nSMART Vocabulary: related words and phrases\nSinging\na cappella\naccompaniment\naccompany\nalto\nanthem\nbanger\nbarbershop\ncroon\ncrooner\ndirge\nditty\ndiva\ndoxology\nintonation\nquintet\nraise the roof idiom\nrapping\nscreamer\nseptet\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMusical pieces\nto design something according to a particular theme (= subject), or to relate it to a particular place or time: The attraction had been themed as a haunted mansion.theme something up You can theme a party up however you want.\nSMART Vocabulary: related words and phrases\nTopics & areas of interest\nangle\nbackyard\nbailiwick\ncause célèbre\ncentrism\ncon\nconvention\ndemesne\nfront\nissue\nkingdom\nleitmotiv\nprovince\nscore\nspecialism\nsubject\ntalk\ntalking point\nthemed\ntopically\nSee more results »\ntheme noun [C]\n(SUBJECT)\nAdd to word list\nAdd to word list\nthe topic of discussion or writing: The theme of the conference was the changing role of women in modern society.\nliterature, art A theme is also the main idea of a work of literature or art.\ntheme noun [C]\n(MUSIC)\na short, simple tune on which a piece of music is based theme and variation music\nTheme and variation is a musical form in which a theme is played and then repeated several times with small changes in interesting ways."}