{"id":361200,"name":"then","type":"adverb","us_sound":"ðen","us_link":"../audio/t/then.mp3","uk_sound":"ðen","uk_link":"../audio/t/uktheat017.mp3","content":"Add to word list\nAdd to word list\nA1 (at) that time (in the past or in the future): I was working in the city then.formal I wanted to live in the city, but my then husband (= the man who was my husband at that time) preferred the country. Give it to me next week - I won't have time to read it before/until then. I'll call you tomorrow - I should have the details by then.\nMore examplesFewer examplesHe's always harking back to his childhood and saying how things were better then.Just then, the lights went out.The train leaves at three minutes to eight, so we'd better get there a few minutes before then.If you come to the surgery at 10.30, the doctor will see you then.They used to live in a big house with lots of servants, but they've come down in the world since then.\nSMART Vocabulary: related words and phrases\nIn the past\nago\nany more idiom\nanymore\nback in the day idiom\nback then idiom\nclock\ndim\ndot\nflood\nmist\nmoon\nmore\nno longer idiom\nnon-current\nrewind the clock idiom\nsometime\nstep\nstep back (in time) idiom\nthe mists of time idiom\nthe status quo ante\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the future & soon\nIdioms\nfrom then on\nthen and there\nthen adverb\n(NEXT)\nA1 next or after that: Let me finish this job, then we'll go. Give her the letter to read, then she'll understand.\nMore examplesFewer examplesStudy the examples first of all, then attempt the exercises on the next page.Follow the road for two kilometres, then turn left.The children will first sing individually and then together as a group.We took the ferry across the Channel and then joined the Paris train at Calais.First apply shampoo to hair and then rinse thoroughly.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nmean\nnow\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nthen adverb\n(IN ADDITION)\nB2 in addition: This is the standard model - then there's the deluxe version which costs more.\nMore examplesFewer examplesWe have a town house, a country cottage, and then there's our villa in Spain.She's a writer mainly - then she paints, and does some excellent photography too.I've got to get everything ready for our visitors, and then I haven't finished writing that report yet.If you're looking for something smaller, then there's a compact 36 cm screen size, ideal for bedroom or kitchen use.Let's see - there were Mary, Jack, Greg and myself - then there were the children, Amy, John and Laura, plus the two dogs.\nSMART Vocabulary: related words and phrases\nAlso, extra, and in addition\nadded\nadditional\nadditionally\nagain\nalong\net cetera\netc.\nexcess\nfiller\nfor good measure idiom\nhand\nrate\nsame\nsecond\nsecondly\nside\nsuchlike\nsupernumerary\nthirdly\ntouch\nSee more results »\nthen adverb\n(RESULT)\nA2 as a result; in that case; also used as a way of joining a statement to an earlier piece of conversation: Have a rest now, and then you won't be so tired tonight. You'll be selling your house, then?\nMore examplesFewer examplesIf you plan the project well, then everything should fall into place.Try and get some sleep on the plane, then you'll arrive feeling fresh.I'll leave you to get on then, shall I?If there are only five of us going to the concert, then I've booked one too many seats.If 2x = 8, then x = 4.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nmean\nnow\nslash\nso\nthe thing is idiom\nthere\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nLinking adverbs (then, however)Linking adverbs show a relationship between two clauses or sentences (e.g. a sequence in time, cause and effect, contrast between two things): …\nThenThen as an adverb has a number of different meanings. …\nIdiom\nbut then (again)\nthen adjective, adverb [not gradable]\n(TIME)\nAdd to word list\nAdd to word list\nat that time (in the past or in the future): She was then sixteen years old. Soon the sun will go down, and then it will be time to go. Idioms\nthen again\nthen and there\nthen adverb [not gradable]\n(NEXT)\nnext or after that: He smiled, then turned to me and nodded.\nthen adverb [not gradable]\n(IN ADDITION)\nin addition: We both want to go, and then there’s Carmen, so we need three tickets.\nthen adverb [not gradable]\n(AS A RESULT)\nas a result; in that case; also used as a way of joining a statement to an earlier piece of conversation: Why don’t you call them to tell them we’ll be late? Then they won’t worry. If I don’t hear from you by Friday, then I’ll assume you’re not coming."}