{"id":361510,"name":"there","type":"adverb","us_sound":"ðer","us_link":"../audio/t/their.mp3","uk_sound":"ðeər","uk_link":"../audio/t/uktheat009.mp3","content":"there adverb\n(PLACE)\nAdd to word list\nAdd to word list\nA1 (to, at, or in) that place: Put the chair there. The museum is closed today. We'll go there tomorrow. There's that book you were looking for. I'll have to stop you there - we've run out of time. I left the boxes over/out/under there. get there\nA1 to arrive somewhere: We'll never get there in time.\nB2 informal to succeed: Try again - you'll get there in the end.\nSee more\nMore examplesFewer examplesDon't stand out there in the cold, come in here and get warm.I'm not quite sure how to get there - I'd better consult a map.The countryside around there is lovely.I like the house but I don't imagine I'll live there forever.I peeked out the window to see who was there.\nSMART Vocabulary: related words and phrases\nIn & at\ndepth\nen-\nendogenous\nfrom within idiom\nhereunder\nin\nindoor\nindoors\ninner\ninner circle\ninnermost\ninside\ninterior\nintra-\ninward\nmidst\non a dime idiom\ntherein\nthick\ntrack\nSee more results »\nthere adverb\n(INTRODUCING SUBJECT)\nA1 used to introduce the subject of a sentence, especially before the verbs be, seem, and appear: There's someone on the phone for you. There's no doubt who is the best candidate. I took out my wallet but there was no money in it. By the time I got back, there was no food left. There appeared/seemed to be a problem with finding a date for the meeting.not standard There's (= there are) lives at stake and we can't afford to take any risks.\nliterary used to begin some children's stories written in a traditional style: There once was/lived a poor widow who had a beautiful daughter.\nMore examplesFewer examplesCuriously, there didn't seem to be a bank in the town.Is there a direct train to Edinburgh?There were loads of people waiting outside the post office.There are twice as many houses in this area as there used to be.There is a small building adjacent to the house that could be used as an office or studio.\nSMART Vocabulary: related words and phrases\nLinguistics: connecting words joining words or phrases with similar or related meanings\nand/or phrase\nanyhoo\nanyhow\nanyways\nconcatenate\nconjunctive\nconjunctively\nergo\nhereby\nI mean idiom\nless\nmean\nnow\nslash\nso\nthe thing is idiom\ntherefore\nthing\nwhat\nwith that idiom\nSee more results »\nGrammar\nHere and thereHere and there are adverbs. …\nHere and there: meaningsWhen we use here, it typically refers to the place where the speaker is, and we see the position of people and things from the speaker’s point of view: …\nHere and there with this, that, these, those (demonstratives)We often use here with nouns that have this or these before them, and there with nouns that have that or those before them: …\nHere and there after prepositionsWe can use here and there after prepositions: …\nHere and there in front positionWe can use here and there in front position, with the subject and verb inverted. The most common expressions of this type are here is x, here comes x, there is x, there goes x: …\nHere you are, there you areWe can use here you are and there you are (or, in informal situations, here you go and there you go) when giving something to someone. Here and there have the same meaning in this use: …\nHere it is!There he is!We often use here + subject pronoun + be and there + subject pronoun + be at the moment of finding or meeting someone or something we have been looking for or waiting for: …\nHere I am!People often say that they have arrived or that someone else has arrived using here + subject pronoun + be: …\nHere: on the telephonePeople often use here to identify themselves on the telephone or in voicemail messages: …\nHello there!We often use there in informal situations after hello and hi: …\nThere, their or they’re?There, their and they’re are commonly confused in English, as they sound the same. …\nDummy subjectsEnglish clauses which are not imperatives must have a subject. Sometimes we need to use a ‘dummy’ or ‘empty’ or ‘artificial’ subject when there is no subject attached to the verb, and where the real subject is somewhere else in the clause. It and there are the two dummy subjects used in English: …\nIt as a dummy subjectWe often use it as a dummy subject with adjectives and their complements: …\nThere as a dummy subjectThere operates as a dummy subject in the construction there is or there are. There is/are indicates that something or someone exists or is in a particular place or situation: …\nThere is, there’s and there areWe use there is and there are when we first refer to the existence or presence of someone or something: …\nIt to create focusWhen we use it at the beginning of a clause, the subject can go at the end of the clause and therefore be in the position of focus or emphasis (underlined): …\nThere to create focusWe can use there at the start of a clause as a type of indefinite subject. This means that we can put the actual subject at the end of the clause and so give it emphasis or focus (underlined below): …\nNoun forms of verbs to create focusIn formal writing, especially academic writing, we can use a noun form of a verb as a subject. By doing this, extra focus is given to the end of the clause. Noun phrase subjects (topics) are in bold type below; the focus of each sentence is underlined: …\nIdioms\nbe there for someone\nthere you go again\nthere and back\nthere you go\nthere's a good boy/girl/dog!\nused to express sympathy or satisfaction: There, I've finally got it working.\nSMART Vocabulary: related words and phrases\nSympathy & compassion\naw\nbad/hard/tough luck! idiom\nbetter luck next time idiom\nbleeding heart\ncheese\nheart-wrenching\nheart-wrenchingly\nheartrending\npitiful\npitifully\npitifulness\npity\npityingly\nsensitivity\nsympathetic\nsympathize\nsympathy\ntoo bad idiom\nyour heart aches idiom\nyour heart goes out to someone idiom\nSee more results »\nGrammar\nThere, their or they’re?There, their and they’re are commonly confused in English, as they sound the same. …\nIdiom\nthere, there\nthere adverb [not gradable]\n(PLACE)\nAdd to word list\nAdd to word list\nin, at, or to that place: Put the chair there. The museum was closed today, so we’ll go there tomorrow. Idioms\nthere's no (such thing as a) free lunch\nthere's no telling\nthere pronoun\n(INTRODUCING A SENTENCE)\nused to introduce sentences, esp. before the verbs be, seem, and appear: There’s someone on the phone for you. There will be plenty of time to pack tomorrow."}