{"id":361128,"name":"they","type":"pronoun","us_sound":"ðeɪ","us_link":"../audio/t/they.mp3","uk_sound":"ðeɪ","uk_link":"../audio/t/ukthera025.mp3","content":"Add to word list\nAdd to word list\nA1 used as the subject of a verb to refer to people, animals, or things already mentioned or, more generally, to a group of people not clearly described: I've known the Browns for a long time. They're very nice people. Where are my glasses? They were on the table a minute ago. They (= people who know) say things will be better in the new year.\nB1 used to refer to a person whose gender is not known or does not need to be mentioned: \"There's someone on the phone for you.\" \"What do they want?\" Everyone should do what they think is best.\nused to refer to a single person whose gender is not simply male or female: At that time Smith said that they wanted to be open about their new identity, but weren't ready to speak at length about it. The singer came out as non-binary, joining a growing number of people who use \"they/them\" as pronouns.\nMore examplesFewer examplesMy parents live down in Florida, but they come up to Chicago every summer.\"Thank you for the flowers.\" \"It's all right. I thought they might cheer you up.\"An ambulance crew was called to his home, but he was dead by the time they arrived.Most children in the UK remain in full-time education until they are at least 16 years old.Oil and water don't mix. Even if you shake them together they separate into two layers.\nSMART Vocabulary: related words and phrases\nLinguistics: personal pronouns\n'em\nhe\nher\nI, i\nit\nnumber one\npersonally\nS, s\ns/he\nshe\nthee\nthem\nthemself\nthou\nus\ny'all\nyou\nyou-all\nYours truly phrase\nyous\nSee more results »\nGrammar\nPronouns: personal (I, me, you, him, it, they, etc.)We use personal pronouns in place of noun phrases. We often use them to refer back to people and things that we have already identified (underlined): …\nSubject and object pronounsPersonal subject pronouns act as the subject of a clause. We use them before a verb to show who is doing the verb. We do not usually leave out the pronoun: …\nI, meWe use I and me to refer to the speaker or writer. I is the subject form and me is the object form: …\nYouWe use you to refer to the listener or reader. It is both the subject and the object form. You can refer to one person or more than one person. It is usually clear from the context whether you is singular or plural: …\nHe, him; she, herHe, him, she and her are singular third person pronouns. He and him are the masculine forms. She and her are the feminine forms: …\nItWe use it to refer to things: …\nWe, usWe use we and us to refer to different groups of people, but always including the speaker. We and us can refer to the speaker + the listener, or the speaker + other people but not the listener, or people in general including the speaker: …\nThey, themWe use they and them to refer to specific groups of people, things and animals: …\nPronouns: one, you, we, theyOne, you, we and they are generic personal pronouns. We can use one, you, we and they to refer to ‘people in general’. …\nOne, you and weWe can use one, you or we when we are making generalisations and not referring to any one person in particular. When used like this, one, you and we can include the speaker or writer: …\nTheyWe can use they to talk about a wide group of people, such as an authority or an institution. In such cases, they does not refer to specific people: …\nAdd to word list\nAdd to word list\nthe things or people being spoken about, who have already been mentioned: Where are my glasses? They were on the table a minute ago. They (= People who know) say we’re going to get some rain.\nThey is also used to refer to a person whose sex is not known: \"There is someone on the phone for you.\" \"What do they want?\""}