{"id":362001,"name":"thickly","type":"adverb","us_sound":"ˈθɪk.li","us_link":"../audio/t/thickly.mp3","uk_sound":"ˈθɪk.li","uk_link":"../audio/t/ukthick001.mp3","content":"thickly adverb\n(WIDELY/DEEPLY)\nAdd to word list\nAdd to word list\nin a way that makes a wide piece of something: The bread had been cut very thickly.\nin a way that covers or fills something with a deep layer of something: Dust has settled thickly on the dark wood furniture.\nMore examplesFewer examplesA customer at a restaurant sent back his french fries because they were cut too thickly.Peel, de-stone and thickly slice the peaches. Her eyelids are still thickly caked with the glitter she wears in the production.the astronaut's thickly gloved hands Perhaps the paint is spread too thickly. For two autumns in a row, acorns fell like rain from the tall oak trees, carpeting his lawn so thickly that raking seemed almost futile.\nSMART Vocabulary: related words and phrases\nThick, dense and heavy\nblocky\ncakey\nchunkily\nchunkiness\nchunky\nclaggy\ndense\ndensity\nheavily\nheaviness\nheftily\nhefty\nlumpen\nponderous\nthicken\nthickening\nthickness\nultra-heavy\nunwieldy\nweigh\nSee more results »\nthickly adverb\n(CLOSELY)\nin a way that involves many people or things that are very close together: This is a thickly wooded area.\nMore examplesFewer examples The weed grows thickly with long, ropy strands that can clog boat propellers and endanger swimmers.The countryside - thickly forested with hickory, walnut and other hardwoods - is picturesque.Mosquitoes buzz thickly around him.\nSMART Vocabulary: related words and phrases\nThick, dense and heavy\nblocky\ncakey\nchunkily\nchunkiness\nchunky\nclaggy\ndense\ndensity\nheavily\nheaviness\nheftily\nhefty\nlumpen\nponderous\nthicken\nthickening\nthickness\nultra-heavy\nunwieldy\nweigh\nSee more results »\nthickly adverb\n(WAY OF TALKING)\nin a way that shows clearly which country or part of a country someone comes from: He replies in thickly accented English.\nin a way that is not clear because someone is tired, ill or upset: 'I was asleep,' she said thickly. See\nthick\nMore examplesFewer examplesThere's been an endless convoy of thickly accented ambassadors eager to drive the music home to mainstream audiences. His thickly accented yammering, however, is occasionally unintelligible. \"Yeah\" he replied thickly, \"you know I do, it's the same for both of us.”\nSMART Vocabulary: related words and phrases\nWays of speaking\naccented\naccentual\naccentuation\naitch\narticulate\nasperity\nasyndetic\nasyndetically\nbray\nfluent\nintone\nnon-verbal\nnon-verbally\northoepy\nparalanguage\nplummy\npragmatics\npronounce\nsingsong\ntoned\nSee more results »\nAdd to word list\nAdd to word list\nmade or done so that something has a large distance between two opposite sides: thickly carpeted floors"}