{"id":362191,"name":"think","type":"verb","us_sound":"θɪŋk","us_link":"../audio/t/think.mp3","uk_sound":"θɪŋk","uk_link":"../audio/t/ukthick020.mp3","content":"think verb\n(CONSIDER)\nAdd to word list\nAdd to word list\nA1 [ I or T ] to believe something or have an opinion or idea: [ + (that) ] I think (that) I've met you before. I don't think Emma will get the job. \"Do you think (that) you could get me some stamps while you're in town?\" [ + to infinitive ] He was thought to have boarded the plane in New York. What did you think of the film? Salmon used to be thought of as expensive/a luxury. What do you think about the latest plans for improving the underground system? I think it is important to learn English. not think much of sb/sth\nto have a low opinion of someone or something: I didn't think much of her latest book.\nB2 [ I ] to consider a person's needs or wishes: She's always thinking of others.\nMore examplesFewer examplesSome people think the Church shouldn't interfere in politics.Circle the answer you think is correct.How much liquid do you think this bottle contains?I'm sure my boss thinks I've been neglecting my duties recently.The soldiers lined us up against a wall and I thought they were going to shoot us.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nNot liking\nAnalysing and evaluating\nKind & thoughtful\nthink verb\n(DECIDE)\nA2 to use the brain to decide to do something: [ + of+ -ing verb ] I'm thinking of taking up running. [ + (that) ] I think (that) I'll go swimming after lunch. I'm thinking about buying a new car.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nthink verb\n(REASON)\nB1 [ I ] to use the brain to plan something, solve a problem, understand a situation, etc.: What are you thinking, Peter? He just does these things without thinking and he gets himself into trouble. You think too much - that's your problem. I'm sorry I forgot to mention your name. I just wasn't thinking. think long and hard (also think twice)\nC1 to think very carefully about something: Think long and hard before you make any important decisions. I know it's exciting, but you should think twice before you spend that much money on a vacation. think aloud UK (US think out loud)\nto automatically say what you are thinking: \"What did you say?\" \"Oh, nothing, I was just thinking aloud.\"\nMore examplesFewer examplesWhatever she's thinking, she never lets it show.He admits that he acted without thinking.He paused and thought for a moment.We thought long and hard before sending the children away to school.Some people say that playing classical music while you work helps you think - but I find it only distracts me.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nSaying & uttering\nthink verb\n(REMEMBER)\nB1 [ I usually + adv/prep ] to remember or imagine: I was just thinking about you when you called. She was so busy she didn't think to tell me about it.\nMore examplesFewer examplesDid you think to give her your phone number?I've been thinking about my grandmother a lot recently.Do you often think about the war?\nSMART Vocabulary: related words and phrases\nImagining and conceiving\nassume\nbeyond your wildest dreams idiom\nblue-sky\nconceivable\nconceivably\nguess\nimagine\nin your mind's eye idiom\ninconceivably\nlay the foundation(s) of/for idiom\nlook on/upon someone/something as something\nmanifest\nreach\nregard\nretheorize\nrevisualization\nriot\nrun riot idiom\ntheorize\nthrow\nSee more results »\nGrammar\nThinkWe can use think to talk about having an opinion or idea. In this case, we don’t usually use the continuous form: …\nIdioms\ncouldn't think\nI can't think\nI think not\nI thought as much\nnot be thinking straight\nnot think twice\nthink again\nthink better of something\nthink big\nthink nothing of something\nMore idioms\nthink on your feet\nthink outside the box\nto someone's way of thinking\nwho would have thought it?\nPhrasal verbs\nthink ahead\nthink back\nthink for yourself\nthink of something\nthink of something/someone\nthink of/about someone/something\nthink something out\nthink something over\nthink something through\nthink something up\nhave a think UK\nto consider something for some time: Let me have a think about it before I decide. Have a think over the weekend and tell me what you've decided.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\ngrapple\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nIdiom\nhave another think coming\nthink verb\n(HAVE OPINION)\nAdd to word list\nAdd to word list\n[ I/T ] to have or to form an opinion or idea about something: [ T ] \"Do you think this is the right address?\" \"I don’t think so.\" [ I ] It doesn’t make much sense when you think about it. [ I/T ] Cloning animals has happened sooner than anyone thought (it would). [ T ] I always thought he was a bit weird. [ I ] What do you think of my new hat? [ I ] I’ll always think of him as someone I can rely on. [ + (that) clause ] I think (that) I’d better go now. I still think of myself as (= believe I am) her friend.\nthink verb\n(USE REASON)\n[ I ] to use your mind to understand matters, make judgments, and solve problems: I’ll have to think about this. She was thinking about running for the Senate. I can’t think of anything to say right now.\nthink verb\n(REMEMBER)\n[ I always + adv/prep ] to remember or imagine: I can’t stop thinking about her. I can picture her, I just can’t think of her name. Think back to the early days of the Civil War.\nIdioms\nnot think much of someone/something\nnot think straight\nthink better of something\nthink for yourself\nthink long and hard\nthink nothing of something\nthink on your feet\nthink the world of someone/something\nthink twicePhrasal verbs\nthink something over/through\nthink up something\nAdd to word list\nAdd to word list\nto have a particular idea, belief or opinion: think (that) Some analysts think that rates will continue to rise. I think the figures speak for themselves. Have you seen the new ad? What do you think?\nto consider something in your mind: He thought for a moment, and then agreed.think about sth She was thinking about whether to take the job.\nthink big\nto have plans to be very successful or powerful: Even small companies need to think big.\nthink on your feet\nto make a quick decision or give an answer quickly: The ability to think on your feet is essential for this position.\nthink out of/outside the box\nto think using your imagination and having new ideas instead of traditional or expected ones: Thinking outside the box could be enough to put a business ahead of its competitors.\nthink twice\nto think very carefully about something before taking a decision: think twice about sth/about doing sth/before doing sth High fuel prices had caused car buyers to think twice about buying full-size sport utility vehicles.\nPhrasal verbs\nthink sth of sth/sb\nthink sth out\nthink sth over"}