{"id":362210,"name":"thinness","type":"noun","us_sound":"ˈθɪn.nəs","us_link":"../audio/t/usb01745.mp3","uk_sound":"ˈθɪn.nəs","uk_link":"../audio/t/ukb01745.mp3","content":"thinness noun [U]\n(NOT FAT)\nAdd to word list\nAdd to word list\nthe quality of having little flesh on the bones: The author discusses why female beauty has become linked to thinness.\nMore examplesFewer examplesAt its most extreme, the obsession with thinness can cause eating disorders. They hope for a time when good health, not extreme thinness, is the ideal among various cultures. He felt the painful thinness of her upper arm. The thinness of his face and the jutting of his cheekbones suggest hunger.\nSMART Vocabulary: related words and phrases\nAnimal physiology: thin or slender (of people)\nbe as thin as a rake phrase\nbe skin and bone(s) idiom\nectomorph\nemaciated\nemaciation\ngauntly\ngauntness\nhollow\nhollow-cheeked\nlithe\nraw-boned\nscrawny\nskinny\nslight\nslimness\nsparely\nsylphlike\nultra-thin\nwasted\nwirily\nSee more results »\nthinness noun [U]\n(NOT WIDE)\nthe quality of having a small distance between two opposite sides: The thinness of the walls meant you could hear everything.\nMore examplesFewer examplesThe slices of rock are polished to a thinness of less than a millimetre. The abnormal thinness of the eggshells was evident when ornithologists compared them with other specimens.The comparative thinness of the blade makes it quite easy to cut in tight curves. They were surprised by the thinness of the pillows in their hotel room. The smallness of the house and thinness of the walls brought everything so close to her.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nthinness noun [U]\n(NOT MUCH)\nthe quality of having only a small number of people or a small amount of something: The thinness of the audience doesn't do justice to the quality of the show. the thinness of his hair\nMore examplesFewer examplesThey underlined the thinness of support for him among religious and social conservatives.He also said the dossier should have made clear the thinness of the evidence on which the claim was based.\nSMART Vocabulary: related words and phrases\nSmall in number and quantity\nbeggarly\nbelow\nbupkis\ncertain\ncould count something on (the fingers of) one hand idiom\nlimitedness\nmeasly\nmild\nmildness\nmingy\nminimal\nonly so much/many idiom\npiffling\nremote\nscantly\nslenderly\nspeak\nstrength\nsuggestion\nthin\nSee more results »\nthinness noun [U]\n(POOR QUALITY)\nthe quality of being of a poor standard or not good enough to be effective: the thinness of the singer's voice\nMore examplesFewer examplesThe play's crucial fault is the thinness of those characters, who mostly come off as sentimental clichés.On the ballads, it was hard to disguise the thinness of the voice. The thinness of much of his work results from his inexperience.How did he convince himself that, despite the thinness of his résumé, he could somehow get the top job?\nSMART Vocabulary: related words and phrases\nNot of good quality\nappallingly\natrocious\natrociously\nawfully\nawfulness\nbadness\ndownscale\ninadequacy\ninadequate\ninadequately\njanky\nmeretriciously\nshite\nsort\ntawdrily\ntawdriness\ntawdry\nthird-class\ntrinket\nwretched\nSee more results »\nthinness noun [U]\n(OF LIQUID)\nthe quality of flowing easily or containing a lot of water: The thinness of the liquid made it easy to pour.\nMore examplesFewer examplesI was disappointed by the thinness of the sauce.Because of the paint's thinness, it ran everywhere.\nthinness noun [U]\n(OF AIR)\n(of air) the quality of containing less oxygen than usual: The thinness of the air can make you feel breathless.\nMore examplesFewer examplesThe lack of friction due to the thinness of the air will mean he can attain a much higher terminal velocity.\nSee\nthin"}