{"id":362759,"name":"those","type":"determiner","us_sound":"ðoʊz","us_link":"../audio/t/those.mp3","uk_sound":"ðəʊz","uk_link":"../audio/t/ukthirt022.mp3","content":"Add to word list\nAdd to word list\nA1 plural of\nthat\nExamples\nCan I help you with those bags?If you add those four figures up, it comes to over £500.It is surely the duty of the stronger members in a society to help those who are weak.Don't keep all those chocolates to yourself - pass them around.In those days it was considered not quite proper for young ladies to be seen talking to men in public.\nSMART Vocabulary: related words and phrases\nQuoting & making references\nallude to someone/something\nallusion\nallusiveness\nas for someone/something idiom\nbandy\nbandy something around\nbring\nen passant\nfurther\nhark\nindirect speech\nquotable\nquotably\nquote\nquote... unquote idiom\nrefer to someone/something\nreference\nreferent\nreported speech\ntouch\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIsolating and separating\nLearning & knowing\nGrammar\nThis, that, these, thoseThis, that, these and those are demonstratives. We use this, that, these and those to point to people and things. This and that are singular. These and those are plural. We use them as determiners and pronouns. …\nThis, that, these, those as determinersWe use this and that with singular and uncountable nouns: …\nThis, that, these, those as pronounsWe normally use this, that, these and those as pronouns to refer to things or ideas: …\nThis and these, that and those: usesWe use this and these most commonly to point to things and people that are close to the speaker or writer, or things that are happening now: …\nSubstitution with that, thoseIn formal contexts, we can use that and those as substitutes meaning ‘the one(s)’: …\nAdd to word list\nAdd to word list\npl of that : Those of you who would like to come with us should sign up now. Those houses are huge. Idiom\nthose were the days"}