{"id":362763,"name":"thought","type":"verb","us_sound":"θɑːt","us_link":"../audio/t/thought.mp3","uk_sound":"θɔːt","uk_link":"../audio/t/ukthirt026.mp3","content":"Add to word list\nAdd to word list\npast simple and past participle of\nthink\nB1 the act of thinking about or considering something, an idea or opinion, or a set of ideas about a particular subject: Ask me again tomorrow. I'll have to give it some thought. She doesn't give any thought to her appearance. Let me have your thoughts on that report by Friday. Spare a thought for (= think about) all those without shelter on a cold night like this. He's the author of a book on the history of European thought. You sent her a card? That was a kind thought. Synonyms\nconcept\nconception\nconstruct formal\nidea (KNOWLEDGE)\nnotion\nThesaurus: synonyms, antonyms, and examples\nan ideaideaI've got an idea - why don't we ask John for help?planThe plan is to hire a car when we get there.thoughtHave you had any thoughts on presents for your mother?suggestionHave you got any suggestions for improvements?brainwaveUK I wasn't sure what to do and then I had brainwave - I could ask Anna for help.brainstormUS She was stuck until she had a brainstorm and the solution came to her.\nSee more results »\nThesaurus: synonyms, antonyms, and examples\na suggestionsuggestionMay I make a suggestion? Keep your receipts for tax reimbursement.proposalThe proposal for a new stadium has been rejected.propositionHe wrote to me with a very interesting business proposition.thoughtI've had a thought about what we might do this summer.ideaRebecca has a few ideas about how we could improve things.motionThere is a motion before the assembly to adjourn the meeting.\nSee more results »\nMore examplesFewer examplesThe thought suddenly flashed through my mind that she didn't want to be here.To be honest, the thought of jumping out of a moving plane makes my hair stand on end.My thoughts flow more easily if I work on a word processor.He took a minute or two to compose his thoughts before he replied.The thought of kissing him made me go weak at the knees.\nSMART Vocabulary: related words and phrases\nThinking and contemplating\na brown study idiom\nagonize\nagonize over/about something\nbeard-stroking\nbethink\nharbour\nin the cold light of day idiom\nintrospect\nintrospection\njoined-up thinking\nlateral thinking\nnavel\nreckon\nreflection\nreweigh\nrumination\nrun through someone's mind/head idiom\nscratch your head idiom\nself-contemplation\nweigh\nSee more results »\nIdioms\ngather/regather your thoughts\nit's the thought that counts\nthat's a thought\nthe thought crosses someone's mind\nwith no thought for something\nthought\n(THINK)\nAdd to word list\nAdd to word list\npast simple and past participle of think\nthought noun [C/U]\n(THINKING)\nthe act of thinking about something to form ideas and opinions, or an idea or opinion produced by thinking: [ U ] I have given this matter considerable thought. [ C ] Do you have any thoughts on what we should do now? [ C ] That fact never entered my thoughts. [ U ] His early religious training helped to shape his thought. [ C ] It’s just a thought, but since it’s such a beautiful day, why don’t we go for a drive? [ U ] The very thought of standing up in front of an audience scares me to death."}