{"id":362887,"name":"threatened","type":"adjective","us_sound":"ˈθret.ənd","us_link":"../audio/t/cdo1121usthre4225.mp3","uk_sound":"ˈθret.ənd","uk_link":"../audio/t/cdo1121ukthre4143.mp3","content":"Add to word list\nAdd to word list\nin danger, or likely to stop existing: The Congo rainforest is one of the world's most threatened ecosystems. The panda is the best known of our threatened species. People do not realize how very threatened these landscapes that we cherish are.\nused to describe something unpleasant or bad that someone has said might happen: The police reported 932 incidents of actual or threatened violence in this period. The threatened strikes by airport check-in staff and baggage handlers have been called off.\nfeeling that something bad might happen, or that someone might do something bad to you: There should be proper policing so children can walk home from school without feeling threatened. Under the stress of questioning, he would have felt very threatened and been likely to make untrue admissions.\nfeeling that someone or something might cause you to be less respected or less admired, or cause you to lose your authority or position: Doctors shouldn't feel threatened by their patients asking for a medicine by name. At that time the church was feeling very threatened and uncomfortable with non-religious society. \"Why are you so threatened by my ideas?\" he asks.\nMore examplesFewer examplesFive threatened species, including chinook salmon and bald eagles, might also be in the way of the nine-mile pipeline project.This is why the small family farm is so threatened - it can never be as efficient or produce milk as cheaply as a larger farm with hundreds of cows.Funds intended for product development were spent on delivering ridiculous pay deals to buy off threatened strikes.He got wind of a threatened attack.She feels very threatened by the idea of convicted terrorists being released.The suit alleged he felt so threatened in terms of his own and his family's safety that he was unable to return to work. Some of the insecure students may feel threatened, inferior or even aggressive.Many myths about women have been dreamed up by threatened men.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPossible and probable\nAfraid\nUnsafe and insecure\nAnxious and worried\nEnvy and jealousy"}