{"id":362865,"name":"threading","type":"noun","us_sound":"ˈθred.ɪŋ","us_link":"../audio/t/cdo0318usthre5061.mp3","uk_sound":"ˈθred.ɪŋ","uk_link":"../audio/t/cdo0216threuk2058.mp3","content":"threading noun [U]\n(HAIR REMOVAL)\nAdd to word list\nAdd to word list\na method of removing hair from the face using a long piece of thread: eyebrow threading Threading, the removal of unwanted facial hair, has been practiced in parts of Los Angeles for decades.\nJohnrob/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThreading is the primary method of brow grooming in South Asia.Threading is a less traumatic process than waxing, since it won't pull on or burn the skin.Women flock to the salon to get facials, and have Kaur shape their brows by \"threading\" - pulling hairs using cotton thread.\nSMART Vocabulary: related words and phrases\nBeauty treatments\naesthetic\naesthetician\nbeautician\nbeauty\nbeauty salon\nelectrolysis\nexfoliation\neye mask\nfake tan\nfiller\nFrench manicure\nFrench tip\nmicroneedling\nnail art\nrasul\nsauna\nself-tan\nserum\nsunbathe\nsunbed\nSee more results »\nthreading noun [U]\n(OF MESSAGES)\ncomputing\n&#160; specialized the process of arranging a series of emails, text messages, or internet posts so that connected messages dealing with the same subject follow each other in a group: One notable feature of the system is the conversation threading, which groups emails into conversations for easier reading.\nMore examplesFewer examplesThreading is where messages sent in reply to a topic or other messages can be referenced back to the original.The program also has an integrated discussion area with full threading.The interface does conversation threading, saved searches, &amp; lots more.There are some interesting features, including threading and excellent search and filtering capabilities.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\ntick box\ntimesharing\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternet terminology"}