{"id":362885,"name":"threaten","type":"verb","us_sound":"ˈθret.ən","us_link":"../audio/t/threaten.mp3","uk_sound":"ˈθret.ən","uk_link":"../audio/t/ukthoug010.mp3","content":"Add to word list\nAdd to word list\nB2 [ T ] to tell someone that you will kill or hurt them or cause problems if they do not do what you want: They threatened the shopkeeper with a gun. [ + to infinitive ] They threatened to kill him unless he did as they asked.\nC1 [ T ] to be likely to cause harm or damage to something or someone: Changing patterns of agriculture are threatening the countryside.\nC2 [ I ] If something bad threatens to happen, it is likely to happen: Look at those clouds! There's a storm threatening.\nMore examplesFewer examplesGreenpeace works to promote awareness of the dangers that threaten our planet today.Britain threatened to break off diplomatic relations.A masked robber threatened the bank staff with a gun.They threatened to blow up the plane if their demands were not met.She's threatening to take me to court for not paying the bill on time.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDamaging and spoiling\nPossible and probable\nthreaten verb\n(PROMISE TO HURT)\nAdd to word list\nAdd to word list\n[ I/T ] to tell someone that you will hurt or harm him or her, esp. if the person does not do something in particular: [ I ] They threatened to drop him from the team if he didn’t come to practice. [ T ] Don’t threaten me!\nthreaten verb\n(WARN OF POSSIBILITY)\n[ T ] to warn of something unpleasant or unwanted: She threatened legal action against the newspaper. Because of continuing drought, millions are threatened with starvation."}