{"id":362883,"name":"threat","type":"noun","us_sound":"θret","us_link":"../audio/t/threat.mp3","uk_sound":"θret","uk_link":"../audio/t/ukthoug009.mp3","content":"Add to word list\nAdd to word list\nB2 a suggestion that something unpleasant or violent will happen, especially if a particular action or order is not followed: [ + to infinitive ] Her parents carried out their threat to take away her mobile phone if her grades didn't improve.threat of The threat of jail failed to deter him from petty crime.pose a threat to Drunken drivers pose a serious threat (= cause a lot of harm) to other road users.empty threat He says he'll tell the authorities but it's just an empty threat (= it will not happen). be under threat of something\nto be in a situation where people are threatening you or something else with something bad or unpleasant: She left the country under threat of arrest if she returned.\nSee more\nMore examplesFewer examplesNuclear weapons pose a threat to everyone.The police have to take any terrorist threat seriously.It is hoped that the kidnappers will not carry out their threat to kill the hostages.Three main line railway stations were closed because of bomb threats.The key witness for the prosecution was offered police protection after she received death threats.\nSMART Vocabulary: related words and phrases\nDangers and threats\nbalefully\nbaneful\nbanefully\nblack spot\nhang\nhang over something\nhazard\nhazardous\nhazardously\nnon-lethal\non/under pain of death idiom\nor else idiom\nparlous\nparlously\nsomeone's bark is worse than his/her bite idiom\nthreateningly\ntombstoning\ntreacherously\ntriple threat\nultra-hazardous\nSee more results »\nthreat noun\n(PROMISE TO HURT)\nAdd to word list\nAdd to word list\n[ C ] a statement that someone will be hurt or harmed, esp. if the person does not do something in particular: She was fired after making threats to her co-workers.\nthreat noun\n(UNWANTED POSSIBILITY)\n[ C/U ] the possibility that something unwanted will happen, or a person or thing that is likely to cause something unwanted to happen: [ U ] A threat of rain is in today’s forecast. [ U ] The boundary dispute raised the threat of war."}