{"id":363152,"name":"throwaway","type":"adjective","us_sound":"ˈθroʊ.ə.weɪ","us_link":"../audio/t/throwaway.mp3","uk_sound":"ˈθrəʊ.ə.weɪ","uk_link":"../audio/t/ukthroa015.mp3","content":"Add to word list\nAdd to word list\nmade to be destroyed after use: We live in a throwaway society (= one in which things are thrown away as soon as they have been used). throwaway comment/line/remark/etc.\nsomething that someone says without thinking carefully and is not intended to be serious: It was just a throwaway remark - I didn't mean for anyone to take it seriously.\nSee more\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreclamation\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nAdd to word list\nAdd to word list\ndesigned to be used only once and then gotten rid of: Throwaway cameras are light, compact, cheap, and simple.\nAdd to word list\nAdd to word list\nCOMMERCE, MARKETING, ENVIRONMENT throwaway goods, products, etc. are designed and marketed in a way that encourages people to keep replacing them: Much of China's emissions come from manufacturing throwaway products for the west. A fundamental change in consumer attitudes to the throwaway culture is the only way forward.\nCOMMERCE used to describe a price that is very low: Analysts warned that expecting to buy hi-tech products at increasingly throwaway prices would eventually cause us all problems. See also\ngiveaway adjective\nused to describe something that someone says without thinking carefully about whether it might be offensive to anyone: throwaway comment/remark He faced disciplinary action because of a throwaway comment about a colleague.\nthrowaway society disapproving\nENVIRONMENT the modern world in which many goods are disposable and create waste: The developed world has become an increasingly throwaway society."}