{"id":363515,"name":"ticket","type":"noun","us_sound":"ˈtɪk.ɪt","us_link":"../audio/t/ticket.mp3","uk_sound":"ˈtɪk.ɪt","uk_link":"../audio/t/ukthund029.mp3","content":"ticket noun [C]\n(PROOF OF PAYMENT)\nAdd to word list\nAdd to word list\nA1 a small piece of paper or card given to someone, usually to show that they have paid for an event, journey, or activity: a concert ticket a train/bus/plane ticket a lottery/raffle ticket a ticket office a ticket collector\nYevhenii Dubinko/iStock/Getty Image Plus/GettyImages\nMore examplesFewer examples\"Thank you, \" replied the ticket collector mechanically as he took each ticket.How much is a one-way ticket to New York?Each ticket admits one member and one guest.The theatre tickets were sold out, so we waited to see if there were any cancellations .If you've come to buy tickets for tonight's performance, please join the queue.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\nhalf\nhall pass\npass\nrain check\nreturn fare\nreturn ticket\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBills & invoices\nticket noun [C]\n(PRICE CARD)\na piece of card or paper that is put on an object to show its size or price: a price ticket\nIPGGutenbergUKLtd/iStock/Getty Images Plus/GettyImages\na note telling you that you must pay some money as a punishment for not obeying a rule or law: a parking ticket\nSMART Vocabulary: related words and phrases\nCosts & expenses\nairfare\naliment\nall in\nblue book value\nbook value\ncarriage\ncarrying charge\nexpenditure\nfee\nflat rate\ngate money\npurchasing power\nSP\nspecial offer\nstarting price\nsticker price\nsunk cost\nsurcharge\ntime is money idiom\ntransfer fee\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nPunishing & punishments\nticket noun [C]\n(POLITICS)\nmainly US a list of the people representing a particular political party in an election: the Republican/Democratic ticket In this election there will definitely be a woman on the Democratic ticket. Bush and Cheney won re-election in 2004 against a Democratic ticket of John Kerry and John Edwards.\nmainly US the policies that are supported by a political party or a person competing in an election: The President was elected on a ticket of restoring the rule of law. Twice he stood for parliament on an educational reform ticket.\nSMART Vocabulary: related words and phrases\nElections\nabsentee\nabsentee ballot\nabsentee vote\nabsentee voter\nabsentee voting\nentrance poll\nexit poll\nfirst-past-the-post\nflip\nfranchise\nprimary\nproportional representation\nproxy\nproxy vote\nproxy voter\nvote of no confidence\nvote something through\nvoting\nvoting booth\nvoting machine\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInternational relations: United States politics & government\nVoters & candidates in elections\nticket noun [C]\n(REQUEST)\na request sent online or by phone for help with a problem with a website, computer system, etc.: If you still need assistance after reading the information in this section, simply raise a ticket in the CONTACT US section of the website. Two weeks ago I put in a ticket asking if I could change my caller ID. They are pretty good about replying to you if you have emailed them and/or opened a ticket.\nSMART Vocabulary: related words and phrases\nMaking appeals & requests\nadjuration\nappellate\napply for something\napply to\nappreciate\nask a lot\nbesiege\ncar wash\ncry\nentreat\nentreaty\nimportunately\nimportunity\ninvite\ninvocation\nleech\nout with it! idiom\npush\nscrounge\nseek\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nOperating computers\nIdiom\njust the ticket\nto sell tickets for an event; to provide someone with a ticket: Only passengers who were ticketed on that particular flight will receive a refund.UK It's an all-ticketed game.\nUS to give a ticket to someone who has broken a traffic law: Charles was ticketed for speeding.\nSMART Vocabulary: related words and phrases\nTickets\naccommodation\napex\nboarding pass\ncoach class\ne-ticket\nhalf\nhall pass\npass\nrain check\nreturn fare\nreturn ticket\nround fare\nround-trip ticket\nseason ticket\nsingle\nstandby\nsupersaver\nticketing\nticketless\ntimed ticket\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBills & invoices\nPunishing & punishments\nticket noun [C]\n(PROOF OF PAYMENT)\nAdd to word list\nAdd to word list\na small card that shows that the person holding it has paid for an activity: an airline/train ticket a movie/concert/theater ticket Have you bought your ticket yet?\nticket noun [C]\n(LEGAL NOTICE)\nan official piece of paper that tells someone that a traffic law has been broken: a speeding/parking ticket Carla got a ticket for making a U-turn on a bridge.\nticket noun [C]\n(POLITICAL GROUP)\na group of people from one political party who are trying to get elected at one time: She’s running on the Democratic and Independent tickets.\nticket verb [T]\n(GIVE LEGAL NOTICE)\nto give a ticket to someone who has broken a traffic law: Charles was ticketed for speeding.\nAdd to word list\nAdd to word list\nTRANSPORT, COMMERCE a printed piece of paper or card which shows that you have paid to go on a trip, see a film, go to an event, etc.: Customers who buy their tickets online will receive a 10% discount. The tickets sold out within minutes.a ticket to sth Two tickets to a Broadway show are included in the price.a ticket for sth Tickets for the concert go on sale tomorrow. Fans worry that the club's new owners will raise ticket prices. The show has already made €2m in advance ticket sales. ticket office/counter/machine Tickets can be purchased online or from the ticket office at the station. bus/plane/train ticket cinema/concert/theatre ticket advance/season ticket cheap/discounted/free ticket non-refundable/refundable tickets\nCOMMERCE a piece of card put on clothes, furniture, or other goods in stores which shows the price, size, and other details: Check the price on the ticket.\nPOLITICS\n&#160; US two or more politicians that the public can vote for together in an election: on the ticket They hope that having her on the ticket will appeal to women voters.\nSee also\ne-ticket\none-way\nreturn ticket\nseason ticket\nLAW, TRANSPORT if a police officer, etc. tickets a person or their vehicle, they give or send a piece of paper saying the person must pay money because of an offence they have committed: The number of drivers ticketed for speeding offences increased again last year. He has authority to ticket vehicles with expired tax stickers parked on his land."}