{"id":363525,"name":"ticking","type":"noun","us_sound":"ˈtɪk.ɪŋ","us_link":"../audio/t/cdo1121ustick4235.mp3","uk_sound":"ˈtɪk.ɪŋ","uk_link":"../audio/t/cdo1121uktick4151.mp3","content":"ticking noun [U]\n(MATERIAL)\nAdd to word list\nAdd to word list\nfabrics &amp; fashion\n&#160; specialized a strong cotton material, usually with stripes, that is used to cover bed mattresses (= that you lie on) or pillows (= that you lay your head on): The mattresses and ticking for them were ordered from a local maker.\nMore examplesFewer examplesTheir house preserves the authenticity of the early 20th century - mattress ticking is a theme for the master bedroom.The room had twin beds with bedheads covered in a nautical print and striped ticking cushions.We sell old-fashioned goods such as enamel milk pans and authentic ticking eiderdowns.Recently the artist has turned to cloth, remaking older works and creating new ones in materials such as mattress ticking or striped cotton towelling.\nSMART Vocabulary: related words and phrases\nTextiles made from natural fibres\nbamboo\nbombazine\nburlap\ncalico\ncambric\ndimity\ndistaff\nfaille\nfelt\nfishnet\nmuslin\nnankeen\nneedlecord\nnetting\noilskin\nshearling\nterry\ntowelling\ntulle\ntweed\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeds & parts of beds\nticking noun [U]\n(SOUND)\nthe repeated short sound made by clocks and watches, or the action of making this sound : ticking of The only sound in the room was the loud ticking of the clock on the mantelpiece. He thought he heard ticking coming from the device. See also\nbox ticking\nMore examplesFewer examplesThe general silence makes the smallest noise seem meaningful - the turning of pages, the ticking of a clock or the rustling of fabric.I lay listening to the ticking of the grandfather clock, whispering away the minutes.\nSMART Vocabulary: related words and phrases\nSounds made by objects, movement or impact\nbang around\nbong\nburble\nchoo-choo\nchuff\nclick away\nclicker\nclinking\ncrunch\nplop\nresonance\nsplat\nsplutter\nsputter\nsqueak\ntintinnabulation\ntoot\nunsounded\nwhirr\nwhite noise\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nWatches & clocks"}