{"id":363660,"name":"tie","type":"verb","us_sound":"taɪ","us_link":"../audio/t/tie.mp3","uk_sound":"taɪ","uk_link":"../audio/t/uktickl017.mp3","content":"tie verb\n(FASTEN)\nAdd to word list\nAdd to word list\nB1 [ I or T ] to fasten together two ends of a piece of string or other long, thin material, or to (cause to) hold together with a long, thin piece of string, material, etc.: Could you tie this piece of string for me? This skirt ties at the waist. She tied the ribbon tightly in a bow/knot. I tie my hair back when it's hot. Tie (up) your shoelaces, or you'll trip over them. tie sb to something/someone\n[ often passive ] to force someone to stay in a place: I felt tied to the job while I had a mortgage to pay. Her job ties her to the east coast.\nMore examplesFewer examplesWe tied balloons and streamers to the ceiling ready for the party.A sailor threw a rope ashore and we tied the boat to a post.She wrapped the present and tied it with ribbon.With his feet tied together he could only move in little hops.Where's the cord that ties back the curtains?\nSMART Vocabulary: related words and phrases\nFastening and tying\nanchor\nbale\nbe locked together idiom\nbelay\nbind\nboard something up\nbound\nbowline\nhalf hitch\nharness\nhobble\nhogtie\nknotted\nstake\nstrap someone in\nstrap something up\nstrop\ntack\ntape something up\ntether\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLack of freedom to act\ntie verb\n(RELATE)\n[ T ] to relate to or connect to: Is the allergy tied to dairy products, for example? Can you tie his behaviour up with anything that's happened recently? The Republicans are trying to tie the funding up with this bill.\nSMART Vocabulary: related words and phrases\nLinking and relating\naffiliated\nAL\nappertain to something\napplicable\naround\ncollateral\necosystem\nequation\nincestuously\ninterconnect\ninterconnected\ninterconnectedness\ninterconnection\nrecoupling\nrelatability\nrelatable\nrelate\nrelate to someone/something\nrelatedly\nweld\nSee more results »\ntie verb\n(FINISH EQUAL)\n[ I ] to finish at the same time or score the same number of points, etc. in a competition as someone or something else: Jane and I tied (for first place) in the spelling test. We tied with a team from the south in the championships.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and being defeated\nIdioms\ntie someone (up) in knots\ntie the knot\ntied to your mother's/wife's apron stringsPhrasal verbs\ntie someone down\ntie (someone/something) down\ntie (something) in\ntie (something) in with something\ntie someone up\ntie something up\ntie noun [C]\n(FASTENING)\nA2 (US also necktie) a long, thin piece of material that is worn under a shirt collar, especially by men, and tied in a knot at the front: He always wears a jacket and tie to work.\nKrisztián Fodi/EyeEm/GettyImages\nany piece of string, plastic, metal, etc. that is used to fasten or hold together something: Can you see the ties for the rubbish bags in the cupboard?\nMore examplesFewer examplesMost evenings there's a party and the dress code is strict - black tie only.He loosened his tie.He wasn't wearing a tie and his shirt was open at the neck.Do you suppose it would be offending against good taste to wear a patterned tie with my striped shirt?Giulio was looking quite presentable in a suit and tie.\nSMART Vocabulary: related words and phrases\nHats & scarves\nascot\nbalaclava\nbandana\nbaseball cap\nbeanie\ncycle helmet\ndeerstalker\ndicky bow\ndo-rag\ndunce's cap\nkippa\nmask\nmillinery\nmitre\nmortarboard\ntopee\ntopper\ntoque\ntrencher\ntrilby\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nFastening and tying\ntie noun [C]\n(CONNECTION)\nties C2 [ plural ]\nthe friendly feelings that people have for other people, or special connections with places: Family ties are weaker if you move a long way away. I no longer feel any ties with my home town. He urged governments worldwide to break diplomatic ties with the new regime.\nMore examplesFewer examplesThey're a worrying political party because of their close ties with terrorist groups.We must grasp every opportunity to strengthen economic ties with other countries.He believes that Europe must create closer ties or it will perish.The company has severed its ties with its previous partners.The organization's aim is to strengthen the cultural ties between Britain and Germany.\nSMART Vocabulary: related words and phrases\nRelationships: general words\naffiliative\nbromance\ncommunion\ndalliance\ndate night\ninterpersonal\ninterpersonally\nintimately\ninvolved\nkinship\nplatonic\nplatonically\nprivity\nre-establish\nreconnect\nrelationship\nsocial life\nsteady\nunromantic\nwell connected\nSee more results »\ntie noun [C]\n(EQUAL FINISH)\nC2 a situation in which two or more people finish at the same time or score the same number of points: It's a tie for first place. They have changed the scoring system because there have been too many ties.\nSMART Vocabulary: related words and phrases\nWinning, losing & scoring in sport\naet\nagainst the run of play idiom\nbag\nblow someone away\nboss\nbreak your duck idiom\nclose-run\nconcede\nequalizer\npromedios\npull\npull back\nreel something off\nrelegation zone\nromp\nscore\nshutout\nstraight\nstrike\ntreble\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nLosing and being defeated\ntie verb\n(FASTEN)\nAdd to word list\nAdd to word list\n[ I/T ] to fasten together two pieces of string or other long, thin material, or to hold together with string, rope, etc.: [ I ] This dress ties at the back. [ T ] She tied the ribbon in a bow/knot.\ntie verb\n(FINISH EQUAL)\n[ I ] to finish at the same time or score the same number of points as someone or something else in a competition: Jane and I tied for first place. The score is tied (up) at 3 to 3. Idiom\ntie the knotPhrasal verbs\ntie something in with something\ntie something to something\ntie someone to something\ntie down someone/something\ntie down someone\ntie up something\ntie up something\ntie noun [C]\n(connection)\na connection or relationship between people, or a connection a person has with a place, interest, activity, etc.: a tie to the past Gray had close ties with other powerful politicians. He is a businessman and developer with strong ties to Beijing.\ntie noun [C]\n(PIECE OF MATERIAL)\n(also necktie) a long, thin piece of material worn esp. by men which fits under a shirt collar, is tied in a knot, and hangs down the front of the shirt: a silk tie\n(also necktie) A tie is also any piece of string, plastic, etc., used to hold together something: Can you find the ties for the garbage bags?\ntie noun [C]\n(EQUAL FINISH)\nthe fact of finishing at the same time or scoring the same number of points as someone or something else in a competition: It’s a tie for first place.\nAdd to word list\nAdd to word list\n[ T ] to connect two things in a way that limits other possibilities: tie sth to sth We now have the option of tying funding to environmental conditions. Pay and promotions in the organization are tied to performance.tie sb to sth Many of the bank's employees were tied to their jobs because they were worried about losing their pension schemes.\n[ I or T ] to have the same score or level in a game, competition, or comparison, or to make the scores the same: tie for first/second/last, etc. place Frederick and Fairfax counties each reported 4.2% job growth, tying for 18th place in the US as a whole.tie the score/record The temperature in the afternoon hit 97 degrees, tying the record for June 2. Phrasal verbs\ntie in\ntie sb in\ntie sb into sth\ntie sth up\ntie sb up\ntie up with sb/sth\n[ C, usually plural ] a personal or financial connection or relationship between people, organizations, countries, etc.: ties with sb/sth He makes no apologies for his ties with the failed bank. The two leading bidders have close ties with American media groups.break/cut/sever ties One of the world's biggest hotel operators severed its ties with the popular travel website. diplomatic/economic/political ties The president urged governments worldwide to break diplomatic ties with the oppressive regime.\n[ C ]\n&#160; WORKPLACE\n&#160; ( US also necktie) a long thin piece of material that is worn under a shirt collar, especially by men, and tied in a knot at the front: Men are expected to wear a suit and tie in the office."}