{"id":363756,"name":"tighten","type":"verb","us_sound":"ˈtaɪ.tən","us_link":"../audio/t/tighten.mp3","uk_sound":"ˈtaɪ.tən","uk_link":"../audio/t/uktickl026.mp3","content":"Add to word list\nAdd to word list\nB2 to become tighter or to make something become tighter, firmer, or less easy to move: Tighten the straps so they don't rub. As he struggled, the ropes tightened even more.\nMore examplesFewer examplesCarefully tighten the clamp until it firmly supports the pipette in a vertical position.I tightened the knots and prepared to descend.If we tighten the rope, it might reach across.The dry atmosphere tightens my skin.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight\ntight-fitting\ntighten something up\ntightly\ntightness\nSee more results »\nIdioms\ntighten your belt\ntighten the netPhrasal verbs\ntighten something up\ntighten (something) up\ntighten verb\n(CONTROL)\nAdd to word list\nAdd to word list\n[ T ] to strongly control something: Security was tightened at US embassies around the world. The government moved to tighten the rules on toxic substances in the air. [ M ] Our team will have to tighten up its defense if we want to win.\ntighten verb\n(LIMIT)\n[ T ] to make something less easily available: The government plans to tighten credit and slow the growth of the money supply.\ntighten verb\n(MAKE FIRMER)\n[ I/T ] to make something tighter, firmer, or less easy to move: [ T ] You’ve got to tighten the laces of your ice skates. [ I ] His arms tightened around her.\nIdiom\ntighten your belt\nAdd to word list\nAdd to word list\nGOVERNMENT, LAW\n&#160; (also tighten up) to make a rule, system, or law stronger and more difficult to ignore: tighten controls/rules/regulation There were renewed calls to tighten controls on imported products.\nECONOMICS, FINANCE limiting the amount of money that people and companies are able to borrow or spend, for example, by increasing interest rates: Central banks were expected to respond by tightening monetary policy.\nECONOMICS, COMMERCE if a market tightens, there becomes less of something available than is wanted or needed: The global market for nurses is tightening.\ntighten your belt\nto spend less money than usual for a period of time because you do not have as much money: The major supermarkets have started a price war as customers tighten their belts. See also\nbelt-tightening Phrasal verb\ntighten up on sth"}