{"id":363775,"name":"tightness","type":"noun","us_sound":"ˈtaɪt.nəs","us_link":"../audio/t/usthund030.mp3","uk_sound":"ˈtaɪt.nəs","uk_link":"../audio/t/uktickl028.mp3","content":"tightness noun [U]\n(UNCOMFORTABLE)\nAdd to word list\nAdd to word list\nthe quality of fitting the body too closely: the tightness of the waistband\nan uncomfortable feeling of pressure in the chest, throat, or a muscle: One of the typical symptoms of anxiety is a feeling of tightness in the chest.\nthe quality of looking or sounding as if you are angry, frightened, or nervous, and not relaxed: There was a strange tightness in her voice.\nMore examplesFewer examplesOne defendant complained about the tightness of his handcuffs.Her mother would criticize the tightness of her skirt.This exercise relieves lower-back tension and tightness. He had to stop playing because of tightness in his right hamstring.Common asthma symptoms include cough, wheezing, tightness in the chest, and shortness of breath. There was a sudden tightness in his throat and he almost gagged.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAnxious and worried\ntightness noun [U]\n(FIRMNESS)\nthe quality of being held or kept together firmly: Check the tightness of the screw.\nthe quality of being pulled or stretched firmly: Pegs are used to adjust the tightness of the strings.\nMore examplesFewer examplesMaintain the tightness of all handles by checking and retightening them regularly.Check cables for tightness. It would be prudent to occasionally check the tightness of that screw. We first tested every nut for tightness and found about 90 percent of the nuts could easily be loosened by fingers alone.Don't let it sag as this will undo the tightness of the roll. These consist of two or three drums in which the degree of tightness of the stretched vibrating skin can be adjusted to give notes of definite pitch.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\ntightness noun [U]\n(OF RACE)\nthe situation when people in a competition, race, etc. are of a similar standard so it is difficult to know who will win: the tightness of the presidential race\nMore examplesFewer examplesGiven the tightness of the race and the promise of victory within reach of either party, the result will be a shock to some.He added that the tightness of the contest could lead to lawyers getting involved. The debate was a pivotal moment for both candidates, considering the tightness of the race.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsnap\nsynonymous\nSee more results »\ntightness noun [U]\n(OF BEND)\nthe quality of curving sharply, not gradually or loosely: the tightness of the curls\nMore examplesFewer examplesThere are several options, and each depends on the tightness of your natural curls.He misjudged the tightness of the bend and the car left the road.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\ncoil\nconic\ncurl\ncurve\ndogleg\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntight\nturn\nwhorl\nwraparound\nSee more results »\ntightness noun [U]\n(CLOSENESS)\nthe quality of having a close relationship and knowing each other very well: the tightness of the military community\nMore examplesFewer examplesThe tightness of the family network has thwarted efforts by authorities to infiltrate the crime gang. My daughters think the tightness of their friends' traditional families is a little suffocating.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\ntight\nwarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing friends & getting to know them\ntightness noun [U]\n(LACK)\nthe fact that there is not much of something such as money, space, or time: We are constrained by the tightness of the budget.\nMore examplesFewer examplesIt's unfortunate that the tightness of budgets forces the department to make decisions that are risky.Given the tightness in the global drilling market, rig prices have more than doubled in recent years. The problem is the tightness of the supply of grain and animal feed throughout the world.Because of the tightness of a construction site in New York City, there's always the problem of having less space.He checks the tightness of a doorway before attempting to move the table through it.\ntightness noun [U]\n(OF RULES ETC)\nB2 (of controls, rules) the quality of severely limiting what can happen: the tightness of food hygiene regulations\nMore examplesFewer examplesWe all know the tightness of the rules in Formula One racing these days.This incident raises questions about the tightness of the bank's controls.\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\nbylaw\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nself-regulation\nunenforceable\nSee more results »\ntightness noun [U]\n(OF PERFORMANCE)\n(of a performance or band) the quality of being exact and of a high standard because people work well together: The orchestra played with the tightness and precision of a military band.\nMore examplesFewer examplesThe ensemble played with exceptional vigour and with a tightness that sometimes eluded them in other parts of the programme.the tightness of the band\nSMART Vocabulary: related words and phrases\nAccurate and exact\naccuracy\naccurate\naccurately\naright\nauthoritative\nfor all the world idiom\nGoldilocks\ngot it in one! idiom\nin so many words idiom\ninfallible\nliterally\nnose\nprecisely\nsharp\nstrictly\nstrictly speaking idiom\nsuperaccurate\nsynchronization\ntechnically\ntruly\nSee more results »\ntightness noun [U]\n(NOT GENEROUS)\ninformal disapproving the quality of being unwilling to spend money: She left, fed up with his affairs and his tightness with their household money.\nSMART Vocabulary: related words and phrases\nMean with money\nbegrudge\ncheapskate\ncheeseparing\nchintzy\nfrugal\nfrugally\nmiser\nmiserliness\nmiserly\nmoney grabber\nmoney-grubber\nmoney-grubbing\npenuriously\npinchpenny\nscrooge\nskinflint\nstingily\ntight\nungenerous\nungenerously\nSee more results »\nSee\ntight"}