{"id":363755,"name":"tight","type":"adjective","us_sound":"taɪt","us_link":"../audio/t/tight.mp3","uk_sound":"taɪt","uk_link":"../audio/t/uktickl025.mp3","content":"Add to word list\nAdd to word list\nB2 (held or kept together) firmly or closely: I can't untie the knot - it's too tight. This lid is on very tight. The people stood talking in tight groups. Hold on tight when we go around the corner. Check that windows and doors are shut tight (= completely closed) before you leave. The plastic cover was stretched tight (= stretched as much as it could be) across the tank. It is a tight squeeze on some trains, the General Manager acknowledged (= passengers are packed closely together). See also\nairtight\nwatertight (NO WATER)\nMore examplesFewer examplesThose trousers look a bit tight around your middle.Hold on tight and don't let go!He screwed his eyes tight shut against the bright light.The cyclists were all dressed in tight lycra shorts and the official team vest.I can't unscrew the top of this jar - it's really tight.\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nsnug\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\ntight adjective\n(UNCOMFORTABLE)\nB1 Clothes or shoes that are tight fit the body too closely and are uncomfortable: That jacket's too tight - you need a bigger size.\nA tight feeling is an uncomfortable feeling of pressure in part of your body, caused by illness, fear, etc.: Some people experienced tight chests after exercising in areas of high pollution. If you have any symptoms such as itchy mouth or tight throat after eating nuts, stop.\nTight muscles feel stiff and difficult to move: If you sit for long periods, it can make your hamstring muscles very tight on the back of your thighs. Calf stretches can alleviate tight calves when walking.\nlooking or sounding as if you are angry, frightened, or nervous, and not relaxed: In a small, tight voice, she said, \"Help me, please.\"\nSMART Vocabulary: related words and phrases\nTight and tightening\nastringency\nchokehold\nclose-fitting\nfast\ninelasticity\nretighten\nskinny\nsnug\nstiffen\nstrain\nstraitly\nsuper-tight\ntauten\ntautly\ntense\ntension\ntight-fitting\ntighten\ntighten something up\ntightly\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nStyle & appearance of clothes\nMedical treatment: symptoms & diagnosis of medical problems\nDisorders of muscles & the nervous system\nAnxious and worried\ntight adjective\n(LIMITING)\nB2 Tight controls or rules severely limit what can happen: Rules on what can be taken on board an aircraft have become tighter. tight security\nThesaurus: synonyms, antonyms, and examples\nstrictstrictHer parents were very strict.firmI was always very firm with my children.take a hard line onThe school takes a hard line on bullying.authoritarianThe country was under the rule of an authoritarian leader.stringentStringent safety regulations were introduced after the accident.\nSee more results »\nSMART Vocabulary: related words and phrases\nRules & laws\nadministrative\nadmiralty\nanti-bribery\nanti-regulatory\nanti-sodomy\nbinding\nblue law\ncivil law\nhumanitarian law\ninvocation\njuridical\njuridically\njuristic\nland tenure\nlegislation\nprovision\nRafferty's rules\nthe rule of law\nuncanonical\nunenforceable\nSee more results »\ntight adjective\n(BEND)\ncurving sharply, not gradually or loosely: He lost control of his car on a tight bend. The whales were swimming in a tight circle. She was instantly recognizable with her short, tight curls.\nSMART Vocabulary: related words and phrases\nGeometry: bends, loops & curves\nanfractuous\narc\nconic\ncurl\ncurve\nfishhook\nhelically\nhelix\nhyperbola\nhyperbolic\nkink\nloop\nparabola\npeaked\ntrajectory\nturn\ntwist\nwhirl\nwhorl\nwraparound\nSee more results »\ntight adjective\n(RACE)\nIf a race, competition, election, etc. is tight, the people, teams, or organizations involved are of a similar standard and equally likely to be successful. : The new governor was elected after an unexpectedly tight race. The race was extremely tight with the lead changing twice in the last 250m.\nSMART Vocabulary: related words and phrases\nSimilar and the same\n-esque\nadjacent\naffinity\nakin\nalike\nallied\nballpark\ncongruent\nditto\nequivalent\nequivalently\nevenly\nevery inch idiom\nnon-distinctive\nnot make any difference idiom\nof the kind idiom\none and the same idiom\nor something (like that) idiom\nrespecter\nsynonymous\nSee more results »\ntight adjective\n(NOT MUCH)\nB2 If time or money is tight, there is only just enough of it: I'm sorry I can't stay for a chat, time's really tight. They're raising three kids on one small salary so money is very tight.\ntight adjective\n(NOT GENEROUS)\ninformal disapproving unwilling to spend money: He was too tight to pay for a taxi so we had to walk.\nSMART Vocabulary: related words and phrases\nMean with money\nbegrudge\ncheapskate\ncheeseparing\nchintzy\nfrugal\nfrugally\nmiser\nmiserliness\nmiserly\nmoney grabber\nmoney-grubber\nmoney-grubbing\npenuriously\npinchpenny\nscrooge\nskinflint\nstingily\ntightwad\nungenerous\nungenerously\nSee more results »\ntight adjective\n(DRUNK)\nold-fashioned informal having drunk too much alcohol: Jim, you're tight! Synonym\ndrunk\nSMART Vocabulary: related words and phrases\nDrunkenness & sobriety\nalky\nbattered\nbeer goggles\nbinge drinker\nbinge drinking\nblasted\ndipsomania\nhave a few (too many) idiom\ninebriate\ninebriated\ninebriating\ninebriation\nmuzzy\nripped\nroaring drunk idiom\nshit-faced\nslaughtered\nslewed\nsmashed\nwhacked\nSee more results »\ntight adjective\n(RELATIONSHIP)\ninformal If two people are tight, they know each other very well and like each other a lot: The two of them were pretty tight at school.\nSMART Vocabulary: related words and phrases\nLiking\nadorkable\naffection\nappreciate\napprove of someone\nattached\nbe a glutton for something idiom\ndig\ngravitate towards/to something/someone\ngrow\ngrow on someone\nhatefully\nhave a lot of time for someone idiom\nhave a thing about something/someone idiom\nprotective\nshook\nsmile\nsmile on something/someone\nsmitten\ntaste\nwarm\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nBeing friends & getting to know them\nRelated word\ntightnessIdiom\nbe in a tight corner/spot\ntight adjective, adverb [-er/-est only]\n(FIRMLY TOGETHER)\nAdd to word list\nAdd to word list\n(held or kept together) firmly or closely: You have to wrap the bandage tight enough so that it really supports your ankle. Make sure the door is shut tight (= completely closed) before you leave.\nClothes that are tight fit the body closely, sometimes so closely that they are uncomfortable: She wore a tight black skirt. These shoes feel a bit tight.\nIf you say about two people that they are tight, you mean they are close friends.\ntight adjective\n(LIMITED)\n[ -er/-est only ] (esp. of time or money) available in limited amounts: Arnold has a very tight schedule today and I don’t know if he can see you. We’re on a tight budget and can’t afford to eat out much. Parking is very tight on weekdays around here.\ntight adjective\n(CONTROLLED)\nstrongly controlled: Security was tight at the meeting between the two leaders.\ntight adjective\n(DIFFICULT)\n(of situations) difficult or hard to deal with: We were in a tight financial situation. I was in a tight spot (= difficult situation) and wasn’t sure what I should do.\nIn a competition, tight means close, with the competitors almost even: He was involved in a very tight race for governor.\nAdd to word list\nAdd to word list\nGOVERNMENT, LAW controlled very carefully: tight controls/security/restrictions The talks were held amid tight security in London.\nFINANCE, MANAGEMENT if money or time is tight, there is only just enough of it: Finances are tight and no university has spare cash.tight budget/deadline/schedule We're working to a very tight schedule.\nECONOMICS, COMMERCE if there is a tight market, there is not as much of something available as is wanted or needed: They should not restrict so much land in an already tight and overpriced housing market. A tight labor market is an employer's nightmare.\nkeep a tight rein on sth\nto control something, especially spending, in a very careful way: The chancellor was urged to keep a tight rein on public finances."}