{"id":363887,"name":"till","type":"preposition","us_sound":"tɪl","us_link":"../audio/t/till.mp3","uk_sound":"tɪl","uk_link":"../audio/t/uktight008.mp3","content":"Add to word list\nAdd to word list\nA2 up to (the time that); until: We waited till six thirty for you. Up till 1918, women in Britain were not allowed to vote. How long is it till the baby is due?\nMore examplesFewer examplesFry the onions till they start to colour.I think I can come but I won't commit myself till I know for sure.I'll keep you company till the train comes.Miss Edwards has confiscated my comics till the end of term!Keep him off school till he stops being contagious.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\nday\nfar\nhitherto\nin\ninside\ninterim\nmeanwhile\nnow\npending\nthus\ntime\nto\nto date idiom\nuntil\nup to (doing) something idiom\nwait till/until ... idiom\nyet\nSee more results »\nGrammar\nBefore, by, till, untilIf you have to do something before a certain point in time, then when that point arrives, the action must already be completed: …\nthe drawer in a cash register (= a machine which records sales in a shop, and in which money is kept) or the cash register itself: Next time you have the till open, could you give me some change? I think these items have been rung up wrongly on the till.\nAndyL/ E+/GettyImages\nto prepare and use land for growing crops: This piece of land has been tilled for hundreds of years.\nSMART Vocabulary: related words and phrases\nFarming - general words\nagroecology\nagroforestry\nbiodynamic\nbiodynamics\nfarming\nharvest\nhomestead\nhydroponically\ninorganically\nlandrace\nmaincrop\nmonoculture\nreap\nterrace\nthe Agrarian Revolution\nuntillable\nuntilled\nvertical farming\nwater stress\nwater-stressed\nSee more results »\nAdd to word list\nAdd to word list\nup to (the time that); until: Tell him to take it easy till we get there.\ntill verb [T]\n(PREPARE LAND)\nto prepare and use land for growing crops: to till the soil\ntill noun [C]\n(MONEY CONTAINER)\na drawer where money is kept in a store: fig. We suspected him of dipping into the till (= stealing money from the store).\nAdd to word list\nAdd to word list\n(US usually register) a machine in a store or other business that records each sale and into which money paid by customers is put: Early indications from major UK stores show that cash tills have only just improved their takings on last year. shop/supermarket till computerized/electronic/automated till self-service/checkout tills till receipts/operators See also\ncash register\nthe place in a store, especially a large store, where you pay for your goods: The company is analysing waiting times at checkouts to calculate how many tills should be open.through the till(s) The volume of sales through high street tills rose by 0.6% in November.at the till(s) Retailers claim that banning cheques has helped to reduce queues at the till. See also\ncheckout\nbe on the till(s)\nto work in a store receiving payment from customers, and giving them change: Staff on the tills will be happy to offer customers information about our new range of insurance services.\nhave your hands/fingers in the till informal\nto steal money from the company or organization you work for: The executive was fired after he was found with his hand in the till."}