{"id":364091,"name":"timestamp","type":"noun","us_sound":"ˈtaɪm.stæmp","us_link":"../audio/t/cdo0318ustime5089.mp3","uk_sound":"ˈtaɪm.stæmp","uk_link":"../audio/t/cdo0318uktime1438.mp3","content":"Add to word list\nAdd to word list\na record in printed or digital form that shows the time at which something happened or was done: A timestamp may also be used to verify digital signatures. A Postal Service time stamp shows it was mailed at 9:01 AM.\nMore examplesFewer examplesIdeally I could enter a currency pair and a timestamp like \"2010-10-17@15:35:00\" and get back an approximate bid. There in her inbox is a little message that said, Mr. X has ended his relationship. There was a timestamp, 9:45 a. m., and a little broken heart icon.It is a unique identifier based upon the timestamp and the current Ethernet address.Next, the video's time stamp jumps forward a month and we're at Rob's going-away party.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\nspace\ntime signature\nup\nSee more results »\nto mark something with a printed or digital record of when something happened or was done: Each entry in the log is timestamped in the format YYMMDDhhmmss in GMT.\nMore examplesFewer examplesThere are two main ways of timestamping an item in an RSS 2.0 feed.At the very least, the courts should forbid the police from looking at any file timestamped before March 18, 2010. If users download expired, timestamped code, they will see that the digital signature is valid even though the certificate has expired.The trades themselves are scribbled on cards, then time stamped and recorded by a card clocker in less than 60 seconds.\nSMART Vocabulary: related words and phrases\nDescribing when something happened or will happen\nat\nat short notice idiom\nbe\ncoincident\ncoincidently\ndemand\nexecutory\nfor\nhundred\nimmediately\nmovable feast\nnotice\non\non demand idiom\none\npossible\nsomewhere along the line idiom\nspace\ntime signature\nup\nSee more results »"}