{"id":364040,"name":"time","type":"noun","us_sound":"taɪm","us_link":"../audio/t/thyme.mp3","uk_sound":"taɪm","uk_link":"../audio/t/ukthund015.mp3","content":"time noun\n(MINUTES/DAYS/YEARS)\nAdd to word list\nAdd to word list\nA2 [ U ] the part of existence that is measured in minutes, days, years, etc., or this process considered as a whole: He wants to spend more time with his family. Time passes so quickly when you're having fun. She grew more and more fascinated by the subject as time went on/by. The curtains have faded over/with time (= as years have gone past). You'll forget her in time (= in the future). Over the course of time (= as years have gone past), holes have formed in the rock. When Paula was ill, I took her some magazines to help her pass the time. If you'd taken more time with/over (= spent more time doing) this essay, you could have done it much better. It takes a long time (= many hours are needed) to get from London to Sydney. We'd save time on our journey (= it would be quicker) if we went by train. I only worked there for a short period of time. The kitchen clock is gaining/losing time (= is going fast/slow). My watch has never kept very good time (= been correct). all the time\nA2 continuously: I wish you'd stop criticizing me all the time.\nThesaurus: synonyms, antonyms, and examples\nevery timealwaysHe always leaves the lights on.constantlyHe's constantly losing his keys.continuallyShe is continually late to class.for everI am for ever misplacing my bag!time after timeTime after time he comes back and pretends like nothing has happened.\nSee more results »\nin no time C1 (also in next to no time)\nvery quickly or very soon: The kids ate their dinner in no time. We'll be home in next to no time. no time to lose\nIf you say there is or that you have no time to lose, it means that you must do quickly whatever it is that you want to do: Come on, there's no time to lose, we have to get home before John finds out. for all time literary\nalways: I will love you for all time.\nThesaurus: synonyms, antonyms, and examples\nfor a very long timealwaysThe power plant is always running. for everI will love you for ever.permanentlyHis reputation was permanently ruined by the scandal.eternallyEvildoers shall be eternally condemned.uninterruptedlyStocks have risen uninterruptedly for the last three months.\nSee more results »\nof all time\nthat has ever lived or existed: She's been called the greatest singer of all time.\nMore examplesFewer examplesI'd like some time to consider before I make a decision.If we cut across the field, it'll save time.She spends a good deal of her time in Glasgow.How much time do you allow yourself to get ready in the morning?A considerable amount of time and effort has gone into this exhibition.\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncontemporary\ncut into something\ndateless\nquality time\nretroaction\nretroactively\nretrospective\nretrospectively\ntime limit\ntime loop\ntimeline\ntiming\ntwin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAlways & never\nHurrying and doing things quickly\nImmediately\nLasting for a long time\ntime noun\n(SYSTEM)\nC1 [ U ] the system of recording hours used in different parts of the world: Greenwich Mean Time daylight saving time\nSMART Vocabulary: related words and phrases\nDays & times of day\nafternoon\nafternoons\nall day\nam\narvo\nhappy hour\nhigh noon\nhour\nin broad daylight idiom\nin the dead of night/winter idiom\nnocturnally\nnoon\nnoontime\no'clock\noffice hours\nthe witching hour\nwee small hours\nwhite night\nwine o'clock\nworkday\nSee more results »\ntime noun\n(TIME AVAILABLE)\nan amount of time that you have available to do something: I don't know how you find time to do all the things you do. I thought we'd give her a little more time (= allow her more time) to get the job done. I'd like to visit all the museums but time is short (= there is little time left). have time\nB1 If you have time, you have enough time to do something: We don't have much time before the train leaves. Do you have time for a quick drink after work? I'd like to learn to sail, but I don't have the time (= I am too busy). [ + to infinitive ] I don't have time to go to the shops today. waste time\nA2 to not make good use of the hours, etc. that you have available: If you'd done your work instead of wasting time on your phone, you'd be finished by now. run out of time\nB1 to not have enough hours, etc. available to finish something you are trying to do: She ran out of time and didn't finish the last question. be (all) out of time\nto not have enough minutes, etc. available: I'd like to continue this discussion but we're all out of time. time's up informal\nthere are no more minutes, hours, etc. available: OK, everyone, time's up for this week. time added on\nUK (also injury time, stoppage time) a period of time added to the end of a football match because play was stopped during the game, usually to take care of players who were hurt: His goal in the third minute of time added on sealed the match.\nSMART Vocabulary: related words and phrases\nSpending time & time passing\nall the time in the world idiom\nAnno Domini\ncourse\nelapse\nemploy\nfall\nfall away\ngone\nmisspend\npass\nroll\nroll by\nrun out\nslip\nslip away\nthe sands of time idiom\ntick\ntimekeeper\nwear on\nwhile something away\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRelating to time\nDelaying and wasting time\nScarce, inadequate and not enough\nLinguistics: expressions telling people to stop doing something\nCompetitions, & parts of competitions\nFootball/soccer\ntime noun\n(PERIOD)\nA2 [ S or U ] a particular period of time for which something has been happening, or that is needed for something: After a time, it became clear that nobody was interested in coming to the meetings. They stayed with us for a short time. That was the best restaurant I've been to for/in a long time (= a long period has gone past since I went to such a good restaurant). It was some time ago that I last heard from her. We're going on holiday in two weeks' time (= after two weeks have passed). During her time (= while she was) in office, the prime minister introduced a large number of changes. What do you like doing in your spare/free time (= when you are not working)? have/take time off\nto stop work, in order to do something else: I asked my boss if I could have some time off (from work) to go to the dentist. for a time\nfor a short period: For a time, we all thought that Sheila and Frank would get married. for some time\nB2 for a fairly long period of time: I've been doing yoga for some time. for the time being\nC1 for a limited period: Leave the ironing for the time being - I'll do it later. time of the month\nused to refer to someone's period (= the bleeding from the womb that happens once a month when a person is not pregnant), especially when you want to avoid saying the word \"period\": She often gets stomach pain when it's her time of the month. Her mother told her she needed to eat red meat because you lose more iron at that time of the month.\nMore examplesFewer examplesI cherish the memories of the time we spent together.Childhood is not always a happy time.She has a difficult time ahead of her.Being out of work for a long time is very demoralizing.Have we got time for a quick drink?\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncontemporary\ncut into something\ndateless\nquality time\nretroaction\nretroactively\nretrospective\nretrospectively\ntime limit\ntime loop\ntimeline\ntiming\ntwin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCancelling and interrupting\nShort in time\nLong periods of time\nNow\nUntil a particular moment\nObstetrics: processes & stages connected with sexual reproduction\ntime noun\n(PARTICULAR POINT)\nA1 [ C or S or U ] a particular point in the day, as expressed in hours and minutes or shown on a clock, or a particular point in time: What time is it?mainly UK \"What's the time?\" \"It's ten o'clock.\" What time do you finishwork? Have you got the time? (= Do you know what time it is?) He's teaching his daughter to tell the time (= to recognize what time it is by looking at a clock). Did you find out the times of the trains to Kiev? The estimated time of arrival/departure of this flight is 11.15.mainly UK Oh dear, is that the (right) time? (= is it really so late?) We always have dinner at the same time every day. I was exhausted by the time (= when) I got home. When would be a good time for me to call you? \"What would be the best time of day for us to deliver the table?\" \"Oh, any time will be OK.\" Today's temperatures will be normal for the time of year (= will be as they are expected to be in this season). Just think, this time (= at the same particular point during) next week we'll be in Aruba. We regret that at the present time (US also at this time) we are unable to supply the products you ordered. The time is fast drawing near/approaching (= it will soon be the time) when we'll have to make a decision. at the time\nA2 at the particular point when something was thought of or done: It seemed like a good idea at the time. at the same time\nB1 If two things happen at the same time, they happen together: We arrived at the same time. at your time of life\nat a person's present age: At his time of life, he ought to be taking things easy.\nMore examplesFewer examplesWhat time would it be convenient for me to come round?By the time the meal began, the youngest children were getting tired and crotchety.I might go to the cinema tomorrow - it depends what time I get home from work.The train was empty by the time it reached London.The exact time of the accident was 2.43 pm.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\none\npoint\nposterior\nthe last minute idiom\ntime slot\nunder the wire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the past\nSimultaneous and consecutive\nDescribing age & birthdays\ntime noun\n(SUITABLE POINT)\nB1 [ S or U ] a particular point of the day, year, etc. that is suitable for a particular activity, or at which something is expected to happen: holiday time party time Put your toys away now - it's time for bed. It's time (that) I was leaving. [ + to infinitive ] Is it time (for us) to go home yet? This is not the time (= not a suitable moment) to be thinking about buying a house. This is no time (= not a suitable moment) to change your mind. I feel that the time has come (= now is a suitable moment) for me to move on. The repairs to the road were finished two weeks ahead of time (= sooner than was expected). Why is it that the buses never run on time (= make their journeys in the expected number of hours, etc.)? She's grown old before her time (= sooner than she might have been expected to have done). in time\nB1 early enough: I got home just in time - it's starting to rain. If we don't hurry up, we won't be in time to catch the train. We got there in plenty of time (= we arrived early) for the beginning of the game. (right/dead/bang) on time informal\nhappening or done at the particular moment that it was expected to happen or be done: My parents go to the house right on time. ahead of time mainly US\nearlier than a particular moment: Let's meet for lunch. I'll call you ahead of time to decide exactly when and where.\nThesaurus: synonyms, antonyms, and examples\nat an earlier timebeforeI was sure I’d seen her face before.beforehandHe knew beforehand that his speech would anger many people.previouslyShe has previously denied the accusations.in advanceYou should prepare your ingredients in advance.ahead of timeUS Try to arrive at the airport ahead of time to minimize the possibility of delays.\nSee more results »\nabout time C1informal (also high time)\nIf it is about time/high time that someone did something, it should have been done sooner or a long time ago: It's about time (that) the school improved its food service. It is high time for the critics to open their minds to a new approach. about time informal (UK also about time too, not before time)\nsaid when someone does something or something happens that you think should have been done or have happened much sooner: \"So Ben's finally found a job.\" \"Yeah, it's about time.\" the time is right/ripe\nit is the most suitable moment to do something or for something to happen: I haven't told him yet, but I will when the time is right. She felt the time was right to leave. The time is ripe for investing in new technology.\nMore examplesFewer examplesIt's time we dug up those potatoes.Many politicians argued that this was no time to disarm .The submarine dived just in time to avoid the enemy attack.Drink up! It's time to go.Borrowers are expected to return books on time.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\none\npoint\nposterior\nthe last minute idiom\ntime slot\nunder the wire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAt the right time\nBefore, after and already\nLate\nDescribing when something happened or will happen\ntime noun\n(OCCASION)\nA2 [ C ] an occasion when something happens, or the experience connected with it: The last time we went to Paris, it rained every day. Every time/Each time I ask you to do something you say you're busy. They go swimming three or four times a week. There are times when I wish I didn't live where I do. The four-times champion (= the champion on four occasions in the past) was defeated in the second round. If I'd known at the time (= then) that she was his former wife, I'd never have said what I did. Sometimes I enjoy my English classes, but at other times I find them really boring. For the umpteenth/hundredth/thousandth time, (= I've told you on many occasions to) stop teasing your sister. Did you have a bad/good time (= an unpleasant/enjoyable experience) at the conference? She had an easy/hard time of it (= a comfortable/uncomfortable experience) with the birth of her second baby. from time to time\nB2 sometimes, but not often: From time to time I still think of her. time after time\nC2 again and again: Time after time she gets involved in relationships with the wrong men.\nThesaurus: synonyms, antonyms, and examples\nevery timealwaysHe always leaves the lights on.constantlyHe's constantly losing his keys.continuallyShe is continually late to class.for everI am for ever misplacing my bag!time after timeTime after time he comes back and pretends like nothing has happened.\nSee more results »\ntime and (time) again\nvery often: I've told you time and time again - look before you cross the road. at all times\ncontinuously: When you're at the airport, you should make sure you have your luggage with you at all times.\nThesaurus: synonyms, antonyms, and examples\nfor a very long timealwaysThe power plant is always running. for everI will love you for ever.permanentlyHis reputation was permanently ruined by the scandal.eternallyEvildoers shall be eternally condemned.uninterruptedlyStocks have risen uninterruptedly for the last three months.\nSee more results »\nat (any) one time (also at a time); (also at any given time)\nat or during any particular point or moment in the day: Only a certain number of people are allowed in the building at any one time. I'm sorry, but I'm too busy to help you now - I can only do one thing at a time. at times\nC1 sometimes: You can be really annoying at times, you know. at any time\never: Parking is not allowed here at any time. the times UK\non many occasions: The times I've told you, ask before you borrow my clothes.\nMore examplesFewer examplesThe announcement came at a bad time.Don't be daft - let me pay - you paid last time.Every time I ring her, the phone is engaged.I fell in love with him the first time I saw him.I was embarrassed at the time, but I had a good laugh about it later.\nSMART Vocabulary: related words and phrases\nPoints in time\nanytime\nas\nas and when idiom\ndownstream\nduring\nhour\nif\nif and when idiom\njuncture\nlast\nlater\nmidstream\nmidway\nmoment\none\npoint\nposterior\nthe last minute idiom\ntime slot\nunder the wire idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nExperiencing and suffering\nRarely & infrequently\nContinually & repeatedly\nAlways & never\ntime noun\n(HISTORICAL PERIOD)\nB2 [ C ] (also times) a period in history: \"A Tale of Two Cities\" is set at the time of the French Revolution. In/During medieval times, women thought to be witches were burned at the stake. In times gone by, all crops were harvested by hand. Times were hard (= living conditions were not good) when I was a boy. He is widely regarded as one of the best writers of modern/our times (= the present or very recent past). I never thought it would happen in my time (= before I died). We sat and talked about old times (= things that had happened to us in the past.) Times have changed and many more women now have executive jobs than in the past. at one time C2\nin the past: At one time, George Eliot lived here. ahead of your time (UK also before your time)\nhaving new ideas, opinions, or ways of living long before most other people do before someone's time\nIf something is before your time, it happened or existed before you were born or were old enough to remember it: I don't remember the Beatles - they were before my time. See also\nahead of your time time was\nsaid to mean that there was a period in the past when something used to happen or be true: Time was (when) you could buy a loaf of bread for sixpence.\nMore examplesFewer examplesThese coins were used in Roman times.My novel is set in the time of the French Revolution.I don't suppose we'll find life on Mars in my time.\nSMART Vocabulary: related words and phrases\nHistory - general words\na page in/of history idiom\nAge of Exploration\nage of sail\nalternative history\nannal\nantiquarian\nantiquary\nepigraphist\nheritage\nhistographer\nhistoric\nhistorical\nhistorically\nhistoricity\nhistory\nlegacy\nmodern\nnon-historical\nrevisionist\nthe Agrarian Revolution\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nIn the past\nModern & fashionable\nDescribing people who are young\ntime noun\n(RACE)\n[ C or U ] Your time in a race is the number of minutes, hours, etc. you take to complete it: Her time for the marathon was just under three hours. He ran the 100 metres in record time.\nSMART Vocabulary: related words and phrases\nCompetitions, & parts of competitions\nbathing beauty\nbe a game of two halves idiom\nbeauty contest\nbeauty pageant\nbenefit match\ncompetition\ndebate\nelimination tournament\nhead-to-head\nnon-major\nomnium\non your marks, get set, go! idiom\npeloton\npostgame\npre-meeting\npro-am\nquiz\nspelling bee\nstarter\nunder starter's orders idiom\nSee more results »\ntime noun\n(MUSIC)\n[ U ] the number of beats in a bar of music, or the speed at which a piece of music is intended to be played: This piece is written in 4/4 time. Small children often have difficulty singing in time with the music (= at the same speed at which the music is being played). It seemed to me as if the violins were playing out of time (= at a different speed from the other instruments playing the same piece of music). To beat time is to make a regular series of sounds at the same speed as a piece of music is played. Tapping your foot will help you to keep time (= to play the music at the correct speed).\nSMART Vocabulary: related words and phrases\nBeats or lengths of musical notes\nbackbeat\nbar\nbar line\nbeat\ncommon time\ncompound time\neighth\nfour-four time\nfourth\nhalf note\nmeasure\nminim\noctave\npause\nquadruple\nsixteenth note\nthree-four time\nthree-quarter time\ntime signature\ntiming\nSee more results »\ntime noun\n(PRISON)\ndo time informal\nto spend a period of time in prison: It's not always easy to find a job after you've done time.\nSMART Vocabulary: related words and phrases\nPutting people in prison\nat His/Her Majesty's pleasure idiom\nbang someone up\nbar\nbehind bars idiom\nbird\ncommit\nimmured\nimprison\nimprisonment\nincarcerate\nincarceration\nintern\nlock\npen\nremand\nrestraint\nrot\nrot in jail, prison, etc. idiom\nsend\nstretch\nSee more results »\ntime noun\n(DRINKING)\n[ U ] the particular point in the day at which people who are drinking in a bar in the UK have to finish their drinks and leave: \"Time, please!\" called the landlord. Is it time already?\nSMART Vocabulary: related words and phrases\nDrinking alcohol\nabstinence\nabstinence-only\nafter hours idiom\nbar-hop\nbarhopping\ndrink someone under the table idiom\ndrinker\ndrinking\ndrinking game\ndrinking-up time\ndrown\nhangover\nhatch\non the booze idiom\nout of hours idiom\noutdrink\noverdrink\npaint\nply\nspike\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDays & times of day\nGrammar\nAlways: meaningAlways can mean ‘on every occasion’, ‘forever’ or ‘very frequently’. In these meanings we use it with simple tense forms: …\nAlways with continuous verb formsWe can use always with continuous verb forms to refer to regular events or states, especially ones which are problematic or which we do not like or want: …\nAlways: positionWe most commonly use always in mid position, between the subject and main verb, after the modal verb or first auxiliary verb, or after main verb be: …\nAlways with can and couldWe often use always with can and could to talk about possible solutions to problems: …\nAs alwaysWe use as always to talk about one event which is seen as typical: …\nAlways or all the time?All the time also means ‘very often’ or ‘continually’ and is commonly used to refer to things that people do not like or do not want to happen. We don’t use all the time in mid position: …\nMeasurementsWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nArea: length, width, depth and heightWe use the nouns length, width, depth and height and the adjectives long, wide, deep and high to talk about area and size: …\nWeight and volumeWe use the verb weigh to measure weight: …\nFrequency, speed, timeWe use many different expressions to describe frequency, speed and time. Here are some of them: …\nTimeTime is a noun with a number of meanings. In some senses it is countable, and in others it is uncountable. A good learner’s dictionary will give you its many meanings and tell you whether it is countable or uncountable. …\nTime: seconds, minutes, hours, yearsWe use time to refer to what is measured in seconds, minutes, hours and years as a whole. In this sense it is uncountable: …\nTime: talking about clock or calendar timeWhen we talk about specific clock times, time is countable. We do not say hour: …\nOn time and in timeWe use on time to talk about timetabled events. If something is on time, it means that it is at the scheduled time. We often use right on time or, more informally, dead on time or bang on time, for emphasis: …\nTime: referring to past eventsWe often use expressions with time to refer to past events (the time, the time that, the time when): …\nTelling the timeWe can ask about the time in different ways: …\nIt’s timeWe can use the expression it’s time + subject + past verb form to refer to the present moment: …\nIdioms\nall the time in the world\nbehind the times\nbe pressed for time\nchange with/keep up with/move with the times\ngive someone a hard time\ngive someone the time of day\nhave a lot of time for someone\nhave no time for someone\nhave time to kill\na matter/question of time\nMore idioms\nthere's a time and a place (for everything)\nthere's no time like the present\ntime and tide wait for no man\ntime flies\ntime hangs heavy\ntime is money\ntime is of the essence\ntime is on someone's side\nthe time is ripe\nthe time of your life\nhave time on your hands\ntime stands still\n(only) time will tell\ntime's a great healer\ntime verb [T]\n(ARRANGE)\nto decide that something will happen at a particular time: [ + to infinitive ] We timed our trip to coincide with my cousin's wedding.\nto arrange something so that it happens at the best possible time: If you time your departure carefully, you should be able to miss the worst of the traffic. The girls' basketball team won the game with a perfectly timed shot (= one played at exactly the right moment), just before the buzzer.\nMore examplesFewer examplesThey timed the book to coincide with the film release.They timed the trip for after the end of their project.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\npencil\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\ntime verb [T]\n(MEASURE)\nB2 to measure how long it takes for something to happen or for someone to do something: Will you time me to see how long it takes me to swim a length?\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nshortish\ntimer\nunquantifiable\nunsounded\nweigh something out\nSee more results »\nthe stated period of time during the year, day, etc.: springtime Christmas-time daytime night-time\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncontemporary\ncut into something\ndateless\nquality time\nretroaction\nretroactively\nretrospective\nretrospectively\ntime limit\ntime loop\ntimeline\ntiming\ntwin\nSee more results »\ntime noun\n(MEASURE OF EXISTENCE)\nAdd to word list\nAdd to word list\n[ U ] the seconds, minutes, hours, days, weeks, months, years, etc., in which existence is measured, or the past, present, and future considered as a whole: I really don’t have time to call her today. The children spent most of their time outdoors. We’d save time (= It would be quicker) if we didn’t have to pick up Bobby on the way.\n[ U ] If you waste time, you do not make good use of the amount of time available to you.\ntime noun\n(PARTICULAR PERIOD)\n[ C/U ] a particular period of seconds, minutes, hours, days, weeks, months, years, etc., during which something has been happening or is needed or available: [ U ] The kids are well-behaved most of the time. [ C ] She was very lonely at that time. [ C ] They talked for a long time. [ U ] She spent most of her free time listening to music. [ C ] It’s unusual to get snow at this time of year. [ U ] Those kids are over here all the time (= often or continuously).\n[ C/U ] If you pass time, you do something while waiting for something else to happen: [ U ] While he was waiting, Joe passed the time looking through magazines.\n[ C/U ] Your time in a race is the number of seconds, minutes, and hours you take to complete it: [ C ] The track was soft, and the times were slow.\ntime noun\n(MEASUREMENT ON A CLOCK)\n[ C/U ] a particular moment in the day, as expressed in hours and minutes and shown on a clock, or a particular point in the day, week, month, or year: [ U ] What time is it? [ U ] What time do you finish work? [ U ] He’s teaching his daughter to tell time (= to recognize what particular point in the day it is by looking at a clock). [ C ] I catch the train at the same time every day. [ U ] Parking is not allowed here at any time (= ever).\n[ C/U ] Time is also used to refer to the system of recording hours used in different parts of the world: [ U ] Mountain Standard Time [ U ] daylight saving time\ntime noun\n(SUITABLE POINT)\n[ C/U ] a point of the day, week, month, or year that is suitable for a particular activity, or at which something is expected to happen: [ U ] We had enjoyed our visit, but now it was time to go home. [ U ] Put away your toys, Leni, it’s time for bed. [ C ] The times for meals are listed on the schedule. [ U ] This is no time (= not a suitable moment) to change your mind. in time\nTo be in time for something is to arrive at the right moment, before it is too late to do something: We arrived just in time for the show I'm glad you got here in time to see Julie before she goes. The plane is expected to arrive on time (= when scheduled).\ntime noun\n(OCCASION)\n[ C ] an occasion or period, or the experience connected with it: This is a time to be serious. There were times when he almost gave up, but somehow he managed to survive. We visit my mother a few times a year. She takes the medicine three times a day. He was holding down three jobs at the same time. We had a good time at the party.\ntime noun\n(HISTORICAL PERIOD)\n[ C ] (also times) a period in history: Indians since ancient times have ground their corn by hand. before your time\nSomething or someone before your time happened or existed before you were born or were old enough to remember: The Beatles were way before my time.\nIdioms\nat a time\ndo time\nthe time is ripe\ntime after time\ntime and (time) again\ntime flies\ntime is on someone's side\ntime on your hands\ntimes have changed\ntime’s up\nMore idioms\ntime will tell\ntime verb [T]\n(MEASURE ON A CLOCK)\nto arrange for something to happen at a specific moment: We timed our arrivals at the airport so that we could meet and share a taxi to the city.\ntime verb [T]\n(MEASURE PARTICULAR PERIOD)\nto measure the seconds, minutes, and hours for something to happen or someone to do something: We ran two miles and were timed at 12 minutes and 30 seconds. You’ve got to time the roast or it will get overdone.\nAdd to word list\nAdd to word list\n[ U ] what is measured in minutes, hours, etc.: spend/waste/save time Many consumers spend considerable time researching the best buys for a new or camera.have (the) time to do sth Not all investors have the time to invest directly in stocks and shares.an amount/period/length of time The amount of time small-business managers spend at work has increaseda lot of/plenty of/little time Executives often complain that a lot of time is wasted in meetings.give sb time to do sth The Australian IT group has been given more time to raise funds for the merger.more/less time Suggested amendments to current legislation would give borrowers more time to pay back loans.it takes time to do sth Customers using the new system report an 80% reduction in the time it takes to place orders. over time How do you think the market will perform over time?time and money/resources/energy Today's youngsters spend more time and money on personal grooming than any previous generation.\n[ S ] a period of time of a particular type, for example, a period that is difficult, successful, etc.: a difficult/hard/tough time Auto makers are having a tough time in a marketplace that is getting more and more competitive.an easy/good time The media group has not had an easy time of late, due to a difficult advertising market and changing viewer habits.\n[ S ] a period of time of a particular length: for a time The advantages of low business tax can give a significant boost to economies, at least for a time.a long/short/extended time TV will probably continue to dominate the advertising market for a long time.\n[ U ] time that is used in a particular way or for a specific purpose: Most of my time at work is spent in direct contact with clients. work/free/leisure timemake/take time to do sth Don't forget to take time to fill out all the necessary forms.\n[ C ] an occasion when sth happens: at a time when Eliminating estate tax would add to the nation's debt at a time when we can least afford it.at this/that time At that time, I had to travel a lot with my job.the first/next/last time Share prices rose yesterday for the first time in over two years.every/each time New \"smart meters\" show how much water is consumed every time a power shower is run or a washing machine is used.\n[ S or U ] the time shown on a clock or a watch: the time of sth The time of the meeting has been put back to 11.30 am. What time shall we start?\n[ U ] the time in one country or part of the world that is different from the time in another country or part of the world: The phone went on sale at 6 p.m. local time.\nagainst time\nif you do something against time, you have to work very hard to finish it by the agreed time or date: We are working against time to get the stadium finished for the opening ceremony.a race/battle/fight against time The race against time to stop deforestation has begun.\nahead of time\nif you do something ahead of time, you do it early or before something else happens: You must arrive at the airport two hours ahead of time in order to go through security.\nall the time/the whole time\nfor the whole of a period of time: New technology means that employees no longer need to be at their desks all the time.\nif something happens all the time or the whole time, it happens very often: Subscribers to our service get as many as 75 channels, with new ones coming all the time.\nat a time\nif something happens for days, weeks, months, etc. at a time, it continues for the whole of that period: Computer viruses are capable of crippling large companies, often for days at a time.\nin groups or amounts of a particular number: Guest designers - as many as 100 at a time - have been invited to work with resident designers.\nat all times formal\nalways or at any time of the day: Calls to other mobiles cost 40p a minute at all times. This exit must be kept clear at all times.\nbehind time\nhappening or being done later than expected: Trains are running behind time due to an accident on the line.\nin good time\nearly, or allowing more than enough time for something to happen: Remember to send your tax form to us in good time.\nin time for sth\nbefore something else starts or happens: Just in time for the fall buying season, the company has announced a range of new handheld PCs.\nit's time for sb to do sth\nused to say that something must be done immediately or very soon: It's time for Congress to pass a stimulus package to kick-start the economy.\nkeep up/move/change with the times\nto allow ideas, methods, etc. to develop and remain modern: The BBC knows it has to move with the times in its negotiations over broadcasting rights.\na matter/question of time\nused to say that something will happen in the future, probably quite soon: It may be just a matter of time until a budget airline introduces a crew-free plane. You'll find a job eventually - it's only a question of time.\nnine times out of ten/99 times out of 100\nused to say that something nearly always happens in a particular way or nearly always produces a particular result: Nine times out of ten, if you propose an idea, someone will argue with it.\nten/20/100, etc. times better/bigger/worse, etc.\nused when you compare two things to say how much better, bigger, worse, etc. something is than something else: The median wealth of people with ISAs is 20 times greater than that of the general population.\non time\nat the agreed or expected time: We are committed to completing the project on time and on budget. I expect all my staff to get to work on time.\nthe time has come/the time is ripe for sth\nused to emphasize that something must be done or dealt with immediately: We feel the time has come for him to resign. With a falling housing market in Europe, the time is ripe for property auctions.\ntime is money\nused to say that if you waste time you are also losing money: For the oil industry time is money, and in most cases it's cheaper to pay compensation and move to another site than wait for a board hearing.\ntime is of the essence\nused to say that you should not wait or waste time before doing something important or urgent: Environmentalists argue that time is of the essence in redirecting transportation money from roads to transit. See also\nairtime\nclosing time\ncomp time\ncompensatory time\ndaylight saving time\ndead time\ndelivery time\ndouble time\ndowntime\ndrive time\nView all\ndwell time\nface time\nGMT\nlead time\nlost time\nnew time\nprime time\nstandard time\nto plan the time at which an activity or event starts to happen: Timing a buy or sell recommendation well is often partly a question of luck.be timed to do sth The bid had been timed to give the company a head start over their rivals in the venture.perfectly/well/badly timed Their launch of an international property fund looks to be perfectly timed."}