{"id":364094,"name":"timetable","type":"noun","us_sound":"ˈtaɪmˌteɪ.bəl","us_link":"../audio/t/timetable.mp3","uk_sound":"ˈtaɪmˌteɪ.bəl","uk_link":"../audio/t/uktight026.mp3","content":"Add to word list\nAdd to word list\nB1 a detailed plan showing when events or activities will happen : The timetable for our trip to Paris includes visits to Notre-Dame and the Louvre. Here is the timetable of events for the day. the timetable for the withdrawal of US troops from the country\nUK (US schedule) a list of the times when buses, trains, and planes leave and arrive : Do you have a train timetable that I could borrow?\nA2 UK (US schedule) a list of the times when classes in school happen: The first lesson on the timetable for Monday morning is history.\nMore examplesFewer examplesIn the new timetable, there's a clash between history and physics.We had to adapt our plans to fit Jack's timetable.The government has published its timetable for education reform.I need to look at the timetable to see if I can get to Manchester this evening.\nSMART Vocabulary: related words and phrases\nSchedules & agendas\nagenda\nAOB\nbusiness plan\ncalendar\ndatebook\nfit in\nHegira\nHejira\nitinerary\njournal\npack\nprogramme\nschedule\nscheduled\nset the agenda idiom\nslot\nslot someone/something in\nspread\nspread something over something\nsqueeze\nSee more results »\nto plan when something is going to happen: [ + to infinitive ] We are timetabled to go to the British Museum on Thursday and the Tower of London on Friday. The lecture is timetabled for 5.00 p.m.\nSMART Vocabulary: related words and phrases\nPlanning, expecting and arranging\naccidentally\naccidentally on purpose idiom\nadvertent\nadvisedly\naim at something\nbargain\nhave something up your sleeve idiom\nhorizon scanning\nhow are you fixed for something? idiom\nI might have known idiom\nI'll/we'll cross that bridge when I/we come/get to it idiom\nplanner\nprovidently\nprovision\npurpose\npurposefully\npurposely\nput their heads together idiom\nsettle\nsleeve\nSee more results »\nAdd to word list\nAdd to word list\na list of the times when particular activities or events will happen; schedule: An election is expected in one or two years, although no timetable has been announced.\nAdd to word list\nAdd to word list\na plan of the dates when something should happen or when the different parts of a process or activity should be completed: a timetable for (doing) sth What is the timetable for completing the merger? There is no timetable as yet for installation of all the facilities at the new science center.set/give/announce a timetable Aid organizations are accusing G8 countries of failing to set a clear timetable for increasing aid.a timetable to do sth Ernst &amp; Young has set a six-month timetable to make a decision. a specific/strict/detailed timetable See also\nschedule noun\nTRANSPORT\n&#160; (US also schedule) a list of the times when buses, trains, or planes leave and arrive: a bus/train/railway timetable\nto make a plan of the dates for something to happen or the different parts of a process or activity to be completed: be timetabled for sth Elections are timetabled for the second half of next year. The firm has timetabled an aggressive series of product launches."}