{"id":364069,"name":"timeout","type":"noun","us_sound":"ˌtaɪmˈaʊt","us_link":"../audio/t/uscld01487.mp3","uk_sound":"ˌtaɪmˈaʊt","uk_link":"../audio/t/ukcld01487.mp3","content":"Add to word list\nAdd to word list\na short period during a game in some sports when the players stop playing in order to rest, plan what they are going to do next, etc.: The coach called a timeout to discuss strategy.\na short period in which a child has to stop an activity as a punishment for behaving badly : The little boy's mother gave him a timeout after he hit his friend.\nSMART Vocabulary: related words and phrases\nParts & stages of competitions\na game in hand idiom\nadded time\nbracket\ncup tie\nevent\nfinal\nfull time\nhalf\nhand\nkick\nkick off\nlap\nlap of honour phrase\nleg\nquarter\nshootout\nsqueaky-bum time\nvictory\nvictory lap\nwalkover\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGeneral terms used in ball sports\nused to tell people to stop what they are doing, especially when they are having a disagreement: OK, timeout, everyone, let's all quiet down and talk about this calmly.\nSMART Vocabulary: related words and phrases\nLinguistics: expressions telling people to stop doing something\nage\nbreak it up! idiom\nbutt out\ncool\ncool it idiom\ngrow\ngrow up\nhold\nhold everything! idiom\njust a minute/moment/second idiom\nleave something/someone off something\npack\npack something in\nput\nput something up\nthat'll do! idiom\nthat's it idiom\nthat's that idiom\nwait\nzip it idiom\nSee more results »\nAdd to word list\nAdd to word list\na short official pause during a game when the players plan what to do next\nAdd to word list\nAdd to word list\nIT a situation in which a computer program stops working because an activity has taken too long: If an inactivity timeout occurs, you may need to sign back on to the server.\nHR a situation in which someone has time away from work, for example, in order to look after their family or to do other things: For increasing numbers of people, the linear career is now dead and career interruptions and time-outs are the new norm."}