{"id":364113,"name":"timing","type":"noun","us_sound":"ˈtaɪ.mɪŋ","us_link":"../audio/t/timing.mp3","uk_sound":"ˈtaɪ.mɪŋ","uk_link":"../audio/t/uktimin001.mp3","content":"Add to word list\nAdd to word list\nB2 [ U or C ] the time when something happens: \"Are we too early?\" \"No, your timing is perfect - dinner is almost ready.\"timing device The bomb contained a timing device set to make it go off at rush hour. timings [ plural ] Indian English\nthe hours when someone is usually at work, or when an office or business is open: What are your office timings?\nSee more\n[ U ] the ability to do something at exactly the right time: good timing To be a good tennis player, you have to have good timing.\n[ U ] the ability to play or sing all the notes in a piece of music at the correct speed and rhythm: There are one or two places where the timing isn't quite right.\nMore examplesFewer examplesBecause of the timing, I'm sure the salary freeze is a deliberate contrivance, not a coincidence.The timing of the meeting is certainly fortuitous.The timing of the press release was designed for maximum publicity.\nSMART Vocabulary: related words and phrases\nRelating to time\nanachronism\nanachronistic\nanachronistically\nchronological\nchronologically\ncontemporaneously\ncontemporarily\ncontemporary\ncut into something\ndateless\nquality time\nretroaction\nretroactive\nretroactively\nretrospective\nretrospectively\ntime limit\ntime loop\ntimeline\ntwin\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAt the right time\nBeats or lengths of musical notes\nAdd to word list\nAdd to word list\nthe ability to choose the right moment to do or say something, or the time when something happens: The difference between a joke told well and a joke told badly is the timing. The timing of the airline strike was bad for our vacation plans.\nAdd to word list\nAdd to word list\n[ C or U ] the time at which an activity or event starts or happens, or is planned to start or happen: Timing and location are crucial when opening a new business.the timing of sth The timing of the plant manager's departure came ahead of an investigation into safety management at the site.\n[ C ] the length of time an activity or event takes, or is planned to take: The job sheet includes data and precise timings for every stage of the job.\n[ U ] the fact of doing something at the right time, or the ability to do this: bad/good/perfect timing There is a risk of bad timing - investing a lump sum just before prices fall.a matter/question/sense of timing Finding the right solution to the problem is partly a question of timing. Even fund managers can find it hard getting the timing right when it comes to making investment decisions."}