{"id":364447,"name":"tip","type":"verb","us_sound":"tɪp","us_link":"../audio/t/tip.mp3","uk_sound":"tɪp","uk_link":"../audio/t/uktimin028.mp3","content":"tip verb\n(ONE SIDE HIGHER)\nAdd to word list\nAdd to word list\nC2 [ I or T ] to (cause to) move so that one side is higher than another side: The table tipped, and all our drinks fell on the floor.tip up If you put too many books on one end of the shelf, it'll tip up.tip something back Don't tip your chair back like that, you'll fall. tip the scales at\nto weigh: The baby tipped the scales at 3.75 kg.\nSee more\nSMART Vocabulary: related words and phrases\nSlanting, sloping, leaning, tilting\nacclivity\nangled\nanteversion\nanteverted\naskew\ninclination\nincline\nlopsided\nlopsidedly\nlopsidedness\nobliquely\npitched\nrake\nslant\nslanting\nslantingly\nslantwise\nslope\nsloping\nsteep\nSee more results »\ntip verb\n(POUR)\nC2 [ T usually + adv/prep ] UK (US dump) to pour a substance from one container into another or onto a surface: She tipped the contents of her purse out onto the table. He tipped his breakfast cereal into a bowl.tip something out The child picked up the box and tipped the toys out all over the floor. be tipping (it) down UK informal\nWhen it is tipping it down, a lot of rain is falling: it is tipping (it) down We won't be able to go to the beach today - it's tipping it down.\nSee more\nSMART Vocabulary: related words and phrases\nMovement of liquids\nbacksplash\nbe dripping with something idiom\ncounter-stream\ndecant\ndrainage\ndrip\nfunnel\nleakage\nreinjection\nrespray\nripple\nrun a bath phrase\nrun someone/something over\nrunnel\nspate\nswash\nswill\nswirl\nswirling\ntop something up\nSee more results »\ntip verb\n(END)\n[ T usually passive ] to cover the end of something pointed with a liquid, a colour, etc.: be tipped with The giraffe was killed with a spear that had been tipped with poison.\nSMART Vocabulary: related words and phrases\nCovering and adding layers\nadditive\nasphalt\nbestrew\nbind\nblanket\nblindfold\nbury\ngum\ninlaid\nlag\nlaminate\nlayer\nobliterate\nretread\nseasoned\nslap\nslap something on\nsmother something in/with something\nspeckle\ntent\nSee more results »\ntip verb\n(PAYMENT)\n[ I or T ] to give someone who has provided you with a service an extra amount of money to thank them: The taxi driver was so rude to her that she didn't tip him. [ + two objects ] They tipped the waiter £5.\nSMART Vocabulary: related words and phrases\nPaying money\n2FA\n2SV\nante up (something)\nburn a hole in someone's pocket idiom\nchargeable\ncost-cutting\ndiscretionary\nfund\nlash out (something)\nreimburse\nrepay\nsettle an account idiom\nshell (something) out\nshortchange\nsink into something\nspend\nspend money like water idiom\nspent\nsplurge\nsponsor\nSee more results »\ntip verb\n(INFORMATION)\n[ T often passive ] mainly UK to say that someone is likely to be successful or achieve something: be tipped as He is being tipped as the next prime minister. [ + to infinitive ] Davis is being tipped to win the championship.\nSMART Vocabulary: related words and phrases\nPossible and probable\nalways\nanything's possible idiom\narguably\nas never before idiom\nauspiciously\nbet\nfair\nhouseroom\nI shouldn't wonder idiom\nit isn't over until the fat lady sings idiom\nlean\nlean towards sth\nmanage\nmargin\nprobability\nprobable\nprobably\nprospective\nprospectively\ntend\nSee more results »\ntip verb\n(RUBBISH)\n[ I or T, usually + adv/prep ] UK (US dump) to get rid of rubbish by putting it in a place where it should not be: A lot of waste is being tipped into the sea. The sign by the side of the road said \"No tipping\".\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nRemoving and getting rid of things\ntip verb\n(TOUCH)\nto hit or touch something gently: I tipped the ball and ran. The goalkeeper tipped the ball over the crossbar.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdioms\ntip the balance/scales\ntip your hand\ntip your hat to someone\ntip someone the winkPhrasal verbs\ntip someone off\ntip (something/someone) over\ntip over into something\ntip noun [C]\n(INFORMATION)\nB1 a useful piece of information, especially about how to do something or about the likely winner of a race or competition: gardening/cooking/sewing tipsgive someone a tip about/for something She gave me a useful/helpful/valuable/practical tip about/for growing tomatoes. See also\nhot tip informal\nThesaurus: synonyms, antonyms, and examples\nadviceadviceLet me give you some advice.helpI didn't know who to turn to for help.a piece of adviceLet me give you a piece of advice.counselI will miss his wise counsel.guidanceYoung people don't always appreciate the guidance offered by their parents and teachers.counsellingUK Victims of abuse usually need expert counselling.\nSee more results »\nMore examplesFewer examplesFreezing the butter was a useful tip.He gave me some tips about the best way to catch trout.Have you got any tips for a new journalist?Let me give you a tip: she likes flattery.Layla gave me some tips about the best places to visit.\nSMART Vocabulary: related words and phrases\nGambling & bookmaking\na/the bookmaker's phrase\nante\nanti-gambling\nbank\nbet\nblackjack\ncasino\nchip\nco-favourite\ncockfight\nfavourite\npunt\nraffle\nslot machine\nsmart money\nspread betting\nstake something on something\nstakeholder\ntoss up\ntrifecta\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nInformation and messages\nGiving advice\ntip noun [C]\n(PAYMENT)\nB1 a small amount of money given to someone who has provided you with a service, in addition to the official payment and for their personal use: a 15 percent tipgive someone a tip He gave the porter a tip.leave a tip for We don't need to leave a tip for the waiter, because there's a service charge included in the bill. Synonym\ngratuity formalCompare\nservice noun (DEALING WITH CUSTOMER)\nMore examplesFewer examplesThe average cost of a full three-course meal - appetizer, main course and dessert - including tip and a modest wine is about $25.She had to give the doorman a tip before he would help her with her suitcases.Should I give the driver a tip?\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\nchip\ncommission\nlegal tender\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nGifts in the form of money\ntip noun [C]\n(END)\nC1 the usually pointed end of something, especially something that is long and thin: We had asparagus tips for dinner.on the tip of If I stand on the tips of my toes, I can just reach the top shelf.tip of The Keys are coral islands off the southern tip of Florida. There's paint on the tip of your nose.\na small part fitted to the end of something, especially something that is long and thin: a walking cane with a metal tiptip of the filter tip of a cigarette\nSMART Vocabulary: related words and phrases\nEdges & extremities of objects\napex\napical\napices\nbevel\nborder\nbottom\nbrow\ncap\ncircumference\ncrown\nedge\nextremity\nfoot\npalm-fringed\nperimeter\nperipherally\nperiphery\nrim\nrimless\nspout\nSee more results »\ntip noun [C]\n(RUBBISH)\nC2 UK (US also UK dump) a place where especially large pieces of rubbish can be taken and left: a rubbish/waste tip We need to take this old carpet to the tip. informal This room is a complete/absolute/real tip (= is very untidy) - tidy it up at once.\nSMART Vocabulary: related words and phrases\nEnvironmental issues\nagroecology\nair pollution\nanoxia\nanoxic\nanti-conservation\ncarbon capture\ndumping ground\neco-footprint\nenvironmentalism\nenvironmentally\nESG\nfeed-in tariff\nfood insecure\nparticulate\nreduce, reuse, recycle idiom\nsequester\nsequestration\nsingle-use\nskip diving\nsmoggy\nSee more results »\ntip noun [C]\n(TOUCH)\na gentle hit or touch: A faint tip of the ball sent it out of play.\nSMART Vocabulary: related words and phrases\nGeneral terms used in ball sports\naggregate score\nassist\nback pass\nbackspin\nballplayer\ndump\nkicker\nlay someone off\nlayoff\nlong ball\npace\npassing\npitch\nstroke\nthe long ball game idiom\nundefended\nunderhand\nunderspin\nunhittable\nuppish\nSee more results »\nIdioms\nbe on the tip of your tongue\nthe tip of the iceberg\nthe tip of the spear\ntip noun [C]\n(END)\nAdd to word list\nAdd to word list\nthe pointed end of something: The tip of the cat’s tail is white. She has a house on the western tip of the island.\ntip noun [C]\n(INFORMATION)\na useful piece of information or advice, esp. something secret or not generally known: She gave me some helpful gardening tips. Acting on a tip, the police arrested most of the smugglers.\ntip noun [C]\n(MONEY)\na small amount of money you give to someone for service, in addition to the amount being charged: \"That guy didn’t bother to leave a tip,\" the waitress said disgustedly.\nIdioms\non the tip of your tongue\nthe tip of the iceberg\ntip verb [I/T]\n(LEAN)\n-pp- to lean to one side, or to cause something to lean to one side: [ T ] She tipped the umbrella to keep the sun off the picnic table.\ntip verb [I/T]\n(FALL OVER)\nto fall or turn over, or to cause something to fall or turn over: [ I ] If everyone sits on one side of the boat, it will tip (over).\ntip verb [I/T]\n(PAY)\n-pp- to give money to someone for service which is in addition to the amount being charged: [ T ] He tipped the porter generously.\nIdiom\ntip the balancePhrasal verb\ntip off someone\nAdd to word list\nAdd to word list\na useful piece of information or advice: Our 50 tips show you how to navigate your computer system from startup to shutdown.a tip for (doing) sth Here are our top tips for achieving success as a freelancer.a tip on/about sth The book offers some useful tips on investing in real estate. The Business Link site gives tips on setting up your own business.find/get tips You can find tips on our website for ways to protect your home. safety/travel/tax tips\nFINANCE advice to buy or sell particular shares: share/stock tips Investors should take stock tips with a pinch of salt.\nCOMMERCE an amount of money given by a customer to someone who has provided a service, especially in a hotel or restaurant: give/leave a tip Different countries have different customs when it comes to leaving tips. Compare\ngratuity\n[ T, usually passive ] to say that someone or something is likely to do something or to be successful: be tipped to do sth The UK's leading energy company is tipped to become a partner in the Siberian gasfield.tip sb/sth to do sth Analysts are tipping her to be the next chairperson of the committee.be tipped as sth The transport company is being tipped as a possible takeover target.be tipped for sth He is being tipped for a possible job in the US treasury.\n[ T ]\n&#160; FINANCE to advise someone to buy shares: They were accused of gross misconduct for tipping shares that they owned. The shares were looking cheap and had been strongly tipped.\n[ I or T ]\n&#160; COMMERCE to give a small amount of money to someone who has provided a service, especially in a hotel or restaurant: He is mean with money and never tips. Is it customary to tip taxi drivers in your country?tip sb £1/$5/10% etc. He carried her bag and she tipped him $2. Phrasal verb\ntip sb off"}