{"id":365054,"name":"titrate","type":"verb","us_sound":"taɪˈtreɪt","us_link":"../audio/t/titrate.mp3","uk_sound":"taɪˈtreɪt","uk_link":"../audio/t/cdo0216titruk2082.mp3","content":"Add to word list\nAdd to word list\nchemistry\n&#160; specialized to measure how much of a substance is in a liquid by adding it to measured amounts of another substance that reacts to it, for example, by making it change colour: The sample is titrated at a pH near 10 with EDTA solution until a colour change occurs. Water samples were taken at many depths and every sample that came back was titrated on board ship. A solution of hydrochloric acid was titrated against a standard sodium hydroxide solution.\nmedical\n&#160; specialized to calculate and, if necessary, change how much of a drug, etc. is given to a patient in order to produce the best result, without causing too many side effects (= unpleasant effects in addition to the main intended effect): He had started the patient on a new mix of drugs but had to titrate the medications over several days to avoid side effects. The insulin dose needs to be titrated against the results of home monitoring of blood glucose levels. The drug is given intravenously, titrated to age and tolerance.\nSMART Vocabulary: related words and phrases\nMeasuring & weighing\ncost-of-living index\ncountable\ngage\ngravimetric\ngravimetrically\nhypsometric\nmeasure\nmeasurement\nnon-quantifiable\nnon-quantitative\npace\npace something off/out\nplanimetric\nponderable\nproof\nquantifiable\nshortish\nsurvey\nunsounded\nweigh something out\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nChemistry - general words\nDrugs - general words\nRelated words\ntitration\ntitrant\nAdd to word list\nAdd to word list\nchemistry to measure how much of a substance is in a liquid by adding it to measured amounts of another substance which reacts to it, for example, by making it change color titration noun [ U ]\n&#160; chemistry us/tɑɪˈtreɪ·ʃən/"}