{"id":365156,"name":"to","type":"preposition","us_sound":"tuː","us_link":"../audio/t/to.mp3","uk_sound":"tuː","uk_link":"../audio/t/uktitil017.mp3","content":"to preposition\n(INFINITIVE)\nAdd to word list\nAdd to word list\nA1 used before a verb to show that it is in the infinitive\nA1 used after some verbs, especially when the action described in the infinitive will happen later: She agreed to help. I'll have to tell him. Sadly, she didn't live to see her grandchildren.\nA1 used after many verbs of agreeing, needing, and wanting: I need to eat something first. I'd love to live in New York. That child ought to be in bed.\nA2 used instead of repeating a verb clause: \"Are you going tonight?\" \"I'm certainly hoping to.\"\nA1 used in phrases where there are reported orders and requests: He told me to wait. Did anyone ask Daniel to reserve the room?\nA1 used after some adjectives: It's not likely to happen. Three months is too long to wait. She's not strong enough to go hiking up mountains.\nused after some nouns: He has this enviable ability to ignore everything that's unpleasant in life. This will be my second attempt to make flaky pastry.\nA clause containing to + infinitive can be used as the subject of a sentence: To go overseas on your own is very brave. My plan was to get it all arranged before I told anyone.\nA1 used after question words: I don't know what to do. Can you tell me how to get there?\nA2 used with an infinitive to express use or purpose: I'm going there to see my sister. This tool is used to make holes in leather. To make this cake, you'll need two eggs, 175 grams of sugar, and 175 grams of flour. He works to get paid, not because he enjoys it.\nYou can introduce a clause with a phrase containing to + infinitive: To be honest (= speaking honestly), Becky, I like thegrey shirt better. To tell you the truth, I never really liked the man.\nA1 used with an infinitive after 'there is' or 'there are' and a noun: There's an awful lot of work to be done. to be going on with UK\nTo be going on with means in order to continue with the present activity or situation: Do we have enough paint to be going on with, or should I get some more while I'm out?\nMore examplesFewer examplesThis meat is difficult to chew.On a hot day it's lovely to hear the chink of ice in a glass.I'd prefer not to work but I don't have much choice .It's impossible to park in the city centre.There was a clap of thunder and then it started to pour with rain.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\ndate\nday\nfar\nhitherto\nin\ninside\ninterim\nmeanwhile\nnow\npending\nthus\ntill\ntime\nto date idiom\nuntil\nup to (doing) something idiom\nwait till/until ... idiom\nSee more results »\nto preposition\n(SHOWING DIRECTION)\nA1 in the direction of: We're going to town on the bus, okay? We went to Prague last year. I asked someone the way to the town centre. You can walk from here to the school in under ten minutes. I asked Kirsten and Kai to dinner (= invited them to come and eat dinner with me) next week. We received another invitation to a wedding this morning. I had my back to them, so I couldn't see what they were doing. She walked over to the window. He went up to a complete stranger and started talking.UK You've got your sweater on back to front (= with the back of the sweater on the chest).\nMore examplesFewer examplesShe goes to her doctor for regular check-ups.She gave a cheesy grin to the cameras.Take your purchases to the sales desk, and the assistant will wrap them for you.When we retire, we're going to move to a warmer climate.We're going to the airport by coach.\nSMART Vocabulary: related words and phrases\nDescribing movement towards\n-wards\n-ways\nat\nconvergent\nearthward\nfacing\nfor\nforward\nforwards\nhither\ninwards\non\noncoming\nonward\nonwards\nthither\nup\nward\nway\nwise\nSee more results »\nto preposition\n(RECEIVING)\nA2 used for showing who receives something or who experiences an action: I lent my bike to my brother. I told that to Alex and he just laughed. Who's the letter addressed to?\nA2 With many verbs that have two objects, 'to' can be used before the indirect object: Give me that gun./Give that gun to me.\nMore examplesFewer examplesWho should I make out this cheque to ?When you've finished your work sheets, clip them together and hand them in to me.He's a great comfort to his mother.Has the news been communicated to the staff yet?If the service was so bad why didn't you complain to the manager?\nto preposition\n(UNTIL)\nB1 until a particular time, state, or level is reached: It's only two weeks to Christmas. Unemployment has risen to almost eight million. He drank himself to death. She nursed me back to health.\nA1 used when saying the time, to mean before the stated hour: It's twenty to six.\nMore examplesFewer examplesCheap rate for overseas phone calls is from 8 p.m. to 8 a.m.The Spanish Civil War lasted from 1936 to 1939.My daughter cried herself to sleep about it for about a week.Molly studied music to grade 7, I think it was.The whole course was a disaster from start to finish.\nSMART Vocabulary: related words and phrases\nUntil a particular moment\nbefore\ndate\nday\nfar\nhitherto\nin\ninside\ninterim\nmeanwhile\nnow\npending\nthus\ntill\ntime\nto date idiom\nuntil\nup to (doing) something idiom\nwait till/until ... idiom\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nDays & times of day\nto preposition\n(EXTREME)\nused to suggest an extreme state: Look at your shirt - it's torn to shreds! She was thrilled to bits. I was bored to tears.\nto preposition\n(CONNECTION)\nB1 in connection with: What was their response to your query? She was so mean to me. There's a funny side to everything.\nB1 used to say where something is fastened or connected: The paper was stuck to the wall with tape. A fast rail service connects us to the city.\nMore examplesFewer examplesShe has no rightful claim to the title.Like so many men, he has problems committing himself to a relationship.She is known chiefly for her commitment to nuclear disarmament.The public's response to the crisis appeal was generous and compassionate.They planned to put up a statue to the president.\nto preposition\n(FUTURE)\nused before an infinitive, usually with 'be', to indicate a future action: The government announced today that it is to cut funding for the arts for next year. See also\nto-be\nmainly UK used in this pattern to say what someone should do or to give an order: You're not to (= you must not) bite your nails like that.\nNewspapers often use to + infinitive without 'be' in their headlines (= titles of articles) when reporting planned future events: Russia to send troops in.\nMore examplesFewer examplesWe are to leave tomorrow at dawn.You are to go to your room immediately.If he is to pass the exam, he must do more work.Troops are to take over the role of the fire brigade.He said we were not to leave the room.\nSMART Vocabulary: related words and phrases\nLinguistics: verb forms, tenses & types of verbs\naccusative\nart\nbare infinitive\nbent\ncontinuous\ncopula\nfinite\ngerund\nmodality\nnon-finite\nnon-progressive\npassive\npassivization\nperfective\npresent participle\nsubjunctive\nthe active voice\nthe future perfect\nthe past continuous\nthe past tense\nSee more results »\nto preposition\n(CAUSING)\nC2 causing a particular feeling in a particular person: That's when I found out, to my amazement, that she was coming here.\nMore examplesFewer examplesTo their great surprise, they all passed the exam.I learned, to my annoyance, that he had already left.To my complete horror, the car turned right over.To my despair, I saw that the water was rising.\nSMART Vocabulary: related words and phrases\nCausing things to happen\nactivate\nactivation\nactuation\nagent\nattribute\nattribute something to someone\nimplement\nimplementation\nin\ninaugurate\ninauguration\npioneer\nPygmalion effect\nreactivate\nrealization\nrealize\nreattribute\nrender\nspark\nspell\nSee more results »\nto preposition\n(CONSIDERED BY)\nconsidered by: I realize it may sound strange to you. I mean, £50 is nothing to him (= he would not consider it a large amount).informal \"I hear you've been going out with Ella.\" \"Yeah, so? What's it to you?\" (= It should not interest you, and you have no right to ask about it.)\nMore examplesFewer examplesOur house must seem luxurious to them.Loyalty doesn't mean anything to them.It seemed odd to me that they didn't want to come to London.Our customs probably seem funny to them.\nto preposition\n(SERVING)\nB1 serving: As a personal trainer to the rich and famous, he earns over a million dollars a year.\nMore examplesFewer examplesHe was footman to the king.He was doctor to the poor.She was maid to a rich family in London.\nto preposition\n(AGAINST)\nagainst or very near: Stand back to back. They were dancing cheek to cheek.\nMore examplesFewer examplesTheir faces were nose to nose, scowling at each other.The children stood back to back to see who was tallest.He was standing, hand to mouth in horror.\nSMART Vocabulary: related words and phrases\nThrough, across, opposite and against\nacross\nacross country idiom\nagainst\nagin\nalong\ncatty-corner\ncountry\ncross\nfront\ngive\nkitty-corner\non\nopposite\nother\nover\noverland\nthru\ntrans\nSee more results »\nto preposition\n(BELONGING)\nmatching or belonging to: My dad gave me the keys to his car. I've lost the trousers to this jacket.\nhaving as a characteristic feature: She has a mean side to her. There is a very moral tone to this book.\nMore examplesFewer examplesIs there a cover to this book?There is a softer side to her nature.I gave her the password to my computer.\nto preposition\n(SHOWING POSITION)\nB1 used to show the position of something or someone in comparison with something or someone else: John's standing to the left of Adrian in the photo. The Yorkshire Dales are twenty miles to the north of the city.\nSMART Vocabulary: related words and phrases\nNext to and beside\nabreast\nadjacency\nadjacent\nadjacently\nadjoining\nagainst\nat someone's elbow idiom\nbeside\nbordering\ncontiguity\ncontiguous\nneighbour\nnext\nnext door\nnext door but one idiom\nnon-contiguous\non\nshoulder\nshoulder to shoulder idiom\nside\nSee more results »\nto preposition\n(IN HONOUR OF)\nin honour or memory of: I proposed a toast to the bride and the groom. The record is dedicated to her mother, who died recently.\nMore examplesFewer examplesThe book is dedicated to her son.I'd like to dedicate the movie to the memory of my father.\nto preposition\n(FOR EACH)\nfor each: How many dollars are there to the pound? This car does about 40 miles to the gallon. When we go swimming together I do six lengths to her twelve. Compare\nper\nMore examplesFewer examplesHow many euros are there to the pound?There are three children to each teacher.\nSMART Vocabulary: related words and phrases\nLinguistics: both, all, each & every\nA, a\nall\nall round phrase\nany\napiece\nboth\nboth sides\nboth something and something\neach\neither\nevery\nevery minute idiom\npan\nper\npop\nstrength\nthe\nthrow\nwhole\nto preposition\n(BETWEEN)\nB2 used in phrases that show a range: There were probably 30 to 35 (= a number between 30 and 35) people there.\nMore examplesFewer examplesThe police are expecting four to five thousand marchers tomorrow.We have allowed two to four drinks per person.\nSMART Vocabulary: related words and phrases\nRange and limits\nall the way to idiom\nambit\nanywhere\nband\nbeyond the bounds of something\ncompass\nfinite\nfinitude\ngamut\nglass ceiling\nlimit\nlimited\nparametrically\nproviso\nrealm\nrestricted\nscope\nspectrum\nstretch\nstring\nSee more results »\nto preposition\n(AT THE SAME TIME AS)\nat the same time as music or other sound: I like exercising to music. He left the stage to the sound of booing.\nto preposition\n(POSITIVE)\nrelating to a positive reaction or result: When the pasta is done to your liking, drain the water. I think being at the meeting would be to your advantage.\nto preposition\n(COMPARED WITH)\nB1 UK compared with: She's earning a reasonable wage, but nothing to what she could if she was in the private sector. Paul beat me by three games to two (= he won three and I won two). He was old enough to be her father - she looked about 30 to his 60.\nMore examplesFewer examplesI live to the north of Warsaw.I weigh ten stone to his eight.She thinks her house is great, but it's nothing to where I live.\nSMART Vocabulary: related words and phrases\nComparing and contrasting\nanalogy\nantithesis\napple\nas against idiom\nbalance something against something\ncomparative\ncompetitive\ncompetitively\ncontradistinction\ncontrast\ncontrastive\nmeasure\nmutatis mutandis\nnext\nnonrelative\nperspective\nrelative\nrelativity\nshame\nstack\nSee more results »\nGrammar\nNo or not?No and not are the two most common words we use to indicate negation. We use no before a noun phrase: …\nToTo is a preposition. It is also used as part of the infinitive (the to-infinitive): …\nTo as a preposition: destination or directionWe can use to as a preposition to indicate a destination or direction: …\nTo as a preposition: receiver of an actionWe use to with verbs such as give, hand, send, write, to indicate the person or thing that receives or experiences the object of the verb: …\nTo as a preposition: timeWe use to in telling the time, when we refer to the number of minutes before the hour: …\nTo as a preposition: approximate numbersWe can use to when we refer to an approximate number somewhere between a lower number and a higher number: …\nTo as a preposition: after nounsA number of nouns are followed by to. These include nouns expressing direction or destination such as door, entrance, road, route, way: …\nTo as a preposition: after verbsSome verbs are followed by the preposition to, including be used, get used, listen, look forward, object, reply, respond: …\nTo as a preposition: after adjectivesSome adjectives connected with people’s behaviour and feelings are followed by to, including cruel, faithful, generous, kind, loyal, nasty: …\nTo: the to-infinitiveWe use to before a verb to make the to-infinitive form: …\nAt, in and to (movement)We use to when we are talking about movement in the direction of a point, place, or position: …\nNounsNouns are one of the four major word classes, along with verbs, adjectives and adverbs. Nouns are the largest word class. …\nNot only … but alsoWe use not only X but also Y in formal contexts: …\nTypes of nounsA noun refers to a person, animal or thing. Some examples are: …\nmainly UK into a closed position: I'll just push the door to.\nSMART Vocabulary: related words and phrases\nOpen and closed\nairtight\najar\nbarred\nclosed\ncrack\ngaping\nhermetic\nhermetically sealed\nhour\nlatch\noff-hours\nopen\noutspread\npatency\nsealed\nshut\nunbarricaded\nunopened\nwatertight\nwide-eyed\nSee more results »\nGrammar\nNo or not?No and not are the two most common words we use to indicate negation. We use no before a noun phrase: …\nToTo is a preposition. It is also used as part of the infinitive (the to-infinitive): …\nTo as a preposition: destination or directionWe can use to as a preposition to indicate a destination or direction: …\nTo as a preposition: receiver of an actionWe use to with verbs such as give, hand, send, write, to indicate the person or thing that receives or experiences the object of the verb: …\nTo as a preposition: timeWe use to in telling the time, when we refer to the number of minutes before the hour: …\nTo as a preposition: approximate numbersWe can use to when we refer to an approximate number somewhere between a lower number and a higher number: …\nTo as a preposition: after nounsA number of nouns are followed by to. These include nouns expressing direction or destination such as door, entrance, road, route, way: …\nTo as a preposition: after verbsSome verbs are followed by the preposition to, including be used, get used, listen, look forward, object, reply, respond: …\nTo as a preposition: after adjectivesSome adjectives connected with people’s behaviour and feelings are followed by to, including cruel, faithful, generous, kind, loyal, nasty: …\nTo: the to-infinitiveWe use to before a verb to make the to-infinitive form: …\nto preposition\n(INFINITIVE)\nAdd to word list\nAdd to word list\nused before a verb showing that it is in the infinitive: She agreed to help. I asked her to finish by Friday. I need to eat something. I’d love to visit New York. I want to go now.\n\"To\" followed by an infinitive is used after adjectives: It’s not likely to happen. I was afraid to tell her.\n\"To\" followed by an infinitive is used after nouns: He has the ability to do two things at once.\n\"To\" followed by an infinitive can begin a clause: To be honest (= Speaking honestly), I prefer the gray skirt.\n\"To\" followed by an infinitive can be used to express requests or orders: Is it possible to have tea instead? You’re not to go there by yourself.\n\"To\" followed by an infinitive is used after \"how,\" \"what,\" \"when,\" \"where,\" \"whether,\" \"which,\" \"who,\" \"whom,\" or \"whose\": I don’t know what to do. Can you tell me how to get there?\n\"To\" followed by an infinitive is used after \"enough\": I was close enough to touch him.\nto preposition\n(INSTEAD OF VERB)\nused instead of a verb clause when answering questions: \"Would you like to go to the movies tonight?\" \"Yes, I’d love to.\"\nto preposition\n(FOR)\nfor the purpose of doing something: I asked Helen out to dinner.\nto preposition\n(SHOWING DIRECTION)\nin the direction of or as far as: We went to Montreal last year. I’m going to the bank. We were in mud up to our ankles.\n\"To\" can be used to show the position of something or someone in relation to something or someone else: We came face to face in the elevator. The Rocky Mountains are to the west of the Great Plains.\n\"To\" can show something is on or around something: Can you tie the dog’s leash to the fence?\nto preposition\n(BETWEEN)\nused in phrases that show a range of things or a distance between places: There must have been 30 to 35 people there. We got two to three inches of snow at home. Read pages 10 to 25. It’s two to three hundred miles from Boston to Washington.\nto preposition\n(RECEIVING)\nused for showing who receives something or who experiences an action: I told that story to Glen. Who’s the letter addressed to?\nto preposition\n(IN CONNECTION WITH)\nin connection with: They exercise to music. What was their response to that news?\nto preposition\n(COMPARED WITH)\ncompared with: Paul beat me three games to two. I scored 80 to Talia’s 90.\nto preposition\n(UNTIL)\nuntil a particular time, state, or condition is reached: It’s only two weeks to your birthday. We’re open daily from 2 to 6 p.m. My shirt was torn to shreds.\n\"To\" is used, when giving the time, to mean minutes before the stated hour: It’s twenty to six.\nto preposition\n(CAUSING)\ncausing a particular feeling or effect in someone: To my great relief, she decided against going.\nto preposition\n(CONSIDERED BY)\nconsidered by: Does this make any sense to you? Fifty dollars is very little to him.\nto preposition\n(MATCHING)\nmatching or belonging to: the top to a bottle the keys to my apartment There is a funny side to everything.\nto preposition\n(FOR EACH)\nfor each of; per: This car gets about 30 miles to the gallon."}