{"id":365172,"name":"toady","type":"noun","us_sound":"ˈtoʊ.di","us_link":"../audio/t/ustinte029.mp3","uk_sound":"ˈtəʊ.di","uk_link":"../audio/t/uktitil020.mp3","content":"Add to word list\nAdd to word list\na person who praises and is artificially pleasant to people in authority, usually in order to get some advantage from them: Everywhere he goes he is surrounded by an entourage of toadies. Shostakovich was often seen as a political toady to Stalin. Synonym\ncrawler (TRYING TO PLEASE) UK informal disapproving\nMore examplesFewer examplesShe had her toadies, minor officials in Government offices who ran about putting through little jobs on her behalf.He becomes a prisoner of what his toadies tell him.She caricatures the cowardly toadies whose views changed along with the politics of the times.\nSMART Vocabulary: related words and phrases\nPraising insincerely or too eagerly\nbackhanded compliment\nbootlicker\nbow and scrape idiom\ncrawler\ncreep\nglad-handing\ngrovel\ngrovelling\ngrovellingly\nhagiographic\nmassage someone's ego idiom\nobsequious\nobsequiously\npeople pleaser\nplay up to someone\nsycophant\nsycophantic\nsycophantically\ntoadying\nunctuous\nSee more results »\nto praise and be artificially pleasant to people in authority, usually in order to get some advantage from them: She was always toadying to the boss. She imagined him in his gallery, toadying to his rich clients. Synonym\ncrawl (TRY TO PLEASE) UK informal disapproving\nMore examplesFewer examplesHe was unused to people not toadying to him.They are all grimly obsequious, like boys toadying to teachers.He spent his holiday toadying up to rich relatives on Martha's Vineyard.\nSMART Vocabulary: related words and phrases\nPraising insincerely or too eagerly\nbackhanded compliment\nbootlicker\nbow and scrape idiom\ncrawler\ncreep\nglad-handing\ngrovel\ngrovelling\ngrovellingly\nhagiographic\nmassage someone's ego idiom\nobsequious\nobsequiously\npeople pleaser\nplay up to someone\nsycophant\nsycophantic\nsycophantically\ntoadying\nunctuous\nSee more results »"}