{"id":365389,"name":"together","type":"adverb","us_sound":"təˈɡeð.ɚ","us_link":"../audio/t/together.mp3","uk_sound":"təˈɡeð.ər","uk_link":"../audio/t/uktobyj016.mp3","content":"together adverb\n(WITH EACH OTHER)\nAdd to word list\nAdd to word list\nA1 with each other: We used to go to yoga together. We worked together on a project a couple of years back. Could you add these numbers together for me? You mix all the dry ingredients together before you add the milk. I like both flavours separately but I don't like them together. You could stick that back together (= join the separate parts to each other) with some glue.close together She said, \"Never trust a man whose eyes are so close together!\"all together The waiter asked if we were all together, so I explained that we were two separate parties.get together We should get together (= meet each other socially) some time and have a drink. See also\naltogether adverb\nIf two people are described as together, they have a close romantic and often sexual relationship with each other: Mira and Ellis have been together now for almost five years. get together informal (UK also get it together)\nIf two people get together or get it together, they start a sexual relationship with each other: We'd seen each other a few times as part of a group, but we didn't really get it together till Rachel's party.\nSee more\nMore examplesFewer examplesI cherish the memories of the time we spent together.When you've finished your work sheets, clip them together and hand them in to me.It was when we started living together that we found we just weren't compatible.If you two don't talk out the differences between you, it'll be very difficult for you to continue working together.The bride and groom walked down the aisle together.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nMarriage, cohabitation & other relationships\ntogether adverb\n(AT THE SAME TIME)\nB1 at the same time: The packages were sent separately, but they all came together. We can deal with the next two items on the list together.\nMore examplesFewer examplesWhenever their team scored a goal, they leaped up and down clanking their beer cans together.We stood up together.\nSMART Vocabulary: related words and phrases\nSimultaneous and consecutive\naccompanied by someone/something\naccompaniment\naccompany\nall the while idiom\nalong\ngo along\nheavy rotation\nin parallel idiom\nin rotation idiom\nin tandem idiom\nminute\nprocess\nsimultaneously\nsimultaneousness\nsoon\nstep\nstraight\nsuccessive\nturn\nwhile\nSee more results »\ntogether adverb\n(COMBINED)\nB2 combined: Together they must earn over $300,000 a year.put together She's got more sense than the rest of you put together.\nMore examplesFewer examplesThe population of the US is bigger than that of Britain, France and Germany put together.The stables and other outbuildings were sold together with the main house.The skirt and jacket looked a bit odd together.Unemployment and inner city decay are inseparable issues which must be tackled together.In their heyday, they sold as many records as all the other groups in the country put together.\nSMART Vocabulary: related words and phrases\nConnecting and combining\nabut\nadditive\nadjoin\naffix something to something\nagglomerate\nconverge\nconvergence\ncor\ncross-Channel\ncumulate\njointed\njunction\nkludge\nknit\nknock\nunify\nunion\nunseparated\nwad\nweave\nSee more results »\ntogether adverb\n(IN ONE PLACE)\nB2 in one place: I'll just gather my stuff together, and then we can go.\nMore examplesFewer examplesThe monkeys bunched together in the corner of their cage.We huddled together on the cliff ledge, waiting for rescue.We pushed all the furniture together in the middle of the room, so that we could paint the walls.Doctors inserted a metal pin in his leg to hold the bones together.We all grouped together round the bride for a family photograph.\nSMART Vocabulary: related words and phrases\nActing, being or existing together\naccompanying\nallied\nalong\nalongside\namong\ncooperative\ncooperatively\ndistributively\ndouble act\nen bloc\njointly\nmisery\nmisery loves company idiom\nnon-compatible\nnon-conflicting\ntow\ntwin\ntwo-way\nunison\nunite\nSee more results »\ntogether adverb\n(AND ALSO)\ntogether with\nB2 mainly UK in addition to; and also: The money that I owe you for the phone together with the rent equals £300.\nSee more Grammar\nAltogether or all together?Altogether means ‘completely’ or ‘in total’: …\nAltogetherAltogether means ‘completely’ or ‘in total’: …\nAll togetherAll together means ‘with each other’, and is similar to together: …\norganized, confident of your abilities, and able to use them to achieve what you want: For a sixteen-year-old, he seems pretty together. get it together\nto get something organized: We were going to go skiing over Christmas but we never got it together.\nSee more\nMore examplesFewer examplesI haven't been very together since my mother died.We weren't very together about arranging the food.\nSMART Vocabulary: related words and phrases\nEfficient and effective\nbe firing on all cylinders idiom\nbusinesslike\nclockwork\ncome together\ncut through something\ndeveloped\ndispatch\nefficiently\nergonomic\nergonomically\nergonomics\nhigh-functioning\npunch\nseamless\nseamlessly\nsmoothly\nsnappily\nsnappy\nworkable\nworth your salt idiom\nSee more results »"}