{"id":365440,"name":"toilet","type":"noun","us_sound":"ˈtɔɪ.lət","us_link":"../audio/t/toilet.mp3","uk_sound":"ˈtɔɪ.lət","uk_link":"../audio/t/uktobyj023.mp3","content":"toilet noun\n(CONTAINER)\nAdd to word list\nAdd to word list\nA1 [ C ] a bowl-shaped device with a seat that you sit on or stand near when emptying the body of urine or solid waste, or another device used for this purpose: on the toilet I was on (= using) the toilet when the phone rang.flush the toilet Don't forget to flush the toilet.need/want (to go to) the toilet UK Excuse me, Miss Lewis, I need/want (to go to) the toilet.toilet seat The toilet seat was cracked and there was no paper.\n[ C ] UK (US bathroom) a room with a toilet in it: Someone's in the toilet. go to the toilet\nA2 UK to empty the body of urine or solid waste, usually using a toilet to do so: It's going to be a long drive, kids, so if you want to go to the toilet, do so now.\nSee more toilets A2 [ plural ] UK (US restroom); (US also ladies'/men's room)\na room or small building in a public place in which there are several toilets: Do you know where the ladies' toilets are?\nSee more\nMore examplesFewer examplesMy children never flush the toilet after them.Do you need the toilet right now or can you hang on for a while?Can I go to the toilet, please, Miss?We hated using that outside toilet - there were always spiders in there!The sign on the toilet door said 'Engaged'.\nSMART Vocabulary: related words and phrases\nParts of buildings: the toilet\nbathroom\nbedpan\nbog\nchamber pot\ncistern\ncloakroom\nflushable\ngent\nhoney bucket\njohn\nladies phrase\nlatrine\nlitter\npotty\npotty chair\npowder room\nprivy\npublic convenience\nWC\nwomen's room\nSee more results »\ntoilet noun\n(WASHING)\n[ U ] old-fashioned formal the process of washing and dressing yourself: over someone's toilet Virginia had spent longer than usual over her toilet that evening, with pleasing results.\nSMART Vocabulary: related words and phrases\nPersonal care - general words\namenity kit\nbaby wipe\nbeach body\nbeardy\nbed bath\nbubble bath\nfat-shaming\nfatphobia\nfatphobic\nflossing\nhand gel\nscrub\nscrub up well idiom\nshave\nspruce\nweak-chinned\nwell groomed\nwhirlpool bath\nwindblown\nwindswept\nSee more results »\nAdd to word list\nAdd to word list\na device into which people excrete waste, esp. a bowl-shaped device with a seat that has a hole in it, or a bathroom: I couldn't get the toilet to flush."}