{"id":365500,"name":"token","type":"noun","us_sound":"ˈtoʊ.kən","us_link":"../audio/t/eus75967.mp3","uk_sound":"ˈtəʊ.kən","uk_link":"../audio/t/uktobyj028.mp3","content":"token noun [C]\n(SYMBOL)\nAdd to word list\nAdd to word list\nC1 something that you do, or a thing that you give someone, that expresses your feelings or intentions, although it might have little practical effect: As a token of our gratitude for all that you have done, we would like you to accept this small gift. It doesn't have to be a big present - it's just a token.\nSMART Vocabulary: related words and phrases\nSigns, signals and symbols\nbeacon\nbreadcrumb\ncryptanalyst\ndelimiter\ndigital badge\niconographically\niconography\nindicator\nlagging indicator\nleading indicator\nlitmus test\nprompt\nsignboard\nsignificative\nsignifier\nsigning\nSOS\nstatus symbol\nthe all-clear\ntotem pole\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nShowing and demonstrating\nPresents and gifts\ntoken noun [C]\n(WORTH MONEY)\nUK (US gift certificate) a piece of paper, a card, or an electronic document with a particular amount of money shown on it that can be exchanged in a shop or online for goods of that value: a £20 record token He always bought me tokens for a department store for my birthday. See also\nbook token\ngift token\nC1 UK (US gift certificate) a round metal or plastic disc that can be used instead of money : Metal tokens are used instead of cash in some slot machines in casinos. First they had to queue up to receive a small plastic token, which they could then exchange for food.\nPhotoMelon/iStock/Getty Images Plus/GettyImages\nMore examplesFewer examplesThe tokens can be swapped for T shirts, key rings, and other prizes.\nSMART Vocabulary: related words and phrases\nPayment methods\nanti-kickback\nATM card\nautomatic withdrawal\nbad cheque\nbaksheesh\nbribe\ncommission\nlegal tender\nletter of credit\nliquefy\nliquid\nmoney-back\nmonometallic\nMonopoly money\nnon-cash\nnon-monetary\npayoff\nper calendar month\npocket\nwhip-round\nSee more results »\ntoken noun [C]\n(COMPUTING)\ncomputing\n&#160; specialized a piece of data that is used to represent and replace another one, in order to prevent private information being seen by someone who is not allowed to do so: When we receive the transaction securely, we tokenize it and send back a token to the merchant so they never have to see a card number for settlement. See also\nnon-fungible tokenRelated words\ntokenize\ntokenization\nMore examplesFewer examplesThe system then automatically generates an authentication token and includes the token in the outbound transaction. The client software decrypts the stored encrypted token.This is a secure encryption device for digital token generation.\nSMART Vocabulary: related words and phrases\nComputer concepts\n2FA\n2SV\n3-D printing\nadaptive learning\nadditive manufacturing\nfile sharing\nhex\nhexadecimal\nhill climbing\nhome automation\nhotspot\nmeg\noptical\nprotocol\nsimulation\ntethered\ntethering\ntexturing\nthreading\ntick box\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nCodes & decoding\ntoken noun [C]\n(LANGUAGE)\nlanguage\n&#160; specialized a unit of language that is used in a particular text : The participants produced 1,564 linguistic tokens, of which 1,021 (65%) were marked for plural. Types are the distinct words in a text, whereas tokens are all the words, including repeats.\nMore examplesFewer examplesA sample of language cannot contain more distinct words (types) than the total words it contains (tokens).The lexical diversity of a text or its type-token ratio (TTR) is calculated by dividing the number of unique words (types) in a text by the total number of words (tokens).\nSMART Vocabulary: related words and phrases\nLinguistic terms & linguistic style\naccentual\naffricate\nallophone\nallophony\nanaphor\ncontextualize\ndowntoner\neasy read\nemphatic\nentailment\netymological\nidiomatic\ninflected language\nparatactically\nparataxis\nphilological\nphilologically\nphilology\npolysemy\nstylistics\nSee more results »\nSee also\nby the same token\nused to describe an action, an amount, etc. that is intended to represent something or to show that you are doing something, even if is very small or has a small effect: The troops in front of us either surrendered or offered only token (= not much) resistance. The company was bought by the government for a token 1p a share.\ndisapproving used to refer to something that is done to in order to appear to support, help, or represent a particular group of people, but that does not help that group of people in a lasting or important way: The truth is that they appoint no more than a token number of women to managerial jobs. When just one woman is on a company's board she may be dismissed as the token female. I felt like a token Black person on the committee. Related words\ntokenism\ntokenistic\ntokenize\ntokenization\nMore examplesFewer examplesHe lives with his parents and pays them a token rent of £50 a month.They were the only country to argue for even token recognition of the Baltic states' independence.It is easy to do token things to educate people, but to write a book and distribute it to so many schools makes a real impression.The newspaper hires a token Conservative columnist to give the appearance of balance.\nSMART Vocabulary: related words and phrases\nTypifying, illustrating and exemplifying\nanalogy\narchetypal\narchetypically\nbe someone all over idiom\nbetoken\ncharacterize\ninstance\ninstantiate\nmirror\nMr\nMrs\nstereotype\nsum\nsum (something/someone) up\nsummation\nsymbolic\nsymbolization\nsymptom\nterritory\ntranslate\nSee more results »\ntoken noun [C]\n(SYMBOL)\nAdd to word list\nAdd to word list\nsomething you give to someone or do for someone to express your feelings or intentions: It isn’t a big present – it’s just a token of thanks for your help.\ntoken noun [C]\n(DISK)\na round, metal or plastic disk which is used instead of money in some machines: subway tokens\ntoken adjective [not gradable]\n(SYMBOL)\nsmall or limited but having a symbolic importance: a token fee a token gesture of goodwill\nAdd to word list\nAdd to word list\nMONEY a round piece of metal or plastic that is used instead of money in some machines, for example, to get food or drink out of a vending machine, use a car park, etc: You'll need some tokens for the coffee machine.\nMARKETING a piece of paper that is given when you buy a particular product, which can be exchanged for something when you have collected enough of them: There is a promotion on the cereal box offering a free toy for every 10 tokens you collect.\nformal an action that you take or a thing that you give that is a symbol of your feelings about something, even though it may not be very big or valuable: a token of sth Please accept this gift as a token of our gratitude.\nSee also\nbook token\ngift token\ndisapproving done or existing only to show that you are following rules or doing what is expected, even though the results are limited: The wording of the advertisement was merely a token gesture towards equal opportunities. She was appointed as the token woman on the board\nused to describe a payment that is very small: a token sum/payment There is a token charge for membership of the staff club."}