{"id":365503,"name":"tokenism","type":"noun","us_sound":"ˈtoʊ.kən.ɪ.zəm","us_link":"../audio/t/ustobag015.mp3","uk_sound":"ˈtəʊ.kən.ɪ.zəm","uk_link":"../audio/t/uktobyj029.mp3","content":"Add to word list\nAdd to word list\nsomething that a person or organization does that seems to support or help a group of people who are treated unfairly in society, such as giving a member of that group an important or public position, but which is not meant to make changes that would help that group of people in a lasting way: She avoided accusations of tokenism by appointing several women to prominent positions in the party. The use of gay supporting characters in Hollywood films has been criticised as mere tokenism. The government talks tough about improving the diet of schoolchildren, but the measures taken smack of tokenism. Related words\ntoken adjective\ntokenistic disapproving\nMore examplesFewer examplesCommunity groups feel that the consultation smacks of tokenism and lip service, and say that they have contributed ideas only to have decisions made that ignore them.There’s a lot of tokenism involved that only serves to make the people implementing the policies feel better about themselves.These sorts of social engagement don’t need to be a form of feel-good tokenism whereby the privileged make a few charitable gestures before moving on with their lives.\nSMART Vocabulary: related words and phrases\nUnfairness and favouring someone unfairly\nableism\nableist\nagism\nagist\nAnglocentric\ndiscrimination\ndiscriminative\ndiscriminatorily\ndiscriminatory\ndrumhead\none-sided\none-sidedly\none-sidedness\nthe old school tie\nthe old-boy network idiom\ntwo-tier\nunbalance\nunequal\nunequally\nuneven\nSee more results »\nYou can also find related words, phrases, and synonyms in the topics:\nAffected & insincere\nAdd to word list\nAdd to word list\nthe fact of doing something only to show that you are following rules or doing what is expected or seen to be fair, and not because you really believe it is the right thing to do: We were accused of tokenism when we appointed the first woman to our management board. Of course we should revise our recruitment policies, but we should guard against tokenism."}